{
    "term": "aboard",
    "meanings": [
        {
            "definition": "On or onto a ship, aircraft, or other vehicle.",
            "pos": "preposition",
            "sent1": "The sailors climbed aboard the ship.",
            "sent2": "Passengers must be aboard the plane before takeoff.",
            "sent3": "The penguins waddled aboard the boat for a chilly adventure.",
            "sent4": "Her ideas were aboard the rocket ship of innovation.",
            "sent5": "The waves crashed against the hull as the pirates came aboard."
        },
        {
            "definition": "On or onto a train, bus, or other public transportation.",
            "pos": "preposition",
            "sent1": "The commuters rushed aboard the crowded train.",
            "sent2": "Please have your ticket ready when you come aboard the bus.",
            "sent3": "The clown juggled aboard the moving bus, much to the passengers' delight.",
            "sent4": "His thoughts were aboard the express train of progress.",
            "sent5": "The wheels clacked rhythmically as the passengers came aboard the subway."
        },
        {
            "definition": "On or onto a horse or other animal for riding.",
            "pos": "preposition",
            "sent1": "She gracefully mounted aboard the majestic stallion.",
            "sent2": "The cowboy swung aboard his trusty steed.",
            "sent3": "The cat comically tried to jump aboard the dog's back.",
            "sent4": "His dreams rode aboard the wild mustang of imagination.",
            "sent5": "The wind whipped past as she galloped aboard the spirited mare."
        },
        {
            "definition": "On or onto a team or group.",
            "pos": "preposition",
            "sent1": "The new player came aboard the soccer team with enthusiasm.",
            "sent2": "Everyone needs to be aboard the project for it to succeed.",
            "sent3": "The students eagerly jumped aboard the science club.",
            "sent4": "Their hopes sailed aboard the winning team of unity.",
            "sent5": "Laughter echoed as she joined aboard the comedy troupe."
        },
        {
            "definition": "On or onto a project or plan.",
            "pos": "preposition",
            "sent1": "The team brainstormed ideas to get aboard the new initiative.",
            "sent2": "We need everyone aboard the renovation project.",
            "sent3": "The cat hilariously tried to climb aboard the blueprint.",
            "sent4": "Her determination was aboard the mission to Mars.",
            "sent5": "Excitement buzzed as they all got aboard the grand scheme."
        }
    ]
}