{
    "term": "aborting",
    "meanings": [
        {
            "definition": "To bring to a premature end because of a problem or fault.",
            "pos": "verb",
            "sent1": "She was aborting the mission due to bad weather conditions.",
            "sent2": "The chef decided to abort the recipe when he realized he was missing a key ingredient.",
            "sent3": "The magician was aborting his disappearing act halfway through, leaving the audience puzzled.",
            "sent4": "The teacher had to abort the experiment when the chemicals reacted unexpectedly.",
            "sent5": "The team captain made the tough call to abort the game due to the unsafe field conditions."
        },
        {
            "definition": "To stop a process or activity before it is completed.",
            "pos": "verb",
            "sent1": "The computer program was aborting the download because of a poor internet connection.",
            "sent2": "She had to abort her workout early due to a sudden muscle cramp.",
            "sent3": "The kids were aborting their game of tag to go get some ice cream.",
            "sent4": "The company decided to abort the project halfway through due to budget constraints.",
            "sent5": "He had to quickly abort the phone call when his boss walked into the room."
        },
        {
            "definition": "To terminate a pregnancy before the fetus is viable.",
            "pos": "verb",
            "sent1": "The doctor was aborting the pregnancy to protect the mother's health.",
            "sent2": "She made the difficult decision to abort the pregnancy after consulting with her partner.",
            "sent3": "The couple was aborting their vacation plans due to unexpected news.",
            "sent4": "The young woman chose to abort the pregnancy after careful consideration.",
            "sent5": "The clinic offered counseling services for those considering aborting a pregnancy."
        }
    ]
}