{
    "term": "abos",
    "meanings": [
        {
            "definition": "Aboriginal Australians",
            "pos": "noun",
            "sent1": "The abos have a rich history and connection to the land.",
            "sent2": "Many abos live in remote communities across Australia.",
            "sent3": "Why did the abos bring a boomerang to the party? To have a good time!",
            "sent4": "The abos' deep spiritual connection to nature is truly inspiring.",
            "sent5": "The abos' traditional art reflects their deep cultural roots."
        },
        {
            "definition": "Aboriginals",
            "pos": "noun",
            "sent1": "The abos have a strong sense of community.",
            "sent2": "Abos have unique traditions passed down through generations.",
            "sent3": "What did the abos say to the kangaroo? Hoppy to meet you!",
            "sent4": "The abos' resilience in the face of adversity is remarkable.",
            "sent5": "The abos' music is a beautiful expression of their heritage."
        },
        {
            "definition": "Aboriginal people",
            "pos": "noun",
            "sent1": "Abos have a deep connection to the land they call home.",
            "sent2": "The abos' traditional dances are a celebration of their culture.",
            "sent3": "Why did the abos go to the beach? To catch some waves!",
            "sent4": "The abos' stories are like windows into their history.",
            "sent5": "The abos' knowledge of the land is passed down through generations."
        },
        {
            "definition": "Aboriginal culture",
            "pos": "noun",
            "sent1": "The abos' art is a vibrant reflection of their culture.",
            "sent2": "Abos have a rich oral tradition that preserves their history.",
            "sent3": "What did the abos use to cook? A boomerang-pan!",
            "sent4": "The abos' cultural practices are deeply rooted in tradition.",
            "sent5": "The abos' ceremonies are a beautiful display of their cultural heritage."
        },
        {
            "definition": "Aboriginal languages",
            "pos": "noun",
            "sent1": "Abos speak a variety of unique languages.",
            "sent2": "Learning abos' languages can help bridge cultural gaps.",
            "sent3": "Why did the abos bring a dictionary to the party? To spell out the fun!",
            "sent4": "The abos' languages are a key part of their identity.",
            "sent5": "The abos' languages are a treasure trove of knowledge and history."
        }
    ]
}