{
    "term": "aboves",
    "meanings": [
        {
            "definition": "Situated higher in position; above.",
            "pos": "adjective",
            "sent1": "The shelf for the aboves books is too high for me to reach.",
            "sent2": "The aboves floor is cleaner than the one below.",
            "sent3": "The aboves bunk bed is so high, it feels like sleeping in the clouds.",
            "sent4": "Her aboves score in the game made her the clear winner.",
            "sent5": "The aboves mountain peak was shrouded in mist, creating a mystical sight."
        },
        {
            "definition": "In a higher place or position.",
            "pos": "adverb",
            "sent1": "She placed the vase aboves the table to keep it safe.",
            "sent2": "The bird flew aboves the trees, searching for its nest.",
            "sent3": "The cat climbed aboves the roof and refused to come down.",
            "sent4": "His grades soared aboves his classmates, earning him a scholarship.",
            "sent5": "The kite soared aboves the park, dancing in the wind."
        },
        {
            "definition": "More than; in excess of.",
            "pos": "adverb",
            "sent1": "She ate aboves her usual portion of cake at the party.",
            "sent2": "The river flooded, reaching aboves its banks.",
            "sent3": "The children's laughter echoed aboves the noise of the playground.",
            "sent4": "His excitement bubbled aboves as he opened the gift.",
            "sent5": "The colors of the sunset painted the sky aboves, creating a breathtaking view."
        },
        {
            "definition": "Earlier in order; higher in a hierarchy.",
            "pos": "adjective",
            "sent1": "The aboves chapters of the book were more engaging than the later ones.",
            "sent2": "The aboves levels of management made the important decisions.",
            "sent3": "The aboves members of the team were the most experienced.",
            "sent4": "Her aboves position in the company gave her authority over others.",
            "sent5": "The aboves generations of the family passed down their traditions with pride."
        }
    ]
}