{
    "term": "abradants",
    "meanings": [
        {
            "definition": "Abradants: substances used to wear down or polish a surface",
            "pos": "noun",
            "sent1": "The jeweler used abradants to make the silver bracelet shiny.",
            "sent2": "The car mechanic applied abradants to smooth out the rough edges of the metal.",
            "sent3": "The mischievous cat knocked over the box of abradants, creating a glittery mess.",
            "sent4": "Time can be like abradants, slowly eroding away the sharpness of memories.",
            "sent5": "The sculptor's hands expertly wielded the abradants, transforming the rough stone into a masterpiece."
        },
        {
            "definition": "Abradants: materials that cause abrasion or friction",
            "pos": "noun",
            "sent1": "The sandpaper and steel wool are common abradants used in woodworking.",
            "sent2": "The rough rocks acted as natural abradants, smoothing the river pebbles over time.",
            "sent3": "The playground became a battleground of laughter and abradants during recess.",
            "sent4": "His harsh words were like emotional abradants, causing friction in their relationship.",
            "sent5": "The constant rubbing of the abradants against the metal created a shiny finish."
        },
        {
            "definition": "Abradants: agents that scrape or rub against a surface",
            "pos": "noun",
            "sent1": "The cleaning sponge served as an effective abradant for removing stubborn stains.",
            "sent2": "The glacier's movement acted as a natural abradant, carving valleys into the mountainside.",
            "sent3": "The mischievous child used the cat's tail as an unintentional abradant while playing.",
            "sent4": "The harsh winds acted as invisible abradants, slowly shaping the sand dunes.",
            "sent5": "The artist's brush danced across the canvas like a gentle abradant, creating delicate strokes."
        }
    ]
}