{
    "term": "absorbingly",
    "meanings": [
        {
            "definition": "In a way that holds one's attention or interest completely.",
            "pos": "adverb",
            "sent1": "She listened absorbingly to the story, not wanting to miss a single detail.",
            "sent2": "The book was so absorbingly written that she finished it in one sitting.",
            "sent3": "The movie was so absorbingly captivating that she forgot to eat her popcorn.",
            "sent4": "The mystery of the old house absorbed her thoughts absorbingly, like a sponge soaking up water.",
            "sent5": "The professor's lecture was delivered so absorbingly that the students were on the edge of their seats."
        },
        {
            "definition": "In a way that takes in or soaks up something.",
            "pos": "adverb",
            "sent1": "The sponge absorbedly soaked up all the spilled water on the kitchen counter.",
            "sent2": "The dry soil absorbingly drank up the rainwater, quenching its thirst.",
            "sent3": "The paper towel absorbedly mopped up the spilled juice, saving the day.",
            "sent4": "The thirsty plant absorbedly drank in the sunlight, growing taller and stronger.",
            "sent5": "The towel absorbedly dried the wet dishes, leaving them sparkling clean."
        },
        {
            "definition": "In a way that consumes or engrosses completely.",
            "pos": "adverb",
            "sent1": "The thrilling movie absorbedly consumed her attention, making her forget about everything else.",
            "sent2": "The intense video game absorbedly engrossed him for hours on end.",
            "sent3": "The delicious aroma of the baking cookies absorbedly filled the entire house.",
            "sent4": "The breathtaking view from the mountaintop absorbedly captivated her senses.",
            "sent5": "The fascinating documentary absorbedly occupied her mind, leaving her with new knowledge."
        }
    ]
}