{
    "term": "abstractionism",
    "meanings": [
        {
            "definition": "The practice or theory of creating abstract art.",
            "pos": "noun",
            "sent1": "In abstractionism, artists focus on shapes and colors rather than realistic images.",
            "sent2": "Many famous painters are known for their abstractionism in art.",
            "sent3": "At the art gallery, the abstractionism of the paintings made me feel like I was in a dream.",
            "sent4": "Her mind was a canvas, filled with the vibrant colors of abstractionism.",
            "sent5": "The beauty of abstractionism lies in its ability to evoke emotions without clear representations."
        },
        {
            "definition": "The belief in or practice of abstract thinking.",
            "pos": "noun",
            "sent1": "His abstractionism led him to contemplate complex ideas beyond the surface.",
            "sent2": "In philosophy, abstractionism plays a crucial role in understanding deeper concepts.",
            "sent3": "During the debate, his abstractionism made his arguments difficult to follow.",
            "sent4": "Her mind was a universe of thoughts, swirling with the stars of abstractionism.",
            "sent5": "The power of abstractionism lies in its ability to simplify complex notions into basic principles."
        },
        {
            "definition": "The state of being abstracted or abstract.",
            "pos": "noun",
            "sent1": "Her abstractionism during the lecture caused her to miss important points.",
            "sent2": "The professor's abstractionism made it hard for the students to grasp the lesson.",
            "sent3": "Lost in her abstractionism, she walked right past her destination.",
            "sent4": "In the fog of abstractionism, reality seemed distant and intangible.",
            "sent5": "The abstractionism of his thoughts made it challenging to focus on practical matters."
        }
    ]
}