{
    "term": "abstractional",
    "meanings": [
        {
            "definition": "Relating to or involving abstraction.",
            "pos": "adjective",
            "sent1": "The artist created an abstractional painting that only used shapes and colors.",
            "sent2": "Her writing style is very abstractional, focusing more on ideas than concrete details.",
            "sent3": "The abstractional concept of time travel in the movie made everyone scratch their heads.",
            "sent4": "His mind worked in an abstractional way, seeing patterns where others saw chaos.",
            "sent5": "The teacher used an abstractional example to explain complex math concepts to the students."
        },
        {
            "definition": "Characterized by abstraction.",
            "pos": "adjective",
            "sent1": "The company's approach to problem-solving was highly abstractional, always looking at the bigger picture.",
            "sent2": "The philosopher's theories were too abstractional for most people to understand easily.",
            "sent3": "The abstractional nature of the puzzle game made it both challenging and fun to play.",
            "sent4": "Her speech was so abstractional that it felt like listening to poetry rather than a lecture.",
            "sent5": "The artist's work was deeply abstractional, leaving viewers to interpret its meaning in their own way."
        },
        {
            "definition": "Involving the process of abstraction.",
            "pos": "adjective",
            "sent1": "The abstractional method used in coding simplified complex algorithms.",
            "sent2": "The scientist's research was highly abstractional, focusing on theoretical models.",
            "sent3": "The abstractional approach to problem-solving led to innovative solutions.",
            "sent4": "Her abstractional thinking allowed her to see connections others missed.",
            "sent5": "The abstractional nature of the project required a creative and analytical mindset to complete."
        }
    ]
}