{
    "term": "acanthous",
    "meanings": [
        {
            "definition": "Having leaf or floral decorations resembling the acanthus plant.",
            "pos": "adjective",
            "sent1": "The acanthous patterns on the curtains added a touch of nature to the room.",
            "sent2": "The artist painted an acanthous design on the vase, making it look elegant.",
            "sent3": "The acanthous wallpaper made the room feel like a garden, but without the bugs.",
            "sent4": "Her dress flowed around her like acanthous vines, creating a graceful silhouette.",
            "sent5": "The acanthous carvings on the wooden frame made it stand out among the plain ones."
        },
        {
            "definition": "Of or relating to the acanthus plant.",
            "pos": "adjective",
            "sent1": "The acanthous leaves were used in the traditional medicine of the region.",
            "sent2": "The garden was filled with acanthous plants, each one carefully tended.",
            "sent3": "She joked that her acanthous salad would make anyone feel like a Greek god.",
            "sent4": "The acanthous roots spread deep into the soil, anchoring the plant firmly.",
            "sent5": "The acanthous aroma of the flowers filled the air with a sweet fragrance."
        },
        {
            "definition": "Resembling the acanthus plant in form or appearance.",
            "pos": "adjective",
            "sent1": "The acanthous columns of the building gave it a classical and majestic look.",
            "sent2": "The acanthous carvings on the furniture were intricate and beautiful.",
            "sent3": "The cake decorator tried to make the frosting look acanthous, but it ended up looking spiky.",
            "sent4": "Her hair was styled in an acanthous bun, inspired by ancient Greek sculptures.",
            "sent5": "The acanthous shadows of the trees danced on the ground in the afternoon sun."
        }
    ]
}