{
    "term": "accelerators",
    "meanings": [
        {
            "definition": "A person or thing that accelerates.",
            "pos": "noun",
            "sent1": "The coach was the team's accelerators, pushing them to run faster.",
            "sent2": "The car's accelerator was pressed to reach top speed on the highway.",
            "sent3": "The rocket ship had an accelerator named Speedy who loved zooming through space.",
            "sent4": "Her encouragement acted as an accelerator, propelling him towards his goals.",
            "sent5": "The accelerator pedal on the bike made it zoom down the hill like a rocket."
        },
        {
            "definition": "A device, typically a pedal, that increases the speed of a vehicle.",
            "pos": "noun",
            "sent1": "He pressed the accelerator to make the car go faster.",
            "sent2": "The driver stepped on the accelerator to race ahead of the competition.",
            "sent3": "The accelerator pedal was like a magic button that made the car zoom forward.",
            "sent4": "The accelerator was a rocket booster, propelling the car down the track.",
            "sent5": "With a push of the accelerator, the car shot forward like a speeding bullet."
        },
        {
            "definition": "A substance that speeds up a chemical reaction.",
            "pos": "noun",
            "sent1": "Adding the accelerator to the mixture made the reaction happen faster.",
            "sent2": "The scientist used the accelerator to quicken the experiment.",
            "sent3": "The chemical accelerator was like a turbo boost for the reaction.",
            "sent4": "The accelerator was a catalyst, sparking the reaction into action.",
            "sent5": "The accelerator turned the slow reaction into a rapid explosion."
        },
        {
            "definition": "A key on a computer keyboard that speeds up the rate at which characters appear on the screen.",
            "pos": "noun",
            "sent1": "Pressing the accelerator key made the text scroll faster on the screen.",
            "sent2": "She used the accelerator key to speed up her typing during the test.",
            "sent3": "The accelerator key was like a turbocharger for typing speed.",
            "sent4": "The accelerator key was a shortcut to lightning-fast typing.",
            "sent5": "With the accelerator key, her words flew onto the screen in a blur."
        }
    ]
}