{
    "term": "accrual",
    "meanings": [
        {
            "definition": "The act of accumulating or increasing over time.",
            "pos": "noun",
            "sent1": "The slow accrual of dust on the old bookshelf was noticeable.",
            "sent2": "The accrual of knowledge through reading is essential for learning.",
            "sent3": "The comical accrual of socks in the laundry room made everyone laugh.",
            "sent4": "Her kindness had an accrual effect on everyone around her.",
            "sent5": "The steady accrual of savings in the piggy bank brought a sense of accomplishment."
        },
        {
            "definition": "The amount of money or benefits that have been earned but not yet received.",
            "pos": "noun",
            "sent1": "His paycheck included the accrual of overtime hours from last month.",
            "sent2": "The company's financial report showed a significant accrual of unpaid invoices.",
            "sent3": "The unexpected accrual of bonus points made her day even better.",
            "sent4": "The accrual of vacation days allowed him to plan a long-awaited trip.",
            "sent5": "The gradual accrual of interest in the savings account was a pleasant surprise."
        },
        {
            "definition": "The process of recording revenues and expenses as they are earned or incurred, regardless of when cash is exchanged.",
            "pos": "noun",
            "sent1": "Accrual accounting ensures the proper accrual of revenue for each period.",
            "sent2": "Understanding accrual accounting is crucial for accurate financial reporting.",
            "sent3": "The quirky accountant joked about the accrual of imaginary expenses.",
            "sent4": "The concept of accrual in accounting can be challenging for beginners.",
            "sent5": "Accrual-based accounting provides a more accurate reflection of a company's financial health."
        }
    ]
}