{
    "term": "accursedness",
    "meanings": [
        {
            "definition": "The state of being under a curse.",
            "pos": "noun",
            "sent1": "The accursedness of the old castle filled the villagers with fear.",
            "sent2": "The accursedness of the witch's spell was finally broken by a brave hero.",
            "sent3": "The children giggled at the accursedness of the pretend curse they placed on their friend.",
            "sent4": "The accursedness of the haunted house seemed to seep into every corner, chilling all who entered.",
            "sent5": "The accursedness of the ancient artifact was said to bring misfortune to anyone who possessed it."
        },
        {
            "definition": "The quality of being accursed.",
            "pos": "noun",
            "sent1": "The accursedness of the dark forest was palpable in the air.",
            "sent2": "The accursedness of the pirate's treasure was rumored to bring doom to those who sought it.",
            "sent3": "Despite the accursedness of the situation, the brave knight stood firm in the face of danger.",
            "sent4": "The accursedness of the stormy sea mirrored the turmoil in the sailor's heart.",
            "sent5": "The accursedness of the forbidden mountain warned travelers to stay away from its treacherous paths."
        },
        {
            "definition": "The condition of being cursed or damned.",
            "pos": "noun",
            "sent1": "The accursedness of the vampire's existence tormented him for centuries.",
            "sent2": "The accursedness of the ancient relic brought misfortune to all who possessed it.",
            "sent3": "The comedian joked about the accursedness of Mondays, bringing laughter to the audience.",
            "sent4": "The accursedness of the forbidden love affair led to tragedy for the star-crossed lovers.",
            "sent5": "The accursedness of the ghost's haunting left a chill in the air wherever it appeared."
        }
    ]
}