{
    "term": "ace",
    "meanings": [
        {
            "definition": "A playing card with a single spot.",
            "pos": "noun",
            "sent1": "In the game, the ace is the most important card.",
            "sent2": "I need an ace to complete my winning hand in poker.",
            "sent3": "The ace looked lonely among the other cards.",
            "sent4": "She played her ace at just the right moment.",
            "sent5": "The ace stood out with its single spot."
        },
        {
            "definition": "A person who excels at a particular sport or activity.",
            "pos": "noun",
            "sent1": "He is an ace at basketball, always scoring the most points.",
            "sent2": "The team's ace pitcher led them to victory.",
            "sent3": "The ace athlete could do backflips effortlessly.",
            "sent4": "She's the ace of the swimming team, breaking records left and right.",
            "sent5": "Being an ace requires dedication and skill."
        },
        {
            "definition": "To score an ace in tennis.",
            "pos": "verb",
            "sent1": "She managed to ace her serve, winning the point.",
            "sent2": "He aced the match with a powerful serve.",
            "sent3": "The ball seemed to magically ace over the net.",
            "sent4": "Her opponent was surprised when she aced the game.",
            "sent5": "To ace in tennis takes practice and precision."
        },
        {
            "definition": "To perform extremely well in a test or exam.",
            "pos": "verb",
            "sent1": "She aced the math test, getting every question right.",
            "sent2": "He always aces his exams without much effort.",
            "sent3": "The student was thrilled to ace the difficult exam.",
            "sent4": "Her ability to ace exams impressed her classmates.",
            "sent5": "Acing the exam boosted her confidence."
        }
    ]
}