{
    "term": "acidosis",
    "meanings": [
        {
            "definition": "A condition characterized by an excess of acid in the body",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with acidosis after seeing high levels of acid in their body.",
            "sent2": "Severe acidosis can be a serious health concern if not treated promptly.",
            "sent3": "The acidosis in the body was like a sour surprise party that nobody wanted.",
            "sent4": "Her anxiety felt like acidosis slowly eating away at her happiness.",
            "sent5": "The acidosis in his body was a relentless enemy, attacking his health from within."
        },
        {
            "definition": "The process of becoming too acidic",
            "pos": "noun",
            "sent1": "Over time, the gradual acidosis of the solution changed its properties.",
            "sent2": "The acidosis of the soil was a result of years of pollution in the area.",
            "sent3": "The acidosis of the lemonade made it taste like a sour potion from a witch's cauldron.",
            "sent4": "The acidosis of the situation was like a slow burn, eroding trust between them.",
            "sent5": "The acidosis of his words left a bitter taste in her mouth, poisoning their relationship."
        },
        {
            "definition": "The state of having an abnormally low pH in the blood",
            "pos": "noun",
            "sent1": "The doctor monitored the patient closely due to the severe acidosis in their blood.",
            "sent2": "Acidosis in the blood can lead to various health complications if left untreated.",
            "sent3": "The acidosis in his blood was like a mischievous imp causing chaos in his body.",
            "sent4": "Her anger was like acidosis, turning her blood into a toxic brew of negativity.",
            "sent5": "The acidosis in his blood was a red flag, signaling the need for immediate medical attention."
        }
    ]
}