{
    "term": "acidurias",
    "meanings": [
        {
            "definition": "The presence of abnormal levels of acids in the urine.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with acidurias after analyzing the urine sample.",
            "sent2": "Acidurias can be detected through a simple urine test.",
            "sent3": "The acidurias in the urine made the lab technician raise an eyebrow.",
            "sent4": "Her urine was like a mysterious potion, revealing the hidden truth of acidurias.",
            "sent5": "The smell of acidurias in the urine lingered in the air, unmistakable and concerning."
        },
        {
            "definition": "A condition characterized by the accumulation of acids in the body.",
            "pos": "noun",
            "sent1": "The patient's symptoms pointed towards a serious case of acidurias affecting their body.",
            "sent2": "Living with acidurias can be challenging due to its impact on overall health.",
            "sent3": "Despite his best efforts, the acidurias in his body seemed determined to stay.",
            "sent4": "The weight of acidurias in his body felt like carrying a heavy burden every day.",
            "sent5": "The silent presence of acidurias in his body was a constant reminder of the struggle within."
        },
        {
            "definition": "The excessive excretion of acids in the urine.",
            "pos": "noun",
            "sent1": "The doctor explained that the acidurias in the urine indicated a potential kidney issue.",
            "sent2": "Excessive acidurias in the urine can lead to further health complications.",
            "sent3": "The amount of acidurias in the urine was so high, it surprised even the medical team.",
            "sent4": "Her body seemed to reject the excess acidurias, trying to rid itself of the unwelcome guests.",
            "sent5": "The stream of acidurias in the urine was like a warning sign of an underlying problem."
        }
    ]
}