{
    "term": "act",
    "meanings": [
        {
            "definition": "Perform a deed or action",
            "pos": "verb",
            "sent1": "She will act in the school play tomorrow.",
            "sent2": "I act responsibly by completing my homework on time.",
            "sent3": "The cat tried to act like a dog for fun.",
            "sent4": "His smile can act as a ray of sunshine on a gloomy day.",
            "sent5": "The firefighter's bravery in the face of danger will always act as an inspiration."
        },
        {
            "definition": "A single performance of a play or show",
            "pos": "noun",
            "sent1": "The school play had a great act by the lead actor.",
            "sent2": "The act received a standing ovation from the audience.",
            "sent3": "The act of the magician amazed everyone in the room.",
            "sent4": "Her kindness towards others is the main act of her character.",
            "sent5": "The act of kindness shown by the stranger left a lasting impact on me."
        },
        {
            "definition": "A formal written record of a decision made by a legislative body",
            "pos": "noun",
            "sent1": "The official act was signed by the president.",
            "sent2": "The act contains the details of the new law.",
            "sent3": "The act of Congress was carefully reviewed by the committee.",
            "sent4": "The act serves as a historical document of the government's decisions.",
            "sent5": "The act will be archived for future reference by researchers."
        },
        {
            "definition": "Pretend to be someone or something for entertainment purposes",
            "pos": "verb",
            "sent1": "Children love to act out their favorite characters.",
            "sent2": "I can act like a pirate during the costume party.",
            "sent3": "The comedian decided to act as a grumpy old man for the skit.",
            "sent4": "Her smile can act as a mask to hide her true feelings.",
            "sent5": "The actor's ability to act convincingly as different personalities is truly remarkable."
        }
    ]
}