{
    "term": "actinometer",
    "meanings": [
        {
            "definition": "An instrument for measuring the intensity of radiant energy, especially that of the sun.",
            "pos": "noun",
            "sent1": "The actinometer showed how strong the sunlight was today.",
            "sent2": "Scientists use an actinometer to measure the sun's energy.",
            "sent3": "The actinometer blushed when it realized how bright the sun was shining.",
            "sent4": "Her smile was like an actinometer, radiating warmth and brightness.",
            "sent5": "The actinometer beeped loudly, indicating the sun's powerful rays."
        },
        {
            "definition": "A device used to measure the heating power of electromagnetic radiation.",
            "pos": "noun",
            "sent1": "The actinometer displayed the heat levels of the radiation accurately.",
            "sent2": "Using an actinometer, they could determine the strength of the radiation's heat.",
            "sent3": "The actinometer felt like a superhero, measuring the heat power of the radiation.",
            "sent4": "Her words were like an actinometer, heating up the room with their intensity.",
            "sent5": "The actinometer glowed red, indicating the high heating power of the radiation."
        },
        {
            "definition": "A tool for determining the amount of ultraviolet radiation present in a given area.",
            "pos": "noun",
            "sent1": "The actinometer accurately measured the ultraviolet radiation in the room.",
            "sent2": "With the actinometer, they could assess the UV radiation levels easily.",
            "sent3": "The actinometer felt like a detective, uncovering the hidden UV radiation.",
            "sent4": "His eyes were like an actinometer, sensitive to the UV radiation around him.",
            "sent5": "The actinometer beeped rapidly, warning of high UV radiation levels nearby."
        }
    ]
}