{
    "term": "adjacency",
    "meanings": [
        {
            "definition": "The state of being adjacent or next to something else.",
            "pos": "noun",
            "sent1": "The adjacency of the two houses made it easy for the neighbors to chat over the fence.",
            "sent2": "The adjacency of the park to the school allowed for quick and easy access to outdoor activities.",
            "sent3": "The adjacency of the cat to the fishbowl led to a comical chase around the living room.",
            "sent4": "The adjacency of the mountains to the lake created a breathtaking view for all to enjoy.",
            "sent5": "The adjacency of the bus stop to the cafe made it convenient for commuters to grab a quick coffee."
        },
        {
            "definition": "The quality or condition of being adjacent.",
            "pos": "noun",
            "sent1": "The adjacency of the buildings was crucial for the city's urban planning.",
            "sent2": "The adjacency of the rooms in the house made it feel cozy and connected.",
            "sent3": "The adjacency of the ice cream shop to the gym was a tempting challenge for those trying to stay fit.",
            "sent4": "The adjacency of the colors in the painting created a harmonious and pleasing effect.",
            "sent5": "The adjacency of the playground to the schoolyard brought joy to the children during recess."
        },
        {
            "definition": "The act of being adjacent.",
            "pos": "noun",
            "sent1": "The adjacency of the cars in the parking lot made it difficult to find a spot.",
            "sent2": "The adjacency of the ingredients on the counter made cooking dinner a breeze.",
            "sent3": "The adjacency of the keys to the door saved time when rushing out in the morning.",
            "sent4": "The adjacency of the players on the field allowed for quick passes and teamwork.",
            "sent5": "The adjacency of the books on the shelf made it easy to find the one she was looking for."
        }
    ]
}