{
    "term": "administrative",
    "meanings": [
        {
            "definition": "Relating to the running of a business or organization.",
            "pos": "adjective",
            "sent1": "The administrative staff ensures the smooth operation of the company.",
            "sent2": "She handles administrative tasks like scheduling meetings and organizing files.",
            "sent3": "The administrative team had a pizza party to celebrate a successful week.",
            "sent4": "Her administrative skills are like the conductor of an orchestra, keeping everything in harmony.",
            "sent5": "The administrative duties require attention to detail and organization."
        },
        {
            "definition": "Of or relating to the management of a government or institution.",
            "pos": "adjective",
            "sent1": "The administrative decisions made by the government affect the entire country.",
            "sent2": "The university's administrative staff oversees student enrollment and academic programs.",
            "sent3": "The administrative rules seemed like a puzzle to solve for the new employee.",
            "sent4": "His administrative approach is like a chess player, always thinking several moves ahead.",
            "sent5": "The administrative structure of the organization is crucial for its success."
        },
        {
            "definition": "Responsible for carrying out tasks and duties within an organization.",
            "pos": "noun",
            "sent1": "The administrative handles employee payroll and benefits.",
            "sent2": "She is the administrative in charge of office supplies and inventory.",
            "sent3": "The administrative joked that they should get capes for all their hard work.",
            "sent4": "Being the administrative is like being the engine that keeps the company running smoothly.",
            "sent5": "The administrative's role requires efficiency and attention to detail."
        }
    ]
}