{
    "term": "adobe",
    "meanings": [
        {
            "definition": "A building material made from clay and straw",
            "pos": "noun",
            "sent1": "The house was constructed using adobe for its walls.",
            "sent2": "In the desert, many homes are built with adobe bricks.",
            "sent3": "The adobe walls kept the house cool in the scorching sun.",
            "sent4": "Her smile was as warm and comforting as the color of adobe.",
            "sent5": "The adobe material gave the building a rustic charm."
        },
        {
            "definition": "A type of brick or building block made from adobe",
            "pos": "noun",
            "sent1": "The workers stacked adobe bricks to build the wall.",
            "sent2": "The adobe blocks were sturdy and durable.",
            "sent3": "The adobe bricks looked like delicious brownies.",
            "sent4": "The adobe blocks formed a solid foundation for the house.",
            "sent5": "The adobe building blocks were easy to work with."
        },
        {
            "definition": "A style of architecture using adobe bricks",
            "pos": "noun",
            "sent1": "The adobe architecture of the house blended well with the surroundings.",
            "sent2": "The adobe style of building is common in the region.",
            "sent3": "The adobe design gave the house a unique flair.",
            "sent4": "The adobe architecture stood out among the modern buildings.",
            "sent5": "The adobe construction showcased traditional craftsmanship."
        },
        {
            "definition": "A color resembling the natural earth tones of adobe buildings",
            "pos": "noun",
            "sent1": "She painted her room in a lovely adobe shade.",
            "sent2": "The artist used adobe color to capture the essence of the landscape.",
            "sent3": "The adobe hue of the walls made the room feel cozy.",
            "sent4": "The adobe tone of the painting evoked a sense of warmth.",
            "sent5": "The adobe color of the curtains matched the furniture perfectly."
        }
    ]
}