{
    "term": "adorations",
    "meanings": [
        {
            "definition": "The act of adoring or worshiping.",
            "pos": "noun",
            "sent1": "Her adorations towards her favorite singer were evident in the way she hung posters all over her room.",
            "sent2": "The crowd's adorations for the famous actor were overwhelming as they cheered and clapped.",
            "sent3": "The puppy's adorations for its owner were so intense that it followed them everywhere, even to the bathroom.",
            "sent4": "The adorations of the fans created a halo of admiration around the celebrity.",
            "sent5": "The adorations of the children for their teacher were like a warm blanket on a cold day."
        },
        {
            "definition": "An expression of deep love or admiration.",
            "pos": "noun",
            "sent1": "She wrote him a letter full of adorations, expressing her feelings in every line.",
            "sent2": "His adorations for his grandmother were evident in the way he always listened to her stories with a smile.",
            "sent3": "The cat's adorations for its toy mouse were so intense that it carried it everywhere around the house.",
            "sent4": "The adorations in her eyes shone brighter than any diamond.",
            "sent5": "The adorations in his voice made her heart flutter with happiness."
        },
        {
            "definition": "The state of being adored or revered.",
            "pos": "noun",
            "sent1": "The queen's adorations by her people were a testament to her kindness and grace.",
            "sent2": "The adorations of the students for their teacher were shown through handmade cards and gifts.",
            "sent3": "The tree's adorations by the birds made it the most popular spot in the forest.",
            "sent4": "The adorations of the hero by the townspeople made him feel like he could conquer any challenge.",
            "sent5": "The adorations of the artwork by the critics elevated the artist to new heights of fame."
        }
    ]
}