{
    "term": "adown",
    "meanings": [
        {
            "definition": "In a downward direction.",
            "pos": "adverb",
            "sent1": "She slid adown the hill on her sled.",
            "sent2": "The rain poured adown from the dark clouds.",
            "sent3": "The cat tumbled adown the stairs in a comical manner.",
            "sent4": "His spirits sank adown like a stone in water.",
            "sent5": "The leaves fluttered adown from the tree like colorful rain."
        },
        {
            "definition": "Downward.",
            "pos": "adverb",
            "sent1": "The ball rolled adown the hill slowly.",
            "sent2": "The airplane descended adown towards the runway.",
            "sent3": "The water flowed adown the stream in a steady rhythm.",
            "sent4": "Her hair cascaded adown her shoulders like a waterfall.",
            "sent5": "The sun dipped adown below the horizon, painting the sky in hues of orange."
        },
        {
            "definition": "Down from.",
            "pos": "preposition",
            "sent1": "He climbed adown the ladder carefully.",
            "sent2": "The bird flew adown the tree to find its nest.",
            "sent3": "The squirrel scampered adown the trunk with an acorn in its mouth.",
            "sent4": "The spider crawled adown the wall towards its web.",
            "sent5": "The stream flowed adown the mountain, carving a path through the rocks."
        },
        {
            "definition": "Down.",
            "pos": "adverb",
            "sent1": "The temperature dropped adown as the night grew colder.",
            "sent2": "The kite soared adown after getting caught in a gust of wind.",
            "sent3": "The book fell adown from the shelf with a loud thud.",
            "sent4": "His voice echoed adown the empty hallway.",
            "sent5": "The snowflakes drifted adown gently, covering the ground in a blanket of white."
        }
    ]
}