{
    "term": "adry",
    "meanings": [
        {
            "definition": "Completely dry",
            "pos": "adjective",
            "sent1": "After the sun dried the clothes, they were left adry on the line.",
            "sent2": "The desert is known for its adry climate with little rainfall.",
            "sent3": "The sponge became adry after being left out in the sun for too long.",
            "sent4": "Her eyes were adry from crying all night.",
            "sent5": "The cracked earth was adry and barren under the scorching sun."
        },
        {
            "definition": "Lacking moisture",
            "pos": "adjective",
            "sent1": "The adry soil in the garden needed to be watered.",
            "sent2": "The air in the desert is extremely adry.",
            "sent3": "The adry towel was rough against her skin after the shower.",
            "sent4": "His lips were adry and cracked from the cold wind.",
            "sent5": "The adry climate of the region made it difficult for plants to grow."
        },
        {
            "definition": "Thirsty",
            "pos": "adjective",
            "sent1": "After playing outside, the kids were adry and asked for water.",
            "sent2": "The long hike left them feeling adry and in need of a drink.",
            "sent3": "The adry puppy lapped up the water eagerly from its bowl.",
            "sent4": "She felt adry after exercising and reached for her water bottle.",
            "sent5": "The adry throat made it hard for him to speak."
        },
        {
            "definition": "Without water",
            "pos": "adjective",
            "sent1": "The adry well provided no water for the village.",
            "sent2": "The adry riverbed showed no signs of life.",
            "sent3": "The adry fountain in the park was a reminder of the drought.",
            "sent4": "The adry canteen was of no use in the desert.",
            "sent5": "The adry land stretched out as far as the eye could see."
        }
    ]
}