{
    "term": "adulteries",
    "meanings": [
        {
            "definition": "voluntary sexual intercourse between a married person and someone other than their spouse",
            "pos": "noun",
            "sent1": "The town was shocked by the news of the adulteries committed by the mayor.",
            "sent2": "Adulteries can cause a lot of pain and heartbreak in a marriage.",
            "sent3": "In the soap opera, the scandalous adulteries led to a dramatic showdown at the family dinner.",
            "sent4": "The adulteries of corruption tainted the once pristine reputation of the company.",
            "sent5": "The movie portrayed the adulteries with such intensity that it left the audience in disbelief."
        },
        {
            "definition": "the action or practice of being unfaithful to a spouse",
            "pos": "noun",
            "sent1": "Betrayal and deceit are often associated with the act of adulteries.",
            "sent2": "She felt immense guilt after confessing her adulteries to her husband.",
            "sent3": "The comedy show humorously portrayed the consequences of adulteries in a lighthearted manner.",
            "sent4": "Her heart felt heavy with the weight of her secret adulteries.",
            "sent5": "The novel's plot twist revealed a web of secret adulteries among the characters."
        },
        {
            "definition": "the act of mixing something impure or inferior with something pure or genuine",
            "pos": "noun",
            "sent1": "The adulteries of fake gold in the jewelry market deceive many buyers.",
            "sent2": "The adulteries of lies in his speech made it hard to trust him.",
            "sent3": "The chef's accidental adulteries of salt in the dessert ruined the entire dish.",
            "sent4": "The adulteries of synthetic materials in the fabric compromised its quality.",
            "sent5": "The adulteries of artificial flavors in the drink masked its true taste."
        }
    ]
}