{
    "term": "adversariness",
    "meanings": [
        {
            "definition": "The quality or state of being adversarial.",
            "pos": "noun",
            "sent1": "Her adversariness in the debate was evident as she argued passionately against her opponent.",
            "sent2": "The adversariness between the two rival teams was intense during the championship game.",
            "sent3": "Despite their adversariness on the field, the players shared a friendly handshake after the match.",
            "sent4": "The adversariness in the courtroom was like a fierce battle of wits between the lawyers.",
            "sent5": "The adversariness of the chess match made it thrilling to watch."
        },
        {
            "definition": "The state of being in opposition or conflict.",
            "pos": "noun",
            "sent1": "The adversariness between the two political parties was evident during the election campaign.",
            "sent2": "The adversariness of their opinions led to a heated argument at the meeting.",
            "sent3": "Despite the adversariness of their views, they managed to find common ground on the issue.",
            "sent4": "The adversariness in the negotiation room made reaching a compromise challenging.",
            "sent5": "The adversariness in the classroom discussion created a lively debate."
        },
        {
            "definition": "Hostility or opposition.",
            "pos": "noun",
            "sent1": "The adversariness in the air was palpable as they entered the room.",
            "sent2": "His adversariness towards change made it difficult to implement new ideas.",
            "sent3": "Despite the adversariness of the situation, they tried to find a peaceful resolution.",
            "sent4": "The adversariness in her tone indicated she was not open to further discussion.",
            "sent5": "The adversariness of the weather made it challenging to enjoy the outdoor event."
        }
    ]
}