{
    "term": "adventurism",
    "meanings": [
        {
            "definition": "The practice of seeking out new and exciting experiences.",
            "pos": "noun",
            "sent1": "Her adventurism led her to explore hidden caves and climb tall mountains.",
            "sent2": "His love for adventurism took him on thrilling journeys around the world.",
            "sent3": "The group's adventurism in trying exotic foods sometimes resulted in funny mishaps.",
            "sent4": "In the game of life, her adventurism was the key to unlocking new levels of excitement.",
            "sent5": "The spirit of adventurism burned brightly in his eyes, urging him to discover the unknown."
        },
        {
            "definition": "A willingness to take risks or engage in daring activities.",
            "pos": "noun",
            "sent1": "Despite the dangers, his adventurism pushed him to skydive from great heights.",
            "sent2": "Her bold adventurism made her the star of the extreme sports community.",
            "sent3": "The group's adventurism in trying out a new roller coaster left them laughing and screaming.",
            "sent4": "His adventurism was like a flame that couldn't be extinguished, always seeking the next thrill.",
            "sent5": "The allure of adventurism whispered to him, tempting him to take the leap into the unknown."
        },
        {
            "definition": "The belief in or pursuit of adventurous or risky actions.",
            "pos": "noun",
            "sent1": "Their shared adventurism bonded them as they tackled challenges together.",
            "sent2": "The spirit of adventurism filled her heart with excitement for the unknown.",
            "sent3": "The team's adventurism in planning a surprise party for their boss was a success.",
            "sent4": "In the world of business, his adventurism set him apart as a risk-taker.",
            "sent5": "The town's reputation for adventurism attracted thrill-seekers from far and wide."
        }
    ]
}