{
    "term": "adversarinesses",
    "meanings": [
        {
            "definition": "The quality or state of being adversarial or hostile.",
            "pos": "noun",
            "sent1": "Her adversarinesses towards her classmates made it difficult to work together on group projects.",
            "sent2": "The adversarinesses between the two rival teams was evident in their fierce competition.",
            "sent3": "Despite their adversarinesses, they managed to find common ground and cooperate effectively.",
            "sent4": "The adversarinesses in the courtroom were like a storm brewing, ready to clash at any moment.",
            "sent5": "The adversarinesses in the air could be felt by everyone, creating a tense atmosphere."
        },
        {
            "definition": "The state of being in opposition or conflict.",
            "pos": "noun",
            "sent1": "The adversarinesses between the two political parties led to heated debates.",
            "sent2": "In times of adversarinesses, it is important to find peaceful resolutions.",
            "sent3": "Their constant adversarinesses over trivial matters amused their friends.",
            "sent4": "The adversarinesses in the workplace were like a barrier preventing collaboration.",
            "sent5": "The adversarinesses in their relationship created a constant sense of tension."
        },
        {
            "definition": "The condition of being an adversary or opponent.",
            "pos": "noun",
            "sent1": "He respected his opponent's adversarinesses on the field.",
            "sent2": "The adversarinesses in the chess match made it thrilling to watch.",
            "sent3": "Their adversarinesses in the game of tennis always ended with a friendly handshake.",
            "sent4": "The adversarinesses in the boxing ring were a display of skill and determination.",
            "sent5": "Her adversarinesses in the debate competition earned her a reputation for being formidable."
        }
    ]
}