{
    "term": "advocation",
    "meanings": [
        {
            "definition": "The act of advocating or supporting a cause or idea.",
            "pos": "noun",
            "sent1": "Her advocation for animal rights was well-known in the community.",
            "sent2": "His strong advocation for environmental protection earned him respect among his peers.",
            "sent3": "She took her advocation for recycling to a whole new level by creating art from discarded materials.",
            "sent4": "His advocation for equality was a beacon of hope in a world filled with discrimination.",
            "sent5": "The teacher's passionate advocation for education inspired her students to strive for success."
        },
        {
            "definition": "The act of pleading for or recommending something.",
            "pos": "noun",
            "sent1": "His advocation for a new playground at the park was met with enthusiasm by the community.",
            "sent2": "The lawyer's advocation for her client's innocence was evident in her compelling arguments.",
            "sent3": "His advocation for ice cream for dinner was quickly dismissed by his parents.",
            "sent4": "Her advocation for early bedtime was met with protests from her siblings.",
            "sent5": "The doctor's advocation for regular exercise was aimed at improving his patient's health."
        },
        {
            "definition": "The act of publicly supporting or recommending a particular cause or policy.",
            "pos": "noun",
            "sent1": "The celebrity's advocation for mental health awareness brought attention to an important issue.",
            "sent2": "The politician's advocation for affordable housing resonated with many voters.",
            "sent3": "His advocation for pizza Fridays at work was met with cheers from his colleagues.",
            "sent4": "Her advocation for a cleaner environment inspired others to join her in picking up litter.",
            "sent5": "The student council's advocation for longer lunch breaks was well-received by the student body."
        }
    ]
}