{
    "term": "advocacy",
    "meanings": [
        {
            "definition": "The act of supporting or recommending a particular cause or policy.",
            "pos": "noun",
            "sent1": "Her advocacy for animal rights led to positive changes in the community.",
            "sent2": "The organization's advocacy for affordable housing helped many families find homes.",
            "sent3": "Tom's advocacy for ice cream for breakfast was met with laughter by his friends.",
            "sent4": "Her advocacy for kindness was like a beacon of light in a world filled with negativity.",
            "sent5": "Through her passionate advocacy, she inspired others to join the cause."
        },
        {
            "definition": "The profession or work of advocating for others.",
            "pos": "noun",
            "sent1": "She dedicated her life to advocacy, fighting for the rights of the marginalized.",
            "sent2": "In her advocacy role, she represented those who couldn't speak for themselves.",
            "sent3": "The advocacy team's office was always filled with laughter and determination.",
            "sent4": "His advocacy work was a shield for the vulnerable, protecting them from harm.",
            "sent5": "The impact of her advocacy work resonated throughout the entire community."
        },
        {
            "definition": "The act of pleading or arguing in favor of something.",
            "pos": "noun",
            "sent1": "His passionate advocacy for renewable energy convinced many to make the switch.",
            "sent2": "During the debate, her advocacy for stricter laws on pollution was well-received.",
            "sent3": "The cat's advocacy for more treats was met with a playful eye-roll from its owner.",
            "sent4": "Her advocacy for love over hate was a powerful message in today's divisive world.",
            "sent5": "The advocacy for change echoed through the halls of the government building."
        }
    ]
}