{
    "term": "aegrotat",
    "meanings": [
        {
            "definition": "A certificate allowing a student to pass an examination despite illness.",
            "pos": "noun",
            "sent1": "The teacher gave the student an aegrotat for missing the test due to sickness.",
            "sent2": "She was relieved to receive an aegrotat after falling ill before the exam.",
            "sent3": "The aegrotat saved the student from failing the test because of being sick.",
            "sent4": "The aegrotat was like a golden ticket, granting passage through the exam despite illness.",
            "sent5": "The aegrotat was a lifeline, ensuring the student's academic progress despite health challenges."
        },
        {
            "definition": "To grant an aegrotat to a student.",
            "pos": "verb",
            "sent1": "The professor decided to aegrotat the student who missed the exam due to illness.",
            "sent2": "They aegrotated the student's absence from the test because of sickness.",
            "sent3": "The teacher aegrotated the student's situation, understanding the need for compassion.",
            "sent4": "To aegrotat a student is to show understanding and empathy towards their health struggles.",
            "sent5": "The decision to aegrotat the student's absence was a kind gesture of support and consideration."
        },
        {
            "definition": "The act of receiving an aegrotat.",
            "pos": "noun",
            "sent1": "Her face lit up with joy upon the aegrotat of passing the exam despite illness.",
            "sent2": "The aegrotat of success brought a sense of relief and accomplishment.",
            "sent3": "Receiving the aegrotat felt like a small victory in the face of adversity.",
            "sent4": "The aegrotat symbolized resilience and determination in overcoming obstacles.",
            "sent5": "The moment of receiving the aegrotat marked a triumph over challenges and setbacks."
        }
    ]
}