{
    "term": "aerobraking",
    "meanings": [
        {
            "definition": "The process of using a planet's atmosphere to slow down a spacecraft.",
            "pos": "noun",
            "sent1": "During aerobraking, the spacecraft uses the planet's atmosphere to decrease speed.",
            "sent2": "Scientists studied aerobraking to understand how to slow down spacecraft in space.",
            "sent3": "The spacecraft tried aerobraking but ended up going faster instead!",
            "sent4": "Her idea to use aerobraking in the project was like catching a gust of wind to stop.",
            "sent5": "Aerobraking is like a giant space parachute, gently slowing the spacecraft."
        },
        {
            "definition": "The act of reducing a spacecraft's velocity by utilizing atmospheric drag.",
            "pos": "noun",
            "sent1": "The spacecraft's speed decreased due to aerobraking from the atmospheric drag.",
            "sent2": "Aerobraking is a technique that helps spacecraft slow down by using air resistance.",
            "sent3": "The astronaut joked that aerobraking felt like hitting the brakes in space.",
            "sent4": "The concept of aerobraking is like surfing through the atmosphere to lose speed.",
            "sent5": "The spacecraft performed aerobraking, gracefully gliding through the atmosphere to decelerate."
        },
        {
            "definition": "A method of decelerating a spacecraft by utilizing aerodynamic forces.",
            "pos": "noun",
            "sent1": "Utilizing aerodynamic forces, aerobraking effectively slows down the spacecraft.",
            "sent2": "Aerobraking is a technique that harnesses aerodynamic forces to reduce speed.",
            "sent3": "The engineers marveled at how aerobraking made the spacecraft seem like a feather in the wind.",
            "sent4": "The idea of aerobraking is akin to a bird using its wings to brake mid-flight.",
            "sent5": "The spacecraft executed aerobraking, gracefully maneuvering through the air to decelerate."
        }
    ]
}