{
    "term": "aerobrakes",
    "meanings": [
        {
            "definition": "Aerobrakes: devices used to slow down a spacecraft by creating drag in the atmosphere.",
            "pos": "noun",
            "sent1": "The aerobrakes on the spaceship helped it slow down as it entered the Earth's atmosphere.",
            "sent2": "The engineers designed the aerobrakes to safely decelerate the spacecraft during reentry.",
            "sent3": "The aerobrakes decided to take a break after working hard to slow down the spaceship.",
            "sent4": "The aerobrakes were like giant hands reaching out to grab the air and slow the spacecraft.",
            "sent5": "The shiny aerobrakes gleamed as they extended, ready to do their job of slowing the spaceship down."
        },
        {
            "definition": "Aerobrakes: the action of using aerobrakes to decelerate a spacecraft during reentry.",
            "pos": "noun",
            "sent1": "During reentry, the aerobrakes played a crucial role in slowing down the spacecraft.",
            "sent2": "The pilot skillfully managed the aerobrakes to ensure a safe descent through the atmosphere.",
            "sent3": "The aerobrakes threw a surprise party for the spacecraft as it decelerated during reentry.",
            "sent4": "The aerobrakes danced gracefully in the air, gently reducing the spacecraft's speed.",
            "sent5": "The aerobrakes hummed a soothing tune as they worked to slow down the spacecraft during reentry."
        },
        {
            "definition": "Aerobrakes: the process of deploying aerobrakes to reduce speed in space travel.",
            "pos": "noun",
            "sent1": "The astronauts carefully initiated the aerobrakes to decrease the speed of their spacecraft.",
            "sent2": "Deploying the aerobrakes was a critical step in controlling the velocity of the spaceship.",
            "sent3": "The aerobrakes decided to take a detour before helping to reduce the speed of the spacecraft.",
            "sent4": "The aerobrakes unfurled like giant wings, gracefully slowing down the spaceship.",
            "sent5": "The crew watched in awe as the aerobrakes extended, effectively reducing the speed of their space travel."
        }
    ]
}