{
    "term": "affairs",
    "meanings": [
        {
            "definition": "Matters or events of a particular kind",
            "pos": "noun",
            "sent1": "The school affairs committee organized the annual talent show.",
            "sent2": "She handles all the household affairs, from bills to groceries.",
            "sent3": "The cat's affairs with the neighbor's dog always lead to chaos.",
            "sent4": "The affairs of nature unfold in a beautiful dance of seasons.",
            "sent5": "The affairs of justice must be handled with care and precision."
        },
        {
            "definition": "Business or concern",
            "pos": "noun",
            "sent1": "His family owns a small business affairs in the city.",
            "sent2": "The company's financial affairs are managed by a dedicated team.",
            "sent3": "The affair of the missing stapler became the talk of the office.",
            "sent4": "The affair of trade requires careful planning and strategy.",
            "sent5": "The affair of customer satisfaction is crucial for any successful business."
        },
        {
            "definition": "Romantic or sexual relationships",
            "pos": "noun",
            "sent1": "Their romantic affairs were the subject of gossip in the town.",
            "sent2": "She decided to focus on her career rather than her love affairs.",
            "sent3": "The affair between the two actors caused a stir in the media.",
            "sent4": "The affair of the heart can be both thrilling and challenging.",
            "sent5": "The affair of love knows no boundaries and can be unpredictable."
        },
        {
            "definition": "Transactions or dealings",
            "pos": "noun",
            "sent1": "The financial affairs of the company were audited annually.",
            "sent2": "He was involved in shady affairs that eventually led to his downfall.",
            "sent3": "The affair of buying a new car turned out to be a great decision.",
            "sent4": "The affair of negotiation requires skill and tact.",
            "sent5": "The affair of trade can be influenced by various economic factors."
        }
    ]
}