{
    "term": "affectation",
    "meanings": [
        {
            "definition": "Behavior, speech, or writing that is artificial and designed to impress.",
            "pos": "noun",
            "sent1": "Her constant use of big words was just an affectation to seem smarter.",
            "sent2": "His exaggerated accent was seen as an affectation by his friends.",
            "sent3": "She put on an affectation of British accent during the play, much to everyone's amusement.",
            "sent4": "His flashy jewelry was an affectation of wealth, hiding his true financial situation.",
            "sent5": "The politician's smile seemed like an affectation, lacking sincerity."
        },
        {
            "definition": "The act of pretending or putting on a false appearance.",
            "pos": "noun",
            "sent1": "Her sudden change in behavior was an affectation to avoid getting in trouble.",
            "sent2": "He maintained an air of confidence as an affectation to hide his nervousness.",
            "sent3": "His claim of being a secret agent was just an affectation to impress his date.",
            "sent4": "The magician's disappearing act was an affectation of magic, captivating the audience.",
            "sent5": "The child's pouting was an affectation to get attention from his parents."
        },
        {
            "definition": "A mannerism or habit that is not genuine or natural.",
            "pos": "noun",
            "sent1": "Her constant hair flipping was an affectation she picked up from a TV show.",
            "sent2": "He had a habit of adjusting his tie repeatedly, almost like an affectation.",
            "sent3": "His loud laughter was an affectation that made everyone smile.",
            "sent4": "The way she twirled her hair around her finger was an affectation that annoyed her classmates.",
            "sent5": "His habit of tapping his foot was an affectation that showed his impatience."
        }
    ]
}