{
    "term": "affectlessness",
    "meanings": [
        {
            "definition": "The state or quality of lacking emotion or feeling.",
            "pos": "noun",
            "sent1": "Her affectlessness made it hard to understand how she truly felt.",
            "sent2": "The character's affectlessness throughout the movie added to the mystery of their past.",
            "sent3": "At the comedy show, his affectlessness during the jokes made everyone wonder if he was even enjoying himself.",
            "sent4": "The painting's affectlessness seemed to mirror the artist's inner turmoil.",
            "sent5": "The teacher's affectlessness in the face of chaos left the students feeling lost and unsupported."
        },
        {
            "definition": "The act of showing no emotion or reaction.",
            "pos": "noun",
            "sent1": "His affectlessness in response to the news surprised everyone in the room.",
            "sent2": "The criminal's affectlessness during the trial unnerved the witnesses.",
            "sent3": "The puppy's affectlessness towards the loud noises was both amusing and concerning.",
            "sent4": "The politician's affectlessness in the face of criticism was like a shield against negativity.",
            "sent5": "The robot's affectlessness made it seem more like a machine than a living being."
        },
        {
            "definition": "The absence of emotional response or expression.",
            "pos": "noun",
            "sent1": "The patient's affectlessness worried the doctor, as it could indicate a serious condition.",
            "sent2": "In times of crisis, his affectlessness was mistaken for bravery by those around him.",
            "sent3": "The toddler's affectlessness towards the spilled ice cream was both surprising and hilarious.",
            "sent4": "The storm's affectlessness towards the landscape left a trail of destruction in its wake.",
            "sent5": "The actress's affectlessness on stage made the audience question the authenticity of her performance."
        }
    ]
}