{
    "term": "affectabilities",
    "meanings": [
        {
            "definition": "The capacity to be affected emotionally.",
            "pos": "noun",
            "sent1": "Her affectabilities were evident when she cried during sad movies.",
            "sent2": "His affectabilities were touched by the heartfelt letter from his friend.",
            "sent3": "The puppy's affectabilities were on full display as it wagged its tail happily.",
            "sent4": "The music had a way of reaching deep into her affectabilities and stirring up memories.",
            "sent5": "The painting's beauty resonated with her affectabilities, bringing tears to her eyes."
        },
        {
            "definition": "The susceptibility to emotional influence.",
            "pos": "noun",
            "sent1": "His affectabilities made him particularly sensitive to criticism.",
            "sent2": "Children often have high affectabilities and can be easily affected by their surroundings.",
            "sent3": "The comedian's jokes seemed to target his affectabilities, making him laugh uncontrollably.",
            "sent4": "The song's lyrics seemed to tap into her affectabilities, making her feel understood.",
            "sent5": "The movie's emotional scenes resonated with her affectabilities, making her cry."
        },
        {
            "definition": "The ability to be influenced or changed.",
            "pos": "noun",
            "sent1": "Her affectabilities allowed her to adapt easily to new environments.",
            "sent2": "The team's affectabilities were evident in how they adjusted their strategy based on feedback.",
            "sent3": "The plant's affectabilities were remarkable as it thrived in different climates.",
            "sent4": "His affectabilities were like clay, easily molded by the experiences he encountered.",
            "sent5": "The book had the power to shape her affectabilities and alter her perspective."
        }
    ]
}