{
    "term": "affliction",
    "meanings": [
        {
            "definition": "A state of pain, distress, or suffering.",
            "pos": "noun",
            "sent1": "Her constant affliction with headaches made it hard for her to focus in class.",
            "sent2": "The man's affliction with a broken leg prevented him from walking properly.",
            "sent3": "Despite his affliction with a fear of heights, he still climbed the ladder to fix the roof.",
            "sent4": "The affliction of loneliness weighed heavily on her heart, like a dark cloud blocking the sun.",
            "sent5": "The affliction of hunger gnawed at his stomach, reminding him to eat soon."
        },
        {
            "definition": "Something that causes pain or suffering.",
            "pos": "noun",
            "sent1": "Cancer is a terrible affliction that affects many people around the world.",
            "sent2": "Losing a loved one is a common affliction that everyone experiences at some point.",
            "sent3": "His sweet tooth was an affliction that led him to devour all the cookies in one sitting.",
            "sent4": "The affliction of a leaky roof caused constant worry for the homeowner.",
            "sent5": "The affliction of a flat tire on the highway left him stranded until help arrived."
        },
        {
            "definition": "The action of inflicting pain or suffering.",
            "pos": "noun",
            "sent1": "The infliction of punishment on the criminal was necessary for justice to be served.",
            "sent2": "The infliction of a harsh critique on her artwork made the artist feel discouraged.",
            "sent3": "His infliction of tickling on his little sister always made her burst into giggles.",
            "sent4": "The infliction of a sharp pain in his knee made him wince in discomfort.",
            "sent5": "The infliction of a strict deadline caused stress among the team members."
        }
    ]
}