{
    "term": "afire",
    "meanings": [
        {
            "definition": "On fire",
            "pos": "adjective",
            "sent1": "The campfire was afire, giving off warmth and light.",
            "sent2": "The house was afire, and the firefighters rushed to extinguish the flames.",
            "sent3": "The chef accidentally set the dishcloth afire while cooking, causing a small commotion.",
            "sent4": "Her passion for music was afire, burning brightly in her heart.",
            "sent5": "The forest was afire with autumn colors, creating a breathtaking sight."
        },
        {
            "definition": "In flames",
            "pos": "adverb",
            "sent1": "The building went up in flames, burning afire into the night sky.",
            "sent2": "The forest was afire, with trees blazing brightly in the distance.",
            "sent3": "The cake was afire with candles, ready for the birthday celebration.",
            "sent4": "The city was afire with excitement during the festival, lights and music filling the streets.",
            "sent5": "The volcano erupted, sending lava flowing afire down its slopes."
        },
        {
            "definition": "Burning",
            "pos": "adjective",
            "sent1": "The candles were afire, casting a warm glow around the room.",
            "sent2": "The fields were afire with the colors of sunset, painting the sky in hues of orange and pink.",
            "sent3": "The oven was afire with heat, ready to bake the delicious cookies.",
            "sent4": "His cheeks were afire with embarrassment, turning bright red.",
            "sent5": "The sun was setting, leaving the horizon afire with a fiery glow."
        },
        {
            "definition": "Aflame",
            "pos": "adjective",
            "sent1": "The forest was afire, with flames spreading rapidly through the dry trees.",
            "sent2": "The candles were afire, illuminating the room with a warm light.",
            "sent3": "The sky was afire with the colors of the setting sun, painting a beautiful evening scene.",
            "sent4": "Her eyes were afire with determination, ready to face any challenge.",
            "sent5": "The night sky was afire with stars, twinkling brightly above."
        }
    ]
}