{
    "term": "aflame",
    "meanings": [
        {
            "definition": "On fire",
            "pos": "adjective",
            "sent1": "The candle was aflame, casting a warm glow in the room.",
            "sent2": "The house was aflame with bright orange flames.",
            "sent3": "The campfire was aflame, making everyone gather around for warmth.",
            "sent4": "Her cheeks were aflame with embarrassment as she tripped in front of everyone.",
            "sent5": "The forest was aflame with the colors of autumn, a breathtaking sight."
        },
        {
            "definition": "In flames",
            "pos": "adverb",
            "sent1": "The building went aflame after the explosion.",
            "sent2": "The forest was aflame, spreading rapidly due to the dry conditions.",
            "sent3": "The cake went aflame in the oven, causing a smoke alarm frenzy.",
            "sent4": "The night sky was aflame with fireworks, lighting up the darkness.",
            "sent5": "The dragon breathed fire, leaving the village aflame in its wake."
        },
        {
            "definition": "Burning",
            "pos": "adjective",
            "sent1": "The toast was aflame in the toaster, filling the kitchen with smoke.",
            "sent2": "The fields were aflame with the controlled burn to prevent wildfires.",
            "sent3": "The spicy chili left his mouth aflame, reaching for a glass of milk.",
            "sent4": "The sun set, leaving the sky aflame with vibrant hues.",
            "sent5": "The candle burned aflame, illuminating the dark room."
        },
        {
            "definition": "Passionate or excited",
            "pos": "adjective",
            "sent1": "She was aflame with enthusiasm for the upcoming project.",
            "sent2": "The crowd was aflame with excitement as the band took the stage.",
            "sent3": "His speech left the audience aflame with motivation to make a change.",
            "sent4": "The children's faces were aflame with joy as they opened their presents.",
            "sent5": "Her eyes were aflame with determination to succeed against all odds."
        }
    ]
}