{
    "term": "after",
    "meanings": [
        {
            "definition": "Following in time; later.",
            "pos": "adjective",
            "sent1": "The after meeting was scheduled for tomorrow.",
            "sent2": "The after party will start once the concert ends.",
            "sent3": "The after cupcakes were a hit at the bake sale.",
            "sent4": "The after glow of the sunset painted the sky in hues of pink and orange.",
            "sent5": "The after school program offers tutoring for students."
        },
        {
            "definition": "In pursuit or quest of.",
            "pos": "preposition",
            "sent1": "The dog ran after the squirrel in the park.",
            "sent2": "She chased after the ice cream truck for a sweet treat.",
            "sent3": "The kids played tag, running after each other in the yard.",
            "sent4": "He followed after his dreams with determination and passion.",
            "sent5": "The detective went after the criminal to solve the case."
        },
        {
            "definition": "In allusion to; in imitation of.",
            "pos": "preposition",
            "sent1": "The painting was modeled after a famous artist's style.",
            "sent2": "Her fashion sense was inspired after her favorite celebrity.",
            "sent3": "The play was written after a classic Shakespearean tragedy.",
            "sent4": "The movie was made after the bestselling novel.",
            "sent5": "The recipe was recreated after a traditional family dish."
        },
        {
            "definition": "Subsequently; behind in place.",
            "pos": "adverb",
            "sent1": "She arrived shortly after the party started.",
            "sent2": "The bus arrived after we had already left the bus stop.",
            "sent3": "He ran after to catch up with his friends ahead.",
            "sent4": "The cat followed after, slowly making its way down the street.",
            "sent5": "The rain stopped after, leaving behind puddles on the sidewalk."
        }
    ]
}