{
    "term": "afterburners",
    "meanings": [
        {
            "definition": "An additional combustion device in a jet engine, used to increase thrust.",
            "pos": "noun",
            "sent1": "The afterburners on the jet engine help it go faster.",
            "sent2": "The pilot activated the afterburners for more speed during takeoff.",
            "sent3": "The afterburners in the engine made the plane zoom like a rocket.",
            "sent4": "With the afterburners engaged, the jet soared through the sky like a shooting star.",
            "sent5": "The afterburners roared to life, propelling the aircraft forward with incredible force."
        },
        {
            "definition": "A device that injects fuel into the exhaust stream of a jet engine to increase thrust.",
            "pos": "noun",
            "sent1": "The afterburners are crucial for boosting the jet engine's power.",
            "sent2": "The mechanic checked the afterburners before the flight for optimal performance.",
            "sent3": "The afterburners sprayed fuel into the engine's exhaust, creating a fiery display.",
            "sent4": "The afterburners turned the jet into a speed demon, leaving other planes behind.",
            "sent5": "The afterburners lit up the night sky as the aircraft accelerated rapidly."
        },
        {
            "definition": "The part of a jet engine that provides extra power for takeoff and high-speed flight.",
            "pos": "noun",
            "sent1": "Pilots rely on the afterburners for that extra push during takeoff.",
            "sent2": "The afterburners kicked in, giving the jet the boost it needed to climb higher.",
            "sent3": "The afterburners were like the jet engine's secret turbo button.",
            "sent4": "The afterburners transformed the aircraft into a speed machine, leaving a trail of smoke behind.",
            "sent5": "The afterburners roared to life, propelling the plane forward with incredible speed."
        }
    ]
}