{
    "term": "aggravations",
    "meanings": [
        {
            "definition": "The act of making a problem or situation worse.",
            "pos": "noun",
            "sent1": "Her constant complaints were just more aggravations for the already stressed team.",
            "sent2": "The constant noise outside was a major aggravation during the exam.",
            "sent3": "The way he kept interrupting her story with his own made for some aggravations but also some laughs.",
            "sent4": "The delays in the project were like aggravations piling up, making the situation feel impossible to handle.",
            "sent5": "The teacher's strict rules were like aggravations that kept adding up, overwhelming the students."
        },
        {
            "definition": "Annoyance or irritation.",
            "pos": "noun",
            "sent1": "The constant buzzing of the mosquito was a small aggravation during the peaceful picnic.",
            "sent2": "His constant tapping on the desk was an aggravation to everyone in the room.",
            "sent3": "The way she always forgot her keys was an aggravation, but it also made her friends chuckle.",
            "sent4": "The dripping faucet was like a persistent aggravation, slowly driving him crazy.",
            "sent5": "The scratchy tag on his shirt was a minor aggravation that bothered him all day."
        },
        {
            "definition": "Factors that make a situation more difficult or unpleasant.",
            "pos": "noun",
            "sent1": "The lack of clear instructions was one of the aggravations that led to the confusion.",
            "sent2": "The unexpected rain was an aggravation to their plans for a sunny day at the beach.",
            "sent3": "The way she always arrived late was an aggravation to her friends, but they still loved her.",
            "sent4": "The constant barking of the neighbor's dog was like aggravations that never seemed to end.",
            "sent5": "The broken air conditioner was an aggravation that made the hot summer days unbearable."
        }
    ]
}