{
    "term": "agitprop",
    "meanings": [
        {
            "definition": "Agitprop: political propaganda, especially in art or literature",
            "pos": "noun",
            "sent1": "The artist used agitprop to convey a powerful political message through their paintings.",
            "sent2": "The agitprop in the novel influenced readers' opinions on the government.",
            "sent3": "The children's book had a playful touch of agitprop, making learning about politics fun.",
            "sent4": "Her speech was like agitprop, stirring up emotions and sparking discussions.",
            "sent5": "The agitprop in the play was so impactful that it stayed with the audience long after the curtains closed."
        },
        {
            "definition": "Agitprop: a person who creates or disseminates political propaganda",
            "pos": "noun",
            "sent1": "The agitprop was known for their bold posters that spread political messages.",
            "sent2": "As an agitprop, she was skilled at crafting persuasive messages for the public.",
            "sent3": "The agitprop's witty social media posts always caught people's attention.",
            "sent4": "He was like an agitprop, always finding creative ways to share his political views.",
            "sent5": "The agitprop's speeches were so compelling that they attracted large crowds wherever they went."
        },
        {
            "definition": "Agitprop: to create or disseminate political propaganda",
            "pos": "verb",
            "sent1": "She would agitprop through her art, using it as a tool for activism.",
            "sent2": "The group decided to agitprop by distributing flyers in the neighborhood.",
            "sent3": "He would often agitprop by starting discussions on social issues at gatherings.",
            "sent4": "The organization aimed to agitprop through online campaigns and videos.",
            "sent5": "They planned to agitprop by organizing a protest to raise awareness about the cause."
        }
    ]
}