{
    "term": "agonal",
    "meanings": [
        {
            "definition": "Of or relating to the moment of death.",
            "pos": "adjective",
            "sent1": "The doctor noted the patient's agonal breathing as a sign of imminent passing.",
            "sent2": "The family gathered around the agonal patient, offering comfort in their final moments.",
            "sent3": "Despite the seriousness of the situation, the nurse couldn't help but find the agonal gasps oddly rhythmic.",
            "sent4": "As the sun set on the horizon, the old tree's leaves made an agonal rustling sound.",
            "sent5": "The image of the agonal scene was etched in his memory, haunting him for years to come."
        },
        {
            "definition": "Involving or accompanied by severe struggle or suffering.",
            "pos": "adjective",
            "sent1": "The agonal cries of the wounded soldier echoed through the battlefield.",
            "sent2": "The marathon runner's agonal sprint towards the finish line showed his determination.",
            "sent3": "Despite the agonal situation, the comedian managed to find humor in the chaos.",
            "sent4": "The agonal fight for survival in the wilderness tested their limits.",
            "sent5": "The agonal expression on her face revealed the depth of her pain and struggle."
        },
        {
            "definition": "Pertaining to the final stages of a disease or illness.",
            "pos": "adjective",
            "sent1": "The doctor recognized the agonal symptoms and knew the end was near.",
            "sent2": "The agonal phase of the illness brought both sadness and relief to the family.",
            "sent3": "In the agonal moments, the patient found peace and acceptance.",
            "sent4": "The agonal decline in health was a difficult reality for everyone to face.",
            "sent5": "The agonal silence in the room was broken only by the ticking of the clock."
        }
    ]
}