{
    "term": "agonism",
    "meanings": [
        {
            "definition": "The practice of engaging in competition or conflict",
            "pos": "noun",
            "sent1": "In the school's annual sports day, the students showed their agonism in the relay race.",
            "sent2": "The agonism between the two rival teams was evident in their fierce match.",
            "sent3": "The siblings' agonism over who gets the last cookie led to a funny cookie-crumb fight.",
            "sent4": "The agonism in the business world is like a battlefield where only the strongest survive.",
            "sent5": "The agonism in nature for limited resources is a constant struggle for survival."
        },
        {
            "definition": "The state of being in a state of conflict or competition",
            "pos": "noun",
            "sent1": "The agonism between the two countries escalated into a full-blown war.",
            "sent2": "The team's agonism was palpable as they fought for the championship title.",
            "sent3": "The agonism between the cat and the mouse ended with a playful chase around the house.",
            "sent4": "The agonism in the market was like a storm brewing, ready to unleash chaos.",
            "sent5": "The agonism in the classroom during the spelling bee was intense and nerve-wracking."
        },
        {
            "definition": "The belief in the importance of competition in human life",
            "pos": "noun",
            "sent1": "His agonism drove him to always strive for excellence in everything he did.",
            "sent2": "The coach instilled a sense of agonism in the team, pushing them to be their best.",
            "sent3": "The family's agonism for board game night made it a highly anticipated event each week.",
            "sent4": "Her agonism for success was like a fire burning within her, propelling her forward.",
            "sent5": "The agonism for academic achievement was evident in the students' dedication to their studies."
        }
    ]
}