{
    "term": "aikido",
    "meanings": [
        {
            "definition": "Aikido: a Japanese martial art that emphasizes blending with an opponent's movements and redirecting their energy",
            "pos": "noun",
            "sent1": "During aikido practice, students learn to blend with their partner's energy.",
            "sent2": "He has been studying aikido for many years and has become very skilled.",
            "sent3": "At the aikido class, the instructor joked that blending with a fly's movements could be a new technique.",
            "sent4": "Her approach to problem-solving was like aikido, always redirecting challenges into opportunities.",
            "sent5": "The aikido master's demonstration made the concept of blending and redirecting energy crystal clear."
        },
        {
            "definition": "Aikido: the practice or study of the martial art of aikido",
            "pos": "noun",
            "sent1": "She dedicated herself to aikido training every day after school.",
            "sent2": "The dojo offers classes for beginners interested in aikido.",
            "sent3": "His passion for aikido led him to dream of practicing it in space.",
            "sent4": "The art of aikido is like a puzzle that challenges both body and mind.",
            "sent5": "The book explained the history and philosophy behind the practice of aikido in simple terms."
        },
        {
            "definition": "Aikido: aikido techniques or movements practiced in a martial arts class",
            "pos": "noun",
            "sent1": "The sensei demonstrated a new aikido technique to the students.",
            "sent2": "Students paired up to practice aikido movements during the class.",
            "sent3": "In the aikido class, they tried to mimic the movements of a graceful swan.",
            "sent4": "The fluidity of aikido movements is like a dance with a partner.",
            "sent5": "The dojo echoed with the sounds of feet shuffling during aikido practice."
        }
    ]
}