{
    "term": "airlift",
    "meanings": [
        {
            "definition": "The transportation of goods or people by aircraft.",
            "pos": "noun",
            "sent1": "During the war, the soldiers organized an airlift to deliver supplies to the troops.",
            "sent2": "The humanitarian organization arranged an airlift to send aid to the disaster-stricken area.",
            "sent3": "The airlift of birthday presents to the remote village made the children very happy.",
            "sent4": "Her smile was like an airlift of joy that lifted everyone's spirits.",
            "sent5": "The successful airlift of medical supplies saved many lives in the remote region."
        },
        {
            "definition": "To transport goods or people by aircraft.",
            "pos": "verb",
            "sent1": "The rescue team had to airlift the injured hiker to safety from the mountain.",
            "sent2": "The company decided to airlift the new product to meet the urgent demand.",
            "sent3": "They had to airlift the giant cake for the party because it was too big for the car.",
            "sent4": "Her words seemed to airlift his spirits and bring a smile to his face.",
            "sent5": "The helicopter airlifted the stranded climbers to the base camp, saving them from the storm."
        },
        {
            "definition": "An operation to transport goods or people by aircraft.",
            "pos": "noun",
            "sent1": "The government launched an airlift to evacuate citizens from the conflict zone.",
            "sent2": "The airlift of supplies to the remote island was a challenging but successful mission.",
            "sent3": "The surprise airlift of ice cream to the school delighted all the students.",
            "sent4": "The airlift of hope brought a sense of relief to the stranded travelers.",
            "sent5": "The massive airlift of equipment was crucial for the construction project in the mountainous region."
        }
    ]
}