{
    "term": "airtrams",
    "meanings": [
        {
            "definition": "A system of transportation consisting of enclosed cabins suspended from cables and propelled by motors.",
            "pos": "noun",
            "sent1": "The airtrams glided smoothly through the sky, carrying people to the mountain top.",
            "sent2": "We took the airtrams to reach the ski resort at the peak of the mountain.",
            "sent3": "The airtrams seemed to be racing each other in the clouds, like a friendly competition.",
            "sent4": "Her dreams soared high like airtrams, reaching new heights of imagination.",
            "sent5": "The view from the airtrams was breathtaking, as if floating in a painting."
        },
        {
            "definition": "The act of riding in or operating an airtram.",
            "pos": "noun",
            "sent1": "The airtrams were full of excited tourists eager to experience the aerial journey.",
            "sent2": "She enjoyed the airtrams ride, feeling the wind in her hair as they ascended.",
            "sent3": "The airtrams ride felt like a magical adventure, soaring above the treetops.",
            "sent4": "In her mind, the airtrams ride symbolized freedom and exploration.",
            "sent5": "The children giggled with delight during the airtrams ride, their laughter echoing in the cabin."
        },
        {
            "definition": "A specific type of aerial lift used for transporting passengers or cargo.",
            "pos": "noun",
            "sent1": "The airtrams at the amusement park provided a bird's eye view of the entire area.",
            "sent2": "Cargo was efficiently transported using the airtrams, saving time and effort.",
            "sent3": "The airtrams for cargo looked like giant floating boxes in the sky, a unique sight.",
            "sent4": "The airtrams for passengers were like magic carpets, whisking them away to new destinations.",
            "sent5": "The airtrams for passengers offered a smooth and scenic ride, making travel enjoyable."
        }
    ]
}