{
    "term": "akin",
    "meanings": [
        {
            "definition": "Of similar character or related in some way.",
            "pos": "adjective",
            "sent1": "The two sisters had akin personalities, always laughing and joking together.",
            "sent2": "The twins had akin tastes in music, both enjoying classic rock.",
            "sent3": "It was as if their minds were akin, finishing each other's sentences effortlessly.",
            "sent4": "Their friendship was akin to a sturdy bridge, connecting them through thick and thin.",
            "sent5": "The bond between them was akin to a strong magnet, always drawing them back together."
        },
        {
            "definition": "Having similar qualities or characteristics.",
            "pos": "adjective",
            "sent1": "The two dogs were akin in size and color, often mistaken for each other.",
            "sent2": "Their paintings were akin in style, both using vibrant colors and bold strokes.",
            "sent3": "Their taste in fashion was so akin, they accidentally wore matching outfits to the party.",
            "sent4": "Their friendship was akin to a well-oiled machine, always working together seamlessly.",
            "sent5": "The harmony in their voices was akin to a beautiful symphony, blending perfectly in every song."
        },
        {
            "definition": "Related by blood.",
            "pos": "adjective",
            "sent1": "The cousins were akin through their shared family history and traditions.",
            "sent2": "The siblings were akin in appearance, both inheriting their father's blue eyes.",
            "sent3": "Their family reunion was akin to a lively circus, with everyone talking at once.",
            "sent4": "Their bond was akin to a strong oak tree, rooted deeply in their common ancestry.",
            "sent5": "The connection between them was akin to a flowing river, always running strong and deep."
        }
    ]
}