{
    "term": "alembic",
    "meanings": [
        {
            "definition": "A distilling apparatus used for purifying liquids.",
            "pos": "noun",
            "sent1": "The alchemist used an alembic to separate the pure liquid from the impurities.",
            "sent2": "The laboratory technician carefully operated the alembic to distill the water.",
            "sent3": "The alembic wore a tiny hat as it worked its magic on the liquid mixture.",
            "sent4": "Her mind was an alembic, distilling the chaos into clarity.",
            "sent5": "The alembic hummed softly as it transformed the liquid into a clear solution."
        },
        {
            "definition": "A vessel with a beaked cap used in distillation.",
            "pos": "noun",
            "sent1": "The ancient alchemist held the alembic steady as the liquid bubbled inside.",
            "sent2": "The alembic's beaked cap allowed for precise control of the distillation process.",
            "sent3": "The alembic and the beaker had a friendly competition to see who could distill faster.",
            "sent4": "Her words poured out of her like liquid from an alembic, refined and pure.",
            "sent5": "The alembic stood tall, its beaked cap gleaming in the sunlight as it worked its magic."
        },
        {
            "definition": "A distilling flask with a long neck and a beaked cap.",
            "pos": "noun",
            "sent1": "The chemist carefully poured the liquid into the alembic's long neck.",
            "sent2": "The alembic's beaked cap ensured that only the purest vapors condensed back into liquid form.",
            "sent3": "The alembic and the test tube had a race to see who could distill the liquid faster.",
            "sent4": "Her thoughts swirled in her mind like liquid in an alembic, slowly clarifying.",
            "sent5": "The alembic stood like a sentinel, guarding the purity of the distilled liquid within."
        }
    ]
}