{
    "term": "alexandrine",
    "meanings": [
        {
            "definition": "A line of poetic meter consisting of 12 syllables.",
            "pos": "noun",
            "sent1": "In the poem, the author used an alexandrine to express a deep emotion.",
            "sent2": "The poet crafted the alexandrine with care to maintain the rhythm of the verse.",
            "sent3": "The alexandrine in the poem danced gracefully among the shorter lines.",
            "sent4": "Her words flowed like an alexandrine river, carrying the reader along.",
            "sent5": "The alexandrine stood out in the poem like a shining star in the night sky."
        },
        {
            "definition": "A type of verse named after Alexander the Great.",
            "pos": "noun",
            "sent1": "The literary scholar discussed the significance of the alexandrine in ancient poetry.",
            "sent2": "Many epic poems from that era featured the alexandrine as a prominent form.",
            "sent3": "The students giggled when they learned about the alexandrine, imagining Alexander the Great writing poetry.",
            "sent4": "His verses were as powerful as an alexandrine, leaving a lasting impact on readers.",
            "sent5": "The alexandrine verse echoed through history like a trumpet announcing a king's arrival."
        },
        {
            "definition": "A type of parrot with a distinctive green plumage.",
            "pos": "noun",
            "sent1": "The zoo visitors were amazed by the colorful alexandrine perched on a branch.",
            "sent2": "The alexandrine parrot chirped happily in its enclosure, captivating the audience.",
            "sent3": "The mischievous children giggled as the alexandrine mimicked their laughter.",
            "sent4": "Her pet alexandrine was a vibrant splash of color in her otherwise dull room.",
            "sent5": "The alexandrine's green feathers shimmered in the sunlight, a sight to behold."
        }
    ]
}