{
    "term": "algarrobas",
    "meanings": [
        {
            "definition": "A type of tree that produces edible pods.",
            "pos": "noun",
            "sent1": "The algarrobas on the tree looked ripe and ready to be picked.",
            "sent2": "Farmers harvest algarrobas from the trees to sell at the market.",
            "sent3": "The squirrel mistook the algarrobas for acorns and tried to bury them in the ground.",
            "sent4": "Her laughter was like a rain of algarrobas, spreading joy to everyone around.",
            "sent5": "The sweet scent of algarrobas filled the air, enticing birds to come and feast."
        },
        {
            "definition": "The pods of the algarroba tree, used as animal feed or as a chocolate substitute.",
            "pos": "noun",
            "sent1": "The farmer fed the pigs with algarrobas to keep them healthy.",
            "sent2": "Some people enjoy using algarrobas in baking as a healthier alternative to chocolate.",
            "sent3": "The mischievous goat managed to sneak into the barn and devour all the algarrobas meant for the horses.",
            "sent4": "Her smile was as rich and comforting as a cup of hot cocoa made with algarrobas.",
            "sent5": "The children's faces lit up with delight as they tasted the delicious algarrobas for the first time."
        },
        {
            "definition": "A unit of weight in Spain, equal to about 11.5 kilograms.",
            "pos": "noun",
            "sent1": "The farmer sold a sack of algarrobas at the market.",
            "sent2": "She struggled to lift the heavy load of algarrobas onto the scale.",
            "sent3": "The mischievous children played a prank by replacing the flour with algarrobas in the kitchen.",
            "sent4": "The weight of responsibility felt like a ton of algarrobas on his shoulders.",
            "sent5": "The old scale creaked under the pressure of the algarrobas, showing the exact weight with each click."
        }
    ]
}