{
    "term": "algidities",
    "meanings": [
        {
            "definition": "The state or quality of being extremely cold or chilly.",
            "pos": "noun",
            "sent1": "The algidities of the frozen lake sent shivers down his spine.",
            "sent2": "She could feel the algidities of the winter wind biting at her cheeks.",
            "sent3": "Despite wearing a thick coat, the algidities of the ice cream headache made him wince.",
            "sent4": "The algidities of the abandoned house seemed to seep into his bones, giving him an eerie feeling.",
            "sent5": "The algidities of the snowstorm were so intense that even the trees seemed to shiver in response."
        },
        {
            "definition": "The act of becoming cold or frigid.",
            "pos": "noun",
            "sent1": "The algidities of the water as it froze over fascinated the young scientist.",
            "sent2": "The algidities of the room increased as the heater broke down.",
            "sent3": "The algidities of the popsicle melting in the sun made a sticky mess.",
            "sent4": "As the argument escalated, the algidities between them grew, creating a frosty atmosphere.",
            "sent5": "The algidities of their relationship chilled her heart, causing her to pull away."
        },
        {
            "definition": "A feeling of intense coldness.",
            "pos": "noun",
            "sent1": "The algidities of fear gripped her as she walked through the dark alley.",
            "sent2": "His hands trembled from the algidities of the icy water he had just touched.",
            "sent3": "The algidities of the horror movie made her jump in her seat.",
            "sent4": "The algidities of loneliness crept into his soul, making him long for companionship.",
            "sent5": "The algidities of the mountain air took her breath away, but she couldn't help but smile at the beauty around her."
        }
    ]
}