{
    "term": "alibi",
    "meanings": [
        {
            "definition": "An excuse or defense used to avoid blame or punishment.",
            "pos": "noun",
            "sent1": "She said her dog ate her homework as an alibi for not completing the assignment.",
            "sent2": "The suspect's alibi for missing the meeting was that he had car trouble.",
            "sent3": "His alibi of 'getting stuck in traffic' to explain his lateness was quite creative.",
            "sent4": "Using a headache as an alibi to skip the party felt like a weak excuse.",
            "sent5": "The alibi of 'having to help a friend' seemed suspicious to the teacher."
        },
        {
            "definition": "A claim or piece of evidence that proves a person was elsewhere at the time of a crime.",
            "pos": "noun",
            "sent1": "The security footage served as a strong alibi for the suspect's innocence.",
            "sent2": "His alibi of being at the library during the robbery was confirmed by the librarian.",
            "sent3": "The alibi of 'walking the dog' during the incident was a lucky coincidence.",
            "sent4": "Her presence at the concert was a solid alibi for her absence from the crime scene.",
            "sent5": "The alibi of 'visiting a relative' was supported by witness testimonies."
        },
        {
            "definition": "To provide an alibi for someone.",
            "pos": "verb",
            "sent1": "She decided to alibi her friend by confirming they were together all evening.",
            "sent2": "He alibied his brother by stating they were at the movies when the incident occurred.",
            "sent3": "Alibiing for her sister by saying they were shopping seemed like the right thing to do.",
            "sent4": "The witness alibied the suspect by testifying they were at a restaurant at the time.",
            "sent5": "Alibiing for a friend can sometimes be a difficult but necessary task."
        }
    ]
}