{
    "term": "alienations",
    "meanings": [
        {
            "definition": "The act of causing someone to feel isolated or estranged.",
            "pos": "noun",
            "sent1": "Her constant criticism led to deep alienations within the family.",
            "sent2": "The alienations between the two friends grew as misunderstandings piled up.",
            "sent3": "The alienations between the siblings over who gets the last cookie were quite comical.",
            "sent4": "The alienations in the classroom were like invisible walls separating the students.",
            "sent5": "The alienations in the workplace made collaboration nearly impossible."
        },
        {
            "definition": "The state of being separated or disconnected from others.",
            "pos": "noun",
            "sent1": "His feelings of alienations intensified as he moved to a new city where he knew no one.",
            "sent2": "The alienations she felt after the argument made her realize the importance of communication.",
            "sent3": "The alienations at the party were so strong that even the music couldn't bring people together.",
            "sent4": "The alienations in the virtual world can sometimes feel more profound than in real life.",
            "sent5": "The alienations in the empty house echoed with loneliness."
        },
        {
            "definition": "The transfer of property or rights to another person.",
            "pos": "noun",
            "sent1": "The alienations of land to the neighboring farmer were completed smoothly.",
            "sent2": "Legal documents were signed to finalize the alienations of ownership.",
            "sent3": "The alienations of the antique collection to the museum brought joy to many art enthusiasts.",
            "sent4": "The alienations of power within the organization shifted the dynamics significantly.",
            "sent5": "The alienations of responsibilities among the team members were clearly defined in the project plan."
        }
    ]
}