{
    "term": "allergins",
    "meanings": [
        {
            "definition": "Substances that cause an allergic reaction in the body.",
            "pos": "noun",
            "sent1": "Pollen and dust mites are common allergins that can trigger sneezing.",
            "sent2": "Doctors often test for various allergins to identify the cause of allergies.",
            "sent3": "The cat seemed to be allergic to all allergins, even the ones we couldn't see.",
            "sent4": "Her sensitivity to allergins was like a hidden alarm system in her body.",
            "sent5": "The classroom was a minefield of potential allergins for the student with allergies."
        },
        {
            "definition": "A substance that triggers an allergic response.",
            "pos": "noun",
            "sent1": "For some people, peanuts are dangerous allergins that can lead to severe reactions.",
            "sent2": "The doctor advised her to avoid known allergins to prevent allergic reactions.",
            "sent3": "The sneaky allergins in the air seemed to find her wherever she went.",
            "sent4": "His body treated the allergins like unwelcome guests, causing a commotion.",
            "sent5": "The allergins in the food caused her throat to swell, making breathing difficult."
        },
        {
            "definition": "Allergens are typically harmless substances that cause an immune response in certain individuals.",
            "pos": "noun",
            "sent1": "Even though flowers are beautiful, they can be allergins for some people.",
            "sent2": "Allergins like pet dander can make life difficult for those with allergies.",
            "sent3": "The mischievous allergins seemed to target only a select few in the group.",
            "sent4": "The allergins acted like troublemakers, causing chaos in the immune system.",
            "sent5": "The innocent-looking allergins turned into villains for those with sensitivities."
        }
    ]
}