{
    "term": "allegorically",
    "meanings": [
        {
            "definition": "In an allegorical manner",
            "pos": "adverb",
            "sent1": "She explained the story allegorically, comparing the characters to real-life situations.",
            "sent2": "The author wrote allegorically to convey deeper meanings through symbolic representation.",
            "sent3": "The teacher's allegorical explanation of the math problem left the students chuckling.",
            "sent4": "His dreams were filled with allegorically dancing shadows, representing his inner fears.",
            "sent5": "The artist painted allegorically, using colors to symbolize emotions and ideas."
        },
        {
            "definition": "Using allegory",
            "pos": "adjective",
            "sent1": "The allegorical tale captivated the young audience with its hidden messages.",
            "sent2": "She created an allegorical painting that told a story through symbolic imagery.",
            "sent3": "The allegorical play had the audience pondering its deeper meanings long after the curtains closed.",
            "sent4": "His allegorical writing style painted vivid pictures in the minds of his readers.",
            "sent5": "The allegorical film used characters as symbols to convey moral lessons."
        },
        {
            "definition": "Symbolically or metaphorically",
            "pos": "adverb",
            "sent1": "The artist's work was interpreted allegorically, with each brushstroke holding deeper meaning.",
            "sent2": "She spoke allegorically, using symbols to represent complex emotions.",
            "sent3": "The comedian joked allegorically about everyday situations, making the audience laugh.",
            "sent4": "The clouds drifted allegorically across the sky, resembling a flock of sheep.",
            "sent5": "His words were like allegorically woven tapestries, each thread holding a different story."
        }
    ]
}