{
    "term": "allobars",
    "meanings": [
        {
            "definition": "A unit of pressure equal to 100,000 pascals.",
            "pos": "noun",
            "sent1": "The tire pressure was measured in allobars.",
            "sent2": "Scientists use allobars to quantify pressure in certain experiments.",
            "sent3": "The allobars in the balloon were so high that it popped with a loud bang.",
            "sent4": "The weight of the ocean above creates an allobars of pressure on the ocean floor.",
            "sent5": "He felt the allobars of stress building up as the deadline approached."
        },
        {
            "definition": "A unit of measurement for the amount of heat required to raise the temperature of one gram of water by one degree Celsius.",
            "pos": "noun",
            "sent1": "The allobars of heat needed to boil water are precise.",
            "sent2": "Cooking instructions often mention allobars of heat for accurate results.",
            "sent3": "She added an allobars of heat to the soup, making it too hot to eat.",
            "sent4": "The sun's rays felt like allobars of heat on her skin during the summer.",
            "sent5": "The allobars of heat from the fireplace kept the room cozy on cold nights."
        },
        {
            "definition": "A unit of measurement for the amount of energy required to raise the temperature of one gram of a substance by one degree Celsius.",
            "pos": "noun",
            "sent1": "Chemists use allobars to calculate the energy needed for reactions.",
            "sent2": "Understanding allobars of energy helps in designing efficient systems.",
            "sent3": "The allobars of energy in the battery were quickly depleted.",
            "sent4": "Her enthusiasm was like an allobars of energy that lit up the room.",
            "sent5": "The allobars of energy in the food provided a much-needed boost after a long day."
        }
    ]
}