{
    "term": "alls",
    "meanings": [
        {
            "definition": "Everything that exists or is available",
            "pos": "noun",
            "sent1": "In the toy store, you can find alls kinds of dolls and action figures.",
            "sent2": "She gathered alls the ingredients to bake a delicious cake.",
            "sent3": "The magician pulled a rabbit out of his hat, a bird from his sleeve, and alls sorts of surprises from his pockets.",
            "sent4": "Her smile lit up the room, bringing alls the joy and warmth of a sunny day.",
            "sent5": "The library was a treasure trove, filled with alls the knowledge of the world."
        },
        {
            "definition": "The whole amount or quantity",
            "pos": "noun",
            "sent1": "He drank alls the milk in one gulp.",
            "sent2": "The baker used alls the flour in the bag to make bread.",
            "sent3": "The kids ate alls the cookies before dinner, leaving none for dessert.",
            "sent4": "The storm brought alls the rain in a sudden downpour.",
            "sent5": "The treasure chest was filled with alls the gold and jewels imaginable."
        },
        {
            "definition": "The whole number or sum of",
            "pos": "noun",
            "sent1": "The teacher asked the students to add alls the numbers on the board.",
            "sent2": "She counted alls the coins in her piggy bank to see how much money she had saved.",
            "sent3": "The puzzle was missing a piece, making it impossible to see alls the picture.",
            "sent4": "The garden was a riot of colors, with alls the flowers in full bloom.",
            "sent5": "The orchestra played with alls the instruments blending harmoniously."
        },
        {
            "definition": "Completely or entirely",
            "pos": "adverb",
            "sent1": "She was alls alone in the dark forest.",
            "sent2": "The cake was alls eaten by the time the party ended.",
            "sent3": "He danced alls night long, not wanting the celebration to end.",
            "sent4": "The stars shone alls brightly in the clear night sky.",
            "sent5": "The baby giggled, alls delighted with the colorful toy."
        }
    ]
}