{
    "term": "almoner",
    "meanings": [
        {
            "definition": "A person who distributes alms or charity to the poor.",
            "pos": "noun",
            "sent1": "The kind almoner gave food to the hungry families in the village.",
            "sent2": "The local church appointed a new almoner to help those in need.",
            "sent3": "The almoner's pockets seemed bottomless as he helped everyone in town.",
            "sent4": "Her heart was an almoner, overflowing with generosity and compassion.",
            "sent5": "The almoner's presence was like a beacon of hope for the less fortunate."
        },
        {
            "definition": "An official in a hospital or other institution who is responsible for distributing funds for the relief of the needy.",
            "pos": "noun",
            "sent1": "The hospital almoner ensured that financial aid reached the patients in time.",
            "sent2": "As the institution's almoner, she managed the funds for patient support.",
            "sent3": "The almoner's office was always bustling with paperwork and goodwill.",
            "sent4": "In the hospital's corridors, the almoner's footsteps echoed with care and assistance.",
            "sent5": "The almoner's desk was a hub of compassion, connecting resources to those in need."
        },
        {
            "definition": "To act as an almoner by providing assistance to those in need.",
            "pos": "verb",
            "sent1": "She decided to almoner the homeless by offering warm blankets and food.",
            "sent2": "In times of crisis, communities come together to almoner each other.",
            "sent3": "He would almoner his friends by always being there to lend a helping hand.",
            "sent4": "The spirit of kindness almonered through the town, bringing people closer.",
            "sent5": "To almoner is to sow seeds of goodwill that bloom into acts of kindness."
        }
    ]
}