{
    "term": "aloha",
    "meanings": [
        {
            "definition": "Hello; greetings.",
            "pos": "interjection",
            "sent1": "Aloha! It's nice to see you.",
            "sent2": "She waved and said aloha to her friend.",
            "sent3": "With a cheerful aloha, he welcomed everyone to the party.",
            "sent4": "The sun set with a warm aloha, painting the sky in vibrant colors.",
            "sent5": "The gentle aloha in her voice made everyone feel welcome."
        },
        {
            "definition": "Goodbye; farewell.",
            "pos": "interjection",
            "sent1": "Aloha! Have a safe trip.",
            "sent2": "They hugged and said aloha as they parted ways.",
            "sent3": "As the train departed, he shouted aloha to his friends on the platform.",
            "sent4": "The last aloha echoed in the empty room, marking the end of an era.",
            "sent5": "Her tearful aloha lingered in the air long after she left."
        },
        {
            "definition": "Love; affection.",
            "pos": "noun",
            "sent1": "Their aloha for each other was evident in every gesture.",
            "sent2": "She expressed her aloha for her family through her actions.",
            "sent3": "The puppy's playful antics were a pure display of aloha.",
            "sent4": "In the garden, the flowers bloomed with vibrant aloha.",
            "sent5": "His eyes sparkled with genuine aloha as he looked at her."
        },
        {
            "definition": "Peace; compassion.",
            "pos": "noun",
            "sent1": "The community came together in a spirit of aloha after the disaster.",
            "sent2": "Her words were filled with aloha and understanding.",
            "sent3": "The old man's face radiated with a sense of aloha towards all beings.",
            "sent4": "The ocean whispered tales of aloha as the waves gently caressed the shore.",
            "sent5": "In the quiet of the forest, one could feel the deep aloha of nature."
        }
    ]
}