{
    "term": "alternate",
    "meanings": [
        {
            "definition": "Occurring in turn; succeeding each other in a regular sequence.",
            "pos": "adjective",
            "sent1": "The team had an alternate plan in case the first one failed.",
            "sent2": "The students took alternate seats on the bus for the field trip.",
            "sent3": "The alternate route to the park was through the scenic forest.",
            "sent4": "Her mood seemed to alternate between joy and sadness throughout the day.",
            "sent5": "The colors on the butterfly's wings were an alternate pattern of black and orange."
        },
        {
            "definition": "To take turns; to interchange regularly.",
            "pos": "verb",
            "sent1": "The friends alternate choosing the movie they will watch.",
            "sent2": "They alternate between walking and running during their exercise routine.",
            "sent3": "The siblings alternate teasing each other playfully.",
            "sent4": "The sun and clouds alternate in the sky, creating a beautiful scene.",
            "sent5": "The birds alternate singing their melodies in the early morning."
        },
        {
            "definition": "A substitute or second choice.",
            "pos": "noun",
            "sent1": "She brought an alternate snack to share at the party.",
            "sent2": "The alternate for the lead role in the play had to step in last minute.",
            "sent3": "The alternate for the missing ingredient was quickly found in the pantry.",
            "sent4": "His alternate for the meeting couldn't make it, so he had to attend himself.",
            "sent5": "The alternate for the broken toy was a similar one that brought just as much joy."
        },
        {
            "definition": "To happen or exist in a repeated pattern.",
            "pos": "verb",
            "sent1": "The seasons alternate throughout the year, bringing different weather.",
            "sent2": "The colors on the flag alternate between red and white stripes.",
            "sent3": "The lights alternate between bright and dim in the dance club.",
            "sent4": "The waves alternate in their intensity, calming and crashing rhythmically.",
            "sent5": "The flavors in the dish alternate between sweet and savory, creating a unique taste."
        }
    ]
}