{
    "term": "altos",
    "meanings": [
        {
            "definition": "A person who sings the alto part in a choir.",
            "pos": "noun",
            "sent1": "In the choir, the altos sang beautifully during the performance.",
            "sent2": "The altos harmonized with the sopranos to create a lovely melody.",
            "sent3": "The altos joked that they were the secret stars of the choir.",
            "sent4": "Her voice soared like an altos in a choir, reaching incredible heights.",
            "sent5": "The altos' voices blended together like a warm embrace."
        },
        {
            "definition": "The highest male singing voice.",
            "pos": "noun",
            "sent1": "The tenor and altos sang a duet that captivated the audience.",
            "sent2": "His altos voice could hit the high notes effortlessly.",
            "sent3": "The altos voice was so high, it almost reached the clouds.",
            "sent4": "His altos voice was like a bird soaring in the sky.",
            "sent5": "The altos voice echoed through the hall, filling it with music."
        },
        {
            "definition": "A section of a musical composition written for altos.",
            "pos": "noun",
            "sent1": "The altos section added depth to the musical piece.",
            "sent2": "The composer highlighted the altos section in the score.",
            "sent3": "The altos section had a solo that stole the show.",
            "sent4": "The altos section flowed like a gentle stream in the music.",
            "sent5": "The altos section brought a sense of calm to the composition."
        },
        {
            "definition": "A type of saxophone.",
            "pos": "noun",
            "sent1": "The musician played a beautiful melody on the altos saxophone.",
            "sent2": "The altos saxophone had a rich and mellow tone.",
            "sent3": "The altos saxophone stood out in the jazz band.",
            "sent4": "The altos saxophone's sound enveloped the room like a warm hug.",
            "sent5": "The altos saxophone added a unique flair to the ensemble."
        }
    ]
}