{
    "term": "amarones",
    "meanings": [
        {
            "definition": "A type of Italian red wine made from dried grapes.",
            "pos": "noun",
            "sent1": "During the celebration, they opened a bottle of amarones to enjoy with their meal.",
            "sent2": "The amarones they bought from the vineyard had a rich and fruity flavor.",
            "sent3": "At the party, everyone was impressed by the amarones they were served.",
            "sent4": "The aroma of the amarones filled the room, creating a warm and inviting atmosphere.",
            "sent5": "The amarones on the table sparkled in the candlelight, tempting everyone to have a taste."
        },
        {
            "definition": "The plural form of amarone, referring to multiple bottles of the wine.",
            "pos": "noun",
            "sent1": "They stocked up on amarones for the holiday season, ensuring they had enough for all their guests.",
            "sent2": "The cellar was filled with various amarones collected over the years.",
            "sent3": "As a gift, they received a set of exquisite amarones from a dear friend.",
            "sent4": "The shelves were lined with colorful labels of different amarones, creating a beautiful display.",
            "sent5": "The collection of amarones gleamed under the soft light, showcasing their diversity and quality."
        },
        {
            "definition": "The act of drinking or enjoying amarone wine.",
            "pos": "noun",
            "sent1": "Their evening was filled with laughter and joy as they shared stories over glasses of amarones.",
            "sent2": "The group gathered around the table, savoring each sip of the delicious amarones.",
            "sent3": "She found great pleasure in the simple act of pouring herself a glass of amarones after a long day.",
            "sent4": "The sound of clinking glasses echoed through the room as they toasted to the amarones.",
            "sent5": "The smooth taste of the amarones lingered on their tongues, leaving a delightful aftertaste."
        }
    ]
}