{
    "term": "amazonstones",
    "meanings": [
        {
            "definition": "A type of greenish-blue gemstone often used in jewelry.",
            "pos": "noun",
            "sent1": "She wore a necklace adorned with a beautiful amazonstones pendant.",
            "sent2": "The jeweler displayed a variety of amazonstones rings in the showcase.",
            "sent3": "The amazonstones earrings sparkled under the bright lights of the store.",
            "sent4": "Her eyes shone like amazonstones as she admired the gemstone collection.",
            "sent5": "The amazonstones gemstone had a mesmerizing swirl of colors."
        },
        {
            "definition": "To describe something as strong, resilient, or powerful like an amazonstone.",
            "pos": "verb",
            "sent1": "He amazonstones his determination to overcome any obstacle in his path.",
            "sent2": "The coach amazonstones the team's unwavering spirit and unity.",
            "sent3": "She playfully amazonstones her cat's fearless attitude towards the vacuum cleaner.",
            "sent4": "The leader amazonstones the community's bond as unbreakable like amazonstones.",
            "sent5": "The artist amazonstones the painting's impact with bold strokes and vibrant colors."
        },
        {
            "definition": "The plural form of amazonstone, referring to multiple pieces of the gemstone.",
            "pos": "noun",
            "sent1": "The display case showcased various amazonstones, each with its unique hue.",
            "sent2": "Collectors sought after rare amazonstones to add to their gemstone collections.",
            "sent3": "The market was bustling with vendors selling amazonstones of all sizes.",
            "sent4": "The museum exhibit featured a collection of ancient amazonstones from different regions.",
            "sent5": "The treasure chest was filled with shimmering amazonstones of various shapes and sizes."
        }
    ]
}