{
    "term": "ambaris",
    "meanings": [
        {
            "definition": "A type of tree.",
            "pos": "noun",
            "sent1": "The ambaris stood tall in the forest, providing shade for the animals.",
            "sent2": "The birds built their nests in the branches of the ambaris.",
            "sent3": "The squirrel thought the ambaris was the perfect spot to hide its acorns.",
            "sent4": "The ambaris swayed gently in the breeze, like a dancer on stage.",
            "sent5": "The leaves of the ambaris rustled softly in the wind, creating a soothing sound."
        },
        {
            "definition": "A type of fabric.",
            "pos": "noun",
            "sent1": "She sewed a beautiful dress using soft ambaris fabric.",
            "sent2": "The curtains in the room were made of delicate ambaris.",
            "sent3": "The tailor accidentally spilled dye on the ambaris, creating a colorful pattern.",
            "sent4": "The ambaris shimmered under the light, like a piece of silk.",
            "sent5": "The touch of the ambaris fabric was smooth and luxurious."
        },
        {
            "definition": "A type of food.",
            "pos": "noun",
            "sent1": "The chef prepared a delicious dish using fresh ambaris as the main ingredient.",
            "sent2": "The market sold exotic fruits, including the rare ambaris.",
            "sent3": "The children giggled as they tried the sweet and tangy flavor of ambaris for the first time.",
            "sent4": "The ambaris salad was a burst of flavors in every bite.",
            "sent5": "The aroma of the ripe ambaris filled the kitchen, making everyone hungry."
        },
        {
            "definition": "A type of color.",
            "pos": "noun",
            "sent1": "Her painting was filled with vibrant shades, including a bright ambaris.",
            "sent2": "The sunset painted the sky with hues of orange, pink, and ambaris.",
            "sent3": "The artist mixed red and yellow to create the unique color of ambaris.",
            "sent4": "The flowers in the garden bloomed in various colors, but none as striking as ambaris.",
            "sent5": "The ambaris color reminded her of a warm summer day, full of joy and laughter."
        }
    ]
}