{
    "term": "ambivalent",
    "meanings": [
        {
            "definition": "Having mixed feelings or contradictory emotions about something.",
            "pos": "adjective",
            "sent1": "She felt ambivalent about the movie, liking the plot but disliking the acting.",
            "sent2": "I am ambivalent about going to the party because I'm not sure if I'll have fun.",
            "sent3": "He was ambivalent about eating the last cookie, torn between his hunger and saving it for later.",
            "sent4": "Her ambivalent expression during the meeting made it hard to gauge her true feelings.",
            "sent5": "The ambivalent colors of the sunset painted the sky in conflicting shades of pink and orange."
        },
        {
            "definition": "Uncertain or indecisive about a course of action.",
            "pos": "adjective",
            "sent1": "The ambivalent student couldn't decide whether to study for the test or watch TV.",
            "sent2": "She was ambivalent about choosing a college major, unsure of her future path.",
            "sent3": "The ambivalent squirrel hesitated between two trees before finally climbing one.",
            "sent4": "His ambivalent behavior towards the project showed his lack of commitment.",
            "sent5": "The ambivalent weather made it hard to plan an outdoor picnic, with clouds threatening rain but sun peeking through."
        },
        {
            "definition": "Showing simultaneous and contradictory attitudes or feelings towards something.",
            "pos": "adjective",
            "sent1": "Her ambivalent reaction to the news included both excitement and worry.",
            "sent2": "The politician's ambivalent stance on the issue confused the voters.",
            "sent3": "The ambivalent cat purred while arching its back, unsure whether to be friendly or defensive.",
            "sent4": "The ambivalent crowd cheered and booed at the same time, creating a chaotic atmosphere.",
            "sent5": "His ambivalent gestures towards her conveyed both affection and distance, leaving her puzzled."
        }
    ]
}