{
    "term": "amblyopias",
    "meanings": [
        {
            "definition": "A condition in which one eye has reduced vision that cannot be corrected with lenses.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the child with amblyopias after noticing the vision problem in one eye.",
            "sent2": "Amblyopias can affect a person's ability to see clearly out of one eye.",
            "sent3": "The pirate wore an eyepatch not for style, but to hide his amblyopias from the crew.",
            "sent4": "Her amblyopias cast a shadow over her dreams of becoming a pilot.",
            "sent5": "The fog of amblyopias clouded his sight like a veil of uncertainty."
        },
        {
            "definition": "The medical term for lazy eye.",
            "pos": "noun",
            "sent1": "The optometrist explained that amblyopias is another name for lazy eye.",
            "sent2": "Children with amblyopias may need to wear an eye patch to strengthen the weaker eye.",
            "sent3": "The lazy eye decided to take a nap, earning the nickname 'amblyopias' among the other eyes.",
            "sent4": "Her amblyopias was like a sleepy sentinel, always half-awake and watching.",
            "sent5": "The label of amblyopias stuck to him like a stubborn nickname, hard to shake off."
        },
        {
            "definition": "The plural form of amblyopia.",
            "pos": "noun",
            "sent1": "The doctor discussed the amblyopias of both eyes with the concerned parents.",
            "sent2": "In the waiting room, posters explained the different types of amblyopias that can occur.",
            "sent3": "The amblyopias gathered for a meeting, each eye sharing their struggles with vision.",
            "sent4": "Her collection of amblyopias was like a gallery of unique eye paintings.",
            "sent5": "The amblyopias danced in her vision, a kaleidoscope of blurred shapes and colors."
        }
    ]
}