{
    "term": "ambones",
    "meanings": [
        {
            "definition": "A raised platform in a church from which the Gospel is read.",
            "pos": "noun",
            "sent1": "The priest stood on the ambones to share the scripture with the congregation.",
            "sent2": "The wooden ambones in the church were beautifully carved and ornate.",
            "sent3": "During the service, the cat sneaked onto the ambones and caused a playful distraction.",
            "sent4": "Her voice echoed from the ambones, filling the church with warmth and hope.",
            "sent5": "The sunlight streamed down on the ambones, highlighting its importance in the church."
        },
        {
            "definition": "A pulpit or lectern in a church.",
            "pos": "noun",
            "sent1": "The pastor placed his notes on the ambones before starting his sermon.",
            "sent2": "The choir director stood behind the ambones, ready to lead the hymns.",
            "sent3": "The children pretended the ambones was a spaceship, launching them into imaginary adventures.",
            "sent4": "Her words from the ambones were like music to the ears of the listeners.",
            "sent5": "The candles flickered softly around the ambones, creating a serene atmosphere."
        },
        {
            "definition": "A raised platform for speakers in ancient Roman forums.",
            "pos": "noun",
            "sent1": "The senator addressed the crowd from the ambones, his voice booming across the forum.",
            "sent2": "The marble ambones in the forum were a symbol of authority and power.",
            "sent3": "The comedian joked that standing on the ambones made him feel like a Roman emperor.",
            "sent4": "Her presence on the ambones commanded attention and respect from the audience.",
            "sent5": "The echoes of history lingered around the ambones, whispering tales of the past."
        }
    ]
}