{
    "term": "ambrosias",
    "meanings": [
        {
            "definition": "The food of the gods in Greek mythology.",
            "pos": "noun",
            "sent1": "In the ancient stories, ambrosias was said to be the special food that only the gods could eat.",
            "sent2": "During the festival, the people offered ambrosias to the statues of the gods.",
            "sent3": "The mischievous child claimed that his mom's cooking was so good, it must be ambrosias fit for the gods!",
            "sent4": "The aroma of the freshly baked bread filled the room, making it seem like ambrosias from heaven.",
            "sent5": "The chef's secret recipe turned a simple dish into ambrosias that everyone craved."
        },
        {
            "definition": "A dessert made with oranges and shredded coconut.",
            "pos": "noun",
            "sent1": "At the potluck, Mary brought her famous ambrosias dessert that everyone loved.",
            "sent2": "During the picnic, the children enjoyed the sweet ambrosias under the shade of the tree.",
            "sent3": "The ambrosias dessert was so delicious that it disappeared within minutes of being served.",
            "sent4": "The ambrosias dessert was a burst of tropical flavors in every bite.",
            "sent5": "The ambrosias dessert was like a ray of sunshine on a cloudy day."
        },
        {
            "definition": "A type of flowering plant in the daisy family.",
            "pos": "noun",
            "sent1": "The ambrosias plant in the garden bloomed with vibrant colors in the spring.",
            "sent2": "The ambrosias flowers attracted butterflies and bees with their sweet nectar.",
            "sent3": "The mischievous squirrel tried to hide its acorn stash near the ambrosias plant.",
            "sent4": "The ambrosias plant stood tall among the other flowers like a queen in a garden.",
            "sent5": "The ambrosias flowers swayed gently in the breeze, spreading their pleasant fragrance."
        }
    ]
}