{
    "term": "ambrosian",
    "meanings": [
        {
            "definition": "Relating to or characteristic of ambrosia, the food of the gods in Greek mythology.",
            "pos": "adjective",
            "sent1": "The ambrosian aroma of the freshly baked bread filled the kitchen.",
            "sent2": "The ambrosian nectar was said to grant immortality to those who consumed it.",
            "sent3": "The picnic felt truly ambrosian with the delicious spread of fruits and cheeses.",
            "sent4": "Her voice had an ambrosian quality that captivated all who heard it.",
            "sent5": "The ambrosian sunset painted the sky in hues of gold and pink."
        },
        {
            "definition": "Of or relating to Ambrose, a 4th-century bishop of Milan.",
            "pos": "adjective",
            "sent1": "The ambrosian teachings of Bishop Ambrose inspired many followers.",
            "sent2": "The ambrosian legacy of Ambrose continues to influence the church to this day.",
            "sent3": "The ambrosian statue of Bishop Ambrose in the square was a popular tourist attraction.",
            "sent4": "His wisdom was like an ambrosian fountain, quenching the thirst for knowledge.",
            "sent5": "The ambrosian spirit of Ambrose guided the city through times of trouble."
        },
        {
            "definition": "Of or relating to the Ambrosian rite, a liturgical rite used in the Catholic Church.",
            "pos": "adjective",
            "sent1": "The ambrosian chants during the ceremony filled the church with reverence.",
            "sent2": "The ambrosian vestments worn by the priests were intricate and beautiful.",
            "sent3": "The cat seemed to perform an ambrosian dance around the altar during the service.",
            "sent4": "The ambrosian rituals of the rite brought a sense of peace to the congregation.",
            "sent5": "The ambrosian atmosphere of the church made worship a truly sacred experience."
        }
    ]
}