{
    "term": "amebiases",
    "meanings": [
        {
            "definition": "Amebiases: the plural form of amebiasis",
            "pos": "noun",
            "sent1": "The doctor explained that amebiases are cases of amebiasis that have affected many people.",
            "sent2": "The hospital reported several new cases of amebiases this week.",
            "sent3": "The classroom erupted in laughter when the teacher accidentally said 'amebiases' instead of 'amebiasis'.",
            "sent4": "The spread of misinformation online can create an 'amebiases' of fear among the population.",
            "sent5": "The documentary vividly portrayed the devastating effects of amebiases on communities around the world."
        },
        {
            "definition": "Amebiases: the act of being infected with the parasite Entamoeba histolytica",
            "pos": "noun",
            "sent1": "The doctor confirmed the amebiases in the patient after conducting tests.",
            "sent2": "Preventing amebiases is crucial for maintaining good health.",
            "sent3": "The amebiases in the movie plot added an unexpected twist to the story.",
            "sent4": "The spread of rumors in the small town created an 'amebiases' of panic among the residents.",
            "sent5": "The news report highlighted the increasing cases of amebiases in the region."
        },
        {
            "definition": "Amebiases: the presence of amoebas in the body",
            "pos": "noun",
            "sent1": "The doctor explained the symptoms of amebiases caused by the presence of amoebas.",
            "sent2": "The research study focused on the treatment of amebiases in laboratory mice.",
            "sent3": "The amebiases in the petri dish seemed to be having a party under the microscope.",
            "sent4": "The polluted water source led to an 'amebiases' of contamination in the community.",
            "sent5": "The vivid description in the book painted a clear picture of the dangers of amebiases."
        }
    ]
}