{
    "term": "aminophylline",
    "meanings": [
        {
            "definition": "A bronchodilator used to treat asthma and other respiratory conditions.",
            "pos": "noun",
            "sent1": "The doctor prescribed aminophylline to help widen the airways of the patient.",
            "sent2": "My sister uses aminophylline to manage her asthma symptoms.",
            "sent3": "The aminophylline made the lungs dance happily with each breath.",
            "sent4": "His wheezing was like a locked door until aminophylline came and opened it.",
            "sent5": "The aminophylline worked like a magic key, unlocking the tightness in the chest."
        },
        {
            "definition": "Aminophylline is a derivative of theophylline.",
            "pos": "noun",
            "sent1": "The pharmacist explained that aminophylline is closely related to theophylline.",
            "sent2": "The doctor mentioned that aminophylline is derived from theophylline.",
            "sent3": "The aminophylline and theophylline were like siblings in the medicine cabinet.",
            "sent4": "Her knowledge of aminophylline was the foundation for understanding theophylline.",
            "sent5": "The connection between aminophylline and theophylline was as clear as day."
        },
        {
            "definition": "Aminophylline is a medication that relaxes the muscles in the airways and increases airflow to the lungs.",
            "pos": "noun",
            "sent1": "After taking aminophylline, the patient felt their chest muscles relax, allowing easier breathing.",
            "sent2": "The nurse administered aminophylline to help the patient breathe more comfortably.",
            "sent3": "The aminophylline whispered to the airways, 'Relax and let the breeze flow.'",
            "sent4": "Her lungs felt like a garden in bloom after the aminophylline took effect.",
            "sent5": "The aminophylline was like a gentle breeze, soothing the tightness in the chest."
        }
    ]
}