{
    "term": "ammonals",
    "meanings": [
        {
            "definition": "A type of animal that produces ammonia as a waste product.",
            "pos": "noun",
            "sent1": "The zookeeper explained that the ammonals in the exhibit need special care due to their unique waste.",
            "sent2": "The scientist studied the behavior of the exotic ammonals in their natural habitat.",
            "sent3": "The children giggled as they pretended to be silly ammonals at the playground.",
            "sent4": "The smell in the room was so strong, it was as if a herd of ammonals had passed through.",
            "sent5": "The documentary showcased the fascinating world of underwater ammonals and their ammonia production."
        },
        {
            "definition": "The act of behaving like an animal.",
            "pos": "noun",
            "sent1": "During the play, the actor's portrayal of a wild ammonals was incredibly realistic.",
            "sent2": "The teacher praised the students for their creativity in their ammonals-themed costumes.",
            "sent3": "At the costume party, everyone had a good laugh at Tom's hilarious ammonals impression.",
            "sent4": "Her sudden outburst at the meeting was like a startled pack of ammonals.",
            "sent5": "The children's game of charades turned into a chaotic scene of ammonals running wild."
        },
        {
            "definition": "The study of animals that produce ammonia.",
            "pos": "noun",
            "sent1": "In her biology class, she learned about the importance of studying ammonals for environmental research.",
            "sent2": "The professor's groundbreaking research focused on the behavior of marine ammonals.",
            "sent3": "The comedy show featured a hilarious skit about scientists studying clumsy ammonals.",
            "sent4": "The field trip to the zoo inspired the students to pursue a career in studying exotic ammonals.",
            "sent5": "The documentary highlighted the challenges researchers face when studying elusive rainforest ammonals."
        }
    ]
}