{
    "term": "ammonoids",
    "meanings": [
        {
            "definition": "A group of extinct marine mollusks with spiral shells.",
            "pos": "noun",
            "sent1": "The scientist studied the ancient ammonoids found in the ocean.",
            "sent2": "The museum displayed a collection of well-preserved ammonoids.",
            "sent3": "The children pretended to be playful sea creatures like the fascinating ammonoids.",
            "sent4": "Her thoughts spiraled like the intricate shells of the ancient ammonoids.",
            "sent5": "The diver marveled at the beauty of the delicate ammonoids."
        },
        {
            "definition": "Fossilized remains of these mollusks.",
            "pos": "noun",
            "sent1": "The paleontologist carefully extracted the fragile ammonoids from the rock.",
            "sent2": "The museum exhibit showcased a variety of perfectly preserved ammonoids.",
            "sent3": "The fossilized ammonoids seemed to whisper secrets of the past to the curious researcher.",
            "sent4": "The ancient city was buried under layers of time, like the hidden treasure of the fossilized ammonoids.",
            "sent5": "The collector's prized possession was a rare and valuable piece of fossilized ammonoids."
        },
        {
            "definition": "Pertaining to or resembling these mollusks.",
            "pos": "adjective",
            "sent1": "The artist created a beautiful painting inspired by the ammonoids' unique shapes.",
            "sent2": "The jewelry designer crafted a necklace with intricate patterns reminiscent of the elegant ammonoids.",
            "sent3": "The room was decorated with ammonoids-themed decorations for the marine-themed party.",
            "sent4": "Her flowing dress swirled around her like the graceful movements of the ammonoids in the sea.",
            "sent5": "The garden was filled with plants that bore a striking resemblance to the ammonoids' spiral shells."
        }
    ]
}