{
    "term": "amoeboid",
    "meanings": [
        {
            "definition": "Resembling an amoeba in shape or movement.",
            "pos": "adjective",
            "sent1": "The cell moved in an amoeboid manner, stretching and contracting as it traveled.",
            "sent2": "The artist created an amoeboid sculpture that seemed to flow and change before your eyes.",
            "sent3": "The children giggled as they watched the jelly wiggle in an amoeboid dance.",
            "sent4": "The fog crept through the valley in an amoeboid fashion, enveloping everything in its path.",
            "sent5": "The lava flowed down the volcano's slopes in an amoeboid pattern, leaving a trail of destruction behind."
        },
        {
            "definition": "Of or relating to an amoeba.",
            "pos": "adjective",
            "sent1": "The scientist studied the amoeboid behavior of the single-celled organism.",
            "sent2": "The textbook explained the amoeboid structure of the microscopic creature.",
            "sent3": "The petri dish contained an amoeboid blob that seemed to pulsate with life.",
            "sent4": "The spaceship's design was inspired by the sleek, amoeboid shape of the alien spacecraft.",
            "sent5": "The jellyfish moved through the water with an elegant, amoeboid grace."
        },
        {
            "definition": "Characterized by a changing shape or form.",
            "pos": "adjective",
            "sent1": "The clouds in the sky took on an amoeboid appearance, constantly shifting and morphing.",
            "sent2": "The artist's painting captured the essence of an amoeboid world where nothing stayed the same.",
            "sent3": "The cake batter spread out in an amoeboid manner, filling every corner of the pan.",
            "sent4": "The shadows cast by the trees on the ground had an almost amoeboid quality, changing with the slightest breeze.",
            "sent5": "The dance troupe moved in perfect sync, their bodies flowing in an amoeboid rhythm."
        }
    ]
}