{
    "term": "amorini",
    "meanings": [
        {
            "definition": "A representation of a small, winged cupid.",
            "pos": "noun",
            "sent1": "The garden statue featured an amorini holding a bow and arrow.",
            "sent2": "During Valentine's Day, stores sell many amorini figurines.",
            "sent3": "The mischievous amorini in the painting seemed to be playing a prank on the other characters.",
            "sent4": "Her laughter was like the fluttering wings of an amorini, light and joyful.",
            "sent5": "The amorini's tiny wings shimmered in the moonlight, casting a magical glow."
        },
        {
            "definition": "A group of small cupids or cherubs.",
            "pos": "noun",
            "sent1": "At the art exhibit, there was a painting with a cluster of amorini flying above the clouds.",
            "sent2": "The church's ceiling was adorned with colorful amorini, adding a touch of whimsy.",
            "sent3": "The playful amorini giggled as they sprinkled love dust on the unsuspecting visitors.",
            "sent4": "The room was filled with the fluttering sounds of amorini wings, creating a sense of enchantment.",
            "sent5": "The garden was filled with the laughter of amorini, their tiny voices echoing in the air."
        },
        {
            "definition": "A decorative motif featuring small, winged figures.",
            "pos": "noun",
            "sent1": "The tapestry displayed an intricate design with delicate amorini woven into the fabric.",
            "sent2": "The antique mirror had ornate frames adorned with tiny amorini figures.",
            "sent3": "The bakery's logo had whimsical amorini flying around a giant cupcake.",
            "sent4": "Her dreams were filled with swirling amorini, dancing in a kaleidoscope of colors.",
            "sent5": "The garden gate was decorated with intricate metalwork depicting playful amorini."
        }
    ]
}