{
    "term": "amphibia",
    "meanings": [
        {
            "definition": "A class of cold-blooded vertebrates that includes frogs, toads, newts, and salamanders.",
            "pos": "noun",
            "sent1": "The zoo had a special exhibit featuring various amphibia like frogs and salamanders.",
            "sent2": "Scientists study the behavior of amphibia to learn more about their habitats.",
            "sent3": "The amphibia at the pond were having a meeting to discuss the upcoming frog jumping competition.",
            "sent4": "In the forest, the diverse amphibia community resembled a colorful mosaic.",
            "sent5": "Children were excited to see the amphibia up close during the nature walk."
        },
        {
            "definition": "The study of amphibians.",
            "pos": "noun",
            "sent1": "Her passion for amphibia led her to pursue a career in biology.",
            "sent2": "University students often take courses in amphibia to understand their ecological importance.",
            "sent3": "The professor's amphibia lecture was so engaging that even the sleepy students perked up.",
            "sent4": "Exploring the world of amphibia felt like diving into a fascinating underwater realm.",
            "sent5": "The library had a section dedicated to books on amphibia for research purposes."
        },
        {
            "definition": "Capable of living both on land and in water.",
            "pos": "adjective",
            "sent1": "The amphibia creatures in the pond could effortlessly transition between water and land.",
            "sent2": "The amphibia habitat provided the perfect environment for creatures with dual lifestyles.",
            "sent3": "The amphibia picnic by the lake was a unique experience with both swimming and sunbathing.",
            "sent4": "Her ability to adapt to various situations made her as versatile as an amphibia.",
            "sent5": "The amphibia nature of the wetlands allowed for a rich diversity of species to thrive."
        }
    ]
}