{
    "term": "amphibious",
    "meanings": [
        {
            "definition": "Able to live both on land and in water.",
            "pos": "adjective",
            "sent1": "The frog is amphibious, meaning it can survive in water and on land.",
            "sent2": "The turtle is an amphibious creature, comfortable in both water and on land.",
            "sent3": "The amphibious duck enjoyed swimming in the pond and then waddling on the grass.",
            "sent4": "The amphibious nature of the platypus makes it a unique creature in the animal kingdom.",
            "sent5": "The amphibious salamander moved gracefully from the stream to the forest floor."
        },
        {
            "definition": "Relating to or characteristic of animals that can live both on land and in water.",
            "pos": "adjective",
            "sent1": "The amphibious lifestyle of the otter allows it to thrive in various environments.",
            "sent2": "The amphibious nature of seals enables them to hunt in the ocean and rest on land.",
            "sent3": "The amphibious penguin decided to take a stroll on the beach before diving back into the sea.",
            "sent4": "The amphibious behavior of the crocodile makes it a formidable predator in water and on land.",
            "sent5": "The amphibious frog displayed its versatility by hopping from the pond to the meadow."
        },
        {
            "definition": "Capable of operating on both land and water.",
            "pos": "adjective",
            "sent1": "The amphibious vehicle smoothly transitioned from the road to the river.",
            "sent2": "The amphibious aircraft landed on the runway and then took off from the water.",
            "sent3": "The amphibious car caused a stir as it drove straight into the lake and kept going.",
            "sent4": "The amphibious robot amazed everyone by seamlessly moving between the beach and the ocean.",
            "sent5": "The amphibious tractor proved its worth by plowing fields and crossing streams with ease."
        }
    ]
}