{
    "term": "anacruses",
    "meanings": [
        {
            "definition": "One or more notes or tones preceding the first downbeat of a musical phrase.",
            "pos": "noun",
            "sent1": "The anacruses set the tone for the entire musical piece.",
            "sent2": "The composer added anacruses to create anticipation in the music.",
            "sent3": "The anacruses whispered a secret melody before the main tune began.",
            "sent4": "Like a gentle breeze before a storm, the anacruses hinted at the upcoming musical storm.",
            "sent5": "The anacruses danced lightly, leading the way for the rest of the notes to follow."
        },
        {
            "definition": "A short introductory phrase or section at the beginning of a piece of music.",
            "pos": "noun",
            "sent1": "The anacruses introduced the melody with a soft touch.",
            "sent2": "In the music sheet, the anacruses were marked with a delicate symbol.",
            "sent3": "The anacruses played a quick game of tag before the main melody started.",
            "sent4": "Like a friendly wave, the anacruses greeted the listeners before the music began.",
            "sent5": "The anacruses peeked around the corner of the music, inviting the audience to listen further."
        },
        {
            "definition": "A brief introduction or prelude before the main part of a composition.",
            "pos": "noun",
            "sent1": "The anacruses acted as a gentle knock on the door of the musical piece.",
            "sent2": "Before the grand entrance of the main melody, the anacruses whispered a preview.",
            "sent3": "The anacruses were like a small appetizer before the main musical feast.",
            "sent4": "Just like a trailer before a movie, the anacruses hinted at what was to come.",
            "sent5": "The anacruses were the opening act, warming up the audience for the main performance."
        }
    ]
}