{
    "term": "analgesia",
    "meanings": [
        {
            "definition": "The inability to feel pain.",
            "pos": "noun",
            "sent1": "After the accident, the patient experienced analgesia and did not feel any pain.",
            "sent2": "The doctor diagnosed the patient with analgesia, meaning they could not sense pain.",
            "sent3": "The superhero's power was analgesia, making them impervious to pain.",
            "sent4": "In the realm of dreams, she floated weightlessly, embraced by the comforting cloak of analgesia.",
            "sent5": "The sensation of analgesia enveloped her, shielding her from the sharp edges of reality."
        },
        {
            "definition": "The relief of pain without loss of consciousness.",
            "pos": "noun",
            "sent1": "The analgesia provided by the medication eased her discomfort without making her sleepy.",
            "sent2": "The nurse administered analgesia to the patient to alleviate their pain while keeping them awake.",
            "sent3": "The magic potion granted instant analgesia, allowing the hero to continue the quest without hindrance.",
            "sent4": "As the music played, a wave of analgesia washed over her, soothing her troubled mind.",
            "sent5": "The gentle touch of the healer brought a sense of analgesia, calming the throbbing ache."
        },
        {
            "definition": "A drug that relieves pain.",
            "pos": "noun",
            "sent1": "The doctor prescribed a powerful analgesia to manage the patient's post-operative pain.",
            "sent2": "The analgesia provided quick relief from the persistent backache.",
            "sent3": "The comedian joked that chocolate was the best analgesia for a broken heart.",
            "sent4": "In the midst of chaos, her laughter acted as a soothing analgesia for those around her.",
            "sent5": "The herbal tea served as a natural analgesia, easing the tension in her muscles."
        }
    ]
}