{
    "term": "analeptics",
    "meanings": [
        {
            "definition": "analeptics: drugs that stimulate the central nervous system",
            "pos": "noun",
            "sent1": "The doctor prescribed analeptics to help wake up the patient's brain.",
            "sent2": "Athletes sometimes use analeptics to increase their energy levels before a competition.",
            "sent3": "The coffee acted like analeptics for the sleepy student during the boring lecture.",
            "sent4": "Her laughter was like analeptics, bringing life and energy to the dull party.",
            "sent5": "The music was an analeptics injection, reviving the crowd and getting everyone dancing."
        },
        {
            "definition": "analeptics: a substance that acts as a stimulant",
            "pos": "noun",
            "sent1": "The energy drink contained analeptics to keep the workers alert during the night shift.",
            "sent2": "Some people rely on analeptics to help them stay awake during long drives.",
            "sent3": "The comedian's jokes were like analeptics, keeping the audience engaged and laughing.",
            "sent4": "Her smile was an analeptics boost, brightening up the room instantly.",
            "sent5": "The fresh air acted as analeptics, invigorating her after a long day indoors."
        },
        {
            "definition": "analeptics: medications used to treat respiratory depression",
            "pos": "noun",
            "sent1": "The doctor administered analeptics to help the patient breathe more easily.",
            "sent2": "In emergency situations, analeptics can be life-saving for individuals with breathing difficulties.",
            "sent3": "The balloon animals at the party were like analeptics, bringing joy and laughter to the children.",
            "sent4": "His encouraging words were an analeptics for her spirit, lifting her up when she felt down.",
            "sent5": "The sunrise was an analeptics for the soul, filling him with hope and positivity for the day ahead."
        }
    ]
}