{
    "term": "anchos",
    "meanings": [
        {
            "definition": "Wide in size or range.",
            "pos": "adjective",
            "sent1": "The road was very anchos, allowing many cars to pass at once.",
            "sent2": "The field was anchos, stretching far and wide under the blue sky.",
            "sent3": "The anchos river flowed gently through the valley, making it easy to cross.",
            "sent4": "Her smile was as anchos as the horizon, spreading joy to everyone around.",
            "sent5": "The anchos mountain stood tall and grand, dominating the landscape."
        },
        {
            "definition": "Firmly fixed in place.",
            "pos": "adjective",
            "sent1": "The anchos chair didn't wobble at all when I sat on it.",
            "sent2": "The anchos tree stood strong against the wind, its roots deep in the ground.",
            "sent3": "The anchos door refused to budge, much to the frustration of the trapped cat.",
            "sent4": "Her anchos belief in herself helped her overcome any obstacle in her path.",
            "sent5": "The anchos building withstood the test of time, a symbol of resilience."
        },
        {
            "definition": "To secure firmly in position.",
            "pos": "verb",
            "sent1": "He used a hammer to anchos the nail into the wall.",
            "sent2": "She anchos the tent stakes into the ground to prevent it from blowing away.",
            "sent3": "The squirrel tried to anchos the acorn in the tree hollow for safekeeping.",
            "sent4": "The coach tried to anchos the team's victory by implementing a solid game plan.",
            "sent5": "The gardener needed to anchos the plant to the trellis to help it grow upright."
        },
        {
            "definition": "A type of chili pepper.",
            "pos": "noun",
            "sent1": "She added anchos to the stew to give it a spicy kick.",
            "sent2": "The recipe called for anchos to add flavor to the dish.",
            "sent3": "The anchos in the salsa made it too hot for some to handle.",
            "sent4": "The anchos on the pizza made it a fiery delight for those who loved heat.",
            "sent5": "The anchos plant in the garden bore red peppers ready for harvest."
        }
    ]
}