{
    "term": "ancipital",
    "meanings": [
        {
            "definition": "Having two heads or two faces.",
            "pos": "adjective",
            "sent1": "The ancient statue had an ancipital appearance with faces looking in opposite directions.",
            "sent2": "The mythological creature was described as ancipital, with a head on each end of its body.",
            "sent3": "The Halloween mask was designed to be ancipital, causing confusion as to which side was the front.",
            "sent4": "Her personality was ancipital, showing both a kind and a stern side depending on the situation.",
            "sent5": "The mirror reflected an ancipital image, showing two different angles of the room at once."
        },
        {
            "definition": "Uncertain or doubtful.",
            "pos": "adjective",
            "sent1": "The weather forecast for tomorrow is ancipital, predicting both rain and sunshine.",
            "sent2": "His answer to the question was ancipital, leaving everyone unsure of what he meant.",
            "sent3": "The magic trick left the audience in an ancipital state, not knowing if it was real or an illusion.",
            "sent4": "Her feelings towards him were ancipital, unsure if it was love or just friendship.",
            "sent5": "The decision to move to a new city was ancipital, causing mixed feelings of excitement and fear."
        },
        {
            "definition": "Having two opposite surfaces.",
            "pos": "adjective",
            "sent1": "The coin was ancipital, with heads on one side and tails on the other.",
            "sent2": "The ancient tablet was ancipital, inscribed with text on both sides.",
            "sent3": "The book cover was designed to be ancipital, featuring different images on the front and back.",
            "sent4": "The shield was ancipital, providing protection from attacks on both sides.",
            "sent5": "The gemstone was ancipital, reflecting light differently from its two opposite surfaces."
        }
    ]
}