{
    "term": "androcentrisms",
    "meanings": [
        {
            "definition": "The practice, conscious or otherwise, of placing a masculine point of view at the center of one's worldview.",
            "pos": "noun",
            "sent1": "In some cultures, androcentrisms dominate decision-making processes.",
            "sent2": "Her essay highlighted the prevalence of androcentrisms in historical narratives.",
            "sent3": "The comedy skit humorously portrayed the absurdity of androcentrisms in everyday interactions.",
            "sent4": "The androcentrisms in the novel were like a shadow, shaping every character's actions.",
            "sent5": "The androcentrisms in the media were so blatant, it was hard to ignore."
        },
        {
            "definition": "The belief that the male perspective is superior to the female perspective.",
            "pos": "noun",
            "sent1": "Androcentrisms can lead to unfair treatment of women in various fields.",
            "sent2": "Her speech challenged the androcentrisms deeply rooted in society.",
            "sent3": "The androcentrisms in the fairy tale were so exaggerated, it became comical.",
            "sent4": "The androcentrisms in his arguments were like a shield against opposing views.",
            "sent5": "The androcentrisms in the workplace created a toxic environment for female employees."
        },
        {
            "definition": "The tendency to prioritize male experiences and values over those of females.",
            "pos": "noun",
            "sent1": "Androcentrisms in education often overlook the needs of female students.",
            "sent2": "The androcentrisms in the literature reflected societal biases of the time.",
            "sent3": "The androcentrisms in the advertisement were so blatant, it was almost laughable.",
            "sent4": "Her artwork challenged the androcentrisms present in traditional galleries.",
            "sent5": "The androcentrisms in politics continue to hinder progress towards gender equality."
        }
    ]
}