{
    "term": "angiocardiography",
    "meanings": [
        {
            "definition": "A diagnostic procedure used to visualize the heart and blood vessels.",
            "pos": "noun",
            "sent1": "The doctor recommended angiocardiography to see inside my heart and blood vessels.",
            "sent2": "The hospital performed angiocardiography to check the condition of the patient's heart and blood vessels.",
            "sent3": "During the angiocardiography, the heart seemed to wave hello through the images.",
            "sent4": "The angiocardiography revealed the heart's secrets like a detective solving a mystery.",
            "sent5": "The angiocardiography made the heart and blood vessels appear like a colorful map."
        },
        {
            "definition": "The process of obtaining images of the heart and blood vessels using contrast material.",
            "pos": "noun",
            "sent1": "The technician explained the steps of angiocardiography to capture images of the heart and blood vessels.",
            "sent2": "The angiocardiography showed clear pictures of the heart and blood vessels after the procedure.",
            "sent3": "The contrast material in angiocardiography made the heart look like a glowing star.",
            "sent4": "Through angiocardiography, the heart and blood vessels emerged like characters in a story.",
            "sent5": "The images from angiocardiography resembled a beautiful painting of the heart and blood vessels."
        },
        {
            "definition": "The medical imaging technique that involves injecting a contrast dye into the blood vessels to assess heart function.",
            "pos": "noun",
            "sent1": "Angiocardiography helps doctors understand heart function by injecting dye into the blood vessels.",
            "sent2": "The hospital used angiocardiography to evaluate the heart's performance with contrast dye.",
            "sent3": "The contrast dye in angiocardiography made the blood vessels look like a rainbow road.",
            "sent4": "The heart's secrets were unveiled through angiocardiography like a magician revealing tricks.",
            "sent5": "The angiocardiography procedure illuminated the heart's inner workings like a spotlight on a stage."
        }
    ]
}