{
    "term": "angoras",
    "meanings": [
        {
            "definition": "A breed of domestic rabbit known for its long, soft fur.",
            "pos": "noun",
            "sent1": "The angoras in the petting zoo have fluffy fur.",
            "sent2": "She loves to cuddle with her angoras on the couch.",
            "sent3": "The angoras hopped around the garden, looking like little clouds.",
            "sent4": "Her angoras fur was as soft as a feather.",
            "sent5": "The angoras' fur was so long, it almost touched the ground."
        },
        {
            "definition": "A type of yarn made from the fur of an angora rabbit.",
            "pos": "noun",
            "sent1": "She knitted a cozy scarf using angoras yarn.",
            "sent2": "The store sells angoras yarn for knitting enthusiasts.",
            "sent3": "The angoras yarn was so fluffy, it felt like knitting with clouds.",
            "sent4": "The angoras yarn was as soft as a baby's blanket.",
            "sent5": "The angoras yarn created the warmest winter accessories."
        },
        {
            "definition": "A fabric made from angora wool.",
            "pos": "noun",
            "sent1": "Her sweater was made of angoras fabric.",
            "sent2": "The boutique offers luxurious angoras fabric for sale.",
            "sent3": "The angoras fabric felt like a warm hug.",
            "sent4": "The angoras fabric draped elegantly over her shoulders.",
            "sent5": "The angoras fabric was so soft, it was like wearing a cloud."
        },
        {
            "definition": "A type of domestic cat with long, silky fur.",
            "pos": "noun",
            "sent1": "The angoras cat purred contentedly on her lap.",
            "sent2": "He admired the beauty of the angoras cat's fur.",
            "sent3": "The angoras cat's fur shimmered in the sunlight.",
            "sent4": "The angoras cat's fur was as smooth as silk.",
            "sent5": "The angoras cat's fur was so luxurious, it was envy of all other cats."
        }
    ]
}