{
    "term": "animuses",
    "meanings": [
        {
            "definition": "Animuses: plural form of animus, meaning hostility or ill will.",
            "pos": "noun",
            "sent1": "The animuses between the two rival gangs led to frequent fights.",
            "sent2": "Her animuses towards her former boss were well-known in the office.",
            "sent3": "The animuses between the cats and dogs in the neighborhood made for some interesting encounters.",
            "sent4": "The animuses in the air were palpable, creating a tense atmosphere.",
            "sent5": "The animuses in the room were so strong that you could almost feel the negativity."
        },
        {
            "definition": "Animuses: plural form of animus, meaning a feeling of strong dislike or hatred.",
            "pos": "noun",
            "sent1": "His animuses towards broccoli made it hard for him to eat his vegetables.",
            "sent2": "The animuses she held towards her ex-boyfriend were hard to let go of.",
            "sent3": "The animuses she felt towards rainy days were quite irrational.",
            "sent4": "The animuses in her heart were like a dark cloud overshadowing her thoughts.",
            "sent5": "The animuses towards spiders were so intense that she couldn't even look at a picture of one."
        },
        {
            "definition": "Animuses: plural form of animus, meaning a motivation to do something.",
            "pos": "noun",
            "sent1": "The animuses behind his actions were always driven by a desire to succeed.",
            "sent2": "Her animuses to learn a new language led her to enroll in a class.",
            "sent3": "The animuses to explore the unknown were what drove the adventurers forward.",
            "sent4": "The animuses within him were like a fire that fueled his determination.",
            "sent5": "The animuses to protect her family were stronger than anything she had ever felt before."
        }
    ]
}