{
    "term": "animacies",
    "meanings": [
        {
            "definition": "The quality of having a lively or spirited nature.",
            "pos": "noun",
            "sent1": "Her animacies shone through as she danced joyfully in the meadow.",
            "sent2": "The puppy's animacies were contagious, bringing smiles to everyone around.",
            "sent3": "The animacies of the party reached a peak when the music started playing.",
            "sent4": "His animacies on stage were like a burst of colorful fireworks in the night sky.",
            "sent5": "The animacies of the forest at dawn were a sight to behold, with birds chirping and leaves rustling."
        },
        {
            "definition": "A feeling of closeness or intimacy between individuals.",
            "pos": "noun",
            "sent1": "Their animacies grew stronger as they shared their deepest thoughts with each other.",
            "sent2": "The animacies between the siblings were evident in the way they laughed and played together.",
            "sent3": "The animacies between the old friends was so strong, they could finish each other's sentences.",
            "sent4": "The animacies between the couple was like a warm blanket on a cold winter night.",
            "sent5": "The animacies between the team members created a bond that could not be broken, no matter what challenges they faced."
        },
        {
            "definition": "The state of being animated or lively.",
            "pos": "noun",
            "sent1": "The animacies of the cartoon characters brought smiles to the children's faces.",
            "sent2": "The party was filled with animacies, with people dancing and laughing all night long.",
            "sent3": "The animacies of the city streets at night gave a sense of excitement and energy.",
            "sent4": "Her animacies on stage captivated the audience, leaving them in awe of her talent.",
            "sent5": "The animacies of the marketplace were like a whirlwind of colors and sounds, drawing in visitors from all around."
        }
    ]
}