{
    "term": "anisometropic",
    "meanings": [
        {
            "definition": "Relating to a condition where there is a significant difference in refractive error between the two eyes.",
            "pos": "adjective",
            "sent1": "The anisometropic patient needed glasses with different prescriptions for each eye.",
            "sent2": "The optometrist diagnosed the patient with anisometropic vision and prescribed specialized lenses.",
            "sent3": "The anisometropic owl had one eye looking at the moon and the other at the sun.",
            "sent4": "Her vision was like an anisometropic puzzle, with each eye seeing a different piece of the picture.",
            "sent5": "The anisometropic condition made the world appear like a blurry, mismatched painting."
        },
        {
            "definition": "A person who has anisometropia.",
            "pos": "noun",
            "sent1": "The anisometropic struggled to find glasses that could correct their vision properly.",
            "sent2": "An anisometropic often requires customized eyewear to see clearly.",
            "sent3": "The anisometropic joked that they had 'eyes with different tastes' when picking out glasses.",
            "sent4": "She was an anisometropic, seeing the world through lenses that never quite matched.",
            "sent5": "The anisometropic was like a walking optical illusion, with eyes that saw the world differently."
        },
        {
            "definition": "The state of having anisometropia.",
            "pos": "noun",
            "sent1": "Living with anisometropic vision can present challenges in daily activities.",
            "sent2": "Anisometropic individuals may experience difficulties with depth perception.",
            "sent3": "The anisometropic state of her eyes made her a unique case for the eye doctor.",
            "sent4": "In a world of symmetry, she embraced her anisometropic reality.",
            "sent5": "The anisometropic state of her vision was like having two different worlds in one glance."
        }
    ]
}