{
    "term": "annexation",
    "meanings": [
        {
            "definition": "The action of annexing something, especially territory.",
            "pos": "noun",
            "sent1": "The annexation of the new land was celebrated by the townspeople.",
            "sent2": "The country's annexation of the neighboring island was met with mixed reactions.",
            "sent3": "During the game of Monopoly, the player's annexation of Boardwalk led to victory.",
            "sent4": "Her annexation of the top position in the company was swift and strategic.",
            "sent5": "The annexation of knowledge through reading is a lifelong pursuit."
        },
        {
            "definition": "The formal act of acquiring something, especially territory.",
            "pos": "noun",
            "sent1": "The treaty outlined the terms of annexation between the two nations.",
            "sent2": "The king signed the decree of annexation, officially claiming the new lands.",
            "sent3": "The penguin's annexation of the fish bucket at the zoo was quite a spectacle.",
            "sent4": "Her annexation of the title 'Queen of the Dance Floor' was well-deserved.",
            "sent5": "The annexation of the championship trophy brought tears of joy to the team."
        },
        {
            "definition": "The process of adding something, especially territory, to a larger whole.",
            "pos": "noun",
            "sent1": "The annexation of the smaller provinces into the empire strengthened its power.",
            "sent2": "The company's annexation of the competitor's market share was a strategic move.",
            "sent3": "The squirrel's annexation of all the acorns in the park caused a shortage.",
            "sent4": "Her annexation of new skills into her repertoire made her a versatile performer.",
            "sent5": "The annexation of diverse cultures into one community enriched everyone's lives."
        }
    ]
}