{
    "term": "annealing",
    "meanings": [
        {
            "definition": "Heat (metal or glass) and allow it to cool slowly in order to remove internal stresses and toughen it.",
            "pos": "verb",
            "sent1": "After forging the metal, the blacksmith practiced annealing it to make it stronger.",
            "sent2": "The glassblower carefully annealed the delicate glass vase to prevent it from shattering.",
            "sent3": "The metal was so stressed out, it needed a relaxing annealing session in the furnace.",
            "sent4": "The process of annealing is like giving the metal a soothing spa treatment to relieve its tension.",
            "sent5": "Annealing the metal is like giving it a warm hug to make it feel better."
        },
        {
            "definition": "Make (something) less brittle by heating it and allowing it to cool slowly.",
            "pos": "verb",
            "sent1": "By annealing the plastic, the toy manufacturer ensured it would not break easily.",
            "sent2": "The jeweler annealed the gold ring to prevent it from becoming too fragile.",
            "sent3": "The brittle cookie became more flexible after annealing in the oven.",
            "sent4": "Annealing the glass made it as tough as a superhero's shield.",
            "sent5": "Annealing the metal sword made it as strong as a dragon's scales."
        },
        {
            "definition": "Strengthen (metal) by heating and then cooling it.",
            "pos": "verb",
            "sent1": "The blacksmith annealed the sword to make it more durable in battle.",
            "sent2": "Annealing the steel beam made it capable of supporting heavy loads.",
            "sent3": "The metal chain felt like it had been to the gym after annealing.",
            "sent4": "Annealing the metal turned it into a mighty warrior ready for any challenge.",
            "sent5": "The process of annealing transformed the metal into a superhero with incredible strength."
        }
    ]
}