{
    "term": "annihilatory",
    "meanings": [
        {
            "definition": "Capable of annihilating or destroying completely.",
            "pos": "adjective",
            "sent1": "The superhero's annihilatory powers could obliterate any enemy in seconds.",
            "sent2": "The bomb had an annihilatory impact on the entire city, leaving nothing but ruins.",
            "sent3": "The toddler's tantrum had an annihilatory effect on the neatly arranged toys in the room.",
            "sent4": "The storm's winds were so annihilatory, they swept away everything in their path.",
            "sent5": "The virus spread with an annihilatory speed, infecting the entire population within days."
        },
        {
            "definition": "Involving or causing annihilation.",
            "pos": "adjective",
            "sent1": "The scientist's experiment had an annihilatory outcome, leading to the destruction of the lab.",
            "sent2": "The war had an annihilatory effect on the country, leaving it in ruins.",
            "sent3": "The chef's attempt at a new recipe had an unexpectedly annihilatory result.",
            "sent4": "The earthquake's force was so annihilatory, it leveled the entire town.",
            "sent5": "The dictator's reign was marked by an annihilatory approach to dissent, silencing all opposition."
        },
        {
            "definition": "Tending to annihilate or destroy.",
            "pos": "adjective",
            "sent1": "The aggressive dog had an annihilatory attitude towards any intruders on its territory.",
            "sent2": "The invasive species had an annihilatory impact on the local ecosystem, disrupting the balance.",
            "sent3": "The student's procrastination habits had an annihilatory effect on his academic performance.",
            "sent4": "The company's cost-cutting measures had an annihilatory effect on employee morale.",
            "sent5": "The dictator's policies were annihilatory, leading to widespread suffering among the population."
        }
    ]
}