{
    "term": "annotating",
    "meanings": [
        {
            "definition": "Add notes or comments to a text for explanation or interpretation.",
            "pos": "verb",
            "sent1": "She enjoys annotating her favorite books with colorful sticky notes.",
            "sent2": "Students often find it helpful when annotating their textbooks for better understanding.",
            "sent3": "While annotating her recipe book, she accidentally used a marker instead of a pen.",
            "sent4": "His annotations on the map were like bright stars guiding the way.",
            "sent5": "The artist was annotating her sketches with detailed descriptions to remember her ideas."
        },
        {
            "definition": "Provide explanatory notes or critical comments on a text.",
            "pos": "verb",
            "sent1": "The teacher asked the students to start annotating the poem with their thoughts.",
            "sent2": "Writers often annotate their drafts to improve clarity and coherence.",
            "sent3": "He couldn't resist annotating the menu with funny doodles while waiting for his food.",
            "sent4": "Her annotations on the manuscript were like a wise friend offering advice.",
            "sent5": "The scientist was annotating her findings with precise details to support her theory."
        },
        {
            "definition": "Mark or highlight key points in a text for future reference.",
            "pos": "verb",
            "sent1": "Please remember to start annotating the important dates in your planner.",
            "sent2": "It is common practice to annotate key passages in academic articles for quick review.",
            "sent3": "He was annotating the treasure map with colorful symbols to make it more fun.",
            "sent4": "The notes she left on the document were like beacons annotating the crucial information.",
            "sent5": "The detective was annotating the crime scene with small flags to mark evidence locations."
        }
    ]
}