{
    "term": "anointments",
    "meanings": [
        {
            "definition": "The act of anointing someone with oil as a religious ritual.",
            "pos": "noun",
            "sent1": "During the ceremony, the priest performed the anointments on the new king.",
            "sent2": "The anointments with holy oil were a sacred part of the religious service.",
            "sent3": "The anointments were so important that even the youngest members of the community understood their significance.",
            "sent4": "The anointments seemed to bestow a sense of peace and blessing upon those who received them.",
            "sent5": "The anointments glistened in the sunlight, symbolizing purity and divine favor."
        },
        {
            "definition": "The oil or ointment used in anointing.",
            "pos": "noun",
            "sent1": "The fragrant anointments filled the room with a soothing aroma.",
            "sent2": "She carefully prepared the anointments for the healing ceremony.",
            "sent3": "The anointments were so effective that they became known as 'miracle oils' in the village.",
            "sent4": "The anointments provided comfort and relief to those in need.",
            "sent5": "The anointments were a blend of rare herbs and oils, creating a unique and powerful mixture."
        },
        {
            "definition": "The act of choosing someone for a special role or purpose.",
            "pos": "noun",
            "sent1": "The anointments of the new leader were met with cheers and applause.",
            "sent2": "Her anointments as the team captain were well-deserved.",
            "sent3": "The anointments for the top job caused excitement and anticipation among the employees.",
            "sent4": "His anointments to key positions within the company brought about positive changes.",
            "sent5": "The anointments of the chosen candidate were celebrated with a grand ceremony."
        }
    ]
}