{
    "term": "anointment",
    "meanings": [
        {
            "definition": "The act of anointing with oil or ointment.",
            "pos": "noun",
            "sent1": "During the ceremony, the priest performed the anointment on the king's forehead.",
            "sent2": "The anointment of the athlete's muscles helped in their recovery after the game.",
            "sent3": "The anointment of the cake with frosting made it look like a delicious masterpiece.",
            "sent4": "Her anointment with confidence before the presentation made her shine like a star.",
            "sent5": "The anointment of the newborn baby's head with oil was a symbol of blessings and protection."
        },
        {
            "definition": "The oil or ointment used in anointing.",
            "pos": "noun",
            "sent1": "The fragrant anointment filled the room with a pleasant aroma.",
            "sent2": "She bought a special anointment for her dry skin to keep it moisturized.",
            "sent3": "The anointment spilled on the floor, making it slippery like a skating rink.",
            "sent4": "The luxurious anointment was a treat for her skin after a long day.",
            "sent5": "The anointment's soothing properties helped in calming the irritated skin."
        },
        {
            "definition": "The ceremonial act of applying oil or ointment as a religious rite.",
            "pos": "noun",
            "sent1": "The anointment of the holy relics was a sacred ritual performed by the priest.",
            "sent2": "The anointment of the altar with oil marked the beginning of the religious ceremony.",
            "sent3": "During the anointment, the priest accidentally spilled oil on his robe, causing a funny moment.",
            "sent4": "The anointment of the sacred statue brought a sense of peace to the worshippers.",
            "sent5": "The anointment of the participants before the ceremony symbolized their purity and dedication."
        }
    ]
}