{
    "term": "anoxic",
    "meanings": [
        {
            "definition": "relating to or characterized by a lack of oxygen",
            "pos": "adjective",
            "sent1": "The doctor explained that the patient's anoxic condition was due to a lack of oxygen in the blood.",
            "sent2": "The anoxic environment in the deep ocean can support unique forms of marine life.",
            "sent3": "The anoxic fish tank made the fish hold their breath and pretend to swim to the surface for air.",
            "sent4": "Her anoxic garden struggled to bloom, like flowers gasping for air in a vacuum.",
            "sent5": "The anoxic room felt suffocating, as if all the oxygen had been sucked out by a giant vacuum cleaner."
        },
        {
            "definition": "causing or resulting from a lack of oxygen",
            "pos": "adjective",
            "sent1": "The anoxic conditions in the room were making everyone feel dizzy and tired.",
            "sent2": "The anoxic atmosphere of the high-altitude mountain affected the climbers' breathing.",
            "sent3": "The anoxic party balloons refused to float, causing giggles among the guests.",
            "sent4": "His anoxic singing voice struggled to reach the high notes, like a bird with clipped wings.",
            "sent5": "The anoxic airplane cabin made passengers feel lightheaded, as if they were floating in space."
        },
        {
            "definition": "a condition in which there is a severe lack of oxygen",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with an anoxic episode after a near-drowning experience.",
            "sent2": "The anoxic state of the room was a result of a faulty ventilation system.",
            "sent3": "The anoxic marathon runner pretended to gasp for air dramatically at the finish line.",
            "sent4": "In the anoxic emergency room, the medical team worked quickly to provide oxygen to the patient.",
            "sent5": "The anoxic mountain climber struggled to breathe at high altitudes, gasping for each precious breath."
        }
    ]
}