{
    "term": "antagonisms",
    "meanings": [
        {
            "definition": "Active hostility or opposition",
            "pos": "noun",
            "sent1": "The antagonisms between the two rival gangs led to frequent fights.",
            "sent2": "The political debate was filled with antagonisms between the candidates.",
            "sent3": "The antagonisms between the two siblings over the TV remote were always amusing to watch.",
            "sent4": "The antagonisms in the workplace created a tense atmosphere that could be cut with a knife.",
            "sent5": "The deep-seated antagonisms between the neighboring countries made peace negotiations challenging."
        },
        {
            "definition": "A conflict or struggle between opposing forces",
            "pos": "noun",
            "sent1": "The antagonisms in the story added excitement to the plot.",
            "sent2": "The antagonisms between the hero and villain drove the narrative forward.",
            "sent3": "The antagonisms between the two sports teams made for an intense match.",
            "sent4": "The antagonisms between light and darkness symbolized the eternal struggle in the painting.",
            "sent5": "The antagonisms between the characters created a gripping tension throughout the movie."
        },
        {
            "definition": "The state of being opposed or hostile towards someone or something",
            "pos": "noun",
            "sent1": "The antagonisms towards change made it difficult to implement new policies.",
            "sent2": "The antagonisms towards outsiders were evident in the community's behavior.",
            "sent3": "The antagonisms towards vegetables were comically displayed by the picky eater.",
            "sent4": "The antagonisms towards authority figures were deeply rooted in the rebellious group.",
            "sent5": "The antagonisms towards the new technology were slowly fading as people adapted to its benefits."
        }
    ]
}