{
    "term": "antagonised",
    "meanings": [
        {
            "definition": "Cause someone to become hostile.",
            "pos": "verb",
            "sent1": "His constant teasing antagonised his little sister, making her upset.",
            "sent2": "The two rival teams antagonised each other throughout the game.",
            "sent3": "The mischievous puppy antagonised the grumpy old cat, leading to a playful chase around the yard.",
            "sent4": "The harsh words from the coach antagonised the player, fueling his determination to prove them wrong.",
            "sent5": "The loud noise from the construction site antagonised the residents, causing them to file complaints."
        },
        {
            "definition": "Act in opposition to.",
            "pos": "verb",
            "sent1": "She antagonised the proposed plan, suggesting a different approach.",
            "sent2": "The rebels decided to antagonise the oppressive regime by staging protests.",
            "sent3": "The mischievous squirrel antagonised the gardener by stealing nuts from the bird feeder.",
            "sent4": "The artist's bold brush strokes seemed to antagonise the traditional art critics.",
            "sent5": "The new policy seemed to antagonise the employees, leading to a decrease in morale."
        },
        {
            "definition": "Make someone feel angry or annoyed.",
            "pos": "verb",
            "sent1": "The constant noise from the construction site antagonised the residents, disrupting their peace.",
            "sent2": "Her sarcastic remarks antagonised her classmates, causing tension in the room.",
            "sent3": "The mischievous child antagonised his teacher by hiding her chalk, resulting in a playful chase.",
            "sent4": "The repetitive questions from the reporter antagonised the interviewee, making them defensive.",
            "sent5": "The slow service at the restaurant antagonised the hungry customers, leading to complaints."
        }
    ]
}