{
    "term": "antagonized",
    "meanings": [
        {
            "definition": "Cause (someone) to become hostile.",
            "pos": "verb",
            "sent1": "His constant teasing antagonized his little sister, making her very upset.",
            "sent2": "The rival gang antagonized our group by starting a fight.",
            "sent3": "The mischievous squirrel antagonized the grumpy old cat, leading to a hilarious chase around the yard.",
            "sent4": "The dark clouds antagonized the sun, blocking its warm rays from reaching the earth.",
            "sent5": "The loud noise of the construction site antagonized the peaceful neighborhood, disrupting its usual tranquility."
        },
        {
            "definition": "Act in opposition to.",
            "pos": "verb",
            "sent1": "She always antagonized his ideas, never agreeing with anything he proposed.",
            "sent2": "The protestors antagonized the government's decision to cut down the ancient trees.",
            "sent3": "The stubborn goat antagonized the farmer's attempts to herd it back into the pen.",
            "sent4": "The strong winds antagonized the sailboat's progress, pushing it off course.",
            "sent5": "The detective's findings antagonized the suspect's alibi, casting doubt on his innocence."
        },
        {
            "definition": "Make (someone) feel angry or annoyed.",
            "pos": "verb",
            "sent1": "The constant buzzing of the mosquito antagonized him, keeping him awake all night.",
            "sent2": "Her sarcastic remarks antagonized her classmates, causing tension in the room.",
            "sent3": "The playful puppy antagonized the sleepy cat, earning a swat on the nose.",
            "sent4": "The broken air conditioner antagonized the office workers, making the room unbearably hot.",
            "sent5": "The repetitive sound of the dripping faucet antagonized her nerves, driving her to fix it immediately."
        }
    ]
}