{
    "term": "antas",
    "meanings": [
        {
            "definition": "A projecting beam or timber used in supporting a building.",
            "pos": "noun",
            "sent1": "The antas in the old house were strong and held up the roof.",
            "sent2": "The construction worker placed the antas carefully to ensure the stability of the structure.",
            "sent3": "The mischievous cat climbed the antas and pretended to be a king surveying his kingdom.",
            "sent4": "The antas of the building stood tall like guardians protecting the inhabitants within.",
            "sent5": "The antas creaked under the weight of the heavy snow, but they did not falter."
        },
        {
            "definition": "A decorative architectural element resembling a half-column.",
            "pos": "noun",
            "sent1": "The elegant antas added a touch of sophistication to the entrance of the building.",
            "sent2": "The antas were intricately carved with floral patterns, enhancing the beauty of the structure.",
            "sent3": "The mischievous child tried to hide behind the antas, thinking they could shield him from view.",
            "sent4": "The antas stood proudly like soldiers at attention, welcoming visitors with grace.",
            "sent5": "The golden antas gleamed in the sunlight, casting a warm glow on the facade of the building."
        },
        {
            "definition": "A type of antelope found in Africa.",
            "pos": "noun",
            "sent1": "The graceful antas roamed the savannah in search of fresh grass.",
            "sent2": "The antas moved swiftly across the plains, their horns glistening in the sunlight.",
            "sent3": "The mischievous monkey tried to imitate the antas' graceful movements but ended up tripping over its own feet.",
            "sent4": "The antas' swift agility in evading predators was a sight to behold in the vast African landscape.",
            "sent5": "The herd of antas moved as one, a beautiful dance of nature in the wild."
        }
    ]
}