{
    "term": "anthraxes",
    "meanings": [
        {
            "definition": "A serious infectious disease caused by the bacterium Bacillus anthracis.",
            "pos": "noun",
            "sent1": "The doctors worked tirelessly to treat the anthraxes affecting the community.",
            "sent2": "The outbreak of anthraxes in the region led to widespread concern.",
            "sent3": "The anthraxes decided to throw a party inside the human body, but the immune system wasn't invited.",
            "sent4": "Fear spread through the town like anthraxes, infecting every corner with panic.",
            "sent5": "The anthraxes crept through the population like a silent predator, leaving devastation in its wake."
        },
        {
            "definition": "The plural form of anthrax, referring to multiple instances of the disease.",
            "pos": "noun",
            "sent1": "The hospital was overwhelmed with the anthraxes cases pouring in.",
            "sent2": "The anthraxes outbreaks in different regions required coordinated efforts to contain.",
            "sent3": "The anthraxes gathered for a group photo, causing chaos in the medical records.",
            "sent4": "The anthraxes multiplied like rabbits, spreading faster than anticipated.",
            "sent5": "The anthraxes incidents dotted the map like warning signs of danger ahead."
        },
        {
            "definition": "A biological weapon made from the spores of Bacillus anthracis.",
            "pos": "noun",
            "sent1": "The military developed anthraxes to use in warfare, causing global concern.",
            "sent2": "The threat of anthraxes being used as a weapon prompted strict security measures.",
            "sent3": "The anthraxes spores played hide and seek in the laboratory, much to the scientists' dismay.",
            "sent4": "The idea of anthraxes as a weapon loomed over the peace talks like a dark cloud.",
            "sent5": "The anthraxes weaponized nature's own power, turning it against humanity."
        }
    ]
}