{
    "term": "antithrombins",
    "meanings": [
        {
            "definition": "Antithrombins: Substances that inhibit blood clotting.",
            "pos": "noun",
            "sent1": "The antithrombins in his body helped stop the bleeding quickly.",
            "sent2": "Doctors use antithrombins to prevent dangerous blood clots from forming.",
            "sent3": "The antithrombins in the medicine were like tiny superheroes fighting against clotting.",
            "sent4": "Her quick thinking acted as antithrombins, preventing a disastrous situation.",
            "sent5": "The antithrombins worked like a shield, protecting the blood from clotting too much."
        },
        {
            "definition": "Antithrombins: Proteins that prevent the formation of blood clots.",
            "pos": "noun",
            "sent1": "The antithrombins in his body kept his blood flowing smoothly.",
            "sent2": "Certain foods contain antithrombins that help maintain healthy circulation.",
            "sent3": "The antithrombins in the blood were like diligent gatekeepers, stopping clots from forming.",
            "sent4": "Her care and attention acted as antithrombins, ensuring no clots would disrupt the flow.",
            "sent5": "The antithrombins were like skilled craftsmen, sculpting the blood flow to perfection."
        },
        {
            "definition": "Antithrombins: Medications used to prevent blood clots.",
            "pos": "noun",
            "sent1": "The doctor prescribed antithrombins to reduce the risk of clotting.",
            "sent2": "Patients often take antithrombins after surgery to avoid complications.",
            "sent3": "The antithrombins in the pill bottle were like tiny protectors against clots.",
            "sent4": "Her daily dose of antithrombins acted as a safety net, guarding against clots.",
            "sent5": "The antithrombins were like vigilant guards, patrolling the blood vessels for any signs of clotting."
        }
    ]
}