{
    "term": "antirealists",
    "meanings": [
        {
            "definition": "Those who reject the existence of objective reality.",
            "pos": "noun",
            "sent1": "The antirealists in the group argued passionately against the idea of a shared reality.",
            "sent2": "Many antirealists base their beliefs on the concept of subjective experiences.",
            "sent3": "The antirealists at the meeting joked about living in their own separate worlds.",
            "sent4": "In a world of antirealists, truth becomes a mere illusion.",
            "sent5": "The classroom discussion on antirealists left a lasting impression on the students."
        },
        {
            "definition": "A person who denies the existence of an independent, external world.",
            "pos": "noun",
            "sent1": "She was known among her friends as an antirealists due to her unconventional views on reality.",
            "sent2": "The antirealists firmly believed that everything we perceive is a product of our minds.",
            "sent3": "The antirealists' refusal to acknowledge the outside world led to some interesting debates.",
            "sent4": "Living as an antirealists meant constantly questioning the nature of existence.",
            "sent5": "The novel's protagonist was portrayed as an antirealists who struggled with accepting the world around him."
        },
        {
            "definition": "Those who believe that reality is a mental construct.",
            "pos": "noun",
            "sent1": "The antirealists in the philosophy club discussed the idea of reality as a product of the mind.",
            "sent2": "As antirealists, they viewed the world through the lens of perception and interpretation.",
            "sent3": "The antirealists' perspective on reality often led to intriguing conversations.",
            "sent4": "In the realm of antirealists, imagination holds more power than physical existence.",
            "sent5": "The artist's work was influenced by the antirealists' philosophy of reality as a mental creation."
        }
    ]
}