{
    "term": "antiblackism",
    "meanings": [
        {
            "definition": "Prejudice or discrimination against black people.",
            "pos": "noun",
            "sent1": "Antiblackism is a form of unfair treatment towards black individuals.",
            "sent2": "The community is working together to combat antiblackism and promote equality.",
            "sent3": "Even though it's wrong, some people still hold onto antiblackism beliefs.",
            "sent4": "The shadow of antiblackism looms over our society, casting a dark cloud over progress.",
            "sent5": "The scars of antiblackism run deep, leaving lasting pain and division."
        },
        {
            "definition": "The belief or attitude that black people are inferior to others.",
            "pos": "noun",
            "sent1": "Antiblackism perpetuates the harmful idea that black individuals are lesser.",
            "sent2": "Educating others is crucial in dismantling the harmful effects of antiblackism.",
            "sent3": "It's absurd to think antiblackism has any basis in reality.",
            "sent4": "The poison of antiblackism seeps into the minds of those who refuse to see equality.",
            "sent5": "The roots of antiblackism grow from ignorance and fear, choking out compassion."
        },
        {
            "definition": "Actions or policies that harm or disadvantage black individuals or communities.",
            "pos": "noun",
            "sent1": "Antiblackism in legislation must be addressed to create a fair society.",
            "sent2": "The effects of antiblackism can be seen in the disparities in healthcare access.",
            "sent3": "Some individuals profit from the perpetuation of antiblackism, which is truly despicable.",
            "sent4": "The chains of antiblackism bind progress and hinder true equality.",
            "sent5": "The battle against antiblackism is ongoing, but unity will prevail over division."
        }
    ]
}