{
    "term": "anticommercialism",
    "meanings": [
        {
            "definition": "Opposition to or rejection of commercialism.",
            "pos": "noun",
            "sent1": "Her strong anticommercialism led her to support local businesses.",
            "sent2": "The community's anticommercialism was evident in their boycott of big corporations.",
            "sent3": "Despite his anticommercialism, he couldn't resist buying a popular brand of sneakers.",
            "sent4": "In a world dominated by consumerism, her anticommercialism stood out like a beacon.",
            "sent5": "The artist's anticommercialism was reflected in his refusal to sell his work for profit."
        },
        {
            "definition": "The belief or practice of avoiding or criticizing commercial activities.",
            "pos": "noun",
            "sent1": "Her anticommercialism made her choose handmade gifts over store-bought ones.",
            "sent2": "The group's anticommercialism extended to their rejection of online shopping.",
            "sent3": "Despite his anticommercialism, he couldn't resist the allure of a Black Friday sale.",
            "sent4": "Her anticommercialism was like a shield against the constant barrage of advertisements.",
            "sent5": "The teacher's anticommercialism inspired her students to think critically about consumer culture."
        },
        {
            "definition": "A movement or ideology that seeks to reduce the influence of commercial interests.",
            "pos": "noun",
            "sent1": "Their anticommercialism led to the establishment of a farmers' market in the neighborhood.",
            "sent2": "The political party's anticommercialism resonated with voters tired of corporate influence.",
            "sent3": "Despite his anticommercialism, he found himself drawn to the convenience of online shopping.",
            "sent4": "The group's anticommercialism was a breath of fresh air in a world driven by profit.",
            "sent5": "The activist's anticommercialism inspired others to question the impact of consumerism on society."
        }
    ]
}