{
    "term": "antievolutionism",
    "meanings": [
        {
            "definition": "Opposition to the theory of evolution.",
            "pos": "noun",
            "sent1": "Her antievolutionism was evident in her refusal to accept any scientific evidence supporting evolution.",
            "sent2": "The antievolutionism of the group led to heated debates in the science class.",
            "sent3": "The antievolutionism of the cat was clear when it refused to believe in the theory of evolution.",
            "sent4": "His antievolutionism was like a wall blocking any discussions about the topic.",
            "sent5": "The antievolutionism in the room was palpable, with everyone holding firm to their beliefs."
        },
        {
            "definition": "The belief or movement that rejects the concept of evolution.",
            "pos": "noun",
            "sent1": "Their antievolutionism was so strong that they formed a group to protest against the teaching of evolution in schools.",
            "sent2": "The rise of antievolutionism in the community caused a divide among the residents.",
            "sent3": "The antievolutionism of the squirrel was comical as it tried to argue against the concept of evolution.",
            "sent4": "In a sea of ideas, his antievolutionism stood out like a bright red flag.",
            "sent5": "The intensity of her antievolutionism could be felt in every conversation she had about evolution."
        },
        {
            "definition": "A stance against the acceptance of evolutionary principles.",
            "pos": "noun",
            "sent1": "His antievolutionism was so strong that he refused to even consider the possibility of evolution.",
            "sent2": "The antievolutionism of the group was based on their religious beliefs.",
            "sent3": "The antievolutionism of the penguin was amusing as it tried to argue against the concept of evolution with its waddling.",
            "sent4": "Her antievolutionism was like a shield protecting her from any discussions about evolution.",
            "sent5": "The room was filled with tension due to the strong antievolutionism of the attendees."
        }
    ]
}