{
    "term": "antimodernism",
    "meanings": [
        {
            "definition": "Opposition to modern ideas or practices.",
            "pos": "noun",
            "sent1": "Her antimodernism was evident in her refusal to use any technology beyond a basic flip phone.",
            "sent2": "The group's antimodernism led them to reject the new educational curriculum.",
            "sent3": "Despite her antimodernism, she couldn't resist the convenience of online shopping.",
            "sent4": "His antimodernism was like a shield against the fast-paced changes of the modern world.",
            "sent5": "The town's antimodernism was so strong that they still relied on horse-drawn carriages for transportation."
        },
        {
            "definition": "A belief or movement against modernity.",
            "pos": "noun",
            "sent1": "The rise of antimodernism in the art world challenged the status quo.",
            "sent2": "Their antimodernism was rooted in a deep respect for traditional craftsmanship.",
            "sent3": "The antimodernism of the group was so extreme that they refused to use electricity.",
            "sent4": "In a world of rapid change, his antimodernism stood out like a beacon of resistance.",
            "sent5": "The antimodernism of the community was a testament to their commitment to preserving the past."
        },
        {
            "definition": "The rejection of modernism in favor of traditional values.",
            "pos": "noun",
            "sent1": "Her antimodernism clashed with the school's push for technological advancement.",
            "sent2": "The village's antimodernism was reflected in their celebration of ancient rituals.",
            "sent3": "Despite his antimodernism, he couldn't resist the allure of modern conveniences.",
            "sent4": "The artist's antimodernism was a bold statement against the trends of the art world.",
            "sent5": "The family's antimodernism was like a time capsule preserving the customs of their ancestors."
        }
    ]
}