{
    "term": "antitechnological",
    "meanings": [
        {
            "definition": "Opposed to or against technology.",
            "pos": "adjective",
            "sent1": "She was known for her antitechnological views, preferring books over computers.",
            "sent2": "The small village had an antitechnological vibe, with no smartphones in sight.",
            "sent3": "The antitechnological cat refused to play with the robotic mouse toy.",
            "sent4": "His antitechnological mindset was a barrier to embracing modern conveniences.",
            "sent5": "The antitechnological protest aimed to raise awareness about the dangers of excessive technology use."
        },
        {
            "definition": "Characterized by a lack of technological advancements.",
            "pos": "adjective",
            "sent1": "The antitechnological society still used old-fashioned tools for farming.",
            "sent2": "Their antitechnological infrastructure struggled to keep up with the neighboring cities.",
            "sent3": "The antitechnological museum displayed ancient artifacts with no digital enhancements.",
            "sent4": "The antitechnological town seemed frozen in time, untouched by progress.",
            "sent5": "Living in an antitechnological world felt like stepping back into history."
        },
        {
            "definition": "Resistant to the use of technology.",
            "pos": "adjective",
            "sent1": "Grandma's antitechnological nature meant she preferred handwritten letters to emails.",
            "sent2": "The antitechnological group protested against the implementation of new software.",
            "sent3": "The antitechnological toddler threw a tantrum when handed a tablet.",
            "sent4": "His antitechnological tendencies made it challenging for him to adapt to the digital age.",
            "sent5": "The antitechnological activist urged people to disconnect from screens and reconnect with nature."
        }
    ]
}