{
    "term": "antifatigue",
    "meanings": [
        {
            "definition": "Preventing or reducing fatigue",
            "pos": "adjective",
            "sent1": "She bought an antifatigue mat for her kitchen to make standing more comfortable.",
            "sent2": "The antifatigue shoes he wore helped him stay energized during his long shift.",
            "sent3": "The antifatigue socks were so effective that she felt like she could dance all night.",
            "sent4": "His positive attitude acted as an antifatigue shield, keeping exhaustion at bay.",
            "sent5": "The antifatigue drink gave him a burst of energy that lasted throughout the day."
        },
        {
            "definition": "A substance or product designed to combat fatigue",
            "pos": "noun",
            "sent1": "She relied on the antifatigue supplements to keep her going during busy days.",
            "sent2": "The antifatigue gel provided instant relief to his tired muscles after the workout.",
            "sent3": "The antifatigue snack bar was her secret weapon for staying alert during meetings.",
            "sent4": "The antifatigue lotion worked like magic, rejuvenating her skin after a long day.",
            "sent5": "The antifatigue eye mask helped her relax and unwind after a stressful day at work."
        },
        {
            "definition": "The quality of being resistant to fatigue",
            "pos": "noun",
            "sent1": "His antifatigue endurance impressed everyone during the marathon.",
            "sent2": "The antifatigue resilience of the material made it ideal for long-lasting use.",
            "sent3": "The antifatigue spirit of the team kept them going even in challenging times.",
            "sent4": "Her antifatigue mindset allowed her to push through obstacles with determination.",
            "sent5": "The antifatigue nature of the fabric ensured comfort even after hours of wear."
        }
    ]
}