{
    "term": "antigravity",
    "meanings": [
        {
            "definition": "A hypothetical force that counteracts gravity.",
            "pos": "noun",
            "sent1": "Scientists study antigravity to understand how it could change space travel.",
            "sent2": "The spaceship used advanced antigravity technology to float effortlessly in space.",
            "sent3": "In the movie, the characters built a machine that created antigravity, leading to hilarious mishaps.",
            "sent4": "Her laughter had an antigravity effect on everyone in the room, lifting their spirits instantly.",
            "sent5": "The concept of antigravity in science fiction novels opens up endless possibilities for storytelling."
        },
        {
            "definition": "A device or technology that negates the effects of gravity.",
            "pos": "noun",
            "sent1": "The antigravity device allowed the car to hover above the ground.",
            "sent2": "The futuristic suit was equipped with antigravity technology for enhanced mobility.",
            "sent3": "The inventor's latest creation, an antigravity machine, caused quite a stir at the science fair.",
            "sent4": "Her smile seemed to possess an antigravity quality, lifting the mood of everyone around her.",
            "sent5": "The antigravity boots made walking feel like floating on air, a truly remarkable experience."
        },
        {
            "definition": "The absence of gravitational pull.",
            "pos": "noun",
            "sent1": "In space, astronauts experience moments of antigravity where they float freely.",
            "sent2": "The sensation of antigravity on the amusement park ride thrilled the children.",
            "sent3": "The magician's trick created an illusion of antigravity, leaving the audience in awe.",
            "sent4": "Her dance moves defied gravity, giving the impression of antigravity in motion.",
            "sent5": "Experiencing true antigravity during a zero-gravity flight is a once-in-a-lifetime adventure."
        }
    ]
}