{
    "term": "antifur",
    "meanings": [
        {
            "definition": "Opposed to or against fur.",
            "pos": "adjective",
            "sent1": "She is very antifur and refuses to wear any clothing made from animal fur.",
            "sent2": "The antifur campaign gained support from many animal lovers.",
            "sent3": "The antifur activist joked that she would rather freeze than wear a fur coat.",
            "sent4": "Her antifur stance was as strong as a steel wall, unwavering and resolute.",
            "sent5": "The bright red sign with 'Antifur' in bold letters caught everyone's attention at the protest."
        },
        {
            "definition": "A person or group who opposes the use of fur in clothing.",
            "pos": "noun",
            "sent1": "The antifur organized a peaceful protest outside the fur store.",
            "sent2": "Many celebrities have joined the antifur movement to raise awareness.",
            "sent3": "The antifur group handed out leaflets with cute animals wearing 'No Fur' t-shirts.",
            "sent4": "She stood out in the crowd like an antifur beacon, spreading her message of compassion.",
            "sent5": "The antifur supporters chanted slogans against fur trade, their voices echoing through the streets."
        },
        {
            "definition": "A substance or treatment used to prevent the growth of fur on animals.",
            "pos": "noun",
            "sent1": "The antifur spray was applied to the rabbits to keep their fur short.",
            "sent2": "The antifur treatment was effective in reducing the fur growth on the cats.",
            "sent3": "The zookeeper joked that he wished there was an antifur potion for shedding season.",
            "sent4": "The antifur solution worked like magic, leaving the animals with smooth skin.",
            "sent5": "The antifur powder created a barrier that stopped fur from growing, much to the surprise of the researchers."
        }
    ]
}