{
    "term": "antisocialist",
    "meanings": [
        {
            "definition": "Opposed to socialism.",
            "pos": "adjective",
            "sent1": "She is known for her antisocialist views on government policies.",
            "sent2": "The group's antisocialist stance led to heated debates within the community.",
            "sent3": "The antisocialist cat refused to share its toys with other felines.",
            "sent4": "His antisocialist behavior was like a wall blocking any socialist ideas from entering his mind.",
            "sent5": "The antisocialist attitude of the student made it challenging for the teacher to discuss socialism in class."
        },
        {
            "definition": "A person who opposes socialism.",
            "pos": "noun",
            "sent1": "As an antisocialist, he actively campaigned against socialist policies.",
            "sent2": "The antisocialist attended the rally to voice his concerns about government intervention.",
            "sent3": "The antisocialist joked that he would rather swim with sharks than support socialism.",
            "sent4": "In the political ocean, the antisocialist was a lone fish swimming against the socialist current.",
            "sent5": "The antisocialist's passion for individual freedom was evident in every debate about socialism."
        },
        {
            "definition": "Behaving in a manner that is contrary to the principles of socialism.",
            "pos": "adjective",
            "sent1": "Her antisocialist actions at the community center caused quite a stir.",
            "sent2": "The antisocialist behavior of the group alienated them from the socialist movement.",
            "sent3": "The antisocialist squirrel hoarded all the nuts for itself, ignoring the needs of others.",
            "sent4": "His antisocialist choices painted him as a rebel in the eyes of the socialist community.",
            "sent5": "The antisocialist graffiti on the wall symbolized a defiance against socialist ideals."
        }
    ]
}