{
    "term": "antiurban",
    "meanings": [
        {
            "definition": "Opposed to urbanization or city life.",
            "pos": "adjective",
            "sent1": "She preferred the quiet countryside to the bustling city, showing her antiurban tendencies.",
            "sent2": "The antiurban sentiment in the small town was evident in their resistance to building skyscrapers.",
            "sent3": "The antiurban cat refused to leave the peaceful meadow for the noisy streets.",
            "sent4": "His antiurban mindset was like a shield protecting him from the chaos of city living.",
            "sent5": "The antiurban landscape was a serene escape from the crowded urban jungle."
        },
        {
            "definition": "A person who is against urban development.",
            "pos": "noun",
            "sent1": "The activist was known as an antiurban for protesting the construction of high-rise buildings.",
            "sent2": "As an antiurban, she believed in preserving the natural beauty of the countryside.",
            "sent3": "The antiurban joked that he would rather live in a treehouse than a city apartment.",
            "sent4": "She stood out in the city crowd like an antiurban beacon shining against the urban backdrop.",
            "sent5": "The antiurban's passion for green spaces was contagious among the city dwellers."
        },
        {
            "definition": "A movement or policy that is against the growth of cities.",
            "pos": "noun",
            "sent1": "The antiurban gained momentum as more people joined the movement against city expansion.",
            "sent2": "Support for the antiurban policy grew as concerns about overpopulation in cities increased.",
            "sent3": "The antiurban initiative aimed to promote sustainable living outside of urban areas.",
            "sent4": "The antiurban movement was like a shield protecting rural landscapes from urban sprawl.",
            "sent5": "The antiurban policy was a beacon of hope for those seeking a balance between city and nature."
        }
    ]
}