{
    "term": "anticorporate",
    "meanings": [
        {
            "definition": "Opposed to or against corporations.",
            "pos": "adjective",
            "sent1": "She held strong anticorporate beliefs and refused to support big businesses.",
            "sent2": "The activist group organized an anticorporate protest against unfair labor practices.",
            "sent3": "The anticorporate rally had everyone wearing homemade protest signs.",
            "sent4": "Her anticorporate stance was like a shield against the influence of big companies.",
            "sent5": "The anticorporate movement gained momentum as more people joined the cause."
        },
        {
            "definition": "Not conforming to or associated with corporate culture.",
            "pos": "adjective",
            "sent1": "His anticorporate attire stood out in the sea of suits and ties.",
            "sent2": "The startup company had an anticorporate vibe with its casual dress code and flexible work hours.",
            "sent3": "The anticorporate office space had bean bag chairs and a ping pong table.",
            "sent4": "Her anticorporate style was a breath of fresh air in the corporate world.",
            "sent5": "The anticorporate approach to business emphasized creativity over conformity."
        },
        {
            "definition": "A person or organization that resists or challenges corporate influence.",
            "pos": "noun",
            "sent1": "He became known as an anticorporate after speaking out against unethical business practices.",
            "sent2": "The anticorporate was featured in a documentary highlighting their fight for consumer rights.",
            "sent3": "The anticorporate's witty slogans made their message resonate with a wide audience.",
            "sent4": "She was a beacon of hope for others looking to join the anticorporate movement.",
            "sent5": "The anticorporate's impact on the community was undeniable as more people rallied behind their cause."
        }
    ]
}