{
    "term": "antiauthoritarian",
    "meanings": [
        {
            "definition": "Opposed to or against authority.",
            "pos": "adjective",
            "sent1": "The antiauthoritarian group protested peacefully against the strict rules.",
            "sent2": "She has an antiauthoritarian attitude towards strict regulations.",
            "sent3": "The antiauthoritarian cat refused to obey the command to stay off the couch.",
            "sent4": "Her antiauthoritarian spirit soared like a rebellious bird against the rules.",
            "sent5": "The antiauthoritarian stance of the students was evident in their peaceful demonstration."
        },
        {
            "definition": "A person who opposes or resists authority.",
            "pos": "noun",
            "sent1": "The antiauthoritarian stood up against the unjust ruler.",
            "sent2": "She became an antiauthoritarian after witnessing the abuse of power.",
            "sent3": "The antiauthoritarian joked that even the pigeons in the park seemed to have more authority.",
            "sent4": "In the meeting, he was the lone antiauthoritarian voice in a sea of conformity.",
            "sent5": "The antiauthoritarian's presence was like a refreshing breeze in the stifling room full of rules."
        },
        {
            "definition": "A movement or ideology that rejects authoritarianism.",
            "pos": "noun",
            "sent1": "The antiauthoritarian gained momentum among the youth seeking freedom.",
            "sent2": "They joined the antiauthoritarian movement to promote equality and democracy.",
            "sent3": "The antiauthoritarian potluck party humorously had no assigned seating.",
            "sent4": "The antiauthoritarian ideology bloomed like a colorful garden in the minds of the people.",
            "sent5": "The antiauthoritarian movement painted a vivid picture of a world without oppressive rulers."
        }
    ]
}