{
    "term": "antimodern",
    "meanings": [
        {
            "definition": "Opposed to modern ideas or practices.",
            "pos": "adjective",
            "sent1": "She preferred the traditional ways and was quite antimodern in her thinking.",
            "sent2": "The antimodern art exhibit showcased pieces inspired by ancient techniques.",
            "sent3": "The antimodern professor refused to use a computer, insisting on writing on a chalkboard.",
            "sent4": "His antimodern views on architecture clashed with the sleek, modern designs of the city.",
            "sent5": "The antimodern movement aimed to preserve historical buildings from being demolished."
        },
        {
            "definition": "A person who opposes modernity.",
            "pos": "noun",
            "sent1": "As an antimodern, he often spoke out against technological advancements.",
            "sent2": "The antimodern believed that progress was not always beneficial to society.",
            "sent3": "The antimodern's refusal to use a smartphone led to some humorous misunderstandings.",
            "sent4": "In a world of constant change, the antimodern stood firm like a rock against the tide of modernity.",
            "sent5": "The antimodern's presence at the conference sparked debates on the impact of technology on culture."
        },
        {
            "definition": "Not conforming to modern standards or trends.",
            "pos": "adjective",
            "sent1": "Her antimodern fashion sense drew attention for its unique vintage style.",
            "sent2": "The quaint little bookstore had an antimodern charm that attracted book lovers.",
            "sent3": "The antimodern kitchen appliances may look old-fashioned but work just as well.",
            "sent4": "The small village remained antimodern, untouched by the fast-paced world around it.",
            "sent5": "The antimodern approach to education focused on classical literature and handwriting skills."
        }
    ]
}