{
    "term": "antipole",
    "meanings": [
        {
            "definition": "A direct or exact opposite.",
            "pos": "noun",
            "sent1": "My sister is my antipole, always wanting to go out while I prefer staying in.",
            "sent2": "The villain in the movie was the antipole of the hero, causing chaos wherever he went.",
            "sent3": "In a funny twist, the cat and dog seemed to switch roles, with the cat becoming the antipole of the usual troublemaker.",
            "sent4": "Her cheerful demeanor was the antipole to his gloomy outlook on life.",
            "sent5": "The peaceful garden was the antipole of the noisy city streets."
        },
        {
            "definition": "A point directly opposite another point on the earth's surface.",
            "pos": "noun",
            "sent1": "The antipole of our location on the globe is a remote island in the Pacific Ocean.",
            "sent2": "When you dig a hole straight through the Earth, you end up at the antipole of your starting point.",
            "sent3": "The treasure map led them to the antipole of the old oak tree, where they found a hidden chest.",
            "sent4": "The antipole of the North Pole is the South Pole, creating a balance in the Earth's magnetic field.",
            "sent5": "The antipole of the equator is the imaginary line that divides the Earth into the Northern and Southern Hemispheres."
        },
        {
            "definition": "A person or thing that is the exact opposite of another.",
            "pos": "noun",
            "sent1": "He was the antipole of his twin brother, always calm and collected while his brother was energetic and spontaneous.",
            "sent2": "The black swan was considered the antipole of the white swan, symbolizing contrast and duality.",
            "sent3": "The tiny seed grew into a towering tree, becoming the antipole of its humble beginnings.",
            "sent4": "Her love for adventure was the antipole of his fear of the unknown.",
            "sent5": "The bright morning sun was the antipole of the dark night sky."
        }
    ]
}