{
    "term": "antistrike",
    "meanings": [
        {
            "definition": "Opposed to or against a strike.",
            "pos": "adjective",
            "sent1": "The antistrike measures helped maintain peace in the workplace.",
            "sent2": "The company's antistrike stance was well-known among the employees.",
            "sent3": "The antistrike policy was so effective that the workers joked they forgot what a strike even looked like.",
            "sent4": "Her antistrike attitude was like a shield protecting the company from labor disputes.",
            "sent5": "The vivid image of an antistrike banner flying high symbolized unity and cooperation."
        },
        {
            "definition": "A person or organization that works against strikes.",
            "pos": "noun",
            "sent1": "The antistrike was praised for finding peaceful solutions to labor conflicts.",
            "sent2": "The antistrike's efforts helped prevent disruptions in the industry.",
            "sent3": "The antistrike's office was filled with posters promoting harmony and understanding.",
            "sent4": "She was like an antistrike superhero, swooping in to resolve disputes with ease.",
            "sent5": "The antistrike's presence was a beacon of hope during turbulent times in the labor movement."
        },
        {
            "definition": "A policy or action aimed at preventing or stopping strikes.",
            "pos": "noun",
            "sent1": "The company implemented an antistrike strategy to ensure smooth operations.",
            "sent2": "The government's antistrike measures helped maintain stability in the labor market.",
            "sent3": "The antistrike initiative received praise for its innovative approach to labor relations.",
            "sent4": "Their antistrike plan was like a well-oiled machine, swiftly addressing any potential conflicts.",
            "sent5": "The impact of the antistrike campaign was felt across the entire industry, bringing about a new era of cooperation."
        }
    ]
}