{
    "term": "antihero",
    "meanings": [
        {
            "definition": "A central character in a story who lacks traditional heroic qualities.",
            "pos": "noun",
            "sent1": "In the movie, the antihero reluctantly saved the day without any flashy heroics.",
            "sent2": "The antihero in the novel was not the typical brave and noble protagonist.",
            "sent3": "The antihero's attempt at being a hero ended up causing more trouble than help.",
            "sent4": "She saw herself as the antihero of her own life story, navigating through challenges with imperfect grace.",
            "sent5": "The antihero's actions spoke louder than any heroic words could."
        },
        {
            "definition": "A protagonist who lacks conventional heroic attributes.",
            "pos": "noun",
            "sent1": "The antihero of the play was a refreshing change from the usual heroic characters.",
            "sent2": "Audiences were drawn to the antihero's complexity and unconventional approach to problems.",
            "sent3": "The antihero's lack of heroic traits made for some unexpected plot twists.",
            "sent4": "He played the role of the antihero with a raw authenticity that captivated the audience.",
            "sent5": "The antihero's journey was a reminder that heroism comes in many forms."
        },
        {
            "definition": "A character who is flawed or morally ambiguous.",
            "pos": "noun",
            "sent1": "The antihero's questionable decisions added depth to the storyline.",
            "sent2": "Viewers were intrigued by the antihero's internal struggles and moral dilemmas.",
            "sent3": "Despite his flaws, the antihero managed to win over the audience with his charm.",
            "sent4": "She portrayed the antihero with a complexity that blurred the lines between right and wrong.",
            "sent5": "The antihero's moral ambiguity made him a captivating character to follow."
        }
    ]
}