{
    "term": "antiobscenities",
    "meanings": [
        {
            "definition": "Actions or words that are against obscenities.",
            "pos": "noun",
            "sent1": "The school promotes antiobscenities to create a respectful environment.",
            "sent2": "She always speaks with antiobscenities, never using rude language.",
            "sent3": "The comedian's routine was filled with antiobscenities, making the audience laugh without any offensive jokes.",
            "sent4": "Her artwork was a beautiful display of antiobscenities, using only positive and uplifting imagery.",
            "sent5": "The campaign focused on spreading awareness about antiobscenities, encouraging people to choose their words wisely."
        },
        {
            "definition": "A person who opposes obscenities.",
            "pos": "noun",
            "sent1": "As an antiobscenities, he always stands up against inappropriate language.",
            "sent2": "The antiobscenities spoke out against the use of profanity in public spaces.",
            "sent3": "The antiobscenities at the meeting made sure everyone kept the conversation clean and respectful.",
            "sent4": "She was like an antiobscenities superhero, swooping in to stop any foul language in its tracks.",
            "sent5": "The antiobscenities was known for their unwavering commitment to decency in speech."
        },
        {
            "definition": "The quality of being opposed to obscenities.",
            "pos": "noun",
            "sent1": "The antiobscenities of the film industry is evident in the strict language guidelines.",
            "sent2": "Her writing style reflects a deep sense of antiobscenities, always choosing clean and respectful words.",
            "sent3": "The antiobscenities of the town council ensured that all public announcements were family-friendly.",
            "sent4": "The artist's work exuded an aura of antiobscenities, showcasing a commitment to positivity.",
            "sent5": "The school's policy on antiobscenities set a high standard for student behavior and language use."
        }
    ]
}