{
    "term": "antibusers",
    "meanings": [
        {
            "definition": "A person who opposes or fights against abuse.",
            "pos": "noun",
            "sent1": "The antibusers in our community work tirelessly to protect those in need.",
            "sent2": "She is known as an antibusers for her dedication to helping abuse victims.",
            "sent3": "The antibusers organized a peaceful protest to raise awareness about domestic violence.",
            "sent4": "In the battle against injustice, she stood strong like a fearless antibusers.",
            "sent5": "The image of the antibusers comforting the child left a lasting impact on everyone."
        },
        {
            "definition": "A substance or treatment that counteracts the effects of abuse.",
            "pos": "noun",
            "sent1": "The doctor prescribed an antibusers to help alleviate the pain caused by the abuse.",
            "sent2": "The antibusers provided relief and comfort to the survivors of the traumatic event.",
            "sent3": "The antibusers lotion soothes the skin after exposure to harmful chemicals.",
            "sent4": "Her words acted as an emotional antibusers, easing the mental scars of abuse.",
            "sent5": "The antibusers medication helped restore her sense of safety and well-being."
        },
        {
            "definition": "The act of opposing or fighting against abuse.",
            "pos": "noun",
            "sent1": "Their antibusers of bullying led to positive changes in the school environment.",
            "sent2": "The antibusers of animal cruelty is a cause close to her heart.",
            "sent3": "The antibusers of unfair treatment sparked a movement for equality.",
            "sent4": "Her relentless antibusers of corruption earned her respect from the community.",
            "sent5": "The antibusers of child labor worked together to create a safer future for all children."
        }
    ]
}