{
    "term": "antirationalisms",
    "meanings": [
        {
            "definition": "Beliefs or actions that oppose rational thought or reasoning.",
            "pos": "noun",
            "sent1": "Some people are drawn to antirationalisms because they prefer emotions over logic.",
            "sent2": "The rise of antirationalisms in society can lead to misunderstandings and conflicts.",
            "sent3": "At the comedy show, the character's antirationalisms made everyone laugh at the absurdity.",
            "sent4": "Her stubborn antirationalisms were like a wall blocking any attempt at logical discussion.",
            "sent5": "The movie portrayed the villain's antirationalisms as a dangerous force against reason."
        },
        {
            "definition": "The rejection of rationalism or logical thinking.",
            "pos": "noun",
            "sent1": "In debates, his constant antirationalisms frustrated his opponents.",
            "sent2": "The teacher emphasized the importance of critical thinking to combat antirationalisms.",
            "sent3": "The cat's playful antirationalisms entertained the children for hours.",
            "sent4": "The storm of emotions created an atmosphere of antirationalisms in the room.",
            "sent5": "The book's protagonist struggled to overcome the antirationalisms clouding his judgment."
        },
        {
            "definition": "A philosophy or ideology that goes against rational principles.",
            "pos": "noun",
            "sent1": "The rise of antirationalisms in politics caused concern among the citizens.",
            "sent2": "The professor's lecture focused on the dangers of embracing antirationalisms.",
            "sent3": "The antirationalisms of the cult leader led his followers down a dangerous path.",
            "sent4": "Her belief in antirationalisms was like a shield against any logical argument.",
            "sent5": "The artist's work challenged traditional norms with its antirationalisms approach."
        }
    ]
}