{
    "term": "antiasthma",
    "meanings": [
        {
            "definition": "Preventing or relieving symptoms of asthma.",
            "pos": "adjective",
            "sent1": "The antiasthma inhaler helped her breathe better during her asthma attack.",
            "sent2": "She always carries her antiasthma medication with her in case of an emergency.",
            "sent3": "The superhero's antiasthma cape protected him from the villain's asthma-inducing powers.",
            "sent4": "Her positive attitude acted as an antiasthma shield against the challenges of the day.",
            "sent5": "The antiasthma solution was like a breath of fresh air in her asthma management plan."
        },
        {
            "definition": "A medication used to treat asthma.",
            "pos": "noun",
            "sent1": "He forgot to take his antiasthma before going to bed, and his asthma worsened overnight.",
            "sent2": "The doctor prescribed a new antiasthma for her to try to control her asthma symptoms.",
            "sent3": "The antiasthma tasted like candy, making it easier for the child to take.",
            "sent4": "The antiasthma acted like a superhero, fighting off the asthma symptoms in his body.",
            "sent5": "Carrying the antiasthma everywhere became a daily routine for her asthma management."
        },
        {
            "definition": "A treatment or therapy for asthma.",
            "pos": "noun",
            "sent1": "The new antiasthma therapy helped improve her lung function and overall health.",
            "sent2": "She scheduled regular appointments for her antiasthma treatment to keep her asthma under control.",
            "sent3": "The antiasthma sessions felt like a relaxing spa day for her lungs.",
            "sent4": "The antiasthma treatment was a ray of hope in her battle against asthma.",
            "sent5": "The antiasthma therapy was like a soothing balm for her asthma symptoms."
        }
    ]
}