{
    "term": "antiobscenity",
    "meanings": [
        {
            "definition": "Opposed to obscenity.",
            "pos": "adjective",
            "sent1": "She always chooses antiobscenity movies to watch with her family.",
            "sent2": "The antiobscenity campaign aims to promote clean and family-friendly content.",
            "sent3": "The antiobscenity advocate wore a t-shirt with a funny slogan against inappropriate content.",
            "sent4": "Her antiobscenity stance was like a bright light in a dark room of indecency.",
            "sent5": "The antiobscenity policy made sure all public displays were suitable for all ages."
        },
        {
            "definition": "A person or group that opposes obscenity.",
            "pos": "noun",
            "sent1": "The antiobscenity spoke passionately at the town hall meeting about the need for decency in media.",
            "sent2": "The antiobscenity group organized a protest against explicit content in the neighborhood.",
            "sent3": "The antiobscenity club had a humorous mascot to represent their cause.",
            "sent4": "She was a warrior for antiobscenity, fighting against inappropriate material with words of truth.",
            "sent5": "The antiobscenity organization worked tirelessly to keep the community free from offensive material."
        },
        {
            "definition": "A law or regulation that prohibits obscenity.",
            "pos": "noun",
            "sent1": "The antiobscenity was passed unanimously by the city council.",
            "sent2": "The antiobscenity faced legal challenges but ultimately stood firm.",
            "sent3": "The antiobscenity decree was enforced with a touch of humor by the local authorities.",
            "sent4": "The antiobscenity law acted as a shield against inappropriate content in public spaces.",
            "sent5": "The antiobscenity regulation ensured that all public displays met the community standards."
        }
    ]
}