{
    "term": "antiquing",
    "meanings": [
        {
            "definition": "The activity of shopping for or collecting antiques.",
            "pos": "noun",
            "sent1": "She enjoys antiquing on weekends, searching for unique treasures in old shops.",
            "sent2": "Antiquing can be a fun hobby for those who appreciate history and craftsmanship.",
            "sent3": "While antiquing, she found a dusty old lamp that turned out to be a valuable antique.",
            "sent4": "Her room was like a museum after antiquing, filled with vintage clocks and paintings.",
            "sent5": "The thrill of antiquing is in the hunt for hidden gems among the old items."
        },
        {
            "definition": "The process of making something appear older or antique in style.",
            "pos": "noun",
            "sent1": "The antiquing of the new table gave it a rustic, aged look.",
            "sent2": "Antiquing a mirror can add a touch of elegance to any room.",
            "sent3": "He tried antiquing his jeans to give them a vintage vibe, but ended up with a messy result.",
            "sent4": "The artist used a special technique for antiquing the frame of the painting, giving it an ancient feel.",
            "sent5": "The antiquing of the statue made it seem like a relic from a bygone era."
        },
        {
            "definition": "The act of applying an antique finish to furniture or other objects.",
            "pos": "noun",
            "sent1": "After antiquing the dresser, it looked like a piece from a different time period.",
            "sent2": "Antiquing the picture frame with gold paint gave it a luxurious appearance.",
            "sent3": "She accidentally spilled coffee while antiquing the table, creating a unique pattern.",
            "sent4": "The artisan's skill in antiquing the vase made it a sought-after piece among collectors.",
            "sent5": "The antiquing of the bookshelf transformed it into a charming vintage piece."
        }
    ]
}