{
    "term": "antisolar",
    "meanings": [
        {
            "definition": "Situated opposite the sun.",
            "pos": "adjective",
            "sent1": "The antisolar side of the building remained cool throughout the day.",
            "sent2": "The antisolar panel was designed to capture energy from the opposite direction of the sun.",
            "sent3": "The cat found a cozy spot on the antisolar side of the house to avoid the heat.",
            "sent4": "Her antisolar personality shone brightly in a world filled with sunshine.",
            "sent5": "The antisolar landscape was a refreshing change from the usual sunny views."
        },
        {
            "definition": "Pertaining to the opposite side of the sun.",
            "pos": "adjective",
            "sent1": "The antisolar telescope allowed astronomers to observe celestial bodies from a unique perspective.",
            "sent2": "The spacecraft was equipped with special sensors to detect antisolar radiation.",
            "sent3": "The antisolar sunglasses protected his eyes from the glare coming from the other side of the sun.",
            "sent4": "Her antisolar outlook on life brought a different light to every situation.",
            "sent5": "The antisolar phenomenon fascinated scientists studying the mysteries of space."
        },
        {
            "definition": "Moving away from the sun.",
            "pos": "adjective",
            "sent1": "The antisolar trajectory of the comet puzzled astronomers as it veered off in an unexpected direction.",
            "sent2": "The satellite was programmed to orbit in an antisolar direction for research purposes.",
            "sent3": "The antisolar wind carried particles away from the solar system.",
            "sent4": "Her antisolar journey led her to uncharted territories beyond the reach of the sun.",
            "sent5": "The antisolar escape plan involved navigating through the darkness away from the sun's influence."
        }
    ]
}