{
    "term": "antiparasitics",
    "meanings": [
        {
            "definition": "A substance used to treat or prevent parasitic infections.",
            "pos": "noun",
            "sent1": "The vet prescribed antiparasitics to help the dog get rid of worms.",
            "sent2": "She bought antiparasitics for her cat to protect it from fleas.",
            "sent3": "The antiparasitics worked like magic, making the parasites disappear.",
            "sent4": "The antiparasitics acted like tiny warriors fighting off the invading parasites.",
            "sent5": "Using antiparasitics is like putting up a shield against harmful parasites."
        },
        {
            "definition": "A medication that kills or inhibits the growth of parasites.",
            "pos": "noun",
            "sent1": "The antiparasitics effectively eliminated the parasites in the fish tank.",
            "sent2": "Doctors often prescribe antiparasitics to treat infections caused by parasites.",
            "sent3": "The antiparasitics did a great job at stopping the parasites in their tracks.",
            "sent4": "The antiparasitics were like a powerful weapon against the invading parasites.",
            "sent5": "The antiparasitics were like a shield protecting the body from harmful parasites."
        },
        {
            "definition": "Antiparasitics are commonly used in veterinary medicine to protect animals from parasites.",
            "pos": "noun",
            "sent1": "The vet always keeps a stock of antiparasitics to safeguard the animals.",
            "sent2": "Using antiparasitics is a common practice in veterinary clinics.",
            "sent3": "The antiparasitics made the parasites flee like scaredy-cats.",
            "sent4": "The antiparasitics were like a fortress defending the animals from parasites.",
            "sent5": "The antiparasitics were like a superhero swooping in to save the day from parasites."
        }
    ]
}