{
    "term": "anticoagulants",
    "meanings": [
        {
            "definition": "A substance that prevents blood from clotting.",
            "pos": "noun",
            "sent1": "The doctor prescribed anticoagulants to stop the blood from clotting.",
            "sent2": "She takes anticoagulants every day to prevent blood clots.",
            "sent3": "The anticoagulants worked like magic, keeping the blood flowing smoothly.",
            "sent4": "His words acted as anticoagulants, preventing any tension from clotting between them.",
            "sent5": "The anticoagulants were like little guardians, ensuring the blood stayed liquid."
        },
        {
            "definition": "Medications used to prevent blood clots.",
            "pos": "noun",
            "sent1": "After surgery, the patient was given anticoagulants to avoid blood clots.",
            "sent2": "Anticoagulants are essential for patients at risk of developing blood clots.",
            "sent3": "The anticoagulants were like tiny superheroes fighting off any potential blood clots.",
            "sent4": "She saw the anticoagulants as shields protecting her from dangerous blood clots.",
            "sent5": "The doctor explained how anticoagulants were like bodyguards for the blood, keeping it safe."
        },
        {
            "definition": "Agents that inhibit the coagulation of blood.",
            "pos": "noun",
            "sent1": "The anticoagulants prevented the coagulation of blood, ensuring it remained liquid.",
            "sent2": "Doctors often prescribe anticoagulants to stop the coagulation process in the blood.",
            "sent3": "The anticoagulants were like traffic lights, halting the coagulation of blood at the right moment.",
            "sent4": "She thought of anticoagulants as brakes for the blood, preventing it from clotting too quickly.",
            "sent5": "The anticoagulants acted as barriers, stopping the coagulation process in its tracks."
        }
    ]
}