{
    "term": "antiauthoritarianisms",
    "meanings": [
        {
            "definition": "Opposition to authoritarianism.",
            "pos": "noun",
            "sent1": "Many people embrace antiauthoritarianisms to stand against strict rulers.",
            "sent2": "The group's antiauthoritarianisms led them to challenge the oppressive government.",
            "sent3": "The antiauthoritarianisms of the rebellious students made the principal rethink his rules.",
            "sent4": "In a world of antiauthoritarianisms, the concept of absolute power seems outdated.",
            "sent5": "The spirit of antiauthoritarianisms burned brightly in the hearts of the protesters."
        },
        {
            "definition": "The belief in rejecting or opposing authority.",
            "pos": "noun",
            "sent1": "Her strong antiauthoritarianisms made her question every rule imposed on her.",
            "sent2": "The antiauthoritarianisms of the group clashed with the traditional values of the society.",
            "sent3": "His antiauthoritarianisms sometimes got him in trouble with his teachers.",
            "sent4": "The antiauthoritarianisms of the youth symbolized a shift in societal norms.",
            "sent5": "The rebellious teenager's antiauthoritarianisms were evident in his defiance of rules."
        },
        {
            "definition": "The principles or practices of antiauthoritarianism.",
            "pos": "noun",
            "sent1": "Studying the history of antiauthoritarianisms helps understand its impact on society.",
            "sent2": "The community's embrace of antiauthoritarianisms brought about positive change.",
            "sent3": "The humor in the play cleverly highlighted the absurdity of antiauthoritarianisms.",
            "sent4": "Her artwork reflected the beauty and chaos of antiauthoritarianisms.",
            "sent5": "The documentary shed light on the global influence of antiauthoritarianisms."
        }
    ]
}