{
    "term": "antipredator",
    "meanings": [
        {
            "definition": "Acting to prevent or counteract predation.",
            "pos": "adjective",
            "sent1": "The antipredator behavior of the porcupine includes raising its quills when threatened.",
            "sent2": "The antipredator measures of the skunk, such as spraying a foul odor, help it avoid being eaten.",
            "sent3": "The antipredator squirrel cleverly hides its nuts in different places to outsmart potential thieves.",
            "sent4": "The antipredator instincts of the mother bear kick in when she senses danger near her cubs.",
            "sent5": "The antipredator camouflage of the chameleon allows it to blend seamlessly into its surroundings."
        },
        {
            "definition": "A substance or behavior that deters predators.",
            "pos": "noun",
            "sent1": "The ants release an antipredator chemical to warn others of danger.",
            "sent2": "The bright colors of the poison dart frog serve as an antipredator signal to potential threats.",
            "sent3": "The loud screech of the peacock is its antipredator defense against lurking predators.",
            "sent4": "The electric eel's shocking ability is its antipredator weapon in the depths of the river.",
            "sent5": "The antipredator strategy of the zebra involves running in a zigzag pattern to confuse predators."
        },
        {
            "definition": "An organism or adaptation that helps protect against predators.",
            "pos": "noun",
            "sent1": "The spines of the hedgehog are its antipredator feature, deterring predators from attacking.",
            "sent2": "The antipredator adaptation of the gazelle is its speed, allowing it to escape from predators.",
            "sent3": "The antipredator defense of the turtle is retreating into its shell when threatened.",
            "sent4": "The antipredator mechanism of the octopus includes changing color and texture to blend in with its surroundings.",
            "sent5": "The antipredator structure of the clamshell provides protection for the vulnerable clam inside."
        }
    ]
}