{
    "term": "antiferromagnet",
    "meanings": [
        {
            "definition": "A material exhibiting antiferromagnetism, a type of magnetic ordering where neighboring magnetic moments align in opposite directions.",
            "pos": "noun",
            "sent1": "The antiferromagnet showed unique magnetic properties.",
            "sent2": "Scientists studied the antiferromagnet to understand its magnetic behavior.",
            "sent3": "The antiferromagnet decided to repel all other magnets in the room.",
            "sent4": "Her mind was like an antiferromagnet, attracting and repelling thoughts simultaneously.",
            "sent5": "The antiferromagnet's magnetic dance captivated the researchers."
        },
        {
            "definition": "To describe the behavior of a substance that displays antiferromagnetism.",
            "pos": "verb",
            "sent1": "He tried to antiferromagnetize the material for analysis.",
            "sent2": "When discussing magnets, it is important to antiferromagnet the properties accurately.",
            "sent3": "The scientist joked that he could antiferromagnetize anything with his magnetic personality.",
            "sent4": "Her words seemed to antiferromagnetize the room, creating a strange tension.",
            "sent5": "The teacher's explanation managed to antiferromagnetize even the most confused students."
        },
        {
            "definition": "The state of being an antiferromagnet.",
            "pos": "noun",
            "sent1": "The antiferromagnetism of the material puzzled the researchers.",
            "sent2": "Understanding the antiferromagnet of a substance requires careful analysis.",
            "sent3": "The antiferromagnet's party was a magnet-themed event.",
            "sent4": "In a world of magnets, she found solace in her antiferromagnet.",
            "sent5": "The beauty of the antiferromagnet's symmetry left everyone in awe."
        }
    ]
}