{
    "term": "antiglare",
    "meanings": [
        {
            "definition": "Designed to reduce glare.",
            "pos": "adjective",
            "sent1": "The antiglare sunglasses helped protect my eyes from the bright sun.",
            "sent2": "She installed an antiglare screen protector on her phone to make it easier to see in the sunlight.",
            "sent3": "The antiglare car windshield made the road look less shiny and more comfortable to drive on.",
            "sent4": "The antiglare paint on the walls of the classroom made it easier for students to focus on the board.",
            "sent5": "The antiglare coating on the camera lens prevented any unwanted reflections in the photos."
        },
        {
            "definition": "A surface treatment that reduces glare.",
            "pos": "noun",
            "sent1": "The antiglare on the computer monitor made it easier to work for long hours without straining my eyes.",
            "sent2": "The photographer used an antiglare filter on the camera lens to capture clear images in bright light.",
            "sent3": "The antiglare on the window made the view outside look less shiny and more pleasant to look at.",
            "sent4": "The antiglare on the TV screen prevented any reflections, giving a clear view of the movie.",
            "sent5": "The antiglare on the glasses helped reduce the glare from the headlights while driving at night."
        },
        {
            "definition": "A type of coating that minimizes glare.",
            "pos": "noun",
            "sent1": "The antiglare on the phone screen made it easier to read messages under bright sunlight.",
            "sent2": "The antiglare on the camera lens reduced reflections, resulting in better quality photos.",
            "sent3": "The antiglare on the watch face made it easier to check the time without any glare.",
            "sent4": "The antiglare on the laptop screen reduced eye strain during long hours of work.",
            "sent5": "The antiglare on the car windows improved visibility by reducing glare from the sun."
        }
    ]
}