{
    "term": "antihypertensives",
    "meanings": [
        {
            "definition": "Drugs used to treat high blood pressure.",
            "pos": "noun",
            "sent1": "My doctor prescribed antihypertensives to help with my high blood pressure.",
            "sent2": "Many people take antihypertensives to manage their hypertension.",
            "sent3": "I guess I'll have to start calling my pills 'antihypertensives' instead of 'magic beans'!",
            "sent4": "The effect of antihypertensives on blood pressure is like a gentle breeze calming a storm.",
            "sent5": "The word 'antihypertensives' sounds like a superhero for high blood pressure."
        },
        {
            "definition": "Medications that lower blood pressure.",
            "pos": "noun",
            "sent1": "My grandmother takes antihypertensives every morning to help her blood pressure.",
            "sent2": "It's important to follow the doctor's instructions when taking antihypertensives.",
            "sent3": "I accidentally mistook the antihypertensives for candy - oops!",
            "sent4": "The impact of antihypertensives on blood pressure is like a skilled archer hitting the bullseye.",
            "sent5": "The pharmacist explained how antihypertensives work to lower blood pressure."
        },
        {
            "definition": "Substances that reduce hypertension.",
            "pos": "noun",
            "sent1": "Natural remedies can sometimes act as antihypertensives to help control hypertension.",
            "sent2": "Doctors often recommend lifestyle changes in addition to antihypertensives for hypertension.",
            "sent3": "I tried to convince my cat that antihypertensives were treats, but she wasn't fooled.",
            "sent4": "The role of antihypertensives in reducing hypertension is like a shield protecting against high blood pressure.",
            "sent5": "The image of antihypertensives battling hypertension is quite intriguing."
        }
    ]
}