{
    "term": "anticipatory",
    "meanings": [
        {
            "definition": "relating to or showing anticipation",
            "pos": "adjective",
            "sent1": "The children's faces were full of anticipatory excitement as they waited for the magician to perform.",
            "sent2": "Her anticipatory smile indicated that she was looking forward to the surprise party.",
            "sent3": "The dog's anticipatory tail wagging gave away the fact that he knew a treat was coming.",
            "sent4": "The anticipatory atmosphere in the stadium was electric, with fans eagerly awaiting the start of the game.",
            "sent5": "The anticipatory tension in the air was palpable, signaling something big was about to happen."
        },
        {
            "definition": "characterized by anticipation",
            "pos": "adjective",
            "sent1": "The suspenseful movie had an anticipatory effect on the audience, keeping them on the edge of their seats.",
            "sent2": "The anticipatory nature of the job required constant readiness for unexpected challenges.",
            "sent3": "The anticipatory mood in the room was so thick you could almost touch it.",
            "sent4": "The anticipatory silence before the announcement was broken only by the sound of nervous shuffling.",
            "sent5": "The anticipatory thrill of the upcoming adventure filled her with a sense of eager anticipation."
        },
        {
            "definition": "anticipating or tending to anticipate",
            "pos": "adjective",
            "sent1": "His anticipatory behavior included checking the mailbox every hour for the delivery.",
            "sent2": "The anticipatory student had already prepared questions for the upcoming lecture.",
            "sent3": "The anticipatory squirrel stored extra nuts in its burrow in case of a long winter.",
            "sent4": "The anticipatory driver slowed down as they approached the intersection, expecting a red light.",
            "sent5": "The anticipatory look in her eyes hinted at her ability to predict the future with uncanny accuracy."
        }
    ]
}