{
    "term": "antiplague",
    "meanings": [
        {
            "definition": "Preventing or counteracting the spread of a plague.",
            "pos": "adjective",
            "sent1": "The antiplague measures helped keep the community safe from the disease.",
            "sent2": "Doctors recommended using antiplague methods to stop the illness from spreading.",
            "sent3": "The antiplague efforts were so effective that the town remained healthy and happy.",
            "sent4": "Her determination to be antiplague in her actions inspired others to take precautions.",
            "sent5": "The bright red sign with the antiplague symbol reminded everyone to stay vigilant against the sickness."
        },
        {
            "definition": "A substance or treatment used to combat a plague.",
            "pos": "noun",
            "sent1": "The medical team quickly distributed the antiplague to those in need.",
            "sent2": "The government stockpiled antiplague supplies in case of an outbreak.",
            "sent3": "The ancient recipe for the antiplague potion was discovered in an old book.",
            "sent4": "The antiplague injection acted as a shield against the deadly virus.",
            "sent5": "People lined up to receive the life-saving antiplague medication during the crisis."
        },
        {
            "definition": "A person or thing that works against the spread of a plague.",
            "pos": "noun",
            "sent1": "The doctor was hailed as an antiplague hero for his tireless efforts.",
            "sent2": "The cat, known for catching rats, was considered the household's antiplague.",
            "sent3": "The little girl proudly declared herself the family's official antiplague warrior.",
            "sent4": "The antiplague mascot of the town was a brave squirrel with a tiny shield.",
            "sent5": "The ancient talisman was believed to be an antiplague charm that protected its wearer from harm."
        }
    ]
}