{
    "term": "apart",
    "meanings": [
        {
            "definition": "Separated by a distance in space or time.",
            "pos": "adjective",
            "sent1": "The two houses were far apart from each other.",
            "sent2": "The friends lived in different cities, miles apart.",
            "sent3": "The lonely tree stood apart from the rest of the forest.",
            "sent4": "Her unique perspective set her apart from the crowd.",
            "sent5": "The old bridge was falling apart, each plank separated from the next."
        },
        {
            "definition": "Into pieces or parts.",
            "pos": "adverb",
            "sent1": "She tore the paper apart in frustration.",
            "sent2": "The vase fell and shattered apart on the floor.",
            "sent3": "The magician pulled the scarf apart to reveal a dove.",
            "sent4": "The storm ripped the sail apart, leaving shreds behind.",
            "sent5": "The cookie crumbled apart with each bite, leaving a trail of crumbs."
        },
        {
            "definition": "Aside or away from others.",
            "pos": "adverb",
            "sent1": "She sat apart from the group during lunch.",
            "sent2": "The shy child stood apart from the noisy crowd.",
            "sent3": "The cat preferred to sleep apart from the other pets.",
            "sent4": "The old man sat apart from the bustling activity of the fair.",
            "sent5": "The artist worked quietly apart from the other students in the studio."
        },
        {
            "definition": "In a state of being separate or isolated.",
            "pos": "adjective",
            "sent1": "The abandoned house looked dark and apart from the rest of the neighborhood.",
            "sent2": "She felt apart from her classmates after moving to a new school.",
            "sent3": "The broken toy lay apart from the other toys in the corner.",
            "sent4": "The injured bird huddled apart from the flock, seeking solitude.",
            "sent5": "The old lighthouse stood tall and apart on the rocky cliff, guiding ships safely."
        }
    ]
}