{
    "term": "apocalyptists",
    "meanings": [
        {
            "definition": "A person who believes in or promotes apocalyptic beliefs or prophecies.",
            "pos": "noun",
            "sent1": "The apocalyptists in the village warned of a coming disaster.",
            "sent2": "The apocalyptists gathered to discuss their theories about the end of the world.",
            "sent3": "The apocalyptists organized a potluck to prepare for the apocalypse.",
            "sent4": "The apocalyptists' predictions seemed to hang over the town like a dark cloud.",
            "sent5": "The apocalyptists' fervent beliefs made them stand out in the community."
        },
        {
            "definition": "The group of individuals who interpret and study apocalyptic literature.",
            "pos": "noun",
            "sent1": "In the library, the apocalyptists pored over ancient texts about the end times.",
            "sent2": "The apocalyptists met weekly to analyze prophecies from various sources.",
            "sent3": "The apocalyptists' book club focused exclusively on apocalyptic novels.",
            "sent4": "The apocalyptists' discussions about doom and gloom were surprisingly engaging.",
            "sent5": "The apocalyptists' deep dive into apocalyptic literature fascinated many."
        },
        {
            "definition": "Those who predict or anticipate catastrophic events or the end of the world.",
            "pos": "noun",
            "sent1": "The apocalyptists on the news warned of an impending global crisis.",
            "sent2": "Some apocalyptists claim to have visions of the world's demise.",
            "sent3": "The apocalyptists' doomsday countdown clock was both eerie and amusing.",
            "sent4": "The apocalyptists' dire warnings echoed through the town like a chilling prophecy.",
            "sent5": "The apocalyptists' constant talk of the end times created a sense of urgency."
        }
    ]
}