{
    "term": "apocalyptism",
    "meanings": [
        {
            "definition": "The belief in or expectation of an imminent end of the world.",
            "pos": "noun",
            "sent1": "Her apocalyptism led her to prepare for the end times by stocking up on supplies.",
            "sent2": "Many ancient civilizations had their own versions of apocalyptism predicting the world's end.",
            "sent3": "Despite his apocalyptism, John couldn't resist making plans for his birthday next year.",
            "sent4": "The movie depicted a world ravaged by apocalyptism, where only a few survivors remained.",
            "sent5": "The preacher's vivid apocalyptism painted a terrifying picture of the world's final days."
        },
        {
            "definition": "A system of religious beliefs concerning the ultimate destiny of humanity.",
            "pos": "noun",
            "sent1": "Their apocalyptism included prophecies about the afterlife and judgment day.",
            "sent2": "The ancient texts revealed the intricate details of their apocalyptism.",
            "sent3": "The group's apocalyptism made them believe they were chosen for a special mission.",
            "sent4": "In their apocalyptism, the followers awaited the arrival of a chosen savior.",
            "sent5": "The apocalyptism of the cult followers shaped their daily rituals and prayers."
        },
        {
            "definition": "A catastrophic event or series of events.",
            "pos": "noun",
            "sent1": "The earthquake was a true apocalyptism, leaving the city in ruins.",
            "sent2": "The apocalyptism of the hurricane brought widespread destruction to the coastal town.",
            "sent3": "The sudden power outage felt like a minor apocalyptism in the office.",
            "sent4": "The apocalyptism of the volcanic eruption covered the sky in ash and darkness.",
            "sent5": "The apocalyptism of the meteor strike changed life on Earth forever."
        }
    ]
}