{
    "term": "apomorphines",
    "meanings": [
        {
            "definition": "A drug used to induce vomiting.",
            "pos": "noun",
            "sent1": "The doctor prescribed apomorphines to help the patient expel harmful substances from their stomach.",
            "sent2": "After accidentally ingesting a toxic substance, the nurse administered apomorphines to induce vomiting.",
            "sent3": "The apomorphines worked like a magic potion, making everything come out of the patient's stomach.",
            "sent4": "The apomorphines acted like a trigger, forcing the body to expel the unwanted contents.",
            "sent5": "The apomorphines caused the person to vomit, clearing their system of toxins."
        },
        {
            "definition": "A substance derived from morphine.",
            "pos": "noun",
            "sent1": "Scientists studied the properties of apomorphines to understand its origins from morphine.",
            "sent2": "The pharmacist explained that apomorphines were extracted from morphine for specific medical purposes.",
            "sent3": "The apomorphines seemed like a distant cousin of morphine, sharing some similarities.",
            "sent4": "Her love for him was like apomorphines, a derivative of a stronger, deeper feeling.",
            "sent5": "The apomorphines were like a shadow of morphine, with a milder effect."
        },
        {
            "definition": "A type of medication used to treat Parkinson's disease.",
            "pos": "noun",
            "sent1": "The neurologist recommended apomorphines to manage the symptoms of Parkinson's disease.",
            "sent2": "Patients with Parkinson's disease often rely on apomorphines to improve their mobility.",
            "sent3": "The apomorphines danced through the brain, alleviating the tremors of Parkinson's disease.",
            "sent4": "Her determination was like apomorphines, easing the challenges of Parkinson's disease.",
            "sent5": "The apomorphines acted as a lifeline, providing relief from the symptoms of Parkinson's disease."
        }
    ]
}