{
    "term": "apophyllites",
    "meanings": [
        {
            "definition": "A group of minerals consisting of hydrated silicates of calcium and potassium.",
            "pos": "noun",
            "sent1": "The geologist found a rare specimen of apophyllites during the excavation.",
            "sent2": "Miners discovered a vein of apophyllites while digging in the quarry.",
            "sent3": "The mischievous squirrel mistook the apophyllites for shiny acorns and tried to bury them.",
            "sent4": "Her collection of apophyllites sparkled like a treasure trove in the sunlight.",
            "sent5": "The apophyllites gleamed like tiny jewels in the rock formation."
        },
        {
            "definition": "A type of mineral commonly found in volcanic rocks.",
            "pos": "noun",
            "sent1": "The volcano's eruption revealed a hidden cache of apophyllites within the lava flow.",
            "sent2": "Scientists study the formation of apophyllites to understand volcanic processes better.",
            "sent3": "The curious child mistook the apophyllites for colorful candy and tried to taste them.",
            "sent4": "The apophyllites in the volcanic rocks glowed like embers in the darkness.",
            "sent5": "The miner's pickaxe struck a vein of apophyllites, releasing a cascade of shimmering crystals."
        },
        {
            "definition": "Crystals with a tetragonal crystal system and a pearly luster.",
            "pos": "noun",
            "sent1": "The jeweler crafted a stunning necklace using apophyllites as the centerpiece.",
            "sent2": "Collectors prize apophyllites for their unique crystal structure and iridescent sheen.",
            "sent3": "The magician used apophyllites in their act, making them disappear and reappear at will.",
            "sent4": "The apophyllites in the cave glistened like stars in the night sky.",
            "sent5": "The apophyllites seemed to dance with light, creating a mesmerizing display for onlookers."
        }
    ]
}