{
    "term": "apoplectic",
    "meanings": [
        {
            "definition": "Overcome with anger; extremely enraged.",
            "pos": "adjective",
            "sent1": "She was apoplectic when she found out her cat had knocked over her favorite vase.",
            "sent2": "The apoplectic customer yelled at the poor cashier for a simple mistake.",
            "sent3": "Despite his apoplectic reaction, everyone knew he would calm down soon.",
            "sent4": "Her face turned apoplectic red as she shouted at the top of her lungs.",
            "sent5": "The apoplectic boss slammed his fist on the table, demanding better results."
        },
        {
            "definition": "Showing symptoms of a stroke, such as sudden loss of consciousness or paralysis.",
            "pos": "adjective",
            "sent1": "The doctor rushed to the apoplectic patient who had collapsed in the waiting room.",
            "sent2": "She was taken to the hospital after experiencing an apoplectic episode at work.",
            "sent3": "The apoplectic man suddenly fell to the ground, causing a stir in the crowded street.",
            "sent4": "His apoplectic condition left him unable to move his right arm for hours.",
            "sent5": "The apoplectic woman's family acted quickly to get her medical attention."
        },
        {
            "definition": "In a state of extreme excitement or agitation.",
            "pos": "adjective",
            "sent1": "The children were apoplectic with joy when they saw the presents under the tree.",
            "sent2": "The fans were apoplectic as their team scored the winning goal in the final seconds.",
            "sent3": "She was apoplectic with anticipation as she waited for the concert to begin.",
            "sent4": "The apoplectic crowd cheered wildly as the fireworks lit up the night sky.",
            "sent5": "His apoplectic energy was contagious, spreading to everyone around him."
        }
    ]
}