{
    "term": "apostatizing",
    "meanings": [
        {
            "definition": "To abandon one's religious or political beliefs.",
            "pos": "verb",
            "sent1": "She was apostatizing from her old religion to explore new beliefs.",
            "sent2": "The politician was caught apostatizing from his party's principles.",
            "sent3": "The cat seemed to be apostatizing from its usual sleeping spot to find a new favorite.",
            "sent4": "The leaves were apostatizing from the tree, falling one by one in the autumn breeze.",
            "sent5": "The student was apostatizing from their study routine, trying a new method for better grades."
        },
        {
            "definition": "The act of renouncing a belief or allegiance.",
            "pos": "noun",
            "sent1": "His apostatizing from the group shocked everyone at the meeting.",
            "sent2": "The apostatizing of the soldier from his country's flag was seen as an act of betrayal.",
            "sent3": "The sudden apostatizing of the dog from its favorite toy left the owner puzzled.",
            "sent4": "The apostatizing of the waves from the shore created a sense of freedom in the vast ocean.",
            "sent5": "The apostatizing of the employee from the company's values led to his resignation."
        },
        {
            "definition": "A person who has abandoned their beliefs or principles.",
            "pos": "noun",
            "sent1": "She was considered an apostatizing after leaving the organization.",
            "sent2": "The apostatizing was once a loyal follower of the cause.",
            "sent3": "The little girl pretended to be an apostatizing from eating vegetables, much to her parents' amusement.",
            "sent4": "The apostatizing stood out in the crowd, no longer conforming to the group's norms.",
            "sent5": "The apostatizing's actions spoke louder than words, showing a complete shift in beliefs."
        }
    ]
}