{
    "term": "apostolicity",
    "meanings": [
        {
            "definition": "The quality or characteristic of being apostolic.",
            "pos": "noun",
            "sent1": "Her apostolicity shone through in her kind and compassionate actions.",
            "sent2": "The church's apostolicity was evident in its commitment to following the teachings of the apostles.",
            "sent3": "Despite his young age, his apostolicity in helping others was truly remarkable.",
            "sent4": "The apostolicity of her leadership style inspired others to emulate her.",
            "sent5": "The apostolicity of the group's mission made a lasting impact on the community."
        },
        {
            "definition": "The adherence to the teachings and practices of the apostles.",
            "pos": "noun",
            "sent1": "Their apostolicity was reflected in their dedication to studying the apostles' teachings.",
            "sent2": "The community's apostolicity was evident in their commitment to living by the apostles' example.",
            "sent3": "His strict adherence to apostolicity sometimes made him seem like a history buff.",
            "sent4": "She approached her work with the apostolicity of a devoted disciple.",
            "sent5": "The group's unwavering apostolicity set them apart from others."
        },
        {
            "definition": "The belief in the continuation of apostolic succession.",
            "pos": "noun",
            "sent1": "Their faith was rooted in the apostolicity of passing down teachings through generations.",
            "sent2": "The church's apostolicity was evident in its tradition of passing leadership roles from one generation to the next.",
            "sent3": "The apostolicity of the family's heirloom was a source of pride for generations.",
            "sent4": "She carried herself with the apostolicity of someone destined for a great legacy.",
            "sent5": "The apostolicity of the ceremony symbolized the passing of authority to the next leader."
        }
    ]
}