{
    "term": "apostatise",
    "meanings": [
        {
            "definition": "To abandon one's religious or political beliefs.",
            "pos": "verb",
            "sent1": "She decided to apostatise from her church and explore other beliefs.",
            "sent2": "He apostatised from his political party after disagreeing with their policies.",
            "sent3": "The cat seemed to apostatise from its favorite nap spot to find a new cozy corner.",
            "sent4": "The student's decision to apostatise from the study group was like leaving a familiar path for an unknown journey.",
            "sent5": "The image of the old tree shedding its leaves helped her understand the concept of apostatising beliefs."
        },
        {
            "definition": "To renounce a belief or allegiance.",
            "pos": "verb",
            "sent1": "After much contemplation, she finally decided to apostatise her loyalty to the company.",
            "sent2": "He apostatised his support for the team when they started losing every game.",
            "sent3": "The idea of apostatising her favorite dessert for a healthier option seemed daunting at first.",
            "sent4": "The politician's speech was like a call to apostatise outdated ideologies for a brighter future.",
            "sent5": "The sound of the waves crashing against the shore made him feel the need to apostatise his fear of the ocean."
        },
        {
            "definition": "To desert or defect from a cause or organization.",
            "pos": "verb",
            "sent1": "The soldier chose to apostatise his duty and flee from the battlefield.",
            "sent2": "She apostatised from the charity organization due to disagreements with their management.",
            "sent3": "The idea of apostatising from her favorite TV show for a new series made her excited.",
            "sent4": "The decision to apostatise from the traditional family business was like breaking free from chains.",
            "sent5": "The bright colors of the butterfly made it seem like it wanted to apostatise from blending in with the flowers."
        }
    ]
}