{
    "term": "apparatus",
    "meanings": [
        {
            "definition": "A group or combination of instruments, machinery, tools, or materials used for a specific purpose.",
            "pos": "noun",
            "sent1": "The science class had a special apparatus for mixing chemicals.",
            "sent2": "The firefighters quickly grabbed their firefighting apparatus when the alarm sounded.",
            "sent3": "The magician's apparatus for the trick was hidden under the table.",
            "sent4": "Her mind was like a complex apparatus, processing information at lightning speed.",
            "sent5": "The apparatus hummed with efficiency, each part working in harmony."
        },
        {
            "definition": "The organs and tissues of the body that carry out a particular function.",
            "pos": "noun",
            "sent1": "The respiratory apparatus helps us breathe in and out.",
            "sent2": "The doctor examined the patient's digestive apparatus to diagnose the issue.",
            "sent3": "The body's repair apparatus seemed to be on vacation when he needed it most.",
            "sent4": "Her heart, the vital apparatus of life, beat steadily in her chest.",
            "sent5": "The apparatus of the human body is a marvel of biological engineering."
        },
        {
            "definition": "A complex structure within an organization or system.",
            "pos": "noun",
            "sent1": "The bureaucratic apparatus of the government slowed down the decision-making process.",
            "sent2": "The school's administrative apparatus handled student registrations and records.",
            "sent3": "The coffee machine, a vital apparatus in the office, broke down on Monday.",
            "sent4": "The apparatus of rules and regulations seemed to stifle creativity in the company.",
            "sent5": "The apparatus of checks and balances ensured no one had too much power."
        }
    ]
}