{
    "term": "appealable",
    "meanings": [
        {
            "definition": "Capable of being appealed.",
            "pos": "adjective",
            "sent1": "The decision was appealable, so we could ask for it to be looked at again.",
            "sent2": "The judge explained that any ruling made in court is appealable if one disagrees.",
            "sent3": "The lawyer joked that even the coffee in the courthouse cafeteria was appealable.",
            "sent4": "Her smile was like an appealable invitation to join her in the dance.",
            "sent5": "The idea of a second chance was made more real by the appealable nature of the verdict."
        },
        {
            "definition": "Able to be challenged or questioned in a higher court.",
            "pos": "adjective",
            "sent1": "The verdict was appealable, so the case could be taken to a higher court.",
            "sent2": "In the legal system, any decision made by a lower court is appealable in a higher court.",
            "sent3": "The cat's ability to open the door was so impressive, it seemed almost appealable in a court of law.",
            "sent4": "Her determination to succeed was as strong and appealable as a beacon in the night.",
            "sent5": "The mountain of evidence against him made his guilt appealable in the eyes of the law."
        },
        {
            "definition": "Deserving of further consideration or review.",
            "pos": "adjective",
            "sent1": "The new evidence presented was appealable, prompting a reevaluation of the case.",
            "sent2": "When mistakes are made, it is important to have an appealable process for correction.",
            "sent3": "The idea of having dessert before dinner was so appealing, it was almost appealable.",
            "sent4": "Her kindness was an appealable quality that drew others to her effortlessly.",
            "sent5": "The beauty of the sunset was so appealable that it left everyone in awe."
        }
    ]
}