{
    "term": "appel",
    "meanings": [
        {
            "definition": "A round fruit with red or green skin and a white flesh.",
            "pos": "noun",
            "sent1": "I picked a ripe appel from the tree.",
            "sent2": "The teacher brought a basket of appels for the class.",
            "sent3": "The squirrel stole the appel and ran up the tree.",
            "sent4": "The appel glistened in the sunlight like a precious gem.",
            "sent5": "The sweet aroma of the appel filled the room."
        },
        {
            "definition": "A formal request for something, typically in writing.",
            "pos": "noun",
            "sent1": "She submitted an appel to the court for a fair trial.",
            "sent2": "The company received an appel for donations to a charity.",
            "sent3": "His appel for help was answered by a kind stranger.",
            "sent4": "The appel for peace echoed through the war-torn land.",
            "sent5": "The student's appel for extra credit was denied by the teacher."
        },
        {
            "definition": "To make a formal request for something.",
            "pos": "verb",
            "sent1": "He decided to appel the decision made by the committee.",
            "sent2": "She will appel the court's ruling on the case.",
            "sent3": "The child tried to appel for more playtime before bed.",
            "sent4": "The team captain will appel the referee's call on the play.",
            "sent5": "They plan to appel the city council for better street lighting."
        },
        {
            "definition": "To be attractive or pleasing to the eye.",
            "pos": "verb",
            "sent1": "The colorful flowers in the garden really appel to me.",
            "sent2": "The new painting in the gallery will appel to art enthusiasts.",
            "sent3": "The shiny new car will appel to buyers looking for style.",
            "sent4": "Her elegant dress really appel to the guests at the party.",
            "sent5": "The sparkling stars in the night sky always appel to dreamers."
        }
    ]
}