{
    "term": "arbitral",
    "meanings": [
        {
            "definition": "Relating to arbitration or the settlement of disputes through an arbitrator.",
            "pos": "adjective",
            "sent1": "The arbitral decision was fair and helped resolve the conflict peacefully.",
            "sent2": "The parties agreed to abide by the arbitral ruling to avoid further disagreements.",
            "sent3": "The arbitral process felt like a game where the arbitrator was the referee.",
            "sent4": "Her smile was as final as an arbitral verdict, leaving no room for argument.",
            "sent5": "The arbitral meeting room echoed with the sound of compromise and understanding."
        },
        {
            "definition": "Involving or decided by arbitration.",
            "pos": "adjective",
            "sent1": "The arbitral agreement was reached after careful consideration of both sides.",
            "sent2": "The arbitral hearing was conducted in a professional and impartial manner.",
            "sent3": "The arbitral decision seemed like a magic trick that made the disagreement disappear.",
            "sent4": "His words cut through the tension like an arbitral sword, bringing clarity to the situation.",
            "sent5": "The arbitral process was like a bridge connecting two opposing views, leading to a resolution."
        },
        {
            "definition": "Of or relating to an arbitrator or arbitration.",
            "pos": "adjective",
            "sent1": "The arbitral authority was respected by all parties involved in the dispute.",
            "sent2": "The arbitral procedure followed strict guidelines to ensure fairness.",
            "sent3": "The arbitral decision felt like a surprise gift from a wise judge.",
            "sent4": "Her presence in the room was as calming as an arbitral presence, bringing peace to the room.",
            "sent5": "The arbitral process was like a puzzle where each piece represented a different perspective."
        }
    ]
}