{
    "term": "arbitrary",
    "meanings": [
        {
            "definition": "Based on random choice or personal whim, rather than any reason or system.",
            "pos": "adjective",
            "sent1": "She made an arbitrary decision to wear mismatched socks today.",
            "sent2": "The teacher's arbitrary selection of group leaders surprised the students.",
            "sent3": "It was arbitrary that the cat chose to nap in the shoebox instead of the cozy bed.",
            "sent4": "The clouds moved in an arbitrary pattern across the sky, like brushstrokes on a canvas.",
            "sent5": "The arbitrary color choices in the painting created a sense of chaos and unpredictability."
        },
        {
            "definition": "(of power or a ruling body) Unrestrained and autocratic in the use of authority.",
            "pos": "adjective",
            "sent1": "The king's arbitrary rule led to unrest among the people.",
            "sent2": "The dictator's arbitrary decisions left no room for dissent.",
            "sent3": "It seemed arbitrary that the principal banned hats in school but allowed scarves.",
            "sent4": "Her arbitrary control over the household chores made everyone feel powerless.",
            "sent5": "The arbitrary nature of the monarch's decrees made life unpredictable for the citizens."
        },
        {
            "definition": "Existing or coming about seemingly at random or by chance.",
            "pos": "adjective",
            "sent1": "The arbitrary appearance of a rainbow after the storm brought joy to the children.",
            "sent2": "The arbitrary timing of the bus's arrival made her late for the appointment.",
            "sent3": "It felt arbitrary that the vending machine always gave out extra snacks on Fridays.",
            "sent4": "The arbitrary nature of fate brought them together in a strange twist of events.",
            "sent5": "The arbitrary distribution of prizes left everyone surprised at the outcome."
        }
    ]
}