{
    "term": "arboreal",
    "meanings": [
        {
            "definition": "relating to trees",
            "pos": "adjective",
            "sent1": "The squirrel's arboreal habitat is among the tall trees in the forest.",
            "sent2": "The botanist studies various arboreal species to understand their ecological impact.",
            "sent3": "The arboreal monkeys swung gracefully from branch to branch, putting on a show for the visitors.",
            "sent4": "Her mind was an arboreal maze, with thoughts branching out in all directions.",
            "sent5": "The arboreal canopy shielded the hikers from the scorching sun, providing a cool refuge."
        },
        {
            "definition": "living in trees",
            "pos": "adjective",
            "sent1": "The koala is an arboreal marsupial that spends most of its time in eucalyptus trees.",
            "sent2": "Arboreal creatures like sloths have adapted to a life high above the forest floor.",
            "sent3": "The arboreal birds chirped happily as they built their nests in the leafy branches.",
            "sent4": "She felt like an arboreal spirit, floating among the treetops in her dreams.",
            "sent5": "The arboreal lifestyle of the orangutans allows them to roam freely in the lush canopy."
        },
        {
            "definition": "resembling a tree",
            "pos": "adjective",
            "sent1": "The artist created an arboreal sculpture that looked like a miniature forest.",
            "sent2": "The arboreal pattern on the fabric mimicked the intricate design of tree branches.",
            "sent3": "The cake decorator crafted an arboreal masterpiece, complete with edible leaves and bark.",
            "sent4": "Her dress flowed around her like an arboreal gown, with layers of fabric cascading like branches.",
            "sent5": "The arboreal painting captured the essence of nature, with vibrant colors blending like leaves in the wind."
        }
    ]
}