{
    "term": "arcade",
    "meanings": [
        {
            "definition": "A covered passageway with shops and stores on either side.",
            "pos": "noun",
            "sent1": "The arcade was a long hallway with shops on both sides.",
            "sent2": "We walked through the arcade, browsing the different stores.",
            "sent3": "I got lost in the arcade trying to find the toy store.",
            "sent4": "The arcade of shops felt like a treasure trove waiting to be explored.",
            "sent5": "The colorful signs in the arcade made it a vibrant shopping destination."
        },
        {
            "definition": "A series of arches supported by columns.",
            "pos": "noun",
            "sent1": "The ancient arcade had beautiful arches held up by strong columns.",
            "sent2": "The arcade of arches created a stunning architectural display.",
            "sent3": "The pigeons perched on the arcade's arches, enjoying the view.",
            "sent4": "The arcade's arches stood like guardians protecting the path below.",
            "sent5": "The sunlight filtered through the arcade's arches, casting a warm glow."
        },
        {
            "definition": "A building or structure with a series of arches.",
            "pos": "noun",
            "sent1": "The grand arcade stood tall with its majestic arches.",
            "sent2": "Tourists marveled at the arcade's intricate arches and design.",
            "sent3": "The arcade's arches seemed to reach for the sky in a playful dance.",
            "sent4": "The arcade's arches framed the courtyard like a picture-perfect scene.",
            "sent5": "The arcade's arches added a touch of elegance to the historic building."
        },
        {
            "definition": "A row of game machines in a public place.",
            "pos": "noun",
            "sent1": "Kids gathered around the arcade to play their favorite games.",
            "sent2": "The arcade was filled with the sounds of game machines and laughter.",
            "sent3": "I challenged my friend to a game at the arcade and won!",
            "sent4": "The arcade was a haven for gamers looking for entertainment.",
            "sent5": "The neon lights of the arcade beckoned players to come and have fun."
        }
    ]
}