{
    "term": "archiepiscopally",
    "meanings": [
        {
            "definition": "Relating to an archbishop or archbishopric.",
            "pos": "adjective",
            "sent1": "The archiepiscopally robes worn by the bishop were ornate and majestic.",
            "sent2": "The cathedral was decorated in an archiepiscopally grand style for the special ceremony.",
            "sent3": "The archiepiscopally tall hat of the archbishop made him look like a towering figure.",
            "sent4": "Her influence in the community was archiepiscopally significant, much like that of an archbishop.",
            "sent5": "The archiepiscopally decorated throne in the church was a symbol of authority and power."
        },
        {
            "definition": "In the manner of an archbishop.",
            "pos": "adverb",
            "sent1": "He spoke archiepiscopally, with authority and grace, just like an archbishop.",
            "sent2": "The choir sang archiepiscopally, filling the church with harmonious melodies.",
            "sent3": "The children played archiepiscopally, pretending to hold a grand ceremony in the backyard.",
            "sent4": "The old man walked archiepiscopally, his steps slow and deliberate like a respected archbishop.",
            "sent5": "The mayor greeted the crowd archiepiscopally, waving with a regal air as if he were an archbishop."
        },
        {
            "definition": "Pertaining to the office or authority of an archbishop.",
            "pos": "adjective",
            "sent1": "The archiepiscopally duties of the archbishop included leading the church and making important decisions.",
            "sent2": "The archiepiscopally powers vested in the archbishop allowed him to influence the community.",
            "sent3": "The archiepiscopally responsibilities of the archbishop were both challenging and rewarding.",
            "sent4": "Her demeanor was archiepiscopally, commanding respect and admiration from all who met her.",
            "sent5": "The archiepiscopally authority of the archbishop was evident in every decision he made for the diocese."
        }
    ]
}