{
    "term": "archaeologically",
    "meanings": [
        {
            "definition": "Relating to or characteristic of archaeology.",
            "pos": "adjective",
            "sent1": "The archaeologically significant artifacts were carefully preserved in the museum.",
            "sent2": "The archaeologically important site was carefully excavated by the team.",
            "sent3": "The archaeologically curious child loved to dig in the backyard looking for treasures.",
            "sent4": "Her room was an archaeologically rich treasure trove of memories.",
            "sent5": "The archaeologically themed party was a hit with all the history buffs."
        },
        {
            "definition": "In a manner pertaining to the study of human history and prehistory through excavation and analysis of artifacts.",
            "pos": "adverb",
            "sent1": "The team worked archaeologically to uncover the ancient city buried beneath the sand.",
            "sent2": "The archaeologists carefully and archaeologically sifted through the layers of soil.",
            "sent3": "She comically tried to archaeologically dig through her messy room to find her lost keys.",
            "sent4": "The layers of memories in her mind were archaeologically excavated by the therapist.",
            "sent5": "The students learned about history by archaeologically exploring the old ruins."
        },
        {
            "definition": "In a way that involves the scientific study of past human cultures and societies through material remains.",
            "pos": "adverb",
            "sent1": "The artifacts were archaeologically analyzed to understand the ancient civilization.",
            "sent2": "The team archaeologically studied the pottery shards to learn about the culture.",
            "sent3": "He jokingly tried to archaeologically decipher the meaning of his friend's cryptic message.",
            "sent4": "Her eyes archaeologically scanned the room, taking in every detail.",
            "sent5": "The archaeologically minded researcher meticulously documented each find for future study."
        }
    ]
}