{
    "term": "archpriest",
    "meanings": [
        {
            "definition": "A chief priest",
            "pos": "noun",
            "sent1": "The archpriest led the religious ceremony with great solemnity.",
            "sent2": "The archpriest presided over the important rituals in the temple.",
            "sent3": "The archpriest accidentally tripped over his robe during the procession, causing a moment of lightheartedness.",
            "sent4": "In the small village, the archpriest was like a beacon of faith and guidance to all.",
            "sent5": "The archpriest's presence in the sanctuary filled the room with a sense of reverence."
        },
        {
            "definition": "The head of a group of priests",
            "pos": "noun",
            "sent1": "As the archpriest, he made decisions that affected the entire clergy.",
            "sent2": "The archpriest gathered the priests for a meeting to discuss upcoming events.",
            "sent3": "The archpriest jokingly referred to himself as the 'chief of the priestly gang'.",
            "sent4": "In the hierarchy of the church, the archpriest stood at the helm of the priestly community.",
            "sent5": "The archpriest's authority among the priests was unquestioned and respected by all."
        },
        {
            "definition": "A priest of high rank in the Orthodox Church",
            "pos": "noun",
            "sent1": "The archpriest wore elaborate vestments during the special church service.",
            "sent2": "In the Orthodox Church, the archpriest played a significant role in leading the congregation.",
            "sent3": "The archpriest's love for baking made him known as the 'holy baker' among parishioners.",
            "sent4": "To his followers, the archpriest was not just a priest but a spiritual guide and mentor.",
            "sent5": "The archpriest's sermons were filled with wisdom and compassion, touching the hearts of all who listened."
        }
    ]
}