{
    "term": "arcs",
    "meanings": [
        {
            "definition": "A curved line or shape",
            "pos": "noun",
            "sent1": "The rainbow had beautiful arcs of color in the sky.",
            "sent2": "The artist drew graceful arcs on the canvas.",
            "sent3": "The playful kitten chased after the moving arcs of light.",
            "sent4": "Her smile formed an arc of happiness across her face.",
            "sent5": "The graceful dancer moved in perfect arcs across the stage."
        },
        {
            "definition": "To move in a curved path",
            "pos": "verb",
            "sent1": "The ball arcs through the air towards the goal.",
            "sent2": "The bird arcs gracefully across the sky.",
            "sent3": "The paper airplane arcs over the classroom, surprising the students.",
            "sent4": "Her voice arcs up and down in a beautiful melody.",
            "sent5": "The skateboarder arcs smoothly along the half-pipe."
        },
        {
            "definition": "A part of a circle",
            "pos": "noun",
            "sent1": "The rainbow formed a colorful arc in the sky.",
            "sent2": "The clock's hands moved along the arc of time.",
            "sent3": "The arc of the bridge stretched across the river below.",
            "sent4": "The arc of the moon lit up the night sky.",
            "sent5": "The arc of the rainbow ended in a pot of gold."
        },
        {
            "definition": "To form an arc",
            "pos": "verb",
            "sent1": "She arcs her body gracefully over the gymnastics bar.",
            "sent2": "The diver arcs into the pool with perfect form.",
            "sent3": "The rocket arcs into the sky, leaving a trail of smoke behind.",
            "sent4": "The eagle arcs down to catch its prey with precision.",
            "sent5": "The skier arcs down the mountain, leaving tracks in the snow."
        }
    ]
}