{
    "term": "arms",
    "meanings": [
        {
            "definition": "Weapons, especially firearms or explosives.",
            "pos": "noun",
            "sent1": "The soldiers carried their arms into battle.",
            "sent2": "The police officer's arms were loaded with firearms.",
            "sent3": "The arms of the law were swift and just.",
            "sent4": "Her words were her arms in the debate, sharp and effective.",
            "sent5": "The arms of the military protected the nation."
        },
        {
            "definition": "The upper limbs of the body.",
            "pos": "noun",
            "sent1": "She wrapped her arms around her friend in a hug.",
            "sent2": "His arms were sore after lifting heavy boxes all day.",
            "sent3": "The octopus had eight arms to catch its prey.",
            "sent4": "The tree's branches reached out like arms to the sky.",
            "sent5": "The robot's mechanical arms moved with precision."
        },
        {
            "definition": "A branch or division of a family or organization.",
            "pos": "noun",
            "sent1": "The Smith family welcomed a new member into their arms.",
            "sent2": "The marketing department is an important arm of the company.",
            "sent3": "The arms of the organization reached out to help those in need.",
            "sent4": "The political party's extremist arm caused controversy.",
            "sent5": "The arms of the business expanded into new territories."
        },
        {
            "definition": "To supply or equip with weapons.",
            "pos": "verb",
            "sent1": "The rebels armed themselves for the uprising.",
            "sent2": "The general decided to arm the troops with better gear.",
            "sent3": "She armed herself with knowledge before the exam.",
            "sent4": "The superhero armed himself with gadgets to fight crime.",
            "sent5": "The knight armed himself for the jousting tournament."
        }
    ]
}