{
    "term": "arrestive",
    "meanings": [
        {
            "definition": "Restless or uneasy",
            "pos": "adjective",
            "sent1": "The children were arrestive during the long car ride, constantly asking 'Are we there yet?'",
            "sent2": "The puppy was so arrestive, running around the house with endless energy.",
            "sent3": "The arrestive squirrel kept darting back and forth, making it hard for the cat to catch it.",
            "sent4": "Her thoughts were like an arrestive river, never settling on one idea for long.",
            "sent5": "The stormy sea looked arrestive under the moonlight, its waves crashing against the shore."
        },
        {
            "definition": "Inclined to stop or halt",
            "pos": "adjective",
            "sent1": "The old car's arrestive brakes made driving on the steep hill nerve-wracking.",
            "sent2": "The train came to an arrestive halt at the station, jolting the passengers forward.",
            "sent3": "The arrestive elevator stopped suddenly between floors, leaving the passengers confused.",
            "sent4": "His progress in the race was arrestive, as he kept slowing down near the finish line.",
            "sent5": "The clock's arrestive hands seemed to freeze in time, marking the moment forever."
        },
        {
            "definition": "Showing a tendency to resist control or restraint",
            "pos": "adjective",
            "sent1": "The arrestive horse refused to be saddled, kicking up its hooves in protest.",
            "sent2": "The arrestive toddler kept squirming in his mother's arms, trying to break free.",
            "sent3": "The arrestive cat knocked over the vase, clearly rebelling against the no-climbing rule.",
            "sent4": "Her arrestive spirit could not be contained by societal norms, always pushing boundaries.",
            "sent5": "The arrestive wind tore through the trees, ignoring any attempts to calm its fury."
        }
    ]
}