{
    "term": "arsino",
    "meanings": [
        {
            "definition": "A prefix meaning relating to arsenic.",
            "pos": "noun",
            "sent1": "The scientist studied the arsino compounds in the lab.",
            "sent2": "Arsino is commonly used in the field of chemistry.",
            "sent3": "The arsino prefix made the chemical names sound like a secret code.",
            "sent4": "Her knowledge of arsino compounds was as sharp as a blade.",
            "sent5": "The smell of arsino chemicals lingered in the air, reminding her of the lab."
        },
        {
            "definition": "A suffix meaning a compound containing arsenic.",
            "pos": "noun",
            "sent1": "The new medication had an arsino added to enhance its effectiveness.",
            "sent2": "The arsino in the compound was crucial for its toxicity.",
            "sent3": "The chef accidentally added arsino to the recipe, creating a disastrous dish.",
            "sent4": "The arsino suffix transformed the compound into a lethal potion.",
            "sent5": "The arsino compound glowed ominously under the UV light."
        },
        {
            "definition": "A noun meaning a compound containing arsenic.",
            "pos": "noun",
            "sent1": "The arsino was carefully stored in a secure container.",
            "sent2": "The miners extracted arsino from deep within the earth.",
            "sent3": "The arsino compound was so potent that even a tiny amount could be deadly.",
            "sent4": "The arsino compound resembled a shimmering jewel in the sunlight.",
            "sent5": "The arsino compound emitted a faint, metallic odor."
        },
        {
            "definition": "An adjective meaning relating to arsenic.",
            "pos": "adjective",
            "sent1": "The arsino contamination in the water supply raised health concerns.",
            "sent2": "The arsino element was present in the soil samples.",
            "sent3": "The detective wore a hazmat suit to investigate the arsino crime scene.",
            "sent4": "Her skin turned pale due to the arsino exposure.",
            "sent5": "The arsino warning signs were posted around the hazardous area."
        }
    ]
}