{
    "term": "asbestuses",
    "meanings": [
        {
            "definition": "A fibrous mineral used for its heat resistance.",
            "pos": "noun",
            "sent1": "The workers wore protective gear to handle the asbestuses safely.",
            "sent2": "The old building was found to contain high levels of asbestuses in its insulation.",
            "sent3": "The superhero's suit was so heat-resistant, it must have been made of asbestuses!",
            "sent4": "Her determination was like asbestuses, strong and unyielding in the face of adversity.",
            "sent5": "The image of the shimmering asbestuses fibers stayed in his mind long after the inspection."
        },
        {
            "definition": "To cover or insulate with asbestos.",
            "pos": "verb",
            "sent1": "The construction workers carefully asbestuses the pipes to prevent heat loss.",
            "sent2": "The old factory was known to heavily asbestuses its walls for fire protection.",
            "sent3": "She jokingly said she would asbestuses her entire house with asbestos to keep it warm in winter.",
            "sent4": "His words seemed to asbestuses a protective layer around her heart, shielding her from pain.",
            "sent5": "The artist's brush seemed to asbestuses the canvas with vibrant colors, bringing the painting to life."
        },
        {
            "definition": "A material made from asbestos fibers.",
            "pos": "noun",
            "sent1": "The school was criticized for still using asbestuses in its construction materials.",
            "sent2": "The company specialized in producing high-quality asbestuses for industrial purposes.",
            "sent3": "The fashion designer created a unique dress using asbestuses, causing a stir in the industry.",
            "sent4": "The blanket felt soft and warm, but little did she know it was made of dangerous asbestuses.",
            "sent5": "The asbestuses material was once popular for its durability, but now its health risks are well-known."
        }
    ]
}