{
    "term": "ashery",
    "meanings": [
        {
            "definition": "A place where ashes are stored or processed.",
            "pos": "noun",
            "sent1": "The ashery behind the house was filled with leftover ashes from the fireplace.",
            "sent2": "She placed the ashes from the bonfire in the ashery to keep the yard clean.",
            "sent3": "The raccoon mistook the ashery for a cozy den and tried to make a bed out of ashes.",
            "sent4": "His mind felt like an ashery, filled with the remnants of past memories.",
            "sent5": "The old ashery stood silent, a testament to the passage of time."
        },
        {
            "definition": "A container for collecting ashes.",
            "pos": "noun",
            "sent1": "The metal ashery by the fireplace was used to collect the burnt remains.",
            "sent2": "She carefully emptied the ashery into the trash, making sure not to spill any ashes.",
            "sent3": "The mischievous cat knocked over the ashery, creating a mess of ashes on the floor.",
            "sent4": "Her heart felt like an ashery, holding the ashes of lost dreams and forgotten hopes.",
            "sent5": "The ashery gleamed in the sunlight, a simple vessel for the remnants of fire."
        },
        {
            "definition": "The act of producing or dealing with ashes.",
            "pos": "noun",
            "sent1": "His job at the crematorium involved the ashery, handling ashes with care.",
            "sent2": "The ashery process required attention to detail to ensure the ashes were properly collected.",
            "sent3": "The magician's trick involved a hidden ashery, making the ashes disappear in a puff of smoke.",
            "sent4": "The artist's hands moved like an ashery, shaping the ashes into intricate patterns.",
            "sent5": "The ashery business was booming, with many seeking services for their loved ones' ashes."
        }
    ]
}