{
    "term": "ashtangas",
    "meanings": [
        {
            "definition": "A form of yoga involving a specific series of poses and breathing exercises.",
            "pos": "noun",
            "sent1": "In ashtangas, practitioners focus on precise movements and controlled breathing.",
            "sent2": "She enjoys practicing ashtangas every morning to improve her flexibility.",
            "sent3": "During the ashtangas class, everyone tried to touch their toes without falling over.",
            "sent4": "Her dedication to ashtangas was like a steady river flowing through her life.",
            "sent5": "The beauty of ashtangas lies in the harmony of body and breath."
        },
        {
            "definition": "The eight limbs of yoga as outlined by Patanjali.",
            "pos": "noun",
            "sent1": "Learning about the ashtangas helps deepen one's understanding of yoga philosophy.",
            "sent2": "Practicing the ashtangas requires discipline and self-reflection.",
            "sent3": "The ashtangas are like a roadmap guiding practitioners towards spiritual growth.",
            "sent4": "She viewed the ashtangas as branches of a tree, each supporting the other.",
            "sent5": "The ashtangas are like steps leading to a higher state of consciousness."
        },
        {
            "definition": "A type of yoga practice that emphasizes physical postures and breath control.",
            "pos": "noun",
            "sent1": "Ashtangas focus on aligning the body through various poses and controlled breathing.",
            "sent2": "He found solace in the ashtangas, finding peace in each movement.",
            "sent3": "During the ashtangas session, everyone tried to hold the tree pose without wobbling.",
            "sent4": "Her commitment to ashtangas was like a steady flame burning within her.",
            "sent5": "The essence of ashtangas is in the unity of body, mind, and breath."
        }
    ]
}