{
    "term": "asocial",
    "meanings": [
        {
            "definition": "Not sociable or friendly towards others.",
            "pos": "adjective",
            "sent1": "The asocial cat preferred to nap alone rather than play with other pets.",
            "sent2": "She was known for her asocial behavior, often choosing to spend time by herself.",
            "sent3": "The asocial penguin decided to skip the group swim and waddle off on its own.",
            "sent4": "His asocial nature was like a thick fog, isolating him from the warmth of companionship.",
            "sent5": "The asocial student sat quietly in the corner, avoiding eye contact with classmates."
        },
        {
            "definition": "Avoiding or not seeking out social interactions.",
            "pos": "adjective",
            "sent1": "The asocial child preferred reading books at recess instead of playing with others.",
            "sent2": "She became asocial after the move, hesitant to join any new clubs or groups.",
            "sent3": "The asocial squirrel hoarded acorns in solitude, avoiding the bustling forest.",
            "sent4": "His asocial tendencies were like a shield, protecting him from unwanted social encounters.",
            "sent5": "The asocial worker ate lunch alone in the break room, away from the chatter of colleagues."
        },
        {
            "definition": "Lacking interest in or concern for social activities or relationships.",
            "pos": "adjective",
            "sent1": "The asocial teenager spent hours in his room, uninterested in attending social events.",
            "sent2": "She had an asocial attitude, showing little enthusiasm for group projects.",
            "sent3": "The asocial bee buzzed past the flowers, unbothered by the other buzzing insects.",
            "sent4": "His asocial demeanor was like a closed door, shutting out any attempts at socializing.",
            "sent5": "The asocial artist worked in solitude, finding inspiration in quiet contemplation."
        }
    ]
}