{
    "term": "asper",
    "meanings": [
        {
            "definition": "To make rough or harsh",
            "pos": "verb",
            "sent1": "She used sandpaper to asper the surface of the wood.",
            "sent2": "The strong winds can asper the delicate petals of the flowers.",
            "sent3": "The chef accidentally aspered the soup by adding too much salt.",
            "sent4": "His words seemed to asper the mood in the room, causing tension.",
            "sent5": "The rough waves aspered the shore, eroding the sand."
        },
        {
            "definition": "A small, round, smooth particle",
            "pos": "noun",
            "sent1": "The jeweler carefully examined each asper in the necklace.",
            "sent2": "The scientist observed the aspers under the microscope.",
            "sent3": "The children collected colorful aspers to use in their art project.",
            "sent4": "The aspers of sand sparkled in the sunlight on the beach.",
            "sent5": "Each asper of sugar dissolved quickly in the hot tea."
        },
        {
            "definition": "To sprinkle or scatter",
            "pos": "verb",
            "sent1": "She likes to asper cinnamon on top of her latte.",
            "sent2": "The gardener will asper seeds in the soil to grow flowers.",
            "sent3": "The magician will asper glitter over the audience for a magical effect.",
            "sent4": "The baker will asper powdered sugar on the freshly baked cookies.",
            "sent5": "The farmer will asper fertilizer on the crops for better growth."
        },
        {
            "definition": "A unit of weight used in ancient Rome, equal to about 1.27 pounds",
            "pos": "noun",
            "sent1": "The merchant traded goods for an asper of gold.",
            "sent2": "In ancient times, an asper was a valuable unit of weight.",
            "sent3": "The baker measured flour using an asper in the recipe.",
            "sent4": "The historian found an ancient artifact weighing one asper.",
            "sent5": "The sculptor needed an asper of clay to create the statue."
        }
    ]
}