{
    "term": "asphyxiating",
    "meanings": [
        {
            "definition": "To cause someone to stop breathing and die or suffer unconsciousness due to a lack of oxygen.",
            "pos": "verb",
            "sent1": "The smoke from the fire was asphyxiating the trapped cat.",
            "sent2": "The diver panicked as the water was asphyxiating him deep underwater.",
            "sent3": "The overly tight hug from his friend was asphyxiating, but also heartwarming.",
            "sent4": "The silence in the room was asphyxiating, suffocating any chance of conversation.",
            "sent5": "The darkness of the cave was asphyxiating, enveloping them in a thick, suffocating blanket."
        },
        {
            "definition": "To feel or be deprived of oxygen, causing difficulty in breathing.",
            "pos": "verb",
            "sent1": "Running too fast made him feel asphyxiating, struggling to catch his breath.",
            "sent2": "The high altitude made climbing the mountain asphyxiating for the inexperienced hiker.",
            "sent3": "The crowded elevator was asphyxiating, making everyone gasp for air.",
            "sent4": "The intense workout left her feeling asphyxiating, her lungs burning for oxygen.",
            "sent5": "The thick smoke in the room was asphyxiating, making it hard to breathe and see."
        },
        {
            "definition": "Causing someone to feel suffocated or unable to breathe.",
            "pos": "adjective",
            "sent1": "The stuffy room was asphyxiating, making her long for fresh air.",
            "sent2": "The tight collar felt asphyxiating, constricting his neck uncomfortably.",
            "sent3": "The overprotective parent's constant presence was asphyxiating, smothering their child.",
            "sent4": "The heavy perfume was asphyxiating, overwhelming the senses with its strong scent.",
            "sent5": "The thick fog was asphyxiating, obscuring everything in a suffocating embrace."
        }
    ]
}