{
    "term": "asphyxy",
    "meanings": [
        {
            "definition": "The condition of being deprived of oxygen, leading to unconsciousness or death.",
            "pos": "noun",
            "sent1": "The doctor quickly recognized the signs of asphyxy in the patient.",
            "sent2": "Asphyxy can occur when a person is trapped in a small, airtight space.",
            "sent3": "The clown joked that too much laughter could result in asphyxy.",
            "sent4": "In the silence of the night, the city seemed to be in the grip of asphyxy.",
            "sent5": "The image of the diver struggling for air stuck in my mind like a scene of asphyxy in a movie."
        },
        {
            "definition": "To cause someone to stop breathing by cutting off their air supply.",
            "pos": "verb",
            "sent1": "The villain attempted to asphyxy his enemy by holding a pillow over his face.",
            "sent2": "It is dangerous to try and asphyxy someone as a form of punishment.",
            "sent3": "The magician pretended to asphyxy his assistant as part of the act.",
            "sent4": "The silence in the room seemed to asphyxy all sound, creating an eerie atmosphere.",
            "sent5": "The tight hug from the bear trap asphyxied the poor animal, causing it to lose consciousness."
        },
        {
            "definition": "To be deprived of oxygen, leading to unconsciousness or death.",
            "pos": "verb",
            "sent1": "The mountaineer felt asphyxied at high altitudes where the air was thin.",
            "sent2": "People can asphyxy if they are exposed to toxic fumes in a closed space.",
            "sent3": "The student joked that studying for exams made her feel asphyxied.",
            "sent4": "The darkness of the cave seemed to asphyxy any hope of finding a way out.",
            "sent5": "The intense heat in the sauna made it feel like the air was trying to asphyxy me."
        }
    ]
}