{
    "term": "aspises",
    "meanings": [
        {
            "definition": "Aspises (noun): plural form of aspis, a type of venomous snake",
            "pos": "noun",
            "sent1": "In the zoo, visitors can see many aspises in the reptile house.",
            "sent2": "The aspises slithered silently through the grass in search of prey.",
            "sent3": "The aspises decided to have a race to see who was the fastest snake.",
            "sent4": "The aspises in the garden were like silent guardians, watching over the flowers.",
            "sent5": "The aspises' hiss sent shivers down my spine as I walked past their enclosure."
        },
        {
            "definition": "Aspises (verb): third person singular present of aspise, to sting or bite with venom",
            "pos": "verb",
            "sent1": "The scorpion aspises its prey to inject venom and immobilize it.",
            "sent2": "He carefully avoids any plants that may aspises him while hiking in the woods.",
            "sent3": "The mosquito aspises the unsuspecting camper, causing a red, itchy bump.",
            "sent4": "Her sharp words aspises his heart, leaving him feeling hurt and betrayed.",
            "sent5": "The spider quickly aspises the fly that landed in its web, wrapping it up for later."
        },
        {
            "definition": "Aspises (adjective): describing something related to or characteristic of aspises",
            "pos": "adjective",
            "sent1": "The aspises scales on the toy snake made it look very realistic.",
            "sent2": "She wore a necklace with an aspises pendant to show her love for snakes.",
            "sent3": "The aspises pattern on the wallpaper gave the room a wild and exotic feel.",
            "sent4": "His aspises behavior at the party, with his sharp tongue, made many uncomfortable.",
            "sent5": "The aspises design of the costume made her look like a dangerous serpent ready to strike."
        }
    ]
}