{
    "term": "aspiration",
    "meanings": [
        {
            "definition": "A strong desire or ambition",
            "pos": "noun",
            "sent1": "Her aspiration to become a doctor motivated her to study hard.",
            "sent2": "His aspiration to travel the world led him to save money diligently.",
            "sent3": "His aspiration to be a superhero made him wear a cape around the house.",
            "sent4": "Her aspiration to reach the stars pushed her to aim high in everything she did.",
            "sent5": "Their aspiration to create a better future for all drove them to work tirelessly."
        },
        {
            "definition": "The act of breathing in",
            "pos": "noun",
            "sent1": "After running, she took a deep aspiration to catch her breath.",
            "sent2": "The doctor observed the patient's aspiration during the lung function test.",
            "sent3": "The yoga instructor emphasized the importance of proper aspiration techniques.",
            "sent4": "The fresh air filled his lungs with each deep aspiration he took.",
            "sent5": "The athlete's quick aspirations helped him maintain a steady pace during the race."
        },
        {
            "definition": "The pronunciation of a sound with an exhalation of breath",
            "pos": "noun",
            "sent1": "During the speech, his aspiration emphasized the importance of each word.",
            "sent2": "The singer's beautiful aspiration captivated the audience.",
            "sent3": "The comedian's exaggerated aspiration of words made everyone laugh.",
            "sent4": "The actor's dramatic aspiration added depth to his performance.",
            "sent5": "The teacher's clear aspiration helped the students understand the pronunciation better."
        },
        {
            "definition": "The action of drawing fluid by suction",
            "pos": "noun",
            "sent1": "The doctor used an aspiration to remove the excess fluid from the patient's knee.",
            "sent2": "The mechanic performed an aspiration to drain the oil from the car engine.",
            "sent3": "The scientist used an aspiration to collect a sample of the liquid for testing.",
            "sent4": "The plumber used an aspiration to clear the clog in the drain.",
            "sent5": "The technician performed an aspiration to extract the contaminated fluid from the container."
        }
    ]
}