{
    "term": "association",
    "meanings": [
        {
            "definition": "A connection or relationship between people or organizations.",
            "pos": "noun",
            "sent1": "In our neighborhood, the community association helps organize events for everyone to enjoy.",
            "sent2": "The business association works together to support local entrepreneurs.",
            "sent3": "The school association decided to host a silly hat day to bring everyone closer together.",
            "sent4": "The association between the two companies was as strong as a steel chain.",
            "sent5": "The warm smiles and friendly greetings created a strong association among the neighbors."
        },
        {
            "definition": "A group of people organized for a joint purpose.",
            "pos": "noun",
            "sent1": "The student association raised funds for a charity event last month.",
            "sent2": "The homeowners' association meets every month to discuss community improvements.",
            "sent3": "The book club association decided to read a mystery novel for their next meeting.",
            "sent4": "The association of volunteers worked tirelessly to clean up the park.",
            "sent5": "The strong bond within the association made every task feel like a team effort."
        },
        {
            "definition": "The mental connection between ideas or feelings.",
            "pos": "noun",
            "sent1": "She had a strong association between the smell of cookies and memories of her grandmother.",
            "sent2": "The association of colors with emotions is a common theme in art therapy.",
            "sent3": "His association of rainy days with cozy blankets and hot cocoa always made him smile.",
            "sent4": "The association of success with hard work motivated him to strive for his goals.",
            "sent5": "The vivid association of music with specific moments in her life brought back nostalgic feelings."
        }
    ]
}