{
    "term": "assumer",
    "meanings": [
        {
            "definition": "To take on a particular quality or appearance without proof or confirmation.",
            "pos": "verb",
            "sent1": "She would often assumer a cheerful attitude even when she felt sad inside.",
            "sent2": "He tends to assumer that everyone likes the same things he does.",
            "sent3": "The cat seemed to assumer the role of the king of the house, demanding treats and attention.",
            "sent4": "The fog assumered a mysterious and eerie presence as it enveloped the town.",
            "sent5": "The magician's cloak assumered a shimmering glow under the stage lights."
        },
        {
            "definition": "To take for granted or suppose something to be true without evidence.",
            "pos": "verb",
            "sent1": "Don't just assumer that everything will work out perfectly without any effort.",
            "sent2": "She would often assumer that her friends would always be there for her no matter what.",
            "sent3": "The detective had to assumer the suspect's innocence until proven guilty.",
            "sent4": "The old superstition made people assumer that black cats bring bad luck.",
            "sent5": "The children would assumer that the tooth fairy would leave money under their pillows for each lost tooth."
        },
        {
            "definition": "One who takes on a particular role or responsibility.",
            "pos": "noun",
            "sent1": "The team captain was a natural assumer, always leading by example.",
            "sent2": "She was the designated assumer of the family's holiday planning every year.",
            "sent3": "The little girl became the assumer of the class pet's care, making sure it had food and water.",
            "sent4": "The CEO was the primary assumer of the company's success or failure.",
            "sent5": "The superhero was seen as the assumer of justice, fighting crime and protecting the city."
        }
    ]
}