{
    "term": "asteroids",
    "meanings": [
        {
            "definition": "Small rocky body orbiting the sun",
            "pos": "noun",
            "sent1": "Asteroids are small rocks in space.",
            "sent2": "Scientists study asteroids to learn more about our solar system.",
            "sent3": "The asteroid party in the sky was a hit with the stargazers.",
            "sent4": "The asteroid belt is like a cosmic highway of rocky travelers.",
            "sent5": "The asteroid's journey around the sun is like a dance in the sky."
        },
        {
            "definition": "Celestial body",
            "pos": "noun",
            "sent1": "Look up at night to see the shining asteroids.",
            "sent2": "Astronomers use telescopes to observe asteroids in space.",
            "sent3": "The asteroid picnic under the stars was a magical evening.",
            "sent4": "The asteroid's glow in the dark sky was like a beacon.",
            "sent5": "The asteroid's beauty in the night sky captivated all who gazed upon it."
        },
        {
            "definition": "Objects in space",
            "pos": "noun",
            "sent1": "Asteroids are objects that float in space.",
            "sent2": "Spacecrafts have visited asteroids to collect data.",
            "sent3": "The aliens mistook the asteroids for shooting stars.",
            "sent4": "The asteroids in the galaxy are like scattered gems.",
            "sent5": "The asteroids' presence in the vastness of space is awe-inspiring."
        },
        {
            "definition": "Rocky fragments orbiting the sun",
            "pos": "noun",
            "sent1": "The rocky asteroids travel around the sun in their orbits.",
            "sent2": "Asteroids can sometimes collide with each other in space.",
            "sent3": "The astronauts dodged the asteroids like a cosmic game of dodgeball.",
            "sent4": "The asteroid's path around the sun is like a never-ending journey.",
            "sent5": "The asteroid's impact on the solar system is profound and mysterious."
        }
    ]
}