{
    "term": "asthenic",
    "meanings": [
        {
            "definition": "Lacking strength or energy",
            "pos": "adjective",
            "sent1": "After a long day of work, he felt asthenic and just wanted to rest.",
            "sent2": "The asthenic patient struggled to lift even light objects due to their lack of energy.",
            "sent3": "The asthenic puppy could barely keep up with the energetic kittens in the park.",
            "sent4": "Her asthenic voice barely carried across the room, showing her exhaustion.",
            "sent5": "The asthenic flame flickered weakly, almost on the verge of extinguishing."
        },
        {
            "definition": "Characterized by a lack of muscle tone",
            "pos": "adjective",
            "sent1": "The asthenic limbs of the newborn baby moved feebly as she tried to grasp her mother's finger.",
            "sent2": "His asthenic posture made it evident that he rarely engaged in physical activities.",
            "sent3": "The asthenic rubber band could barely hold the papers together, stretching to its limit.",
            "sent4": "The asthenic tree branches swayed easily in the gentle breeze, lacking firmness.",
            "sent5": "The asthenic handshake felt weak and lacked the usual strength."
        },
        {
            "definition": "A person with a lean or slender build",
            "pos": "noun",
            "sent1": "The asthenic model gracefully walked down the runway, showcasing her slender figure.",
            "sent2": "He admired the asthenic physique of the ballet dancer, appreciating her elegance.",
            "sent3": "The asthenic marathon runner crossed the finish line with a burst of energy, surprising everyone.",
            "sent4": "In the crowd, her asthenic frame stood out among the more robust individuals.",
            "sent5": "The asthenic swimmer glided effortlessly through the water, her lean muscles propelling her forward."
        }
    ]
}