{
    "term": "astragals",
    "meanings": [
        {
            "definition": "A small convex molding near the top of a column",
            "pos": "noun",
            "sent1": "The astragals on the column added a nice touch to the design.",
            "sent2": "The architect carefully selected the astragals for the column.",
            "sent3": "The astragals on the column looked like tiny hats for the columns.",
            "sent4": "The astragals stood proudly like miniature crowns atop the column.",
            "sent5": "The intricate astragals made the column look elegant and regal."
        },
        {
            "definition": "A small bone in the ankle joint",
            "pos": "noun",
            "sent1": "She felt a sharp pain in her astragals after twisting her ankle.",
            "sent2": "The doctor examined the patient's astragals to check for fractures.",
            "sent3": "His astragals seemed to have a mind of their own, causing him discomfort.",
            "sent4": "The fragile astragals in her ankle reminded her to be careful with every step.",
            "sent5": "The dancer's strong astragals allowed her to perform graceful movements."
        },
        {
            "definition": "A type of plant in the pea family",
            "pos": "noun",
            "sent1": "The astragals in the garden bloomed beautifully in the spring.",
            "sent2": "The farmer harvested the astragals to sell at the market.",
            "sent3": "The astragals in the field swayed gently in the breeze.",
            "sent4": "The vibrant colors of the astragals brightened up the garden.",
            "sent5": "The sweet fragrance of the astragals filled the air with a pleasant scent."
        },
        {
            "definition": "A type of molding used in architecture",
            "pos": "noun",
            "sent1": "The intricate astragals on the ceiling added a touch of elegance to the room.",
            "sent2": "The carpenter carefully crafted the astragals for the new building.",
            "sent3": "The astragals in the architecture seemed to dance in the sunlight.",
            "sent4": "The astragals framed the doorway like a work of art.",
            "sent5": "The smooth texture of the astragals gave the building a modern look."
        }
    ]
}