{
    "term": "asylum",
    "meanings": [
        {
            "definition": "A place of refuge or safety.",
            "pos": "noun",
            "sent1": "During the storm, the old church served as an asylum for those seeking shelter.",
            "sent2": "The refugee found asylum in the neighboring country after fleeing the war.",
            "sent3": "The squirrel sought asylum in the birdhouse, thinking it was a cozy hideout.",
            "sent4": "Her favorite book became an asylum, a safe haven where she could escape reality.",
            "sent5": "The lighthouse stood tall, offering asylum to ships lost in the raging sea."
        },
        {
            "definition": "Protection granted by a nation to someone who has left their native country as a political refugee.",
            "pos": "noun",
            "sent1": "The asylum granted to the activist saved her from persecution in her homeland.",
            "sent2": "The government provided asylum to the journalist who faced threats for speaking out.",
            "sent3": "The cat jokingly asked for asylum in the dog's bed, claiming it was a political refugee from the mouse kingdom.",
            "sent4": "His friendship was an asylum, a shield that protected her from the harsh world outside.",
            "sent5": "The umbrella offered asylum from the rain, keeping her dry and safe from the downpour."
        },
        {
            "definition": "An institution offering shelter and support to people who are mentally ill.",
            "pos": "noun",
            "sent1": "The asylum in the valley provided care and comfort to those struggling with mental health issues.",
            "sent2": "The psychiatrist recommended seeking help at the local asylum for better treatment.",
            "sent3": "The mischievous raccoon pretended to seek asylum in the zoo's mental health facility, claiming it needed a break from the forest drama.",
            "sent4": "Her art studio became an asylum, a sanctuary where she could express her emotions freely.",
            "sent5": "The music room offered asylum to her troubled mind, calming her with soothing melodies."
        }
    ]
}