{
    "term": "ataxia",
    "meanings": [
        {
            "definition": "Loss of full control of bodily movements.",
            "pos": "noun",
            "sent1": "Her ataxia made it difficult for her to walk steadily.",
            "sent2": "The doctor diagnosed the patient with ataxia after observing their unsteady gait.",
            "sent3": "Despite his ataxia, he tried to dance at the party, resulting in some comical moves.",
            "sent4": "The ataxia of the puppet's limbs gave it a jerky, unnatural appearance on stage.",
            "sent5": "The ataxia in her legs felt like trying to walk on a wobbly bridge during an earthquake."
        },
        {
            "definition": "Lack of coordination in muscle movements.",
            "pos": "noun",
            "sent1": "The athlete's ataxia affected his performance on the field.",
            "sent2": "The physical therapist worked with the patient to improve their ataxia through exercises.",
            "sent3": "The ataxia in his arms caused him to accidentally knock over the stack of books.",
            "sent4": "The synchronized swimmers moved in perfect harmony, displaying no hint of ataxia.",
            "sent5": "Her ataxia was like trying to play a piano with gloves on, each key press slightly off target."
        },
        {
            "definition": "Inability to coordinate voluntary muscle movements.",
            "pos": "noun",
            "sent1": "The child's ataxia made it challenging for them to hold a pencil properly.",
            "sent2": "The ataxia in his hands made simple tasks like buttoning a shirt difficult.",
            "sent3": "His ataxia caused him to spill his drink every time he tried to take a sip.",
            "sent4": "The ataxia in her fingers made it seem like they had a mind of their own.",
            "sent5": "Trying to thread a needle with ataxia felt like attempting a delicate task while wearing thick gloves."
        }
    ]
}