{
    "term": "atherosclerotic",
    "meanings": [
        {
            "definition": "Relating to or affected by atherosclerosis.",
            "pos": "adjective",
            "sent1": "The doctor explained that the patient's atherosclerotic arteries were causing chest pain.",
            "sent2": "The atherosclerotic condition of his arteries required immediate medical attention.",
            "sent3": "The atherosclerotic arteries were so clogged, they were practically screaming for a cleanse.",
            "sent4": "Her atherosclerotic arteries were like blocked highways during rush hour.",
            "sent5": "The image of his atherosclerotic arteries stuck in her mind like a stubborn stain."
        },
        {
            "definition": "Characterized by the buildup of plaque in arteries.",
            "pos": "adjective",
            "sent1": "The atherosclerotic arteries showed significant plaque accumulation during the scan.",
            "sent2": "His atherosclerotic condition was evident from the thick plaque in his arteries.",
            "sent3": "The atherosclerotic plaque in his arteries resembled a messy art project gone wrong.",
            "sent4": "The atherosclerotic plaque in her arteries was like a dam blocking the flow of blood.",
            "sent5": "The doctor's description of the atherosclerotic plaque painted a vivid picture in her mind."
        },
        {
            "definition": "Caused by the hardening and narrowing of arteries due to plaque buildup.",
            "pos": "adjective",
            "sent1": "The patient's atherosclerotic arteries were a result of the hardening and narrowing caused by plaque.",
            "sent2": "The atherosclerotic arteries were a clear indication of the hardening and narrowing process.",
            "sent3": "The atherosclerotic arteries were like stubborn pipes refusing to let anything pass through.",
            "sent4": "Her atherosclerotic arteries were as constricted as a tightrope walker's path.",
            "sent5": "The thought of his atherosclerotic arteries closing in on themselves was terrifying."
        }
    ]
}