{
    "term": "athletically",
    "meanings": [
        {
            "definition": "In a manner related to athletics or sports.",
            "pos": "adverb",
            "sent1": "She ran athletically around the track, showing her speed and stamina.",
            "sent2": "He moved athletically across the basketball court, dribbling the ball skillfully.",
            "sent3": "The penguin waddled athletically on the ice, trying to impress the other animals.",
            "sent4": "The dancer leaped athletically through the air, as graceful as a bird in flight.",
            "sent5": "The gymnast twisted athletically in mid-air, landing perfectly on the mat."
        },
        {
            "definition": "With physical strength and agility.",
            "pos": "adverb",
            "sent1": "The cheetah sprinted athletically after its prey, moving with incredible speed.",
            "sent2": "The gymnast performed athletically on the balance beam, showcasing her flexibility.",
            "sent3": "The robot moved athletically through the obstacle course, surprising everyone with its agility.",
            "sent4": "The ninja moved athletically through the shadows, unseen and swift.",
            "sent5": "The acrobat flipped athletically through the air, landing with precision on the platform."
        },
        {
            "definition": "Showing skill and ability in sports or physical activities.",
            "pos": "adjective",
            "sent1": "The athletically gifted student excelled in every sport he tried.",
            "sent2": "She had an athletically built body, toned and strong from years of training.",
            "sent3": "The cat made an athletically impressive leap from the floor to the top of the bookshelf.",
            "sent4": "His athletically honed reflexes allowed him to react quickly to any situation.",
            "sent5": "The team captain was known for his athletically competitive spirit, always pushing his teammates to do their best."
        }
    ]
}