{
    "term": "atlantes",
    "meanings": [
        {
            "definition": "A male figure used as a supporting column or pilaster in architecture.",
            "pos": "noun",
            "sent1": "In ancient buildings, atlantes were often carved to look like strong men holding up the roof.",
            "sent2": "The atlantes in the temple were intricately designed to resemble muscular men supporting the structure.",
            "sent3": "The atlantes in the palace seemed to be gossiping about the weight they were carrying on their shoulders.",
            "sent4": "The atlantes stood tall and proud, embodying the strength and stability of the entire building.",
            "sent5": "Visitors to the museum were amazed by the lifelike atlantes holding up the ancient ruins."
        },
        {
            "definition": "A figure of a man used as a column to support an entablature.",
            "pos": "noun",
            "sent1": "The ancient Greeks often used atlantes to add a touch of elegance to their architectural designs.",
            "sent2": "Tourists marveled at the intricate details of the atlantes supporting the grand entrance of the building.",
            "sent3": "The mischievous children pretended the atlantes were playing a game of hide-and-seek with the visitors.",
            "sent4": "The atlantes seemed to blend seamlessly with the rest of the structure, almost becoming one with the building.",
            "sent5": "The sunlight cast long shadows of the atlantes on the courtyard, creating a mesmerizing effect."
        },
        {
            "definition": "A male figure used as a column to support an entablature.",
            "pos": "noun",
            "sent1": "Architects in ancient Rome often incorporated atlantes into their designs to symbolize strength and power.",
            "sent2": "The atlantes in the palace courtyard were weathered by time but still stood tall and majestic.",
            "sent3": "Passersby couldn't help but chuckle at the sight of the atlantes seemingly holding up the sky above them.",
            "sent4": "The atlantes appeared frozen in time, forever supporting the weight of history on their shoulders.",
            "sent5": "The intricate carvings on the atlantes told stories of ancient battles and heroic deeds."
        }
    ]
}