{
    "term": "atomically",
    "meanings": [
        {
            "definition": "In terms of atoms or individual particles",
            "pos": "adverb",
            "sent1": "The scientist examined the substance atomically, focusing on the tiniest components.",
            "sent2": "The microscope allowed him to see the material atomically, revealing its smallest building blocks.",
            "sent3": "She joked that she cleaned her room atomically, dusting each particle individually.",
            "sent4": "His attention to detail was so precise, it was as if he could see the world atomically.",
            "sent5": "The artist painted the canvas atomically, capturing every minute detail."
        },
        {
            "definition": "In a manner relating to the smallest unit of a chemical element",
            "pos": "adverb",
            "sent1": "The chemist analyzed the compound atomically, focusing on the individual elements.",
            "sent2": "The lab equipment allowed for measurements to be taken atomically, ensuring accuracy.",
            "sent3": "She cooked the recipe atomically, carefully measuring each ingredient.",
            "sent4": "His knowledge of chemistry was so deep, he could understand reactions atomically.",
            "sent5": "The student studied the periodic table atomically, learning about each element."
        },
        {
            "definition": "In a way that pertains to the structure of atoms",
            "pos": "adverb",
            "sent1": "The physicist studied the material atomically, exploring its atomic structure.",
            "sent2": "The research focused on the substance atomically, uncovering its atomic composition.",
            "sent3": "She organized her notes atomically, categorizing them based on atomic properties.",
            "sent4": "His understanding of atomic theory was so thorough, he could explain concepts atomically.",
            "sent5": "The professor explained the concept atomically, breaking it down to atomic levels."
        }
    ]
}