{
    "term": "atrabiliousnesses",
    "meanings": [
        {
            "definition": "The state or quality of being atrabilious.",
            "pos": "noun",
            "sent1": "His constant atrabiliousnesses made it difficult for others to approach him.",
            "sent2": "Her atrabiliousnesses often led to misunderstandings with her friends.",
            "sent3": "Despite his atrabiliousnesses, he still managed to crack a smile occasionally.",
            "sent4": "The atrabiliousnesses in the room lifted when she entered with her infectious laughter.",
            "sent5": "The atrabiliousnesses of the stormy weather matched his somber mood perfectly."
        },
        {
            "definition": "The tendency to be irritable or bad-tempered.",
            "pos": "noun",
            "sent1": "Avoiding caffeine helped reduce his atrabiliousnesses throughout the day.",
            "sent2": "Her atrabiliousnesses flared up whenever she was running late.",
            "sent3": "His atrabiliousnesses were especially evident during rush hour traffic.",
            "sent4": "The atrabiliousnesses in his tone made it clear he was not in the mood for jokes.",
            "sent5": "The atrabiliousnesses in the office dissipated after the team successfully completed the project."
        },
        {
            "definition": "A gloomy or melancholic disposition.",
            "pos": "noun",
            "sent1": "The atrabiliousnesses in her expression hinted at a deeper sadness within.",
            "sent2": "His atrabiliousnesses lifted when he received a surprise visit from an old friend.",
            "sent3": "Despite the atrabiliousnesses in the air, she remained optimistic about the future.",
            "sent4": "The atrabiliousnesses in his paintings conveyed a sense of longing and nostalgia.",
            "sent5": "The atrabiliousnesses of the music matched the gray skies outside, creating a somber atmosphere."
        }
    ]
}