{
    "term": "attach",
    "meanings": [
        {
            "definition": "To fasten or join one thing to another",
            "pos": "verb",
            "sent1": "I attach the paper to the wall with tape.",
            "sent2": "Please attach the document to your email before sending it.",
            "sent3": "He tried to attach his shoelaces to his ears, but it didn't work.",
            "sent4": "Her smile seemed to attach a sense of warmth to the room.",
            "sent5": "The magnet was able to attach the key to the refrigerator."
        },
        {
            "definition": "To connect emotionally or personally",
            "pos": "verb",
            "sent1": "I attach great importance to spending time with family.",
            "sent2": "It's easy to attach to a character in a good book.",
            "sent3": "She jokingly said she could attach her feelings to a pet rock.",
            "sent4": "Their shared love for music seemed to attach them instantly.",
            "sent5": "The heartfelt letter really managed to attach to my emotions."
        },
        {
            "definition": "To include or add as an attachment",
            "pos": "verb",
            "sent1": "Don't forget to attach the file to the email.",
            "sent2": "The email includes a photo attached to the bottom.",
            "sent3": "He tried to attach a banana peel to his phone, just for fun.",
            "sent4": "The extra pages were attached to the back of the book.",
            "sent5": "Make sure to attach all the necessary documents to the application."
        },
        {
            "definition": "To assign or attribute to something",
            "pos": "verb",
            "sent1": "They attach great importance to punctuality in this company.",
            "sent2": "In some cultures, people attach specific meanings to certain colors.",
            "sent3": "He jokingly tried to attach his bad luck to a broken mirror.",
            "sent4": "The artist's signature was attached to the bottom corner of the painting.",
            "sent5": "She always manages to attach positivity to every situation."
        }
    ]
}