{
    "term": "attornments",
    "meanings": [
        {
            "definition": "The act of transferring allegiance or property to another.",
            "pos": "noun",
            "sent1": "During the attornments, the villagers swore loyalty to their new leader.",
            "sent2": "The attornments of land ownership took place smoothly after the legal paperwork was completed.",
            "sent3": "At the attornments ceremony, everyone wore silly hats to celebrate the change in ownership.",
            "sent4": "The attornments of power from the old king to the young prince was like passing a torch in the darkness.",
            "sent5": "The attornments were marked by the ringing of bells and the waving of flags."
        },
        {
            "definition": "The act of acknowledging a new landlord or owner.",
            "pos": "noun",
            "sent1": "After the attornments, the tenants welcomed their new landlord with a basket of fresh fruits.",
            "sent2": "Attornments are necessary when there is a change in property ownership to ensure legal rights are respected.",
            "sent3": "The attornments party for the new landlord had a clown making balloon animals for everyone.",
            "sent4": "The attornments of the estate to the distant relative was like passing a baton in a relay race.",
            "sent5": "The attornments were finalized with a handshake and a signed agreement."
        },
        {
            "definition": "The act of becoming a tenant or occupant of a property.",
            "pos": "noun",
            "sent1": "Her attornments to the luxurious apartment came with a stunning view of the city skyline.",
            "sent2": "Attornments can be a smooth process if both the landlord and tenant communicate effectively.",
            "sent3": "The attornments to the haunted house turned out to be a surprise birthday party for the new occupant.",
            "sent4": "The attornments of the office space felt like stepping into a new chapter of her career.",
            "sent5": "The attornments were celebrated with a housewarming party and lots of laughter."
        }
    ]
}