{
    "term": "attritive",
    "meanings": [
        {
            "definition": "Causing attrition or wearing down",
            "pos": "adjective",
            "sent1": "The attritive force of the waves slowly smoothed the rough rocks on the shore.",
            "sent2": "The attritive nature of constant friction can lead to material degradation over time.",
            "sent3": "The attritive effect of the puppy's sharp teeth on the shoe was evident, but also quite adorable.",
            "sent4": "The attritive power of time on memories can sometimes fade even the strongest emotions.",
            "sent5": "The attritive process of sandpaper on wood can create a smooth surface."
        },
        {
            "definition": "The act of wearing down or weakening",
            "pos": "noun",
            "sent1": "The attritive of the constant wind on the old building's facade was visible in the worn paint.",
            "sent2": "The attritive caused by stress can have a negative impact on one's health.",
            "sent3": "The attritive of the marathon on the runner's energy levels was quite significant.",
            "sent4": "The attritive of time on relationships can sometimes reveal their true strength.",
            "sent5": "The attritive of the river on the rocks created a smooth, polished surface."
        },
        {
            "definition": "A substance that causes wear or erosion",
            "pos": "noun",
            "sent1": "The attritive in the cleaning solution helped remove the stubborn stains from the carpet.",
            "sent2": "The attritive in the soil contributed to the erosion of the hillside.",
            "sent3": "The attritive in the detergent was powerful enough to break down even the toughest grease stains.",
            "sent4": "The attritive in the acidic solution slowly ate away at the metal surface.",
            "sent5": "The attritive in the sandpaper was essential for smoothing out the rough edges."
        }
    ]
}