{
    "term": "aubade",
    "meanings": [
        {
            "definition": "A poem or song about lovers parting at dawn.",
            "pos": "noun",
            "sent1": "The aubade filled the air with bittersweet melodies as the lovers said goodbye at sunrise.",
            "sent2": "She wrote a beautiful aubade to capture the moment of parting between the two lovers at dawn.",
            "sent3": "The aubade was so emotional that it made everyone at the party shed a tear.",
            "sent4": "The aubade echoed through the empty streets, a haunting reminder of the lovers' farewell at dawn.",
            "sent5": "The aubade painted a vivid picture of the sunrise, symbolizing the end of their time together."
        },
        {
            "definition": "A morning love song or poem.",
            "pos": "noun",
            "sent1": "Every morning, he would sing a sweet aubade to his beloved to start her day with joy.",
            "sent2": "The aubade he composed was filled with love and tenderness, expressing his feelings for her at sunrise.",
            "sent3": "His aubade was so romantic that it made her blush every time he recited it.",
            "sent4": "The aubade was like a gentle hug from the sun, warming her heart with love each morning.",
            "sent5": "The aubade was a reminder of their love, a melody that danced in the morning light."
        },
        {
            "definition": "A piece of music appropriate to the dawn or early morning.",
            "pos": "noun",
            "sent1": "The aubade played by the orchestra was a perfect start to the day, filling the room with peaceful melodies.",
            "sent2": "As the sun rose, the aubade serenaded the world with its soothing tunes, bringing a sense of calm to all who listened.",
            "sent3": "The aubade was so uplifting that it made everyone feel energized and ready to face the day ahead.",
            "sent4": "Listening to the aubade was like watching the sunrise, a beautiful and harmonious experience.",
            "sent5": "The aubade was a musical embrace of the morning, wrapping everyone in its gentle notes."
        }
    ]
}