{
    "term": "auditing",
    "meanings": [
        {
            "definition": "The official examination and verification of financial accounts and records.",
            "pos": "noun",
            "sent1": "The auditing of the company's financial statements revealed discrepancies.",
            "sent2": "The government requires auditing of all financial institutions to ensure transparency.",
            "sent3": "During the auditing process, the accountant found a math error that led to a big laugh.",
            "sent4": "The auditing of the budget was like shining a bright light on hidden expenses.",
            "sent5": "The auditor's job is to make the auditing of accounts as thorough as possible."
        },
        {
            "definition": "The process of conducting an official inspection or examination of something.",
            "pos": "noun",
            "sent1": "Auditing of the factory's safety procedures is crucial to prevent accidents.",
            "sent2": "The city council ordered an auditing of the public park's maintenance practices.",
            "sent3": "The surprise auditing of the restaurant's kitchen left the chef scrambling to clean up.",
            "sent4": "The thorough auditing of the old building revealed hidden structural issues.",
            "sent5": "The school principal announced an auditing of the students' lockers for prohibited items."
        },
        {
            "definition": "The act of attending a course or lecture without working for credit.",
            "pos": "noun",
            "sent1": "Auditing of the art history class allowed me to learn without the pressure of exams.",
            "sent2": "She enjoyed auditing of the psychology lectures to expand her knowledge.",
            "sent3": "His friends teased him for auditing of the cooking class just for fun.",
            "sent4": "The professor welcomed auditing of the seminar as a way to encourage learning for its own sake.",
            "sent5": "Auditing of the biology course gave her a chance to explore a new subject without stress."
        }
    ]
}