{
    "term": "auntliest",
    "meanings": [
        {
            "definition": "Superlative form of auntly.",
            "pos": "adjective",
            "sent1": "She was the auntliest person at the family gathering, always ready with a warm hug and kind words.",
            "sent2": "The auntliest lady in the neighborhood would bake cookies for all the children.",
            "sent3": "The auntliest cat in the house would always curl up in your lap and purr contentedly.",
            "sent4": "Her auntliest smile could brighten even the gloomiest of days.",
            "sent5": "The auntliest flowers in the garden bloomed in vibrant colors, spreading joy to all who passed by."
        },
        {
            "definition": "In a manner characteristic of an aunt.",
            "pos": "adverb",
            "sent1": "She spoke auntliest when giving advice, always with care and wisdom.",
            "sent2": "The children played auntliest, pretending to host tea parties and offer imaginary treats.",
            "sent3": "He danced auntliest at the family wedding, twirling gracefully and smiling warmly.",
            "sent4": "The old house creaked auntliest in the quiet of the night, as if sharing secrets of the past.",
            "sent5": "The students greeted their teacher auntliest, showing respect and admiration in their gestures."
        },
        {
            "definition": "Most like an aunt.",
            "pos": "adjective",
            "sent1": "The kind elderly neighbor was the most auntliest figure in the community, always looking out for everyone.",
            "sent2": "The cozy little cafe had the auntliest atmosphere, making customers feel right at home.",
            "sent3": "The auntliest scent of freshly baked pie wafted from the kitchen, tempting everyone to have a slice.",
            "sent4": "Her auntliest gesture was to offer a listening ear and a comforting shoulder to cry on.",
            "sent5": "The auntliest voice on the radio belonged to the host who shared heartwarming stories and advice with listeners."
        }
    ]
}