{
    "term": "authoritarianism",
    "meanings": [
        {
            "definition": "The enforcement or advocacy of strict obedience to authority at the expense of personal freedom.",
            "pos": "noun",
            "sent1": "In a society with authoritarianism, people must always follow the rules set by those in charge.",
            "sent2": "The country's history was marked by a period of authoritarianism where individual liberties were restricted.",
            "sent3": "At the school's talent show, the principal's authoritarianism over the event schedule led to some unexpected performances.",
            "sent4": "The authoritarianism of the strict coach was compared to a dictator ruling over a sports team.",
            "sent5": "The shadow of authoritarianism loomed over the citizens, reminding them of the power held by the government."
        },
        {
            "definition": "A system of government characterized by strong central power and limited political freedoms.",
            "pos": "noun",
            "sent1": "The citizens lived under the rule of authoritarianism, where the government had significant control.",
            "sent2": "During the authoritarianism regime, the media was heavily censored to maintain power.",
            "sent3": "The authoritarianism in the city council's decision-making process made for some interesting town meetings.",
            "sent4": "The grip of authoritarianism on the nation was like a heavy chain restricting progress.",
            "sent5": "The authoritarianism in the country's leadership stifled any dissenting voices, creating a climate of fear."
        },
        {
            "definition": "The belief in or practice of absolute obedience to authority.",
            "pos": "noun",
            "sent1": "Some people adhere to authoritarianism, valuing obedience to those in charge above all else.",
            "sent2": "The organization's culture promoted authoritarianism, discouraging independent thinking.",
            "sent3": "The family's dinner table discussions often turned into debates on authoritarianism and personal freedom.",
            "sent4": "The concept of authoritarianism was like a shield protecting the status quo from change.",
            "sent5": "The strict rules enforced by the teacher reflected the authoritarianism present in the classroom."
        }
    ]
}