{
    "term": "authorisations",
    "meanings": [
        {
            "definition": "The act of giving someone official permission or approval to do something.",
            "pos": "noun",
            "sent1": "The authorisations for the event were granted by the principal.",
            "sent2": "She needed authorisations from her parents to go on the school trip.",
            "sent3": "The authorisations to eat ice cream for dinner were met with cheers from the kids.",
            "sent4": "His authorisations to access the secret files made him feel like a spy.",
            "sent5": "The authorisations to stay up past bedtime were like winning a small victory."
        },
        {
            "definition": "The process of officially allowing someone to have or do something.",
            "pos": "noun",
            "sent1": "The authorisations for the new project were completed ahead of schedule.",
            "sent2": "He submitted the necessary authorisations to start his own business.",
            "sent3": "The authorisations to skip homework for a day felt like a special treat.",
            "sent4": "Her authorisations to enter the exclusive club made her feel like a VIP.",
            "sent5": "The authorisations to drive the car alone were a significant milestone for him."
        },
        {
            "definition": "The power or right to give orders, make decisions, and enforce obedience.",
            "pos": "noun",
            "sent1": "The manager's authorisations allowed him to hire new employees.",
            "sent2": "She exercised her authorisations as team captain to lead the group to victory.",
            "sent3": "The authorisations to choose the movie for movie night sparked a heated debate.",
            "sent4": "His authorisations over the company's finances made him a key figure in the organization.",
            "sent5": "The authorisations to control the remote during family TV time were highly coveted."
        }
    ]
}