{
    "term": "authoritarianisms",
    "meanings": [
        {
            "definition": "The enforcement or advocacy of strict obedience to authority.",
            "pos": "noun",
            "sent1": "Some people argue that authoritarianisms are necessary for maintaining order in society.",
            "sent2": "The country's history is marked by periods of authoritarianisms.",
            "sent3": "The comedy skit humorously portrayed a world where authoritarianisms were taken to the extreme.",
            "sent4": "In the classroom, the teacher's authoritarianisms were like a heavy rain, drenching the students' spirits.",
            "sent5": "The novel vividly depicted the consequences of unchecked authoritarianisms on individual freedoms."
        },
        {
            "definition": "The characteristic of favoring or enforcing strict obedience to authority.",
            "pos": "noun",
            "sent1": "His leadership style exhibited clear signs of authoritarianisms.",
            "sent2": "The organization's culture was defined by its authoritarianisms.",
            "sent3": "The movie portrayed a dystopian society where authoritarianisms ruled every aspect of life.",
            "sent4": "In the political arena, the candidate's authoritarianisms were like a double-edged sword.",
            "sent5": "The painting captured the essence of authoritarianisms through bold, imposing figures."
        },
        {
            "definition": "The belief in or practice of strict obedience to authority.",
            "pos": "noun",
            "sent1": "Her upbringing instilled a deep respect for authoritarianisms.",
            "sent2": "The community's traditions reflected a strong adherence to authoritarianisms.",
            "sent3": "The children's game humorously exaggerated the concept of authoritarianisms.",
            "sent4": "In the business world, his authoritarianisms were like a guiding light for his team.",
            "sent5": "The play vividly showcased the clash between individual freedoms and societal authoritarianisms."
        }
    ]
}