{
    "term": "authoritativenesses",
    "meanings": [
        {
            "definition": "The quality of being authoritative or having authority.",
            "pos": "noun",
            "sent1": "Her authoritativenesses in the meeting made everyone listen to her.",
            "sent2": "The authoritativenesses of the principal was respected by all the students.",
            "sent3": "The authoritativenesses of the toddler trying to boss around the adults was quite amusing.",
            "sent4": "His authoritativenesses in the courtroom was like a lion commanding its territory.",
            "sent5": "The authoritativenesses of the queen was as striking as a bolt of lightning."
        },
        {
            "definition": "The state or condition of being authoritative.",
            "pos": "noun",
            "sent1": "The authoritativenesses of the leader was evident in every decision made.",
            "sent2": "In a democracy, the authoritativenesses of the government is derived from the people.",
            "sent3": "The authoritativenesses of the cat trying to control the dogs was quite amusing.",
            "sent4": "Her authoritativenesses in the classroom was like a beacon guiding the students.",
            "sent5": "The authoritativenesses of the judge was as clear as a crystal."
        },
        {
            "definition": "The power or right to give orders, make decisions, and enforce obedience.",
            "pos": "noun",
            "sent1": "The manager's authoritativenesses allowed him to lead the team effectively.",
            "sent2": "In a monarchy, the king's authoritativenesses are unquestioned by the subjects.",
            "sent3": "The authoritativenesses of the squirrel trying to command the birds was quite amusing.",
            "sent4": "Her authoritativenesses in the household was like a captain steering a ship.",
            "sent5": "The authoritativenesses of the CEO was as powerful as a tidal wave."
        }
    ]
}