{
    "term": "autocratical",
    "meanings": [
        {
            "definition": "Of or relating to an autocrat.",
            "pos": "adjective",
            "sent1": "The autocratical ruler made all the decisions without consulting anyone else.",
            "sent2": "Her autocratical behavior alienated her colleagues and caused tension in the office.",
            "sent3": "The autocratical cat insisted on being fed at exactly the same time every day.",
            "sent4": "The autocratical storm clouds darkened the sky, signaling an impending downpour.",
            "sent5": "The autocratical teacher demanded strict adherence to the classroom rules."
        },
        {
            "definition": "Characteristic of an autocrat.",
            "pos": "adjective",
            "sent1": "The autocratical regime suppressed any form of dissent or opposition.",
            "sent2": "His autocratical leadership style left no room for input from his team members.",
            "sent3": "The autocratical toddler insisted on having his favorite toy at all times.",
            "sent4": "The autocratical mountain dominated the landscape, casting a shadow over the valley.",
            "sent5": "The autocratical boss expected unwavering obedience from his employees."
        },
        {
            "definition": "Exercising power in an autocratic manner.",
            "pos": "adjective",
            "sent1": "The autocratical mayor made unilateral decisions without consulting the city council.",
            "sent2": "The autocratical CEO ruled the company with an iron fist, leaving no room for discussion.",
            "sent3": "The autocratical referee strictly enforced the rules of the game, much to the players' dismay.",
            "sent4": "The autocratical sun blazed down on the desert, scorching everything in its path.",
            "sent5": "The autocratical landlord imposed arbitrary rules on the tenants, causing frustration and resentment."
        }
    ]
}