{
    "term": "automatists",
    "meanings": [
        {
            "definition": "A person who believes in or practices automatism.",
            "pos": "noun",
            "sent1": "The automatists in the class loved to paint without planning ahead.",
            "sent2": "The automatists gathered to discuss their shared passion for automatic art.",
            "sent3": "The automatists decided to have a competition to see who could create the most spontaneous artwork.",
            "sent4": "Her creativity flowed like a river, making her the automatists' leader.",
            "sent5": "The automatists' paintings seemed to come to life with a mind of their own."
        },
        {
            "definition": "A group of artists who create art using automatic techniques.",
            "pos": "noun",
            "sent1": "The automatists collaborated on a mural using their unique automatic methods.",
            "sent2": "Visitors were amazed by the automatists' exhibition of automatic art.",
            "sent3": "The automatists' studio was filled with the sound of brushes moving on their own.",
            "sent4": "Their art studio felt like a magical place where automatists' dreams came true.",
            "sent5": "The automatists' creations seemed to have a soul of their own, captivating all who saw them."
        },
        {
            "definition": "The theory that certain behaviors are performed without conscious thought.",
            "pos": "noun",
            "sent1": "The automatists' theory suggested that some actions are automatic and not planned.",
            "sent2": "The psychologist studied the automatists' concept of unconscious behavior.",
            "sent3": "In a funny twist, the automatists accidentally performed their automatic dance routine at a formal event.",
            "sent4": "The automatists' idea of automatic behavior shed light on human nature.",
            "sent5": "The automatists' belief in unconscious actions challenged traditional views on decision-making."
        }
    ]
}