{
    "term": "autoeciously",
    "meanings": [
        {
            "definition": "In a manner characteristic of a parasite that completes its entire life cycle on a single host.",
            "pos": "adverb",
            "sent1": "The parasite lived autoeciously on the host, never needing to leave.",
            "sent2": "The parasite autoeciously thrived on its host, never seeking another.",
            "sent3": "The parasite was so lazy, it chose to live autoeciously on one host forever.",
            "sent4": "The relationship between the parasite and its host was autoeciously exclusive.",
            "sent5": "The parasite's autoecious lifestyle was both fascinating and concerning."
        },
        {
            "definition": "Of or relating to a plant that produces both male and female reproductive organs on the same individual.",
            "pos": "adjective",
            "sent1": "The autoecious plant had both male and female parts on each flower.",
            "sent2": "The autoecious plant was known for its unique reproductive system.",
            "sent3": "The autoecious plant confused botanists with its mixed reproductive organs.",
            "sent4": "The autoecious plant symbolized unity with its dual reproductive features.",
            "sent5": "The autoecious plant's reproductive strategy was truly remarkable."
        },
        {
            "definition": "Pertaining to an organism that is capable of self-fertilization.",
            "pos": "adjective",
            "sent1": "The autoecious organism could fertilize itself without external help.",
            "sent2": "The autoecious creature had the ability to self-fertilize.",
            "sent3": "The autoecious organism was a master of self-reproduction.",
            "sent4": "The autoecious species was like a self-sufficient fertility machine.",
            "sent5": "The autoecious organism's self-fertilization capability was truly remarkable."
        }
    ]
}