{
    "term": "automatism",
    "meanings": [
        {
            "definition": "The performance of actions without conscious thought or intention.",
            "pos": "noun",
            "sent1": "During the test, his automatism kicked in, and he solved the problem effortlessly.",
            "sent2": "Her automatism in playing the piano was evident as her fingers moved gracefully over the keys.",
            "sent3": "In a funny twist, his automatism made him automatically dance whenever he heard music.",
            "sent4": "The car moved with the smoothness of an automatism, gliding through traffic effortlessly.",
            "sent5": "The robot's movements were a perfect example of automatism, precise and mechanical."
        },
        {
            "definition": "A condition in which a person performs actions unconsciously or involuntarily.",
            "pos": "noun",
            "sent1": "She experienced automatism during the hypnotic state, following commands without awareness.",
            "sent2": "His automatism during sleepwalking led him to perform complex tasks without waking up.",
            "sent3": "The comedian joked about a fictional disorder causing automatism in people to randomly break into dance.",
            "sent4": "The city seemed to function with an eerie automatism, as if everyone was part of a synchronized routine.",
            "sent5": "The hypnotist induced automatism in the volunteer, making him cluck like a chicken without realizing."
        },
        {
            "definition": "The quality or state of being automatic.",
            "pos": "noun",
            "sent1": "The machine's flawless automatism allowed it to operate continuously without human intervention.",
            "sent2": "The athlete's movements on the field displayed a level of automatism that came from years of practice.",
            "sent3": "The toddler's insistence on doing things by himself showcased his newfound sense of automatism.",
            "sent4": "The clock's ticking echoed through the room with a comforting sense of automatism.",
            "sent5": "The factory's production line ran with impressive automatism, churning out products efficiently."
        }
    ]
}