{
    "term": "autotomic",
    "meanings": [
        {
            "definition": "Of or relating to autotomy.",
            "pos": "adjective",
            "sent1": "The autotomic behavior of the lizard allows it to escape from predators by shedding its tail.",
            "sent2": "The scientist studied the autotomic process in insects to understand their defense mechanisms.",
            "sent3": "The autotomic ability of the starfish to regenerate its limbs is truly remarkable.",
            "sent4": "Her autotomic decision to leave the toxic relationship was empowering.",
            "sent5": "The autotomic nature of the plant to self-prune dead leaves ensures its survival in harsh conditions."
        },
        {
            "definition": "Capable of autotomy.",
            "pos": "adjective",
            "sent1": "The autotomic gecko can detach its tail when threatened by a predator.",
            "sent2": "The crab is autotomic, able to sacrifice a limb to escape danger.",
            "sent3": "The autotomic spider surprised everyone by sacrificing one of its legs to break free from the web.",
            "sent4": "The autotomic ability of the lizard to detach its tail is a clever survival strategy.",
            "sent5": "The autotomic behavior of the insect to shed a leg when caught is fascinating to observe."
        },
        {
            "definition": "Involving autotomy.",
            "pos": "adjective",
            "sent1": "The autotomic response of the sea cucumber to expel its internal organs when threatened is a defense mechanism.",
            "sent2": "The autotomic behavior of the lizard in shedding its tail surprised the onlookers.",
            "sent3": "The autotomic reaction of the starfish to detach its arm when touched startled the children.",
            "sent4": "The autotomic nature of the organism to self-amputate for survival is a fascinating adaptation.",
            "sent5": "The autotomic ability of the crab to release a limb to escape danger is a remarkable evolutionary trait."
        }
    ]
}