{
    "term": "aversenesses",
    "meanings": [
        {
            "definition": "The quality or state of being averse or opposed.",
            "pos": "noun",
            "sent1": "Her aversenesses to change made it difficult for her to adapt to new situations.",
            "sent2": "His aversenesses towards spicy food meant he always ordered the mildest option on the menu.",
            "sent3": "The cat's aversenesses to taking a bath resulted in a hilarious chase around the house.",
            "sent4": "The aversenesses between the two rival teams was palpable on the field.",
            "sent5": "The aversenesses of the storm clouds warned of an impending downpour."
        },
        {
            "definition": "A feeling of strong dislike or opposition.",
            "pos": "noun",
            "sent1": "She couldn't hide her aversenesses towards the new policy during the meeting.",
            "sent2": "His aversenesses towards horror movies made it challenging to pick a film for movie night.",
            "sent3": "The toddler's aversenesses to vegetables turned dinner time into a battle of wills.",
            "sent4": "The aversenesses in the room was so thick, you could cut it with a knife.",
            "sent5": "The aversenesses in her tone made it clear she was not open to further discussion."
        },
        {
            "definition": "Reluctance or unwillingness.",
            "pos": "noun",
            "sent1": "His aversenesses to public speaking made him nervous before every presentation.",
            "sent2": "The student's aversenesses to group projects was evident in her preference for individual work.",
            "sent3": "The dog's aversenesses to going outside in the rain led to some creative indoor playtime.",
            "sent4": "The aversenesses in her eyes betrayed her true feelings about the situation.",
            "sent5": "The aversenesses in his body language indicated he was not fully on board with the plan."
        }
    ]
}