{
    "term": "awardable",
    "meanings": [
        {
            "definition": "Capable of being given as a reward or recognition.",
            "pos": "adjective",
            "sent1": "The student's hard work was awardable, so the teacher gave them a gold star.",
            "sent2": "The trophy was shiny and awardable, making it a perfect prize for the winner.",
            "sent3": "The puppy's adorable antics were so awardable that it received a treat as a reward.",
            "sent4": "Her kindness and generosity were awardable qualities that shone brightly in her character.",
            "sent5": "The breathtaking sunset painted the sky with awardable colors, deserving admiration."
        },
        {
            "definition": "Deserving of an award.",
            "pos": "adjective",
            "sent1": "His exceptional performance in the play was awardable, earning him the title of best actor.",
            "sent2": "The brave firefighter's actions were truly awardable, recognized by the entire community.",
            "sent3": "The cat's impressive ability to catch mice made it awardable of a special treat.",
            "sent4": "Her dedication and hard work were awardable, leading to her success in the competition.",
            "sent5": "The scientist's groundbreaking discovery was awardable of a prestigious prize."
        },
        {
            "definition": "Able to receive an award.",
            "pos": "adjective",
            "sent1": "The top athletes were awardable candidates for the championship trophy.",
            "sent2": "The outstanding students were awardable of scholarships for their academic achievements.",
            "sent3": "The talented artist was awardable of recognition for their beautiful paintings.",
            "sent4": "The exceptional volunteers were awardable of a special thank-you ceremony.",
            "sent5": "The dedicated employee was awardable of the Employee of the Month title."
        }
    ]
}