{
    "term": "away",
    "meanings": [
        {
            "definition": "At a distance from a particular place or person.",
            "pos": "adverb",
            "sent1": "She ran away from the scary dog.",
            "sent2": "The bird flew away from the tree.",
            "sent3": "The cookie jar was placed far away from the children's reach.",
            "sent4": "His dreams seemed to drift away like clouds in the sky.",
            "sent5": "The sound of laughter faded away into the night."
        },
        {
            "definition": "To a different place or direction.",
            "pos": "verb",
            "sent1": "Please take the trash away from the house.",
            "sent2": "The ship sailed away from the shore.",
            "sent3": "The magician made the rabbit disappear and then away he went.",
            "sent4": "Her words carried him away to a land of fantasy.",
            "sent5": "The wind whispered secrets as it blew away through the trees."
        },
        {
            "definition": "Into non-existence or a state of non-existence.",
            "pos": "adverb",
            "sent1": "The magician made the coin vanish away in an instant.",
            "sent2": "The shadows faded away as the sun rose.",
            "sent3": "The cake disappeared away before anyone could have a bite.",
            "sent4": "Her worries melted away like snow in the sun.",
            "sent5": "The music slowly faded away into silence."
        },
        {
            "definition": "In a different direction; aside.",
            "pos": "adverb",
            "sent1": "He turned away from the argument to calm down.",
            "sent2": "The river flowed away from the mountains.",
            "sent3": "The cat looked away as if uninterested in the toy.",
            "sent4": "Her thoughts drifted away from reality for a moment.",
            "sent5": "The road veered away from the city into the countryside."
        }
    ]
}