{
    "term": "awes",
    "meanings": [
        {
            "definition": "To inspire awe or admiration.",
            "pos": "verb",
            "sent1": "The majestic waterfall awes visitors with its beauty.",
            "sent2": "The grand fireworks display never fails to awe the crowd.",
            "sent3": "The tiny kitten managed to awesomely climb up the tall tree.",
            "sent4": "The brilliant performance on stage awes the audience like a shining star.",
            "sent5": "The breathtaking view from the mountaintop truly awes all who see it."
        },
        {
            "definition": "An overwhelming feeling of reverence, admiration, or fear.",
            "pos": "noun",
            "sent1": "The grandeur of the ancient castle filled her with awes.",
            "sent2": "The awes of the vast ocean left him speechless.",
            "sent3": "The little girl's eyes widened in awes as she saw the magician's trick.",
            "sent4": "The awes of the starry night sky reminded him of his small place in the universe.",
            "sent5": "The awes of the towering mountain peaks made her feel truly alive."
        },
        {
            "definition": "To fill with awe.",
            "pos": "verb",
            "sent1": "The beautiful symphony music awes the audience in the concert hall.",
            "sent2": "The stunning sunset never fails to awe those who witness it.",
            "sent3": "The unexpected kindness of a stranger can truly awe someone.",
            "sent4": "The vastness of the universe never ceases to awe scientists and philosophers alike.",
            "sent5": "The intricate details of the artwork awes viewers with its complexity."
        },
        {
            "definition": "An emotion variously combining dread, veneration, and wonder that is inspired by authority or by the sacred or sublime.",
            "pos": "noun",
            "sent1": "The awes of the ancient temple filled the travelers with a sense of reverence.",
            "sent2": "The awes of the dark forest made her heart race with a mix of fear and wonder.",
            "sent3": "The awes of the powerful storm made them seek shelter quickly.",
            "sent4": "The awes of the majestic mountain peak made him feel small yet connected to something greater.",
            "sent5": "The awes of the historic cathedral left visitors in silent contemplation."
        }
    ]
}