{
    "term": "axal",
    "meanings": [
        {
            "definition": "relating to or located near the axis",
            "pos": "adjective",
            "sent1": "The axal line runs straight through the center.",
            "sent2": "The scientist studied the axal tilt of the Earth.",
            "sent3": "The axal ruler always points to the middle of the page.",
            "sent4": "Her axal focus on the main idea helped her write a clear essay.",
            "sent5": "The axal position of the flagpole made it easy to spot from afar."
        },
        {
            "definition": "a type of joint in the human body",
            "pos": "noun",
            "sent1": "His axal was sore after playing basketball.",
            "sent2": "The doctor examined her axal for any signs of injury.",
            "sent3": "The axal in his knee made a creaking sound when he walked.",
            "sent4": "The axal between the bones allowed for smooth movement.",
            "sent5": "She felt a sharp pain in her axal when she twisted her ankle."
        },
        {
            "definition": "a type of bone in the human body",
            "pos": "noun",
            "sent1": "The axal was fractured in the accident.",
            "sent2": "The axal provides structure and support for the body.",
            "sent3": "The axal in his arm felt strong and sturdy.",
            "sent4": "The axal is connected to the wrist bone.",
            "sent5": "She felt a dull ache in her axal after lifting heavy boxes."
        },
        {
            "definition": "a type of ligament in the human body",
            "pos": "noun",
            "sent1": "The axal was stretched during the workout.",
            "sent2": "The axal connects the bones and stabilizes the joint.",
            "sent3": "The axal in her ankle felt tight after running.",
            "sent4": "The axal injury required physical therapy to heal.",
            "sent5": "She felt a twinge in her axal when she twisted her wrist."
        }
    ]
}