{
    "term": "axel",
    "meanings": [
        {
            "definition": "A jump in figure skating where the skater takes off from the forward outside edge of one skate and makes one and a half turns in the air before landing on the back outside edge of the other skate.",
            "pos": "noun",
            "sent1": "During the competition, she executed a flawless axel, impressing the judges.",
            "sent2": "The young skater practiced her axel repeatedly to perfect her technique.",
            "sent3": "The penguin attempted an axel on the ice, causing the audience to chuckle.",
            "sent4": "Her confidence soared as she nailed the axel, feeling like she could conquer anything.",
            "sent5": "The spotlight gleamed on her as she gracefully completed the axel, captivating the crowd."
        },
        {
            "definition": "A figure skating move in which the skater jumps from the front outer edge of one skate to the back outer edge of the other skate.",
            "pos": "noun",
            "sent1": "The skater's axel was the highlight of her performance, drawing cheers from the audience.",
            "sent2": "He struggled to land the axel smoothly during practice but eventually improved.",
            "sent3": "The clown attempted an axel on the ice, causing laughter among the spectators.",
            "sent4": "Her axel was like a swift transition from day to night, seamless and beautiful.",
            "sent5": "The music swirled around her as she executed the axel, creating a mesmerizing moment."
        },
        {
            "definition": "A figure skating jump with a forward takeoff and one and a half turns in the air.",
            "pos": "noun",
            "sent1": "The young skater's axel was a key element in her routine, showcasing her skill.",
            "sent2": "She practiced the axel diligently, aiming to make it the highlight of her performance.",
            "sent3": "The dog attempted an axel on the frozen pond, amusing the onlookers.",
            "sent4": "His axel was like a whirlwind of motion, leaving the audience in awe.",
            "sent5": "The crowd gasped as she flawlessly executed the axel, leaving a lasting impression."
        }
    ]
}