{
    "term": "axiom",
    "meanings": [
        {
            "definition": "A statement or proposition that is regarded as being established, accepted, or self-evidently true.",
            "pos": "noun",
            "sent1": "In math class, the teacher explained the axiom that states 1 + 1 equals 2.",
            "sent2": "Scientists often rely on axioms to build their theories on solid foundations.",
            "sent3": "The axiom that 'all cats love fish' made the kitten's attempt to eat a banana quite amusing.",
            "sent4": "Her smile was like an axiom of happiness, brightening everyone's day.",
            "sent5": "The axiom 'practice makes perfect' is a simple yet powerful reminder to keep trying."
        },
        {
            "definition": "A self-evident truth that requires no proof.",
            "pos": "noun",
            "sent1": "The axiom that honesty is the best policy is a common saying.",
            "sent2": "Some axioms, like 'the early bird catches the worm,' are based on common sense.",
            "sent3": "It was amusing to see him try to prove the axiom that 'water is wet.'",
            "sent4": "Her kindness was an axiom in a world full of uncertainties.",
            "sent5": "The axiom 'actions speak louder than words' is a reminder to be mindful of our behavior."
        },
        {
            "definition": "A universally accepted principle or rule.",
            "pos": "noun",
            "sent1": "The axiom of 'treat others as you want to be treated' is a golden rule.",
            "sent2": "In many cultures, the axiom of 'respect your elders' is deeply ingrained.",
            "sent3": "It was amusing to see the axiom of 'gravity always pulls things down' demonstrated with a balloon.",
            "sent4": "Her determination to succeed was an axiom that inspired those around her.",
            "sent5": "The axiom 'look before you leap' is a wise cautionary principle to follow."
        }
    ]
}