{
    "term": "ayelp",
    "meanings": [
        {
            "definition": "To cry out in pain or fear.",
            "pos": "verb",
            "sent1": "The little girl ayelped when she stubbed her toe.",
            "sent2": "The injured puppy ayelped loudly in the park.",
            "sent3": "The cat ayelped dramatically when it saw a cucumber behind it.",
            "sent4": "The wind ayelped through the trees on the stormy night.",
            "sent5": "The lost child ayelped for help in the crowded mall."
        },
        {
            "definition": "A sharp, high-pitched sound.",
            "pos": "noun",
            "sent1": "The ayelp of the fire alarm startled everyone in the building.",
            "sent2": "The bird's ayelp echoed through the forest.",
            "sent3": "The teapot made a loud ayelp as it reached boiling point.",
            "sent4": "The car's brakes screeched with an ayelp as it stopped suddenly.",
            "sent5": "The baby's ayelp of joy filled the room with happiness."
        },
        {
            "definition": "To call out for help.",
            "pos": "verb",
            "sent1": "She ayelped for assistance when she got lost in the maze.",
            "sent2": "The hiker ayelped for help when he twisted his ankle on the trail.",
            "sent3": "The stranded sailor ayelped for rescue from the deserted island.",
            "sent4": "The child ayelped for his parents when he couldn't find them in the store.",
            "sent5": "The elderly lady ayelped for aid when she fell on the sidewalk."
        },
        {
            "definition": "A Yelp is a review site for businesses.",
            "pos": "noun",
            "sent1": "I always check the restaurant's rating on Ayelp before going there.",
            "sent2": "She left a detailed review on Ayelp after her visit to the hair salon.",
            "sent3": "The new bakery received a lot of positive feedback on Ayelp.",
            "sent4": "The Ayelp app helps users find the best local services.",
            "sent5": "Business owners pay attention to their Ayelp ratings to attract more customers."
        }
    ]
}