{
    "term": "azoturia",
    "meanings": [
        {
            "definition": "A condition in which excessive amounts of nitrogenous compounds, such as urea, are found in the urine.",
            "pos": "noun",
            "sent1": "The vet diagnosed the horse with azoturia after finding high levels of nitrogen in its urine.",
            "sent2": "The doctor explained that azoturia is a medical condition where the urine contains too much nitrogen.",
            "sent3": "The farmer chuckled when he heard about azoturia in his cow, joking that it must be eating too much protein.",
            "sent4": "The scientist used azoturia as an example of how imbalances in the body can lead to health issues.",
            "sent5": "The classroom demonstration on azoturia made the concept easy to understand for the students."
        },
        {
            "definition": "The presence of abnormally high levels of nitrogen in the blood.",
            "pos": "noun",
            "sent1": "The doctor was concerned about the patient's azoturia, indicating a potential issue with nitrogen levels in the blood.",
            "sent2": "Azoturia can be detected through blood tests that show elevated nitrogen levels.",
            "sent3": "The nurse made a funny comment about azoturia, saying it sounded like a superhero with nitrogen powers.",
            "sent4": "The athlete described the feeling of azoturia in his blood as if he had too much fuel for his body.",
            "sent5": "The textbook illustration of azoturia in the blood made it clear how nitrogen levels can impact health."
        },
        {
            "definition": "A disorder characterized by the excretion of abnormally high levels of nitrogen in the urine.",
            "pos": "noun",
            "sent1": "The patient's azoturia was a sign of the body struggling to eliminate excess nitrogen through urine.",
            "sent2": "Azoturia is a condition where the body has difficulty getting rid of excessive nitrogen in the urine.",
            "sent3": "The comedian joked about azoturia, saying it sounded like a fancy term for peeing out too much nitrogen.",
            "sent4": "The teacher used azoturia as a metaphor for how some people hold onto things they should let go of.",
            "sent5": "The vivid description of azoturia in the medical journal helped doctors recognize the disorder more easily."
        }
    ]
}