{
    "term": "babool",
    "meanings": [
        {
            "definition": "A type of tree commonly found in India and Africa.",
            "pos": "noun",
            "sent1": "The babool provides shade in the hot Indian sun.",
            "sent2": "I saw a beautiful babool tree in the African savanna.",
            "sent3": "The babool tree waved its branches in the gentle breeze.",
            "sent4": "The babool stood tall like a guardian of the forest.",
            "sent5": "Under the babool's canopy, we found respite from the scorching heat."
        },
        {
            "definition": "The wood of the babool tree, used for various purposes.",
            "pos": "noun",
            "sent1": "Craftsmen carved intricate designs from babool wood.",
            "sent2": "The table was made of sturdy babool wood.",
            "sent3": "The babool wood had a pleasant, earthy scent.",
            "sent4": "The babool wood gleamed in the sunlight like polished gold.",
            "sent5": "The babool wood was as strong as an elephant's tusks."
        },
        {
            "definition": "The gum produced by the babool tree, used in traditional medicine.",
            "pos": "noun",
            "sent1": "The babool gum was known for its healing properties.",
            "sent2": "The herbalist used babool gum in his remedies.",
            "sent3": "Chewing babool gum made her feel like a medicine woman.",
            "sent4": "The babool gum soothed his sore throat like magic.",
            "sent5": "The scent of babool gum filled the room with a comforting aroma."
        },
        {
            "definition": "A thorny shrub or tree with small yellow flowers.",
            "pos": "noun",
            "sent1": "Watch out for the sharp thorns on the babool shrub.",
            "sent2": "The babool tree bloomed with tiny yellow flowers.",
            "sent3": "The babool's thorns seemed to protect it like armor.",
            "sent4": "Among the greenery, the babool's yellow flowers shone like stars.",
            "sent5": "The babool's thorny branches twisted and turned in a wild dance."
        }
    ]
}