{
    "term": "babools",
    "meanings": [
        {
            "definition": "Babools (noun): a type of tree native to India and Pakistan",
            "pos": "noun",
            "sent1": "The babools provided shade for the villagers during the hot summer days.",
            "sent2": "The babools in the forest rustled gently in the breeze.",
            "sent3": "The mischievous monkeys loved to swing from the babools, much to the amusement of the onlookers.",
            "sent4": "The babools stood tall like ancient guardians of the land.",
            "sent5": "Under the babools, the children played hide and seek, their laughter echoing through the branches."
        },
        {
            "definition": "Babools (verb): to engage in playful or silly behavior",
            "pos": "verb",
            "sent1": "The children would babools around the playground, laughing and chasing each other.",
            "sent2": "During recess, the students would babools and have a great time together.",
            "sent3": "The puppy seemed to babools with joy as it ran in circles around its owner.",
            "sent4": "The comedian loved to babools on stage, making the audience burst into laughter.",
            "sent5": "In the park, the friends would babools by playing pranks on each other, creating unforgettable memories."
        },
        {
            "definition": "Babools (adjective): characterized by a carefree and lighthearted attitude",
            "pos": "adjective",
            "sent1": "Her babools nature made everyone around her feel happy and relaxed.",
            "sent2": "The babools picnic was filled with laughter, games, and joy.",
            "sent3": "Despite the rain, they maintained a babools spirit and danced in the puddles.",
            "sent4": "The babools laughter of the children echoed through the meadow.",
            "sent5": "The babools attitude of the group lifted everyone's mood and made the day unforgettable."
        }
    ]
}