{
    "term": "babydolls",
    "meanings": [
        {
            "definition": "A type of women's nightwear consisting of a short dress with thin shoulder straps and a loose, flowing skirt.",
            "pos": "noun",
            "sent1": "She wore a comfortable babydolls to bed every night.",
            "sent2": "The store had a lovely collection of babydolls for sale.",
            "sent3": "At the slumber party, everyone showed up in babydolls for fun.",
            "sent4": "The babydolls danced gracefully in the breeze on the clothesline.",
            "sent5": "The silky babydolls shimmered under the moonlight.",
            "sent6": "In the store, the babydolls were displayed in various colors.",
            "sent7": "The babydolls were neatly folded in the drawer.",
            "sent8": "She giggled as she twirled in her favorite babydolls.",
            "sent9": "The babydolls swayed gently as she walked around the room.",
            "sent10": "The babydolls felt soft against her skin."
        },
        {
            "definition": "A small, lifelike doll designed to resemble a baby.",
            "pos": "noun",
            "sent1": "The babydolls in the toy store looked so realistic.",
            "sent2": "She collected vintage babydolls from different eras.",
            "sent3": "The babydolls seemed to have a secret conversation on the shelf.",
            "sent4": "Her room was filled with babydolls of all sizes and colors.",
            "sent5": "The babydolls' eyes seemed to follow you around the room.",
            "sent6": "She carefully arranged the babydolls on the shelf.",
            "sent7": "The babydolls were passed down from generation to generation.",
            "sent8": "The babydolls were dressed in tiny, adorable outfits.",
            "sent9": "She hugged the babydolls tightly before going to sleep.",
            "sent10": "The babydolls were displayed in a glass cabinet for everyone to admire."
        }
    ]
}