{
    "term": "baby",
    "meanings": [
        {
            "definition": "A very young child",
            "pos": "noun",
            "sent1": "The baby giggled happily in the crib.",
            "sent2": "My sister is taking care of her baby.",
            "sent3": "The baby tried to eat the toy car, thinking it was food.",
            "sent4": "The baby of the family, always needing attention.",
            "sent5": "The baby's chubby cheeks were irresistible to everyone."
        },
        {
            "definition": "An affectionate or endearing term for someone",
            "pos": "noun",
            "sent1": "Come here, baby, let me give you a hug.",
            "sent2": "She called her best friend 'baby' as a sign of love.",
            "sent3": "The cat meowed at its owner, demanding treats like a baby.",
            "sent4": "The old man was a baby when it came to technology.",
            "sent5": "The puppy's eyes were full of love as it looked at its owner, its baby."
        },
        {
            "definition": "A small or miniature version of something",
            "pos": "noun",
            "sent1": "The toy car was a baby compared to the real one.",
            "sent2": "She carried a baby version of her favorite book in her bag.",
            "sent3": "The baby tree in the garden was just a sapling.",
            "sent4": "The baby elephant was still learning to use its trunk.",
            "sent5": "The baby cupcake was too cute to eat."
        },
        {
            "definition": "A term of endearment for a romantic partner",
            "pos": "noun",
            "sent1": "I love you, baby, more than anything in the world.",
            "sent2": "He whispered sweet nothings to his baby under the moonlight.",
            "sent3": "The baby of my dreams, always by my side.",
            "sent4": "She was his baby, his one true love.",
            "sent5": "The stars shone brightly above them, reflecting in the eyes of his baby."
        }
    ]
}