{
    "term": "backfires",
    "meanings": [
        {
            "definition": "A miscalculation or error that has an unexpected negative effect.",
            "pos": "noun",
            "sent1": "The plan to skip breakfast turned into a backfires when I felt dizzy before lunch.",
            "sent2": "The team's decision to change the lineup backfires and they lost the game.",
            "sent3": "His attempt to fix the leaky faucet backfires when he accidentally breaks the pipe.",
            "sent4": "The shortcut through the park backfires as they encounter a swarm of bees.",
            "sent5": "The decision to invest all his savings in one stock backfires when the company goes bankrupt."
        },
        {
            "definition": "A loud noise caused by the premature ignition of fuel in the engine of a motor vehicle.",
            "pos": "noun",
            "sent1": "The mechanic knew the engine was in trouble when he heard a loud backfires.",
            "sent2": "The old car often backfires when starting up in the cold weather.",
            "sent3": "The backfires from the motorcycle startled the nearby birds.",
            "sent4": "The sudden backfires from the truck made the pedestrians jump in surprise.",
            "sent5": "The backfires from the vintage car echoed through the quiet street."
        },
        {
            "definition": "To have the opposite effect of what was intended.",
            "pos": "verb",
            "sent1": "His attempt to impress her with a joke backfires and she ends up laughing at him.",
            "sent2": "The prank backfires when his friends turn the tables and scare him instead.",
            "sent3": "Trying to surprise her with a gift backfires as she had already bought the same thing.",
            "sent4": "The plan to stay up late backfires when he falls asleep during the movie.",
            "sent5": "The attempt to speed up the process backfires and causes more delays."
        }
    ]
}