{
    "term": "backup",
    "meanings": [
        {
            "definition": "A reserve or substitute",
            "pos": "noun",
            "sent1": "I always keep a backup flashlight in case the power goes out.",
            "sent2": "Having a backup plan is essential for emergencies.",
            "sent3": "My backup snack turned out to be everyone's favorite at the party.",
            "sent4": "She was the backup singer, but her voice shone brighter than the lead.",
            "sent5": "The backup generator kicked in just in time to save the day."
        },
        {
            "definition": "Support or help",
            "pos": "verb",
            "sent1": "I will backup my friend in the upcoming debate.",
            "sent2": "It's important to backup your teammates during tough times.",
            "sent3": "The puppy tried to backup the kitten when it got scared of the vacuum.",
            "sent4": "Her encouraging words were like a backup for my confidence.",
            "sent5": "The teacher always backuped the students when they needed extra guidance."
        },
        {
            "definition": "To make a copy of data for safekeeping",
            "pos": "verb",
            "sent1": "Remember to backup your important files regularly.",
            "sent2": "I will backup my photos to the cloud to ensure they are safe.",
            "sent3": "He decided to backup his work after losing a document last time.",
            "sent4": "She backuped the document just in time before the computer crashed.",
            "sent5": "The IT specialist showed me how to backup my data securely."
        },
        {
            "definition": "To provide assistance or reinforcement",
            "pos": "verb",
            "sent1": "I will backup my friend in the soccer match tomorrow.",
            "sent2": "The team captain always backuped his players during tough games.",
            "sent3": "The superhero backuped the police in catching the thief.",
            "sent4": "Her kind words backuped my decision to pursue my dream.",
            "sent5": "The mentor backuped the mentee throughout the learning process."
        }
    ]
}