{
    "term": "backboards",
    "meanings": [
        {
            "definition": "A board placed at the back of something for support or protection.",
            "pos": "noun",
            "sent1": "The shelf had a sturdy backboards to keep the books from falling.",
            "sent2": "The fence was reinforced with backboards to prevent it from collapsing.",
            "sent3": "The little squirrel thought the backboards of the treehouse were like a cozy bed.",
            "sent4": "Her determination was the backboards that held her dreams high.",
            "sent5": "The knight's shield was as strong as backboards, protecting him from harm."
        },
        {
            "definition": "A board used in basketball to shoot the ball into the hoop.",
            "pos": "noun",
            "sent1": "The basketball player aimed the ball towards the backboards for a perfect shot.",
            "sent2": "The sound of the ball bouncing off the backboards echoed in the gym.",
            "sent3": "The mischievous cat tried to climb the backboards during the game.",
            "sent4": "Her words hit him like a basketball against the backboards, leaving him stunned.",
            "sent5": "The backboards stood tall, witnessing countless victories and defeats on the court."
        },
        {
            "definition": "A board used in emergency medical situations to transport injured individuals.",
            "pos": "noun",
            "sent1": "The paramedics swiftly loaded the injured man onto the backboards for transport.",
            "sent2": "The ambulance was always equipped with backboards for emergencies.",
            "sent3": "The clumsy EMT accidentally tripped over the backboards, causing a moment of chaos.",
            "sent4": "In times of crisis, the backboards became the bridge between danger and safety.",
            "sent5": "The backboards carried the weight of lives, moving swiftly towards help and hope."
        }
    ]
}