{
    "term": "backside",
    "meanings": [
        {
            "definition": "The rear surface of the human body from the shoulders to the hips.",
            "pos": "noun",
            "sent1": "She landed on her backside after slipping on the ice.",
            "sent2": "He sat on the backside of the bench to rest.",
            "sent3": "The backside of the chair looked like a frowning face.",
            "sent4": "The moon's backside is always hidden from view.",
            "sent5": "The backside of the house had a beautiful garden."
        },
        {
            "definition": "The part of a piece of clothing that covers the buttocks.",
            "pos": "noun",
            "sent1": "Her skirt was too short, revealing her backside.",
            "sent2": "The backside of his pants had a small tear.",
            "sent3": "The backside of the dress had a cute bow detail.",
            "sent4": "The backside of the jeans had a logo stitched on.",
            "sent5": "The backside of the swimsuit was a vibrant color."
        },
        {
            "definition": "The reverse side or surface of an object.",
            "pos": "noun",
            "sent1": "He turned the photo frame to see the backside.",
            "sent2": "The backside of the painting was signed by the artist.",
            "sent3": "The backside of the book had a surprise illustration.",
            "sent4": "The backside of the coin had a different design.",
            "sent5": "The backside of the card was blank."
        },
        {
            "definition": "The part of a chair or seat that supports the lower back.",
            "pos": "noun",
            "sent1": "The ergonomic chair had great support for the backside.",
            "sent2": "He adjusted the backside of the seat for more comfort.",
            "sent3": "The backside of the sofa had a hidden compartment.",
            "sent4": "The backside of the stool was cushioned for extra comfort.",
            "sent5": "The backside of the office chair had a mesh design for breathability."
        }
    ]
}