{
    "term": "backbreaking",
    "meanings": [
        {
            "definition": "Extremely difficult or physically demanding",
            "pos": "adjective",
            "sent1": "The backbreaking task of carrying heavy boxes up the stairs left him exhausted.",
            "sent2": "Her backbreaking job required her to lift heavy bags all day long.",
            "sent3": "The backbreaking challenge of untangling Christmas lights made him wish for simpler decorations.",
            "sent4": "The backbreaking effort to solve the puzzle felt like trying to move a mountain.",
            "sent5": "The backbreaking work of shoveling snow made his muscles ache for days."
        },
        {
            "definition": "Causing great strain or effort",
            "pos": "adjective",
            "sent1": "The backbreaking decision between two equally good options kept her up at night.",
            "sent2": "His backbreaking schedule made it hard for him to find time for relaxation.",
            "sent3": "The backbreaking task of choosing a movie to watch led to hours of scrolling through options.",
            "sent4": "The backbreaking responsibility of being the team captain weighed heavily on her shoulders.",
            "sent5": "The backbreaking effort to finish the project on time felt like a race against the clock."
        },
        {
            "definition": "Requiring a lot of physical labor",
            "pos": "adjective",
            "sent1": "The backbreaking work of digging ditches under the hot sun was exhausting.",
            "sent2": "Their backbreaking journey through the mountains tested their endurance.",
            "sent3": "The backbreaking task of building a sandcastle turned into a fun competition.",
            "sent4": "The backbreaking effort to plant a garden resulted in a beautiful array of flowers.",
            "sent5": "The backbreaking job of painting the house left them covered in colorful splatters."
        }
    ]
}