{
    "term": "backs",
    "meanings": [
        {
            "definition": "The rear surface of the human body from the shoulders to the hips.",
            "pos": "noun",
            "sent1": "She leaned against the wall with her hands on her backs.",
            "sent2": "The backpack was heavy on his backs as he hiked up the hill.",
            "sent3": "The chair's backs seemed to be whispering secrets to each other.",
            "sent4": "The moonlight cast shadows on the backs of the trees, creating a mystical scene.",
            "sent5": "The sunburn on his backs reminded him of the long day at the beach."
        },
        {
            "definition": "The side or part of something that is opposite the front.",
            "pos": "noun",
            "sent1": "The bookshelf had a mirror on its backs to reflect the room.",
            "sent2": "The car's engine is located under the hood at the backs.",
            "sent3": "The cake was decorated with colorful frosting on its backs.",
            "sent4": "The detective found a hidden compartment at the backs of the drawer.",
            "sent5": "The map showed the treasure buried deep in the backs of the island."
        },
        {
            "definition": "To support or assist someone or something.",
            "pos": "verb",
            "sent1": "She always backs her friends in times of need.",
            "sent2": "The team backed each other up during the intense match.",
            "sent3": "The teacher backed the student's idea with enthusiasm.",
            "sent4": "The community backed the charity event with generous donations.",
            "sent5": "His family always backs him in pursuing his dreams."
        },
        {
            "definition": "To move in a backward direction.",
            "pos": "verb",
            "sent1": "He backs away slowly from the growling dog.",
            "sent2": "The car backs up to make space for the delivery truck.",
            "sent3": "The cat backs into the corner when scared.",
            "sent4": "The hiker backs off the steep cliff cautiously.",
            "sent5": "The dancer gracefully backs across the stage during the performance."
        },
        {
            "definition": "To bet on the outcome of an event.",
            "pos": "verb",
            "sent1": "He backs his favorite team to win the championship.",
            "sent2": "She backs the horse with the best odds to place first.",
            "sent3": "The friends back their predictions with a friendly wager.",
            "sent4": "The gambler backs the roulette number with confidence.",
            "sent5": "The crowd eagerly backs their chosen contestant in the competition."
        }
    ]
}