{
    "term": "backing",
    "meanings": [
        {
            "definition": "Support or help given to someone or something",
            "pos": "noun",
            "sent1": "The team had strong backing from their fans during the championship.",
            "sent2": "She asked for backing from her friends when starting her new business.",
            "sent3": "The puppy sought backing from its owner to reach the ball.",
            "sent4": "The tree's roots provided solid backing for the swing to hang from.",
            "sent5": "The teacher's backing motivated the students to excel in their studies."
        },
        {
            "definition": "Financial support or resources",
            "pos": "noun",
            "sent1": "The company received significant backing from investors for their project.",
            "sent2": "They needed backing to expand their business into new markets.",
            "sent3": "The piggy bank offered its backing for the children's ice cream fund.",
            "sent4": "The treasure chest held the pirate's valuable backing for future adventures.",
            "sent5": "The scholarship provided crucial backing for her college education."
        },
        {
            "definition": "Material used to support or strengthen something",
            "pos": "noun",
            "sent1": "The carpenter used sturdy backing to reinforce the bookshelf.",
            "sent2": "The wall painting required a smooth backing for proper display.",
            "sent3": "The superhero's cape served as a stylish backing for his costume.",
            "sent4": "The shield provided protective backing during the battle.",
            "sent5": "The cushion acted as a comfortable backing for the chair."
        },
        {
            "definition": "The act of moving backwards",
            "pos": "noun",
            "sent1": "The car's sudden backing surprised the pedestrians on the street.",
            "sent2": "The ship's backing into the harbor was skillfully executed by the captain.",
            "sent3": "The robot's backing up feature prevented it from bumping into obstacles.",
            "sent4": "The dancer's graceful backing added a unique element to the performance.",
            "sent5": "The athlete's quick backing helped them avoid a collision on the field."
        }
    ]
}