{
    "term": "baffy",
    "meanings": [
        {
            "definition": "A golf club with a wooden head and a steeply sloping face, used for hitting the ball out of a sand trap.",
            "pos": "noun",
            "sent1": "He swung the baffy and sent the ball flying out of the sand trap.",
            "sent2": "The golfer carefully selected the baffy from his bag for the tricky shot.",
            "sent3": "The baffy looked like a magic wand as it effortlessly lifted the ball from the sand.",
            "sent4": "With the baffy in hand, he felt like a wizard conjuring the ball to safety.",
            "sent5": "The baffy's angled face expertly rescued his game from the sandy predicament."
        },
        {
            "definition": "To confuse or perplex.",
            "pos": "verb",
            "sent1": "The complex instructions began to baffy him as he tried to follow along.",
            "sent2": "Her unexpected question seemed to baffy everyone in the room.",
            "sent3": "The riddle was designed to baffy even the cleverest minds.",
            "sent4": "The twists in the plot of the movie baffy the audience until the very end.",
            "sent5": "The magician's tricks never failed to baffy the young children in the audience."
        },
        {
            "definition": "A baffy person is someone who is easily confused or bewildered.",
            "pos": "noun",
            "sent1": "She's a real baffy when it comes to technology; always needing help with simple tasks.",
            "sent2": "The old man was known in the village as the local baffy, often getting lost on familiar paths.",
            "sent3": "The baffy character in the story provided comic relief with their constant mix-ups.",
            "sent4": "Among the group of friends, he was affectionately called 'the baffy' for his forgetfulness.",
            "sent5": "The village children found joy in playing pranks on the baffy old farmer."
        }
    ]
}