{
    "term": "bag",
    "meanings": [
        {
            "definition": "A flexible container with an opening at the top, used for carrying things.",
            "pos": "noun",
            "sent1": "I packed my lunch in a bag for school.",
            "sent2": "She carried her books in a bag to the library.",
            "sent3": "The bag swung back and forth as the child skipped along.",
            "sent4": "His laughter was a bag of joy that filled the room.",
            "sent5": "The bag bulged with treasures from the beach."
        },
        {
            "definition": "A woman's handbag or purse.",
            "pos": "noun",
            "sent1": "She kept her lipstick in her bag at all times.",
            "sent2": "The designer bag matched her outfit perfectly.",
            "sent3": "Her bag seemed to hold an endless supply of tissues.",
            "sent4": "Her bag was a bottomless pit of surprises.",
            "sent5": "The bag dangled elegantly from her arm."
        },
        {
            "definition": "A piece of luggage.",
            "pos": "noun",
            "sent1": "The traveler struggled to lift the heavy bag onto the conveyor belt.",
            "sent2": "The bag was filled with clothes for the weekend trip.",
            "sent3": "The bag rolled away from the tired traveler at the airport.",
            "sent4": "His bag was a symbol of his journey through life.",
            "sent5": "The bag bore the marks of many adventures."
        },
        {
            "definition": "A quantity of game taken in a single hunting trip.",
            "pos": "noun",
            "sent1": "The hunter proudly displayed his bag of pheasants.",
            "sent2": "The bag of rabbits was a testament to his skill as a hunter.",
            "sent3": "The bag of ducks quacked softly in the back of the truck.",
            "sent4": "His bag of trophies told the story of his hunting prowess.",
            "sent5": "The bag of game was a trophy of his successful hunt."
        },
        {
            "definition": "To put something in a bag.",
            "pos": "verb",
            "sent1": "I will bag the groceries for you at the store.",
            "sent2": "She decided to bag the apples before they spoiled.",
            "sent3": "He tried to bag the elusive butterfly in the garden.",
            "sent4": "The team hoped to bag a victory in the championship game.",
            "sent5": "She managed to bag a great deal on the sale items."
        }
    ]
}