{
    "term": "bags",
    "meanings": [
        {
            "definition": "A flexible container with an opening at the top, used for carrying things.",
            "pos": "noun",
            "sent1": "I packed my lunch in a brown paper bags.",
            "sent2": "She carried her books in a backpack.",
            "sent3": "The bags in the store were all colorful and shiny.",
            "sent4": "His mind was a bag of thoughts, jumbled and mixed up.",
            "sent5": "The bags of groceries were heavy but she managed to bring them home."
        },
        {
            "definition": "A woman's handbag or purse.",
            "pos": "noun",
            "sent1": "She always carries her wallet in her bags.",
            "sent2": "The designer bags in the store were very expensive.",
            "sent3": "Her bags matched perfectly with her outfit.",
            "sent4": "Her bags were like a treasure chest, holding all her essentials.",
            "sent5": "The bags she owned were all stylish and elegant."
        },
        {
            "definition": "A loose fold of skin, typically beneath the eyes.",
            "pos": "noun",
            "sent1": "He looked tired, with heavy bags under his eyes.",
            "sent2": "The lack of sleep caused dark bags to form under her eyes.",
            "sent3": "The bags under his eyes made him look like a panda.",
            "sent4": "The bags under her eyes were a sign of long hours of work.",
            "sent5": "The bags under her eyes were a reminder of her restless nights."
        },
        {
            "definition": "To put something in a bag.",
            "pos": "verb",
            "sent1": "I bags the groceries at the store.",
            "sent2": "She bags the items quickly to save time.",
            "sent3": "He bags the toys neatly in the box.",
            "sent4": "She bags her memories carefully in her heart.",
            "sent5": "The chef bags the ingredients before starting to cook."
        },
        {
            "definition": "To reserve or secure something for oneself.",
            "pos": "verb",
            "sent1": "I bags the last piece of cake for myself.",
            "sent2": "She bags the best seat in the house every time.",
            "sent3": "He bags the opportunity to travel around the world.",
            "sent4": "She bags the chance to meet her favorite singer.",
            "sent5": "The team bags the championship trophy after a tough season."
        }
    ]
}