{
    "term": "bailable",
    "meanings": [
        {
            "definition": "Adjective: capable of being released on bail",
            "pos": "adjective",
            "sent1": "The judge considered the crime to be bailable and allowed the defendant to be released with bail.",
            "sent2": "In the legal system, certain offenses are deemed bailable, while others require further investigation.",
            "sent3": "The idea of a bailable offense seemed strange to the young child, who thought all crimes led to jail time.",
            "sent4": "Being bailable in court can sometimes feel like having a safety net in uncertain situations.",
            "sent5": "Understanding what makes a crime bailable is crucial for those studying law enforcement."
        },
        {
            "definition": "Adverb: in a manner that allows for release on bail",
            "pos": "adverb",
            "sent1": "The suspect was held bailable until the hearing, ensuring they would appear in court.",
            "sent2": "The lawyer argued that the accused should be treated bailable until proven guilty.",
            "sent3": "The detective comically tripped over his words, trying to explain the concept of bailable to the confused witness.",
            "sent4": "The news spread bailable through the small town, causing a mix of concern and relief.",
            "sent5": "The music played softly, creating a bailable atmosphere in the courtroom."
        },
        {
            "definition": "Verb: to grant release on bail",
            "pos": "verb",
            "sent1": "The judge decided to bailable the defendant, allowing them to await trial outside of jail.",
            "sent2": "It is the court's responsibility to bailable individuals fairly and justly.",
            "sent3": "The attorney skillfully bailable their client, ensuring they could prepare for the upcoming trial.",
            "sent4": "The decision to bailable the suspect was met with mixed reactions from the public.",
            "sent5": "The judge's choice to bailable the accused highlighted the importance of understanding legal procedures."
        }
    ]
}