{
    "term": "bal",
    "meanings": [
        {
            "definition": "A large bag or sack, typically made of strong material.",
            "pos": "noun",
            "sent1": "I carried my books in a bal to school.",
            "sent2": "The farmer filled the bal with freshly harvested wheat.",
            "sent3": "The mischievous kitten jumped into the bal and got stuck.",
            "sent4": "Her laughter burst out like a balloon popping in a bal.",
            "sent5": "The bal bulged with all the toys he had won at the fair."
        },
        {
            "definition": "A dance or social gathering featuring ballroom dancing.",
            "pos": "noun",
            "sent1": "The elegant couple twirled around the balroom gracefully.",
            "sent2": "She practiced her steps for the upcoming bal.",
            "sent3": "The mice in the attic held a tiny bal in the moonlight.",
            "sent4": "The stars in the sky moved in perfect harmony, like dancers in a bal.",
            "sent5": "The music at the bal swept her off her feet and into the arms of her partner."
        },
        {
            "definition": "A rounded object used in various sports and games.",
            "pos": "noun",
            "sent1": "The children played catch with a red rubber bal.",
            "sent2": "The soccer player kicked the bal into the goal.",
            "sent3": "The mischievous squirrel stole the golfer's bal and ran up a tree.",
            "sent4": "The sun set behind the hills, turning the sky into a giant orange bal.",
            "sent5": "The shiny bal bounced down the stairs, causing a loud noise."
        },
        {
            "definition": "A unit of measurement for the amount of energy released by an explosion.",
            "pos": "noun",
            "sent1": "The scientists measured the power of the explosion in units of bal.",
            "sent2": "The fireworks display was so bright and loud, it must have been a huge bal.",
            "sent3": "The balloon filled with helium popped with a small bal.",
            "sent4": "The thunder rumbled like a distant bal echoing through the valley.",
            "sent5": "The volcano erupted with such force that it registered off the charts on the bal scale."
        }
    ]
}