{
    "term": "baldricks",
    "meanings": [
        {
            "definition": "A belt worn over one shoulder and across the chest to support a sword or bugle.",
            "pos": "noun",
            "sent1": "The soldier proudly wore his baldricks during the parade.",
            "sent2": "She carefully adjusted the baldricks to ensure the sword was secure.",
            "sent3": "The knight's baldricks seemed to have a mind of their own, slipping off at the most inconvenient times.",
            "sent4": "His baldricks were like loyal companions, always ready to hold his sword in battle.",
            "sent5": "The shiny baldricks gleamed in the sunlight, a symbol of his readiness for duty."
        },
        {
            "definition": "A belt worn over one shoulder and used for carrying a sword or bugle.",
            "pos": "noun",
            "sent1": "The baldricks were essential for the knight to carry his sword.",
            "sent2": "She admired the intricate design of the baldricks holding the bugle.",
            "sent3": "The baldricks seemed to whisper tales of past battles as they swung with each step.",
            "sent4": "His baldricks were like a trusty steed, always by his side in times of need.",
            "sent5": "The weight of the baldricks reminded him of the responsibility that came with wielding a sword."
        },
        {
            "definition": "A belt worn over one shoulder and across the chest to support a sword or bugle.",
            "pos": "noun",
            "sent1": "The baldricks were beautifully crafted, a testament to the blacksmith's skill.",
            "sent2": "He felt a sense of pride whenever he fastened the baldricks around his chest.",
            "sent3": "The baldricks played a game of hide-and-seek, slipping off just when he needed them most.",
            "sent4": "In battle, the baldricks became his shield, holding his sword steady against the enemy.",
            "sent5": "The sound of the bugle echoed through the valley, carried by the sturdy baldricks."
        }
    ]
}