{
    "term": "ballcocks",
    "meanings": [
        {
            "definition": "A mechanism in a toilet tank that regulates the flow of water into the tank.",
            "pos": "noun",
            "sent1": "The plumber fixed the ballcocks to ensure the toilet tank filled properly.",
            "sent2": "The old ballcocks in the toilet needed replacement to stop the water from overflowing.",
            "sent3": "When the ballcocks in the toilet malfunctioned, it created a funny gurgling sound.",
            "sent4": "The ballcocks in the tank were like gatekeepers controlling the water's entrance.",
            "sent5": "The ballcocks, like diligent guards, maintained the water level in the toilet tank."
        },
        {
            "definition": "A type of valve used in plumbing to control the flow of liquid.",
            "pos": "noun",
            "sent1": "The plumber installed the ballcocks to regulate the water flow in the pipes.",
            "sent2": "Make sure to check the ballcocks regularly to prevent any leaks in the plumbing system.",
            "sent3": "The ballcocks in the pipes danced as they controlled the liquid's movement.",
            "sent4": "The ballcocks acted as traffic lights, directing the flow of water in the plumbing.",
            "sent5": "The shiny ballcocks gleamed as they managed the liquid's path in the pipes."
        },
        {
            "definition": "A component of a toilet that helps maintain the water level in the tank.",
            "pos": "noun",
            "sent1": "The ballcocks in the toilet kept the water level steady for efficient flushing.",
            "sent2": "Replacing the ballcocks in the toilet improved the water-saving capabilities.",
            "sent3": "The mischievous cat played with the ballcocks, causing the water level to fluctuate.",
            "sent4": "The ballcocks were like loyal guardians, ensuring the tank always had enough water.",
            "sent5": "The ballcocks hummed softly, silently working to maintain the toilet's water level."
        }
    ]
}