{
    "term": "ballade",
    "meanings": [
        {
            "definition": "A type of French verse form typically consisting of three eight-line stanzas followed by a four-line envoy.",
            "pos": "noun",
            "sent1": "In literature class, we learned about the ballade and its unique structure.",
            "sent2": "The poet composed a beautiful ballade that captivated the audience.",
            "sent3": "The students giggled as they attempted to write a ballade with rhyming lines.",
            "sent4": "Her ballade was like a puzzle, each stanza fitting perfectly into place.",
            "sent5": "The ballade's intricate pattern made it challenging to write but rewarding to complete."
        },
        {
            "definition": "A musical composition in the style of a ballade, typically for piano or orchestra.",
            "pos": "noun",
            "sent1": "The pianist performed a mesmerizing ballade that echoed through the concert hall.",
            "sent2": "Listening to the orchestra play the ballade was a truly enchanting experience.",
            "sent3": "The ballade played by the pianist had everyone tapping their feet to the rhythm.",
            "sent4": "The ballade's melody soared like a bird in flight, filling the room with emotion.",
            "sent5": "The composer poured his heart into the ballade, creating a masterpiece of sound."
        },
        {
            "definition": "A narrative poem or song.",
            "pos": "noun",
            "sent1": "Grandma used to sing a ballade to me before bedtime, weaving tales of adventure.",
            "sent2": "The troubadour strummed his lute and sang a ballade of love and loss.",
            "sent3": "The children gathered around the storyteller, eager to hear the ballade of the brave knight.",
            "sent4": "The ballade of the ancient kingdom echoed through the generations, preserving its history.",
            "sent5": "The bard's ballade painted vivid pictures of far-off lands and heroic deeds."
        }
    ]
}