{
    "term": "balletomane",
    "meanings": [
        {
            "definition": "A person who is an enthusiastic fan of ballet.",
            "pos": "noun",
            "sent1": "She is a true balletomane, attending every ballet performance in town.",
            "sent2": "The balletomane eagerly collects ballet tickets and memorabilia.",
            "sent3": "The balletomane's love for ballet is so strong, they even dream of dancing on stage.",
            "sent4": "Her heart beats to the rhythm of ballet, a true balletomane in every sense.",
            "sent5": "The balletomane's eyes light up with joy at the mere mention of ballet."
        },
        {
            "definition": "One who is obsessed with ballet performances.",
            "pos": "noun",
            "sent1": "As a balletomane, she never misses a chance to watch ballet performances.",
            "sent2": "The balletomane spends hours discussing the nuances of different ballet performances.",
            "sent3": "The balletomane's obsession with ballet is so intense, they even have ballet-themed wallpaper.",
            "sent4": "In her mind, the world revolves around ballet, a true balletomane through and through.",
            "sent5": "The balletomane's room is filled with posters of ballet performances, a shrine to their obsession."
        },
        {
            "definition": "A devotee of ballet.",
            "pos": "noun",
            "sent1": "She is a dedicated balletomane, always supporting ballet companies.",
            "sent2": "The balletomane's passion for ballet shines through in every conversation.",
            "sent3": "The balletomane's devotion to ballet is so strong, they even have a ballet-themed phone case.",
            "sent4": "Her soul is intertwined with ballet, a true balletomane in heart and spirit.",
            "sent5": "The balletomane's love for ballet is unwavering, a beacon of dedication in the ballet world."
        }
    ]
}