{
    "term": "ballon",
    "meanings": [
        {
            "definition": "A large round object used in sports and games.",
            "pos": "noun",
            "sent1": "During the game, the players kicked the ballon back and forth.",
            "sent2": "The children played with the colorful ballon in the park.",
            "sent3": "The ballon bounced unexpectedly, making everyone laugh.",
            "sent4": "Her laughter filled the room like a ballon, lifting everyone's spirits.",
            "sent5": "The shiny ballon caught the sunlight, creating a beautiful sight."
        },
        {
            "definition": "To swell or puff out.",
            "pos": "verb",
            "sent1": "After eating too much, his stomach started to ballon out.",
            "sent2": "The balloon slowly began to ballon up as it filled with air.",
            "sent3": "The frog's throat seemed to ballon as it croaked loudly.",
            "sent4": "The storm clouds started to ballon ominously in the sky.",
            "sent5": "The dough began to ballon in the oven, turning into a fluffy bread."
        },
        {
            "definition": "A light, decorative object that is filled with air and can float in the air.",
            "pos": "noun",
            "sent1": "She held onto the string of the ballon as it floated in the sky.",
            "sent2": "The party was decorated with colorful ballons hanging from the ceiling.",
            "sent3": "The ballon bobbed gently in the breeze, adding a festive touch.",
            "sent4": "Her happiness soared like a ballon in the clear blue sky.",
            "sent5": "The ballon's bright colors stood out against the gray clouds."
        },
        {
            "definition": "A type of ballet movement where a dancer appears to be weightless and suspended in the air.",
            "pos": "noun",
            "sent1": "The ballerina executed a perfect ballon, captivating the audience.",
            "sent2": "The graceful ballon of the dancer seemed effortless and mesmerizing.",
            "sent3": "The ballon in her performance left the audience in awe.",
            "sent4": "Her ballon on stage was like a dream, defying gravity.",
            "sent5": "The ballon of the dancer seemed to defy physics, creating a magical moment."
        }
    ]
}