{
    "term": "ball",
    "meanings": [
        {
            "definition": "A spherical object used in sports and games.",
            "pos": "noun",
            "sent1": "I kicked the ball into the goal.",
            "sent2": "The children played with the ball at the park.",
            "sent3": "The ball bounced off the wall and hit me on the head.",
            "sent4": "Her laughter filled the room like a ball of sunshine.",
            "sent5": "The ball spun through the air, leaving a trail of excitement."
        },
        {
            "definition": "A formal social gathering for dancing.",
            "pos": "noun",
            "sent1": "We attended the ball at the palace.",
            "sent2": "The ballroom was beautifully decorated for the event.",
            "sent3": "The ball was a magical night of music and dance.",
            "sent4": "Her dress flowed like a ball of silk on the dance floor.",
            "sent5": "The ball was a whirlwind of elegance and grace."
        },
        {
            "definition": "To form into a ball shape.",
            "pos": "verb",
            "sent1": "She tried to ball up the socks before putting them away.",
            "sent2": "The cat likes to ball itself up when sleeping.",
            "sent3": "He balled the paper into a tight wad and threw it in the bin.",
            "sent4": "The snowball balled up as it rolled down the hill.",
            "sent5": "She balled the dough to make perfect cookies."
        },
        {
            "definition": "To have a good time or enjoy oneself.",
            "pos": "verb",
            "sent1": "We balled at the party until late in the night.",
            "sent2": "The kids balled at the amusement park all day.",
            "sent3": "She balled so much at the concert that she lost her voice.",
            "sent4": "The friends balled together on the beach, making memories.",
            "sent5": "He balled with laughter at the comedian's jokes."
        }
    ]
}