{
    "term": "banda",
    "meanings": [
        {
            "definition": "A group of people working together for a common purpose.",
            "pos": "noun",
            "sent1": "The school band was a banda that played music together.",
            "sent2": "The community formed a banda to clean up the park.",
            "sent3": "The banda of friends decided to surprise their teacher with a gift.",
            "sent4": "Their teamwork created a strong banda that achieved great things.",
            "sent5": "Joining the banda made him feel like he belonged and had a purpose."
        },
        {
            "definition": "A strip of material used for binding or wrapping.",
            "pos": "noun",
            "sent1": "She used a banda to tie the gift box neatly.",
            "sent2": "The banda of cloth held the book together.",
            "sent3": "He accidentally tied his shoelaces with a banda instead of a lace.",
            "sent4": "The banda of paper secured the fragile package.",
            "sent5": "The banda around the bouquet added a decorative touch."
        },
        {
            "definition": "A musical group.",
            "pos": "noun",
            "sent1": "The local banda performed at the town festival.",
            "sent2": "She enjoyed listening to the banda play lively tunes.",
            "sent3": "The banda members wore matching outfits for their concert.",
            "sent4": "The sound of the banda filled the park with joy.",
            "sent5": "Attending the banda's concert was a memorable experience."
        },
        {
            "definition": "A flat, narrow strip or loop of material used as a fastener.",
            "pos": "noun",
            "sent1": "She used a banda to keep her hair in place.",
            "sent2": "The banda held the papers together securely.",
            "sent3": "He tied a banda around the gift box to keep it closed.",
            "sent4": "The banda on the dress added a stylish touch.",
            "sent5": "The banda on the bag made it easy to open and close."
        }
    ]
}