{
    "term": "bands",
    "meanings": [
        {
            "definition": "A thin strip of material used for binding or tying",
            "pos": "noun",
            "sent1": "I used rubber bands to tie my hair back.",
            "sent2": "The bands on the package kept it closed.",
            "sent3": "The bands on the gift wrap made it look neat and tidy.",
            "sent4": "The bands of sunlight streamed through the window.",
            "sent5": "The bands of color on the butterfly's wings were mesmerizing."
        },
        {
            "definition": "A group of people joined together for a common purpose",
            "pos": "noun",
            "sent1": "The bands of volunteers cleaned up the park.",
            "sent2": "The music bands at the festival played different genres.",
            "sent3": "The bands of friends worked together to build a sandcastle.",
            "sent4": "The bands of protesters marched for their cause.",
            "sent5": "The bands of students formed study groups to help each other."
        },
        {
            "definition": "A range of frequencies within a given electromagnetic spectrum",
            "pos": "noun",
            "sent1": "The radio bands allow for different channels.",
            "sent2": "The wifi bands determine the speed of the internet connection.",
            "sent3": "The bands of signals can sometimes interfere with each other.",
            "sent4": "The bands of light in the rainbow create a beautiful spectrum.",
            "sent5": "The bands of sound from the concert filled the room."
        },
        {
            "definition": "A flat, thin strip of material forming a loop used to hold something together",
            "pos": "noun",
            "sent1": "She tied the bands of fabric around the gift box.",
            "sent2": "The bands of elastic kept the sheets in place.",
            "sent3": "The bands of paper held the pages of the book together.",
            "sent4": "The bands of metal secured the fence in place.",
            "sent5": "The bands of rubber kept the jar lid sealed tight."
        },
        {
            "definition": "A group of musicians playing together",
            "pos": "noun",
            "sent1": "The bands at the music festival played different genres.",
            "sent2": "The marching bands performed during the parade.",
            "sent3": "The bands of friends formed a music group for fun.",
            "sent4": "The bands of singers harmonized beautifully.",
            "sent5": "The bands of instruments created a symphony of sound."
        }
    ]
}