{
    "term": "band",
    "meanings": [
        {
            "definition": "A group of people working together for a common purpose.",
            "pos": "noun",
            "sent1": "The band of volunteers cleaned up the park together.",
            "sent2": "The school band performed at the football game.",
            "sent3": "The band of friends organized a surprise party for Sarah.",
            "sent4": "Their band of workers tackled the project with great enthusiasm.",
            "sent5": "The band of helpers made the event run smoothly."
        },
        {
            "definition": "A strip of material used for binding or fastening.",
            "pos": "noun",
            "sent1": "She used a rubber band to tie her hair back.",
            "sent2": "The band of fabric held the papers together.",
            "sent3": "He found a colorful band to wrap around the gift.",
            "sent4": "The elastic band snapped when stretched too far.",
            "sent5": "The band of tape secured the box shut."
        },
        {
            "definition": "A range of frequencies within a given band of wavelengths.",
            "pos": "noun",
            "sent1": "The radio station broadcasts on the FM band.",
            "sent2": "The Wi-Fi router operates on the 2.4 GHz band.",
            "sent3": "The scientist studied the electromagnetic band for research.",
            "sent4": "The radar detected a signal in the microwave band.",
            "sent5": "The satellite communication uses the Ku band for transmission."
        },
        {
            "definition": "A flat, thin strip of material used as a decoration or to encircle something.",
            "pos": "noun",
            "sent1": "She wore a beautiful band of silver around her wrist.",
            "sent2": "The band of lace added elegance to the dress.",
            "sent3": "The band of ribbon adorned the gift box.",
            "sent4": "The golden band shone brightly in the sunlight.",
            "sent5": "The band of pearls enhanced her necklace."
        },
        {
            "definition": "A group of musicians playing together.",
            "pos": "noun",
            "sent1": "The band performed a concert in the park.",
            "sent2": "The jazz band played at the local club.",
            "sent3": "The band of musicians practiced for hours before the show.",
            "sent4": "The rock band's music echoed through the stadium.",
            "sent5": "The band of singers harmonized beautifully on stage."
        }
    ]
}