{
    "term": "bang",
    "meanings": [
        {
            "definition": "A sudden loud noise",
            "pos": "noun",
            "sent1": "The bang of the door startled me.",
            "sent2": "I heard a loud bang coming from the fireworks.",
            "sent3": "The bang of the drum made everyone jump.",
            "sent4": "The bang of the thunder shook the windows.",
            "sent5": "The bang of the gunshot echoed through the night."
        },
        {
            "definition": "A hard strike or hit",
            "pos": "noun",
            "sent1": "He felt a bang on his head after bumping into the wall.",
            "sent2": "The boxer delivered a powerful bang to his opponent's jaw.",
            "sent3": "The bang of the hammer on the nail was satisfying.",
            "sent4": "The bang of the ball hitting the bat was heard across the field.",
            "sent5": "The bang of the collision echoed in the empty room."
        },
        {
            "definition": "To make a sudden loud noise",
            "pos": "verb",
            "sent1": "The fireworks bang loudly in the sky.",
            "sent2": "I accidentally made the door bang shut.",
            "sent3": "The kids love to bang on the drums during music class.",
            "sent4": "The wind caused the shutters to bang against the house.",
            "sent5": "The car's engine started to bang loudly."
        },
        {
            "definition": "To hit something forcefully",
            "pos": "verb",
            "sent1": "She had to bang the jar on the counter to open it.",
            "sent2": "The carpenter needed to bang the nail into the wood.",
            "sent3": "He would bang the gavel to call for order in the court.",
            "sent4": "The waves would bang against the rocks on the shore.",
            "sent5": "The chef would bang the dough to knead it properly."
        },
        {
            "definition": "To have sexual intercourse",
            "pos": "verb",
            "sent1": "The characters in the movie decided to bang in the bedroom scene.",
            "sent2": "Some birds bang to reproduce and have babies.",
            "sent3": "The monkeys in the zoo were caught banging on camera.",
            "sent4": "The teenagers were giggling about who would bang whom at the party.",
            "sent5": "The animals in the wild bang to continue their species."
        }
    ]
}