{
    "term": "bangbellies",
    "meanings": [
        {
            "definition": "Bangbellies (noun): plural form of bangbelly, referring to a person or animal with a large, protruding belly.",
            "pos": "noun",
            "sent1": "The circus elephant had bangbellies that jiggled as it walked.",
            "sent2": "The cartoon character was drawn with cute bangbellies peeking out from under its shirt.",
            "sent3": "The baby's bangbellies made everyone in the family laugh during mealtime.",
            "sent4": "The bangbellies of the sumo wrestlers seemed to have a gravitational pull of their own.",
            "sent5": "In the hot sun, the dog lay on its back, exposing its bangbellies for a cool breeze."
        },
        {
            "definition": "Bangbellies (verb): third person present form of bangbelly, meaning to hit or strike someone's belly with force.",
            "pos": "verb",
            "sent1": "He playfully bangbellies his little brother during their roughhousing.",
            "sent2": "The boxer accidentally bangbellies his opponent during the match.",
            "sent3": "The comedian joked that he would bangbellies with anyone who challenged him to a belly dance-off.",
            "sent4": "The thunderstorm seemed to bangbellies with the earth, shaking everything in its path.",
            "sent5": "The chef had to be careful not to bangbellies the dough too hard while kneading it."
        },
        {
            "definition": "Bangbellies (adjective): describing something related to or characteristic of bangbellies.",
            "pos": "adjective",
            "sent1": "The bangbellies costume at the party was a big hit with the kids.",
            "sent2": "The bangbellies design on the shirt made it stand out in the crowd.",
            "sent3": "The bangbellies dance moves of the performer brought smiles to the audience.",
            "sent4": "The bangbellies colors of the sunset painted the sky in hues of orange and pink.",
            "sent5": "The bangbellies sound of the drums echoed through the valley, captivating all who heard it."
        }
    ]
}