{
    "term": "banish",
    "meanings": [
        {
            "definition": "To send away from a place as a punishment or to force someone to leave",
            "pos": "verb",
            "sent1": "The king decided to banish the troublemaker from the kingdom.",
            "sent2": "The judge may choose to banish a criminal to a faraway island.",
            "sent3": "The mischievous elf was banished from the enchanted forest for playing pranks on the fairies.",
            "sent4": "In the story, the evil sorcerer cast a spell to banish the hero to a realm of darkness.",
            "sent5": "The teacher threatened to banish the noisy student to the hallway if he didn't quiet down."
        },
        {
            "definition": "To get rid of something unwanted or unpleasant",
            "pos": "verb",
            "sent1": "I need to banish these old clothes from my closet to make space for new ones.",
            "sent2": "Using a good cleaning product can help banish stubborn stains from the carpet.",
            "sent3": "The brave knight set out on a quest to banish the dragon terrorizing the village.",
            "sent4": "The bright sunlight helped banish the shadows lurking in the corners of the room.",
            "sent5": "A positive attitude can banish negative thoughts from your mind."
        },
        {
            "definition": "To exile or expel someone from a community or group",
            "pos": "verb",
            "sent1": "The strict rules of the club may lead to a decision to banish members who break them.",
            "sent2": "The tribe's tradition was to banish those who betrayed their trust.",
            "sent3": "The mischievous squirrel was banished from the treehouse for stealing nuts from the others.",
            "sent4": "The powerful wizard had the ability to banish enemies with a wave of his wand.",
            "sent5": "The council voted to banish the troublemaker to the outskirts of the village."
        }
    ]
}