{
    "term": "bankit",
    "meanings": [
        {
            "definition": "A financial institution where money is deposited and held",
            "pos": "noun",
            "sent1": "I went to the bankit to deposit my savings.",
            "sent2": "The bankit is where people keep their money safe.",
            "sent3": "The bankit was so crowded that I had to wait in line.",
            "sent4": "Her piggy bankit was overflowing with coins.",
            "sent5": "The bankit guard always keeps a close watch on the entrance."
        },
        {
            "definition": "To tilt or incline to one side",
            "pos": "verb",
            "sent1": "The boat started to bankit as the waves rocked it.",
            "sent2": "Be careful not to bankit the tray and spill the drinks.",
            "sent3": "The leaning tower seemed to bankit even further in the wind.",
            "sent4": "The tree appeared to bankit towards the sunlight.",
            "sent5": "The old chair would bankit slightly whenever someone sat on it."
        },
        {
            "definition": "A raised area of land along a body of water",
            "pos": "noun",
            "sent1": "We had a picnic on the grassy bankit by the river.",
            "sent2": "The ducks waddled along the bankit of the pond.",
            "sent3": "The children played tag on the sloping bankit near the lake.",
            "sent4": "The flowers bloomed beautifully on the river bankit.",
            "sent5": "The fishermen cast their lines from the peaceful bankit."
        },
        {
            "definition": "To rely on or trust in something or someone",
            "pos": "verb",
            "sent1": "I bankit on my best friend to always be there for me.",
            "sent2": "You can bankit on him to finish the project on time.",
            "sent3": "I bankit on my lucky socks to help me win the game.",
            "sent4": "She would bankit on her intuition to make important decisions.",
            "sent5": "In times of trouble, we often bankit on our family for support."
        }
    ]
}