{
    "term": "banker",
    "meanings": [
        {
            "definition": "A person who owns or is an official of a bank.",
            "pos": "noun",
            "sent1": "The banker greeted customers at the bank.",
            "sent2": "The banker helped clients with their financial needs.",
            "sent3": "The banker joked with the tellers during lunch break.",
            "sent4": "The banker's office was like a fortress, guarding the bank's secrets.",
            "sent5": "The banker's smile was as reassuring as a vault door."
        },
        {
            "definition": "A person who manages, controls, or is employed in a bank.",
            "pos": "noun",
            "sent1": "The banker oversaw the daily operations of the bank.",
            "sent2": "The banker made sure all transactions were recorded accurately.",
            "sent3": "The banker accidentally locked himself in the vault once.",
            "sent4": "The banker's authority in the bank was as solid as a brick wall.",
            "sent5": "The banker's presence in the bank was as constant as the ticking of a clock."
        },
        {
            "definition": "A person who is responsible for the safekeeping of money or valuables.",
            "pos": "noun",
            "sent1": "The banker securely stored the customers' valuables in the vault.",
            "sent2": "The banker ensured that all deposits were kept safe.",
            "sent3": "The banker once pretended to misplace a fake gold bar for fun.",
            "sent4": "The banker's vigilance in protecting the bank's assets was unwavering.",
            "sent5": "The banker's care for the money entrusted to him was as gentle as a whisper."
        },
        {
            "definition": "A person who deals in money or credit.",
            "pos": "noun",
            "sent1": "The banker negotiated loans for the customers.",
            "sent2": "The banker analyzed financial risks and opportunities.",
            "sent3": "The banker tried to pay for lunch with a stack of monopoly money as a prank.",
            "sent4": "The banker's expertise in financial matters was as sharp as a razor.",
            "sent5": "The banker's knowledge of money was as deep as an ocean."
        }
    ]
}