{
    "term": "bantered",
    "meanings": [
        {
            "definition": "To exchange playful remarks or teasing comments",
            "pos": "verb",
            "sent1": "During recess, the children bantered back and forth, laughing and joking.",
            "sent2": "The friends bantered about their favorite movies while waiting for the bus.",
            "sent3": "The siblings bantered about who could eat the most cookies without getting a tummy ache.",
            "sent4": "As the sun set, the birds bantered in the trees, their chirps like playful remarks.",
            "sent5": "The students bantered in the classroom, creating a lively and fun atmosphere."
        },
        {
            "definition": "To engage in light-hearted conversation or joking",
            "pos": "verb",
            "sent1": "At the family dinner table, everyone bantered happily, sharing stories and jokes.",
            "sent2": "The coworkers bantered during their lunch break, lightening the mood in the office.",
            "sent3": "The group of friends bantered about their upcoming camping trip, excitedly planning their adventure.",
            "sent4": "The old friends bantered like they were teenagers again, reminiscing about the good old days.",
            "sent5": "The comedian bantered with the audience, keeping them entertained throughout the show."
        },
        {
            "definition": "To talk or exchange remarks in a good-humored or teasing way",
            "pos": "verb",
            "sent1": "The siblings bantered affectionately, teasing each other but always with a smile.",
            "sent2": "As they walked through the park, the couple bantered playfully, enjoying each other's company.",
            "sent3": "The colleagues bantered in the break room, lightening the mood after a long meeting.",
            "sent4": "The neighbors bantered over the fence, sharing gossip and jokes in a friendly manner.",
            "sent5": "The group of friends bantered around the campfire, their laughter echoing in the night."
        }
    ]
}