{
    "term": "baobabs",
    "meanings": [
        {
            "definition": "A type of tree native to Africa and Australia with a thick trunk and large, spreading branches.",
            "pos": "noun",
            "sent1": "The baobabs in the savanna provide shade for animals during the hot days.",
            "sent2": "I saw a group of baobabs standing tall in the African landscape.",
            "sent3": "The giraffe tried to hide behind the baobabs, but its long neck gave it away.",
            "sent4": "The baobabs stood like ancient guardians, watching over the vast plains.",
            "sent5": "Under the baobabs, the villagers gathered to tell stories under the starry sky."
        },
        {
            "definition": "The fruit of the baobab tree, which is edible and has a tangy flavor.",
            "pos": "noun",
            "sent1": "The baobabs' fruit is known for its unique taste and high vitamin C content.",
            "sent2": "I picked a baobabs fruit and enjoyed its refreshing tanginess.",
            "sent3": "The monkeys chattered happily while feasting on the baobabs' fruit.",
            "sent4": "Her laughter was as bright and tangy as a baobabs fruit on a summer day.",
            "sent5": "The baobabs' fruit juice was like a burst of sunshine in my mouth."
        },
        {
            "definition": "The wood of the baobab tree, which is used for carving and making furniture.",
            "pos": "noun",
            "sent1": "Craftsmen carved intricate designs into the baobabs wood to create beautiful sculptures.",
            "sent2": "The table in the living room was made from sturdy baobabs wood.",
            "sent3": "The mischievous squirrel tried to hide its acorns in the baobabs wood pile.",
            "sent4": "Her voice echoed through the room, resonating like the strength of baobabs wood.",
            "sent5": "The aroma of freshly cut baobabs wood filled the workshop with a sweet scent."
        }
    ]
}