{
    "term": "barbecue",
    "meanings": [
        {
            "definition": "A meal or gathering at which meat, fish, or other food is cooked out of doors on a rack over an open fire or on a portable grill.",
            "pos": "noun",
            "sent1": "We had a barbecue in the park with grilled burgers and hot dogs.",
            "sent2": "The family enjoyed a barbecue in the backyard on a sunny day.",
            "sent3": "The barbecue in the garden attracted hungry neighbors with its delicious aroma.",
            "sent4": "The barbecue at the beach sizzled with excitement as friends gathered around.",
            "sent5": "The smell of barbecue filled the air, making everyone's mouths water."
        },
        {
            "definition": "A grill or fireplace used for cooking food over an open fire.",
            "pos": "noun",
            "sent1": "Dad lit the barbecue to cook our dinner outside.",
            "sent2": "The barbecue in the backyard was perfect for grilling steaks.",
            "sent3": "The barbecue crackled and popped as the flames danced beneath the grill.",
            "sent4": "The barbecue glowed warmly in the evening light, casting a cozy ambiance.",
            "sent5": "The barbecue's flames licked the meat, giving it a delicious charred flavor."
        },
        {
            "definition": "To cook (food) on a barbecue.",
            "pos": "verb",
            "sent1": "We will barbecue some chicken for dinner tonight.",
            "sent2": "Let's barbecue some vegetables to go with the grilled steak.",
            "sent3": "She loves to barbecue on weekends, enjoying the outdoor cooking experience.",
            "sent4": "The chef expertly barbecued the ribs, making them tender and flavorful.",
            "sent5": "Barbecuing the meat over the fire added a smoky taste that everyone loved."
        },
        {
            "definition": "A social gathering, usually held outdoors, at which food is cooked on a barbecue.",
            "pos": "noun",
            "sent1": "The neighborhood barbecue brought everyone together for a fun evening.",
            "sent2": "We are planning a barbecue by the lake next weekend.",
            "sent3": "The annual company barbecue is always a hit with employees.",
            "sent4": "The community barbecue was a chance for people to mingle and enjoy good food.",
            "sent5": "The school barbecue was filled with laughter, games, and delicious grilled food."
        }
    ]
}