{
    "term": "barbie",
    "meanings": [
        {
            "definition": "A barbecue grill",
            "pos": "noun",
            "sent1": "Dad is grilling burgers on the barbie.",
            "sent2": "The barbie in the backyard is heating up for the cookout.",
            "sent3": "The barbie sizzled happily as the sausages cooked.",
            "sent4": "The flames danced under the barbie, giving a warm glow to the evening.",
            "sent5": "The shiny barbie gleamed in the sunlight, ready for the BBQ feast."
        },
        {
            "definition": "A barbecue party",
            "pos": "noun",
            "sent1": "We had a fun barbie with friends last weekend.",
            "sent2": "Everyone enjoyed the delicious food at the barbie.",
            "sent3": "The barbie turned into a dance party under the stars.",
            "sent4": "Laughter filled the air at the lively barbie gathering.",
            "sent5": "The music played softly in the background of the cheerful barbie."
        },
        {
            "definition": "A barbecue sauce",
            "pos": "noun",
            "sent1": "The tangy barbie added flavor to the grilled chicken.",
            "sent2": "Mom's secret barbie recipe made the ribs taste amazing.",
            "sent3": "The sweet barbie dripped down the sides of the ribs.",
            "sent4": "The rich aroma of the barbie filled the kitchen.",
            "sent5": "A dollop of the spicy barbie completed the dish perfectly."
        },
        {
            "definition": "A barbecue utensil",
            "pos": "noun",
            "sent1": "The chef used the barbie to flip the burgers.",
            "sent2": "A set of tongs is essential for the barbie.",
            "sent3": "The shiny barbie gleamed in the sunlight, ready for the BBQ feast.",
            "sent4": "The barbie spatula was perfect for flipping the steaks.",
            "sent5": "The long handle of the barbie fork kept hands safe from the heat."
        },
        {
            "definition": "A barbecue restaurant",
            "pos": "noun",
            "sent1": "Let's go to the new barbie for dinner tonight.",
            "sent2": "The barbie down the street is known for its ribs.",
            "sent3": "The cozy barbie had a welcoming atmosphere.",
            "sent4": "The barbie's menu featured a variety of grilled dishes.",
            "sent5": "The aroma from the barbie made mouths water as people passed by."
        }
    ]
}