{
    "term": "barbarism",
    "meanings": [
        {
            "definition": "Absence of culture or civilization",
            "pos": "noun",
            "sent1": "The tribe's barbarism was evident in their lack of written language.",
            "sent2": "The ancient ruins showed signs of barbarism with no advanced structures.",
            "sent3": "It was a comedy skit about a time traveler shocked by modern barbarism like fast food.",
            "sent4": "The barbarism of nature's fury during the storm was both terrifying and awe-inspiring.",
            "sent5": "The teacher used vivid images to explain the concept of barbarism to the students."
        },
        {
            "definition": "Cruel or brutal behavior",
            "pos": "noun",
            "sent1": "The barbarism of the dictator led to the suffering of many innocent people.",
            "sent2": "The history books recounted tales of war and barbarism from ancient times.",
            "sent3": "The villain's barbarism was comically exaggerated in the superhero movie.",
            "sent4": "The barbarism of the battlefield left scars on the soldiers, both physical and emotional.",
            "sent5": "The documentary exposed the harsh reality of human barbarism throughout history."
        },
        {
            "definition": "A word or expression that is considered uncivilized or uncultured",
            "pos": "noun",
            "sent1": "Using such barbarism in your speech is not appropriate for a formal setting.",
            "sent2": "The playwright intentionally included barbarism in the character's dialogue to show their lack of refinement.",
            "sent3": "The stand-up comedian joked about the audience's reaction to his use of barbarism in his routine.",
            "sent4": "In the literary world, some authors choose to challenge societal norms by incorporating barbarism in their works.",
            "sent5": "The teacher explained the importance of avoiding barbarism in academic writing to maintain professionalism."
        }
    ]
}