{
    "term": "barde",
    "meanings": [
        {
            "definition": "To cover with armor",
            "pos": "verb",
            "sent1": "The knight would barde himself in shining armor before battle.",
            "sent2": "Soldiers often barde themselves in protective gear for safety.",
            "sent3": "The squirrel decided to barde itself in acorn shells for a fancy dress party.",
            "sent4": "The city was barde in a blanket of fog, hiding its true beauty.",
            "sent5": "The sun barde the sky in hues of pink and orange during the sunset."
        },
        {
            "definition": "To adorn or cover with decorative material",
            "pos": "verb",
            "sent1": "She would barde her room with colorful curtains and cushions.",
            "sent2": "The Christmas tree was barde with sparkling lights and ornaments.",
            "sent3": "The cat tried to barde itself in ribbons, thinking it was a gift.",
            "sent4": "Her laughter barde the room with joy and happiness.",
            "sent5": "The garden was barde in a riot of colorful flowers and plants."
        },
        {
            "definition": "A piece of armor for a horse's neck and body",
            "pos": "noun",
            "sent1": "The horse wore a protective barde during the jousting tournament.",
            "sent2": "The shiny barde on the horse gleamed in the sunlight.",
            "sent3": "The mischievous cat tried to wear the horse's barde as a costume.",
            "sent4": "The barde on the horse was like a shield against any harm.",
            "sent5": "The knight carefully polished the barde before the big battle."
        },
        {
            "definition": "A piece of armor for a horse's head and neck",
            "pos": "noun",
            "sent1": "The elegant barde on the horse's head added to its majestic appearance.",
            "sent2": "The knight adjusted the barde on the horse's head before riding into the arena.",
            "sent3": "The mischievous squirrel tried to wear the horse's barde as a hat.",
            "sent4": "The barde on the horse's head protected it from any stray arrows.",
            "sent5": "The intricate design of the barde on the horse's head was truly impressive."
        }
    ]
}