{
    "term": "barf",
    "meanings": [
        {
            "definition": "To vomit",
            "pos": "verb",
            "sent1": "I feel sick and might barf after eating too much candy.",
            "sent2": "She barfed all over the floor when she got food poisoning.",
            "sent3": "The smell of the garbage made him want to barf.",
            "sent4": "The roller coaster was so intense, it felt like my stomach was going to barf out.",
            "sent5": "The disgusting sight made me want to barf immediately."
        },
        {
            "definition": "Vomit",
            "pos": "verb",
            "sent1": "The dog barfed on the carpet, making a mess.",
            "sent2": "After the party, they had to clean up the barfed-up food.",
            "sent3": "He accidentally barfed on his friend's shoes during the car ride.",
            "sent4": "The overflowing toilet looked like it was about to barf its contents everywhere.",
            "sent5": "The baby barfed all over their new clothes."
        },
        {
            "definition": "Nausea or vomiting",
            "pos": "noun",
            "sent1": "Her sudden barf in class caused quite a commotion.",
            "sent2": "The smell of barf in the room made everyone feel queasy.",
            "sent3": "The sight of the barf on the sidewalk was enough to turn anyone's stomach.",
            "sent4": "The party ended early due to someone's unfortunate barf incident.",
            "sent5": "The bathroom reeked of barf after the stomach bug spread through the house."
        },
        {
            "definition": "To regurgitate food from the stomach",
            "pos": "verb",
            "sent1": "The bird barfed up a pellet of undigested food.",
            "sent2": "He barfed out the food he had eaten too quickly.",
            "sent3": "The cat barfed up a hairball on the carpet.",
            "sent4": "The fish barfed out some food it couldn't digest properly.",
            "sent5": "The baby bird barfed up its meal for the parent to eat."
        }
    ]
}