{
    "term": "bargain",
    "meanings": [
        {
            "definition": "An agreement between parties on a price or exchange of goods or services.",
            "pos": "noun",
            "sent1": "The bargain between the two friends was to trade toys.",
            "sent2": "She found a great bargain on a new dress at the store.",
            "sent3": "The bargain between the cat and dog was to share the sunny spot by the window.",
            "sent4": "Their bargain was like a secret code that only they understood.",
            "sent5": "The bargain between the siblings was sealed with a pinky promise."
        },
        {
            "definition": "Something bought or offered for sale at a price advantageous to the buyer.",
            "pos": "noun",
            "sent1": "The old book was a real bargain at the thrift store.",
            "sent2": "He couldn't resist the bargain of a lifetime on the antique vase.",
            "sent3": "The bargain on the vintage record player made her day.",
            "sent4": "The bargain price on the painting felt like a steal.",
            "sent5": "The bargain she found at the flea market was a hidden gem."
        },
        {
            "definition": "To negotiate the terms of a transaction.",
            "pos": "verb",
            "sent1": "They had to bargain with the vendor for a better deal.",
            "sent2": "She bargained with the seller to lower the price of the car.",
            "sent3": "He tried to bargain with the vending machine for an extra snack.",
            "sent4": "Negotiating the contract terms felt like a game of bargaining.",
            "sent5": "She bargained her way into getting a discount on the shoes."
        },
        {
            "definition": "To find something for a lower price than expected.",
            "pos": "verb",
            "sent1": "She bargained for a cheaper ticket to the concert.",
            "sent2": "He bargained with the store manager for a discount on the shoes.",
            "sent3": "The kids bargained for a better deal on the ice cream cones.",
            "sent4": "Bargaining for a good deal felt like a victory.",
            "sent5": "She bargained her way into getting a discount on the shoes."
        }
    ]
}