{
    "term": "barre",
    "meanings": [
        {
            "definition": "A long, horizontal rod used for ballet dancers to support themselves during exercises.",
            "pos": "noun",
            "sent1": "During ballet class, the dancers gracefully held onto the barre for balance.",
            "sent2": "The ballet instructor demonstrated a plié at the barre.",
            "sent3": "The mischievous kitten thought the barre was a fun toy to climb on.",
            "sent4": "The barre became a lifeline for the tired dancer, supporting her through the challenging routine.",
            "sent5": "The wooden barre felt smooth and cool against her fingertips as she practiced her arabesque."
        },
        {
            "definition": "A barrier or counter in a restaurant or pub where drinks are served.",
            "pos": "noun",
            "sent1": "The bartender wiped down the barre before the evening rush.",
            "sent2": "Customers gathered around the barre, chatting and enjoying their drinks.",
            "sent3": "The barre at the pub was so crowded that it felt like a game of musical chairs.",
            "sent4": "The barre seemed like a silent observer, witnessing countless conversations and celebrations.",
            "sent5": "The polished surface of the barre gleamed under the warm lights of the restaurant."
        },
        {
            "definition": "A unit of pressure measurement equal to one million dynes per square centimeter.",
            "pos": "noun",
            "sent1": "The scientist recorded the results in barres to accurately measure the pressure.",
            "sent2": "The barre measurement helped determine the force exerted on the material.",
            "sent3": "The pressure in the lab reached such high barres that the equipment started to shake.",
            "sent4": "The barre measurement was crucial in understanding the impact of the experiment.",
            "sent5": "The barre unit provided a precise way to quantify the pressure on the surface."
        }
    ]
}