{
    "term": "barras",
    "meanings": [
        {
            "definition": "A unit of pressure equal to one million dynes per square centimeter.",
            "pos": "noun",
            "sent1": "The scientist measured the pressure in barras to understand the force.",
            "sent2": "The machine can withstand up to 10 barras of pressure before breaking.",
            "sent3": "The balloon popped when it reached the maximum barras on the gauge.",
            "sent4": "The barras of stress on the material caused it to bend under the weight.",
            "sent5": "The barras on the scale showed the immense force exerted on the object."
        },
        {
            "definition": "A type of bread roll or loaf.",
            "pos": "noun",
            "sent1": "I love to have barras with butter for breakfast.",
            "sent2": "The bakery sells freshly baked barras every morning.",
            "sent3": "The kids enjoyed a picnic with barras and jam sandwiches.",
            "sent4": "The aroma of warm barras filled the kitchen, making everyone hungry.",
            "sent5": "The golden crust of the barras was crispy and delicious."
        },
        {
            "definition": "A type of gymnastics apparatus.",
            "pos": "noun",
            "sent1": "The gymnast practiced her routine on the barras.",
            "sent2": "The coach adjusted the height of the barras for the competition.",
            "sent3": "During practice, the gymnast slipped off the barras and landed on the mat.",
            "sent4": "Balancing on the barras requires strength and precision.",
            "sent5": "The gymnast gracefully flipped over the barras, impressing the judges."
        },
        {
            "definition": "A type of currency in Spain and Portugal.",
            "pos": "noun",
            "sent1": "In Spain, you can pay with euros or barras at the market.",
            "sent2": "The shopkeeper exchanged my euros for barras at a fair rate.",
            "sent3": "The traveler was surprised by the colorful design on the barras.",
            "sent4": "The value of barras fluctuates based on the economic conditions.",
            "sent5": "The souvenir shop accepted both euros and barras for the handmade crafts."
        }
    ]
}