{
    "term": "barra",
    "meanings": [
        {
            "definition": "A long, rigid piece of metal or wood",
            "pos": "noun",
            "sent1": "The carpenter used a sturdy barra to support the structure.",
            "sent2": "She found a barra in the garage to use as a curtain rod.",
            "sent3": "The mischievous squirrel balanced on the barra like a tightrope walker.",
            "sent4": "His determination was as unyielding as a barra in the storm.",
            "sent5": "The barra gleamed in the sunlight, a symbol of strength and durability."
        },
        {
            "definition": "A counter or area in a pub or restaurant where drinks are served",
            "pos": "noun",
            "sent1": "The bartender wiped the barra clean before the evening rush.",
            "sent2": "Friends gathered around the barra, chatting and laughing.",
            "sent3": "The cat tried to sneak onto the barra, hoping for a taste of milk.",
            "sent4": "The barra was a hub of activity, like a bustling marketplace.",
            "sent5": "The neon lights above the barra cast a colorful glow on the patrons."
        },
        {
            "definition": "A unit of pressure equal to one million dynes per square centimeter",
            "pos": "noun",
            "sent1": "The scientist measured the pressure in barra units for accuracy.",
            "sent2": "The machine displayed the reading in barra, indicating high pressure.",
            "sent3": "The balloon popped due to the intense barra inside.",
            "sent4": "The barra was like a silent force pushing against the walls.",
            "sent5": "The barra measurement was crucial for the experiment's success."
        },
        {
            "definition": "A type of fish commonly found in Australian waters",
            "pos": "noun",
            "sent1": "The fishermen hoped to catch a barra for dinner.",
            "sent2": "The barra swam gracefully in the clear waters of the reef.",
            "sent3": "The playful dolphins chased the barra for fun.",
            "sent4": "The barra shimmered like a silver jewel in the ocean.",
            "sent5": "The barra's scales glistened under the sunlight, a sight to behold."
        }
    ]
}