{
    "term": "based",
    "meanings": [
        {
            "definition": "Established as a foundation or starting point",
            "pos": "adjective",
            "sent1": "The project's success was based on careful planning.",
            "sent2": "The company's growth was based on strong leadership.",
            "sent3": "The cake's deliciousness was based on a secret family recipe.",
            "sent4": "Her confidence was based on a solid belief in herself.",
            "sent5": "The team's unity was based on mutual respect and trust."
        },
        {
            "definition": "Having a particular type of foundation or support",
            "pos": "adjective",
            "sent1": "The decision was based on expert advice.",
            "sent2": "His argument was based on solid evidence.",
            "sent3": "The tree's stability was based on deep roots.",
            "sent4": "Her happiness was based on strong relationships.",
            "sent5": "The building's strength was based on a sturdy frame."
        },
        {
            "definition": "Using something as a basis or foundation",
            "pos": "adjective",
            "sent1": "The artist created a masterpiece based on nature.",
            "sent2": "The theory was based on scientific research.",
            "sent3": "The joke was based on a funny misunderstanding.",
            "sent4": "Her decision was based on careful consideration.",
            "sent5": "The design was based on traditional patterns."
        },
        {
            "definition": "Having a specified type of base or foundation",
            "pos": "adjective",
            "sent1": "The dish was based on a family recipe.",
            "sent2": "His success was based on hard work.",
            "sent3": "The painting was based on a famous artist's style.",
            "sent4": "Her argument was based on logical reasoning.",
            "sent5": "The team's strategy was based on a solid plan."
        }
    ]
}