{
    "term": "basse",
    "meanings": [
        {
            "definition": "Low in pitch or tone.",
            "pos": "adjective",
            "sent1": "The sound of the bass guitar is very basse.",
            "sent2": "Her voice was so basse that it resonated throughout the room.",
            "sent3": "The basse hum of the refrigerator made it seem like it was singing a lullaby.",
            "sent4": "The basse notes of the thunderstorm created a dramatic atmosphere.",
            "sent5": "The basse growl of the lion sent shivers down my spine."
        },
        {
            "definition": "A type of fish.",
            "pos": "noun",
            "sent1": "The fisherman caught a large basse in the lake.",
            "sent2": "The basse was known for its delicious taste.",
            "sent3": "The basse swam gracefully in the clear water.",
            "sent4": "The basse darted away as soon as it sensed danger.",
            "sent5": "The basse's scales shimmered in the sunlight."
        },
        {
            "definition": "A type of musical instrument.",
            "pos": "noun",
            "sent1": "The musician played a beautiful melody on the basse.",
            "sent2": "The basse added a deep richness to the orchestra's sound.",
            "sent3": "The basse was so large, it almost touched the ground.",
            "sent4": "The basse's strings resonated with each pluck.",
            "sent5": "The basse player's fingers danced across the strings with skill."
        },
        {
            "definition": "A type of voice in choral music.",
            "pos": "noun",
            "sent1": "The choir director needed a strong basse for the performance.",
            "sent2": "The basse singer's deep voice added depth to the choir's harmonies.",
            "sent3": "The basse's solo echoed beautifully in the concert hall.",
            "sent4": "The basse's resonance filled the room with warmth.",
            "sent5": "The basse's powerful notes captivated the audience."
        }
    ]
}