{
    "term": "bastardised",
    "meanings": [
        {
            "definition": "To change (something) in such a way as to lower its quality or value.",
            "pos": "verb",
            "sent1": "The chef bastardised the traditional recipe by adding too much salt.",
            "sent2": "The original painting was bastardised when someone painted over it with cheap colors.",
            "sent3": "The comedian joked that his friend's attempt to cook a gourmet meal was bastardised by using instant noodles.",
            "sent4": "The once beautiful garden was bastardised by neglect and overgrowth.",
            "sent5": "The classic novel's plot was bastardised in the poorly made movie adaptation."
        },
        {
            "definition": "To corrupt or debase (something).",
            "pos": "verb",
            "sent1": "The politician's actions bastardised the trust of the people.",
            "sent2": "The company's unethical practices have bastardised their reputation in the industry.",
            "sent3": "The children's game of tag was bastardised when one player started tripping others on purpose.",
            "sent4": "The virus has bastardised the computer system, causing it to malfunction.",
            "sent5": "The once pure stream was bastardised by pollution from the factory."
        },
        {
            "definition": "To make (something) impure or inferior.",
            "pos": "verb",
            "sent1": "The counterfeit products have bastardised the market, making it difficult to distinguish real from fake.",
            "sent2": "The addition of artificial flavors bastardised the taste of the homemade soup.",
            "sent3": "The student's attempt to copy the answers from a friend only bastardised their own understanding of the subject.",
            "sent4": "The storm's strong winds bastardised the structure of the old barn.",
            "sent5": "The incorrect assembly instructions bastardised the final look of the furniture."
        }
    ]
}