{
    "term": "bastard",
    "meanings": [
        {
            "definition": "A person born of parents not married to each other.",
            "pos": "noun",
            "sent1": "The teacher explained that a bastard is a child whose parents are not married.",
            "sent2": "The town gossip called him a bastard because his parents never got married.",
            "sent3": "When the cat knocked over the vase, my brother jokingly called it a little bastard.",
            "sent4": "The old car in the garage was a bastard, made up of different parts from various vehicles.",
            "sent5": "The storm was a real bastard, causing chaos and destruction everywhere."
        },
        {
            "definition": "A person who is mean or contemptible.",
            "pos": "noun",
            "sent1": "My neighbor is such a bastard, always yelling at kids to get off his lawn.",
            "sent2": "The movie villain was portrayed as a heartless bastard who enjoyed causing pain.",
            "sent3": "The grumpy old man was known around town as the neighborhood bastard.",
            "sent4": "The bully at school was a real bastard, picking on smaller kids for no reason.",
            "sent5": "The boss was a real bastard, always making his employees work late without any appreciation."
        },
        {
            "definition": "A thing that is of irregular, inferior, or dubious origin.",
            "pos": "noun",
            "sent1": "The antique vase turned out to be a bastard, not a valuable family heirloom.",
            "sent2": "The cheap knockoff watch was a bastard compared to the original brand.",
            "sent3": "The strange contraption looked like a bastard invention from a mad scientist's lab.",
            "sent4": "The hybrid plant was a bastard, showing characteristics of two different species.",
            "sent5": "The mysterious artifact was a real bastard, leaving archaeologists puzzled about its origins."
        }
    ]
}