{
    "term": "bastion",
    "meanings": [
        {
            "definition": "A projecting part of a fortification built at an angle to the line of a wall, so as to allow defensive fire in several directions.",
            "pos": "noun",
            "sent1": "The soldiers defended the castle from the bastion, shooting arrows at the enemy.",
            "sent2": "The ancient fortress had a strong bastion that protected it from attacks.",
            "sent3": "The mischievous squirrel thought the bastion was a giant tree branch to climb.",
            "sent4": "Her unwavering faith was a bastion against the storms of life.",
            "sent5": "The towering bastion stood tall, a symbol of strength and protection."
        },
        {
            "definition": "A fortified place.",
            "pos": "noun",
            "sent1": "The old castle served as a bastion against invaders in the past.",
            "sent2": "The fort was a secure bastion, keeping the town safe from harm.",
            "sent3": "The children imagined the treehouse as their secret bastion against imaginary foes.",
            "sent4": "In her heart, the memories of her childhood home were a bastion of comfort.",
            "sent5": "The lighthouse stood as a bastion of hope for sailors lost at sea."
        },
        {
            "definition": "A place or system in which something (such as an old-fashioned idea) continues to survive.",
            "pos": "noun",
            "sent1": "The small bookstore was a bastion of traditional literature in the digital age.",
            "sent2": "The remote village remained a bastion of ancient customs and beliefs.",
            "sent3": "The quirky antique shop was a bastion of oddities and curiosities.",
            "sent4": "His vintage record collection was a bastion of classic music in a modern world.",
            "sent5": "The historic theater stood as a bastion of the arts in the bustling city."
        }
    ]
}