{
    "term": "batman",
    "meanings": [
        {
            "definition": "A soldier assigned to an officer as a servant",
            "pos": "noun",
            "sent1": "The batman helped the officer with his uniform.",
            "sent2": "The army officer's batman was always by his side.",
            "sent3": "The batman accidentally polished the officer's boots too much!",
            "sent4": "The batman was like a shadow, always ready to assist.",
            "sent5": "The batman's loyalty to the officer was unwavering."
        },
        {
            "definition": "A superhero character from DC Comics",
            "pos": "noun",
            "sent1": "My favorite comic book hero is Batman.",
            "sent2": "Batman is known for fighting crime in Gotham City.",
            "sent3": "I dressed up as Batman for Halloween last year.",
            "sent4": "The Batman symbol in the sky signaled trouble was near.",
            "sent5": "Batman's cape billowed behind him as he raced through the night."
        },
        {
            "definition": "A large flying mammal with leathery wings",
            "pos": "noun",
            "sent1": "The batman soared through the night sky in search of food.",
            "sent2": "A batman can navigate in the dark using echolocation.",
            "sent3": "The batman's wingspan was impressive as it flew overhead.",
            "sent4": "The batman's silhouette against the moon was eerie.",
            "sent5": "The batman's flight was graceful and silent."
        },
        {
            "definition": "A person who dresses up as a bat for entertainment or Halloween",
            "pos": "noun",
            "sent1": "The children loved the friendly batman at the Halloween party.",
            "sent2": "The batman costume was a hit at the costume contest.",
            "sent3": "The batman entertained the crowd with his funny bat dance.",
            "sent4": "The batman's mask added an air of mystery to his costume.",
            "sent5": "The batman's wings were made of soft fabric for comfort."
        }
    ]
}