{
    "term": "batt",
    "meanings": [
        {
            "definition": "A battle or combat.",
            "pos": "noun",
            "sent1": "The knights prepared for the batt ahead.",
            "sent2": "The soldiers charged into the batt with determination.",
            "sent3": "During the batt, the squirrels and birds joined forces to defend their home.",
            "sent4": "The batt against the darkness was fierce, but the light prevailed.",
            "sent5": "The sound of swords clashing filled the batt with intensity."
        },
        {
            "definition": "A unit of weight for cotton equal to 500 pounds.",
            "pos": "noun",
            "sent1": "The farmer measured the cotton in bales of batt.",
            "sent2": "The shipment contained several batt of cotton for processing.",
            "sent3": "The market price for a batt of cotton suddenly skyrocketed.",
            "sent4": "The batt of cotton sat heavily on the scale, indicating a good harvest.",
            "sent5": "The batt of cotton was so heavy, it took two workers to lift it."
        },
        {
            "definition": "To strike or hit repeatedly.",
            "pos": "verb",
            "sent1": "He began to batt the drum rhythmically.",
            "sent2": "The boxer continued to batt his opponent with quick jabs.",
            "sent3": "The chef had to batt the dough to make it smooth.",
            "sent4": "The rain seemed to batt against the window all night long.",
            "sent5": "The waves batt against the shore, creating a soothing sound."
        },
        {
            "definition": "A strip of woven material used for lining or padding.",
            "pos": "noun",
            "sent1": "She sewed a batt of fabric into the jacket for extra warmth.",
            "sent2": "The cushion was filled with a soft batt to make it comfortable.",
            "sent3": "The cat found a cozy spot on the batt of cloth near the window.",
            "sent4": "The batt of material protected the fragile item during shipping.",
            "sent5": "The batt of padding made the chair much more comfortable to sit on."
        }
    ]
}