{
    "term": "bead",
    "meanings": [
        {
            "definition": "A small, round object formed by material such as glass or wood.",
            "pos": "noun",
            "sent1": "She wore a beautiful bead necklace.",
            "sent2": "The bead on the bracelet was shiny.",
            "sent3": "The bead rolled off the table and onto the floor.",
            "sent4": "Her tears clung to her cheeks like beads of sorrow.",
            "sent5": "The bead reflected the sunlight, creating a rainbow of colors."
        },
        {
            "definition": "A small drop of liquid.",
            "pos": "noun",
            "sent1": "A bead of sweat formed on his forehead.",
            "sent2": "The morning dew glistened like tiny beads on the grass.",
            "sent3": "She watched the bead of rain trickle down the window.",
            "sent4": "The bead of water hung precariously on the leaf's edge.",
            "sent5": "The bead of oil floated on the surface of the water."
        },
        {
            "definition": "To form into beads.",
            "pos": "verb",
            "sent1": "She carefully beaded the necklace for her friend.",
            "sent2": "The rain began to bead on the car's windshield.",
            "sent3": "He tried to bead the words together into a coherent sentence.",
            "sent4": "The sweat beaded on his forehead as he ran.",
            "sent5": "The morning dew beaded on the petals of the flower."
        },
        {
            "definition": "A small piece of material threaded onto a string.",
            "pos": "noun",
            "sent1": "She strung another bead onto the bracelet.",
            "sent2": "The bead on the necklace matched the earrings.",
            "sent3": "He accidentally dropped a bead while making the necklace.",
            "sent4": "The beads on the curtain shimmered in the sunlight.",
            "sent5": "The bead on the thread completed the design perfectly."
        }
    ]
}