{
    "term": "beam",
    "meanings": [
        {
            "definition": "A long piece of wood, metal, or other material used as a horizontal support in construction.",
            "pos": "noun",
            "sent1": "The carpenter placed a sturdy beam across the ceiling.",
            "sent2": "The sun shone through the gaps in the wooden beams of the old barn.",
            "sent3": "The mischievous squirrel used the beam as a balance beam in its acrobatic routine.",
            "sent4": "Her laughter echoed off the walls like a beam of joy.",
            "sent5": "The weight of the world seemed to rest on that single beam."
        },
        {
            "definition": "A ray or shaft of light.",
            "pos": "noun",
            "sent1": "The morning beam of sunlight peeked through the curtains.",
            "sent2": "The lighthouse beam guided ships safely to shore.",
            "sent3": "The mischievous cat chased after the beam of light from the flashlight.",
            "sent4": "Her smile lit up her face like a beam of happiness.",
            "sent5": "The moonbeam danced on the surface of the lake."
        },
        {
            "definition": "To smile radiantly.",
            "pos": "verb",
            "sent1": "She would beam with pride whenever she talked about her children.",
            "sent2": "The child beamed with excitement upon receiving a gift.",
            "sent3": "The mischievous puppy would beam at everyone who passed by.",
            "sent4": "Her happiness beamed like a lighthouse in the dark.",
            "sent5": "His face beamed with joy as he saw his favorite band perform."
        },
        {
            "definition": "To transmit a radio or television signal.",
            "pos": "verb",
            "sent1": "The radio station beams its music across the city.",
            "sent2": "The satellite beams the TV show to viewers around the world.",
            "sent3": "The mischievous alien tried to beam a message to its home planet.",
            "sent4": "Her voice beamed through the microphone to the audience.",
            "sent5": "The signal beamed clearly through the airwaves."
        }
    ]
}