{
    "term": "beamed",
    "meanings": [
        {
            "definition": "A radiant or bright smile",
            "pos": "noun",
            "sent1": "Her beamed lit up the room with joy.",
            "sent2": "The child's beamed showed how happy he was.",
            "sent3": "His beamed was so wide, it almost touched his ears.",
            "sent4": "The bride's beamed was like a ray of sunshine on her wedding day.",
            "sent5": "The old man's beamed was infectious, making everyone around him smile."
        },
        {
            "definition": "To transmit or broadcast something electronically",
            "pos": "verb",
            "sent1": "The radio station beamed the music to listeners far away.",
            "sent2": "The satellite beamed the signal to the spaceship.",
            "sent3": "The phone beamed the message to her friend in an instant.",
            "sent4": "The lighthouse beamed its light across the dark sea.",
            "sent5": "The TV station beamed the news to households around the country."
        },
        {
            "definition": "To emit light or heat in a concentrated manner",
            "pos": "verb",
            "sent1": "The sun beamed down on the beach, warming the sand.",
            "sent2": "The flashlight beamed a bright light in the dark cave.",
            "sent3": "The campfire beamed heat, making everyone cozy.",
            "sent4": "The spotlight beamed on the stage, highlighting the singer.",
            "sent5": "The firework beamed colorful lights into the night sky."
        },
        {
            "definition": "A long piece of timber or metal used as a support in construction",
            "pos": "noun",
            "sent1": "The builders placed a sturdy beamed across the ceiling.",
            "sent2": "The old barn had wooden beams supporting its roof.",
            "sent3": "The ancient castle had massive stone beams holding it up.",
            "sent4": "The bridge was reinforced with steel beams for extra strength.",
            "sent5": "The skyscraper's beams were carefully inspected for safety."
        }
    ]
}