{
    "term": "bears",
    "meanings": [
        {
            "definition": "To support or hold up",
            "pos": "verb",
            "sent1": "The strong tree bears the weight of the swing.",
            "sent2": "She bears the responsibility of taking care of her younger siblings.",
            "sent3": "The chair bears the weight of the sleepy cat without complaint.",
            "sent4": "His unwavering support bears the team through tough times.",
            "sent5": "The bridge bears the heavy traffic every day without any issues."
        },
        {
            "definition": "To endure or tolerate",
            "pos": "verb",
            "sent1": "She bears the cold weather with a warm coat.",
            "sent2": "He bears the pain of losing his pet with a heavy heart.",
            "sent3": "The little plant bears the strong wind by bending gracefully.",
            "sent4": "Their friendship bears the test of time and distance.",
            "sent5": "The old house bears the memories of generations within its walls."
        },
        {
            "definition": "Large, heavy mammals with shaggy fur and a short tail",
            "pos": "noun",
            "sent1": "The bears in the zoo are always a favorite among visitors.",
            "sent2": "The brown bear is a powerful animal in the forest.",
            "sent3": "The bear cubs playfully wrestle in the meadow.",
            "sent4": "The mama bear protects her cubs with fierce determination.",
            "sent5": "The polar bear's white fur camouflages it in the snowy landscape."
        },
        {
            "definition": "To give birth to or produce",
            "pos": "verb",
            "sent1": "The apple tree bears fruit every autumn.",
            "sent2": "The farm bears a variety of crops throughout the year.",
            "sent3": "The artist's hard work bears beautiful paintings.",
            "sent4": "Her dedication bears success in her career.",
            "sent5": "The fertile soil bears abundant harvests for the farmers."
        },
        {
            "definition": "To carry or transport",
            "pos": "verb",
            "sent1": "The ship bears goods across the ocean.",
            "sent2": "The truck bears supplies to the remote village.",
            "sent3": "The backpack bears all the necessary equipment for the hike.",
            "sent4": "The train bears passengers to their destinations swiftly.",
            "sent5": "The ant bears the heavy leaf back to its colony with determination."
        }
    ]
}