{
    "term": "bearing",
    "meanings": [
        {
            "definition": "The manner in which one carries or conducts oneself",
            "pos": "noun",
            "sent1": "She walked with a confident bearing, head held high.",
            "sent2": "His calm and composed bearing impressed everyone at the meeting.",
            "sent3": "The clown's silly bearing made everyone laugh.",
            "sent4": "Her bearing in the face of adversity was like a beacon of hope.",
            "sent5": "The soldier's disciplined bearing inspired his comrades."
        },
        {
            "definition": "The direction or position of a structure or vehicle",
            "pos": "noun",
            "sent1": "The map showed the correct bearing to reach the destination.",
            "sent2": "The ship's bearing was set towards the north.",
            "sent3": "The confused driver lost his bearing in the unfamiliar city.",
            "sent4": "The lighthouse provided a steady bearing for the ships in the storm.",
            "sent5": "The compass needle pointed to the correct bearing."
        },
        {
            "definition": "A machine part that supports another part and allows it to move",
            "pos": "noun",
            "sent1": "The wheel's bearing needed to be replaced for smooth rotation.",
            "sent2": "The skateboard's bearing helped it glide effortlessly.",
            "sent3": "The squeaky bearing in the engine made a funny noise.",
            "sent4": "The well-oiled bearing ensured the machine ran quietly.",
            "sent5": "The mechanic inspected the faulty bearing in the motor."
        },
        {
            "definition": "The act of producing offspring or giving birth",
            "pos": "noun",
            "sent1": "The bear's den was the perfect place for her bearing.",
            "sent2": "The mare showed signs of imminent bearing.",
            "sent3": "The zoo celebrated the panda's successful bearing.",
            "sent4": "The miracle of life is seen in every animal's bearing.",
            "sent5": "The documentary captured the beauty of a dolphin's bearing."
        }
    ]
}