{
    "term": "bear",
    "meanings": [
        {
            "definition": "To support or hold up",
            "pos": "verb",
            "sent1": "I can bear the weight of the books.",
            "sent2": "She helped bear the heavy box up the stairs.",
            "sent3": "The table legs bear the weight of the dishes without complaint.",
            "sent4": "His strong arms bear the burden effortlessly.",
            "sent5": "The bridge must bear the weight of the passing cars."
        },
        {
            "definition": "To endure or tolerate",
            "pos": "verb",
            "sent1": "I can bear the cold weather with my warm coat.",
            "sent2": "She couldn't bear the thought of leaving her friends behind.",
            "sent3": "He tried to bear the spicy food, but his mouth was on fire.",
            "sent4": "She had to bear the pain of losing her favorite toy.",
            "sent5": "The brave soldier could bear the hardships of war."
        },
        {
            "definition": "A large, heavy mammal with shaggy fur",
            "pos": "noun",
            "sent1": "The bear roamed the forest in search of food.",
            "sent2": "We saw a bear at the zoo last weekend.",
            "sent3": "The bear's fur looked fluffy and warm.",
            "sent4": "The bear's claws were sharp and powerful.",
            "sent5": "The bear hibernates during the winter months."
        },
        {
            "definition": "To give birth to",
            "pos": "verb",
            "sent1": "The mama bear will soon bear cubs.",
            "sent2": "She will bear a child in the spring.",
            "sent3": "The tree will bear fruit in the summer.",
            "sent4": "The flower will bear seeds for the next season.",
            "sent5": "The hen will bear chicks in the coop."
        },
        {
            "definition": "To carry or transport",
            "pos": "verb",
            "sent1": "I will bear the groceries home from the store.",
            "sent2": "She helped bear the load of firewood to the cabin.",
            "sent3": "The truck will bear the heavy equipment to the construction site.",
            "sent4": "The ship will bear the cargo across the ocean.",
            "sent5": "The horse will bear the rider through the meadow."
        }
    ]
}