{
    "term": "beat",
    "meanings": [
        {
            "definition": "To strike or hit repeatedly.",
            "pos": "verb",
            "sent1": "He would beat the drum loudly.",
            "sent2": "The boxer managed to beat his opponent in the ring.",
            "sent3": "The children tried to beat the rain by running faster.",
            "sent4": "Her heart began to beat rapidly with excitement.",
            "sent5": "The waves beat against the shore relentlessly."
        },
        {
            "definition": "To defeat or overcome.",
            "pos": "verb",
            "sent1": "She could beat anyone at chess.",
            "sent2": "The underdog team managed to beat the champions.",
            "sent3": "The clever detective would always beat the criminals at their own game.",
            "sent4": "His determination to succeed beat all obstacles in his path.",
            "sent5": "Their teamwork helped them beat the odds and emerge victorious."
        },
        {
            "definition": "A rhythmic pulse or pattern in music.",
            "pos": "noun",
            "sent1": "The song had a catchy beat that made everyone dance.",
            "sent2": "The drummer kept the beat steady throughout the performance.",
            "sent3": "The beat of the music echoed through the concert hall.",
            "sent4": "The beat of the drums set the pace for the entire band.",
            "sent5": "The beat of the music was so infectious, no one could resist tapping their feet."
        },
        {
            "definition": "To mix or stir vigorously.",
            "pos": "verb",
            "sent1": "She would beat the eggs until they were fluffy.",
            "sent2": "The chef instructed him to beat the batter for the cake.",
            "sent3": "He tried to beat the ingredients together but ended up making a mess.",
            "sent4": "The recipe called for him to beat the cream until stiff peaks formed.",
            "sent5": "The baker had to beat the dough vigorously to get the right consistency."
        },
        {
            "definition": "A regular route or patrol.",
            "pos": "noun",
            "sent1": "The police officer walked his beat every night.",
            "sent2": "The mail carrier followed his beat diligently.",
            "sent3": "The security guard's beat included all the important areas of the building.",
            "sent4": "The beat of the street was familiar to the residents.",
            "sent5": "The beat of the patrol kept the neighborhood safe and secure."
        }
    ]
}