{
    "term": "beclog",
    "meanings": [
        {
            "definition": "To hinder or obstruct with thick or sticky matter",
            "pos": "verb",
            "sent1": "The mud beclogs the wheels of the old cart, making it hard to move.",
            "sent2": "Leaves and debris beclog the drain, causing water to overflow.",
            "sent3": "Trying to run with shoes full of mud would be like trying to beclog a racehorse with glue!",
            "sent4": "Her mind felt beclogged with worries, slowing down her thoughts like molasses.",
            "sent5": "The thick fog beclogged the entire valley, making it impossible to see beyond a few feet."
        },
        {
            "definition": "To fill or block up with an accumulation of thick or sticky matter",
            "pos": "verb",
            "sent1": "The sink became beclogged with hair and soap scum, causing it to drain slowly.",
            "sent2": "Over time, dust and dirt can beclog the air filter of a car, affecting its performance.",
            "sent3": "The vacuum cleaner seemed to enjoy beclogging itself with stray threads, as if it were playing dress-up!",
            "sent4": "His arteries were beclogged with cholesterol, a ticking time bomb for his heart health.",
            "sent5": "The beehive entrance was beclogged with fallen leaves, making it difficult for the bees to come and go."
        },
        {
            "definition": "To encumber or burden with something difficult to move or progress",
            "pos": "verb",
            "sent1": "The heavy backpack beclogged her movements as she tried to climb the steep hill.",
            "sent2": "Emotional baggage can beclog a person's ability to move forward in life.",
            "sent3": "Carrying around unnecessary guilt is like beclogging your heart with rocks, weighing you down.",
            "sent4": "The bureaucracy beclogged the process, making it nearly impossible to get anything done quickly.",
            "sent5": "The clutter in her room beclogged her mind, making it hard to focus on anything else."
        }
    ]
}