{
    "term": "bedel",
    "meanings": [
        {
            "definition": "An official who carries out various ceremonial duties at a university.",
            "pos": "noun",
            "sent1": "The bedel led the procession of graduates during the graduation ceremony.",
            "sent2": "The university bedel ensured that all academic robes were in order for the event.",
            "sent3": "The bedel's hat flew off in the wind, causing a moment of laughter among the students.",
            "sent4": "As the bedel walked solemnly across the stage, it felt like a scene from a historical play.",
            "sent5": "The bedel's presence added a touch of tradition and grandeur to the university ceremony."
        },
        {
            "definition": "A person who supervises a church or cathedral.",
            "pos": "noun",
            "sent1": "The bedel oversaw the maintenance of the church grounds and buildings.",
            "sent2": "Every Sunday, the church bedel ensured that the pews were clean and ready for worshipers.",
            "sent3": "The mischievous children played hide-and-seek, trying to avoid the watchful eyes of the bedel.",
            "sent4": "The bedel's dedication to the church made them a pillar of the community.",
            "sent5": "The church bells rang, signaling the arrival of the bedel for their daily inspection."
        },
        {
            "definition": "A person who acts as a messenger or crier.",
            "pos": "noun",
            "sent1": "The bedel announced the important news to the villagers gathered in the square.",
            "sent2": "In medieval times, the bedel would proclaim the king's decrees to the townspeople.",
            "sent3": "The bedel's booming voice echoed through the streets, drawing attention to the upcoming festival.",
            "sent4": "Like a town crier, the bedel's voice carried far and wide, spreading the message effectively.",
            "sent5": "The bedel's role as a messenger brought them respect and recognition in the community."
        }
    ]
}