{
    "term": "behind",
    "meanings": [
        {
            "definition": "In or to the rear of; at the back of.",
            "pos": "preposition",
            "sent1": "The cat hid behind the couch.",
            "sent2": "She walked behind her friend.",
            "sent3": "The squirrel played a game of hide-and-seek behind the tree.",
            "sent4": "His true intentions always lurked behind his friendly smile.",
            "sent5": "The shadow loomed behind the door, causing a sense of unease."
        },
        {
            "definition": "In a place or situation that is further back or to the rear.",
            "pos": "adverb",
            "sent1": "He stayed behind to finish his homework.",
            "sent2": "The runner fell behind the others.",
            "sent3": "The magician made the rabbit disappear behind the curtain.",
            "sent4": "Her voice trailed behind her as she walked away.",
            "sent5": "The memories of childhood lingered behind in the old house."
        },
        {
            "definition": "In a position further back than someone or something else.",
            "pos": "adverb",
            "sent1": "The car lagged behind in the race.",
            "sent2": "The student sat behind the teacher.",
            "sent3": "The mischievous puppy snuck up behind the sleeping cat.",
            "sent4": "His thoughts always seemed to be one step behind reality.",
            "sent5": "The moon rose behind the mountains, casting a soft glow."
        },
        {
            "definition": "Late or slow in a specified context.",
            "pos": "adjective",
            "sent1": "The behind bus arrived after everyone had left.",
            "sent2": "She was always behind in completing her assignments.",
            "sent3": "The tortoise was known for its behind pace in the race.",
            "sent4": "His behind arrival caused a delay in the meeting.",
            "sent5": "The behind train chugged along the tracks, delayed by mechanical issues."
        }
    ]
}