{
    "term": "bejesus",
    "meanings": [
        {
            "definition": "Bejesus (noun): Used as an exclamation to express surprise or fear.",
            "pos": "noun, interjection",
            "sent1": "When the spider crawled out from under the bed, it scared the bejesus out of me!",
            "sent2": "I nearly jumped out of my skin when, bejesus, the lightning struck right outside the window.",
            "sent3": "The horror movie was so intense that every little noise made me shout 'bejesus!'",
            "sent4": "The haunted house tour was so realistic, it felt like the bejesus was actually haunting me.",
            "sent5": "The sudden clap of thunder made me scream 'bejesus' at the top of my lungs."
        },
        {
            "definition": "Bejesus (verb): To scare or startle someone.",
            "pos": "verb",
            "sent1": "The prankster loved to hide and jump out to bejesus his friends.",
            "sent2": "The unexpected noise managed to bejesus the cat, making it run away in a hurry.",
            "sent3": "His attempt to bejesus his little sister by wearing a monster mask backfired when she started laughing instead.",
            "sent4": "The horror movie bejesused me so much that I couldn't sleep without a nightlight.",
            "sent5": "The sudden appearance of the ghost in the play never failed to bejesus the audience."
        },
        {
            "definition": "Bejesus (adjective): Used to emphasize a feeling of fear or surprise.",
            "pos": "interjection",
            "sent1": "The roller coaster was so fast, it left me feeling bejesus exhilarated!",
            "sent2": "The magician's disappearing act was bejesus amazing to watch.",
            "sent3": "The haunted house decorations were bejesus spooky, but in a fun way.",
            "sent4": "The unexpected plot twist in the movie was bejesus shocking to everyone.",
            "sent5": "The surprise party thrown for her birthday left her feeling bejesus overwhelmed with joy."
        }
    ]
}