{
    "term": "belabouring",
    "meanings": [
        {
            "definition": "To explain or go over something in too much detail or to excess.",
            "pos": "verb",
            "sent1": "She kept belabouring the same point during the presentation, making it hard to follow.",
            "sent2": "The teacher spent the entire class belabouring the concept of fractions, causing the students to lose interest.",
            "sent3": "He was belabouring the instructions so much that everyone fell asleep.",
            "sent4": "Her words belabouring the issue felt like a never-ending lecture.",
            "sent5": "The book belabouring the history of the town was thicker than a dictionary."
        },
        {
            "definition": "To attack or criticize someone repeatedly or harshly.",
            "pos": "verb",
            "sent1": "The boss kept belabouring his employee for the mistake, making her feel terrible.",
            "sent2": "The tabloids enjoy belabouring celebrities for their fashion choices.",
            "sent3": "The comedian couldn't resist belabouring his friend's bad haircut in front of everyone.",
            "sent4": "The politician was belabouring his opponent's past scandals during the debate.",
            "sent5": "The bullies were belabouring the new kid with hurtful words."
        },
        {
            "definition": "To beat or hit someone repeatedly.",
            "pos": "verb",
            "sent1": "The boxer was belabouring his opponent in the ring, showing no mercy.",
            "sent2": "The abusive father was caught belabouring his child by the authorities.",
            "sent3": "The villain in the movie enjoyed belabouring his victims before the hero arrived.",
            "sent4": "The angry mob started belabouring the thief who tried to steal from them.",
            "sent5": "The bully was belabouring the smaller kid on the playground, causing distress to onlookers."
        }
    ]
}