{
    "term": "belah",
    "meanings": [
        {
            "definition": "To split or divide into two parts",
            "pos": "verb",
            "sent1": "She carefully belahed the cake in half.",
            "sent2": "The woodworker will belah the log to make two planks.",
            "sent3": "The magician belahed the scarf into two pieces, then magically made it whole again!",
            "sent4": "The storm seemed to belah the sky, splitting it into dark and light halves.",
            "sent5": "With a swift motion, he belahed the rope, separating it into two equal lengths."
        },
        {
            "definition": "A type of tree native to Australia",
            "pos": "noun",
            "sent1": "The belah tree provides shade in the hot Australian outback.",
            "sent2": "The leaves of the belah rustled in the gentle breeze.",
            "sent3": "The koala climbed the belah tree to reach the juicy eucalyptus leaves.",
            "sent4": "The belah tree stood tall like a guardian of the forest.",
            "sent5": "Under the belah tree, the kangaroos found shelter from the scorching sun."
        },
        {
            "definition": "A type of fishing net",
            "pos": "noun",
            "sent1": "The fishermen cast the belah into the water to catch fish.",
            "sent2": "The belah was carefully repaired after each fishing trip.",
            "sent3": "The mischievous seagull got tangled in the belah and had to be rescued.",
            "sent4": "The belah glimmered in the sunlight as it was pulled from the sea.",
            "sent5": "The old belah had many stories to tell of the fish it had caught."
        },
        {
            "definition": "A type of fishing boat",
            "pos": "noun",
            "sent1": "The belah sailed smoothly across the calm waters of the bay.",
            "sent2": "The fishermen loaded their catch onto the belah.",
            "sent3": "The belah creaked as it rocked gently in the harbor.",
            "sent4": "The belah's flag fluttered in the wind as it returned from a successful fishing trip.",
            "sent5": "The belah's hull gleamed in the sunlight, a testament to its care and maintenance."
        },
        {
            "definition": "A type of fishing technique involving a net and a boat",
            "pos": "noun",
            "sent1": "The belah method allowed the fishermen to catch a large haul.",
            "sent2": "The belah required skillful coordination between the crew members.",
            "sent3": "The belah maneuver was passed down through generations of fishermen.",
            "sent4": "The belah dance of net and boat was a sight to behold on the open sea.",
            "sent5": "The belah technique was both efficient and sustainable for the local fishing community."
        }
    ]
}