{
    "term": "belligerencies",
    "meanings": [
        {
            "definition": "Aggressive or warlike behavior",
            "pos": "noun",
            "sent1": "His constant belligerencies towards his classmates led to frequent conflicts.",
            "sent2": "The country's history is marked by periods of intense belligerencies.",
            "sent3": "During the game, his belligerencies on the field made everyone laugh.",
            "sent4": "The belligerencies between the two rival gangs were like a storm brewing in the city.",
            "sent5": "The teacher's strict belligerencies against cheating made a lasting impression on the students."
        },
        {
            "definition": "Acts of hostility or aggression",
            "pos": "noun",
            "sent1": "The soldier's belligerencies were evident in his fierce determination on the battlefield.",
            "sent2": "The escalating belligerencies between the two nations raised concerns globally.",
            "sent3": "His belligerencies in the debate competition surprised everyone with his boldness.",
            "sent4": "The belligerencies in the workplace were like a ticking time bomb waiting to explode.",
            "sent5": "The belligerencies in the courtroom created a tense atmosphere during the trial."
        },
        {
            "definition": "The state of being engaged in war or conflict",
            "pos": "noun",
            "sent1": "The country's belligerencies with its neighboring nations caused widespread fear.",
            "sent2": "The belligerencies in the region resulted in significant loss of life.",
            "sent3": "The belligerencies in the family over the remote control were comical yet intense.",
            "sent4": "The belligerencies in the political arena were like a chess game with high stakes.",
            "sent5": "The belligerencies in the animal kingdom showcased the struggle for dominance."
        }
    ]
}