{
    "term": "bellyboats",
    "meanings": [
        {
            "definition": "A small inflatable boat used for fishing or leisure activities.",
            "pos": "noun",
            "sent1": "The bellyboats glided smoothly across the water.",
            "sent2": "We took the bellyboats out on the lake for a relaxing day of fishing.",
            "sent3": "The bellyboats looked like colorful floating cushions on the lake.",
            "sent4": "The bellyboats were like little bubbles of fun bobbing on the water.",
            "sent5": "The bright red bellyboats stood out against the blue of the lake."
        },
        {
            "definition": "To go fishing in a bellyboat.",
            "pos": "verb",
            "sent1": "We love to bellyboat in the calm lake near our house.",
            "sent2": "Let's bellyboat together this weekend and catch some fish.",
            "sent3": "Bellyboating is a relaxing way to spend a sunny afternoon.",
            "sent4": "She bellyboats every Saturday, rain or shine.",
            "sent5": "I bellyboat to unwind and enjoy nature's beauty."
        },
        {
            "definition": "The bellyboat floated peacefully on the calm lake.",
            "pos": "noun",
            "sent1": "As the sun set, the bellyboat drifted lazily on the water.",
            "sent2": "The bellyboat gently rocked as the fisherman cast his line.",
            "sent3": "The bellyboat seemed to nap on the tranquil lake.",
            "sent4": "A family of ducks swam past the bellyboat without a care.",
            "sent5": "The bellyboat's reflection shimmered in the still water."
        },
        {
            "definition": "She purchased a new bellyboat for her upcoming fishing trip.",
            "pos": "noun",
            "sent1": "The shiny new bellyboat awaited its maiden voyage.",
            "sent2": "Her friends admired the sleek design of her new bellyboat.",
            "sent3": "The excited dog jumped into the bellyboat, mistaking it for a toy.",
            "sent4": "The bellyboat's bright colors matched her fishing gear perfectly.",
            "sent5": "She named her bellyboat 'Sunny' to bring good luck on her trips."
        }
    ]
}