{
    "term": "below",
    "meanings": [
        {
            "definition": "At a lower level or layer",
            "pos": "adverb",
            "sent1": "The fish swam below the surface of the water.",
            "sent2": "The treasure chest sank below the waves.",
            "sent3": "The mole dug a tunnel below the ground to hide its acorns.",
            "sent4": "The roots of the tree spread below the earth, seeking nutrients.",
            "sent5": "The temperature dropped below freezing, turning the water into ice."
        },
        {
            "definition": "In or to a lower position",
            "pos": "adverb",
            "sent1": "The cat climbed down from the tree and landed below.",
            "sent2": "The ball rolled below the table and out of reach.",
            "sent3": "The squirrel leaped from branch to branch, always aiming to land below.",
            "sent4": "The elevator descended below the ground floor, reaching the parking garage.",
            "sent5": "The airplane flew below the clouds, offering a clear view of the landscape."
        },
        {
            "definition": "Less than",
            "pos": "preposition",
            "sent1": "She had below ten dollars in her wallet after buying lunch.",
            "sent2": "The temperature outside was below freezing, making it a cold day.",
            "sent3": "The number of students absent was below the teacher's expectations.",
            "sent4": "The time taken to complete the race was below the previous record.",
            "sent5": "The noise level in the library was below acceptable levels for studying."
        },
        {
            "definition": "Underneath or beneath",
            "pos": "preposition",
            "sent1": "The dog hid its bone below the pile of leaves in the garden.",
            "sent2": "The keys were hidden below the doormat for safekeeping.",
            "sent3": "The treasure chest was buried below the 'X' marked on the map.",
            "sent4": "The rabbit dug a burrow below the old oak tree for shelter.",
            "sent5": "The pirate ship sailed below the surface, unseen by passing vessels."
        }
    ]
}