{
    "term": "belon",
    "meanings": [
        {
            "definition": "To have a rightful place in a particular group or category.",
            "pos": "verb",
            "sent1": "The new student belons in our class.",
            "sent2": "Every animal belons in its own habitat.",
            "sent3": "The puzzle piece belons perfectly in this spot.",
            "sent4": "Her voice belons on the stage, captivating the audience.",
            "sent5": "The key belons in the lock, turning smoothly."
        },
        {
            "definition": "To be owned by someone.",
            "pos": "verb",
            "sent1": "The shiny bike belons to my brother.",
            "sent2": "The old book belons to the library.",
            "sent3": "The lost toy belons to the child who finds it.",
            "sent4": "His heart belons to her, forever and always.",
            "sent5": "The beautiful painting belons in the art collector's gallery."
        },
        {
            "definition": "To be a member of a family or group.",
            "pos": "verb",
            "sent1": "The playful puppy belons to our family now.",
            "sent2": "She belons to the dance team and practices every day.",
            "sent3": "The mischievous cat belons to the neighborhood, causing trouble.",
            "sent4": "His loyalty belons to his friends, always there to support them.",
            "sent5": "The rare flower belons in the botanical garden, adding beauty."
        },
        {
            "definition": "To be suitable or appropriate for a particular purpose.",
            "pos": "verb",
            "sent1": "This tool belons for fixing that broken chair.",
            "sent2": "The warm coat belons for cold winter days.",
            "sent3": "The colorful paint belons for creating a masterpiece.",
            "sent4": "Her skills belon for leading the team to success.",
            "sent5": "The sharp knife belons for cutting through tough vegetables."
        }
    ]
}