{
    "term": "belted",
    "meanings": [
        {
            "definition": "Wearing a belt.",
            "pos": "adjective",
            "sent1": "The man in the suit looked very belted.",
            "sent2": "She always feels more put-together when she is belted.",
            "sent3": "The superhero's cape fluttered behind him, but his belted outfit stayed perfectly in place.",
            "sent4": "The belted dress accentuated her waist like a ribbon on a present.",
            "sent5": "The belted jacket completed his stylish look."
        },
        {
            "definition": "Struck with a belt.",
            "pos": "verb",
            "sent1": "He belted the punching bag with all his strength.",
            "sent2": "The naughty child was belted by his angry father.",
            "sent3": "The boxer belted the opponent so hard, they saw stars.",
            "sent4": "The storm belted the coast with powerful winds and rain.",
            "sent5": "She belted the high note in the song, impressing everyone."
        },
        {
            "definition": "Marked with a contrasting band of color.",
            "pos": "adjective",
            "sent1": "The bird had beautiful belted feathers.",
            "sent2": "The cat's fur was belted with stripes of black and white.",
            "sent3": "The car had a belted design that made it stand out on the road.",
            "sent4": "The sunset painted the sky in belted hues of pink and orange.",
            "sent5": "The book cover had a belted pattern that caught the eye."
        },
        {
            "definition": "Moved swiftly or forcefully.",
            "pos": "adverb",
            "sent1": "The car belted down the highway at top speed.",
            "sent2": "She belted out the song with passion and emotion.",
            "sent3": "The football player belted across the field to score a touchdown.",
            "sent4": "The wind belted through the trees, causing them to sway.",
            "sent5": "The train belted past the platform, leaving a trail of dust behind."
        }
    ]
}