{
    "term": "belt",
    "meanings": [
        {
            "definition": "A strip of leather or other material worn around the waist to support clothing or hold weapons.",
            "pos": "noun",
            "sent1": "She tightened her belt before heading out for a walk.",
            "sent2": "His belt matched his shoes perfectly.",
            "sent3": "The belt held up his pants but also doubled as a fashion statement.",
            "sent4": "The belt of the forest seemed to stretch endlessly.",
            "sent5": "The cowboy's belt gleamed in the sunlight as he rode into town."
        },
        {
            "definition": "A continuous band of material used to transmit motion or power.",
            "pos": "noun",
            "sent1": "The conveyor belt moved the packages along swiftly.",
            "sent2": "The engine's timing belt needed to be replaced.",
            "sent3": "The belt of electricity powered the entire factory.",
            "sent4": "The belt of wind turbines hummed in the distance.",
            "sent5": "The belt of gears turned smoothly, transferring energy efficiently."
        },
        {
            "definition": "A blow or stroke with a belt.",
            "pos": "noun",
            "sent1": "He received a belt on the backside for misbehaving.",
            "sent2": "The wrestler delivered a powerful belt to his opponent.",
            "sent3": "The playful belt on the shoulder made him jump in surprise.",
            "sent4": "The belt of the ruler echoed through the classroom, silencing everyone.",
            "sent5": "The belt of the drum reverberated through the concert hall."
        },
        {
            "definition": "A geographical region or area.",
            "pos": "noun",
            "sent1": "The tropical belt is known for its lush vegetation.",
            "sent2": "The desert belt stretches for miles under the scorching sun.",
            "sent3": "The belt of farmland provided a picturesque view from above.",
            "sent4": "The mountain belt was a challenging terrain for hikers.",
            "sent5": "The coastal belt offered stunning views of the ocean."
        }
    ]
}