{
    "term": "bending",
    "meanings": [
        {
            "definition": "Curving or flexing",
            "pos": "adjective",
            "sent1": "The bending tree swayed gently in the wind.",
            "sent2": "She admired the bending river as it flowed gracefully.",
            "sent3": "The bending road seemed to play hide and seek with the travelers.",
            "sent4": "His bending smile lit up the room with warmth.",
            "sent5": "The bending flower reached towards the sunlight, seeking its warmth."
        },
        {
            "definition": "Inclining or leaning",
            "pos": "adjective",
            "sent1": "The bending tower stood tall against the sky.",
            "sent2": "The bending tree leaned towards the sunlight.",
            "sent3": "The bending chair looked like it was whispering secrets to the table.",
            "sent4": "The bending shadow elongated as the sun began to set.",
            "sent5": "The bending mountain sloped gently towards the valley below."
        },
        {
            "definition": "Changing direction or shape by force",
            "pos": "verb",
            "sent1": "He was bending the metal to create a new sculpture.",
            "sent2": "The strong wind was bending the branches of the trees.",
            "sent3": "She was bending the rules to win the game.",
            "sent4": "The river was bending around the rocks in its path.",
            "sent5": "The artist was bending the wire into intricate shapes for the artwork."
        },
        {
            "definition": "Adapting or yielding to pressure",
            "pos": "adjective",
            "sent1": "The bending reed swayed with the breeze.",
            "sent2": "The bending grass flattened under the weight of the snow.",
            "sent3": "The bending student adjusted quickly to the new school.",
            "sent4": "The bending tree branches bowed under the weight of the snow.",
            "sent5": "The bending fabric stretched to accommodate the movement of the dancer."
        }
    ]
}