{
    "term": "benefices",
    "meanings": [
        {
            "definition": "An endowed church office granting a stipend to a clergyman.",
            "pos": "noun",
            "sent1": "The bishop received a benefices for his dedicated service to the church.",
            "sent2": "The benefices of the parish priest included a small house and a monthly salary.",
            "sent3": "The benefices of the church treasurer were so generous that he could afford to buy a new car.",
            "sent4": "In the world of church benefices, the position of archdeacon was considered the most prestigious.",
            "sent5": "The benefices of the chaplain were so abundant that he could afford to donate to charity regularly."
        },
        {
            "definition": "A church living with an income attached.",
            "pos": "noun",
            "sent1": "The small village church was a benefices that supported the local priest.",
            "sent2": "The benefices of the cathedral provided a comfortable livelihood for the bishop.",
            "sent3": "The benefices of the church were so fruitful that the priest could afford to renovate the building.",
            "sent4": "The benefices of the abbey were like a steady stream of financial support for the monks.",
            "sent5": "The benefices of the parish were crucial for the financial stability of the church community."
        },
        {
            "definition": "A church office or position that yields an income.",
            "pos": "noun",
            "sent1": "The benefices of the church secretary included managing the finances of the parish.",
            "sent2": "The bishop appointed a new clergyman to the benefices of the vacant church office.",
            "sent3": "The benefices of the church treasurer were so substantial that he could afford to travel abroad.",
            "sent4": "The benefices of the archdeacon were like a steady source of income for his family.",
            "sent5": "The benefices of the chaplain were essential for the financial stability of the church."
        }
    ]
}