{
    "term": "berdaches",
    "meanings": [
        {
            "definition": "A person who identifies with a gender different from their biological sex.",
            "pos": "noun",
            "sent1": "The berdaches in the tribe were respected for their unique perspective on gender.",
            "sent2": "The community embraced the berdaches for their courage in expressing their true selves.",
            "sent3": "At the festival, the berdaches added a touch of mystery and intrigue to the celebration.",
            "sent4": "The berdaches were like colorful butterflies, bringing diversity to the social fabric.",
            "sent5": "The berdaches' presence was a reminder of the fluidity of gender identity."
        },
        {
            "definition": "To engage in a non-binary gender identity.",
            "pos": "verb",
            "sent1": "She decided to berdaches openly, breaking free from societal norms.",
            "sent2": "They berdaches with confidence, unapologetically being themselves.",
            "sent3": "The friends laughed as they playfully berdaches during the costume party.",
            "sent4": "He berdaches like a chameleon, adapting to different gender expressions effortlessly.",
            "sent5": "Berdaching allows individuals to explore beyond traditional gender boundaries."
        },
        {
            "definition": "The practice of adopting a gender role different from one's biological sex.",
            "pos": "noun",
            "sent1": "The berdaches in history challenged conventional gender expectations.",
            "sent2": "In some cultures, berdaches played important roles in spiritual ceremonies.",
            "sent3": "The theater production featured a comedic twist with the berdaches' role.",
            "sent4": "Her decision to embrace the berdaches lifestyle was met with understanding and support.",
            "sent5": "The concept of berdaches highlights the complexity of gender identity."
        }
    ]
}