{
    "term": "beriberis",
    "meanings": [
        {
            "definition": "A disease caused by a deficiency of vitamin B1.",
            "pos": "noun",
            "sent1": "My grandmother suffered from beriberis due to a lack of vitamin B1.",
            "sent2": "Doctors diagnosed the patient with beriberis after observing symptoms of vitamin B1 deficiency.",
            "sent3": "The comedy show joked about a fictional character who believed he had beriberis from eating too much candy.",
            "sent4": "In the story, the evil wizard cast a spell causing the kingdom to be plagued by beriberis, representing a lack of essential nutrients.",
            "sent5": "The image of a wilted flower served as a vivid metaphor for the effects of beriberis on the body."
        },
        {
            "definition": "A plant of the genus Berberis.",
            "pos": "noun",
            "sent1": "The garden center sells various types of beriberis for landscaping.",
            "sent2": "The botanist identified the rare beriberis species in the forest.",
            "sent3": "The children enjoyed playing hide-and-seek among the beriberis bushes.",
            "sent4": "The beriberis plant stood out in the garden with its vibrant red leaves.",
            "sent5": "The aroma of the blooming beriberis filled the air with a sweet fragrance."
        },
        {
            "definition": "The fruit of the berberis plant.",
            "pos": "noun",
            "sent1": "The chef used fresh beriberis in the dessert recipe.",
            "sent2": "The market had a special sale on ripe beriberis fruits.",
            "sent3": "The squirrel happily nibbled on the juicy beriberis it found in the garden.",
            "sent4": "The smooth texture of the beriberis fruit made it a delightful addition to the salad.",
            "sent5": "The vibrant color of the beriberis fruit made it visually appealing in the fruit basket."
        }
    ]
}