{
    "term": "berms",
    "meanings": [
        {
            "definition": "A flat strip of land, raised bank, or terrace bordering a river or canal.",
            "pos": "noun",
            "sent1": "The berms along the river provided a nice place to sit and watch the water flow.",
            "sent2": "The cyclists rode along the berm next to the canal, enjoying the view.",
            "sent3": "The ducks waddled along the berm, pretending to be on a grand adventure.",
            "sent4": "The berm stood like a loyal guardian, protecting the river from flooding.",
            "sent5": "The colorful flowers bloomed on the berm, creating a beautiful border for the waterway."
        },
        {
            "definition": "A narrow ledge or shelf, typically at the top or bottom of a slope.",
            "pos": "noun",
            "sent1": "She carefully balanced on the berm at the edge of the hill.",
            "sent2": "The hiker paused on the berm to catch his breath and admire the view.",
            "sent3": "The squirrel scampered along the berm, looking for a cozy spot to rest.",
            "sent4": "The berm jutted out like a tiny stage, offering a perfect spot for a photo.",
            "sent5": "The berm acted as a natural barrier, preventing the rocks from rolling down the slope."
        },
        {
            "definition": "A mound or bank of earth, especially one along the edge of a road or path.",
            "pos": "noun",
            "sent1": "The berm next to the trail was covered in wildflowers, adding a splash of color.",
            "sent2": "Children loved to roll down the grassy berm next to the road.",
            "sent3": "The berm seemed to whisper secrets to those who walked by, enticing them to explore.",
            "sent4": "The berm loomed like a giant wave frozen in time, ready to crash onto the road.",
            "sent5": "The berm served as a natural barrier, protecting the path from erosion."
        }
    ]
}