{
    "term": "berthas",
    "meanings": [
        {
            "definition": "A type of large, white, lace collar worn by women in the late 19th century.",
            "pos": "noun",
            "sent1": "She wore a beautiful berthas with her elegant dress.",
            "sent2": "The vintage dress had intricate berthas around the neckline.",
            "sent3": "The playful kitten got tangled in the delicate berthas hanging on the chair.",
            "sent4": "Her laughter echoed through the room, bouncing off the berthas like waves.",
            "sent5": "The sunlight danced on the berthas, creating a mesmerizing pattern."
        },
        {
            "definition": "A type of large, white, lace collar worn by women in the late 19th century.",
            "pos": "noun",
            "sent1": "During the play, the actress wore a stunning berthas that caught everyone's attention.",
            "sent2": "In the old photograph, the lady's berthas added a touch of elegance to her outfit.",
            "sent3": "The mischievous puppy tried to play with the dangling berthas, thinking it was a toy.",
            "sent4": "Her words wrapped around my heart like the delicate strands of a berthas.",
            "sent5": "The wind gently lifted the berthas, making it seem like it had a life of its own."
        },
        {
            "definition": "A type of large, white, lace collar worn by women in the late 19th century.",
            "pos": "noun",
            "sent1": "The seamstress carefully stitched the intricate berthas onto the dress.",
            "sent2": "At the costume party, many guests wore elaborate berthas to match the theme.",
            "sent3": "The curious child mistook the berthas for a fancy napkin and tried to wipe their hands on it.",
            "sent4": "Her smile was as delicate and intricate as the lace on the berthas.",
            "sent5": "The moonlight cast a soft glow on the berthas, making it look ethereal."
        }
    ]
}