{
    "term": "betray",
    "meanings": [
        {
            "definition": "To be disloyal or unfaithful to someone's trust or confidence.",
            "pos": "verb",
            "sent1": "She decided to betray her friend by sharing their secret with others.",
            "sent2": "It is wrong to betray a friend's trust by spreading rumors about them.",
            "sent3": "The mischievous squirrel tried to betray the trust of the birds by stealing their food.",
            "sent4": "The dark clouds seemed to betray the sunny weather forecast for the picnic.",
            "sent5": "The flickering candlelight seemed to betray the stillness of the night."
        },
        {
            "definition": "To reveal or disclose confidential information.",
            "pos": "verb",
            "sent1": "He accidentally betrayed the surprise party by mentioning it to the birthday girl.",
            "sent2": "It is important not to betray sensitive information that could harm others.",
            "sent3": "The leaking faucet seemed to betray the quietness of the night with its constant drip.",
            "sent4": "The old map seemed to betray the hidden treasure's location with its faded markings.",
            "sent5": "The shy child's blush seemed to betray their embarrassment in front of the class."
        },
        {
            "definition": "To deliver or expose to an enemy by treachery or disloyalty.",
            "pos": "verb",
            "sent1": "The spy planned to betray the secret documents to the enemy during the night.",
            "sent2": "It is dangerous to betray vital information to those who wish harm upon us.",
            "sent3": "The mischievous cat seemed to betray the mouse's hiding spot to the dog.",
            "sent4": "The creaking floorboards seemed to betray the burglar's presence in the dark house.",
            "sent5": "The loud thunder seemed to betray the calmness of the afternoon."
        }
    ]
}