{
    "term": "bezoars",
    "meanings": [
        {
            "definition": "A mass found trapped in the gastrointestinal system, usually formed from hair or vegetable fibers.",
            "pos": "noun",
            "sent1": "The doctor discovered bezoars in the patient's stomach during the surgery.",
            "sent2": "The vet removed bezoars from the cat's intestines to prevent blockage.",
            "sent3": "The bezoars in the stomach looked like a tangled mess of hair and fibers.",
            "sent4": "Her fear of spiders felt like a bezoar, hardening in her stomach.",
            "sent5": "The image of bezoars stuck in the digestive system haunted his dreams."
        },
        {
            "definition": "A mass found in the stomach or intestines of certain animals, believed to have medicinal properties.",
            "pos": "noun",
            "sent1": "The folklore mentioned bezoars as magical stones with healing powers.",
            "sent2": "The ancient texts described bezoars as treasures found in animals.",
            "sent3": "The villagers believed the bezoars could cure any ailment, from a cold to a broken bone.",
            "sent4": "Her laughter was like a bezoar, bringing healing and joy to all around her.",
            "sent5": "The bezoars were said to hold the secrets of nature's medicine within them."
        },
        {
            "definition": "A hard mass formed in the stomach, often due to the ingestion of foreign material.",
            "pos": "noun",
            "sent1": "The bezoars in the goat's stomach were causing discomfort and indigestion.",
            "sent2": "The farmer knew the importance of preventing bezoars in his livestock.",
            "sent3": "The bezoars in the cow's stomach clumped together like a rock collection.",
            "sent4": "His guilt felt like a bezoar, heavy and indigestible in his gut.",
            "sent5": "The bezoars formed a barrier in the stomach, blocking the normal digestive process."
        }
    ]
}