{
    "term": "bhaktas",
    "meanings": [
        {
            "definition": "Devotees or followers of a particular deity or guru.",
            "pos": "noun",
            "sent1": "The bhaktas gathered at the temple to offer their prayers.",
            "sent2": "Many bhaktas visit the ashram regularly to seek spiritual guidance.",
            "sent3": "The bhaktas joked that their devotion was so strong, they could move mountains.",
            "sent4": "Her love for the guru was like a beacon, guiding the bhaktas through life's storms.",
            "sent5": "The bhaktas' unwavering faith inspired others to join their spiritual journey."
        },
        {
            "definition": "Those who practice devotion or worship towards a higher power.",
            "pos": "noun",
            "sent1": "In the quiet of the night, the bhaktas whispered their prayers to the stars.",
            "sent2": "The bhaktas' songs of devotion echoed through the temple halls.",
            "sent3": "The bhaktas playfully argued about who could pray the longest without a break.",
            "sent4": "The bhaktas' devotion was a flame that never flickered, even in the strongest winds.",
            "sent5": "The bhaktas' worship was a river flowing steadily towards the ocean of divinity."
        },
        {
            "definition": "Individuals who show deep love and reverence towards a spiritual figure.",
            "pos": "noun",
            "sent1": "The bhaktas' eyes shone with adoration as they listened to the guru's teachings.",
            "sent2": "Each of the bhaktas carried a small token of their spiritual leader's blessings.",
            "sent3": "The bhaktas teased each other about who blushed the most in the guru's presence.",
            "sent4": "The guru's wisdom was a lighthouse guiding the bhaktas through the darkness.",
            "sent5": "The bhaktas' reverence for their spiritual figure was a garden of blooming flowers in their hearts."
        }
    ]
}