{
    "term": "bibliophilism",
    "meanings": [
        {
            "definition": "The love of books.",
            "pos": "noun",
            "sent1": "Her bibliophilism was evident from the way she cherished her book collection.",
            "sent2": "John's bibliophilism led him to spend hours browsing through the bookstore.",
            "sent3": "Sarah's bibliophilism was so strong that she even dreamed of books at night.",
            "sent4": "His bibliophilism was like a flame that never flickered, always burning bright.",
            "sent5": "The bibliophilism in her eyes shone like a beacon, guiding her to new literary treasures."
        },
        {
            "definition": "A person who loves books.",
            "pos": "noun",
            "sent1": "As a bibliophilism, he was always eager to discuss his favorite novels.",
            "sent2": "The bibliophilism spent hours in the library, surrounded by the scent of old books.",
            "sent3": "The bibliophilism's excitement upon entering a bookstore was contagious.",
            "sent4": "She was a bibliophilism in a world of digital readers, standing out with her love for physical books.",
            "sent5": "The bibliophilism's eyes sparkled with joy as they scanned the shelves for new reads."
        },
        {
            "definition": "The practice of collecting books.",
            "pos": "noun",
            "sent1": "His bibliophilism extended to meticulously organizing his book collection.",
            "sent2": "The bibliophilism's shelves were filled to the brim with books of all genres.",
            "sent3": "The bibliophilism's hobby of collecting books sometimes led to overflowing bookcases.",
            "sent4": "Her bibliophilism was so intense that she never missed a chance to add a new book to her collection.",
            "sent5": "The bibliophilism's dedication to the practice of collecting books was unmatched, with each book carefully chosen and cherished."
        }
    ]
}