{
    "term": "bigeminy",
    "meanings": [
        {
            "definition": "Arranged in pairs.",
            "pos": "adjective",
            "sent1": "The flowers in the garden were bigeminy, with each color appearing in pairs.",
            "sent2": "The twins wore bigeminy outfits, matching from head to toe.",
            "sent3": "The bigeminy pattern on the wallpaper made the room look organized and neat.",
            "sent4": "The bigeminy rows of trees along the path created a symmetrical and pleasing view.",
            "sent5": "The bigeminy stripes on the shirt made it look stylish and trendy."
        },
        {
            "definition": "Occurring in pairs.",
            "pos": "adjective",
            "sent1": "The bigeminy stars in the sky twinkled together, creating a beautiful sight.",
            "sent2": "The bigeminy clouds floated side by side, casting shadows on the ground.",
            "sent3": "The bigeminy birds flew in perfect harmony, like synchronized dancers in the sky.",
            "sent4": "The bigeminy footsteps echoed in the hallway, signaling the arrival of the guests.",
            "sent5": "The bigeminy candles on the table illuminated the room with a warm glow."
        },
        {
            "definition": "A condition in which every other beat of the heart is a premature contraction.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with bigeminy after noticing the irregular heartbeats.",
            "sent2": "The ECG showed signs of bigeminy, indicating a potential heart rhythm issue.",
            "sent3": "Despite the seriousness of the diagnosis, the patient joked about having a 'skip-a-beat' bigeminy heart.",
            "sent4": "The bigeminy rhythm of the heart played a discordant tune, causing concern for the medical team.",
            "sent5": "The bigeminy heartbeat sounded like a drum with an unpredictable rhythm, keeping the patient on edge."
        }
    ]
}