{
    "term": "bilking",
    "meanings": [
        {
            "definition": "Cheat or defraud (someone) of money.",
            "pos": "verb",
            "sent1": "The scammer was bilking unsuspecting victims out of their savings.",
            "sent2": "He was caught bilking customers by overcharging them for unnecessary repairs.",
            "sent3": "The sneaky thief thought he could keep bilking people without getting caught.",
            "sent4": "Her smooth talk and false promises were like a magician's trick, bilking people out of their hard-earned cash.",
            "sent5": "The con artist's elaborate scheme was designed to bilk innocent individuals of their money."
        },
        {
            "definition": "Evade payment of (a debt or obligation).",
            "pos": "verb",
            "sent1": "She tried bilking her landlord by avoiding rent payments.",
            "sent2": "The debtor was known for bilking creditors by constantly changing addresses.",
            "sent3": "The clever fox managed to bilk his way out of repaying the favor.",
            "sent4": "His excuses for not paying back the loan were like a shield, bilking him from financial responsibility.",
            "sent5": "The slippery businessman was always finding new ways to bilk his way out of debts."
        },
        {
            "definition": "Avoid paying (a fare or charge).",
            "pos": "verb",
            "sent1": "The fare dodger was caught bilking the bus driver by sneaking on without paying.",
            "sent2": "He thought he could bilk the system by pretending to forget his wallet every time he needed to pay.",
            "sent3": "The sly passenger tried to bilk his way onto the train without a ticket.",
            "sent4": "Her strategy of pretending to be distracted was a clever way to bilk the toll booth attendant.",
            "sent5": "The teenager's attempt to bilk his way through the subway turnstile failed when he got caught."
        }
    ]
}