{
    "term": "bilk",
    "meanings": [
        {
            "definition": "Cheat or defraud",
            "pos": "verb",
            "sent1": "The sneaky salesman tried to bilk unsuspecting customers by selling them fake products.",
            "sent2": "The con artist managed to bilk many people out of their hard-earned money through his elaborate schemes.",
            "sent3": "The mischievous cat tried to bilk the dog out of its treat by distracting it with a toy.",
            "sent4": "The cunning fox was able to bilk the farmer by pretending to be injured near the chicken coop.",
            "sent5": "The magician's illusion was so convincing that it seemed like he could bilk time itself."
        },
        {
            "definition": "Evade payment",
            "pos": "verb",
            "sent1": "The restaurant patron tried to bilk the waiter by leaving without paying for the meal.",
            "sent2": "The dishonest customer attempted to bilk the shop owner by running out without settling the bill.",
            "sent3": "The mischievous student tried to bilk the cafeteria by sneaking out without paying for the lunch.",
            "sent4": "The crafty debtor managed to bilk the creditor by disappearing before the payment was due.",
            "sent5": "The elusive thief seemed to be able to bilk the authorities at every turn."
        },
        {
            "definition": "Deceive or swindle",
            "pos": "verb",
            "sent1": "The scammer was able to bilk many innocent people by promising them fake rewards.",
            "sent2": "The fraudster's smooth talk allowed him to bilk numerous individuals out of their savings.",
            "sent3": "The playful raccoon tried to bilk the birds out of their food by pretending to be their friend.",
            "sent4": "The clever imposter managed to bilk the wealthy heiress out of her inheritance.",
            "sent5": "The illusionist's performance was so convincing that it seemed like he could bilk reality itself."
        }
    ]
}