{
    "term": "bill",
    "meanings": [
        {
            "definition": "A statement of money owed for goods or services provided.",
            "pos": "noun",
            "sent1": "I received a bill for my new shoes.",
            "sent2": "The restaurant gave us the bill after we finished our meal.",
            "sent3": "The bill for the ice cream was so high, I almost fainted!",
            "sent4": "The bill stared at me from the table, reminding me of my spending.",
            "sent5": "The bill glared at me, demanding to be paid immediately."
        },
        {
            "definition": "A proposed law presented to a legislative body for consideration.",
            "pos": "noun",
            "sent1": "The senator introduced a bill to improve healthcare.",
            "sent2": "The bill on education reform was discussed in the parliament.",
            "sent3": "The bill to make ice cream mandatory was met with laughter.",
            "sent4": "The bill to ban homework seemed like a dream come true.",
            "sent5": "The bill to plant more trees was a step towards a greener future."
        },
        {
            "definition": "The beak of a bird.",
            "pos": "noun",
            "sent1": "The bird used its bill to catch a worm.",
            "sent2": "The colorful bird had a long, curved bill.",
            "sent3": "The bird's bill looked like a sharp weapon ready for battle.",
            "sent4": "The bill of the bird shone brightly in the sunlight.",
            "sent5": "The bill of the bird was perfect for pecking at seeds."
        },
        {
            "definition": "A written list of items or charges.",
            "pos": "noun",
            "sent1": "I made a bill of all the groceries we need to buy.",
            "sent2": "The bill included the cost of the repairs and parts.",
            "sent3": "The bill listed every single item we bought, even the snacks.",
            "sent4": "The bill of items seemed longer than I expected.",
            "sent5": "The bill of charges made me realize how much I spent."
        },
        {
            "definition": "A piece of paper money.",
            "pos": "noun",
            "sent1": "I exchanged my bill for coins at the bank.",
            "sent2": "The vending machine only accepted bills, not coins.",
            "sent3": "The bill was crumpled in my pocket, waiting to be spent.",
            "sent4": "The bill in my wallet was the last one I had left.",
            "sent5": "The bill felt crisp and new, untouched by hands."
        }
    ]
}