{
    "term": "billy",
    "meanings": [
        {
            "definition": "A metal container used for boiling water or cooking over a campfire.",
            "pos": "noun",
            "sent1": "We filled the billy with water to make hot cocoa while camping.",
            "sent2": "The billy was placed on the fire to heat up the soup.",
            "sent3": "Tom accidentally dropped the billy, spilling water everywhere.",
            "sent4": "Her laughter bubbled over like water in a billy on the fire.",
            "sent5": "The billy gleamed in the sunlight, ready for cooking."
        },
        {
            "definition": "A male given name.",
            "pos": "noun",
            "sent1": "Billy is excited to start his new job next week.",
            "sent2": "My uncle's name is Billy, and he loves to fish.",
            "sent3": "Billy told a joke that made everyone laugh at the party.",
            "sent4": "His smile lit up the room like a beam of sunshine on Billy's face.",
            "sent5": "We all gathered to celebrate Billy's birthday with cake and balloons."
        },
        {
            "definition": "A club or bat used as a weapon.",
            "pos": "noun",
            "sent1": "The robber threatened the victim with a billy to steal the wallet.",
            "sent2": "The security guard carried a billy for protection during the night shift.",
            "sent3": "In the play, the villain wielded a billy to intimidate the hero.",
            "sent4": "His words hit her heart like a billy, leaving a lasting impact.",
            "sent5": "The billy swung through the air, ready to defend against any danger."
        },
        {
            "definition": "A slang term for a police officer.",
            "pos": "noun",
            "sent1": "Billy helped direct traffic during the busy intersection hours.",
            "sent2": "The kids waved at Officer Billy as he patrolled the neighborhood.",
            "sent3": "When Billy arrived, the party quieted down, knowing the police were here.",
            "sent4": "The presence of Billy on the street made everyone feel safer.",
            "sent5": "Billy's badge shone in the light, a symbol of protection and service."
        }
    ]
}