{
    "term": "bind",
    "meanings": [
        {
            "definition": "To tie or fasten something tightly",
            "pos": "verb",
            "sent1": "I need to bind the papers together with a rubber band.",
            "sent2": "She used a rope to bind the boxes securely.",
            "sent3": "The mischievous puppy tried to bind its tail to the chair with a ribbon.",
            "sent4": "The magical spell seemed to bind the two objects together.",
            "sent5": "The strong adhesive can bind the pieces instantly."
        },
        {
            "definition": "To form a close relationship or connection",
            "pos": "verb",
            "sent1": "Their shared love for music helped bind them as friends.",
            "sent2": "The experience of traveling together can bind people closely.",
            "sent3": "The funny incident at the party seemed to bind them even more.",
            "sent4": "Music has the power to bind hearts across cultures.",
            "sent5": "The heartfelt conversation helped bind their friendship forever."
        },
        {
            "definition": "To make a formal agreement or commitment",
            "pos": "verb",
            "sent1": "They will bind the contract with their signatures.",
            "sent2": "The handshake was a way to bind their business deal.",
            "sent3": "The ancient ritual was used to bind the two kingdoms in peace.",
            "sent4": "The legal document will bind them to their promises.",
            "sent5": "The oath taken will bind them to their duties."
        },
        {
            "definition": "To cause someone to feel restricted or obligated",
            "pos": "verb",
            "sent1": "The strict rules can bind employees to follow certain procedures.",
            "sent2": "The heavy workload can bind workers to long hours.",
            "sent3": "The unexpected favor might bind him to return the kindness.",
            "sent4": "The sense of duty can bind individuals to their responsibilities.",
            "sent5": "The promise made will bind her to keep her word."
        }
    ]
}