{
    "term": "bingos",
    "meanings": [
        {
            "definition": "A game of chance in which each player matches numbers on their card with numbers drawn by a caller.",
            "pos": "noun",
            "sent1": "During the bingos game, everyone eagerly waits to see if their numbers match the ones called.",
            "sent2": "My grandma loves playing bingos at the community center every Friday night.",
            "sent3": "At the family reunion, the bingos game got so intense that even the quietest relatives started cheering.",
            "sent4": "The bingos of fate aligned perfectly, leading to an unexpected win for the underdog player.",
            "sent5": "The colorful bingos cards filled the room with excitement and anticipation."
        },
        {
            "definition": "A call made by a player who completes a row, column, or diagonal on their card in the game of bingo.",
            "pos": "noun",
            "sent1": "With a loud bingos, Sarah signaled that she had completed a full row on her card.",
            "sent2": "The winning bingos echoed through the hall, declaring a victorious player.",
            "sent3": "As soon as the final bingos was called, the room erupted in cheers and applause.",
            "sent4": "The bingos of triumph rang out, marking the end of an intense round of bingo.",
            "sent5": "The decisive bingos announced the winner, bringing an end to the suspenseful game."
        },
        {
            "definition": "Used to express excitement or satisfaction when achieving a goal or success.",
            "pos": "interjection",
            "sent1": "Bingos! I finally finished my project ahead of schedule.",
            "sent2": "After acing the test, she exclaimed, 'Bingos!' with a big smile.",
            "sent3": "When the team won the championship, the coach shouted 'Bingos!' in celebration.",
            "sent4": "Bingos! The surprise party was a huge success, much to everyone's delight.",
            "sent5": "With a loud 'Bingos!', he completed the final piece of the puzzle and jumped with joy."
        }
    ]
}