{
    "term": "biopirates",
    "meanings": [
        {
            "definition": "Biopirates: individuals who illegally exploit genetic resources or traditional knowledge for profit.",
            "pos": "noun",
            "sent1": "The biopirates were caught stealing plants from the forest.",
            "sent2": "The authorities arrested the biopirates for taking rare animal DNA without permission.",
            "sent3": "The biopirates tried to sell secret plant information, but no one was interested.",
            "sent4": "The biopirates plundered the genetic treasure trove of the rainforest.",
            "sent5": "The biopirates' greed for genetic riches knew no bounds."
        },
        {
            "definition": "Biopirates: to engage in the unauthorized collection or use of biological resources.",
            "pos": "verb",
            "sent1": "Do not biopirates the rare flowers from the protected area.",
            "sent2": "The company was fined for biopirating medicinal herbs from the national park.",
            "sent3": "The scientist jokingly said he would biopirate the lab's petri dishes for his experiment.",
            "sent4": "She felt like a biopirate as she snuck out the rare butterfly specimen.",
            "sent5": "The explorer's mission was to biopirate the undiscovered plant species."
        },
        {
            "definition": "Biopirates: the act of stealing or misappropriating biological materials or information.",
            "pos": "noun",
            "sent1": "The biopirates' theft of the rare seeds was discovered by the researchers.",
            "sent2": "The biopirates were known for their illegal trade in exotic animal specimens.",
            "sent3": "The biopirates' attempt to take the DNA samples was foiled by the lab security.",
            "sent4": "The biopirates' black market for genetic data was shut down by the authorities.",
            "sent5": "The biopirates' scheme to smuggle out the valuable plant samples failed miserably."
        }
    ]
}