{
    "term": "birls",
    "meanings": [
        {
            "definition": "To spin or cause to spin rapidly.",
            "pos": "verb",
            "sent1": "She birls around in her twirly dress.",
            "sent2": "The colorful pinwheel birls in the breeze.",
            "sent3": "The dancer birls so fast, she looks like a blur!",
            "sent4": "Time birls by quickly when you're having fun.",
            "sent5": "The tornado birls through the town, causing chaos.",
            "sent6": "The little girl birls happily in the playground.",
            "sent7": "The fan birls above, cooling the room.",
            "sent8": "The ice skater birls gracefully on the frozen pond."
        },
        {
            "definition": "A spinning motion or movement.",
            "pos": "noun",
            "sent1": "The birls of the spinning top fascinated the child.",
            "sent2": "The birls of the carousel made her dizzy.",
            "sent3": "The birls of the ballerina's tutu added to her performance.",
            "sent4": "The birls of the hurricane caused widespread destruction.",
            "sent5": "The birls of the planets around the sun create the solar system.",
            "sent6": "The birls of the record player filled the room with music.",
            "sent7": "The birls of the merry-go-round delighted the children at the park.",
            "sent8": "The birls of the clock's hands marked the passing of time."
        },
        {
            "definition": "A spinning top or toy.",
            "pos": "noun",
            "sent1": "He played with the birls for hours, mesmerized by their movement.",
            "sent2": "The children raced their birls down the hill.",
            "sent3": "The birls spun faster and faster as the string unwound.",
            "sent4": "The colorful birls sparkled in the sunlight.",
            "sent5": "The wooden birls clattered as they spun on the floor.",
            "sent6": "The metal birls gleamed in the toy store's display.",
            "sent7": "The birls whirred as they spun on the tabletop.",
            "sent8": "The birls collided with a clatter, creating a playful chaos."
        }
    ]
}