{
    "term": "bitch",
    "meanings": [
        {
            "definition": "A female dog",
            "pos": "noun",
            "sent1": "My neighbor's dog had puppies, and one of them is a cute little bitch.",
            "sent2": "The bitch ran happily in the park with its owner.",
            "sent3": "The little bitch wagged its tail excitedly when it saw its favorite toy.",
            "sent4": "The bitch's bark echoed through the neighborhood, alerting everyone.",
            "sent5": "I remember the mischievous antics of the little bitch as it played in the garden."
        },
        {
            "definition": "A malicious or unpleasant woman",
            "pos": "noun",
            "sent1": "She always spread rumors about others, making her a real bitch.",
            "sent2": "The movie portrayed the villain as a heartless bitch who enjoyed others' suffering.",
            "sent3": "The mean girl at school acted like a total bitch, but deep down, she was just insecure.",
            "sent4": "Her sharp words stung like a bee, proving she was a true bitch.",
            "sent5": "The boss was a real bitch, always criticizing and never appreciating hard work."
        },
        {
            "definition": "To complain or whine",
            "pos": "verb",
            "sent1": "Stop bitching about the weather; we can't change it!",
            "sent2": "She tends to bitch about everything, even the smallest inconveniences.",
            "sent3": "I can't help but laugh when you bitch about having to do chores.",
            "sent4": "Instead of bitching, let's find a solution to the problem.",
            "sent5": "He would always bitch about his job, but never took steps to improve it."
        },
        {
            "definition": "To act in a spiteful or aggressive manner",
            "pos": "verb",
            "sent1": "She tends to bitch at anyone who disagrees with her.",
            "sent2": "The cat will bitch at the dog if it comes too close to its food.",
            "sent3": "The siblings would often bitch at each other over trivial matters.",
            "sent4": "He would bitch at his teammates whenever they made a mistake.",
            "sent5": "The boss would constantly bitch at his employees, creating a tense work environment."
        }
    ]
}