{
    "term": "bite",
    "meanings": [
        {
            "definition": "To use the teeth to cut into something",
            "pos": "verb",
            "sent1": "The puppy will bite the bone to chew it.",
            "sent2": "I always bite my sandwich before eating it.",
            "sent3": "Don't bite more than you can chew!",
            "sent4": "The cold wind seemed to bite through my jacket.",
            "sent5": "The memory of her words would always bite at him."
        },
        {
            "definition": "A wound made by biting",
            "pos": "noun",
            "sent1": "The doctor treated the dog's bite on my hand.",
            "sent2": "The mosquito bite was itchy and annoying.",
            "sent3": "He joked that the cookie had a bite of revenge in it.",
            "sent4": "The snake's bite injected venom into its prey.",
            "sent5": "The bite mark on the apple showed where it had been eaten."
        },
        {
            "definition": "A small amount of food",
            "pos": "noun",
            "sent1": "She took a bite of the chocolate bar.",
            "sent2": "I offered him a bite of my sandwich.",
            "sent3": "The bite of the cake was surprisingly sweet.",
            "sent4": "The spicy salsa had a real bite to it.",
            "sent5": "The bite of the apple was crisp and refreshing."
        },
        {
            "definition": "A firm grip or hold",
            "pos": "noun",
            "sent1": "He had a strong bite on the rope to pull it up.",
            "sent2": "The suitcase handle had a good bite for carrying.",
            "sent3": "The cat's bite on the toy showed its playfulness.",
            "sent4": "The vice had a tight bite on the metal rod.",
            "sent5": "The wrestler had a fierce bite on his opponent."
        },
        {
            "definition": "A sharp or pungent taste",
            "pos": "noun",
            "sent1": "The mustard had a spicy bite to it.",
            "sent2": "The cheese had a tangy bite that I enjoyed.",
            "sent3": "The salsa had a bite that made her eyes water.",
            "sent4": "The wine had a bite that lingered on the palate.",
            "sent5": "The ginger had a strong bite that cleared his sinuses."
        }
    ]
}