{
    "term": "blackfaces",
    "meanings": [
        {
            "definition": "The plural form of blackface.",
            "pos": "noun",
            "sent1": "In the play, the actors wore blackfaces to portray different characters.",
            "sent2": "The theater company decided to ban the use of blackfaces in their productions.",
            "sent3": "The comedy skit featured a mix-up where two characters accidentally swapped their blackfaces.",
            "sent4": "The use of blackfaces in performances has sparked controversy and debates.",
            "sent5": "The image of blackfaces on stage left a lasting impact on the audience."
        },
        {
            "definition": "A type of makeup used by non-black performers to portray a black person, often considered offensive.",
            "pos": "noun",
            "sent1": "During the historical play, the actors applied blackfaces to transform into historical figures.",
            "sent2": "The use of blackfaces in old movies is now seen as inappropriate and disrespectful.",
            "sent3": "The actor's clumsy application of blackfaces led to a comical mishap on stage.",
            "sent4": "The controversy surrounding the use of blackfaces in entertainment continues to be a topic of discussion.",
            "sent5": "The offensive nature of blackfaces in performances cannot be overlooked."
        },
        {
            "definition": "A type of theatrical performance in which performers wear blackface makeup.",
            "pos": "noun",
            "sent1": "The traditional minstrel show often featured performers in blackfaces singing and dancing.",
            "sent2": "The use of blackfaces in theater has a long history dating back to the 19th century.",
            "sent3": "The actors' exaggerated expressions behind their blackfaces added a humorous touch to the show.",
            "sent4": "The impact of blackfaces in theater reflects the problematic history of racial stereotypes.",
            "sent5": "The sight of performers in blackfaces evoked mixed reactions from the audience."
        }
    ]
}