{
    "term": "blackdamps",
    "meanings": [
        {
            "definition": "A noun: A type of gas found in coal mines that consists mainly of carbon dioxide and nitrogen and can be deadly if inhaled.",
            "pos": "noun",
            "sent1": "Miners always carry equipment to detect blackdamps in the mine.",
            "sent2": "The presence of blackdamps in the coal mine posed a serious threat to the workers.",
            "sent3": "The canary in the coal mine started singing when it sensed blackdamps, warning the miners with its melody.",
            "sent4": "The blackdamps lurking in the depths of the mine whispered danger with every breath.",
            "sent5": "The blackdamps crept silently through the tunnels, waiting to claim its next victim.",
            "sent6": "Despite the warnings, some miners ventured into the dark tunnels unaware of the lurking blackdamps.",
            "sent7": "The miners knew the importance of proper ventilation to prevent the accumulation of blackdamps in the mine.",
            "sent8": "The miners' safety training included recognizing the signs of blackdamps and taking immediate action.",
            "sent9": "The miners' families anxiously awaited their return, hoping they had not encountered any blackdamps underground.",
            "sent10": "The blackdamps clouded the air, creating an invisible threat that kept the miners on edge."
        },
        {
            "definition": "A verb: To be affected by or exposed to blackdamps.",
            "pos": "noun",
            "sent1": "The miners feared being blackdamps during their shifts.",
            "sent2": "After the incident, the rescue team rushed to help those blackdamps in the mine.",
            "sent3": "The idea of being blackdamps seemed like a distant possibility until it became a reality for the trapped miners.",
            "sent4": "The risk of blackdamps loomed over the miners like a dark cloud, reminding them of the dangers below.",
            "sent5": "The miners' faces paled as they realized they were about to blackdamps in the underground chambers.",
            "sent6": "The miners knew the importance of staying vigilant to avoid blackdamps during their work.",
            "sent7": "The miners' families prayed for their loved ones' safety, hoping they would not blackdamps during their shifts.",
            "sent8": "The miners' training emphasized the procedures to follow if they were to blackdamps in the mine.",
            "sent9": "The miners' determination to never blackdamps fueled their commitment to safety measures.",
            "sent10": "The thought of blackdamps lingered in the miners' minds, a constant reminder of the risks they faced daily."
        }
    ]
}