{
    "term": "blackface",
    "meanings": [
        {
            "definition": "The makeup used by a non-black performer playing a black role in a theatrical performance.",
            "pos": "noun",
            "sent1": "In the play, the actor wore blackface to look like a different person.",
            "sent2": "The use of blackface in the theater has a controversial history.",
            "sent3": "The comedian accidentally used blackface makeup for a clown act, causing laughter in the audience.",
            "sent4": "Her blackface transformation on stage was like a mask hiding her true identity.",
            "sent5": "The blackface makeup made the actor unrecognizable under the bright lights."
        },
        {
            "definition": "A form of theatrical makeup used by non-black performers to represent a black person.",
            "pos": "noun",
            "sent1": "The actor applied blackface to accurately portray the character's ethnicity.",
            "sent2": "Using blackface in performances can be seen as disrespectful.",
            "sent3": "The actor's blackface application was so realistic that it fooled the audience.",
            "sent4": "The blackface on the actor's face transformed him into a different individual.",
            "sent5": "The use of blackface helped the actor embody the character more convincingly."
        },
        {
            "definition": "A style of makeup used by non-black performers to portray a black character.",
            "pos": "noun",
            "sent1": "The use of blackface in the movie was criticized for perpetuating stereotypes.",
            "sent2": "Actors need to be mindful when using blackface to avoid causing offense.",
            "sent3": "The blackface makeup tutorial went viral on social media for its detailed instructions.",
            "sent4": "The actor's blackface transformation was a powerful visual statement in the play.",
            "sent5": "The blackface application was essential for the actor to accurately depict the character."
        }
    ]
}