{
    "term": "blackout",
    "meanings": [
        {
            "definition": "A temporary loss of consciousness or memory.",
            "pos": "noun",
            "sent1": "During the movie, the character experienced a blackout and couldn't remember what happened next.",
            "sent2": "After the accident, he had a blackout and woke up in the hospital with no memory of the crash.",
            "sent3": "When the student fell asleep during the lecture, it was like a blackout for his brain.",
            "sent4": "Her mind went into a blackout as she tried to recall the events of the previous night.",
            "sent5": "The blackout left him disoriented and confused, unable to piece together what had occurred."
        },
        {
            "definition": "A period during which all lights are turned off.",
            "pos": "noun",
            "sent1": "During the blackout, the entire neighborhood was plunged into darkness.",
            "sent2": "The blackout lasted for hours, causing inconvenience to everyone in the building.",
            "sent3": "As a prank, they decided to organize a blackout during the surprise party.",
            "sent4": "The blackout turned the bustling city into a quiet, shadowy landscape.",
            "sent5": "The blackout created a sense of mystery and excitement as people navigated the dark streets."
        },
        {
            "definition": "A suppression or censorship of information.",
            "pos": "noun",
            "sent1": "The government imposed a blackout on the news coverage of the protest to control the narrative.",
            "sent2": "During wartime, there was a blackout on sensitive information to protect national security.",
            "sent3": "The blackout on social media posts about the event only fueled curiosity among the public.",
            "sent4": "The blackout on the controversial article sparked a debate on freedom of speech.",
            "sent5": "The blackout on the scandalous details only increased public interest in the story."
        }
    ]
}