{
    "term": "blacks",
    "meanings": [
        {
            "definition": "Of the darkest color owing to the absence of or complete absorption of light.",
            "pos": "adjective",
            "sent1": "The room was so dark that it appeared blacks to me.",
            "sent2": "The night sky was filled with twinkling stars against a blacks background.",
            "sent3": "The cat thought it could hide in the blacks corner, but its tail gave it away.",
            "sent4": "His mood turned as blacks as a storm cloud when he heard the bad news.",
            "sent5": "The forest was shrouded in blacks shadows, creating an eerie atmosphere."
        },
        {
            "definition": "A member of a dark-skinned people, especially one of African or Australian Aboriginal ancestry.",
            "pos": "noun",
            "sent1": "The museum displayed a painting of ancient blacks from a distant land.",
            "sent2": "She met a group of friendly blacks at the community center.",
            "sent3": "The mischievous child pretended to be a mysterious blacks from a faraway land.",
            "sent4": "In the sea of faces, she spotted a familiar blacks waving at her.",
            "sent5": "The history book detailed the struggles faced by the early blacks settlers."
        },
        {
            "definition": "A dark substance or colorant used to darken or color something.",
            "pos": "noun",
            "sent1": "The artist mixed different shades to create a unique blacks for the painting.",
            "sent2": "She spilled some blacks on her shirt while working on the art project.",
            "sent3": "The chef accidentally added too much blacks to the soup, turning it inedible.",
            "sent4": "The ink in the pen was a deep blacks, perfect for writing important documents.",
            "sent5": "The hairdresser recommended a touch of blacks to enhance the natural color of her hair."
        }
    ]
}