{
    "term": "blackballing",
    "meanings": [
        {
            "definition": "To exclude someone from a group or organization by voting against them.",
            "pos": "verb",
            "sent1": "The members were blackballing the new applicant from joining their club.",
            "sent2": "The group decided to blackball the proposal, preventing it from moving forward.",
            "sent3": "The idea of blackballing the noisy neighbor from the block party was met with chuckles.",
            "sent4": "Her constant gossiping led to others blackballing her from social gatherings.",
            "sent5": "The act of blackballing can create feelings of isolation and exclusion."
        },
        {
            "definition": "A negative vote or veto used to exclude someone from a group.",
            "pos": "noun",
            "sent1": "The blackballing of the candidate was a clear sign of disapproval from the team.",
            "sent2": "Receiving a blackballing can be disheartening for those seeking acceptance.",
            "sent3": "The cat's blackballing of the new dog in the house led to some playful rivalry.",
            "sent4": "The blackballing in the election highlighted the divisions within the community.",
            "sent5": "The power of a single blackballing can sway the group's decision significantly."
        },
        {
            "definition": "The act of rejecting or ostracizing someone.",
            "pos": "noun",
            "sent1": "The blackballing of the student made them feel unwelcome in the class.",
            "sent2": "Witnessing the blackballing of a friend can be emotionally challenging.",
            "sent3": "The blackballing of the unpopular team member was seen as a harsh but necessary action.",
            "sent4": "In the world of social media, online blackballing can happen swiftly and without warning.",
            "sent5": "The community's blackballing of the troublemaker aimed to maintain peace and order."
        }
    ]
}