{
    "term": "bladders",
    "meanings": [
        {
            "definition": "A membranous sac or organ that stores fluid, such as urine.",
            "pos": "noun",
            "sent1": "The doctor explained that the patient's bladders were full and needed to be emptied.",
            "sent2": "She felt a sharp pain in her bladders when she held her urine for too long.",
            "sent3": "The bladders in the body are like tiny water balloons that need to be emptied regularly.",
            "sent4": "His bladders seemed to be as full as a water tank ready to burst.",
            "sent5": "The bladders in the body are like storage tanks for waste fluid."
        },
        {
            "definition": "A container made of flexible material that can be filled with air or gas.",
            "pos": "noun",
            "sent1": "The children played with colorful bladders at the birthday party, tossing them in the air.",
            "sent2": "The hot air balloon had large bladders that helped it stay afloat in the sky.",
            "sent3": "The bladders used for camping were so light that they could be carried easily.",
            "sent4": "The bladders of the inflatable boat kept it buoyant on the water.",
            "sent5": "She blew up the bladders of the life jacket before going for a swim."
        },
        {
            "definition": "A bladder-like structure in certain plants that stores water or nutrients.",
            "pos": "noun",
            "sent1": "The cactus has specialized bladders that store water to survive in the desert.",
            "sent2": "The pitcher plant has bladders that trap insects for nutrients.",
            "sent3": "The plant's bladders were like tiny water reservoirs, keeping it hydrated.",
            "sent4": "The bladders of the plant were like secret storage units for essential nutrients.",
            "sent5": "The bladder-like structures in the plant were like hidden treasure chests of sustenance."
        }
    ]
}