{
    "term": "bladder",
    "meanings": [
        {
            "definition": "A membranous sac in humans and other animals, in which urine is collected for excretion.",
            "pos": "noun",
            "sent1": "The doctor examined the patient's bladder to check for any issues.",
            "sent2": "After drinking a lot of water, I felt my bladder was full and needed to use the restroom.",
            "sent3": "The bladder decided it was time to empty itself right in the middle of the important meeting.",
            "sent4": "Her bladder felt like a balloon about to burst from holding in so much liquid.",
            "sent5": "The sound of water trickling into the bladder echoed in the quiet room."
        },
        {
            "definition": "A bag or pouch in certain animals, such as a fish bladder or a frog bladder.",
            "pos": "noun",
            "sent1": "The fish's bladder helps it control its buoyancy in the water.",
            "sent2": "The frog's bladder stores excess water to prevent dehydration.",
            "sent3": "The bladder of the frog seemed to be magically expanding as it swallowed the water.",
            "sent4": "The fish's bladder acted like a tiny balloon keeping it afloat in the ocean.",
            "sent5": "The bladder of the frog resembled a small water balloon under its skin."
        },
        {
            "definition": "A flexible container used for holding liquids, such as a water bladder or a wine bladder.",
            "pos": "noun",
            "sent1": "Hikers often carry a water bladder to stay hydrated during long treks.",
            "sent2": "The wine bladder was filled with the finest vintage for the special occasion.",
            "sent3": "The water bladder seemed to have a mind of its own, leaking at the most inconvenient times.",
            "sent4": "The wine bladder was like a treasure chest holding the key to a great celebration.",
            "sent5": "The water bladder sloshed as she ran, reminding her to take a sip and stay refreshed."
        }
    ]
}