{
    "term": "blades",
    "meanings": [
        {
            "definition": "The flat cutting part of a knife or tool",
            "pos": "noun",
            "sent1": "She carefully sharpened the blades of her scissors.",
            "sent2": "The chef used the blades of the knife to chop vegetables.",
            "sent3": "The blades of the lawnmower were so sharp they could slice through grass like butter.",
            "sent4": "His words were as cutting as the blades of a knife.",
            "sent5": "The blades gleamed in the sunlight, ready for any cutting task."
        },
        {
            "definition": "The flat, wide part of an oar",
            "pos": "noun",
            "sent1": "The rower dipped the blades of the oars into the water.",
            "sent2": "The blades of the oar helped propel the boat forward.",
            "sent3": "The blades of the oar splashed water playfully as they moved through the lake.",
            "sent4": "The blades of the oar sliced through the calm water with ease.",
            "sent5": "The blades of the oar glistened with each stroke against the water."
        },
        {
            "definition": "The rotating part of a wind turbine",
            "pos": "noun",
            "sent1": "The blades of the wind turbine spun gracefully in the wind.",
            "sent2": "The energy was generated as the blades of the turbine rotated.",
            "sent3": "The blades of the wind turbine hummed a soothing tune as they turned.",
            "sent4": "The blades of the wind turbine danced in the breeze, harnessing power.",
            "sent5": "The blades of the wind turbine sliced through the air, capturing energy."
        },
        {
            "definition": "The sharp edges of a sword or knife",
            "pos": "noun",
            "sent1": "The warrior's sword gleamed with deadly blades.",
            "sent2": "The blades of the knife were honed to perfection.",
            "sent3": "The blades of the sword whispered a sharp song as they cut through the air.",
            "sent4": "The blades of the knife were as swift as a striking snake.",
            "sent5": "The blades of the sword left a trail of sparks in their wake."
        }
    ]
}