{
    "term": "blasts",
    "meanings": [
        {
            "definition": "A sudden, intense gust of wind.",
            "pos": "noun",
            "sent1": "The powerful blasts of wind knocked down the trees.",
            "sent2": "I heard a loud blasts of wind outside my window.",
            "sent3": "The blasts of wind made my umbrella turn inside out!",
            "sent4": "The blasts of wind were like invisible giants pushing against us.",
            "sent5": "The blasts of wind felt like a slap on the face."
        },
        {
            "definition": "A loud, sudden sound or noise.",
            "pos": "noun",
            "sent1": "The unexpected blasts of thunder startled the children.",
            "sent2": "The blasts of music from the concert could be heard from miles away.",
            "sent3": "The blasts of laughter filled the room with joy.",
            "sent4": "The blasts of noise were like a symphony of chaos.",
            "sent5": "The blasts of sound echoed through the empty hallways."
        },
        {
            "definition": "An explosion or burst of air, sound, or light.",
            "pos": "noun",
            "sent1": "The fireworks display ended with colorful blasts in the sky.",
            "sent2": "The sudden blasts of light illuminated the dark room.",
            "sent3": "The blasts of confetti made the party even more festive.",
            "sent4": "The blasts of fireworks painted the night sky with vibrant colors.",
            "sent5": "The blasts of light were like a magical show in the sky."
        },
        {
            "definition": "To hit or strike with great force.",
            "pos": "verb",
            "sent1": "He blasts the ball with all his might towards the goal.",
            "sent2": "The construction workers use dynamite to blasts through the rocks.",
            "sent3": "She blasts the pinata open with one strong swing.",
            "sent4": "The boxer blasts his opponent with a powerful punch.",
            "sent5": "The storm blasts the trees, bending them in the wind."
        },
        {
            "definition": "To criticize or attack harshly.",
            "pos": "verb",
            "sent1": "The journalist blasts the government for their actions.",
            "sent2": "She blasts her teammates for not putting in enough effort.",
            "sent3": "He blasts his own cooking skills after burning the dinner.",
            "sent4": "The coach blasts the players for their lack of teamwork.",
            "sent5": "The teacher blasts the students for not completing their assignments."
        }
    ]
}