{
    "term": "blastomycosis",
    "meanings": [
        {
            "definition": "A fungal infection caused by inhaling spores of Blastomyces dermatitidis.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with blastomycosis after finding fungal spores in their lungs.",
            "sent2": "Many people in the area were affected by blastomycosis after inhaling the spores.",
            "sent3": "The blastomycosis in the lungs decided to throw a party, inviting all the other fungi for a dance.",
            "sent4": "The blastomycosis crept through the body like a silent invader, causing havoc along the way.",
            "sent5": "The blastomycosis infection spread rapidly, resembling a wildfire in the lungs."
        },
        {
            "definition": "The disease caused by Blastomyces dermatitidis, characterized by lung infection and potential spread to other organs.",
            "pos": "noun",
            "sent1": "The hospital treated several cases of blastomycosis, each with severe lung infections.",
            "sent2": "Blastomycosis can be a serious illness if not detected and treated early.",
            "sent3": "The blastomycosis disease decided to take a vacation, leaving the lungs in peace for a while.",
            "sent4": "The blastomycosis disease spread through the body like a dark shadow, affecting everything in its path.",
            "sent5": "The blastomycosis disease lurked in the lungs, waiting to strike at any moment."
        },
        {
            "definition": "The presence of Blastomyces dermatitidis in the body, leading to symptoms of blastomycosis.",
            "pos": "noun",
            "sent1": "The doctor confirmed the blastomycosis in the patient's body, causing concern for their health.",
            "sent2": "The presence of blastomycosis was detected through specific tests for fungal infections.",
            "sent3": "The blastomycosis in the body decided to play hide and seek with the immune system.",
            "sent4": "The blastomycosis silently multiplied, like a hidden army preparing for battle.",
            "sent5": "The blastomycosis presence felt like a heavy weight on the patient's chest, making breathing difficult."
        }
    ]
}