{
    "term": "blasties",
    "meanings": [
        {
            "definition": "A sudden and violent gust of wind.",
            "pos": "noun",
            "sent1": "The blasties knocked over the trash cans.",
            "sent2": "I heard the blasties howling outside my window.",
            "sent3": "The blasties messed up my hair, making me look like a wild animal.",
            "sent4": "The blasties of wind tore through the trees like a raging beast.",
            "sent5": "The blasties felt like a powerful force of nature, unstoppable and fierce."
        },
        {
            "definition": "A loud, sudden sound or noise.",
            "pos": "noun",
            "sent1": "The blasties of thunder made me jump.",
            "sent2": "The blasties of fireworks lit up the night sky.",
            "sent3": "The blasties of laughter filled the room with joy.",
            "sent4": "The blasties of music echoed through the concert hall.",
            "sent5": "The blasties of the car horn startled the pedestrians."
        },
        {
            "definition": "A type of explosive device.",
            "pos": "noun",
            "sent1": "The soldiers used blasties to clear the path.",
            "sent2": "The blasties detonated with a deafening boom.",
            "sent3": "The blasties in the action movie were so unrealistic, they made me laugh.",
            "sent4": "The blasties in the war zone created chaos and destruction.",
            "sent5": "The blasties were carefully placed to demolish the old building."
        },
        {
            "definition": "A feeling of intense pleasure or excitement.",
            "pos": "noun",
            "sent1": "The blasties of joy filled her heart.",
            "sent2": "Winning the game brought blasties of happiness.",
            "sent3": "The blasties of excitement bubbled up inside him like fizzy soda.",
            "sent4": "Her heart felt the blasties of delight like fireworks exploding.",
            "sent5": "The blasties of pleasure washed over her like a warm wave."
        }
    ]
}