{
    "term": "blastholes",
    "meanings": [
        {
            "definition": "A hole drilled in rock or earth for the purpose of blasting.",
            "pos": "noun",
            "sent1": "The miners carefully inspected the blastholes before setting off the explosion.",
            "sent2": "The construction crew drilled several blastholes in the quarry to prepare for the controlled explosion.",
            "sent3": "The curious squirrel peeked into the blastholes, wondering what treasures might be hidden inside.",
            "sent4": "The blastholes in the mountain resembled tiny mouths waiting to devour the rocks.",
            "sent5": "The echo of the blast reverberated through the blastholes, creating a thunderous symphony."
        },
        {
            "definition": "The act of drilling holes for explosives.",
            "pos": "noun",
            "sent1": "The team's expertise in creating precise blastholes ensured the success of the mining operation.",
            "sent2": "Safety protocols required all workers to wear helmets during blastholes drilling.",
            "sent3": "The competition for the fastest blastholes drilling time was fierce among the workers.",
            "sent4": "The rhythmic sound of the drill echoed through the valley as the blastholes were carefully created.",
            "sent5": "The foreman's skillful hands swiftly maneuvered the drill, creating perfect blastholes in record time."
        },
        {
            "definition": "The location where explosives are placed for blasting.",
            "pos": "noun",
            "sent1": "The engineers marked the blastholes with caution tape to prevent any accidents.",
            "sent2": "The detonation team carefully inserted the explosives into the designated blastholes.",
            "sent3": "The birds perched on the edge of the blastholes, unaware of the impending explosion.",
            "sent4": "The sun cast long shadows over the barren landscape, highlighting the rows of blastholes waiting to be ignited.",
            "sent5": "The anticipation built as the countdown began, each second bringing the blastholes closer to detonation."
        }
    ]
}