{
    "term": "blastings",
    "meanings": [
        {
            "definition": "The act of using explosives to break up rock or other materials.",
            "pos": "noun",
            "sent1": "During the blastings at the construction site, the rocks were shattered into smaller pieces.",
            "sent2": "The blastings in the mine were necessary to extract the valuable minerals.",
            "sent3": "The blastings were so powerful that even the ground seemed to shake in fear.",
            "sent4": "The blastings echoed through the valley like thunder in the sky.",
            "sent5": "The blastings created a spectacular display of flying debris and dust."
        },
        {
            "definition": "A sudden and intense gust of wind.",
            "pos": "noun",
            "sent1": "The blastings of wind knocked over the fragile umbrella on the beach.",
            "sent2": "The blastings of wind made the trees sway violently in the storm.",
            "sent3": "The blastings of wind caught everyone by surprise, causing chaos in the park.",
            "sent4": "The blastings of wind seemed to carry whispers of secrets from afar.",
            "sent5": "The blastings of wind felt like a powerful force of nature awakening."
        },
        {
            "definition": "A harsh or loud noise.",
            "pos": "noun",
            "sent1": "The blastings of music from the concert could be heard from miles away.",
            "sent2": "The blastings of thunder shook the windows of the house.",
            "sent3": "The blastings of laughter filled the room with joy and happiness.",
            "sent4": "The blastings of fireworks lit up the night sky with colorful bursts.",
            "sent5": "The blastings of the alarm clock jolted him awake in the morning."
        },
        {
            "definition": "The act of criticizing or attacking someone harshly.",
            "pos": "noun",
            "sent1": "Her blastings of criticism left him feeling defeated and discouraged.",
            "sent2": "The blastings of insults from the bully were hurtful and mean.",
            "sent3": "The blastings of complaints from the customer made the waiter's day difficult.",
            "sent4": "The blastings of negativity seemed to cloud the room with tension.",
            "sent5": "The blastings of accusations were like arrows aimed at his reputation."
        }
    ]
}