{
    "term": "blastomycoses",
    "meanings": [
        {
            "definition": "A fungal infection caused by Blastomyces dermatitidis.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with blastomycoses after examining the skin infection.",
            "sent2": "The blastomycoses spread rapidly through the patient's body, causing severe symptoms.",
            "sent3": "The blastomycoses decided to throw a party in the patient's lungs, much to the doctor's surprise.",
            "sent4": "The blastomycoses crept through the body like invisible invaders, causing chaos within.",
            "sent5": "The image of blastomycoses invading the body haunted the patient's dreams."
        },
        {
            "definition": "The presence of Blastomyces dermatitidis in the body.",
            "pos": "noun",
            "sent1": "The doctor confirmed the blastomycoses in the patient's lungs through a series of tests.",
            "sent2": "The blastomycoses were detected in the body during a routine check-up.",
            "sent3": "The blastomycoses in the body seemed to be having a dance party, according to the test results.",
            "sent4": "The blastomycoses lurking in the body were like hidden spies waiting to cause trouble.",
            "sent5": "The presence of blastomycoses in the body was a concerning discovery for the medical team."
        },
        {
            "definition": "The disease caused by Blastomyces dermatitidis.",
            "pos": "noun",
            "sent1": "The patient was suffering from a severe case of blastomycoses, requiring immediate treatment.",
            "sent2": "The disease caused by blastomycoses was spreading rapidly in the community.",
            "sent3": "The blastomycoses disease seemed to have a sense of humor, affecting only the most adventurous individuals.",
            "sent4": "The blastomycoses disease ravaged the town like a fierce storm, leaving no one untouched.",
            "sent5": "The impact of blastomycoses disease on the population was a cause for great concern among health officials."
        }
    ]
}