{
    "term": "blaster",
    "meanings": [
        {
            "definition": "A device used to emit a powerful stream of air or gas.",
            "pos": "noun",
            "sent1": "The blaster helped clean the dusty room with a strong gust of air.",
            "sent2": "The mechanic used the blaster to blow away debris from the engine.",
            "sent3": "The blaster accidentally blew away the papers on the desk.",
            "sent4": "Her laughter was like a blaster, filling the room with joy.",
            "sent5": "The blaster roared to life, pushing the balloon across the room."
        },
        {
            "definition": "A person who operates a blaster.",
            "pos": "noun",
            "sent1": "The blaster expert knew exactly how to handle the machine.",
            "sent2": "The blaster carefully aimed at the target before firing.",
            "sent3": "The blaster's quick reflexes saved the day during the competition.",
            "sent4": "She was a blaster in the field, always hitting the bullseye.",
            "sent5": "The blaster's precision was unmatched, hitting the target dead center."
        },
        {
            "definition": "A powerful explosive weapon.",
            "pos": "noun",
            "sent1": "The soldiers carried a blaster to defend against enemy attacks.",
            "sent2": "The blaster's impact left a trail of destruction in its wake.",
            "sent3": "The blaster's explosion startled the birds in the nearby trees.",
            "sent4": "His words were like a blaster, shattering her confidence.",
            "sent5": "The blaster's blast echoed through the canyon, signaling victory."
        },
        {
            "definition": "A loud, energetic person.",
            "pos": "noun",
            "sent1": "The blaster at the party kept everyone entertained with jokes.",
            "sent2": "The blaster's enthusiasm was contagious, spreading smiles around.",
            "sent3": "The blaster's laughter filled the room, making everyone join in.",
            "sent4": "Her energy was like a blaster, lighting up the room with excitement.",
            "sent5": "The blaster's voice boomed across the field, rallying the team."
        }
    ]
}