{
    "term": "blast",
    "meanings": [
        {
            "definition": "A sudden and violent gust of wind.",
            "pos": "noun",
            "sent1": "The blast of wind knocked over the trash cans.",
            "sent2": "I heard a loud blast of wind outside my window.",
            "sent3": "The blast of wind made my umbrella turn inside out!",
            "sent4": "The blast of wind felt like a powerful force of nature.",
            "sent5": "The sudden blast of wind caught everyone by surprise."
        },
        {
            "definition": "A loud, sudden, and sharp sound.",
            "pos": "noun",
            "sent1": "The blast of the horn startled the pedestrians.",
            "sent2": "The fireworks made a loud blast in the sky.",
            "sent3": "The blast of the whistle signaled the end of the game.",
            "sent4": "The blast of the music filled the room with energy.",
            "sent5": "The sudden blast of thunder made everyone jump."
        },
        {
            "definition": "To explode or destroy with explosives.",
            "pos": "verb",
            "sent1": "The workers will blast the rocks to clear the path.",
            "sent2": "The demolition team will blast the old building tomorrow.",
            "sent3": "I accidentally blasted the cake in the microwave!",
            "sent4": "The explosion blasted debris in all directions.",
            "sent5": "The fireworks blasted colorful lights into the sky."
        },
        {
            "definition": "To criticize harshly or vehemently.",
            "pos": "verb",
            "sent1": "The coach will blast the team for their poor performance.",
            "sent2": "The journalist blasted the government in her article.",
            "sent3": "I didn't mean to blast your idea, I just had some concerns.",
            "sent4": "Her words blasted through his confidence like a cannon.",
            "sent5": "The teacher's critique blasted through the student's enthusiasm."
        }
    ]
}