{
    "term": "blasphemies",
    "meanings": [
        {
            "definition": "Profane or obscene language",
            "pos": "noun",
            "sent1": "The teacher was shocked by the student's use of blasphemies in class.",
            "sent2": "The book was filled with blasphemies that made some readers uncomfortable.",
            "sent3": "The comedian's routine included playful blasphemies that had the audience laughing.",
            "sent4": "In the heat of the argument, he resorted to using blasphemies to express his frustration.",
            "sent5": "The movie's dialogue was peppered with blasphemies, adding a gritty realism to the story."
        },
        {
            "definition": "Irreverent behavior or speech towards sacred things",
            "pos": "noun",
            "sent1": "His constant blasphemies towards the church offended many parishioners.",
            "sent2": "The children were scolded for their disrespectful blasphemies during the ceremony.",
            "sent3": "Despite his playful nature, his blasphemies towards tradition were not well-received.",
            "sent4": "Her constant blasphemies towards the sacred relics showed a lack of respect.",
            "sent5": "The town's mayor was criticized for his public blasphemies towards the local customs."
        },
        {
            "definition": "An act of cursing or reviling a deity or sacred object",
            "pos": "noun",
            "sent1": "The ancient text described the consequences of committing blasphemies against the gods.",
            "sent2": "The priest warned of the dangers of engaging in blasphemous acts or blasphemies.",
            "sent3": "The mischievous child thought it was funny to commit small blasphemies in secret.",
            "sent4": "The legend spoke of a curse that would befall those who uttered blasphemies in the temple.",
            "sent5": "The forbidden chamber was said to hold the relics of those who had committed blasphemies against the divine."
        }
    ]
}