{
    "term": "blats",
    "meanings": [
        {
            "definition": "A loud, harsh noise",
            "pos": "noun",
            "sent1": "The blats of thunder scared the little dog.",
            "sent2": "The blats of the horn woke up the entire neighborhood.",
            "sent3": "The blats of the alarm clock made him jump out of bed.",
            "sent4": "The blats of the fireworks filled the night sky with color.",
            "sent5": "The blats of the drum echoed through the room."
        },
        {
            "definition": "To make a loud, harsh noise",
            "pos": "verb",
            "sent1": "The car engine blats loudly when starting in the cold.",
            "sent2": "The children blats with laughter at the funny clown.",
            "sent3": "The old door blats open with a creaky sound.",
            "sent4": "The wind blats against the windows during the storm.",
            "sent5": "The singer blats out the high notes with passion."
        },
        {
            "definition": "A sudden, heavy rainstorm",
            "pos": "noun",
            "sent1": "The unexpected blats caught everyone without umbrellas.",
            "sent2": "The blats flooded the streets within minutes.",
            "sent3": "The blats ruined their picnic plans, but they laughed it off.",
            "sent4": "The blats poured down like a waterfall from the sky.",
            "sent5": "The blats drenched them from head to toe in seconds."
        },
        {
            "definition": "To rain heavily",
            "pos": "verb",
            "sent1": "The dark clouds blats over the parched land.",
            "sent2": "It blats so hard that you can't see beyond a few feet.",
            "sent3": "The rain blats down just as they finished washing the car.",
            "sent4": "The storm blats relentlessly, causing flooding in the area.",
            "sent5": "The rain blats down like a curtain of water from the sky."
        }
    ]
}