{
    "term": "blazed",
    "meanings": [
        {
            "definition": "To burn brightly or fiercely",
            "pos": "verb",
            "sent1": "The campfire blazed brightly in the dark night.",
            "sent2": "The sun blazed down on the beach, warming the sand.",
            "sent3": "The fireplace blazed so hot, it turned the marshmallows into gooey treats.",
            "sent4": "The anger in his eyes blazed like a wildfire, impossible to ignore.",
            "sent5": "The fireworks blazed across the sky, painting it with vibrant colors."
        },
        {
            "definition": "To be very high or intoxicated, especially from drug use",
            "pos": "verb",
            "sent1": "After smoking, he blazed and felt relaxed.",
            "sent2": "She blazed up and lost track of time.",
            "sent3": "The catnip made the kitten blaze around the room in excitement.",
            "sent4": "The party blazed on until the early hours of the morning.",
            "sent5": "The group blazed together, sharing stories and laughter."
        },
        {
            "definition": "To mark or cut (a path) through a forest or field",
            "pos": "verb",
            "sent1": "The hikers blazed a trail through the dense forest.",
            "sent2": "The pioneers blazed a path through the uncharted territory.",
            "sent3": "The lawnmower blazed through the overgrown grass, leaving a neat path.",
            "sent4": "The explorer blazed through the jungle, discovering new species.",
            "sent5": "The artist blazed a unique trail in the world of abstract art."
        },
        {
            "definition": "To move quickly or forcefully",
            "pos": "verb",
            "sent1": "The race car blazed around the track, leaving competitors behind.",
            "sent2": "The athlete blazed through the finish line, breaking the record.",
            "sent3": "The wind blazed through the open window, scattering papers around the room.",
            "sent4": "The storm blazed through the town, leaving destruction in its wake.",
            "sent5": "The rocket blazed into the sky, leaving a trail of smoke behind."
        }
    ]
}