{
    "term": "bleed",
    "meanings": [
        {
            "definition": "To lose blood from the body",
            "pos": "verb",
            "sent1": "When I cut my finger, it started to bleed.",
            "sent2": "The injured soldier began to bleed heavily.",
            "sent3": "I accidentally made the tomato bleed while cutting it.",
            "sent4": "Her heart seemed to bleed with every painful memory.",
            "sent5": "The red liquid seemed to bleed out of the wound."
        },
        {
            "definition": "To remove air or liquid from a container",
            "pos": "verb",
            "sent1": "I had to bleed the air out of the brake lines.",
            "sent2": "The mechanic needed to bleed the radiator to remove the air bubbles.",
            "sent3": "The balloon started to bleed air slowly after being pricked.",
            "sent4": "The sound of air bleeding out of the tire was loud.",
            "sent5": "She used a pump to bleed the excess water from the fish tank."
        },
        {
            "definition": "To show through a material, such as ink on paper",
            "pos": "verb",
            "sent1": "The marker bled through the thin paper.",
            "sent2": "The ink started to bleed on the wet paper.",
            "sent3": "The colors began to bleed together on the canvas.",
            "sent4": "The wet paintbrush caused the colors to bleed into each other.",
            "sent5": "The dye from the fabric bled onto the white shirt."
        },
        {
            "definition": "To feel intense emotions, such as fear or sadness",
            "pos": "verb",
            "sent1": "She could feel her heart bleed with sorrow.",
            "sent2": "After the breakup, he would often bleed with sadness.",
            "sent3": "The movie made her heart bleed with empathy for the characters.",
            "sent4": "His words made her heart bleed with regret.",
            "sent5": "The tragic news made the whole community bleed with grief."
        }
    ]
}