{
    "term": "blew",
    "meanings": [
        {
            "definition": "Past tense of blow.",
            "pos": "verb",
            "sent1": "Yesterday, I blew out the candles on my birthday cake.",
            "sent2": "He blew a bubble with his gum.",
            "sent3": "The wind blew so hard that it blew away my hat!",
            "sent4": "Her amazing voice blew the audience away.",
            "sent5": "The strong gust of wind blew the leaves off the trees."
        },
        {
            "definition": "To expel air forcefully through the mouth.",
            "pos": "verb",
            "sent1": "She blew on her hot soup to cool it down.",
            "sent2": "The child blew bubbles in the park.",
            "sent3": "The little girl blew a kiss to her mom before leaving.",
            "sent4": "The whistle blew loudly at the start of the race.",
            "sent5": "The wind blew the clouds across the sky."
        },
        {
            "definition": "To cause something to move or make a sound by expelling air.",
            "pos": "verb",
            "sent1": "The referee blew the whistle to start the game.",
            "sent2": "She blew the dust off the book before reading it.",
            "sent3": "The balloon blew up quickly and popped!",
            "sent4": "The wind blew the leaves off the trees.",
            "sent5": "He blew the dust off the old photograph."
        },
        {
            "definition": "To spend money recklessly.",
            "pos": "verb",
            "sent1": "He blew all his savings on a new video game.",
            "sent2": "She blew her entire paycheck on clothes.",
            "sent3": "I blew my allowance on candy and toys.",
            "sent4": "They blew their budget on a fancy dinner.",
            "sent5": "The lottery winner blew through their winnings in a month."
        },
        {
            "definition": "To be destroyed or ruined by an explosion.",
            "pos": "verb",
            "sent1": "The building blew up in a massive explosion.",
            "sent2": "The fireworks blew up in a spectacular display.",
            "sent3": "The science experiment blew up in their faces!",
            "sent4": "The bomb blew up the entire street.",
            "sent5": "The gas leak caused the house to blow up."
        }
    ]
}