{
    "term": "blinds",
    "meanings": [
        {
            "definition": "Window coverings that block out light.",
            "pos": "noun",
            "sent1": "The blinds in my room keep the sunlight from waking me up too early.",
            "sent2": "She closed the blinds to darken the room for her nap.",
            "sent3": "The mischievous cat loves to hide behind the blinds and surprise us.",
            "sent4": "As the sun set, the blinds cast long shadows across the floor.",
            "sent5": "The blinds rattled in the wind, creating a spooky atmosphere in the room."
        },
        {
            "definition": "A type of poker where players place bets without seeing their cards.",
            "pos": "noun",
            "sent1": "In blinds poker, players have to bet without knowing their hand.",
            "sent2": "He decided to fold when he saw his cards in blinds poker.",
            "sent3": "Playing blinds poker feels like a game of chance more than skill.",
            "sent4": "The tension rises as the players in blinds poker wait to reveal their cards.",
            "sent5": "Blinds poker adds an element of mystery and excitement to the game."
        },
        {
            "definition": "To obstruct someone's vision.",
            "pos": "verb",
            "sent1": "The bright light blinds me when I step outside.",
            "sent2": "She used her hand to blinds him during the surprise party.",
            "sent3": "His flashy outfit seemed to blinds everyone at the event.",
            "sent4": "The fog was so thick it seemed to blinds the drivers on the road.",
            "sent5": "The magician's trick was to blinds the audience with a sudden burst of light."
        },
        {
            "definition": "To deceive or mislead someone.",
            "pos": "verb",
            "sent1": "The con artist tried to blinds the old lady with a fake investment scheme.",
            "sent2": "He didn't want to blinds his friends about his true intentions.",
            "sent3": "The fake news story was meant to blinds the public about the truth.",
            "sent4": "Her charming smile could blinds anyone into believing her lies.",
            "sent5": "The mirage in the desert can easily blinds weary travelers looking for water."
        }
    ]
}