{
    "term": "blistered",
    "meanings": [
        {
            "definition": "Covered with blisters",
            "pos": "adjective",
            "sent1": "After the long hike, his blistered feet were sore.",
            "sent2": "The blistered paint on the old house needed to be repainted.",
            "sent3": "She joked that her blistered hands from gardening made her look like a superhero with battle scars.",
            "sent4": "The blistered sky seemed to weep tears of rain.",
            "sent5": "The blistered skin on his shoulders peeled in the sun, revealing a painful redness."
        },
        {
            "definition": "To form blisters on the skin",
            "pos": "verb",
            "sent1": "The hot sun can blister your skin if you stay out too long.",
            "sent2": "The burn from the stove caused his hand to blister quickly.",
            "sent3": "She accidentally blistered her fingers while cooking dinner.",
            "sent4": "The intense heat of the fire blistered the paint on the wall.",
            "sent5": "The harsh chemicals in the cleaning solution can blister your hands if not used carefully."
        },
        {
            "definition": "To become blistered",
            "pos": "verb",
            "sent1": "His skin blistered after spending hours in the sun without sunscreen.",
            "sent2": "The paint on the car began to blister under the scorching heat.",
            "sent3": "The chef watched as the sauce started to blister in the pan.",
            "sent4": "The cold wind caused her cheeks to blister from the chill.",
            "sent5": "The metal gate blistered in the summer heat, turning a deep shade of brown."
        },
        {
            "definition": "A small bubble on the skin filled with serum and caused by friction, burning, or other damage",
            "pos": "noun",
            "sent1": "She carefully popped the blister on her heel to relieve the pressure.",
            "sent2": "The blister on his thumb made it difficult to hold a pencil.",
            "sent3": "The blister on her lip from the hot soup made her pout comically.",
            "sent4": "The blister on the back of his neck throbbed with each movement.",
            "sent5": "The blister on her palm oozed clear liquid, a sign of healing."
        }
    ]
}