{
    "term": "blockbust",
    "meanings": [
        {
            "definition": "A very successful and profitable movie, book, or other product.",
            "pos": "noun",
            "sent1": "The new superhero movie was a blockbust at the box office.",
            "sent2": "The author's latest novel became a blockbust among young readers.",
            "sent3": "The comedy film was such a blockbust that everyone in the theater was laughing non-stop.",
            "sent4": "Her business idea was a blockbust, bringing in more customers than she ever imagined.",
            "sent5": "The restaurant's signature dish was a blockbust, with customers coming back for more every day."
        },
        {
            "definition": "To achieve great success or popularity.",
            "pos": "verb",
            "sent1": "The singer hoped to blockbust in the music industry with her new album.",
            "sent2": "After years of hard work, the startup finally began to blockbust in the market.",
            "sent3": "The magician's trick to make a rabbit disappear seemed to blockbust with the audience.",
            "sent4": "The athlete's dedication and training helped him blockbust in his sport.",
            "sent5": "The student's innovative project started to blockbust among his classmates."
        },
        {
            "definition": "To demolish or destroy something, especially a building.",
            "pos": "verb",
            "sent1": "The construction crew had to blockbust the old building to make room for the new skyscraper.",
            "sent2": "The tornado's strong winds threatened to blockbust the entire neighborhood.",
            "sent3": "The kids' pillow fight accidentally caused a blockbust of feathers in the room.",
            "sent4": "The demolition team carefully planned how to blockbust the condemned structure.",
            "sent5": "The wrecking ball was used to blockbust the abandoned factory."
        }
    ]
}