{
    "term": "blocking",
    "meanings": [
        {
            "definition": "The action of obstructing or impeding something.",
            "pos": "noun",
            "sent1": "The blocking of the road caused a traffic jam.",
            "sent2": "The blocking of the doorway prevented anyone from entering.",
            "sent3": "The squirrel's blocking of the bird feeder was quite a sight.",
            "sent4": "Her laughter was like a blocking force against his anger.",
            "sent5": "The giant boulder served as a formidable blocking obstacle on the path."
        },
        {
            "definition": "The act of preventing access to something.",
            "pos": "noun",
            "sent1": "The website's blocking of certain content was controversial.",
            "sent2": "The blocking of the entrance kept unauthorized personnel out.",
            "sent3": "The cat's blocking of the door made it clear she wanted to be left alone.",
            "sent4": "The thick fog acted as a mysterious blocking veil over the city.",
            "sent5": "The security guard's blocking of the gate was unwavering."
        },
        {
            "definition": "The process of creating a barrier or obstacle.",
            "pos": "noun",
            "sent1": "The blocking of the river with rocks redirected its flow.",
            "sent2": "The blocking of the path with fallen trees made it impassable.",
            "sent3": "The child's blocking of the toy store aisle led to a playful chase.",
            "sent4": "The dense fog acted as a natural blocking wall around the town.",
            "sent5": "The construction crew's blocking of the street caused a detour for drivers."
        },
        {
            "definition": "The act of stopping or hindering progress.",
            "pos": "noun",
            "sent1": "The blocking of the project delayed its completion.",
            "sent2": "The blocking of the signal disrupted the communication.",
            "sent3": "The comedian's blocking of the punchline left the audience in suspense.",
            "sent4": "The storm acted as a powerful blocking force against the travelers.",
            "sent5": "The teacher's blocking of distractions helped the students focus."
        },
        {
            "definition": "The act of intercepting or deflecting something.",
            "pos": "noun",
            "sent1": "The blocking of the soccer ball by the goalie saved a goal.",
            "sent2": "The blocking of the opponent's attack was crucial for defense.",
            "sent3": "The cat's blocking of the laser pointer amused the children.",
            "sent4": "The umbrella acted as a blocking shield against the rain.",
            "sent5": "The superhero's blocking of the villain's laser beam was heroic."
        }
    ]
}