{
    "term": "blockings",
    "meanings": [
        {
            "definition": "The act of obstructing or impeding something.",
            "pos": "noun",
            "sent1": "The blockings on the road caused a traffic jam.",
            "sent2": "The blockings in the doorway made it hard to enter the room.",
            "sent3": "The blockings in the game made it challenging but fun.",
            "sent4": "Her fear was like blockings in her mind, stopping her from moving forward.",
            "sent5": "The blockings in the river created a beautiful waterfall."
        },
        {
            "definition": "The state of being obstructed or impeded.",
            "pos": "noun",
            "sent1": "The blockings of the path made it difficult to walk through.",
            "sent2": "The blockings at the entrance indicated the store was closed.",
            "sent3": "The blockings in the puzzle made it frustrating to solve.",
            "sent4": "His sadness felt like blockings around his heart, preventing joy.",
            "sent5": "The blockings in the tunnel caused a backup of cars."
        },
        {
            "definition": "The action of preventing access to something.",
            "pos": "noun",
            "sent1": "The blockings of the gate kept intruders out.",
            "sent2": "The blockings on the website restricted certain content.",
            "sent3": "The blockings at the party made it exclusive and mysterious.",
            "sent4": "The secrecy around the project was like blockings, hiding the truth.",
            "sent5": "The blockings on the path led to a hidden garden."
        },
        {
            "definition": "The process of stopping or hindering progress.",
            "pos": "noun",
            "sent1": "The blockings in negotiations delayed the agreement.",
            "sent2": "The blockings in the plan required a new approach.",
            "sent3": "The blockings in the race added suspense and excitement.",
            "sent4": "His doubts acted as blockings, slowing down his success.",
            "sent5": "The blockings in the project timeline caused frustration."
        }
    ]
}