{
    "term": "blockader",
    "meanings": [
        {
            "definition": "A person who engages in a blockade.",
            "pos": "noun",
            "sent1": "The blockader stood firm at the entrance, preventing anyone from entering.",
            "sent2": "The blockader was determined to stop the flow of goods into the port.",
            "sent3": "The blockader tried to block the path with a giant teddy bear, causing laughter among onlookers.",
            "sent4": "The blockader was like a human wall, unyielding and resolute in their mission.",
            "sent5": "The image of the blockader, with arms crossed and a stern expression, was etched in everyone's memory."
        },
        {
            "definition": "To obstruct or hinder the progress of something.",
            "pos": "verb",
            "sent1": "She tried to blockader the ball from going into the goal by diving to intercept it.",
            "sent2": "The fallen tree blockadered the road, causing a traffic jam.",
            "sent3": "The mischievous squirrel blockadered the path by stealing all the acorns, much to the annoyance of the other animals.",
            "sent4": "His fear blockadered his ability to speak in front of the large audience.",
            "sent5": "The thick fog blockadered the view, making it impossible to see more than a few feet ahead."
        },
        {
            "definition": "The act of blocking or obstructing.",
            "pos": "noun",
            "sent1": "The blockader of the sunlight by the tall building created a shadow on the park.",
            "sent2": "The sudden blockader of the road surprised the drivers, causing confusion and delays.",
            "sent3": "The blockader of the doorway by the playful puppy made it challenging for anyone to enter the room.",
            "sent4": "The blockader of communication between the two countries led to misunderstandings and tensions.",
            "sent5": "The blockader of the river by the fallen rocks changed the course of the water, creating a new landscape."
        }
    ]
}