{
    "term": "bloodthirsty",
    "meanings": [
        {
            "definition": "Eager to shed blood or kill",
            "pos": "adjective",
            "sent1": "The bloodthirsty lion stalked its prey through the tall grass.",
            "sent2": "The villain in the movie had a bloodthirsty look in his eyes as he plotted his next evil deed.",
            "sent3": "The bloodthirsty vampire couldn't resist the temptation of a fresh neck to bite.",
            "sent4": "The bloodthirsty warrior's sword thirsted for the taste of enemy blood.",
            "sent5": "The bloodthirsty shark circled the boat, waiting for the perfect moment to strike."
        },
        {
            "definition": "Showing a desire for violence or aggression",
            "pos": "adjective",
            "sent1": "The bloodthirsty dictator ruled with an iron fist, crushing any opposition.",
            "sent2": "The gang leader's bloodthirsty nature made him feared by all in the neighborhood.",
            "sent3": "The bloodthirsty wrestler entered the ring with a menacing grin, ready to take down his opponent.",
            "sent4": "In the heat of battle, his bloodthirsty instincts took over, driving him to fight fiercely.",
            "sent5": "The bloodthirsty mob demanded retribution, seeking vengeance for their fallen comrade."
        },
        {
            "definition": "Involving or characterized by bloodshed or violence",
            "pos": "adjective",
            "sent1": "The bloodthirsty conflict between the two rival factions left a trail of destruction in its wake.",
            "sent2": "The history books were filled with tales of bloodthirsty wars that shaped the course of nations.",
            "sent3": "The bloodthirsty video game was not suitable for young children due to its graphic content.",
            "sent4": "The bloodthirsty battle echoed with the sounds of clashing swords and cries of the fallen.",
            "sent5": "The bloodthirsty movie kept audiences on the edge of their seats with its intense fight scenes."
        }
    ]
}