{
    "term": "bloodstocks",
    "meanings": [
        {
            "definition": "Livestock, especially horses, bred for racing or other purposes.",
            "pos": "noun",
            "sent1": "The bloodstocks at the farm are all well-trained racehorses.",
            "sent2": "The breeder takes pride in their bloodstocks' speed and agility.",
            "sent3": "The bloodstocks decided to have a friendly race to see who was the fastest.",
            "sent4": "Her bloodstocks were like a fleet of thoroughbred champions, ready to conquer the racetrack.",
            "sent5": "The bloodstocks galloped gracefully, their hooves pounding the ground with power."
        },
        {
            "definition": "The ancestry or lineage of a particular group of animals, especially horses.",
            "pos": "noun",
            "sent1": "The bloodstocks of the champion horse traced back to a long line of winners.",
            "sent2": "Studying the bloodstocks of the mare revealed a prestigious lineage.",
            "sent3": "The bloodstocks were so proud of their royal lineage that they held a fancy parade.",
            "sent4": "The bloodstocks' lineage was as illustrious as a royal family's history.",
            "sent5": "The bloodstocks' ancestry was filled with tales of glory and triumph."
        },
        {
            "definition": "The total number of horses or other livestock owned by a particular individual or organization.",
            "pos": "noun",
            "sent1": "The wealthy rancher's bloodstocks included a variety of horse breeds.",
            "sent2": "The bloodstocks on the farm were carefully counted and documented.",
            "sent3": "The bloodstocks were so numerous that they needed their own accountant.",
            "sent4": "The bloodstocks multiplied like a herd of magical unicorns.",
            "sent5": "The bloodstocks filled the fields with a colorful array of coats and sizes."
        }
    ]
}