{
    "term": "bloodiness",
    "meanings": [
        {
            "definition": "The state or quality of being bloody.",
            "pos": "noun",
            "sent1": "The horror movie was full of bloodiness, with scenes of gruesome violence.",
            "sent2": "The crime scene was marked by bloodiness, causing unease among the investigators.",
            "sent3": "The children's Halloween costumes were so realistic that they joked about the bloodiness scaring their parents.",
            "sent4": "The political debate had a level of bloodiness that left both candidates emotionally drained.",
            "sent5": "The artist's painting captured the bloodiness of war with vivid detail."
        },
        {
            "definition": "The presence of blood or bloodstains.",
            "pos": "noun",
            "sent1": "The nurse quickly cleaned up the bloodiness on the floor of the emergency room.",
            "sent2": "The hunter examined the bloodiness on the animal's fur to determine the shot placement.",
            "sent3": "The chef accidentally added too much red food coloring, creating a dish with an unintended bloodiness.",
            "sent4": "The crime scene investigator meticulously documented every detail of the bloodiness for the case file.",
            "sent5": "The old house had a mysterious air, with remnants of bloodiness still visible on the walls."
        },
        {
            "definition": "The tendency to resort to violence or bloodshed.",
            "pos": "noun",
            "sent1": "The history of the region was marked by a long period of bloodiness and conflict.",
            "sent2": "The gang leader's reputation for bloodiness struck fear into the hearts of the townspeople.",
            "sent3": "The action movie exaggerated the bloodiness of the fight scenes for dramatic effect.",
            "sent4": "The novel's protagonist struggled with the temptation of bloodiness in the face of injustice.",
            "sent5": "The general's strategy prioritized diplomacy to avoid unnecessary bloodiness in the war."
        }
    ]
}