{
    "term": "blotter",
    "meanings": [
        {
            "definition": "A piece of absorbent paper used to soak up excess liquid.",
            "pos": "noun",
            "sent1": "I spilled water on the table, so I quickly grabbed a blotter to clean it up.",
            "sent2": "The office secretary always keeps a blotter handy to absorb any ink spills.",
            "sent3": "The blotter felt like a superhero, saving the desk from the evil ink puddle.",
            "sent4": "Her quick thinking turned the blotter into a magical sponge, erasing the spill in seconds.",
            "sent5": "The blotter's job is to be a silent hero, quietly mopping up messes without complaint."
        },
        {
            "definition": "A police record of arrests and charges.",
            "pos": "noun",
            "sent1": "The detective checked the suspect's blotter to see their criminal history.",
            "sent2": "The lawyer requested the suspect's blotter to prepare for the trial.",
            "sent3": "The blotter revealed a long list of misdeeds, making the detective's job easier.",
            "sent4": "The blotter was like a map of the suspect's past, guiding the investigation.",
            "sent5": "The blotter's pages told the story of each arrest, painting a picture of the suspect's life."
        },
        {
            "definition": "A person or thing that blots.",
            "pos": "noun",
            "sent1": "She was known as the blotter in the office because she always spilled her coffee.",
            "sent2": "The leaky pen was a constant blotter, leaving ink stains on every paper it touched.",
            "sent3": "The blotter at the party was the clumsy waiter who spilled drinks on guests.",
            "sent4": "His reputation as a blotter grew as he continued to make mistakes in his work.",
            "sent5": "The cat became the family's little blotter, knocking over cups and leaving paw prints everywhere."
        }
    ]
}