{
    "term": "blowing",
    "meanings": [
        {
            "definition": "Moving air forcefully",
            "pos": "noun",
            "sent1": "The strong blowing knocked over the umbrella.",
            "sent2": "I felt the blowing of the wind on my face.",
            "sent3": "The blowing from the fan made the papers fly around comically.",
            "sent4": "The blowing of the storm was like a fierce beast roaring outside.",
            "sent5": "The blowing of the wind sounded like a thousand whispers in the trees."
        },
        {
            "definition": "Producing sound by expelling air",
            "pos": "verb",
            "sent1": "She was blowing bubbles in the park.",
            "sent2": "The musician was blowing into the trumpet.",
            "sent3": "The kids were blowing raspberries at each other playfully.",
            "sent4": "The whistle was blowing loudly, signaling the start of the game.",
            "sent5": "The wind blowing through the trees made a soothing sound."
        },
        {
            "definition": "Causing something to move or be carried by air",
            "pos": "adjective",
            "sent1": "The blowing leaves danced in the air.",
            "sent2": "The blowing curtains added a touch of elegance to the room.",
            "sent3": "The blowing balloons made the room look festive.",
            "sent4": "Her blowing hair in the wind looked like a golden waterfall.",
            "sent5": "The blowing seeds were carried away by the breeze."
        },
        {
            "definition": "Wasting money or resources quickly",
            "pos": "adjective",
            "sent1": "He regretted his blowing of the entire paycheck on unnecessary items.",
            "sent2": "The company's blowing of funds led to financial troubles.",
            "sent3": "Her blowing of the inheritance on luxury items shocked her family.",
            "sent4": "The blowing of resources on ineffective projects was a costly mistake.",
            "sent5": "The blowing of money on frivolous things left him with nothing for emergencies."
        }
    ]
}