{
    "term": "blow",
    "meanings": [
        {
            "definition": "To move with force or speed, as in wind blowing through the trees.",
            "pos": "verb",
            "sent1": "The strong wind can blow away the leaves.",
            "sent2": "I blow bubbles with my bubble wand.",
            "sent3": "The wind can blow so hard, it makes my hat fly off!",
            "sent4": "Her determination to win the race will blow away the competition.",
            "sent5": "The hurricane will blow through the town, causing chaos."
        },
        {
            "definition": "To create a burst of air or wind, as in blowing out candles.",
            "pos": "verb",
            "sent1": "I blow out the candles on my birthday cake.",
            "sent2": "The wind can blow softly through the open window.",
            "sent3": "If you blow too hard, you might blow out the entire cake!",
            "sent4": "The strong gust of wind can blow out the flame in an instant.",
            "sent5": "She had to blow out the match before it burned her fingers."
        },
        {
            "definition": "To cause to explode or burst, as in blowing up a balloon.",
            "pos": "verb",
            "sent1": "I blow up balloons for the party decorations.",
            "sent2": "The balloon will blow up if you keep adding air.",
            "sent3": "He tried to blow up the balloon, but it popped in his face!",
            "sent4": "The scientist will blow up the balloon to demonstrate the experiment.",
            "sent5": "The kids love to blow up balloons and play with them."
        },
        {
            "definition": "To spend money recklessly or wastefully, as in blowing all your savings on a vacation.",
            "pos": "verb",
            "sent1": "She will blow all her money on shopping sprees.",
            "sent2": "If you blow your savings, you might regret it later.",
            "sent3": "He tends to blow his paycheck on unnecessary items.",
            "sent4": "The lottery winner blew all the money on luxury cars.",
            "sent5": "Don't blow your entire budget on unnecessary things."
        },
        {
            "definition": "A sudden, hard stroke with a hand, weapon, or hard object, as in delivering a blow to the head.",
            "pos": "noun",
            "sent1": "The boxer delivered a powerful blow to his opponent.",
            "sent2": "A blow to the head can cause serious injury.",
            "sent3": "He felt the blow to his pride when he lost the game.",
            "sent4": "The final blow came when he lost his job.",
            "sent5": "The unexpected blow left him stunned and confused."
        }
    ]
}