{
    "term": "blowups",
    "meanings": [
        {
            "definition": "A sudden outburst of anger or emotion.",
            "pos": "noun",
            "sent1": "Her blowups at work often made her colleagues uncomfortable.",
            "sent2": "The child's blowups over small things puzzled his parents.",
            "sent3": "During the game, his blowups at the referee were quite entertaining.",
            "sent4": "His blowups were like fireworks, quick and intense.",
            "sent5": "The teacher's blowups were legendary, but always short-lived."
        },
        {
            "definition": "An increase in size or intensity.",
            "pos": "noun",
            "sent1": "The blowups of the balloons made the party decorations more festive.",
            "sent2": "The blowups in sales figures indicated a successful marketing campaign.",
            "sent3": "The blowups in the storm's intensity caught everyone by surprise.",
            "sent4": "The blowups in the music volume got the crowd excited.",
            "sent5": "The blowups in the plot made the movie more thrilling."
        },
        {
            "definition": "A photograph or image that has been enlarged.",
            "pos": "noun",
            "sent1": "She proudly displayed the blowups of her family photos on the wall.",
            "sent2": "The blowups of the landscapes captured every detail beautifully.",
            "sent3": "The blowups of the old pictures revealed hidden memories.",
            "sent4": "The blowups of the artwork highlighted the intricate details.",
            "sent5": "The blowups of the stars in the sky were breathtaking."
        },
        {
            "definition": "A type of explosive device.",
            "pos": "noun",
            "sent1": "The military used blowups to clear obstacles on the battlefield.",
            "sent2": "The detective carefully examined the remnants of the blowups.",
            "sent3": "The spy planted blowups to create a distraction.",
            "sent4": "The action movie featured a thrilling scene with blowups.",
            "sent5": "The terrorist group planned to use blowups in their attack."
        }
    ]
}