{
    "term": "blowup",
    "meanings": [
        {
            "definition": "A sudden outburst of anger or emotion.",
            "pos": "noun",
            "sent1": "Her blowup at the meeting surprised everyone.",
            "sent2": "The child's blowup over the lost toy was understandable.",
            "sent3": "During the game, his blowup over a small mistake made everyone laugh.",
            "sent4": "The blowup of emotions in the room was palpable.",
            "sent5": "The blowup of frustration was like a storm brewing inside her."
        },
        {
            "definition": "An explosion or detonation.",
            "pos": "noun",
            "sent1": "The blowup of the fireworks lit up the night sky.",
            "sent2": "The controlled blowup of the building was scheduled for noon.",
            "sent3": "The unexpected blowup of the balloon startled the children.",
            "sent4": "The blowup of the volcano was a sight to behold.",
            "sent5": "The blowup of the bomb echoed through the valley."
        },
        {
            "definition": "A photograph or image that has been enlarged.",
            "pos": "noun",
            "sent1": "She proudly displayed the blowup of the family portrait on the wall.",
            "sent2": "The blowup of the map helped them navigate the unfamiliar terrain.",
            "sent3": "The blowup of the tiny insect made it look like a giant monster.",
            "sent4": "The blowup of the painting revealed intricate details.",
            "sent5": "The blowup of the starry sky was breathtaking."
        },
        {
            "definition": "A sudden increase in size or intensity.",
            "pos": "noun",
            "sent1": "The blowup of the balloon startled the cat.",
            "sent2": "The blowup of the storm caught everyone off guard.",
            "sent3": "The blowup of the party made it the talk of the town.",
            "sent4": "The blowup of the music volume made the windows rattle.",
            "sent5": "The blowup of excitement was contagious among the crowd."
        }
    ]
}