{
    "term": "blown",
    "meanings": [
        {
            "definition": "Past participle of blow.",
            "pos": "adjective",
            "sent1": "The balloons were all blown up for the party.",
            "sent2": "The candles were blown out by the wind.",
            "sent3": "The blown-up beach ball bounced around the pool.",
            "sent4": "The blown leaves scattered across the yard like confetti.",
            "sent5": "The blown glass vase shimmered in the sunlight."
        },
        {
            "definition": "In a state of being moved or affected by strong winds.",
            "pos": "adjective",
            "sent1": "The blown trees swayed in the storm.",
            "sent2": "Her hair was blown all over her face in the wind.",
            "sent3": "The blown flag flapped vigorously in the breeze.",
            "sent4": "The blown sand stung against their skin at the beach.",
            "sent5": "The blown kite soared high above the park."
        },
        {
            "definition": "In a state of being destroyed or damaged by an explosion.",
            "pos": "adjective",
            "sent1": "The blown-up building left a cloud of dust.",
            "sent2": "The blown car was a twisted wreck on the road.",
            "sent3": "The blown tire caused a loud bang on the highway.",
            "sent4": "The blown fireworks lit up the night sky.",
            "sent5": "The blown house collapsed in a heap of rubble."
        },
        {
            "definition": "In a state of being revealed or exposed.",
            "pos": "adjective",
            "sent1": "Her secret was blown when her diary was found.",
            "sent2": "The scandal was blown wide open by the news.",
            "sent3": "The blown cover story fooled no one.",
            "sent4": "The blown disguise revealed his true identity.",
            "sent5": "The blown conspiracy was finally brought to light."
        }
    ]
}