{
    "term": "blowsiest",
    "meanings": [
        {
            "definition": "(adjective) excessively showy or flashy in appearance",
            "pos": "adjective",
            "sent1": "The blowsiest dress at the party had sparkles all over it.",
            "sent2": "She always chooses the blowsiest jewelry to wear with her outfits.",
            "sent3": "The blowsiest car in town had neon lights under it, making it look like a disco on wheels.",
            "sent4": "Her blowsiest personality trait was her love for attention-grabbing accessories.",
            "sent5": "The blowsiest flower in the garden was a bright pink rose that seemed to glow in the sunlight."
        },
        {
            "definition": "(adverb) in a showy or flashy manner",
            "pos": "adverb",
            "sent1": "She walked blowsiest into the room, turning heads with her extravagant outfit.",
            "sent2": "The performer sang blowsiest, hitting high notes and dazzling the audience.",
            "sent3": "He danced blowsiest at the party, twirling and spinning in his flashy suit.",
            "sent4": "The magician performed blowsiest, making objects disappear in a cloud of glitter.",
            "sent5": "The fireworks lit up the sky blowsiest, painting it with vibrant colors and patterns."
        },
        {
            "definition": "(noun) a person or thing that is excessively showy or flashy",
            "pos": "noun",
            "sent1": "She was known as the blowsiest in the neighborhood for her extravagant taste.",
            "sent2": "The car parked in front of the mansion was the blowsiest on the block.",
            "sent3": "The peacock strutted around like the blowsiest in the zoo, flaunting its colorful feathers.",
            "sent4": "The celebrity was considered the blowsiest in Hollywood for always wearing designer clothes.",
            "sent5": "The chandelier in the ballroom was the blowsiest decoration, sparkling with crystals and lights."
        }
    ]
}