{
    "term": "blubber",
    "meanings": [
        {
            "definition": "The thick layer of fat beneath the skin of whales and other marine mammals.",
            "pos": "noun",
            "sent1": "The whale's blubber helps keep it warm in cold ocean waters.",
            "sent2": "Scientists study the blubber of marine mammals to understand their adaptations.",
            "sent3": "The blubber of the seal made it look like a chubby superhero in a wetsuit.",
            "sent4": "The ship glided through the icy waters, slicing through the blubber of the ocean.",
            "sent5": "The blubber of the walrus was so thick, it seemed like a natural insulation blanket."
        },
        {
            "definition": "To cry noisily and uncontrollably.",
            "pos": "verb",
            "sent1": "After losing the game, the child began to blubber loudly in disappointment.",
            "sent2": "She couldn't help but blubber when she watched the emotional movie scene.",
            "sent3": "The puppy's blubbering over a spilled treat was both pitiful and adorable.",
            "sent4": "Her blubbering echoed through the empty hallway, revealing her heartbreak.",
            "sent5": "The blubbering of the toddler could be heard from the next room, a mix of sadness and frustration."
        },
        {
            "definition": "To speak in a wavering or trembling voice.",
            "pos": "verb",
            "sent1": "She started to blubber nervously during her speech in front of the class.",
            "sent2": "The old man's blubbering voice showed his fear of the approaching storm.",
            "sent3": "The blubbering of the actor added a touch of humor to the serious scene.",
            "sent4": "Her blubbering voice on the phone revealed her anxiety about the upcoming test.",
            "sent5": "The blubbering voice of the singer added an emotional depth to the song, touching the audience's hearts."
        }
    ]
}