{
    "term": "blype",
    "meanings": [
        {
            "definition": "To blype: to criticize or speak ill of someone",
            "pos": "verb",
            "sent1": "She decided to blype her friend for being late.",
            "sent2": "It is not nice to blype others behind their backs.",
            "sent3": "He always finds something to blype about, even on a sunny day.",
            "sent4": "Her words blyped his confidence like a sharp knife.",
            "sent5": "The teacher's constant blyping made the student feel small and unimportant."
        },
        {
            "definition": "Blype: a mark or stain on a surface",
            "pos": "noun",
            "sent1": "There was a blype on the white wall.",
            "sent2": "The blype on the carpet was hard to remove.",
            "sent3": "The blype on his shirt looked like a tiny cloud.",
            "sent4": "The blype on her reputation was hard to erase.",
            "sent5": "The blype on the painting ruined its beauty."
        },
        {
            "definition": "Blype: a small piece of paper or cloth used for cleaning or wiping",
            "pos": "noun",
            "sent1": "She used a blype to clean the spill on the table.",
            "sent2": "He always carries a blype in his pocket for emergencies.",
            "sent3": "The blype was so soft, it felt like a cloud in her hand.",
            "sent4": "The blype glided smoothly over the surface, leaving it spotless.",
            "sent5": "The blype absorbed the liquid quickly, like a thirsty sponge."
        },
        {
            "definition": "Blype: to reveal or expose someone's wrongdoing",
            "pos": "verb",
            "sent1": "He threatened to blype her secret if she didn't comply.",
            "sent2": "The whistleblower decided to blype the corrupt practices.",
            "sent3": "The detective blyped the criminal's hideout, leading to his arrest.",
            "sent4": "Her actions inadvertently blyped the company's unethical practices.",
            "sent5": "The leaked document blyped the truth behind the scandal."
        }
    ]
}