{
    "term": "board",
    "meanings": [
        {
            "definition": "A long, thin, flat piece of wood or other hard material used for floors or other building purposes.",
            "pos": "noun",
            "sent1": "I placed the board on the floor to fix it.",
            "sent2": "The carpenter used the board to build the new deck.",
            "sent3": "The board on the floor seemed to be playing hide and seek.",
            "sent4": "Her smile was as flat as a board.",
            "sent5": "The board creaked under my weight as I walked on it."
        },
        {
            "definition": "A group of people who manage or direct a company or organization.",
            "pos": "noun",
            "sent1": "The board decided to invest in new technology.",
            "sent2": "The board members meet every month to discuss business strategies.",
            "sent3": "The board of directors had a pizza party to celebrate a successful year.",
            "sent4": "She felt like a pawn on the chessboard of the board's decisions.",
            "sent5": "The board's decision to expand globally was met with mixed reactions."
        },
        {
            "definition": "A flat, thin, rectangular piece of stiff material used for writing or displaying information.",
            "pos": "noun",
            "sent1": "She wrote her name on the board with chalk.",
            "sent2": "The teacher used the board to explain the math problem.",
            "sent3": "The board seemed to have a mind of its own, erasing the notes unexpectedly.",
            "sent4": "His words were written on the board of her heart.",
            "sent5": "The whiteboard marker squeaked as she wrote on the board."
        },
        {
            "definition": "To get on or into a ship, aircraft, or other vehicle.",
            "pos": "verb",
            "sent1": "We will board the plane in an hour.",
            "sent2": "Passengers must board the ship before departure.",
            "sent3": "The idea to board the spaceship for a vacation was out of this world.",
            "sent4": "She felt like a pirate ready to board the enemy ship.",
            "sent5": "The opportunity to board the luxury yacht was a dream come true."
        },
        {
            "definition": "A piece of wood or other material used for a specific purpose, such as cutting or serving food.",
            "pos": "noun",
            "sent1": "The chef used the board to chop vegetables.",
            "sent2": "She placed the cheese platter on the wooden board.",
            "sent3": "The board for cutting looked like a mini stage for the vegetables.",
            "sent4": "His words hit her heart like a sharp knife on a cutting board.",
            "sent5": "The serving board was beautifully decorated with fruits and cheese."
        }
    ]
}