{
    "term": "boardings",
    "meanings": [
        {
            "definition": "The act of getting on or into a vehicle or vessel.",
            "pos": "noun",
            "sent1": "The boardings onto the bus were quick and orderly.",
            "sent2": "The train conductor announced the boardings for the next stop.",
            "sent3": "During the boardings onto the spaceship, an alien snuck in disguised as a human.",
            "sent4": "The boardings onto the pirate ship felt like stepping into a different era.",
            "sent5": "The boardings onto the submarine were so cramped, it felt like entering a sardine can."
        },
        {
            "definition": "The act of providing meals and lodging in exchange for payment.",
            "pos": "noun",
            "sent1": "The boardings at the inn included a hearty breakfast and a cozy room.",
            "sent2": "The hotel manager oversaw the boardings of the guests with a warm smile.",
            "sent3": "For a unique experience, the boardings at the bed and breakfast came with a complimentary ghost tour.",
            "sent4": "The boardings at the all-inclusive resort were like entering a paradise of relaxation.",
            "sent5": "The boardings at the mountain lodge were so comfortable, guests never wanted to leave."
        },
        {
            "definition": "The act of entering a building or room illegally or forcefully.",
            "pos": "noun",
            "sent1": "The boardings into the abandoned house were done under the cover of darkness.",
            "sent2": "The detective found evidence of forced boardings at the crime scene.",
            "sent3": "In a comedy of errors, the boardings into the wrong apartment led to a hilarious misunderstanding.",
            "sent4": "The boardings into the forbidden temple felt like trespassing into a sacred place.",
            "sent5": "The boardings into the haunted mansion were filled with spine-chilling anticipation."
        }
    ]
}