{
    "term": "boarders",
    "meanings": [
        {
            "definition": "A person who pays for meals and lodging in someone else's home.",
            "pos": "noun",
            "sent1": "The boarders at Mrs. Smith's house always enjoy her delicious cooking.",
            "sent2": "The boarders in the guesthouse were friendly and respectful.",
            "sent3": "The boarders decided to have a picnic in the living room for a change.",
            "sent4": "The boarders were like family, sharing meals and stories around the table.",
            "sent5": "The boarders felt at home in their cozy rooms, grateful for the warm hospitality."
        },
        {
            "definition": "A person who rents a room in a house.",
            "pos": "noun",
            "sent1": "The boarders in the old mansion had individual rooms with unique decorations.",
            "sent2": "The boarders paid their rent promptly each month without fail.",
            "sent3": "The boarders organized a movie night in the common area to bond with each other.",
            "sent4": "The boarders' rooms were like personal havens, filled with memories and comfort.",
            "sent5": "The boarders often chatted in the hallway, sharing stories and laughter."
        },
        {
            "definition": "A person who attends a boarding school.",
            "pos": "noun",
            "sent1": "The boarders at the prestigious academy excelled in both academics and sports.",
            "sent2": "The boarders followed a strict schedule of classes and extracurricular activities.",
            "sent3": "The boarders pranked their dorm supervisor by filling his office with balloons.",
            "sent4": "The boarders' friendships were forged through late-night study sessions and adventures.",
            "sent5": "The boarders eagerly awaited the weekend trips organized by the school."
        },
        {
            "definition": "The act of providing meals and lodging for someone in exchange for payment.",
            "pos": "noun",
            "sent1": "The boarders appreciated the delicious meals served by the innkeeper.",
            "sent2": "The boarders' payments covered their stay at the cozy bed and breakfast.",
            "sent3": "The boarders decided to surprise the host by cooking a special dinner for them.",
            "sent4": "The boarders' arrival brought life and laughter to the quiet inn.",
            "sent5": "The boarders' presence added warmth and joy to the quaint countryside retreat."
        }
    ]
}