{
    "term": "boarder",
    "meanings": [
        {
            "definition": "A person who pays for meals and lodging in someone else's home.",
            "pos": "noun",
            "sent1": "The boarder enjoyed the delicious dinner prepared by the host.",
            "sent2": "The boarder stayed in a cozy room in the house for a week.",
            "sent3": "The boarder accidentally mistook the dog's bed for their own.",
            "sent4": "The boarder's presence in the house added a touch of warmth to the atmosphere.",
            "sent5": "The boarder always left a thank you note for the host after each stay."
        },
        {
            "definition": "A person who rents a room in a house or apartment.",
            "pos": "noun",
            "sent1": "The boarder paid the rent on time every month.",
            "sent2": "The boarder had a cozy corner in the apartment to relax in.",
            "sent3": "The boarder accidentally locked themselves out of the room one evening.",
            "sent4": "The boarder's room in the house was like a sanctuary away from the city noise.",
            "sent5": "The boarder often decorated their rented space with colorful artwork."
        },
        {
            "definition": "A person who attends a boarding school.",
            "pos": "noun",
            "sent1": "The boarder studied hard in the library after classes.",
            "sent2": "The boarder shared a dorm room with a friendly roommate.",
            "sent3": "The boarder once fell asleep in class and got caught by the teacher.",
            "sent4": "The boarder's experience at the boarding school shaped their future aspirations.",
            "sent5": "The boarder made lifelong friends during their time at the school."
        },
        {
            "definition": "A person who rides a snowboard or skateboard.",
            "pos": "noun",
            "sent1": "The boarder practiced new tricks at the skate park.",
            "sent2": "The boarder enjoyed the thrill of gliding down the snowy slope.",
            "sent3": "The boarder accidentally bumped into a friend while skateboarding.",
            "sent4": "The boarder's movements on the snowboard were graceful and fluid.",
            "sent5": "The boarder's passion for skateboarding was evident in every trick they performed."
        }
    ]
}