{
    "term": "bob",
    "meanings": [
        {
            "definition": "A short, quick movement up and down.",
            "pos": "noun",
            "sent1": "The boy made a little bob with his head.",
            "sent2": "The bob of the buoy in the water caught my eye.",
            "sent3": "The bob of the bouncing ball was mesmerizing to watch.",
            "sent4": "The bob of the elevator made my stomach drop.",
            "sent5": "The bob of the yo-yo was perfectly timed."
        },
        {
            "definition": "A hairstyle in which the hair is cut short and evenly all around.",
            "pos": "noun",
            "sent1": "Her bob framed her face beautifully.",
            "sent2": "The bob was a popular choice among the students.",
            "sent3": "The bob swayed gently in the breeze.",
            "sent4": "Her bob was like a neat little halo.",
            "sent5": "The bob looked sleek and modern."
        },
        {
            "definition": "A weight attached to a fishing line.",
            "pos": "noun",
            "sent1": "The fisherman attached a heavy bob to his line.",
            "sent2": "The bob helped the bait sink deeper into the water.",
            "sent3": "The bob splashed into the lake, ready for action.",
            "sent4": "The bob danced on the surface of the water.",
            "sent5": "The bob signaled a fish was nibbling."
        },
        {
            "definition": "To move up and down quickly and repeatedly.",
            "pos": "verb",
            "sent1": "The cork bobbed in the water.",
            "sent2": "The boat bobbed gently on the waves.",
            "sent3": "The dancer bobbed up and down to the music.",
            "sent4": "The buoy bobbed in the ocean currents.",
            "sent5": "The balloon bobbed in the sky."
        },
        {
            "definition": "To cut hair short and evenly all around.",
            "pos": "verb",
            "sent1": "She decided to bob her hair for a change.",
            "sent2": "The stylist carefully bobbed her hair.",
            "sent3": "He bobbed his hair before the summer heat arrived.",
            "sent4": "The actress bobbed her hair for a movie role.",
            "sent5": "The barber will bob your hair exactly as you like."
        }
    ]
}