{
    "term": "bobac",
    "meanings": [
        {
            "definition": "A small, burrowing mammal native to Central Asia.",
            "pos": "noun",
            "sent1": "The bobac dug a cozy burrow in the ground.",
            "sent2": "I saw a cute bobac scurrying across the field.",
            "sent3": "The bobac peeked out of its burrow and waved hello.",
            "sent4": "The bobac's burrow was like a secret underground fortress.",
            "sent5": "The bobac's fur was as soft as a cloud."
        },
        {
            "definition": "To move up and down in a short, jerky motion.",
            "pos": "verb",
            "sent1": "The toy bobac on the spring bounced happily.",
            "sent2": "I watched the ball bobac up and down on the water.",
            "sent3": "The dancer bobac-ed across the stage with energy.",
            "sent4": "The boat bobac-ed on the waves like a cork.",
            "sent5": "The bird bobac-ed on the branch, singing a cheerful tune."
        },
        {
            "definition": "A type of tea made from the leaves of a certain plant.",
            "pos": "noun",
            "sent1": "I enjoyed a soothing cup of bobac in the afternoon.",
            "sent2": "The aroma of bobac filled the room with warmth.",
            "sent3": "The bobac tea was so delicious, it made me smile.",
            "sent4": "The steam from the bobac tea rose like a gentle cloud.",
            "sent5": "The bobac tea was as comforting as a hug."
        },
        {
            "definition": "A hairstyle in which the hair is cut short and evenly all around.",
            "pos": "noun",
            "sent1": "She decided to try a trendy bobac for a fresh look.",
            "sent2": "The bobac hairstyle framed her face beautifully.",
            "sent3": "His bobac haircut made him look younger and stylish.",
            "sent4": "The bobac hairstyle was like a neat little crown.",
            "sent5": "The bobac haircut was as sleek as polished marble."
        }
    ]
}