{
    "term": "bobs",
    "meanings": [
        {
            "definition": "A quick, jerky movement up and down.",
            "pos": "noun",
            "sent1": "The boy's bobs on the trampoline were so fast!",
            "sent2": "The dancer's bobs added excitement to the performance.",
            "sent3": "The bobs of the bouncing ball made it hard to catch.",
            "sent4": "Her heart did little bobs in her chest as she waited for the results.",
            "sent5": "The bobs of the yo-yo mesmerized the children."
        },
        {
            "definition": "A hairstyle in which the hair is cut short and hangs evenly around the head.",
            "pos": "noun",
            "sent1": "Her bobs framed her face beautifully.",
            "sent2": "Many people love the classic look of bobs.",
            "sent3": "The wind made her bobs sway like a pendulum.",
            "sent4": "Her bobs were like a neat little halo around her head.",
            "sent5": "The actress's bobs in the movie inspired a new trend."
        },
        {
            "definition": "A weight attached to a fishing line to sink it in the water.",
            "pos": "noun",
            "sent1": "The fisherman attached the bobs to his line.",
            "sent2": "The bobs helped the fishing line sink quickly.",
            "sent3": "The playful seal mistook the bobs for food.",
            "sent4": "The bobs danced in the water as the fisherman cast his line.",
            "sent5": "The shiny bobs attracted the fish to the bait."
        },
        {
            "definition": "A slang term for British currency.",
            "pos": "noun",
            "sent1": "He paid for the souvenir with a few bobs.",
            "sent2": "In the old days, people used bobs for everyday purchases.",
            "sent3": "The bobs jingled in his pocket as he walked.",
            "sent4": "She saved up her bobs for a special occasion.",
            "sent5": "The bobs clinked together as he counted them out."
        }
    ]
}