{
    "term": "bobtails",
    "meanings": [
        {
            "definition": "A short or cut tail on an animal.",
            "pos": "noun",
            "sent1": "The cat's bobtails wagged happily as it played.",
            "sent2": "I saw a squirrel with a bobtails running across the yard.",
            "sent3": "The bobtails of the dog made it look like a little lion.",
            "sent4": "The bobtails of the horse fluttered like a tiny flag in the wind.",
            "sent5": "The bobtails of the rabbit were so fluffy and cute."
        },
        {
            "definition": "A short haircut.",
            "pos": "noun",
            "sent1": "Her bobtails framed her face beautifully.",
            "sent2": "He decided to get a bobtails for a fresh new look.",
            "sent3": "The bobtails made her feel lighter and more energetic.",
            "sent4": "With her new bobtails, she felt like a movie star.",
            "sent5": "The bobtails suited her perfectly, enhancing her features."
        },
        {
            "definition": "A vehicle with a shortened rear end.",
            "pos": "noun",
            "sent1": "The old car had a unique bobtails design.",
            "sent2": "The bobtails was perfect for navigating through narrow streets.",
            "sent3": "Driving the bobtails felt like cruising in style.",
            "sent4": "The sleek bobtails turned heads wherever it went.",
            "sent5": "The bobtails was surprisingly spacious despite its size."
        },
        {
            "definition": "A type of shrimp with a short tail.",
            "pos": "noun",
            "sent1": "The bobtails shrimp was a delicacy in the coastal town.",
            "sent2": "I ordered the bobtails shrimp dish at the restaurant.",
            "sent3": "The bobtails shrimp scurried across the ocean floor.",
            "sent4": "The bobtails shrimp added a burst of flavor to the salad.",
            "sent5": "The bobtails shrimp was small but packed with taste."
        }
    ]
}