{
    "term": "bobtail",
    "meanings": [
        {
            "definition": "A short or shortened tail.",
            "pos": "noun",
            "sent1": "The little kitten had a cute bobtail.",
            "sent2": "The bobtail of the squirrel was fluffy.",
            "sent3": "The bobtail of the bunny made it look like a tiny ball of fur.",
            "sent4": "The bobtail of the mouse was like a tiny brush.",
            "sent5": "The bobtail of the puppy wagged happily."
        },
        {
            "definition": "A horse or dog with a docked tail.",
            "pos": "noun",
            "sent1": "The bobtail dog happily wagged its tail.",
            "sent2": "The bobtail horse trotted gracefully in the field.",
            "sent3": "The bobtail dog's tail looked like it was missing a piece.",
            "sent4": "The bobtail horse's tail was like a flag in the wind.",
            "sent5": "The bobtail dog's tail was short but wagged energetically."
        },
        {
            "definition": "To cut short or dock the tail of an animal.",
            "pos": "verb",
            "sent1": "The vet had to bobtail the cat's tail for its health.",
            "sent2": "The groomer will bobtail the poodle's tail tomorrow.",
            "sent3": "I accidentally bobtailed the bunny's tail too short.",
            "sent4": "The farmer decided to bobtail the cow's tail to prevent accidents.",
            "sent5": "She gently bobtailed the kitten's tail to make it more comfortable."
        },
        {
            "definition": "A truck or trailer with a short rear overhang.",
            "pos": "noun",
            "sent1": "The bobtail truck maneuvered easily in tight spaces.",
            "sent2": "The delivery company used bobtail trucks for quick deliveries.",
            "sent3": "The bobtail truck looked like it had a small tail compared to others.",
            "sent4": "The bobtail trailer was perfect for transporting goods efficiently.",
            "sent5": "The bobtail truck's design allowed for better turning radius."
        }
    ]
}