{
    "term": "bod",
    "meanings": [
        {
            "definition": "The physical structure of a person or animal.",
            "pos": "noun",
            "sent1": "His bod felt tired after a long day of playing outside.",
            "sent2": "She took care of her bod by eating healthy food and exercising.",
            "sent3": "The bod decided to take a nap under the shady tree.",
            "sent4": "Her bod was like a sturdy tree trunk, standing tall and strong.",
            "sent5": "The firefighter's bod was covered in soot after battling the blaze."
        },
        {
            "definition": "A person's body.",
            "pos": "noun",
            "sent1": "Mom asked Tim to wash his bod before dinner.",
            "sent2": "The athlete's bod was in peak condition for the competition.",
            "sent3": "The bod was happy to finally relax in a warm bath.",
            "sent4": "Her bod moved gracefully across the dance floor like a swan.",
            "sent5": "The doctor examined his patient's bod to check for any injuries."
        },
        {
            "definition": "A human being.",
            "pos": "noun",
            "sent1": "Every bod deserves to be treated with kindness and respect.",
            "sent2": "The bod greeted his neighbors with a friendly smile.",
            "sent3": "The bod in the mirror winked back mischievously.",
            "sent4": "She felt like the luckiest bod in the world on her birthday.",
            "sent5": "The teacher encouraged each bod in the class to do their best."
        },
        {
            "definition": "A physical object.",
            "pos": "noun",
            "sent1": "The shiny new car was his dream bod.",
            "sent2": "She carefully packed each fragile bod in bubble wrap.",
            "sent3": "The lost bod turned out to be just a misplaced sock.",
            "sent4": "His favorite bod was the old pocket watch from his grandfather.",
            "sent5": "The artist's masterpiece was a unique bod made of recycled materials."
        }
    ]
}