{
    "term": "body",
    "meanings": [
        {
            "definition": "The physical structure of a person or animal",
            "pos": "noun",
            "sent1": "Her body felt tired after a long day of playing outside.",
            "sent2": "The doctor examined the patient's body to check for any injuries.",
            "sent3": "The body of the teddy bear was filled with soft stuffing.",
            "sent4": "The body of the car was dented after the accident.",
            "sent5": "The body of the tree stood tall and strong in the forest."
        },
        {
            "definition": "A group of people or things",
            "pos": "noun",
            "sent1": "The search party formed a body to look for the lost hiker.",
            "sent2": "The body of students gathered in the school auditorium for the assembly.",
            "sent3": "The body of volunteers worked together to clean up the park.",
            "sent4": "The body of evidence presented in court proved the defendant's guilt.",
            "sent5": "The body of protesters marched through the streets demanding change."
        },
        {
            "definition": "The main or central part of something",
            "pos": "noun",
            "sent1": "The body of the essay should contain the main arguments.",
            "sent2": "The body of the machine houses the important components.",
            "sent3": "The body of the story revealed the unexpected twist.",
            "sent4": "The body of the song featured a catchy chorus.",
            "sent5": "The body of the presentation highlighted the key points."
        },
        {
            "definition": "The main part of a book or document",
            "pos": "noun",
            "sent1": "The body of the novel described the protagonist's journey.",
            "sent2": "In the body of the report, you will find detailed analysis.",
            "sent3": "The body of the manual provided step-by-step instructions.",
            "sent4": "The body of the thesis explored new research findings.",
            "sent5": "The body of the textbook covered various topics in depth."
        },
        {
            "definition": "A large amount or collection of something",
            "pos": "noun",
            "sent1": "She received a body of work to complete by the end of the week.",
            "sent2": "The library had a body of books on different subjects.",
            "sent3": "The body of water stretched out as far as the eye could see.",
            "sent4": "The body of evidence supported the scientist's theory.",
            "sent5": "The body of knowledge in the field continues to expand."
        }
    ]
}