{
    "term": "bodychecks",
    "meanings": [
        {
            "definition": "A physical collision between two players in a contact sport, typically involving the use of the body to impede or disrupt the movement of an opponent.",
            "pos": "noun",
            "sent1": "During the game, the player delivered a powerful bodycheck to his opponent.",
            "sent2": "In hockey, bodychecks are a common way to gain possession of the puck.",
            "sent3": "The coach joked that the player's bodycheck was so strong, it looked like a superhero move.",
            "sent4": "The impact of the bodycheck echoed through the arena, silencing the crowd momentarily.",
            "sent5": "The player's bodycheck was so forceful, it left a lasting impression on everyone who witnessed it."
        },
        {
            "definition": "To make physical contact with an opponent using one's body in a contact sport.",
            "pos": "verb",
            "sent1": "She bodychecks her opponents strategically to gain an advantage.",
            "sent2": "Players often bodycheck each other to assert dominance on the field.",
            "sent3": "He bodychecks with precision, always aiming to surprise his opponents.",
            "sent4": "The player bodychecks swiftly, leaving no room for the opponent to react.",
            "sent5": "Bodychecking is a crucial skill for any player in a contact sport."
        },
        {
            "definition": "The act of using one's body to block or impede the movement of an opponent in a contact sport.",
            "pos": "noun",
            "sent1": "His quick bodycheck prevented the opponent from scoring a goal.",
            "sent2": "Bodychecks are essential for defense in many contact sports.",
            "sent3": "The player's bodycheck was so unexpected, it caught the opponent off guard.",
            "sent4": "The bodycheck served as a barrier, halting the opponent's progress.",
            "sent5": "The coach praised the player for executing a perfect bodycheck at a crucial moment."
        }
    ]
}