{
    "term": "bogie",
    "meanings": [
        {
            "definition": "A small railway truck or car typically used in mines.",
            "pos": "noun",
            "sent1": "The miners loaded the coal onto the bogie to transport it out of the mine.",
            "sent2": "The bogie rattled along the tracks carrying heavy loads of ore.",
            "sent3": "The mischievous gnomes decided to take a joyride on the empty bogie, causing chaos in the mine.",
            "sent4": "The bogie rolled through the dark tunnels like a faithful workhorse, never tiring.",
            "sent5": "The rusty bogie creaked and groaned under the weight of the rocks, echoing in the cavern."
        },
        {
            "definition": "A ghost or goblin.",
            "pos": "noun",
            "sent1": "The children told spooky stories about the bogie that haunted the old graveyard.",
            "sent2": "Legend has it that a mischievous bogie lurks in the shadows, playing pranks on unsuspecting travelers.",
            "sent3": "The friendly bogie decided to help the lost hikers find their way back to the trail.",
            "sent4": "The eerie mist enveloped the bogie, making it appear even more ghostly in the moonlight.",
            "sent5": "The villagers whispered about the mysterious bogie that only appeared on foggy nights, vanishing before dawn."
        },
        {
            "definition": "A type of wheel or roller used in machinery.",
            "pos": "noun",
            "sent1": "The mechanic replaced the worn-out bogie on the conveyor belt to keep it running smoothly.",
            "sent2": "The heavy machinery relied on sturdy bogies to move parts along the assembly line.",
            "sent3": "The playful kitten got its paw stuck in the bogie of the spinning wheel, causing a temporary halt in production.",
            "sent4": "The bogie spun faster and faster, resembling a whirlwind of motion in the factory.",
            "sent5": "The shiny new bogie gleamed under the fluorescent lights, a symbol of efficiency in the workshop."
        },
        {
            "definition": "A type of marshland plant.",
            "pos": "noun",
            "sent1": "The bogie thrived in the damp soil of the marsh, its leaves glistening with dew.",
            "sent2": "Birds nested among the tall stalks of the bogie, finding shelter in its dense foliage.",
            "sent3": "The mischievous frog used the bogie as a hiding spot, camouflaging itself among the green leaves.",
            "sent4": "The bogie swayed gently in the breeze, a verdant oasis in the midst of the marshland.",
            "sent5": "The delicate flowers of the bogie attracted butterflies, adding a splash of color to the wetlands."
        }
    ]
}