{
    "term": "bohemians",
    "meanings": [
        {
            "definition": "A person, especially an artist or writer, who lives an unconventional and carefree lifestyle.",
            "pos": "noun",
            "sent1": "The bohemians gathered in the park to share their poetry and music.",
            "sent2": "I admire the bohemians for their creativity and free-spirited nature.",
            "sent3": "The bohemians decided to have a picnic in the middle of the night, just for fun.",
            "sent4": "Her room looked like the den of bohemians, with colorful tapestries and mismatched furniture.",
            "sent5": "The streets came alive with the presence of bohemians, adding a touch of magic to the city."
        },
        {
            "definition": "A group of people who reject societal norms and live an unconventional lifestyle.",
            "pos": "noun",
            "sent1": "The bohemians in the neighborhood were known for their unique fashion sense.",
            "sent2": "We joined the bohemians for a bonfire on the beach, enjoying their stories and laughter.",
            "sent3": "The bohemians threw a costume party where everyone dressed as historical figures.",
            "sent4": "In the sea of conformity, the bohemians stood out like vibrant flowers in a field of grass.",
            "sent5": "The bohemians' community garden was a colorful oasis in the midst of the city."
        },
        {
            "definition": "Of or relating to the unconventional lifestyle or attitudes associated with bohemians.",
            "pos": "adjective",
            "sent1": "She decorated her apartment in a bohemians style, with tapestries and fairy lights.",
            "sent2": "The cafe had a bohemians vibe, attracting artists and musicians from all around.",
            "sent3": "His bohemians outlook on life led him to pursue a career in street art.",
            "sent4": "The bohemians spirit of the festival brought together people from all walks of life.",
            "sent5": "The bohemians influence could be seen in the colorful murals that adorned the city walls."
        }
    ]
}