{
    "term": "boilers",
    "meanings": [
        {
            "definition": "A vessel or tank in which water or other fluid is heated to generate steam or hot water.",
            "pos": "noun",
            "sent1": "The boilers in the basement provide heat for the whole building.",
            "sent2": "The factory installed new boilers to improve efficiency.",
            "sent3": "The chef accidentally mistook the dishwasher for a boiler and tried to heat water in it.",
            "sent4": "Her anger was like a boiling pot on the stove, ready to explode like a malfunctioning boiler.",
            "sent5": "The old, rusty boilers clanked and hissed, filling the room with warmth and noise."
        },
        {
            "definition": "A person who boils something.",
            "pos": "noun",
            "sent1": "The boilers in the kitchen were busy preparing the pasta for dinner.",
            "sent2": "The chef, a skilled boiler, knew exactly how long to cook the vegetables.",
            "sent3": "The little boy proudly declared himself the official boiler of eggs in the family.",
            "sent4": "She was a master boiler, turning raw ingredients into delicious meals with ease.",
            "sent5": "The campfire was surrounded by eager boilers, ready to cook their favorite foods."
        },
        {
            "definition": "A machine used for boiling.",
            "pos": "noun",
            "sent1": "The industrial boilers at the plant worked tirelessly to process the raw materials.",
            "sent2": "The kitchen had a state-of-the-art boiler for cooking large batches of soup.",
            "sent3": "The malfunctioning boiler in the lab caused a small explosion, surprising everyone.",
            "sent4": "The old boiler in the house chugged along, faithfully boiling water for tea every morning.",
            "sent5": "The shiny new boiler hummed with efficiency, making cooking a breeze for the chef."
        }
    ]
}