{
    "term": "bolometric",
    "meanings": [
        {
            "definition": "Relating to or involving measurements of the total energy emitted by a celestial body",
            "pos": "adjective",
            "sent1": "The scientist used a bolometric instrument to study the energy from the star.",
            "sent2": "The bolometric data showed the overall energy output of the galaxy.",
            "sent3": "The bolometric tool hummed happily as it analyzed the star's energy.",
            "sent4": "Her eyes sparkled with a bolometric understanding of the universe's brightness.",
            "sent5": "The bolometric measurement painted a vivid picture of the celestial body's energy."
        },
        {
            "definition": "Of or relating to a device that measures the total energy emitted by a celestial body",
            "pos": "adjective",
            "sent1": "The bolometric device was carefully calibrated to capture accurate energy readings.",
            "sent2": "Scientists rely on bolometric tools to gather data about cosmic energy emissions.",
            "sent3": "The bolometric gadget beeped cheerfully as it recorded the star's energy levels.",
            "sent4": "His mind worked like a bolometric sensor, absorbing every detail of the celestial body's energy.",
            "sent5": "The bolometric equipment illuminated the mysteries of the universe's energy sources."
        },
        {
            "definition": "Measuring the total energy emitted by a celestial body",
            "pos": "noun",
            "sent1": "The bolometric revealed the immense energy output of the distant star.",
            "sent2": "Astronomers use a bolometric to quantify the energy radiated by galaxies.",
            "sent3": "The bolometric sat quietly on the desk, ready to calculate the star's energy.",
            "sent4": "In her hand, the bolometric felt like a magic wand revealing the celestial body's energy secrets.",
            "sent5": "The bolometric's reading was like a window into the celestial body's energetic soul."
        }
    ]
}