{
    "term": "bolometer",
    "meanings": [
        {
            "definition": "A device for measuring the energy of electromagnetic radiation, especially heat radiation, by changes in electrical resistance.",
            "pos": "noun",
            "sent1": "The scientist used a bolometer to measure the heat from the sun.",
            "sent2": "The bolometer showed an increase in electrical resistance as the temperature rose.",
            "sent3": "The bolometer decided it was too hot to work and went on strike.",
            "sent4": "Her passion for science was like a bolometer, always detecting the warmth of discovery.",
            "sent5": "The bolometer hummed with excitement as it detected the incoming radiation."
        },
        {
            "definition": "A type of thermometer that measures radiant energy by changes in electrical resistance.",
            "pos": "noun",
            "sent1": "The bolometer displayed the temperature change through its electrical resistance.",
            "sent2": "Using a bolometer, the scientist could accurately measure the radiant energy in the room.",
            "sent3": "The bolometer felt proud whenever it accurately measured the radiant energy.",
            "sent4": "Her determination to succeed was like a bolometer, always adapting to changes in energy.",
            "sent5": "The bolometer's needle danced with each fluctuation in radiant energy."
        },
        {
            "definition": "An instrument used to detect and measure infrared radiation.",
            "pos": "noun",
            "sent1": "The bolometer quickly identified the presence of infrared radiation in the room.",
            "sent2": "With the bolometer in hand, she could easily detect infrared radiation.",
            "sent3": "The bolometer enjoyed its job of spotting infrared radiation like a detective.",
            "sent4": "Her intuition was like a bolometer, always sensing the hidden infrared radiation.",
            "sent5": "The bolometer beeped happily as it successfully detected the infrared radiation."
        }
    ]
}