{
    "term": "bolshevism",
    "meanings": [
        {
            "definition": "The political ideology of the Bolsheviks, advocating revolutionary socialism and the establishment of a dictatorship of the proletariat.",
            "pos": "noun",
            "sent1": "In history class, we learned about bolshevism and how it aimed to bring big changes.",
            "sent2": "During the revolution, bolshevism played a significant role in shaping the new government.",
            "sent3": "The idea of bolshevism leading to a 'proletariat dictatorship' sounds like a plot twist in a movie.",
            "sent4": "Her passion for bolshevism was like a blazing fire, unstoppable and fierce.",
            "sent5": "The concept of bolshevism is like a bright beacon guiding the way for social change."
        },
        {
            "definition": "The policies and practices associated with the Bolsheviks, particularly during the Russian Revolution of 1917.",
            "pos": "noun",
            "sent1": "The impact of bolshevism on the country's governance was profound.",
            "sent2": "People studied the history of bolshevism to understand the revolution better.",
            "sent3": "The strict rules of bolshevism made everyone follow the same path, like a synchronized dance.",
            "sent4": "The influence of bolshevism was like a powerful wave, reshaping society.",
            "sent5": "The legacy of bolshevism echoes through time, reminding us of past struggles and triumphs."
        },
        {
            "definition": "A member or supporter of the Bolshevik party.",
            "pos": "noun",
            "sent1": "She proudly called herself a bolshevism advocate, standing up for the party's beliefs.",
            "sent2": "Many bolshevism members gathered to discuss their plans for the future.",
            "sent3": "Being a bolshevism follower felt like being part of an exclusive club with a secret handshake.",
            "sent4": "His dedication to bolshevism was unwavering, like a compass pointing north.",
            "sent5": "The unity among bolshevism supporters was like a strong bond that could not be broken."
        }
    ]
}