{
    "term": "bolster",
    "meanings": [
        {
            "definition": "Support or strengthen",
            "pos": "verb",
            "sent1": "She used extra pillows to bolster her back while sitting on the chair.",
            "sent2": "The team worked together to bolster their chances of winning the game.",
            "sent3": "The superhero's cape seemed to bolster his courage in the face of danger.",
            "sent4": "Kind words can bolster someone's spirit like a warm embrace.",
            "sent5": "The sturdy bridge pillars bolstered the weight of the passing trucks."
        },
        {
            "definition": "A long, narrow pillow or cushion",
            "pos": "noun",
            "sent1": "She placed the bolster behind her head for extra comfort while reading.",
            "sent2": "The yoga studio provided soft bolsters for the participants during relaxation exercises.",
            "sent3": "The cat curled up on the cozy bolster and purred contentedly.",
            "sent4": "The bolster on the couch added a touch of elegance to the room.",
            "sent5": "The bolster on the bed matched the color scheme of the bedroom perfectly."
        },
        {
            "definition": "To prop up or reinforce",
            "pos": "verb",
            "sent1": "He used wooden beams to bolster the structure of the old house.",
            "sent2": "The additional support beams helped bolster the weakened ceiling.",
            "sent3": "The idea of a vacation helped bolster his spirits during a stressful week.",
            "sent4": "Laughter can sometimes bolster a person's resolve more than any advice.",
            "sent5": "The friendship between the two countries helped bolster their economies."
        },
        {
            "definition": "To boost or improve",
            "pos": "verb",
            "sent1": "Eating healthy foods can bolster your overall health and well-being.",
            "sent2": "Regular exercise can bolster your energy levels and mood.",
            "sent3": "The unexpected compliment bolstered her confidence before the presentation.",
            "sent4": "A good night's sleep can bolster your ability to focus and concentrate.",
            "sent5": "Positive feedback can bolster a student's motivation to learn and grow."
        }
    ]
}