{
    "term": "bolting",
    "meanings": [
        {
            "definition": "To run away suddenly",
            "pos": "verb",
            "sent1": "The rabbit was bolting across the field when it saw the fox.",
            "sent2": "The thief was bolting from the scene of the crime before anyone could catch him.",
            "sent3": "The squirrel was bolting up the tree when it heard a loud noise.",
            "sent4": "The startled deer was bolting through the forest as if chased by shadows.",
            "sent5": "The horse was bolting wildly, its mane flying in the wind."
        },
        {
            "definition": "A metal fastener",
            "pos": "noun",
            "sent1": "The carpenter used a bolting to secure the wooden planks together.",
            "sent2": "She tightened the bolting on the gate to keep it closed.",
            "sent3": "The old chest was locked with a rusty bolting.",
            "sent4": "The ancient door had intricate bolting made of brass.",
            "sent5": "The mechanic replaced the broken bolting with a new one."
        },
        {
            "definition": "A sudden movement or start",
            "pos": "noun",
            "sent1": "The car made a sudden bolting forward when the driver hit the gas pedal.",
            "sent2": "The unexpected noise caused a bolting of the birds from the trees.",
            "sent3": "The magician's trick involved a bolting of colorful scarves from his sleeve.",
            "sent4": "The thunderstorm began with a bolting of lightning across the sky.",
            "sent5": "The audience was surprised by the sudden bolting of confetti during the performance."
        },
        {
            "definition": "To sift through a sieve",
            "pos": "verb",
            "sent1": "She was bolting the flour to remove any lumps before baking.",
            "sent2": "The chef carefully bolted the powdered sugar for the dessert.",
            "sent3": "He was bolting the sand to separate the tiny shells from it.",
            "sent4": "The baker was bolting the cocoa powder to make it finer for the cake.",
            "sent5": "The gardener was bolting the soil to prepare it for planting seeds."
        }
    ]
}