{
    "term": "bolt",
    "meanings": [
        {
            "definition": "A metal rod or pin for fastening objects together",
            "pos": "noun",
            "sent1": "The carpenter used a bolt to attach the shelf to the wall.",
            "sent2": "She tightened the bolt to secure the bicycle seat in place.",
            "sent3": "The mischievous squirrel tried to hide its acorn stash in the bolt holes.",
            "sent4": "His loyalty was like a bolt, holding the team together through tough times.",
            "sent5": "The bolt gleamed in the sunlight, a small but crucial piece of the structure."
        },
        {
            "definition": "A sudden movement or run",
            "pos": "noun",
            "sent1": "With a bolt, the rabbit darted into its burrow to escape the fox.",
            "sent2": "The loud noise made the horse startle and take off in a bolt.",
            "sent3": "The bolt of lightning across the sky startled the birds from their perches.",
            "sent4": "Her heart raced like a bolt, quick and unpredictable.",
            "sent5": "The bolt of excitement in his chest urged him to take a leap of faith."
        },
        {
            "definition": "To secure or lock with a bolt",
            "pos": "verb",
            "sent1": "He decided to bolt the door shut to keep the intruders out.",
            "sent2": "She quickly bolted the window to prevent it from rattling in the wind.",
            "sent3": "The mischievous puppy managed to bolt the gate open and escape.",
            "sent4": "His words seemed to bolt her heart, leaving her feeling vulnerable.",
            "sent5": "She felt the need to bolt her emotions away, locking them deep inside."
        },
        {
            "definition": "To move quickly and suddenly",
            "pos": "verb",
            "sent1": "The cat suddenly bolted across the room chasing after a toy.",
            "sent2": "Startled by the noise, he bolted out of his chair and ran to the window.",
            "sent3": "The children bolted towards the ice cream truck as soon as they heard the music.",
            "sent4": "Her heart seemed to bolt with excitement as she saw her favorite band on stage.",
            "sent5": "The idea of a new adventure made her bolt with anticipation, ready to explore."
        }
    ]
}