{
    "term": "bomas",
    "meanings": [
        {
            "definition": "A traditional African livestock enclosure made of thorn bushes.",
            "pos": "noun",
            "sent1": "The farmers built bomas to protect their animals from wild animals.",
            "sent2": "Visiting a boma is a great way to learn about traditional African farming practices.",
            "sent3": "The mischievous monkeys tried to sneak into the boma but got pricked by the thorn bushes.",
            "sent4": "The boma stood like a fortress, guarding the livestock against any danger.",
            "sent5": "The bomas dotted the landscape, creating a unique and protective barrier for the animals."
        },
        {
            "definition": "A type of traditional Kenyan dance.",
            "pos": "noun",
            "sent1": "The dancers moved gracefully to the rhythm of the boma, telling stories through their movements.",
            "sent2": "Attending a boma performance is a vibrant and cultural experience.",
            "sent3": "The children giggled as they attempted to imitate the boma dancers' energetic steps.",
            "sent4": "Her dance was like a boma, captivating everyone with its beauty and tradition.",
            "sent5": "The boma dance echoed through the night, filling the air with joy and celebration."
        },
        {
            "definition": "A type of traditional Kenyan music.",
            "pos": "noun",
            "sent1": "The rhythmic beats of the boma resonated through the village, bringing people together in harmony.",
            "sent2": "Listening to boma music is a delightful way to experience Kenyan culture.",
            "sent3": "The boma melodies floated in the air, enchanting all who heard them.",
            "sent4": "His voice was like a boma, strong and captivating in its traditional essence.",
            "sent5": "The boma songs painted a vivid picture of Kenyan traditions and values."
        }
    ]
}