{
    "term": "bonds",
    "meanings": [
        {
            "definition": "A strong force of attraction that holds atoms together in a molecule.",
            "pos": "noun",
            "sent1": "The bonds between the atoms in the molecule are very strong.",
            "sent2": "Chemists study how bonds form between different atoms.",
            "sent3": "The oxygen atom joked with the hydrogen atom about their bond in water.",
            "sent4": "The bond between the carbon atoms was like a chain linking them together.",
            "sent5": "The bond between the sodium and chlorine atoms was like a magnetic pull."
        },
        {
            "definition": "A physical restraint used to hold someone prisoner.",
            "pos": "noun",
            "sent1": "The detective used handcuffs as bonds to secure the suspect.",
            "sent2": "Prison guards ensure the bonds are strong enough to prevent escape.",
            "sent3": "The magician pretended the rope was magical bonds holding him.",
            "sent4": "The bonds around the prisoner were like unbreakable chains.",
            "sent5": "The bonds on the criminal were as tight as a hug from a bear."
        },
        {
            "definition": "A close relationship between people or groups based on shared feelings or interests.",
            "pos": "noun",
            "sent1": "The siblings shared a special bond that kept them close.",
            "sent2": "Friendship bonds can last a lifetime.",
            "sent3": "The bond between the cat and the dog was a funny sight.",
            "sent4": "Their bond was like a bridge connecting their hearts.",
            "sent5": "The bond between the teammates was as strong as steel."
        },
        {
            "definition": "A certificate of debt issued by a government or company, promising to pay back a borrowed amount with interest.",
            "pos": "noun",
            "sent1": "Investors buy bonds to earn interest from the government.",
            "sent2": "Companies issue bonds to raise funds for expansion.",
            "sent3": "The bond between the investor and the company was financial.",
            "sent4": "The bond certificate was like a promise to repay the loan.",
            "sent5": "The bond between the bank and the borrower was a financial agreement."
        }
    ]
}