{
    "term": "bond",
    "meanings": [
        {
            "definition": "A physical connection between two objects",
            "pos": "noun",
            "sent1": "The strong bond between the two magnets kept them together.",
            "sent2": "The rope formed a secure bond between the two trees.",
            "sent3": "The bond between the keys and the magnet made a funny jingling sound.",
            "sent4": "The bond between the siblings was unbreakable, like a chain linking them together.",
            "sent5": "The bond between the train cars was so tight, they moved as one unit."
        },
        {
            "definition": "A close relationship between people",
            "pos": "noun",
            "sent1": "The bond between the twins was evident in their shared laughter.",
            "sent2": "The bond between the coach and the players was built on trust and respect.",
            "sent3": "The bond between the friends was so strong, they finished each other's sentences.",
            "sent4": "The bond between the dog and its owner was like a loyal companion always by their side.",
            "sent5": "The bond between the teacher and the students created a supportive learning environment."
        },
        {
            "definition": "A written agreement to repay borrowed money",
            "pos": "noun",
            "sent1": "The bond stated the terms of repayment for the loan.",
            "sent2": "The bond between the borrower and the lender outlined the financial agreement.",
            "sent3": "The bond between the debtor and the creditor was signed with a flourish.",
            "sent4": "The bond represented a legal commitment to fulfill the financial obligation.",
            "sent5": "The bond document was a binding agreement to repay the borrowed funds."
        },
        {
            "definition": "A chemical link between atoms in a molecule",
            "pos": "noun",
            "sent1": "The covalent bond between the atoms shared electrons.",
            "sent2": "The ionic bond formed when atoms transferred electrons.",
            "sent3": "The hydrogen bond between the molecules was like a tiny magnet.",
            "sent4": "The peptide bond held the amino acids together in the protein structure.",
            "sent5": "The bond between the elements created a stable compound."
        }
    ]
}