{
    "term": "bonded",
    "meanings": [
        {
            "definition": "Joined or connected together",
            "pos": "adjective",
            "sent1": "The two friends were bonded by their shared love for music.",
            "sent2": "The pieces of the puzzle were bonded tightly together.",
            "sent3": "The superhero's cape was bonded to his costume, making it impossible to lose in battle.",
            "sent4": "The memories of that special day were bonded in her mind forever.",
            "sent5": "The strong glue bonded the broken pieces of the vase back together seamlessly."
        },
        {
            "definition": "Secured by a bond or agreement",
            "pos": "adjective",
            "sent1": "The bonded contract ensured both parties would fulfill their obligations.",
            "sent2": "The bonded agreement was signed and sealed by the two companies.",
            "sent3": "The bonded promise between friends was unbreakable.",
            "sent4": "Their friendship was like a bonded pact, unbreakable and trustworthy.",
            "sent5": "The bonded deal was legally binding and protected both parties."
        },
        {
            "definition": "Covered or protected with a layer of material",
            "pos": "adjective",
            "sent1": "The bonded leather jacket kept him warm in the cold weather.",
            "sent2": "The table was bonded with a layer of protective varnish.",
            "sent3": "She wore a bonded raincoat to stay dry during the storm.",
            "sent4": "The house had bonded insulation to keep it warm in winter.",
            "sent5": "The car's windshield was bonded with a special coating to prevent glare."
        },
        {
            "definition": "Having a close emotional relationship",
            "pos": "adjective",
            "sent1": "The siblings were bonded by their shared childhood memories.",
            "sent2": "The couple's love for each other bonded them together through thick and thin.",
            "sent3": "Their bonded friendship was evident in the way they always supported each other.",
            "sent4": "The team was bonded like a family, always looking out for one another.",
            "sent5": "The pet and its owner were bonded in a special way that words could not describe."
        }
    ]
}