{
    "term": "bone",
    "meanings": [
        {
            "definition": "Any of the pieces of hard, whitish tissue making up the skeleton in humans and other vertebrates.",
            "pos": "noun",
            "sent1": "The dog buried a bone in the backyard.",
            "sent2": "She fell and broke a bone in her arm.",
            "sent3": "The cat chased its tail, thinking it was a bone.",
            "sent4": "His words cut deep, like a bone in my heart.",
            "sent5": "The ancient bone displayed in the museum was fascinating."
        },
        {
            "definition": "The hard tissue of which bones are made.",
            "pos": "noun",
            "sent1": "The doctor studied the bone under the microscope.",
            "sent2": "Calcium is essential for strong bones.",
            "sent3": "The bone in the soup added flavor to the dish.",
            "sent4": "Her determination was as solid as bone.",
            "sent5": "The bone structure of the building was impressive."
        },
        {
            "definition": "A thing resembling a bone, such as a piece of meat with a bone in it.",
            "pos": "noun",
            "sent1": "She gnawed on the bone of a chicken wing.",
            "sent2": "The toy was shaped like a bone for the dog to chew on.",
            "sent3": "He held the wishbone, hoping for good luck.",
            "sent4": "The tree branches intertwined like bones in a puzzle.",
            "sent5": "The boat's hull was as sturdy as a bone."
        },
        {
            "definition": "To remove the bones from (meat or fish).",
            "pos": "verb",
            "sent1": "She carefully boned the fish before cooking it.",
            "sent2": "The chef taught him how to bone a chicken.",
            "sent3": "He accidentally boned the steak too much, leaving it dry.",
            "sent4": "The butcher skillfully boned the meat for the customer.",
            "sent5": "Remember to bone the fish before grilling it."
        }
    ]
}