{
    "term": "boo",
    "meanings": [
        {
            "definition": "A sound made to express disapproval or contempt.",
            "pos": "noun",
            "sent1": "The audience let out a loud boo when the actor forgot his lines.",
            "sent2": "I heard a boo from the crowd when the referee made a bad call.",
            "sent3": "At the comedy show, the comedian pretended to boo himself for telling a bad joke.",
            "sent4": "The boo from the crowd felt like a cold wind of disapproval.",
            "sent5": "The boo echoed in the auditorium, leaving a sense of negativity in the air."
        },
        {
            "definition": "A term of endearment used to refer to a romantic partner.",
            "pos": "noun",
            "sent1": "My boo surprised me with flowers on our anniversary.",
            "sent2": "I love spending time with my boo, watching movies and cuddling.",
            "sent3": "When my boo smiles, my heart feels warm and fuzzy.",
            "sent4": "She whispered 'goodnight, boo' before falling asleep in my arms.",
            "sent5": "Walking hand in hand with my boo makes me feel happy and loved."
        },
        {
            "definition": "To startle or frighten someone.",
            "pos": "verb",
            "sent1": "The sudden noise in the dark alley managed to boo me.",
            "sent2": "I tried to boo my friend by jumping out from behind the door.",
            "sent3": "The cat likes to hide and boo me when I walk into the room.",
            "sent4": "The unexpected thunderstorm managed to boo the children playing outside.",
            "sent5": "The horror movie scene was so intense that it could boo anyone in the audience."
        },
        {
            "definition": "To show disapproval or contempt towards someone.",
            "pos": "verb",
            "sent1": "She would always boo at the TV when her least favorite character appeared.",
            "sent2": "The fans started to boo loudly when the opposing team scored a goal.",
            "sent3": "I playfully booed my friend for wearing mismatched socks to the party.",
            "sent4": "The judge had to calm the courtroom when the spectators began to boo.",
            "sent5": "The audience's collective boo was a clear sign of their dissatisfaction with the performance."
        }
    ]
}