{
    "term": "boogy",
    "meanings": [
        {
            "definition": "A style of dance popular in the 1960s.",
            "pos": "noun",
            "sent1": "At the party, everyone joined in the boogy.",
            "sent2": "The DJ played a catchy boogy that got everyone on the dance floor.",
            "sent3": "The boogy at the school talent show was full of fun twists and turns.",
            "sent4": "The boogy of the disco era still echoes in modern dance moves.",
            "sent5": "Her boogy was so infectious, it spread to the whole crowd."
        },
        {
            "definition": "A piece of music that inspires dancing.",
            "pos": "noun",
            "sent1": "The upbeat boogy had everyone tapping their feet.",
            "sent2": "The classic rock band played a boogy that had the audience on their feet.",
            "sent3": "The catchy boogy played on the radio made her want to dance.",
            "sent4": "The lively boogy filled the room with energy and joy.",
            "sent5": "His favorite boogy always put him in a good mood."
        },
        {
            "definition": "To dance energetically and enthusiastically.",
            "pos": "verb",
            "sent1": "She loved to boogy to her favorite songs.",
            "sent2": "The kids started to boogy as soon as the music began.",
            "sent3": "They decided to boogy all night long at the dance party.",
            "sent4": "The friends boogied together in perfect harmony.",
            "sent5": "He couldn't help but boogy when the beat dropped."
        },
        {
            "definition": "A ghost or spirit, especially one that causes mischief.",
            "pos": "noun",
            "sent1": "The old house was said to be haunted by a mischievous boogy.",
            "sent2": "Children love to tell stories about the friendly boogy in the attic.",
            "sent3": "The mischievous boogy was blamed for the disappearing cookies.",
            "sent4": "The legend of the boogy in the forest scared the campers.",
            "sent5": "She pretended to be a boogy to play a prank on her friends."
        }
    ]
}