{
    "term": "boogaloo",
    "meanings": [
        {
            "definition": "A style of Latin music and dance originating in New York City in the 1960s.",
            "pos": "noun",
            "sent1": "At the dance competition, the performers showcased their best boogaloo moves.",
            "sent2": "The band played a catchy boogaloo tune that got everyone on their feet.",
            "sent3": "The family reunion turned into a boogaloo fest with music and dancing all night.",
            "sent4": "The boogaloo rhythm filled the room, making it impossible not to tap your feet.",
            "sent5": "The boogaloo beat was so infectious, even those who claimed they couldn't dance joined in."
        },
        {
            "definition": "A lively and rhythmic dance performed to this style of music.",
            "pos": "noun",
            "sent1": "During the dance class, the instructor taught the students the classic boogaloo steps.",
            "sent2": "The crowd cheered as the dancers showcased their energetic boogaloo routine.",
            "sent3": "The wedding reception turned into a boogaloo dance-off between the bride and groom.",
            "sent4": "Her feet moved in perfect harmony with the boogaloo music, mesmerizing everyone around.",
            "sent5": "The boogaloo dance competition was fierce, with each participant bringing their unique style to the floor."
        },
        {
            "definition": "A lively and spirited party or celebration.",
            "pos": "noun",
            "sent1": "The neighborhood block party was a true boogaloo with music, food, and laughter.",
            "sent2": "Everyone had a blast at the boogaloo thrown by the local community center.",
            "sent3": "The office holiday party turned into a boogaloo with colleagues dancing and having fun.",
            "sent4": "The boogaloo celebration lasted until the early hours of the morning, with no one wanting to leave.",
            "sent5": "The town's annual boogaloo festival brought people together for a day of joy and festivity."
        }
    ]
}