{
    "term": "boogeys",
    "meanings": [
        {
            "definition": "A piece of dried mucus in the nose.",
            "pos": "noun",
            "sent1": "Tommy wiped away the boogeys from his nose with a tissue.",
            "sent2": "The little girl giggled as she picked out the boogeys from her nostril.",
            "sent3": "The boogeys in his nose seemed to have a mind of their own, always reappearing when least expected.",
            "sent4": "The boogeys in the tissue looked like tiny jellyfish washed up on the shore.",
            "sent5": "The doctor explained that boogeys are a natural way for the body to get rid of dust and germs."
        },
        {
            "definition": "To dance in a wild or uninhibited manner.",
            "pos": "verb",
            "sent1": "At the party, everyone started to boogeys to the lively music.",
            "sent2": "The children boogeys around the living room, laughing and twirling.",
            "sent3": "The penguin tried to boogeys on the ice but ended up slipping comically instead.",
            "sent4": "The flames flickered and danced like boogeys in the wind.",
            "sent5": "The dancers' feet moved in perfect harmony as they boogeys across the stage."
        },
        {
            "definition": "A ghost or mythical creature used to scare children.",
            "pos": "noun",
            "sent1": "The children whispered stories of boogeys hiding in the closet.",
            "sent2": "The old house was said to be haunted by mischievous boogeys.",
            "sent3": "The little boy pretended to be a boogeys to scare his sister.",
            "sent4": "The fog rolled in, creating an eerie atmosphere perfect for boogeys to appear.",
            "sent5": "The movie depicted boogeys as friendly creatures who just wanted to play tricks."
        },
        {
            "definition": "To avoid or evade something.",
            "pos": "verb",
            "sent1": "She tried to boogeys the question by changing the topic.",
            "sent2": "The cat managed to boogeys the dog by sneaking through the back door.",
            "sent3": "The student attempted to boogeys the teacher's gaze by pretending to be engrossed in the textbook.",
            "sent4": "The spy was skilled at boogeys detection by blending into the crowd.",
            "sent5": "The rabbit darted through the bushes, expertly boogeys the hunter's sight."
        }
    ]
}