{
    "term": "boohs",
    "meanings": [
        {
            "definition": "A loud, sudden cry or sound, especially expressing fear or surprise.",
            "pos": "noun",
            "sent1": "The unexpected boohs from the haunted house scared the children.",
            "sent2": "The boohs of the thunderstorm made the dog hide under the bed.",
            "sent3": "The spooky ghost let out boohs to surprise the trick-or-treaters.",
            "sent4": "The boohs of the wind in the night sounded like ghostly whispers.",
            "sent5": "Her boohs echoed through the empty hallway, sending shivers down my spine."
        },
        {
            "definition": "To make a loud, sudden cry or sound, especially expressing fear or surprise.",
            "pos": "verb",
            "sent1": "When the clown jumped out, she boohs loudly in shock.",
            "sent2": "The child likes to boohs when playing hide-and-seek to scare others.",
            "sent3": "He tried to boohs his sister, but she saw him coming and laughed instead.",
            "sent4": "The sudden noise boohs the birds into flight from the trees.",
            "sent5": "As the horror movie reached its climax, the audience began to boohs in fear."
        },
        {
            "definition": "A sound made to scare or startle someone.",
            "pos": "noun",
            "sent1": "The haunted house had hidden speakers that played eerie boohs.",
            "sent2": "She recorded her own boohs to use as a Halloween prank.",
            "sent3": "The cat's meow turned into a playful boohs when it saw a mouse.",
            "sent4": "The boohs from the bushes turned out to be just a squirrel rustling the leaves.",
            "sent5": "The boohs coming from the closet were revealed to be a mischievous sibling playing a trick."
        },
        {
            "definition": "To scare or startle someone with a loud sound.",
            "pos": "verb",
            "sent1": "The ghost tried to boohs the visitors by suddenly appearing in the mirror.",
            "sent2": "She would often boohs her brother by hiding behind doors and jumping out.",
            "sent3": "The loud boohs from the movie made her spill her popcorn in surprise.",
            "sent4": "The prankster liked to boohs his friends by popping balloons behind them.",
            "sent5": "The unexpected boohs in the quiet room made everyone jump in their seats."
        }
    ]
}