{
    "term": "booky",
    "meanings": [
        {
            "definition": "Resembling or characteristic of a book.",
            "pos": "adjective",
            "sent1": "The old library had a booky smell of dusty pages and leather bindings.",
            "sent2": "Her booky glasses and love for reading made her the perfect candidate for the book club.",
            "sent3": "The booky cover of the novel seemed to whisper secrets to anyone who dared to open it.",
            "sent4": "The booky atmosphere of the bookstore enveloped her like a warm literary hug.",
            "sent5": "The booky texture of the paper made her fingertips tingle with anticipation."
        },
        {
            "definition": "Tending to read or collect books.",
            "pos": "adjective",
            "sent1": "He was known as the booky kid in school because he always had a novel in hand.",
            "sent2": "Her booky habits led her to amass a collection of rare first editions.",
            "sent3": "The booky enthusiast spent hours browsing through the shelves of the bookstore.",
            "sent4": "Her booky nature made her the go-to person for book recommendations.",
            "sent5": "The booky passion in her eyes was evident whenever she talked about her favorite authors."
        },
        {
            "definition": "Suspicious or untrustworthy in a way that suggests a plot or story.",
            "pos": "adjective",
            "sent1": "The stranger's booky behavior made her uneasy as he lurked around the bookstore.",
            "sent2": "His booky smile and shifty eyes raised red flags for the detective.",
            "sent3": "The booky character in the mystery novel turned out to be the least expected suspect.",
            "sent4": "The booky plot thickened as more clues pointed towards the librarian's involvement.",
            "sent5": "The booky aura surrounding the antique book seemed to hold a dark secret within its pages."
        }
    ]
}