{
    "term": "booking",
    "meanings": [
        {
            "definition": "The act of reserving a place, seat, or accommodation in advance.",
            "pos": "noun",
            "sent1": "I made a booking for a table at the restaurant for our anniversary dinner.",
            "sent2": "Her booking for the hotel room was confirmed with a confirmation email.",
            "sent3": "The booking for the cabin in the woods turned out to be a mistake as it was haunted!",
            "sent4": "His booking for the front row seats at the concert made him feel like a VIP.",
            "sent5": "Making a booking for the guided tour made the vacation planning much easier."
        },
        {
            "definition": "An arrangement for someone to have a seat on a plane, train, or other form of transportation.",
            "pos": "noun",
            "sent1": "The booking for his flight to Paris was done months in advance.",
            "sent2": "She missed her train because her booking was for the wrong departure time.",
            "sent3": "The booking for the bus ride to the amusement park was so crowded, they had to stand the whole way!",
            "sent4": "His booking for the window seat on the plane gave him a great view of the city below.",
            "sent5": "The booking for the cruise included a luxurious cabin with a balcony overlooking the ocean."
        },
        {
            "definition": "The act of recording an offense or violation in an official register.",
            "pos": "noun",
            "sent1": "The police officer made a booking for the suspect after the arrest.",
            "sent2": "The booking for speeding was a wake-up call for him to drive more carefully.",
            "sent3": "The booking for illegal parking resulted in a hefty fine for the driver.",
            "sent4": "Her booking for shoplifting was a mistake she regretted deeply.",
            "sent5": "The booking for vandalism in the park was quickly resolved with community service."
        }
    ]
}