{
    "term": "boom",
    "meanings": [
        {
            "definition": "A deep, resonant sound.",
            "pos": "noun",
            "sent1": "The boom of the thunder scared the little dog.",
            "sent2": "The boom of the bass drum echoed through the concert hall.",
            "sent3": "The boom of the fireworks made everyone jump.",
            "sent4": "The boom of the cannon signaled the start of the race.",
            "sent5": "The boom of the old grandfather clock filled the room with its deep tone."
        },
        {
            "definition": "A sudden increase in economic activity.",
            "pos": "noun",
            "sent1": "The town experienced a boom in tourism during the summer.",
            "sent2": "The stock market saw a boom after the new company's success.",
            "sent3": "The sudden boom in sales caught everyone by surprise.",
            "sent4": "The economic boom brought prosperity to the small village.",
            "sent5": "The boom in construction created many job opportunities for the locals."
        },
        {
            "definition": "A long pole used to extend the reach of a microphone.",
            "pos": "noun",
            "sent1": "The singer held the boom to adjust the microphone.",
            "sent2": "The boom helped the speaker project their voice to the audience.",
            "sent3": "The boom wobbled as the microphone was adjusted.",
            "sent4": "The boom extended the microphone's range to reach the back row.",
            "sent5": "The boom was essential for recording clear audio during the interview."
        },
        {
            "definition": "To grow rapidly or flourish.",
            "pos": "verb",
            "sent1": "The flowers began to boom after the rain.",
            "sent2": "The business started to boom once they introduced online sales.",
            "sent3": "The garden seemed to boom overnight with new blooms.",
            "sent4": "Her career began to boom after she landed a big role.",
            "sent5": "The population of the city continued to boom as more people moved in."
        }
    ]
}