{
    "term": "boondoggler",
    "meanings": [
        {
            "definition": "A person who wastes time or resources on unnecessary or unproductive activities.",
            "pos": "noun",
            "sent1": "The boondoggler spent hours rearranging his desk instead of working.",
            "sent2": "Don't be a boondoggler and focus on completing your tasks efficiently.",
            "sent3": "The boondoggler decided to alphabetize his pencil collection instead of finishing his report.",
            "sent4": "She was a boondoggler, always finding ways to avoid doing actual work.",
            "sent5": "The office boondoggler was known for organizing his paperclips by color rather than meeting deadlines."
        },
        {
            "definition": "To engage in unnecessary or unproductive activities.",
            "pos": "verb",
            "sent1": "He tends to boondoggle by chatting with coworkers instead of working.",
            "sent2": "Try not to boondoggle too much and stay focused on your assignments.",
            "sent3": "She would often boondoggle by rearranging her desk multiple times a day.",
            "sent4": "The students boondoggled during class by passing notes instead of paying attention.",
            "sent5": "When feeling overwhelmed, he would boondoggle by organizing his bookshelf instead of studying."
        },
        {
            "definition": "Something that is unnecessary or unproductive.",
            "pos": "noun",
            "sent1": "The extra meeting felt like a boondoggler, taking time away from actual work.",
            "sent2": "Avoid adding any boondoggler tasks to your to-do list.",
            "sent3": "The fancy pen holder on his desk was just a boondoggler, not serving any real purpose.",
            "sent4": "Her extensive collection of stickers seemed like a boondoggler, cluttering her workspace.",
            "sent5": "The new software update was a boondoggler, causing more issues than it solved."
        }
    ]
}