{
    "term": "booth",
    "meanings": [
        {
            "definition": "A small temporary structure for selling goods or providing services",
            "pos": "noun",
            "sent1": "During the fair, the vendors set up a booth to sell their handmade crafts.",
            "sent2": "At the market, you can find a booth where they sell fresh fruits and vegetables.",
            "sent3": "The booth at the carnival had a sign that said 'Best Popcorn in Town!'",
            "sent4": "Her lemonade stand was like a booth of sunshine amidst the crowded event.",
            "sent5": "The booth with colorful balloons caught the attention of many passersby."
        },
        {
            "definition": "A small enclosed space used for a specific purpose, such as voting or making a phone call",
            "pos": "noun",
            "sent1": "In the library, there is a quiet booth where you can make private phone calls.",
            "sent2": "During the election, people lined up to enter the voting booth and cast their ballots.",
            "sent3": "The photo booth at the party captured funny moments with silly props.",
            "sent4": "His mind was a booth of solitude, where he could reflect without distractions.",
            "sent5": "The confession booth in the church provided a space for repentance and forgiveness."
        },
        {
            "definition": "A compartment or enclosed area in a restaurant or cafe for seating and dining",
            "pos": "noun",
            "sent1": "The cozy booth by the window was perfect for a romantic dinner.",
            "sent2": "The family chose a booth in the corner to enjoy their meal in privacy.",
            "sent3": "The booth with the best view of the sunset was always in high demand.",
            "sent4": "The booth felt like a little sanctuary away from the bustling restaurant.",
            "sent5": "The booth with the red cushions added a touch of elegance to the dining area."
        }
    ]
}