{
    "term": "boot",
    "meanings": [
        {
            "definition": "A sturdy item of footwear covering the foot and ankle, and sometimes the lower leg.",
            "pos": "noun",
            "sent1": "She wore her favorite brown boot to keep her feet warm.",
            "sent2": "The hiker put on his hiking boots before starting the trail.",
            "sent3": "The boot was so big that it looked like a boat for her foot.",
            "sent4": "His determination was the boot that propelled him forward in the race.",
            "sent5": "The sound of her boots echoed in the empty hallway."
        },
        {
            "definition": "A protective covering for the foot and part or much of the leg, usually of leather.",
            "pos": "noun",
            "sent1": "The knight's shiny metal boot protected his foot during battle.",
            "sent2": "She cleaned her muddy boots after walking through the farm.",
            "sent3": "The boot was so worn out that it looked like a piece of art.",
            "sent4": "His kindness was the boot that shielded her from the harsh world.",
            "sent5": "The smell of leather from the new boots was intoxicating."
        },
        {
            "definition": "A hard kick with the foot.",
            "pos": "noun",
            "sent1": "He gave the ball a powerful boot, sending it flying across the field.",
            "sent2": "The horse gave a sudden boot to the stable door.",
            "sent3": "The boot from the soccer player was so strong that it made the ball disappear.",
            "sent4": "His words were a boot to her confidence, knocking it down.",
            "sent5": "The boot to the door made a loud bang that startled everyone."
        },
        {
            "definition": "To kick.",
            "pos": "verb",
            "sent1": "She had to boot the ball to score a goal.",
            "sent2": "He accidentally booted the door shut behind him.",
            "sent3": "The child tried to boot the ball, but it barely moved.",
            "sent4": "His decision to leave booted her hopes of reconciliation.",
            "sent5": "The wind booted the leaves off the tree, creating a colorful whirlwind."
        },
        {
            "definition": "To start up a computer by loading an operating system or program.",
            "pos": "verb",
            "sent1": "He will boot up the computer to check his emails.",
            "sent2": "She booted her laptop to begin working on her project.",
            "sent3": "The old computer took forever to boot up, making him impatient.",
            "sent4": "His idea to reboot the system booted the company's efficiency.",
            "sent5": "The computer booted up with a cheerful sound, ready for use."
        }
    ]
}