{
    "term": "borne",
    "meanings": [
        {
            "definition": "Carried or transported by",
            "pos": "preposition",
            "sent1": "The heavy boxes were borne by the strong movers.",
            "sent2": "The groceries were borne home by the helpful neighbor.",
            "sent3": "The tiny kitten was borne across the room by the playful child.",
            "sent4": "The message was borne through the airwaves to reach its destination.",
            "sent5": "The love letter was borne across the ocean to reunite two hearts."
        },
        {
            "definition": "Endured or tolerated",
            "pos": "verb",
            "sent1": "She borne the pain of loss with grace and strength.",
            "sent2": "He has borne the criticism from his peers with dignity.",
            "sent3": "The students borne the boring lecture with yawns and doodles.",
            "sent4": "The old tree has borne the storms for many years, standing tall.",
            "sent5": "The athlete borne the intense training regimen to achieve success."
        },
        {
            "definition": "Given birth to",
            "pos": "verb",
            "sent1": "The mother borne a healthy baby boy last night.",
            "sent2": "The bird has borne three chicks in its nest.",
            "sent3": "The apple tree borne delicious fruit every autumn.",
            "sent4": "The queen bee borne a new generation of worker bees.",
            "sent5": "The fertile soil has borne a bountiful harvest this season."
        },
        {
            "definition": "Supported or sustained by",
            "pos": "preposition",
            "sent1": "The roof was borne by sturdy pillars.",
            "sent2": "The weight of the world seems to be borne by his shoulders.",
            "sent3": "The fragile vase was borne on a cushion to prevent breakage.",
            "sent4": "The responsibility of leadership is borne by the elected official.",
            "sent5": "The success of the project was borne by the dedication of the team."
        }
    ]
}