{
    "term": "botts",
    "meanings": [
        {
            "definition": "A disease affecting horses, characterized by inflammation of the intestines.",
            "pos": "noun",
            "sent1": "The vet diagnosed the horse with botts after observing signs of intestinal inflammation.",
            "sent2": "The stable owner was worried about the horses getting botts from contaminated water.",
            "sent3": "The horse joked to its stablemates, 'I must have caught the botts bug!'",
            "sent4": "The botts spread through the herd like wildfire, causing chaos in the stables.",
            "sent5": "The image of the horse suffering from botts haunted the stable owner's dreams."
        },
        {
            "definition": "A slang term for a person who is considered annoying or unpleasant.",
            "pos": "noun",
            "sent1": "Tommy was being a real botts today, constantly interrupting everyone.",
            "sent2": "The teacher warned the students not to be botts and disrupt the class.",
            "sent3": "Sarah rolled her eyes at her brother's botts behavior during dinner.",
            "sent4": "The botts in the office always found a way to ruin team meetings with their complaints.",
            "sent5": "The botts at the party made everyone uncomfortable with their rude comments."
        },
        {
            "definition": "The plural form of the word 'bott', meaning a bundle of straw or hay.",
            "pos": "noun",
            "sent1": "The farmer loaded the truck with botts of hay to feed the livestock.",
            "sent2": "The children played in the field, jumping over the botts of straw.",
            "sent3": "The wind scattered the botts across the farm, creating a messy scene.",
            "sent4": "The botts of hay stood tall in the barn, ready to be used for bedding.",
            "sent5": "The sweet smell of the botts filled the air, reminding everyone of the farm life."
        }
    ]
}