{
    "term": "bottomed",
    "meanings": [
        {
            "definition": "Having a bottom or base.",
            "pos": "adjective",
            "sent1": "The sturdy chair was bottomed with a solid piece of wood.",
            "sent2": "The glass was bottomed, making it stable on the table.",
            "sent3": "The cake was bottomed with a layer of delicious chocolate.",
            "sent4": "The boat was bottomed with a thick layer of protective coating.",
            "sent5": "The box was bottomed with a cushion to prevent breakage."
        },
        {
            "definition": "Having reached the lowest point.",
            "pos": "adjective",
            "sent1": "After the long hike, they felt bottomed out and exhausted.",
            "sent2": "The stock market hit a bottomed level before starting to rise again.",
            "sent3": "The energy drink left him feeling bottomed but satisfied.",
            "sent4": "Her mood bottomed out before she received good news.",
            "sent5": "The river bottomed out, revealing hidden treasures."
        },
        {
            "definition": "Furnished with a bottom.",
            "pos": "adjective",
            "sent1": "The basket was bottomed with a layer of soft fabric.",
            "sent2": "The drawer was bottomed with a velvet lining.",
            "sent3": "The bag was bottomed with a sturdy material to hold heavy items.",
            "sent4": "The bin was bottomed with a plastic base for durability.",
            "sent5": "The container was bottomed with a cushion to protect fragile items."
        },
        {
            "definition": "Having a specified kind of bottom.",
            "pos": "adjective",
            "sent1": "The table was bottomed with a round base for stability.",
            "sent2": "The chair was bottomed with four legs for support.",
            "sent3": "The vase was bottomed with a wide base to prevent tipping.",
            "sent4": "The cup was bottomed with a flat surface for balance.",
            "sent5": "The lamp was bottomed with a heavy stand to prevent toppling over."
        }
    ]
}