{
    "term": "bottoms",
    "meanings": [
        {
            "definition": "The lowest part or surface of something.",
            "pos": "noun",
            "sent1": "She sat on the bottoms of the stairs.",
            "sent2": "The boat's bottoms were painted blue.",
            "sent3": "The cat found a cozy spot on the bottoms of the bed.",
            "sent4": "His spirits hit rock bottoms after the loss.",
            "sent5": "The explorer reached the bottoms of the cave."
        },
        {
            "definition": "The lower end or part of something.",
            "pos": "noun",
            "sent1": "The bottoms of the tree were covered in moss.",
            "sent2": "He tied a ribbon around the bottoms of the balloons.",
            "sent3": "The chef saved the best ingredients for the bottoms of the dish.",
            "sent4": "The river flowed gently towards the bottoms of the valley.",
            "sent5": "The artist added intricate details to the bottoms of the painting."
        },
        {
            "definition": "The buttocks.",
            "pos": "noun",
            "sent1": "She landed on her bottoms after slipping on the ice.",
            "sent2": "He felt a sharp pain in his bottoms from sitting too long.",
            "sent3": "The toddler wiggled his bottoms while dancing.",
            "sent4": "The comedian joked about falling on his bottoms during the show.",
            "sent5": "The athlete stretched his bottoms before the race."
        },
        {
            "definition": "The lowest point or level.",
            "pos": "noun",
            "sent1": "The river flowed towards the bottoms of the valley.",
            "sent2": "The temperature dropped to the bottoms of the thermometer.",
            "sent3": "The mood at the party hit rock bottoms when the music stopped.",
            "sent4": "The elevator descended to the bottoms of the building.",
            "sent5": "The hiker reached the bottoms of the mountain trail."
        }
    ]
}