{
    "term": "botulisms",
    "meanings": [
        {
            "definition": "A rare but serious illness caused by toxins produced by the bacterium Clostridium botulinum.",
            "pos": "noun",
            "sent1": "Botulisms can lead to paralysis and difficulty breathing.",
            "sent2": "Doctors quickly identified the botulisms outbreak in the small town.",
            "sent3": "The picnic turned into a botulisms scare when everyone got sick from the food.",
            "sent4": "Her fear of failure was like a silent botulisms creeping into her mind.",
            "sent5": "The sinister presence of botulisms lingered in the air, causing panic among the villagers."
        },
        {
            "definition": "The toxins produced by the bacterium Clostridium botulinum that cause botulism.",
            "pos": "noun",
            "sent1": "Avoiding botulisms-contaminated food is crucial for preventing illness.",
            "sent2": "The lab results confirmed the presence of botulisms in the canned goods.",
            "sent3": "The villain in the movie used botulisms as a weapon of choice.",
            "sent4": "The dark cloud of botulisms hovered over the food industry, causing concern.",
            "sent5": "The sinister botulisms spread through the food supply, causing widespread alarm."
        },
        {
            "definition": "The condition of being infected with the bacterium Clostridium botulinum and experiencing symptoms of botulism.",
            "pos": "noun",
            "sent1": "The hospital treated several cases of botulisms last month.",
            "sent2": "The symptoms of botulisms include muscle weakness and blurred vision.",
            "sent3": "The comedy show turned into a botulisms-themed performance, much to the audience's surprise.",
            "sent4": "Her anxiety felt like a mental botulisms, paralyzing her thoughts.",
            "sent5": "The threat of botulisms loomed over the region, causing widespread panic."
        }
    ]
}