{
    "term": "boule",
    "meanings": [
        {
            "definition": "A round loaf of bread.",
            "pos": "noun",
            "sent1": "I bought a boule of bread from the bakery.",
            "sent2": "The boule of bread was freshly baked and smelled delicious.",
            "sent3": "The boule of bread rolled off the table and onto the floor!",
            "sent4": "Her laughter echoed through the kitchen like a bouncing boule of bread.",
            "sent5": "The boule of bread was as big as a giant's fist."
        },
        {
            "definition": "A ball used in the sport of petanque.",
            "pos": "noun",
            "sent1": "The player threw the boule towards the target.",
            "sent2": "The shiny boule gleamed under the sun on the petanque court.",
            "sent3": "The boule bounced off a rock and landed perfectly in the target area.",
            "sent4": "His aim was as precise as a professional with the boule.",
            "sent5": "The sound of the boule hitting the ground was satisfying."
        },
        {
            "definition": "A type of French bowling game.",
            "pos": "noun",
            "sent1": "We played boule in the park with friends.",
            "sent2": "The rules of boule are easy to learn and fun to play.",
            "sent3": "During the boule game, everyone cheered and laughed.",
            "sent4": "The competitive spirit rose as each player aimed their boule.",
            "sent5": "The clinking of boules filled the air with excitement."
        },
        {
            "definition": "A type of French bread roll.",
            "pos": "noun",
            "sent1": "I enjoyed a warm boule with butter for breakfast.",
            "sent2": "The boule was crusty on the outside and soft inside.",
            "sent3": "The aroma of the freshly baked boule filled the kitchen.",
            "sent4": "She savored every bite of the delicious boule.",
            "sent5": "The boule melted in her mouth like a cloud of happiness."
        }
    ]
}