{
    "term": "bounce",
    "meanings": [
        {
            "definition": "To spring back after hitting a surface.",
            "pos": "verb",
            "sent1": "The ball will bounce off the wall.",
            "sent2": "I like to bounce a basketball on the ground.",
            "sent3": "The rubber band decided to bounce back after being stretched.",
            "sent4": "Her enthusiasm seemed to bounce off the walls.",
            "sent5": "The idea of resilience can be compared to a ball's bounce."
        },
        {
            "definition": "To move up and down repeatedly.",
            "pos": "verb",
            "sent1": "The kids love to bounce on the trampoline.",
            "sent2": "The buoy will bounce on the waves.",
            "sent3": "The bunny continued to bounce around the garden.",
            "sent4": "The music made her heart bounce with joy.",
            "sent5": "The bouncing of the ball echoed through the gym."
        },
        {
            "definition": "A sudden increase or improvement in a situation.",
            "pos": "noun",
            "sent1": "The team experienced a bounce in their performance.",
            "sent2": "The stock market saw a bounce in prices.",
            "sent3": "The unexpected good news brought a bounce to their spirits.",
            "sent4": "The sudden bounce in sales caught everyone by surprise.",
            "sent5": "The bounce in energy was palpable in the room."
        },
        {
            "definition": "To refuse entry or access.",
            "pos": "verb",
            "sent1": "The security guard will bounce anyone without a pass.",
            "sent2": "The club may bounce guests who do not follow the dress code.",
            "sent3": "The bouncer had to bounce rowdy individuals from the party.",
            "sent4": "The strict policy will bounce unauthorized personnel.",
            "sent5": "The doorman had to bounce troublemakers from the event."
        },
        {
            "definition": "To move energetically or excitedly.",
            "pos": "verb",
            "sent1": "The children bounce with joy at the playground.",
            "sent2": "The puppy will bounce around the yard in excitement.",
            "sent3": "The idea seemed to bounce around in his mind.",
            "sent4": "Her heart started to bounce with anticipation.",
            "sent5": "The energy in the room seemed to bounce off the walls."
        }
    ]
}