{
    "term": "bound",
    "meanings": [
        {
            "definition": "Confined by boundaries or limits",
            "pos": "adjective",
            "sent1": "The squirrel was bound by the fence and couldn't escape.",
            "sent2": "The book was bound with a beautiful cover.",
            "sent3": "The curious cat found itself bound by the invisible force field of the laser pointer.",
            "sent4": "Her imagination was boundless, like a vast ocean of creativity.",
            "sent5": "The child's excitement was bound to burst out at any moment."
        },
        {
            "definition": "Heading or moving in a specified direction",
            "pos": "adjective",
            "sent1": "The train was bound for the city, carrying many passengers.",
            "sent2": "The airplane was bound to land at the scheduled time.",
            "sent3": "The determined athlete was bound to reach the finish line first.",
            "sent4": "The river flowed boundlessly towards the sea.",
            "sent5": "The migrating birds were bound to their winter destination."
        },
        {
            "definition": "Tied or secured",
            "pos": "adjective",
            "sent1": "The boat was bound to the dock with strong ropes.",
            "sent2": "The prisoner was bound in chains and could not escape.",
            "sent3": "The gift was bound with a shiny ribbon that sparkled in the sunlight.",
            "sent4": "The ancient scroll was bound with intricate symbols and seals.",
            "sent5": "The treasure chest was bound shut with a heavy lock."
        },
        {
            "definition": "Obliged by moral or legal duty",
            "pos": "adjective",
            "sent1": "She felt bound to help her friend in need.",
            "sent2": "The doctor was bound by the oath of confidentiality.",
            "sent3": "The knight felt bound to protect the kingdom from all threats.",
            "sent4": "The superhero was bound by a sense of justice to fight crime.",
            "sent5": "The loyal dog felt bound to stay by its owner's side."
        },
        {
            "definition": "Ready or prepared to do something",
            "pos": "adjective",
            "sent1": "The team was bound to win the championship with their skills.",
            "sent2": "She was bound to ace the test after studying all night.",
            "sent3": "The chef was bound to impress the guests with his culinary creations.",
            "sent4": "The explorer was bound to discover new lands on his expedition.",
            "sent5": "The student was bound to excel in his academic pursuits."
        }
    ]
}