{
    "term": "bourn",
    "meanings": [
        {
            "definition": "A small stream or brook.",
            "pos": "noun",
            "sent1": "The children played by the bourn, skipping stones and splashing in the water.",
            "sent2": "The bourn flowed gently through the meadow, providing a peaceful soundtrack to the surroundings.",
            "sent3": "The mischievous squirrel used the bourn as a secret passage to sneak past the other animals.",
            "sent4": "The bourn whispered ancient tales to the trees, carrying stories from distant lands.",
            "sent5": "The bourn sparkled like a ribbon of silver under the sunlight, enchanting all who beheld its beauty."
        },
        {
            "definition": "A destination or goal.",
            "pos": "noun",
            "sent1": "Their ultimate bourn was to reach the mountaintop and witness the sunrise.",
            "sent2": "The journey was long, but the bourn of finding their lost treasure kept them going.",
            "sent3": "The bourn of winning the championship spurred the team to train harder than ever before.",
            "sent4": "In her mind, success was the elusive bourn she tirelessly pursued.",
            "sent5": "The bourn of exploring new worlds filled their hearts with excitement and wonder."
        },
        {
            "definition": "A boundary or limit.",
            "pos": "noun",
            "sent1": "The forest marked the bourn of their village, separating them from the unknown wilderness.",
            "sent2": "They were warned not to cross the bourn of the forbidden field, where danger lurked.",
            "sent3": "The bourn between reality and dreams blurred as she drifted into a deep slumber.",
            "sent4": "His patience reached its bourn as he waited for hours without any sign of progress.",
            "sent5": "The bourn of her endurance was tested as she ran the marathon under the scorching sun."
        }
    ]
}