{
    "term": "bout",
    "meanings": [
        {
            "definition": "A short period of intense activity or effort.",
            "pos": "noun",
            "sent1": "During the bout of cleaning, she scrubbed the floors vigorously.",
            "sent2": "He always gives his best in every bout of exercise.",
            "sent3": "In the middle of the bout of organizing, she found her missing sock.",
            "sent4": "The bout of studying for exams felt like a mental marathon.",
            "sent5": "The bout of dancing left her breathless but happy."
        },
        {
            "definition": "A short period of illness or discomfort.",
            "pos": "noun",
            "sent1": "After the bout of flu, he felt weak but slowly recovered.",
            "sent2": "She rested in bed during the bout of stomachache.",
            "sent3": "The bout of sneezing made everyone in the room look her way.",
            "sent4": "The bout of allergies left her with a runny nose and itchy eyes.",
            "sent5": "The bout of headache made it hard for her to concentrate."
        },
        {
            "definition": "A short period of fighting or competing.",
            "pos": "noun",
            "sent1": "The boxers entered the ring for their bout of boxing.",
            "sent2": "The wrestlers trained hard for the upcoming bout.",
            "sent3": "The bout of arm wrestling between the siblings ended in laughter.",
            "sent4": "The bout of chess between the friends was intense and strategic.",
            "sent5": "The bout of soccer was filled with excitement and cheers."
        },
        {
            "definition": "A short period of time.",
            "pos": "noun",
            "sent1": "She arrived at the meeting a bout before it started.",
            "sent2": "He finished the task in a bout of minutes.",
            "sent3": "The train arrived a bout late due to delays.",
            "sent4": "The sun set a bout earlier than expected.",
            "sent5": "The movie ended a bout sooner than she had hoped."
        }
    ]
}