{
    "term": "bow",
    "meanings": [
        {
            "definition": "To bend the head or body forward in greeting or respect.",
            "pos": "verb",
            "sent1": "She will bow to the queen when she meets her.",
            "sent2": "The performer will bow after the show.",
            "sent3": "He decided to bow dramatically to his friends as a joke.",
            "sent4": "The trees seemed to bow in the wind's powerful embrace.",
            "sent5": "The students were taught to bow politely before entering the dojo."
        },
        {
            "definition": "A weapon for shooting arrows, typically made of a curved piece of wood with a taut string.",
            "pos": "noun",
            "sent1": "Robin Hood used a bow to shoot arrows at his enemies.",
            "sent2": "The archer carefully aimed his bow at the target.",
            "sent3": "The toy bow made of plastic was no match for the real ones.",
            "sent4": "Her words were like arrows shot from a bow, hitting their mark.",
            "sent5": "The bow was beautifully crafted with intricate designs etched into the wood."
        },
        {
            "definition": "A knot tied with two loops and two loose ends, used to tie shoelaces or ribbons.",
            "pos": "noun",
            "sent1": "She tied her shoelaces with a neat bow.",
            "sent2": "The gift was wrapped with a shiny bow on top.",
            "sent3": "The mischievous kitten played with the bow on the present.",
            "sent4": "The bow in her hair added a touch of elegance to her outfit.",
            "sent5": "He carefully tied the bow, making sure it was perfectly symmetrical."
        },
        {
            "definition": "The front part of a ship.",
            "pos": "noun",
            "sent1": "The captain stood at the bow of the ship, gazing out at the sea.",
            "sent2": "The waves crashed against the bow as the ship sailed through the storm.",
            "sent3": "The seagulls perched on the bow, enjoying the view.",
            "sent4": "The bow cut through the water gracefully, leaving a trail behind.",
            "sent5": "The bow of the ship was adorned with a figurehead of a mythical creature."
        }
    ]
}