{
    "term": "bowshots",
    "meanings": [
        {
            "definition": "The distance that a bow can shoot an arrow.",
            "pos": "noun",
            "sent1": "He measured the field in bowshots to see if his bow could reach the target.",
            "sent2": "The archer aimed carefully and released the arrow, sending it flying several bowshots away.",
            "sent3": "The bow was feeling proud of its ability to cover long bowshots.",
            "sent4": "Her determination was like a bow that could shoot arrows for endless bowshots.",
            "sent5": "The forest stretched out before him, each tree standing at different bowshots from the next."
        },
        {
            "definition": "The act of shooting a bow.",
            "pos": "noun",
            "sent1": "She practiced her bowshots every day to improve her accuracy.",
            "sent2": "The competition was fierce, with each participant showcasing their best bowshots.",
            "sent3": "The bowshots at the tournament were so impressive that even the birds stopped to watch.",
            "sent4": "His focus during the bowshots was like a laser beam, hitting the target every time.",
            "sent5": "The sound of bowshots echoed through the valley as the archers trained for the upcoming battle."
        },
        {
            "definition": "A unit of measurement equal to the distance a bow can shoot an arrow.",
            "pos": "noun",
            "sent1": "The map was marked with bowshots to help travelers estimate the distance.",
            "sent2": "The ancient civilization used bowshots as a standard unit for measuring land.",
            "sent3": "The tailor used bowshots of fabric to create the perfect outfit for the archer.",
            "sent4": "In his mind, time was not measured in hours but in bowshots of memories.",
            "sent5": "The treasure was said to be buried three bowshots from the old oak tree, hidden from plain sight."
        }
    ]
}