{
    "term": "box",
    "meanings": [
        {
            "definition": "A container typically rectangular in shape, with a lid or cover.",
            "pos": "noun",
            "sent1": "I put my toys in the box.",
            "sent2": "The delivery arrived in a big box.",
            "sent3": "The cat jumped into the empty box and pretended to be a king.",
            "sent4": "Her laughter echoed out of the box like a joyful melody.",
            "sent5": "The box was so heavy, I could barely lift it."
        },
        {
            "definition": "A small compartment or receptacle for holding items.",
            "pos": "noun",
            "sent1": "She opened the jewelry box to reveal her treasures.",
            "sent2": "The toolbox contained all the necessary tools.",
            "sent3": "The tiny box held a secret message inside.",
            "sent4": "His mind was a box of memories, each carefully stored away.",
            "sent5": "The box on the shelf was filled with colorful buttons."
        },
        {
            "definition": "To put into a box.",
            "pos": "verb",
            "sent1": "Please box up the books for donation.",
            "sent2": "He decided to box the fragile items for safekeeping.",
            "sent3": "She tried to box up her emotions, but they spilled out uncontrollably.",
            "sent4": "His words boxed her into a corner, leaving her speechless.",
            "sent5": "The magician boxed up the rabbit and made it disappear."
        },
        {
            "definition": "A blow with the fist.",
            "pos": "noun",
            "sent1": "He received a hard box on the jaw during the fight.",
            "sent2": "The boxer delivered a powerful box to his opponent.",
            "sent3": "The playful box from his friend caught him off guard.",
            "sent4": "Her words felt like a verbal box to his ego.",
            "sent5": "The unexpected box left him seeing stars."
        }
    ]
}