{
    "term": "boxboard",
    "meanings": [
        {
            "definition": "A type of paperboard used for making boxes.",
            "pos": "noun",
            "sent1": "The boxboard was sturdy and perfect for packaging fragile items.",
            "sent2": "The factory ordered a shipment of boxboard to create new boxes for shipping products.",
            "sent3": "When the cat jumped into the boxboard, it made a funny crinkling sound.",
            "sent4": "Her creativity soared as she transformed the plain boxboard into a colorful castle for her toys.",
            "sent5": "The smell of fresh boxboard filled the room, reminding him of the excitement of receiving a new package."
        },
        {
            "definition": "The material used to make boxes.",
            "pos": "noun",
            "sent1": "The boxboard was stacked neatly in the corner, ready to be crafted into boxes.",
            "sent2": "The company sourced high-quality boxboard to ensure durable packaging for their products.",
            "sent3": "She accidentally tripped over a roll of boxboard, causing a comical domino effect.",
            "sent4": "His ideas flowed like a river as he brainstormed innovative ways to utilize the boxboard.",
            "sent5": "The boxboard gleamed under the sunlight, promising protection for the items inside."
        },
        {
            "definition": "The cardboard used for packaging.",
            "pos": "noun",
            "sent1": "The boxboard was recycled to create eco-friendly packaging solutions.",
            "sent2": "The delivery truck was filled with stacks of boxboard ready to be used for shipping.",
            "sent3": "The boxboard suddenly collapsed, causing a chain reaction of boxes tumbling down.",
            "sent4": "Her heart sank as she realized the boxboard had absorbed water, ruining the packaging.",
            "sent5": "The boxboard crinkled loudly as she folded it, signaling the start of the packaging process."
        }
    ]
}