{
    "term": "braced",
    "meanings": [
        {
            "definition": "To prepare oneself for something difficult or challenging.",
            "pos": "verb",
            "sent1": "She braced herself before speaking in front of the large audience.",
            "sent2": "He always braced for impact before taking on a new project.",
            "sent3": "The little girl braced for the scary movie by hiding behind her blanket.",
            "sent4": "The team braced for the tough competition ahead, ready to give their best.",
            "sent5": "The soldier braced for battle, standing tall and determined."
        },
        {
            "definition": "To provide support or reinforcement.",
            "pos": "verb",
            "sent1": "The wall was braced with extra beams to make it stronger.",
            "sent2": "She braced the shelf with brackets to prevent it from falling.",
            "sent3": "The tree braced itself against the strong wind, refusing to bend.",
            "sent4": "The friendship braced them through tough times, always there for each other.",
            "sent5": "The bridge was braced by cables, ensuring its stability."
        },
        {
            "definition": "A device used to support or strengthen something.",
            "pos": "noun",
            "sent1": "The construction workers used a metal brace to hold the structure in place.",
            "sent2": "She wore a knee brace to support her injured joint.",
            "sent3": "The bookshelf leaned to the side until they added a brace to keep it upright.",
            "sent4": "The dentist recommended a brace to align her teeth properly.",
            "sent5": "The old building needed additional braces to prevent it from collapsing."
        },
        {
            "definition": "To tighten or secure with a brace.",
            "pos": "verb",
            "sent1": "He braced the door shut to keep the strong wind from blowing it open.",
            "sent2": "She braced the fence with wire to make sure it stayed in place.",
            "sent3": "The tent was braced with extra pegs to prevent it from flying away in the wind.",
            "sent4": "The gate was braced with a lock to secure it from intruders.",
            "sent5": "The window was braced shut during the storm to keep the rain out."
        }
    ]
}