{
    "term": "bracket",
    "meanings": [
        {
            "definition": "A support or fixture attached to a wall for holding shelves, lamps, or other objects.",
            "pos": "noun",
            "sent1": "I placed the heavy book on the sturdy bracket.",
            "sent2": "The bracket on the wall held the picture frame securely.",
            "sent3": "The mischievous cat tried to balance on the bracket like a tightrope walker.",
            "sent4": "Her smile was the bracket that held together the pieces of his broken heart.",
            "sent5": "The bracket looked like a small shelf sticking out from the wall."
        },
        {
            "definition": "A punctuation mark [ ] used to enclose words or figures.",
            "pos": "noun",
            "sent1": "In the sentence, the bracket indicates additional information.",
            "sent2": "Remember to use a bracket to set off the list of ingredients.",
            "sent3": "The bracket in the text seemed like a tiny fence around the words.",
            "sent4": "Her laughter was like a bracket, enclosing the joy of the moment.",
            "sent5": "The bracket acted like a frame around the important details."
        },
        {
            "definition": "A category or level of competition in a tournament.",
            "pos": "noun",
            "sent1": "Our team made it to the final bracket of the championship.",
            "sent2": "The top players will compete in the elite bracket.",
            "sent3": "The bracket for the youngest players was filled with excitement and laughter.",
            "sent4": "She aimed to rise to the top bracket of the competition.",
            "sent5": "The bracket for the beginners was a great place to start learning."
        },
        {
            "definition": "A pair of marks ( ) used to enclose additional information in a sentence.",
            "pos": "noun",
            "sent1": "The bracket around the phrase clarified its meaning.",
            "sent2": "Make sure to use a bracket to set off the explanation.",
            "sent3": "The bracket in the text was like a hug around the words.",
            "sent4": "His silence was the bracket that enclosed his hidden thoughts.",
            "sent5": "The bracket highlighted the essential details in the paragraph."
        }
    ]
}