{
    "term": "braggest",
    "meanings": [
        {
            "definition": "Braggest (verb): to boast or talk with excessive pride",
            "pos": "verb",
            "sent1": "He always braggest about his accomplishments to everyone he meets.",
            "sent2": "She braggest so much that no one believes her stories anymore.",
            "sent3": "The parrot learned to braggest like its owner, much to the amusement of the visitors.",
            "sent4": "Her car would braggest if it could talk, as it has been to so many exotic places.",
            "sent5": "The little boy would braggest about his toy collection, making sure everyone knew how special it was."
        },
        {
            "definition": "Braggest (adjective): superlative form of brag, indicating the most boastful or prideful",
            "pos": "adjective",
            "sent1": "She was the braggest student in the class, always talking about her achievements.",
            "sent2": "The braggest person at the party was the one wearing the most extravagant outfit.",
            "sent3": "The braggest cake at the bake sale was decorated with edible gold flakes.",
            "sent4": "Her braggest smile lit up the room, showing how proud she was of her accomplishment.",
            "sent5": "The braggest tree in the forest stood tall and proud, overshadowing all the others with its grandeur."
        },
        {
            "definition": "Braggest (noun): a person who boasts or brags excessively",
            "pos": "noun",
            "sent1": "He was known as the braggest in town, always talking about his possessions.",
            "sent2": "The braggest in the office would often interrupt others to talk about their achievements.",
            "sent3": "The braggest at the party was the center of attention, entertaining everyone with their stories.",
            "sent4": "She avoided sitting next to the braggest at dinner, as she didn't want to hear constant boasting.",
            "sent5": "The braggest in the family always made sure to be the loudest voice in the room, seeking attention."
        }
    ]
}