{
    "term": "brainstorms",
    "meanings": [
        {
            "definition": "A sudden clever idea",
            "pos": "noun",
            "sent1": "During the meeting, she had a brilliant brainstorms about a new project.",
            "sent2": "The team had a productive brainstorm and came up with a solution.",
            "sent3": "His brainstorms always lead to exciting new possibilities.",
            "sent4": "Her brainstorms were like fireworks of creativity in the office.",
            "sent5": "The brainstorm sparked a wave of innovation in the company."
        },
        {
            "definition": "A sudden clever idea or plan",
            "pos": "noun",
            "sent1": "The brainstorm struck him while he was walking in the park.",
            "sent2": "Their brainstorm resulted in a successful marketing campaign.",
            "sent3": "The brainstorm hit him like a bolt of lightning.",
            "sent4": "Their brainstorm was a beacon of hope in a challenging situation.",
            "sent5": "The brainstorm illuminated a path forward for the team."
        },
        {
            "definition": "A sudden clever idea or plan",
            "pos": "noun",
            "sent1": "The brainstorm popped into her head during breakfast.",
            "sent2": "Their brainstorm revolutionized the way they approached problems.",
            "sent3": "The brainstorm danced around in his mind until it fully formed.",
            "sent4": "Their brainstorm was a key that unlocked a new opportunity.",
            "sent5": "The brainstorm painted a vivid picture of success for the team."
        },
        {
            "definition": "A sudden clever idea or plan",
            "pos": "noun",
            "sent1": "The brainstorm brightened her day with its brilliance.",
            "sent2": "Their brainstorm paved the way for a breakthrough in technology.",
            "sent3": "The brainstorm whispered its secrets to her in a dream.",
            "sent4": "Their brainstorm was a compass guiding them through uncertainty.",
            "sent5": "The brainstorm planted seeds of innovation in their minds."
        }
    ]
}