{
    "term": "brame",
    "meanings": [
        {
            "definition": "To cry out loudly",
            "pos": "verb",
            "sent1": "The little boy began to brame when he lost his favorite toy.",
            "sent2": "The lion will brame to communicate with other lions in the pride.",
            "sent3": "The cat decided to brame at the top of its lungs for more treats.",
            "sent4": "The thunderstorm seemed to brame angrily as it rolled in.",
            "sent5": "The singer's powerful voice could brame across the entire stadium."
        },
        {
            "definition": "A loud, harsh cry",
            "pos": "noun",
            "sent1": "The deer's brame echoed through the forest, signaling mating season.",
            "sent2": "The baby's brame could be heard from the next room, waking up the whole house.",
            "sent3": "The brame of the seagull sounded like a call for help.",
            "sent4": "The brame of the wolf sent shivers down the hiker's spine.",
            "sent5": "The brame of the elephant was so powerful, it could be felt in the ground."
        },
        {
            "definition": "To make a loud, harsh noise",
            "pos": "verb",
            "sent1": "The old door would brame whenever it was opened or closed.",
            "sent2": "The wind started to brame against the windows as the storm approached.",
            "sent3": "The car engine began to brame loudly, signaling a problem.",
            "sent4": "The branches would brame against the window during the windy night.",
            "sent5": "The metal gate continued to brame in the strong gusts of wind."
        },
        {
            "definition": "A loud, harsh noise",
            "pos": "noun",
            "sent1": "The brame of the thunder shook the entire house.",
            "sent2": "The brame of the machinery drowned out all other sounds in the factory.",
            "sent3": "The brame of the waterfall could be heard from miles away.",
            "sent4": "The brame of the train passing by made the ground tremble.",
            "sent5": "The brame of the storm outside made it hard to fall asleep."
        }
    ]
}