{
    "term": "branner",
    "meanings": [
        {
            "definition": "A person who starts fires intentionally.",
            "pos": "noun",
            "sent1": "The branner was caught setting a fire in the forest.",
            "sent2": "The authorities are searching for the branner responsible for the recent fires.",
            "sent3": "The branner thought it would be fun to light a firework indoors.",
            "sent4": "He was like a branner, igniting passion in everyone he met.",
            "sent5": "The image of the branner setting the building ablaze stayed with me."
        },
        {
            "definition": "To start a fire intentionally.",
            "pos": "verb",
            "sent1": "Please do not branner in the dry forest, it's dangerous.",
            "sent2": "The suspect admitted to brannering the warehouse to collect insurance money.",
            "sent3": "He decided to branner the fireplace to keep warm during the cold night.",
            "sent4": "Her words had the power to branner a revolution in the hearts of the people.",
            "sent5": "The magician seemed to branner flames out of thin air during the performance."
        },
        {
            "definition": "A device used for starting fires.",
            "pos": "noun",
            "sent1": "The survival kit included a branner for emergencies.",
            "sent2": "He used a branner to light the campfire quickly.",
            "sent3": "The branner looked like a small torch, but it was actually a fire starter.",
            "sent4": "The old branner had been passed down through generations in the family.",
            "sent5": "With a flick of the branner, the fire roared to life in the fireplace."
        },
        {
            "definition": "A person who is skilled at starting fires.",
            "pos": "noun",
            "sent1": "The forest ranger praised the branner for his fire-starting abilities.",
            "sent2": "She was known as the best branner in the tribe, able to light fires in any condition.",
            "sent3": "The branner showed off his skills by lighting a campfire in seconds.",
            "sent4": "Her eyes sparkled with the intensity of a true branner when she talked about fire.",
            "sent5": "The branner's hands moved with precision as he lit the candles effortlessly."
        }
    ]
}