{
    "term": "brasses",
    "meanings": [
        {
            "definition": "A yellow alloy of copper and zinc",
            "pos": "noun",
            "sent1": "The doorknob was made of brasses.",
            "sent2": "She polished the brasses until they gleamed.",
            "sent3": "The brasses in the old clock seemed to wink at me.",
            "sent4": "His voice had a brasses quality that commanded attention.",
            "sent5": "The brasses shone like a piece of the sun in her hand."
        },
        {
            "definition": "Bold self-assurance; cheeky",
            "pos": "adjective",
            "sent1": "Her brasses attitude often got her into trouble.",
            "sent2": "He made a brasses remark that left everyone speechless.",
            "sent3": "The squirrel gave her a brasses look before scampering away.",
            "sent4": "His brasses behavior was both irritating and endearing.",
            "sent5": "She faced the challenge with a brasses determination that impressed everyone."
        },
        {
            "definition": "A brass musical instrument",
            "pos": "noun",
            "sent1": "The band played beautifully, each member holding a brasses.",
            "sent2": "He practiced the brasses diligently to perfect his skills.",
            "sent3": "The brasses gleamed under the stage lights, ready to perform.",
            "sent4": "The sound of the brasses filled the concert hall with joy.",
            "sent5": "The brasses blared triumphantly in the grand finale."
        },
        {
            "definition": "A brass ornament or utensil",
            "pos": "noun",
            "sent1": "The table was adorned with elegant brasses.",
            "sent2": "She collected antique brasses from around the world.",
            "sent3": "The brasses on the shelf caught the sunlight and sparkled.",
            "sent4": "The brasses in the kitchen added a touch of sophistication.",
            "sent5": "The intricate brasses were a testament to the craftsman's skill."
        },
        {
            "definition": "A brass memorial tablet",
            "pos": "noun",
            "sent1": "The brasses in the church commemorated the fallen soldiers.",
            "sent2": "Visitors paused to read the names on the brasses.",
            "sent3": "The brasses on the wall told stories of heroism and sacrifice.",
            "sent4": "The brasses served as a reminder of those who came before us.",
            "sent5": "The brasses glistened with the memories of the past."
        }
    ]
}