{
    "term": "brasseries",
    "meanings": [
        {
            "definition": "A restaurant serving alcoholic beverages and simple or hearty food.",
            "pos": "noun",
            "sent1": "We decided to have dinner at one of the local brasseries in town.",
            "sent2": "The brasseries in France are known for their delicious cuisine and wide selection of drinks.",
            "sent3": "The brasseries in the city always make me feel like I'm in a fancy movie.",
            "sent4": "The cozy brasseries on the corner seemed to emit a welcoming glow.",
            "sent5": "The aroma of freshly baked bread filled the brasseries, making it a delightful place to dine."
        },
        {
            "definition": "A brewery or beer hall.",
            "pos": "noun",
            "sent1": "The old brasseries in the village have been brewing beer for generations.",
            "sent2": "Visitors from around the world come to taste the unique brews at the local brasseries.",
            "sent3": "The brasseries were so crowded during Oktoberfest that it felt like a lively party.",
            "sent4": "The brasseries stood tall like ancient guardians of the art of brewing.",
            "sent5": "The sound of clinking glasses echoed through the brasseries, creating a cheerful atmosphere."
        },
        {
            "definition": "An establishment where beer is brewed.",
            "pos": "noun",
            "sent1": "The small brasseries in the countryside produce some of the finest craft beers.",
            "sent2": "The tour guide explained the traditional brewing process at the historic brasseries.",
            "sent3": "The brasseries looked like magical factories where beer was the main treasure.",
            "sent4": "Steam rose from the brasseries, giving them an almost mystical appearance.",
            "sent5": "The bubbling vats in the brasseries bubbled with the promise of delicious beer to come."
        }
    ]
}