{
    "term": "breaststrokes",
    "meanings": [
        {
            "definition": "A swimming stroke performed on the chest with both arms moving symmetrically.",
            "pos": "noun",
            "sent1": "During the race, she used powerful breaststrokes to move through the water.",
            "sent2": "Swimmers often practice their breaststrokes to improve their technique.",
            "sent3": "The synchronized swimmers performed their breaststrokes with grace and precision.",
            "sent4": "Her breaststrokes cut through the water like a knife through butter.",
            "sent5": "The coach emphasized the importance of proper breaststrokes for speed and efficiency."
        },
        {
            "definition": "The act of moving one's arms in a swimming motion while lying on one's stomach.",
            "pos": "noun",
            "sent1": "In the pool, she practiced her breaststrokes to strengthen her arms.",
            "sent2": "During swimming lessons, the instructor taught the children how to do breaststrokes.",
            "sent3": "He pretended to do breaststrokes on the grass, pretending to swim.",
            "sent4": "Her exaggerated breaststrokes on land made everyone laugh.",
            "sent5": "The little girl's imaginary breaststrokes on the playground were adorable."
        },
        {
            "definition": "A type of swimming technique used in competitive races.",
            "pos": "noun",
            "sent1": "Competitive swimmers train rigorously to perfect their breaststrokes.",
            "sent2": "During the championship, the athlete showcased his flawless breaststrokes.",
            "sent3": "The penguin at the zoo attempted to mimic the breaststrokes of the swimmers.",
            "sent4": "His determination in mastering the breaststrokes paid off in the competition.",
            "sent5": "The crowd cheered as the swimmer executed powerful breaststrokes to reach the finish line."
        }
    ]
}