{
    "term": "breathy",
    "meanings": [
        {
            "definition": "Spoken or sung with audible breath",
            "pos": "adjective",
            "sent1": "Her breathy voice filled the room with a gentle sound.",
            "sent2": "The singer's breathy performance captivated the audience.",
            "sent3": "The breathy whispers in the library made everyone giggle.",
            "sent4": "The breathy tone of her speech was like a soft breeze.",
            "sent5": "The breathy quality of her voice was soothing and calming."
        },
        {
            "definition": "Having a soft, gentle sound",
            "pos": "adjective",
            "sent1": "The breathy wind rustled the leaves in the trees.",
            "sent2": "The breathy music played in the background of the movie.",
            "sent3": "The breathy laughter of the children echoed in the park.",
            "sent4": "Her breathy sigh conveyed a sense of contentment.",
            "sent5": "The breathy sound of the waves crashing on the shore was peaceful."
        },
        {
            "definition": "Characterized by audible breathing",
            "pos": "adjective",
            "sent1": "The breathy sound of his asthma attack was concerning.",
            "sent2": "The breathy noise coming from the old house was eerie.",
            "sent3": "The breathy panting of the dog after a run was adorable.",
            "sent4": "The breathy gasps of the hiker could be heard from afar.",
            "sent5": "The breathy wheezing of the patient indicated a need for medical attention."
        },
        {
            "definition": "Producing sound with an audible exhalation",
            "pos": "verb",
            "sent1": "She breathily sang the high notes with ease.",
            "sent2": "The exhausted runner breathily crossed the finish line.",
            "sent3": "He breathily whispered the secret to his friend.",
            "sent4": "The singer breathily performed the emotional ballad.",
            "sent5": "The actor breathily delivered the lines to convey the character's emotion."
        }
    ]
}