{
    "term": "breachers",
    "meanings": [
        {
            "definition": "A person who breaks through or enters a place unlawfully.",
            "pos": "noun",
            "sent1": "The breachers were caught by the police while trying to enter the building.",
            "sent2": "The security guard spotted the breachers climbing over the fence.",
            "sent3": "The breachers thought they could sneak in unnoticed, but they were wrong.",
            "sent4": "The breachers were like determined ants, finding a way into the picnic basket.",
            "sent5": "The image of the breachers scaling the wall stayed in the guard's mind."
        },
        {
            "definition": "A tool or device used for breaking through barriers or obstacles.",
            "pos": "noun",
            "sent1": "The construction workers used heavy breachers to demolish the old wall.",
            "sent2": "The firefighters carried the breachers to break open the locked door.",
            "sent3": "The breachers made the task of opening the jammed window much easier.",
            "sent4": "The breachers were like magic keys, unlocking the secrets of the ancient chest.",
            "sent5": "The sound of the breachers crashing through the door echoed in the empty hallway."
        },
        {
            "definition": "A ship designed for breaking through ice.",
            "pos": "noun",
            "sent1": "The breachers sailed through the icy waters with ease, thanks to their reinforced hull.",
            "sent2": "The crew of the breachers cheered as they successfully navigated through the frozen sea.",
            "sent3": "The breachers seemed to dance on the ice as they broke through the frozen surface.",
            "sent4": "The breachers were like mighty icebreakers, clearing a path for other ships.",
            "sent5": "The sight of the breachers plowing through the thick ice was both impressive and intimidating."
        }
    ]
}