{
    "term": "breaking",
    "meanings": [
        {
            "definition": "To separate into pieces",
            "pos": "verb",
            "sent1": "She was breaking the cookie into small crumbs.",
            "sent2": "The glass shattered, breaking into sharp shards.",
            "sent3": "He joked that he was breaking the rules by eating dessert first.",
            "sent4": "The news of the accident was like breaking glass in the silence of the room.",
            "sent5": "The sound of breaking waves against the shore was soothing."
        },
        {
            "definition": "To interrupt or stop",
            "pos": "verb",
            "sent1": "The loud noise was breaking his concentration.",
            "sent2": "Please don't break my train of thought by interrupting.",
            "sent3": "The cat kept breaking his attempts to meditate by meowing loudly.",
            "sent4": "The sudden rainstorm broke the outdoor party.",
            "sent5": "The teacher's shout broke the chatter in the classroom."
        },
        {
            "definition": "To make a hole or opening in",
            "pos": "verb",
            "sent1": "He was breaking the ground with a shovel to plant flowers.",
            "sent2": "The drill was used for breaking through the tough concrete.",
            "sent3": "The squirrel was breaking into the bird feeder for some seeds.",
            "sent4": "The sun was breaking through the clouds after the storm.",
            "sent5": "The key was breaking the lock to open the door."
        },
        {
            "definition": "To surpass or exceed",
            "pos": "verb",
            "sent1": "Her speed was breaking all previous records in the race.",
            "sent2": "The new movie's box office numbers were breaking expectations.",
            "sent3": "The cake's sweetness was breaking the limits of deliciousness.",
            "sent4": "His dedication to his work was breaking boundaries in the industry.",
            "sent5": "The artist's talent was breaking through to new heights."
        },
        {
            "definition": "To disclose or reveal",
            "pos": "verb",
            "sent1": "The journalist was breaking the news of the scandal.",
            "sent2": "The witness finally broke the truth about what happened.",
            "sent3": "The magician was breaking the secret behind his tricks.",
            "sent4": "The detective was breaking the case wide open with new evidence.",
            "sent5": "The diary was breaking the hidden thoughts of the writer."
        }
    ]
}