{
    "term": "breastfeeding",
    "meanings": [
        {
            "definition": "The act of feeding a baby or young child with milk from the breast.",
            "pos": "noun",
            "sent1": "Breastfeeding is a natural way for mothers to nourish their babies.",
            "sent2": "Many pediatricians recommend breastfeeding for the health benefits it provides.",
            "sent3": "The baby's enthusiastic breastfeeding made everyone in the room smile.",
            "sent4": "Her breastfeeding was like a gentle stream of comfort flowing to her child.",
            "sent5": "The bond created through breastfeeding is truly special and irreplaceable."
        },
        {
            "definition": "The practice of feeding a baby or young child with milk from the breast.",
            "pos": "noun",
            "sent1": "Breastfeeding is a beautiful and intimate experience between a mother and her child.",
            "sent2": "In some cultures, extended breastfeeding is a common practice.",
            "sent3": "The family picnic turned into a chaotic scene when the toddler demanded breastfeeding in the park.",
            "sent4": "Her dedication to breastfeeding was as strong as a mother bear protecting her cubs.",
            "sent5": "The act of breastfeeding creates a strong emotional connection between mother and baby."
        },
        {
            "definition": "The act of breastfeeding a baby or young child.",
            "pos": "noun",
            "sent1": "The mother's gentle breastfeeding calmed the fussy baby in an instant.",
            "sent2": "Breastfeeding in public is a natural and normal part of motherhood.",
            "sent3": "The baby's sudden request for breastfeeding during the meeting caught everyone off guard.",
            "sent4": "Her soothing voice accompanied the act of breastfeeding, creating a peaceful atmosphere.",
            "sent5": "The act of breastfeeding is a beautiful display of maternal care and love."
        }
    ]
}