{
    "term": "briks",
    "meanings": [
        {
            "definition": "A unit of currency in Thailand.",
            "pos": "noun",
            "sent1": "In Thailand, you can buy many things with just a few briks.",
            "sent2": "I exchanged my dollars for Thai briks at the bank.",
            "sent3": "I accidentally paid with briks instead of dollars at the market!",
            "sent4": "Her smile was worth more than a handful of briks.",
            "sent5": "The shiny briks jingled in his pocket."
        },
        {
            "definition": "A type of building material made from clay.",
            "pos": "noun",
            "sent1": "The house was built using red briks for a classic look.",
            "sent2": "The sun warmed the red briks on the old building.",
            "sent3": "I pretended the brik was a tiny house for ants.",
            "sent4": "His determination was as solid as the brik wall.",
            "sent5": "The brik pathway led to a secret garden."
        },
        {
            "definition": "To construct something using bricks.",
            "pos": "verb",
            "sent1": "We will briks a new wall in the backyard next weekend.",
            "sent2": "The workers briksed the patio with precision and care.",
            "sent3": "He tried to briks a tower of cards but failed miserably.",
            "sent4": "She will briks a strong foundation for her future success.",
            "sent5": "The children happily briksed a castle in the sand."
        },
        {
            "definition": "A slang term for a kilogram of drugs.",
            "pos": "noun",
            "sent1": "The police seized a shipment of illegal briks in the bust.",
            "sent2": "Dealers were caught smuggling briks across the border.",
            "sent3": "He joked that his energy drink felt like a brik of caffeine.",
            "sent4": "The value of a brik of drugs is not worth the risk.",
            "sent5": "The brik of drugs weighed heavy on his conscience."
        }
    ]
}