{
    "term": "britannia",
    "meanings": [
        {
            "definition": "The ancient Roman name for Great Britain.",
            "pos": "noun",
            "sent1": "In history class, we learned about Britannia, the old name for Great Britain.",
            "sent2": "The teacher explained that Britannia was what the Romans called Great Britain long ago.",
            "sent3": "During the play, the actor dressed as Britannia tripped over her toga and made everyone laugh.",
            "sent4": "The spirit of Britannia watches over the island like a protective guardian.",
            "sent5": "The image of Britannia on the coin was so detailed, it looked almost real."
        },
        {
            "definition": "A personification of Great Britain.",
            "pos": "noun",
            "sent1": "Britannia, the symbol of Great Britain, is often depicted with a shield and trident.",
            "sent2": "In patriotic artwork, Britannia is shown as a strong and noble figure representing the nation.",
            "sent3": "At the parade, a person dressed as Britannia waved to the crowd with a big smile.",
            "sent4": "The idea of Britannia standing tall embodies the resilience of the British people.",
            "sent5": "The statue of Britannia in the town square is a reminder of our country's heritage."
        },
        {
            "definition": "A type of silver alloy used in making coins.",
            "pos": "noun",
            "sent1": "The mint produced coins using britannia, a durable silver alloy.",
            "sent2": "Collectors value coins made of britannia for their high silver content.",
            "sent3": "The jeweler crafted a beautiful necklace using britannia for a special customer.",
            "sent4": "The shimmer of britannia in the sunlight made the coins sparkle like stars.",
            "sent5": "The britannia coins had a distinct shine that set them apart from others in the collection."
        }
    ]
}