{
    "term": "broadway",
    "meanings": [
        {
            "definition": "A wide street in New York City known for its theaters and entertainment venues.",
            "pos": "noun",
            "sent1": "Walking down Broadway, you can see many colorful signs for shows.",
            "sent2": "Let's go watch a play on Broadway this weekend.",
            "sent3": "The pigeons on Broadway seem to enjoy the musicals too.",
            "sent4": "Her life felt like a Broadway show, full of drama and excitement.",
            "sent5": "The lights on Broadway shine brightly, attracting visitors from all over."
        },
        {
            "definition": "The theatrical profession or industry.",
            "pos": "noun",
            "sent1": "She dreamed of making it big in the Broadway industry.",
            "sent2": "Many talented actors work hard to succeed in Broadway.",
            "sent3": "The Broadway business can be tough, but rewarding.",
            "sent4": "In the world of Broadway, every performance is a chance to shine.",
            "sent5": "His passion for Broadway drove him to pursue acting as a career."
        },
        {
            "definition": "A type of dance characterized by sharp, exaggerated movements.",
            "pos": "noun",
            "sent1": "The dancers on Broadway moved with precision and energy.",
            "sent2": "Broadway dance requires strength and flexibility.",
            "sent3": "She tried to imitate the Broadway dance moves but ended up tripping.",
            "sent4": "His dance was like a Broadway performance, captivating the audience.",
            "sent5": "The Broadway style of dance is both challenging and exhilarating."
        },
        {
            "definition": "A type of musical theater performance.",
            "pos": "noun",
            "sent1": "The Broadway show was a hit with the audience.",
            "sent2": "Let's get tickets to the new Broadway musical.",
            "sent3": "The cats put on a Broadway performance in the backyard.",
            "sent4": "Her voice echoed through the room like a Broadway singer.",
            "sent5": "The magic of Broadway performances leaves you wanting more."
        }
    ]
}