{
    "term": "broach",
    "meanings": [
        {
            "definition": "To raise a sensitive or difficult subject for discussion.",
            "pos": "verb",
            "sent1": "She decided to broach the topic of bedtime with her parents.",
            "sent2": "He knew it was time to broach the issue of sharing toys with his friend.",
            "sent3": "At the family dinner, she jokingly broached the idea of getting a pet elephant.",
            "sent4": "The novel broached the theme of forgiveness in a powerful way.",
            "sent5": "The teacher broached the concept of empathy through a touching story."
        },
        {
            "definition": "A tool used for making holes in metal or wood.",
            "pos": "noun",
            "sent1": "He used a broach to create a hole in the metal sheet.",
            "sent2": "The carpenter always carried a broach in his toolbox for woodworking.",
            "sent3": "The tiny broach looked like a miniature key for a fairy's door.",
            "sent4": "The broach worked its magic on the tough metal, creating a perfect hole.",
            "sent5": "The shiny broach gleamed under the workshop lights, ready for use."
        },
        {
            "definition": "To pierce or penetrate something.",
            "pos": "verb",
            "sent1": "The arrow managed to broach the armor of the knight.",
            "sent2": "The needle carefully broached the fabric, creating a neat stitch.",
            "sent3": "The mischievous squirrel broached the bag of nuts and had a feast.",
            "sent4": "His words broached her heart, leaving a lasting impact.",
            "sent5": "The sunlight broached the thick clouds, illuminating the valley below."
        },
        {
            "definition": "A decorative pin worn on clothing.",
            "pos": "noun",
            "sent1": "She proudly wore a broach on her elegant dress.",
            "sent2": "The antique broach was a family heirloom passed down for generations.",
            "sent3": "The broach sparkled like a tiny star on her lapel.",
            "sent4": "The broach added a touch of sophistication to her outfit.",
            "sent5": "The intricate design of the broach caught everyone's eye at the party."
        },
        {
            "definition": "To tap into a cask of liquor.",
            "pos": "verb",
            "sent1": "The bartender needed to broach the keg to serve the customers.",
            "sent2": "He carefully broached the barrel of wine for the special occasion.",
            "sent3": "The pirates were eager to broach the rum cask after a long voyage.",
            "sent4": "She watched as he broached the whiskey barrel with expertise.",
            "sent5": "The aroma of the broached beer filled the room, enticing everyone."
        }
    ]
}