{
    "term": "broad",
    "meanings": [
        {
            "definition": "Wide in extent from side to side.",
            "pos": "adjective",
            "sent1": "The road was so broad that two cars could easily drive side by side.",
            "sent2": "The river was so broad that it took a long time to swim across.",
            "sent3": "The broad smile on the clown's face made everyone laugh.",
            "sent4": "Her broad knowledge of history amazed her classmates.",
            "sent5": "The broad mountain range stretched as far as the eye could see."
        },
        {
            "definition": "Covering a large number and wide scope of subjects or areas.",
            "pos": "adjective",
            "sent1": "The newspaper had a broad range of articles covering various topics.",
            "sent2": "Her broad experience in different fields made her a valuable team member.",
            "sent3": "The broad selection of ice cream flavors made it hard to choose just one.",
            "sent4": "His broad understanding of science helped him excel in school.",
            "sent5": "The library offered a broad collection of books for all ages."
        },
        {
            "definition": "Not detailed or specific.",
            "pos": "adjective",
            "sent1": "She gave a broad overview of the project without going into specifics.",
            "sent2": "The broad strokes of the painting left room for interpretation.",
            "sent3": "His broad explanation confused the students more than it helped.",
            "sent4": "The broad description of the event left out important details.",
            "sent5": "The broad summary of the book didn't capture its depth and complexity."
        },
        {
            "definition": "Having a wide range or extent.",
            "pos": "adjective",
            "sent1": "The store had a broad selection of shoes in different styles.",
            "sent2": "Her interests were broad, ranging from art to sports.",
            "sent3": "The broad variety of fruits at the market made shopping enjoyable.",
            "sent4": "His knowledge was broad, covering many different fields.",
            "sent5": "The company offered a broad range of products to meet customer needs."
        }
    ]
}