{
    "term": "broguery",
    "meanings": [
        {
            "definition": "The behavior of a rogue or scoundrel.",
            "pos": "noun",
            "sent1": "His broguery was evident in the way he constantly lied and cheated.",
            "sent2": "The broguery of the thief was finally exposed by the vigilant detective.",
            "sent3": "The children's playful broguery during the game of hide-and-seek made everyone laugh.",
            "sent4": "Her broguery in the negotiation room was like a skilled actor playing a villain.",
            "sent5": "The broguery of the pirate captain was so notorious that sailors feared crossing his path."
        },
        {
            "definition": "Deceitful or dishonest behavior.",
            "pos": "noun",
            "sent1": "She was caught red-handed in her broguery, trying to manipulate the truth.",
            "sent2": "The politician's broguery was finally exposed by the investigative journalists.",
            "sent3": "His broguery in pretending to be sick to skip school was quickly discovered by his teacher.",
            "sent4": "The broguery of the con artist was like a dark shadow lurking in the alleys.",
            "sent5": "The broguery of the scammer left a trail of victims who fell for his lies."
        },
        {
            "definition": "The practice of engaging in mischief or trickery.",
            "pos": "noun",
            "sent1": "Their playful broguery during the prank war escalated to hilarious levels.",
            "sent2": "The mischievous cat's broguery included knocking over flower vases and spilling water.",
            "sent3": "The broguery of the magician amazed the audience as he made objects disappear and reappear.",
            "sent4": "The fox's broguery in outsmarting the farmer's dog was a testament to its cunning nature.",
            "sent5": "The children's broguery in creating a fake treasure map led them on an exciting adventure."
        }
    ]
}