{
    "term": "broken",
    "meanings": [
        {
            "definition": "Not functioning properly",
            "pos": "adjective",
            "sent1": "The old clock was broken and could not tell time.",
            "sent2": "The broken toy car could not move anymore.",
            "sent3": "The broken computer tried to play music instead of showing the time.",
            "sent4": "His broken phone was like a silent friend, never ringing.",
            "sent5": "The broken door handle made it impossible to enter the room."
        },
        {
            "definition": "Shattered into pieces",
            "pos": "adjective",
            "sent1": "The broken vase lay in fragments on the floor.",
            "sent2": "The broken mirror reflected a thousand shattered images.",
            "sent3": "The broken plate looked like a puzzle waiting to be solved.",
            "sent4": "Her broken heart felt like a million sharp shards inside her chest.",
            "sent5": "The broken glass sparkled like a thousand tiny diamonds in the sun."
        },
        {
            "definition": "No longer in one piece",
            "pos": "adjective",
            "sent1": "The broken chair had missing legs and wobbled when sat on.",
            "sent2": "The broken necklace had lost its clasp and scattered beads everywhere.",
            "sent3": "The broken puzzle had a missing piece that no one could find.",
            "sent4": "Her broken bracelet was now two separate halves, no longer a whole.",
            "sent5": "The broken bridge left a gap that no one could cross."
        },
        {
            "definition": "Weakened in spirit or morale",
            "pos": "adjective",
            "sent1": "After the defeat, the team felt broken and disheartened.",
            "sent2": "The broken soldier returned from war with a heavy heart.",
            "sent3": "The broken singer forgot the lyrics and felt embarrassed on stage.",
            "sent4": "Her broken confidence shattered like glass under criticism.",
            "sent5": "The broken spirit of the community needed uplifting words to heal."
        }
    ]
}