{
    "term": "bromeliads",
    "meanings": [
        {
            "definition": "A type of tropical plant with colorful flowers and thick leaves.",
            "pos": "noun",
            "sent1": "In the garden, the bromeliads added a splash of color with their vibrant flowers.",
            "sent2": "The bromeliads in the greenhouse are thriving under the warm sunlight.",
            "sent3": "The bromeliads at the party were the center of attention with their bright blooms.",
            "sent4": "Her room was like a jungle, filled with bromeliads peeking out from every corner.",
            "sent5": "The bromeliads in the forest seemed to glow with their own light, mesmerizing all who passed by."
        },
        {
            "definition": "Plants in the family Bromeliaceae, typically found in tropical regions.",
            "pos": "noun",
            "sent1": "The bromeliads in the rainforest create a lush and vibrant ecosystem.",
            "sent2": "Researchers study bromeliads to understand their role in the tropical ecosystem.",
            "sent3": "The bromeliads in the botanical garden seemed to be gossiping about the other plants.",
            "sent4": "The bromeliads in the jungle stood tall like guardians of the forest.",
            "sent5": "The bromeliads in the exhibit were like jewels in a treasure trove, each one unique and precious."
        },
        {
            "definition": "Any plant belonging to the family Bromeliaceae, including pineapples and Spanish moss.",
            "pos": "noun",
            "sent1": "The pineapple is a well-known bromeliad that is enjoyed for its sweet taste.",
            "sent2": "Spanish moss is a bromeliad that hangs gracefully from tree branches.",
            "sent3": "The bromeliads in the fruit salad were a delightful surprise for the guests.",
            "sent4": "Her garden was a paradise of bromeliads, each one more beautiful than the last.",
            "sent5": "The bromeliads in the market were a colorful display, attracting customers with their beauty."
        }
    ]
}