{
    "term": "bronchodilators",
    "meanings": [
        {
            "definition": "Medication that relaxes and widens the airways in the lungs to make breathing easier.",
            "pos": "noun",
            "sent1": "The doctor prescribed bronchodilators to help me breathe better.",
            "sent2": "She always carries her bronchodilators with her in case of an asthma attack.",
            "sent3": "The bronchodilators danced in my lungs, making breathing feel like a breeze.",
            "sent4": "His words were like bronchodilators for my anxious mind, opening up new perspectives.",
            "sent5": "The bronchodilators worked like magic, clearing the path for fresh air."
        },
        {
            "definition": "A substance that helps to open up the bronchial tubes in the lungs.",
            "pos": "noun",
            "sent1": "During the asthma attack, she quickly used bronchodilators to ease her breathing.",
            "sent2": "The nurse administered the bronchodilators to help the patient breathe better.",
            "sent3": "The bronchodilators in the inhaler were like tiny keys unlocking the airways.",
            "sent4": "His laughter acted as bronchodilators, opening up the stifled atmosphere.",
            "sent5": "The bronchodilators were a breath of fresh air, literally and figuratively."
        },
        {
            "definition": "Drugs used to treat asthma and other respiratory conditions by expanding the bronchial passages.",
            "pos": "noun",
            "sent1": "My grandmother relies on bronchodilators to manage her asthma symptoms.",
            "sent2": "The doctor recommended using bronchodilators regularly to improve lung function.",
            "sent3": "The bronchodilators in the nebulizer hummed a soothing tune as they worked.",
            "sent4": "Her determination was like bronchodilators, opening up new possibilities for her health.",
            "sent5": "The bronchodilators were a lifeline, helping her breathe freely once again."
        }
    ]
}