{
    "term": "bronchos",
    "meanings": [
        {
            "definition": "A term used to refer to the bronchial tubes in the respiratory system.",
            "pos": "noun",
            "sent1": "The doctor examined the patient's bronchos to check for any blockages.",
            "sent2": "When you have a cold, sometimes your bronchos can get congested.",
            "sent3": "The bronchos in the lungs were having a party, causing the person to cough uncontrollably.",
            "sent4": "Her laughter echoed through the room like a breeze through bronchos.",
            "sent5": "The bronchos were like tiny tunnels carrying air in and out of the lungs."
        },
        {
            "definition": "A shortened form of the word 'bronchoscopy', a medical procedure to examine the bronchial tubes.",
            "pos": "noun",
            "sent1": "The doctor recommended a bronchos to investigate the cause of the persistent cough.",
            "sent2": "After the bronchos, the patient was relieved to know there were no major issues.",
            "sent3": "During the bronchos, the doctor found a tiny toy car stuck in the bronchial tubes.",
            "sent4": "The bronchos revealed a hidden world inside the patient's lungs.",
            "sent5": "The bronchoscopy was like a mini adventure exploring the inner workings of the respiratory system."
        },
        {
            "definition": "A term used in horse racing to refer to a horse's bronchial tubes.",
            "pos": "noun",
            "sent1": "The vet checked the horse's bronchos before the race to ensure it was in top condition.",
            "sent2": "A horse with clear bronchos is likely to perform better in races.",
            "sent3": "The mischievous horse tried to blow bubbles through its bronchos, amusing the spectators.",
            "sent4": "The sound of the galloping horses was like music flowing through their bronchos.",
            "sent5": "The bronchos of the racehorses were like powerful engines propelling them forward."
        }
    ]
}