{
    "term": "brooking",
    "meanings": [
        {
            "definition": "To tolerate or allow",
            "pos": "verb",
            "sent1": "She was not brooking any excuses for being late to class.",
            "sent2": "The teacher was brooking no disruptions during the exam.",
            "sent3": "The strict librarian was brooking no noise in the library.",
            "sent4": "The mother brooked no arguments when it came to bedtime.",
            "sent5": "The boss was brooking no laziness in the workplace."
        },
        {
            "definition": "To endure or put up with",
            "pos": "verb",
            "sent1": "Despite the rain, the hikers were brooking the challenging trail.",
            "sent2": "She was brooking the long wait at the doctor's office with patience.",
            "sent3": "The cat was brooking the playful antics of the new puppy.",
            "sent4": "He was brooking the pain of his injury with a brave face.",
            "sent5": "The student was brooking the difficult assignment with determination."
        },
        {
            "definition": "To bear or suffer",
            "pos": "verb",
            "sent1": "The old tree was brooking the weight of the heavy snow on its branches.",
            "sent2": "She was brooking the loss of her beloved pet with tears in her eyes.",
            "sent3": "The soldier was brooking the wounds of battle with courage.",
            "sent4": "The patient was brooking the discomfort of the medical procedure.",
            "sent5": "The athlete was brooking the pain of the intense workout."
        },
        {
            "definition": "To accept or handle",
            "pos": "verb",
            "sent1": "He was brooking the responsibility of leading the team with confidence.",
            "sent2": "The chef was brooking the pressure of cooking for a large event.",
            "sent3": "The student was brooking the challenge of the difficult math problem.",
            "sent4": "The manager was brooking the demands of the busy workday.",
            "sent5": "The parent was brooking the chaos of the children's playdate."
        }
    ]
}