{
    "term": "brotherly",
    "meanings": [
        {
            "definition": "characteristic of or befitting a brother; affectionate and loyal",
            "pos": "adjective",
            "sent1": "The siblings shared a brotherly bond that was evident to everyone around them.",
            "sent2": "The boys hugged each other in a brotherly manner after not seeing each other for months.",
            "sent3": "The two friends joked that their brotherly love was stronger than any sibling rivalry.",
            "sent4": "Their brotherly support was like a sturdy bridge, always there to lean on in times of need.",
            "sent5": "The warmth of their brotherly relationship enveloped everyone in its comforting embrace."
        },
        {
            "definition": "in a manner characteristic of brothers; with love and loyalty",
            "pos": "adverb",
            "sent1": "The friends stood brotherly by each other's side through thick and thin.",
            "sent2": "He always treated his teammates brotherly, offering encouragement and support.",
            "sent3": "The siblings high-fived each other brotherly after winning the game.",
            "sent4": "She smiled brotherly at her best friend, grateful for their unwavering friendship.",
            "sent5": "The coach praised the team for working together brotherly towards their common goal."
        },
        {
            "definition": "showing the close relationship between brothers",
            "pos": "adjective",
            "sent1": "The brothers' inside jokes were a clear sign of their brotherly connection.",
            "sent2": "The family photo captured the brothers' brotherly bond for generations to come.",
            "sent3": "Their brotherly banter always brought laughter and joy to family gatherings.",
            "sent4": "The twins' synchronized movements on the basketball court showcased their brotherly coordination.",
            "sent5": "The siblings' matching tattoos symbolized their unbreakable brotherly unity."
        }
    ]
}