{
    "term": "browed",
    "meanings": [
        {
            "definition": "Having eyebrows.",
            "pos": "adjective",
            "sent1": "She is a browed woman with beautiful eyebrows.",
            "sent2": "The actor's browed face showed a range of emotions.",
            "sent3": "The browed man raised his eyebrows in surprise.",
            "sent4": "Her browed expression spoke volumes without words.",
            "sent5": "The browed girl's eyebrows were perfectly arched."
        },
        {
            "definition": "Having a specified kind or number of eyebrows.",
            "pos": "adjective",
            "sent1": "He is a single-browed man with a unibrow.",
            "sent2": "The browed model had thick, bushy eyebrows.",
            "sent3": "The browed lady's eyebrows danced above her eyes.",
            "sent4": "The browed boy's eyebrows were like caterpillars on his face.",
            "sent5": "Her perfectly browed eyebrows framed her face beautifully."
        },
        {
            "definition": "Having a specified kind of brow.",
            "pos": "adjective",
            "sent1": "The furrowed-browed man looked deep in thought.",
            "sent2": "The high-browed lady carried an air of sophistication.",
            "sent3": "The low-browed comedian always made people laugh.",
            "sent4": "The straight-browed professor was known for his intelligence.",
            "sent5": "The arched-browed woman had a mysterious aura."
        },
        {
            "definition": "Having a brow of a specified kind or number.",
            "pos": "adjective",
            "sent1": "The double-browed baby had adorable little eyebrows.",
            "sent2": "The bushy-browed man had eyebrows that needed trimming.",
            "sent3": "The thin-browed girl drew on her eyebrows every morning.",
            "sent4": "The angled-browed woman's eyebrows gave her a fierce look.",
            "sent5": "The dark-browed man had eyebrows that contrasted with his light hair."
        }
    ]
}