{
    "term": "bru",
    "meanings": [
        {
            "definition": "A discoloration of the skin caused by injury",
            "pos": "noun",
            "sent1": "She had a bru on her arm from falling.",
            "sent2": "The bru on his face turned purple and yellow over time.",
            "sent3": "Even the tough guy couldn't hide his bru from the basketball game.",
            "sent4": "The bru on the apple made it look like a tiny, colorful planet.",
            "sent5": "The bru on the banana was a vivid reminder of its delicate nature."
        },
        {
            "definition": "To injure or damage",
            "pos": "verb",
            "sent1": "Be careful not to bru the fruit when picking it.",
            "sent2": "The careless handling bru the fragile vase.",
            "sent3": "He managed to bru his ego with his clumsy dance moves.",
            "sent4": "Her harsh words bru his feelings more than she realized.",
            "sent5": "The storm's strong winds bru the trees, bending them to its will."
        },
        {
            "definition": "A term of endearment in South African English",
            "pos": "noun",
            "sent1": "She called her friend 'bru' as a sign of affection.",
            "sent2": "In South Africa, 'bru' is used to show closeness between friends.",
            "sent3": "The siblings jokingly referred to each other as 'bru' all day.",
            "sent4": "The old friends greeted each other with a warm 'bru' and a smile.",
            "sent5": "The word 'bru' carried a sense of camaraderie and friendship in their conversation."
        },
        {
            "definition": "A Scottish slang term for brother",
            "pos": "noun",
            "sent1": "Jamie is my bru, always looking out for me.",
            "sent2": "The two brothers were known in the neighborhood as the 'bru' duo.",
            "sent3": "When in Scotland, it's common to hear 'bru' used to refer to siblings.",
            "sent4": "Growing up, they shared everything like true brus.",
            "sent5": "The bond between the brus was unbreakable, like a strong chain."
        }
    ]
}