{
    "term": "brus",
    "meanings": [
        {
            "definition": "An abrupt or curt manner of speaking or acting.",
            "pos": "noun",
            "sent1": "She responded with a brus tone, ending the conversation quickly.",
            "sent2": "His brus behavior made everyone uncomfortable in the room.",
            "sent3": "The teacher's brus instructions left the students confused.",
            "sent4": "His brus dismissal of her ideas hurt her feelings.",
            "sent5": "The brus way he spoke made a lasting impression on the audience."
        },
        {
            "definition": "A stiff, coarse hair or fiber.",
            "pos": "noun",
            "sent1": "The cat's fur had a few brus sticking out.",
            "sent2": "She felt the brus of the old broom against her hand.",
            "sent3": "The brus on the carpet made it uncomfortable to walk on barefoot.",
            "sent4": "The brus of the paintbrush scratched the canvas as he painted.",
            "sent5": "The brus of the fabric irritated her sensitive skin."
        },
        {
            "definition": "To clean or scrub vigorously with a brush.",
            "pos": "verb",
            "sent1": "She had to brus the mud off her shoes after the hike.",
            "sent2": "He brus the dishes clean before putting them in the dishwasher.",
            "sent3": "The kids decided to brus the car as a surprise for their parents.",
            "sent4": "She brus the floor until it sparkled like new.",
            "sent5": "He brus the dog's fur gently to remove the tangles."
        },
        {
            "definition": "To touch or graze lightly in passing.",
            "pos": "verb",
            "sent1": "The leaves would brus against the window during the storm.",
            "sent2": "As she walked through the crowd, people would brus against her.",
            "sent3": "The butterfly would brus the flowers as it flew by.",
            "sent4": "The wind would brus the curtains, creating a soft rustling sound.",
            "sent5": "The branches would brus against the roof during the windy night."
        }
    ]
}