{
    "term": "brushback",
    "meanings": [
        {
            "definition": "A pitch thrown close to a batter to intimidate or send a message.",
            "pos": "noun",
            "sent1": "The pitcher used a brushback to show the batter who's in charge.",
            "sent2": "The coach didn't approve of the brushback pitch, considering it unsportsmanlike.",
            "sent3": "The batter chuckled nervously after the brushback, realizing the pitcher's strategy.",
            "sent4": "The brushback pitch was like a warning shot across the batter's bow.",
            "sent5": "The crowd gasped as the brushback narrowly missed the batter's head."
        },
        {
            "definition": "A tactic in baseball where a pitcher throws close to a batter to make them uncomfortable.",
            "pos": "noun",
            "sent1": "The brushback pitch was a clever move to rattle the batter's confidence.",
            "sent2": "Experienced players know how to handle a brushback without losing focus.",
            "sent3": "The batter's reaction to the brushback was priceless, causing a stir in the stands.",
            "sent4": "The brushback was like a psychological game within the game of baseball.",
            "sent5": "The pitcher's sneaky brushback left the batter feeling uneasy at the plate."
        },
        {
            "definition": "To push or force someone or something back with a brush or light touch.",
            "pos": "verb",
            "sent1": "She tried to brushback the curtain to get a better view of the street.",
            "sent2": "The gentle brushback of the hand helped calm the nervous child.",
            "sent3": "He attempted to brushback the cat from the table, but it kept coming back.",
            "sent4": "The soft brushback of the wind against the leaves created a soothing sound.",
            "sent5": "With a quick brushback, she cleared the dust off the old bookshelf."
        }
    ]
}