{
    "term": "brushes",
    "meanings": [
        {
            "definition": "An implement with bristles, wire, or other filaments, used for cleaning, grooming, painting, etc.",
            "pos": "noun",
            "sent1": "She used the brushes to paint a beautiful picture.",
            "sent2": "The artist carefully selected different brushes for each color.",
            "sent3": "The mischievous kitten batted the brushes off the table.",
            "sent4": "Her words were like brushes, gently painting a picture of hope in his mind.",
            "sent5": "The sound of brushes against the canvas filled the room with creativity."
        },
        {
            "definition": "A light touch in passing; a slight stroke.",
            "pos": "noun",
            "sent1": "With a few quick brushes, he fixed the smudge on her cheek.",
            "sent2": "The gentle brushes of the wind rustled the leaves in the trees.",
            "sent3": "The comedian's joke was a light brush on the audience's funny bone.",
            "sent4": "Her laughter was like brushes of joy painting the room with happiness.",
            "sent5": "The brushes of sunlight through the window warmed the room."
        },
        {
            "definition": "To clean, polish, or groom with a brush.",
            "pos": "verb",
            "sent1": "She brushes her hair every morning to keep it smooth.",
            "sent2": "He brushes the dust off the old book before reading it.",
            "sent3": "The robot brushes the floor with precision, leaving no speck of dirt behind.",
            "sent4": "His apology brushed away the tension in the room, leaving a sense of peace.",
            "sent5": "The gardener brushes the leaves gently to reveal the hidden flowers beneath."
        },
        {
            "definition": "To move lightly over or across.",
            "pos": "verb",
            "sent1": "The clouds gently brush against the sky at sunset.",
            "sent2": "Her fingers brush the keys of the piano, creating a beautiful melody.",
            "sent3": "The butterfly brushes past, leaving a trail of colorful magic in its wake.",
            "sent4": "His words brushed over her heart, leaving a warm feeling of comfort.",
            "sent5": "The wind brushes through the trees, whispering secrets to the leaves."
        }
    ]
}