{
    "term": "brushability",
    "meanings": [
        {
            "definition": "The quality of being able to be brushed.",
            "pos": "noun",
            "sent1": "The puppy's fur had excellent brushability, making grooming a breeze.",
            "sent2": "The fabric's brushability made it simple to remove any dirt or debris.",
            "sent3": "The superhero's cape had such incredible brushability that it never tangled in the wind.",
            "sent4": "Her hair had the brushability of silk, flowing effortlessly with each stroke of the brush.",
            "sent5": "The paint's brushability was so smooth, it felt like painting on air."
        },
        {
            "definition": "The ability to be easily brushed.",
            "pos": "noun",
            "sent1": "The cat's fur lacked brushability, making grooming a challenging task.",
            "sent2": "The new carpet's brushability was a relief for pet owners, as it prevented hair from sticking.",
            "sent3": "The comedian joked that his lack of brushability made him the perfect candidate for a messy food fight.",
            "sent4": "Her patience had the brushability of a saint, calmly enduring each setback with grace.",
            "sent5": "The horse's mane had such incredible brushability, it seemed to untangle itself with each stroke."
        },
        {
            "definition": "The act of brushing something.",
            "pos": "noun",
            "sent1": "The gentle brushability of the artist's strokes brought the painting to life.",
            "sent2": "The daily brushability of her hair routine kept her locks shiny and healthy.",
            "sent3": "The chef's secret to a perfect dish was the brushability of his marinade, infusing flavor in every bite.",
            "sent4": "Her words had the brushability of a skilled painter, creating vivid images in the listener's mind.",
            "sent5": "The dancer's movements had the brushability of a master calligrapher, each step deliberate and precise."
        }
    ]
}