{
    "term": "brusher",
    "meanings": [
        {
            "definition": "A person or thing that brushes.",
            "pos": "noun",
            "sent1": "The little girl was the brusher of the family, always making sure everyone's hair was neat.",
            "sent2": "I need to buy a new brusher for cleaning the dust off the shelves.",
            "sent3": "The mischievous puppy thought it was a great idea to become the brusher of the cat's fur.",
            "sent4": "Her gentle touch as a brusher made the task of grooming the dog a soothing experience.",
            "sent5": "The diligent brusher diligently cleaned each corner of the room, leaving it spotless."
        },
        {
            "definition": "A tool or device used for brushing.",
            "pos": "noun",
            "sent1": "The old brusher was worn out from years of scrubbing the floors.",
            "sent2": "She grabbed the brusher to clean the dirt off her shoes.",
            "sent3": "The brusher seemed to have a mind of its own, moving around the room on its own accord.",
            "sent4": "The brusher in her hand was like a magic wand, transforming the dusty bookshelf into a clean one.",
            "sent5": "The bristles of the brusher were soft yet effective in removing the dirt from the carpet."
        },
        {
            "definition": "A horse trained to jump over obstacles.",
            "pos": "noun",
            "sent1": "The brusher gracefully leaped over the hurdles at the competition.",
            "sent2": "The rider guided the brusher through the challenging course with skill.",
            "sent3": "The brusher horse seemed to enjoy showing off its jumping skills to the spectators.",
            "sent4": "The brusher soared through the air like a bird, clearing the obstacle effortlessly.",
            "sent5": "The bond between the rider and the brusher was evident in their synchronized movements during the show."
        }
    ]
}