{
    "term": "brutalisms",
    "meanings": [
        {
            "definition": "Brutalisms: The quality or condition of being brutal.",
            "pos": "noun",
            "sent1": "The brutalisms of the dictator's rule were evident in the harsh treatment of the citizens.",
            "sent2": "The news report highlighted the brutalisms committed by the criminal gang.",
            "sent3": "Despite the serious topic, the comedian managed to joke about the brutalisms in a lighthearted manner.",
            "sent4": "The brutalisms of war leave scars that may never fully heal.",
            "sent5": "The documentary vividly portrayed the brutalisms faced by the refugees."
        },
        {
            "definition": "Brutalisms: Brutal actions or behavior.",
            "pos": "noun",
            "sent1": "The teacher reprimanded the student for his brutalisms towards his classmates.",
            "sent2": "The police officer intervened to stop the brutalisms happening in the street.",
            "sent3": "The movie exaggerated the villain's brutalisms for dramatic effect.",
            "sent4": "The brutalisms of the antagonist made the hero's victory even more satisfying.",
            "sent5": "The community came together to address the issue of domestic brutalisms."
        },
        {
            "definition": "Brutalisms: A style of architecture characterized by a deliberate lack of ornamentation and a focus on raw materials.",
            "pos": "noun",
            "sent1": "The city's skyline featured buildings with striking brutalisms that stood out among the traditional structures.",
            "sent2": "Architects praised the use of brutalisms in the design of the new museum.",
            "sent3": "The artist incorporated elements of brutalisms into the sculpture to challenge conventional aesthetics.",
            "sent4": "The brutalisms of the industrial era inspired a new wave of architectural innovation.",
            "sent5": "Visitors marveled at the beauty of the museum's brutalisms, appreciating its simplicity and authenticity."
        }
    ]
}