{
    "term": "brutalist",
    "meanings": [
        {
            "definition": "Relating to or characteristic of the architectural style known as brutalism.",
            "pos": "adjective",
            "sent1": "The building had a brutalist design with its simple, block-like structure.",
            "sent2": "The architect chose a brutalist approach for the construction of the new library.",
            "sent3": "The brutalist building stood out among the traditional houses in the neighborhood.",
            "sent4": "Her fashion sense was described as brutalist, favoring clean lines and minimalistic designs.",
            "sent5": "The artist's paintings captured the essence of brutalist architecture in a unique way."
        },
        {
            "definition": "A person who advocates or practices brutalism.",
            "pos": "noun",
            "sent1": "As a brutalist, he believed in the beauty of raw, exposed materials in construction.",
            "sent2": "The brutalist was known for pushing the boundaries of conventional design.",
            "sent3": "The young architect proudly declared himself a brutalist, embracing bold and unconventional ideas.",
            "sent4": "She was considered a brutalist in the art world for her daring and unconventional sculptures.",
            "sent5": "The brutalist's vision for urban planning challenged traditional norms and inspired many."
        },
        {
            "definition": "A work of art or design that is characterized by a stark, unadorned aesthetic.",
            "pos": "noun",
            "sent1": "The sculpture in the park had a brutalist style, featuring rough textures and geometric shapes.",
            "sent2": "The furniture designer created a brutalist chair using industrial materials.",
            "sent3": "The art gallery showcased a collection of brutalist pieces that captivated visitors.",
            "sent4": "Her jewelry line was inspired by brutalist architecture, showcasing bold and angular designs.",
            "sent5": "The photographer captured the essence of urban decay in a series of brutalist photographs."
        }
    ]
}