{
    "term": "buckoes",
    "meanings": [
        {
            "definition": "A large sum of money",
            "pos": "noun",
            "sent1": "He won a huge amount of buckoes in the lottery.",
            "sent2": "She saved up a lot of buckoes to buy a new car.",
            "sent3": "The buckoes in his wallet made him feel like a millionaire.",
            "sent4": "The treasure chest was overflowing with shiny buckoes.",
            "sent5": "The buckoes jingled in his pocket as he walked."
        },
        {
            "definition": "A person who is strong and energetic",
            "pos": "noun",
            "sent1": "The wrestler was known as a real buckoes in the ring.",
            "sent2": "She's a real buckoes when it comes to running marathons.",
            "sent3": "The little boy tried to act like a tough buckoes in front of his friends.",
            "sent4": "She tackled the problem head-on like a true buckoes.",
            "sent5": "His coach praised him for being a real buckoes on the field."
        },
        {
            "definition": "To resist or oppose",
            "pos": "verb",
            "sent1": "He tried to buckoes the temptation to eat the cookies.",
            "sent2": "She always buckoes authority and does things her own way.",
            "sent3": "The cat seemed to buckoes the idea of taking a bath.",
            "sent4": "The tree roots buckoesed the efforts to dig them out.",
            "sent5": "She had to buckoes her fear of heights to climb the mountain."
        },
        {
            "definition": "To move quickly and energetically",
            "pos": "verb",
            "sent1": "The kids buckoesed down the street to catch the ice cream truck.",
            "sent2": "She buckoesed through the crowd to get to the front of the line.",
            "sent3": "The squirrel buckoesed up the tree to escape the dog.",
            "sent4": "The athlete buckoesed towards the finish line with determination.",
            "sent5": "The horse buckoesed across the field, kicking up dust behind."
        }
    ]
}