{
    "term": "buckle",
    "meanings": [
        {
            "definition": "A fastening device, typically made of metal, used to secure two loose ends by snapping together.",
            "pos": "noun",
            "sent1": "She struggled with the buckle on her belt.",
            "sent2": "The buckle on the suitcase kept her belongings safe.",
            "sent3": "The mischievous squirrel tried to open the buckle on the backpack.",
            "sent4": "His determination was the buckle that held the team together.",
            "sent5": "The shiny buckle gleamed in the sunlight."
        },
        {
            "definition": "To bend or warp under pressure.",
            "pos": "verb",
            "sent1": "The old book started to buckle under the weight of the heavy vase.",
            "sent2": "The bridge began to buckle as the floodwaters rose.",
            "sent3": "The tree branches seemed to buckle under the weight of the snow.",
            "sent4": "Her knees started to buckle from exhaustion.",
            "sent5": "The roof began to buckle under the weight of the snow."
        },
        {
            "definition": "To collapse or give way under pressure.",
            "pos": "verb",
            "sent1": "The chair legs started to buckle, causing him to fall.",
            "sent2": "The dam finally buckled under the force of the water.",
            "sent3": "The tired hiker's legs threatened to buckle on the steep trail.",
            "sent4": "His resolve began to buckle under the weight of the criticism.",
            "sent5": "The old building began to buckle from the strong winds."
        },
        {
            "definition": "To fasten or secure with a buckle.",
            "pos": "verb",
            "sent1": "She needed to buckle her helmet before riding the bike.",
            "sent2": "He quickly buckled his seatbelt before the car started moving.",
            "sent3": "The child tried to buckle the toy car to the dollhouse.",
            "sent4": "The knight had to buckle his armor before the battle.",
            "sent5": "She had to buckle her shoes tightly for the race."
        }
    ]
}