{
    "term": "buck",
    "meanings": [
        {
            "definition": "A male deer.",
            "pos": "noun",
            "sent1": "The buck ran gracefully through the forest.",
            "sent2": "I saw a majestic buck with antlers in the woods.",
            "sent3": "The buck seemed to wink at me as it pranced by.",
            "sent4": "The buck's powerful presence commanded respect in the wilderness.",
            "sent5": "The buck's coat shimmered in the sunlight, a true symbol of nature's beauty."
        },
        {
            "definition": "To resist or oppose.",
            "pos": "verb",
            "sent1": "She tried to buck against the strong currents of the river.",
            "sent2": "The horse tried to buck off its rider.",
            "sent3": "The child tried to buck bedtime by asking for one more story.",
            "sent4": "The team decided to buck the trend and try a new strategy.",
            "sent5": "The workers decided to buck the unfair rules and demand better treatment."
        },
        {
            "definition": "A slang term for a dollar.",
            "pos": "noun",
            "sent1": "He handed me a buck for helping him move.",
            "sent2": "I found a buck in my pocket, and it made my day.",
            "sent3": "I felt like a millionaire when I found a buck on the sidewalk.",
            "sent4": "She saved every buck she earned for a special occasion.",
            "sent5": "A buck can go a long way if you spend it wisely."
        },
        {
            "definition": "To leap or jump suddenly.",
            "pos": "verb",
            "sent1": "The rabbit would buck out of sight whenever we approached.",
            "sent2": "The cat tried to buck up to catch the bird.",
            "sent3": "The squirrel would buck from tree to tree in search of nuts.",
            "sent4": "The athlete would buck over the hurdles with ease.",
            "sent5": "The frog would buck into the pond with a splash, disappearing under the water."
        }
    ]
}