{
    "term": "budas",
    "meanings": [
        {
            "definition": "A person who is considered to be foolish or lacking intelligence.",
            "pos": "noun",
            "sent1": "He always acts like a budas in class, never paying attention.",
            "sent2": "The budas in the story made silly mistakes that everyone laughed at.",
            "sent3": "The budas thought the moon was made of cheese and tried to take a bite.",
            "sent4": "Her decision to trust him was a real budas move, leading to trouble.",
            "sent5": "The budas wore mismatched shoes to the formal event, showing his lack of awareness."
        },
        {
            "definition": "The plural form of the word 'buda', which refers to a type of Buddhist temple or shrine.",
            "pos": "noun",
            "sent1": "We visited many budas during our trip to Asia, each one more beautiful than the last.",
            "sent2": "The local community gathered at the budas to celebrate the festival.",
            "sent3": "The budas were so peaceful that even the birds seemed to whisper in reverence.",
            "sent4": "The golden roofs of the budas shone like beacons in the setting sun.",
            "sent5": "The intricate carvings on the walls of the budas told stories of ancient times."
        },
        {
            "definition": "The third person singular form of the verb 'budas', which means to engage in the act of meditation or contemplation.",
            "pos": "noun",
            "sent1": "Every morning, she budas in the garden, finding peace in the quiet surroundings.",
            "sent2": "He often budas by the river, letting his thoughts flow like the water.",
            "sent3": "The cat decided to budas with her, sitting still and staring at nothing in particular.",
            "sent4": "As the sun set, he began to budas, letting go of the worries of the day.",
            "sent5": "In the busy city, finding a quiet place to budas became his daily challenge."
        }
    ]
}