{
    "term": "buffet",
    "meanings": [
        {
            "definition": "A meal consisting of a variety of dishes served together",
            "pos": "noun",
            "sent1": "At the family gathering, we enjoyed a delicious buffet of pasta, salad, and desserts.",
            "sent2": "The hotel offered a breakfast buffet with pancakes, eggs, and fruit.",
            "sent3": "The buffet at the party was so tempting that I couldn't resist going back for seconds.",
            "sent4": "The buffet of colors in the sunset painted the sky with hues of orange, pink, and purple.",
            "sent5": "The buffet of flavors in the dish exploded in my mouth, leaving me wanting more."
        },
        {
            "definition": "A piece of furniture with drawers and shelves for storing dishes and table linens",
            "pos": "noun",
            "sent1": "The antique buffet in the dining room held our best china and silverware.",
            "sent2": "She found a beautiful buffet at the furniture store to match her dining room decor.",
            "sent3": "The buffet in the hallway was cluttered with keys, mail, and random items.",
            "sent4": "The buffet of memories stored in the old photo albums brought tears to her eyes.",
            "sent5": "The buffet of books on the shelves invited her to dive into different worlds."
        },
        {
            "definition": "To strike repeatedly and violently",
            "pos": "verb",
            "sent1": "The boxer continued to buffet his opponent with powerful punches.",
            "sent2": "The storm buffeted the coast, causing damage to buildings and trees.",
            "sent3": "The wind buffeted the umbrella, threatening to turn it inside out.",
            "sent4": "The waves buffeted the boat, making the passengers feel seasick.",
            "sent5": "The hail buffeted the car, leaving dents on the roof and hood."
        },
        {
            "definition": "To be struck repeatedly and violently, especially by wind or waves",
            "pos": "verb",
            "sent1": "The ship buffeted against the rough waves during the storm.",
            "sent2": "The palm trees buffeted by the strong winds swayed back and forth.",
            "sent3": "The tent buffeted by the gusts of wind threatened to collapse.",
            "sent4": "The kite buffeted by the breeze soared high in the sky.",
            "sent5": "The house buffeted by the hurricane's force stood strong against the elements."
        }
    ]
}