{
    "term": "buffeting",
    "meanings": [
        {
            "definition": "Strike repeatedly and violently",
            "pos": "verb",
            "sent1": "The boxer was buffeting his opponent with powerful punches.",
            "sent2": "The blacksmith was buffeting the hot metal to shape it into a horseshoe.",
            "sent3": "The wind buffeting the trees sounded like a drumroll.",
            "sent4": "The storm buffeting the coast was like nature's angry fist.",
            "sent5": "The waves buffeting the shore eroded the cliffs over time."
        },
        {
            "definition": "To be tossed about by wind or waves",
            "pos": "verb",
            "sent1": "The small boat was buffeting in the rough sea, making the passengers feel queasy.",
            "sent2": "The leaves were buffeting in the strong wind, swirling around in a dance.",
            "sent3": "The kite buffeting in the sky looked like a playful bird caught in a gust.",
            "sent4": "The flags buffeting in the breeze added a sense of movement to the scene.",
            "sent5": "The seagulls buffeting in the stormy sky struggled to stay on course."
        },
        {
            "definition": "A series of blows or impacts",
            "pos": "noun",
            "sent1": "The boxer delivered a rapid series of buffeting blows to his opponent.",
            "sent2": "The hailstorm's buffeting on the roof made a deafening noise.",
            "sent3": "The buffeting of the drumsticks on the drum created a rhythmic beat.",
            "sent4": "The buffeting of the waves against the rocks echoed through the bay.",
            "sent5": "The buffeting of the hammer on the anvil signaled the start of the blacksmith's work."
        },
        {
            "definition": "To subject to repeated difficulty or harm",
            "pos": "verb",
            "sent1": "The company was buffeting from the economic downturn, struggling to stay afloat.",
            "sent2": "The village was buffeting by a series of unfortunate events, testing the resilience of its residents.",
            "sent3": "The car buffeting from one repair to another seemed to have a mind of its own.",
            "sent4": "The relationship was buffeting by constant misunderstandings, causing strain between the partners.",
            "sent5": "The crops were buffeting by pests and drought, threatening the farmer's livelihood."
        }
    ]
}