{
    "term": "buffe",
    "meanings": [
        {
            "definition": "A piece of furniture with drawers and shelves for storing dishes and utensils.",
            "pos": "noun",
            "sent1": "The buffe in the dining room holds all our plates and cups.",
            "sent2": "During the party, the guests gathered around the buffe to serve themselves.",
            "sent3": "When the cat jumped on the buffe, the dishes rattled noisily.",
            "sent4": "Her mind was a cluttered buffe, full of memories and forgotten dreams.",
            "sent5": "The antique buffe in the corner of the room added a touch of elegance to the decor."
        },
        {
            "definition": "A meal laid out for guests to help themselves.",
            "pos": "noun",
            "sent1": "At the potluck, there was a delicious buffe of salads and desserts.",
            "sent2": "The wedding reception featured a lavish buffe with a variety of dishes.",
            "sent3": "The kids were thrilled to see a buffe of candies and treats at the birthday party.",
            "sent4": "The buffet table looked like a colorful, tempting buffe of culinary delights.",
            "sent5": "The holiday buffe was a feast for the eyes and the stomach, with so many options to choose from."
        },
        {
            "definition": "To strike with the hand or fist.",
            "pos": "verb",
            "sent1": "He buffed the table to clean off the dust.",
            "sent2": "She buffed the door with a cloth to make it shine.",
            "sent3": "The chef buffed the steak with seasoning before grilling it.",
            "sent4": "The dancer buffed the floor with her smooth moves.",
            "sent5": "The artist buffed the sculpture until it gleamed in the sunlight."
        },
        {
            "definition": "A blow or hit.",
            "pos": "noun",
            "sent1": "The buffe from the ball knocked him off balance.",
            "sent2": "She winced at the buffe of the cold wind against her face.",
            "sent3": "The unexpected buffe of the wave soaked his clothes.",
            "sent4": "The buffe of the hammer against the nail echoed in the workshop.",
            "sent5": "The buffe of the storm against the windows made the whole house shake."
        }
    ]
}