{
    "term": "buffaloed",
    "meanings": [
        {
            "definition": "To intimidate or overawe, especially by a show of force or by one's size or appearance.",
            "pos": "verb",
            "sent1": "The loud roar of the lion buffaloed the smaller animals in the jungle.",
            "sent2": "The large army buffaloed the enemy into surrendering without a fight.",
            "sent3": "The tiny mouse buffaloed the big cat by standing on its hind legs and squeaking loudly.",
            "sent4": "The confident speaker buffaloed the audience with his powerful presence and booming voice.",
            "sent5": "The towering mountain buffaloed the hikers with its majestic size and imposing presence."
        },
        {
            "definition": "To confuse or deceive.",
            "pos": "verb",
            "sent1": "The magician buffaloed the audience with his sleight of hand tricks.",
            "sent2": "The complex riddle buffaloed the participants in the puzzle competition.",
            "sent3": "The sneaky fox buffaloed the other animals by pretending to be lost in the woods.",
            "sent4": "The tricky maze buffaloed the adventurers, making them take wrong turns repeatedly.",
            "sent5": "The misleading map buffaloed the travelers, leading them in circles instead of their destination."
        },
        {
            "definition": "To baffle or outwit.",
            "pos": "verb",
            "sent1": "The clever detective buffaloed the criminals with his unexpected strategy.",
            "sent2": "The tricky puzzle buffaloed the players, making them scratch their heads in confusion.",
            "sent3": "The mischievous squirrel buffaloed the birds by stealing their food and hiding it in a secret stash.",
            "sent4": "The elusive spy buffaloed the agents, always managing to evade capture.",
            "sent5": "The cunning fox buffaloed the farmer by outsmarting all his attempts to catch it."
        }
    ]
}