{
    "term": "buffeter",
    "meanings": [
        {
            "definition": "A person who hits or strikes with force.",
            "pos": "noun",
            "sent1": "The buffeter swung his fists in anger.",
            "sent2": "The buffeter punched the bag with all his might.",
            "sent3": "The buffeter accidentally knocked over the vase with a strong push.",
            "sent4": "In the boxing ring, he was a buffeter of opponents.",
            "sent5": "The buffeter's blows echoed through the room."
        },
        {
            "definition": "To strike repeatedly with force.",
            "pos": "verb",
            "sent1": "She buffetered the door to break it open.",
            "sent2": "The waves buffetered the shore during the storm.",
            "sent3": "The chef buffetered the dough to make it soft and pliable.",
            "sent4": "The wind buffetered the trees, causing them to sway.",
            "sent5": "The rain buffetered against the window all night long."
        },
        {
            "definition": "A piece of furniture with drawers and shelves for storage.",
            "pos": "noun",
            "sent1": "The buffeter in the dining room held all the dishes and cutlery.",
            "sent2": "She placed the fine china in the buffeter for safekeeping.",
            "sent3": "The antique buffeter was a family heirloom passed down for generations.",
            "sent4": "The buffeter in the living room was filled with books and trinkets.",
            "sent5": "The buffeter's drawers were filled with old photographs and letters."
        },
        {
            "definition": "A person who frequents a buffet.",
            "pos": "noun",
            "sent1": "The buffeter enjoyed sampling all the dishes at the buffet.",
            "sent2": "She was a regular buffeter at the local restaurant's buffet.",
            "sent3": "The buffeter always went for seconds at the buffet.",
            "sent4": "The buffet owner welcomed the loyal buffeter with a smile.",
            "sent5": "The buffeter's plate was always piled high at the buffet."
        }
    ]
}