{
    "term": "buggers",
    "meanings": [
        {
            "definition": "A person who engages in anal intercourse.",
            "pos": "noun",
            "sent1": "Tommy heard some kids at school whispering that he was a buggers, but he didn't know what it meant.",
            "sent2": "The buggers in the movie were portrayed as villains, which Tommy found confusing.",
            "sent3": "At the costume party, someone jokingly dressed up as a buggers, causing everyone to burst into laughter.",
            "sent4": "The bugger's betrayal in the story shocked the readers and changed the course of the plot.",
            "sent5": "The bugger's sly smile hinted at his mischievous nature."
        },
        {
            "definition": "Used as an exclamation of annoyance or frustration.",
            "pos": "interjection",
            "sent1": "Buggers! I forgot my lunch at home again.",
            "sent2": "Oh buggers, I missed the bus and now I'll be late for work.",
            "sent3": "Buggers, the rain ruined our picnic plans for the day.",
            "sent4": "Bugger it all, why does everything have to go wrong today?",
            "sent5": "Buggers! That was the last piece of cake, and now it's gone."
        },
        {
            "definition": "To tamper with or sabotage something.",
            "pos": "verb",
            "sent1": "He buggers with the TV remote so much that now it doesn't work properly.",
            "sent2": "She accidentally buggered up the computer settings while trying to fix the printer.",
            "sent3": "The mischievous cat buggered with the yarn, leaving a tangled mess on the floor.",
            "sent4": "The spy buggered the enemy's communication system, causing chaos in their ranks.",
            "sent5": "The naughty child buggered with the puzzle pieces, making it impossible to solve."
        },
        {
            "definition": "A small insect or pest.",
            "pos": "noun",
            "sent1": "The garden was infested with buggers, eating away at the leaves of the plants.",
            "sent2": "She shrieked when she saw a bugger crawling on the kitchen counter.",
            "sent3": "The bugger scurried across the floor, seeking a hiding spot from the light.",
            "sent4": "The bugger's buzzing kept him awake all night, driving him crazy.",
            "sent5": "The picnic was ruined by a swarm of buggers, forcing everyone to pack up and leave."
        }
    ]
}