{
    "term": "builder",
    "meanings": [
        {
            "definition": "a person who constructs something by putting parts or material together",
            "pos": "noun",
            "sent1": "The builder built a new house in our neighborhood.",
            "sent2": "The builder used bricks and cement to construct the wall.",
            "sent3": "The builder accidentally glued his hat to the wall he was building.",
            "sent4": "She was a builder of dreams, creating beautiful structures in her mind.",
            "sent5": "The builder's hands were skilled at turning raw materials into functional buildings."
        },
        {
            "definition": "a substance added to a material to increase its strength or stability",
            "pos": "noun",
            "sent1": "The builder mixed the special additive into the concrete for extra durability.",
            "sent2": "The builder carefully measured the amount of the strengthening agent to add.",
            "sent3": "The builder mistakenly poured too much stabilizer into the mixture, causing it to harden too quickly.",
            "sent4": "The builder's secret ingredient was the key to making the structure indestructible.",
            "sent5": "The builder's eyes sparkled as he added the magic potion that would fortify the material."
        },
        {
            "definition": "a software tool used to create applications or websites",
            "pos": "noun",
            "sent1": "The builder allowed users to design their websites with ease.",
            "sent2": "The builder had various templates to help users start their projects.",
            "sent3": "The builder sometimes played tricks on users by rearranging their layouts unexpectedly.",
            "sent4": "The builder was like a digital wizard, turning ideas into interactive realities.",
            "sent5": "The builder's interface was so intuitive that even beginners could create professional websites."
        }
    ]
}