{
    "term": "built",
    "meanings": [
        {
            "definition": "Constructed",
            "pos": "adjective",
            "sent1": "The sturdy house was built with strong bricks.",
            "sent2": "The built bridge connected the two sides of the river.",
            "sent3": "The little girl proudly showed off her built sandcastle.",
            "sent4": "Their friendship was built on trust and honesty.",
            "sent5": "The built wall stood tall against the wind."
        },
        {
            "definition": "Developed",
            "pos": "adjective",
            "sent1": "The built skills of the young musician impressed everyone.",
            "sent2": "The city's built infrastructure supported its growing population.",
            "sent3": "The team's built strategy led them to victory.",
            "sent4": "Her built confidence shone through in her presentation.",
            "sent5": "The built relationship between the siblings was heartwarming."
        },
        {
            "definition": "Formed",
            "pos": "adjective",
            "sent1": "The built snowman in the yard had a carrot nose.",
            "sent2": "The built clouds in the sky looked like fluffy cotton candy.",
            "sent3": "The built puzzle was missing a few pieces.",
            "sent4": "Her built opinion on the matter was clear.",
            "sent5": "The built team worked together seamlessly."
        },
        {
            "definition": "Created",
            "pos": "verb",
            "sent1": "She built a beautiful sandcastle on the beach.",
            "sent2": "The artist built a masterpiece out of clay.",
            "sent3": "He built a strong case to support his argument.",
            "sent4": "The chef built a delicious cake for the celebration.",
            "sent5": "They built a new playground for the children in the neighborhood."
        },
        {
            "definition": "Assembled",
            "pos": "adjective",
            "sent1": "The built toy car was ready to race.",
            "sent2": "The built furniture filled the room with warmth.",
            "sent3": "The built team of superheroes saved the day.",
            "sent4": "The built computer was efficient and fast.",
            "sent5": "The built jigsaw puzzle was missing a piece."
        }
    ]
}