{
    "term": "bullbaitings",
    "meanings": [
        {
            "definition": "The act of tormenting a bull for entertainment.",
            "pos": "noun",
            "sent1": "In the past, bullbaitings were popular events where people watched bulls being teased.",
            "sent2": "The bullbaitings in the town square drew large crowds looking for excitement.",
            "sent3": "At the fair, the children giggled at the silly bullbaitings happening in the arena.",
            "sent4": "The bullbaitings were like a fierce dance between the bull and the tormentors.",
            "sent5": "The bullbaitings left a lasting impression on the spectators with their intensity."
        },
        {
            "definition": "A cruel and violent form of entertainment involving a bull.",
            "pos": "noun",
            "sent1": "The bullbaitings shocked many with their brutality and lack of compassion.",
            "sent2": "Some considered bullbaitings a barbaric tradition that needed to end.",
            "sent3": "Despite the protests, the bullbaitings continued, much to the dismay of animal lovers.",
            "sent4": "The bullbaitings were a dark spectacle that left a stain on the town's reputation.",
            "sent5": "The bullbaitings were a grim reminder of humanity's capacity for cruelty."
        },
        {
            "definition": "The practice of setting dogs on a bull for sport.",
            "pos": "noun",
            "sent1": "The bullbaitings involved trained dogs that were set loose to chase the bull.",
            "sent2": "In some regions, bullbaitings were considered a traditional form of competition.",
            "sent3": "The bullbaitings turned into a chaotic scene as the dogs tried to catch the bull.",
            "sent4": "The bullbaitings were like a high-stakes game between the dogs and the bull.",
            "sent5": "The bullbaitings showcased the agility and speed of the hunting dogs."
        }
    ]
}