{
    "term": "bullions",
    "meanings": [
        {
            "definition": "Bars of gold or silver",
            "pos": "noun",
            "sent1": "The pirate's treasure chest was filled with shiny bullions.",
            "sent2": "Investors often store their wealth in bullions for safekeeping.",
            "sent3": "The leprechaun's pot of gold was overflowing with gleaming bullions.",
            "sent4": "Her kindness was like a stack of bullions, valuable and precious.",
            "sent5": "The bullions glittered in the sunlight, a symbol of wealth and luxury."
        },
        {
            "definition": "A type of thick soup",
            "pos": "noun",
            "sent1": "Grandma's homemade bullions warmed us on cold winter nights.",
            "sent2": "The restaurant's specialty was a hearty bowl of bullions.",
            "sent3": "The chef accidentally spilled the pot of bullions, creating a soupy mess.",
            "sent4": "The aroma of the simmering bullions filled the kitchen with comfort.",
            "sent5": "The bullions were a savory delight, perfect for a cozy evening meal."
        },
        {
            "definition": "A type of embroidery with raised patterns",
            "pos": "noun",
            "sent1": "The elegant gown was adorned with intricate bullions along the hem.",
            "sent2": "The artist skillfully added bullions to the design, creating a textured effect.",
            "sent3": "The mischievous kitten played with the loose bullions, unraveling the embroidery.",
            "sent4": "Her dress shimmered with golden bullions, catching the light beautifully.",
            "sent5": "The bullions added a touch of elegance to the otherwise plain fabric."
        },
        {
            "definition": "A type of coarse, heavy fabric",
            "pos": "noun",
            "sent1": "The sturdy bullions were used to make durable work uniforms.",
            "sent2": "The curtains were made of thick bullions, blocking out the sunlight.",
            "sent3": "The rough texture of the bullions scratched his skin uncomfortably.",
            "sent4": "She wrapped herself in the warm bullions to shield from the cold wind.",
            "sent5": "The bullions draped over the furniture, adding a rustic charm to the room."
        }
    ]
}