{
    "term": "bulldozed",
    "meanings": [
        {
            "definition": "To clear or level (land) with a bulldozer.",
            "pos": "verb",
            "sent1": "The construction workers bulldozed the field to make space for the new building.",
            "sent2": "The company bulldozed the forest to make way for a new road.",
            "sent3": "The determined bulldozer pushed through the stubborn earth, making way for progress.",
            "sent4": "The bulldozer's blade bulldozed through the obstacles like a unstoppable force.",
            "sent5": "The loud roar of the bulldozer echoed as it bulldozed the land, reshaping it completely."
        },
        {
            "definition": "To force one's way aggressively or ruthlessly through (a place or situation).",
            "pos": "verb",
            "sent1": "The ambitious entrepreneur bulldozed her competitors to reach the top of the market.",
            "sent2": "The team bulldozed through the challenges to emerge victorious in the competition.",
            "sent3": "The determined squirrel bulldozed its way through the crowd of birds to get to the feeder.",
            "sent4": "The storm bulldozed through the town, leaving destruction in its wake.",
            "sent5": "The determined student bulldozed through the difficult exam, answering every question with confidence."
        },
        {
            "definition": "To coerce or pressure (someone) into doing something.",
            "pos": "verb",
            "sent1": "The salesperson bulldozed the customer into buying the expensive product.",
            "sent2": "The manager bulldozed the employees into working overtime without proper compensation.",
            "sent3": "The persistent child bulldozed his parents into buying him a new toy.",
            "sent4": "The politician bulldozed the opposition with his powerful arguments.",
            "sent5": "The aggressive negotiator bulldozed the other party into accepting the deal."
        }
    ]
}