{
    "term": "bundling",
    "meanings": [
        {
            "definition": "A group of items fastened or bound together",
            "pos": "noun",
            "sent1": "The farmer carried a bundling of freshly harvested wheat to the barn.",
            "sent2": "The hiker's backpack contained a bundling of snacks, water, and a map.",
            "sent3": "The children made a fort using a bundling of blankets and pillows.",
            "sent4": "The artist created a sculpture by shaping a bundling of wires and metal pieces.",
            "sent5": "The delivery person struggled to lift the heavy bundling of packages."
        },
        {
            "definition": "The act of combining multiple products or services into a single package for sale",
            "pos": "noun",
            "sent1": "The company offered a special bundling of internet, cable, and phone services.",
            "sent2": "Customers were excited about the new bundling of cosmetics at the beauty store.",
            "sent3": "The magician's trick involved a surprising bundling of scarves and flowers.",
            "sent4": "The chef's menu featured a creative bundling of appetizers for sharing.",
            "sent5": "The store promoted a discount for purchasing a bundling of books and stationery."
        },
        {
            "definition": "A traditional practice of wrapping couples in blankets for sleeping together",
            "pos": "noun",
            "sent1": "In some cultures, bundling is a way for couples to stay warm and cozy at night.",
            "sent2": "The elders shared stories of the old days when bundling was a common custom.",
            "sent3": "During the camping trip, the friends tried bundling for fun but ended up tangled.",
            "sent4": "The romantic movie depicted a scene of bundling under the starry sky.",
            "sent5": "The historical novel described the tradition of bundling in great detail."
        }
    ]
}