{
    "term": "buoyages",
    "meanings": [
        {
            "definition": "The action or practice of marking a route or area with buoys.",
            "pos": "noun",
            "sent1": "The buoyages along the river helped guide the boats safely.",
            "sent2": "The sailors relied on the buoyages to navigate through the foggy waters.",
            "sent3": "During the race, the mischievous seagulls rearranged the buoyages, causing confusion.",
            "sent4": "Her laughter was like the buoyages, marking a clear path through the conversation.",
            "sent5": "The colorful buoyages bobbed cheerfully in the water, making the river seem like a playful maze."
        },
        {
            "definition": "The system of buoys used to mark a route or area.",
            "pos": "noun",
            "sent1": "The old buoyages were replaced with new ones to ensure safety for all ships.",
            "sent2": "The buoyages formed a dotted line across the bay, guiding the incoming vessels.",
            "sent3": "The mischievous dolphins played hide-and-seek around the buoyages, causing a spectacle.",
            "sent4": "The buoyages stood like loyal sentinels, guarding the entrance to the harbor.",
            "sent5": "The rhythmic clang of the buoyages echoed across the water, signaling the approach of a storm."
        },
        {
            "definition": "The act of floating or being buoyant.",
            "pos": "noun",
            "sent1": "The buoyages of the boat kept it afloat even in rough waters.",
            "sent2": "The buoyages of the life jacket ensured the swimmer stayed above water.",
            "sent3": "The playful otter demonstrated its buoyages by effortlessly floating on its back.",
            "sent4": "Her optimism was like the buoyages, lifting her spirits in times of trouble.",
            "sent5": "The buoyages of the clouds carried them gently across the sky, like cotton balls on a breeze."
        }
    ]
}