{
    "term": "burbles",
    "meanings": [
        {
            "definition": "To make a continuous murmuring noise",
            "pos": "verb",
            "sent1": "The stream burbles gently over the rocks.",
            "sent2": "She burbles happily while playing with her toys.",
            "sent3": "The baby burbles in delight at the colorful mobile above her.",
            "sent4": "The coffee machine burbles to life in the early morning.",
            "sent5": "The brook burbles like a contented cat, soothing all who listen."
        },
        {
            "definition": "To speak in a low, indistinct manner",
            "pos": "verb",
            "sent1": "He burbles his thanks as he receives the gift.",
            "sent2": "The tired professor burbles through the lecture at the end of the day.",
            "sent3": "The sleepy child burbles a nonsensical story before falling asleep.",
            "sent4": "The radio burbles with static, making it hard to understand the news.",
            "sent5": "She burbles her excitement about the upcoming trip, barely able to contain herself."
        },
        {
            "definition": "A gurgling or bubbling sound",
            "pos": "noun",
            "sent1": "The burbles of the brook filled the forest with peaceful music.",
            "sent2": "The baby's happy burbles echoed through the room.",
            "sent3": "The mysterious cave was filled with strange burbles that made the explorers nervous.",
            "sent4": "The old coffee maker made strange burbles before finally brewing the coffee.",
            "sent5": "The burbles of the fountain in the park added a serene atmosphere to the surroundings."
        },
        {
            "definition": "To flow with a gurgling sound",
            "pos": "verb",
            "sent1": "The water burbles out of the fountain in the garden.",
            "sent2": "The small stream burbles as it winds through the meadow.",
            "sent3": "The tea kettle burbles as it heats up on the stove.",
            "sent4": "The creek burbles happily as it meanders through the valley.",
            "sent5": "The river burbles along, carrying leaves and twigs in its current."
        }
    ]
}