{
    "term": "burdening",
    "meanings": [
        {
            "definition": "To load or encumber with a heavy weight.",
            "pos": "verb",
            "sent1": "She was burdening herself with too many books.",
            "sent2": "The workers were burdening the cart with heavy boxes.",
            "sent3": "Carrying all those bags was burdening her like a tired donkey.",
            "sent4": "The weight of responsibility burdening his shoulders felt like a mountain.",
            "sent5": "The task of carrying the heavy load was burdening her strength."
        },
        {
            "definition": "To impose or place a heavy load on.",
            "pos": "verb",
            "sent1": "The new regulations were burdening small businesses.",
            "sent2": "The taxes were burdening the citizens beyond their means.",
            "sent3": "The pile of paperwork was burdening him like a never-ending mountain.",
            "sent4": "The expectations burdening her were like chains holding her back.",
            "sent5": "The heavy workload burdening the team was overwhelming."
        },
        {
            "definition": "To weigh down with a heavy load.",
            "pos": "verb",
            "sent1": "The sadness was burdening her heart heavily.",
            "sent2": "The guilt burdening his conscience was unbearable.",
            "sent3": "The rain burdening the tree's branches made them bend low.",
            "sent4": "The worries burdening her mind were like dark clouds blocking the sun.",
            "sent5": "The responsibility burdening his shoulders was dragging him down."
        },
        {
            "definition": "To cause hardship or distress to.",
            "pos": "verb",
            "sent1": "The illness burdening her family brought tears to their eyes.",
            "sent2": "The loss burdening his soul left a void in his heart.",
            "sent3": "The bad news burdening her mind made her feel like she was sinking.",
            "sent4": "The debt burdening their finances was a heavy weight to carry.",
            "sent5": "The fear burdening his thoughts paralyzed him with worry."
        }
    ]
}