{
    "term": "burden",
    "meanings": [
        {
            "definition": "A heavy load or weight.",
            "pos": "noun",
            "sent1": "Carrying the heavy burden of groceries made her arms ache.",
            "sent2": "The donkey struggled under the burden of the large sacks.",
            "sent3": "The burden of carrying all those books home was a real workout!",
            "sent4": "The burden of responsibility weighed on his shoulders like a ton of bricks.",
            "sent5": "The burden of guilt felt like a boulder on her chest."
        },
        {
            "definition": "Something that is carried or borne.",
            "pos": "noun",
            "sent1": "The backpack was a burden during the long hike.",
            "sent2": "She carried the burden of her mistakes with grace.",
            "sent3": "The burden of her secrets was almost too much to bear.",
            "sent4": "The burden of history is evident in the old artifacts.",
            "sent5": "The burden of tradition weighed heavily on their family."
        },
        {
            "definition": "A source of worry or stress.",
            "pos": "noun",
            "sent1": "The burden of upcoming exams kept her up at night.",
            "sent2": "Financial troubles can be a heavy burden to bear.",
            "sent3": "The burden of planning the party was unexpectedly fun.",
            "sent4": "The burden of uncertainty loomed over their decision.",
            "sent5": "The burden of expectation can be overwhelming at times."
        },
        {
            "definition": "To load heavily.",
            "pos": "verb",
            "sent1": "She would burden herself with too many tasks at once.",
            "sent2": "The workers burdened the truck with boxes of supplies.",
            "sent3": "He would burden his plate with all the delicious food.",
            "sent4": "The storm would burden the trees with heavy snow.",
            "sent5": "The decision to burden himself with debt was regrettable."
        },
        {
            "definition": "To weigh down.",
            "pos": "verb",
            "sent1": "The guilt burdened her heart for years.",
            "sent2": "The sadness burdened his spirit and clouded his mind.",
            "sent3": "She didn't want to burden him with her problems.",
            "sent4": "The responsibility burdened him, but he carried on.",
            "sent5": "The worries burdened her mind like a dark cloud."
        }
    ]
}