{
    "term": "bureau",
    "meanings": [
        {
            "definition": "A chest of drawers or a writing desk",
            "pos": "noun",
            "sent1": "She kept her clothes neatly folded in the bureau.",
            "sent2": "The antique bureau in the living room had intricate carvings.",
            "sent3": "The mischievous cat liked to hide behind the bureau and surprise us.",
            "sent4": "Her mind was a bureau of memories, each drawer holding a different moment.",
            "sent5": "The bureau stood proudly in the corner, a symbol of elegance and organization."
        },
        {
            "definition": "An office or department for transacting particular business",
            "pos": "noun",
            "sent1": "He works in the busy bureau downtown.",
            "sent2": "The immigration bureau handles visa applications.",
            "sent3": "The bureau staff celebrated a successful year with a party.",
            "sent4": "The bureau was a hive of activity, phones ringing and papers flying.",
            "sent5": "In the bureau, decisions were made that shaped the future of the company."
        },
        {
            "definition": "A government department or administrative unit",
            "pos": "noun",
            "sent1": "The environmental protection bureau monitors pollution levels.",
            "sent2": "She applied for a job at the local health bureau.",
            "sent3": "The bureau's strict regulations kept everyone on their toes.",
            "sent4": "In the bureau of education, policies were crafted to improve schools.",
            "sent5": "The bureau of statistics provided valuable data for research projects."
        },
        {
            "definition": "A chest of drawers or a writing desk",
            "pos": "noun",
            "sent1": "The bureau in the study was where he wrote his novels.",
            "sent2": "She found an old photograph hidden in the bureau's drawer.",
            "sent3": "The bureau's legs were slightly uneven, giving it a quirky charm.",
            "sent4": "The secrets of the past were locked away in the bureau's compartments.",
            "sent5": "The bureau's polished surface gleamed in the sunlight, reflecting memories of bygone days."
        }
    ]
}