{
    "term": "burners",
    "meanings": [
        {
            "definition": "A device used for burning fuel or waste.",
            "pos": "noun",
            "sent1": "The burners in the factory help dispose of waste materials.",
            "sent2": "The campsite had a few burners to keep everyone warm.",
            "sent3": "The burners in the incinerator were working overtime today.",
            "sent4": "Her anger was like a set of powerful burners, ready to explode at any moment.",
            "sent5": "The burners roared to life, engulfing the room in warmth."
        },
        {
            "definition": "A person who burns something intentionally.",
            "pos": "noun",
            "sent1": "The burners were responsible for clearing the fields after harvest.",
            "sent2": "The arsonist was known as the town's notorious burner.",
            "sent3": "The clumsy burner accidentally set fire to his own pants.",
            "sent4": "She was a burner of old love letters, erasing the past.",
            "sent5": "The forest ranger caught the illegal burner in the act."
        },
        {
            "definition": "A slang term for a firearm.",
            "pos": "noun",
            "sent1": "The detective found a hidden burner in the suspect's jacket.",
            "sent2": "Gang members often carry burners for protection.",
            "sent3": "The old cowboy always kept his trusty burner by his side.",
            "sent4": "His words were like bullets fired from a verbal burner.",
            "sent5": "The criminal tossed the burner into the river to get rid of evidence."
        },
        {
            "definition": "A slang term for a stove or cooking appliance.",
            "pos": "noun",
            "sent1": "The chef turned on the burners to start cooking the meal.",
            "sent2": "The kitchen was filled with the aroma of food cooking on the burners.",
            "sent3": "The burner in the restaurant kitchen never seemed to cool down.",
            "sent4": "Her passion for cooking was fueled by the powerful burner in her kitchen.",
            "sent5": "The old burner in the cabin gave off a comforting warmth on cold nights."
        }
    ]
}