{
    "term": "burnout",
    "meanings": [
        {
            "definition": "Physical or mental collapse caused by overwork or stress.",
            "pos": "noun",
            "sent1": "After working long hours for weeks, she experienced burnout and needed a break.",
            "sent2": "The doctor advised him to take time off to prevent burnout from affecting his health.",
            "sent3": "When the computer programmer's brain reached burnout, he started making errors in his code.",
            "sent4": "The athlete felt like he was on the brink of burnout, unable to push himself any further.",
            "sent5": "The teacher's burnout was evident in her tired eyes and lack of enthusiasm."
        },
        {
            "definition": "The reduction of a fuel or substance to nothing through combustion.",
            "pos": "noun",
            "sent1": "The burnout of the candle left nothing but a small puddle of wax.",
            "sent2": "The burnout of the firewood produced a warm glow in the fireplace.",
            "sent3": "The burnout of the matchstick was so quick, it surprised the child.",
            "sent4": "The burnout of the rocket's fuel propelled it into the sky with great force.",
            "sent5": "The burnout of the engine caused the car to come to a sudden stop."
        },
        {
            "definition": "The failure of an electrical device or component due to excessive heat.",
            "pos": "noun",
            "sent1": "The technician explained that the burnout of the fuse was the reason for the power outage.",
            "sent2": "The burnout of the light bulb was followed by a brief moment of darkness.",
            "sent3": "The burnout of the toaster made breakfast preparation more challenging.",
            "sent4": "The burnout of the computer's processor led to a complete system shutdown.",
            "sent5": "The burnout of the motor caused the machine to come to a sudden halt."
        }
    ]
}