{
    "term": "burnies",
    "meanings": [
        {
            "definition": "A feeling of warmth or heat, often associated with fire or flames.",
            "pos": "noun",
            "sent1": "The campfire gave off comforting burnies on the chilly night.",
            "sent2": "She felt the burnies of the sun on her face during the summer.",
            "sent3": "The cozy blanket wrapped around her like a hug of burnies.",
            "sent4": "His words ignited a spark of burnies in her heart.",
            "sent5": "The hot chocolate provided a delicious warmth of burnies on the snowy day."
        },
        {
            "definition": "To cause a sensation of burning on the skin.",
            "pos": "verb",
            "sent1": "The spicy chili pepper burnies his tongue.",
            "sent2": "Careful! That hot pan can burnies your hand.",
            "sent3": "The angry chef threatened to burnies the undercooked steak.",
            "sent4": "Her words seemed to burnies his pride more than he expected.",
            "sent5": "The scorching sun can easily burnies unprotected skin."
        },
        {
            "definition": "To be on fire or to be consumed by flames.",
            "pos": "verb",
            "sent1": "The old building began to burnies in the middle of the night.",
            "sent2": "The forest fire continued to burnies out of control.",
            "sent3": "The birthday candles threatened to burnies the cake before she could blow them out.",
            "sent4": "His passion for music seemed to burnies brighter with each performance.",
            "sent5": "The wildfire can burnies through acres of land in just a few hours."
        },
        {
            "definition": "A slang term for cigarettes.",
            "pos": "noun",
            "sent1": "He stepped outside for a quick smoke of burnies.",
            "sent2": "She always carries a pack of burnies in her purse.",
            "sent3": "The detective found a pack of burnies in the suspect's pocket.",
            "sent4": "The smell of burnies lingered in the air after the party.",
            "sent5": "He took a long drag of burnies and exhaled slowly."
        }
    ]
}