{
    "term": "burn",
    "meanings": [
        {
            "definition": "To undergo combustion or be consumed by fire.",
            "pos": "verb",
            "sent1": "The wood will burn in the campfire.",
            "sent2": "The candles burn brightly in the dark room.",
            "sent3": "Don't touch the stove, or you'll burn your hand!",
            "sent4": "Her passion for music burns like a fierce flame.",
            "sent5": "The forest fire burned uncontrollably, destroying everything in its path."
        },
        {
            "definition": "To cause to undergo combustion.",
            "pos": "verb",
            "sent1": "She will burn the old papers in the fireplace.",
            "sent2": "The arsonist intended to burn down the building.",
            "sent3": "The chef accidentally let the cookies burn in the oven.",
            "sent4": "His words burned with anger as he shouted at them.",
            "sent5": "The sun's rays burn the skin if you stay out too long without protection."
        },
        {
            "definition": "To damage or injure by fire or heat.",
            "pos": "verb",
            "sent1": "The hot iron can burn your clothes if left too long.",
            "sent2": "The wildfire can burn down entire forests.",
            "sent3": "She learned the hard way that curling irons can burn hair.",
            "sent4": "The betrayal felt like a burn on his heart.",
            "sent5": "The scalding water can burn your skin if you're not careful."
        },
        {
            "definition": "To feel or suffer from a sensation of heat.",
            "pos": "verb",
            "sent1": "The sunburn makes her skin burn and peel.",
            "sent2": "After running, his lungs burn from the effort.",
            "sent3": "The spicy chili made his mouth burn with heat.",
            "sent4": "Her cheeks burned with embarrassment when she tripped.",
            "sent5": "The intense workout made his muscles burn with fatigue."
        },
        {
            "definition": "To be or become sunburned.",
            "pos": "verb",
            "sent1": "If you stay out too long, you will burn in the sun.",
            "sent2": "She forgot to apply sunscreen and now her shoulders burn.",
            "sent3": "His nose always burns first when he forgets his hat.",
            "sent4": "The fair-skinned child easily burns in the summer heat.",
            "sent5": "The tourists' skin started to burn after hours on the beach."
        }
    ]
}