{
    "term": "burnt",
    "meanings": [
        {
            "definition": "Affected by fire or heat",
            "pos": "adjective",
            "sent1": "The burnt toast smelled smoky.",
            "sent2": "The burnt wood crackled in the fireplace.",
            "sent3": "She tried to cook dinner, but ended up with burnt offerings.",
            "sent4": "The burnt fields stood as a reminder of the wildfire's destruction.",
            "sent5": "The burnt smell lingered in the air long after the fire was extinguished."
        },
        {
            "definition": "Having undergone combustion",
            "pos": "adjective",
            "sent1": "The burnt paper turned to ash.",
            "sent2": "The burnt candle flickered in the dark room.",
            "sent3": "The burnt matchstick had fulfilled its fiery destiny.",
            "sent4": "The burnt out campfire left a ring of charred ground.",
            "sent5": "The burnt edges of the map hinted at a fiery past adventure."
        },
        {
            "definition": "Injured by exposure to heat or fire",
            "pos": "adjective",
            "sent1": "His burnt hand stung from touching the hot pan.",
            "sent2": "The burnt firefighter bravely battled the flames.",
            "sent3": "She learned not to touch the burnt stove the hard way.",
            "sent4": "The burnt skin required soothing aloe vera gel.",
            "sent5": "The burnt fingertips throbbed with pain after the accident."
        },
        {
            "definition": "Damaged or spoiled by heat or fire",
            "pos": "adjective",
            "sent1": "The burnt cookies were too crispy to eat.",
            "sent2": "The burnt house was a sad sight after the fire.",
            "sent3": "The burnt pie was a culinary disaster.",
            "sent4": "The burnt smell in the kitchen signaled trouble.",
            "sent5": "The burnt edges of the painting added a unique touch to the artwork."
        }
    ]
}