{
    "term": "burning",
    "meanings": [
        {
            "definition": "On fire",
            "pos": "adjective",
            "sent1": "The house was burning with flames.",
            "sent2": "The burning candle illuminated the room.",
            "sent3": "The burning marshmallows were a hit at the campfire.",
            "sent4": "Her burning anger could be felt by everyone in the room.",
            "sent5": "The burning sensation on his skin made him realize he was too close to the fire."
        },
        {
            "definition": "Causing a sensation of heat",
            "pos": "adjective",
            "sent1": "The burning sun made everyone seek shade.",
            "sent2": "The burning sand scorched their feet at the beach.",
            "sent3": "The burning spices in the curry made his mouth tingle.",
            "sent4": "Her burning words left a lasting impact on him.",
            "sent5": "The burning sensation of the hot water relaxed her muscles after a long day."
        },
        {
            "definition": "The act of burning something",
            "pos": "noun",
            "sent1": "The burning of the old documents was necessary for security reasons.",
            "sent2": "The forest fire was a result of the uncontrolled burning of dry leaves.",
            "sent3": "The accidental burning of the toast set off the fire alarm.",
            "sent4": "The controlled burning of the fields helped improve the soil quality.",
            "sent5": "The smell of burning wood filled the air during the bonfire."
        },
        {
            "definition": "Very hot or bright",
            "pos": "adjective",
            "sent1": "The burning sun beat down on the hikers.",
            "sent2": "The burning lights of the city could be seen from afar.",
            "sent3": "The burning colors of the sunset painted the sky beautifully.",
            "sent4": "Her burning cheeks revealed her embarrassment.",
            "sent5": "The burning metal was too hot to touch without gloves."
        },
        {
            "definition": "Intense or passionate",
            "pos": "adjective",
            "sent1": "His burning desire to succeed kept him motivated.",
            "sent2": "The burning love in their eyes was evident to everyone.",
            "sent3": "The burning determination in her voice convinced them to join her cause.",
            "sent4": "The burning jealousy in her heart consumed her thoughts.",
            "sent5": "The burning enthusiasm of the crowd was contagious."
        }
    ]
}