{
    "term": "burr",
    "meanings": [
        {
            "definition": "A rough, prickly seed covering",
            "pos": "noun",
            "sent1": "The burr on the chestnut was sharp.",
            "sent2": "I picked off the burr from my sweater.",
            "sent3": "The squirrel got a burr stuck in its fur and looked quite funny.",
            "sent4": "The burr on the cactus served as a protective armor.",
            "sent5": "The burr felt like tiny needles pricking my skin."
        },
        {
            "definition": "A rough, irregular sound",
            "pos": "noun",
            "sent1": "The burr of the engine signaled its age.",
            "sent2": "The burr of the old record player was soothing.",
            "sent3": "The burr of the cat's purring was oddly comforting.",
            "sent4": "The burr of the wind through the trees was like a lullaby.",
            "sent5": "The burr of the bee buzzing nearby made me jump."
        },
        {
            "definition": "A small, rough spot on a surface",
            "pos": "noun",
            "sent1": "The burr on the table annoyed me as I wrote.",
            "sent2": "I sanded down the burr on the wooden chair.",
            "sent3": "The burr on the glass made it look like a diamond.",
            "sent4": "The burr on the rock made it hard to sit comfortably.",
            "sent5": "The burr on the carpet snagged my socks."
        },
        {
            "definition": "To make a rough, low sound",
            "pos": "verb",
            "sent1": "The old door would burr when opened slowly.",
            "sent2": "The wind made the branches burr against the window.",
            "sent3": "The cat would burr contentedly when petted.",
            "sent4": "The car engine began to burr softly after the tune-up.",
            "sent5": "The river burr as it flowed over the rocks."
        },
        {
            "definition": "To remove something by rubbing or scraping",
            "pos": "verb",
            "sent1": "I had to burr off the old paint from the wall.",
            "sent2": "She used a cloth to burr away the dust on the shelf.",
            "sent3": "He tried to burr out the stain on his shirt.",
            "sent4": "The chef had to burr the burnt part of the toast.",
            "sent5": "The gardener needed to burr the weeds from the flower bed."
        }
    ]
}