{
    "term": "bursts",
    "meanings": [
        {
            "definition": "A sudden outbreak of something, such as laughter or applause.",
            "pos": "noun",
            "sent1": "The bursts of laughter filled the room with joy.",
            "sent2": "The audience's bursts of applause showed their appreciation.",
            "sent3": "The bursts of giggles from the children were contagious.",
            "sent4": "Her bursts of excitement were like fireworks in the night sky.",
            "sent5": "The bursts of music from the radio made everyone dance."
        },
        {
            "definition": "A short period of intense activity or effort.",
            "pos": "noun",
            "sent1": "After a few bursts of cleaning, the house looked spotless.",
            "sent2": "During bursts of studying, she focused intently on her work.",
            "sent3": "The bursts of exercise left him feeling energized.",
            "sent4": "In bursts of creativity, she painted masterpiece after masterpiece.",
            "sent5": "The bursts of laughter during the party were unforgettable."
        },
        {
            "definition": "A sudden and violent release of energy or emotion.",
            "pos": "noun",
            "sent1": "The bursts of anger in his voice startled everyone.",
            "sent2": "Her bursts of tears were a sign of deep sadness.",
            "sent3": "The bursts of excitement before the concert were palpable.",
            "sent4": "The bursts of joy in her heart were overwhelming.",
            "sent5": "The bursts of fear gripped her like icy fingers."
        },
        {
            "definition": "To break open or apart suddenly and violently.",
            "pos": "verb",
            "sent1": "The balloon bursts when it touched the sharp edge.",
            "sent2": "She bursts the bubble with a quick poke.",
            "sent3": "He bursts the pinata to reveal the hidden treats.",
            "sent4": "The dam bursts, flooding the valley below.",
            "sent5": "The chef bursts the tomato to release its juices."
        },
        {
            "definition": "To suddenly begin doing something with a lot of energy or enthusiasm.",
            "pos": "verb",
            "sent1": "She bursts into song when she hears her favorite tune.",
            "sent2": "He bursts into laughter at the comedian's joke.",
            "sent3": "The children burst into a game of tag in the park.",
            "sent4": "The team bursts into action as soon as the whistle blows.",
            "sent5": "The flowers burst into bloom after a rainy day."
        }
    ]
}