{
    "term": "bushing",
    "meanings": [
        {
            "definition": "A cylindrical metal or rubber component used to reduce friction or wear between moving parts.",
            "pos": "noun",
            "sent1": "The mechanic replaced the worn-out bushing in the engine to make it run smoothly.",
            "sent2": "Make sure to lubricate the bushing regularly to prevent any damage to the machine.",
            "sent3": "The bushing decided to take a break from reducing friction and went on a vacation.",
            "sent4": "The bushing was like a silent hero, working behind the scenes to keep everything running smoothly.",
            "sent5": "As the bushing turned, it whispered to the parts around it, 'I'll keep you safe and sound.'"
        },
        {
            "definition": "A sleeve or lining used to reduce the size of a hole or provide a bearing surface.",
            "pos": "noun",
            "sent1": "She inserted the bushing into the hole to ensure a snug fit for the bolt.",
            "sent2": "The bushing helped to support the weight of the rotating shaft in the machine.",
            "sent3": "The bushing felt like a cozy sweater for the hole, keeping it warm and snug.",
            "sent4": "The bushing was the perfect match for the hole, fitting in like a missing puzzle piece.",
            "sent5": "With the bushing in place, the hole felt secure and protected, like a fortress."
        },
        {
            "definition": "A type of plant with woody stems that is smaller than a tree.",
            "pos": "noun",
            "sent1": "The bushing in the garden added a touch of greenery without overshadowing the flowers.",
            "sent2": "The tiny bushing near the fence attracted colorful butterflies with its delicate flowers.",
            "sent3": "The bushing chuckled as the tall trees tried to outshine its charm in the garden.",
            "sent4": "The bushing stood proudly, proving that even small plants can make a big impact.",
            "sent5": "Among the towering trees, the bushing stood out like a precious gem in the forest."
        }
    ]
}