{
    "term": "bushrangers",
    "meanings": [
        {
            "definition": "A person who lives in the bush and engages in criminal activities, especially robbery and violence.",
            "pos": "noun",
            "sent1": "The bushrangers terrorized the small town with their robberies.",
            "sent2": "The legend of the bushrangers spread fear throughout the countryside.",
            "sent3": "The bushrangers tried to steal a pie from the picnic, but they were caught by the park ranger.",
            "sent4": "The bushrangers' hideout was like a fortress in the wilderness, hidden from the law.",
            "sent5": "The image of the bushrangers on horseback was etched in the minds of the townspeople."
        },
        {
            "definition": "A group of outlaws or bandits who operate in rural or remote areas.",
            "pos": "noun",
            "sent1": "The bushrangers rode into town, causing chaos and fear among the villagers.",
            "sent2": "The sheriff warned the townsfolk about the dangerous bushrangers lurking in the nearby woods.",
            "sent3": "The bushrangers' campfire stories were more about pranks than actual crimes.",
            "sent4": "The bushrangers' presence in the valley was like a dark cloud hanging over the peaceful landscape.",
            "sent5": "The wanted posters displayed the faces of the notorious bushrangers, offering a reward for their capture."
        },
        {
            "definition": "To act as a bushranger, committing crimes in the wilderness.",
            "pos": "verb",
            "sent1": "The desperate man decided to bushranger his way through the forest to survive.",
            "sent2": "The gang planned to bushranger their way into the abandoned gold mine for treasure.",
            "sent3": "The children pretended to bushranger in the backyard, playing a game of make-believe outlaws.",
            "sent4": "The thief tried to bushranger his escape through the dense woods, hoping to evade capture.",
            "sent5": "The fugitive knew he had to bushranger his way across the rugged terrain to reach safety."
        }
    ]
}