{
    "term": "buss",
    "meanings": [
        {
            "definition": "A kiss",
            "pos": "noun",
            "sent1": "She gave him a quick buss on the cheek.",
            "sent2": "The couple shared a sweet buss under the mistletoe.",
            "sent3": "The puppy surprised everyone by giving a wet buss to the cat.",
            "sent4": "His buss on her forehead felt like a gentle blessing.",
            "sent5": "The buss from her grandmother was filled with love and warmth."
        },
        {
            "definition": "A type of fishing vessel",
            "pos": "noun",
            "sent1": "The buss sailed out to sea early in the morning.",
            "sent2": "The crew worked hard to maintain the buss during the storm.",
            "sent3": "The old buss was known for catching the biggest fish in the bay.",
            "sent4": "The buss glided through the water like a graceful swan.",
            "sent5": "The colorful flags on the buss fluttered in the wind as it returned with a full catch."
        },
        {
            "definition": "To kiss",
            "pos": "verb",
            "sent1": "He leaned in to buss her softly on the lips.",
            "sent2": "In movies, the actors often buss as part of romantic scenes.",
            "sent3": "The friends jokingly dared each other to buss a frog for good luck.",
            "sent4": "The sun seemed to buss the horizon as it dipped below the sea.",
            "sent5": "The gentle breeze bussed the leaves, creating a rustling sound in the trees."
        },
        {
            "definition": "To hit or strike with the head",
            "pos": "verb",
            "sent1": "The ram bussed the gate to break it open.",
            "sent2": "He accidentally bussed his friend while trying to hug him.",
            "sent3": "The toddler tried to buss the ball but missed and fell over.",
            "sent4": "The idea bussed into his mind suddenly, like a light bulb turning on.",
            "sent5": "The boxer's head bussed against his opponent's, causing a loud thud."
        }
    ]
}