{
    "term": "busting",
    "meanings": [
        {
            "definition": "To break or smash something",
            "pos": "verb",
            "sent1": "He was busting the pinata at the party.",
            "sent2": "The kids were busting the watermelon with a hammer.",
            "sent3": "The baseball player was busting the ball into pieces.",
            "sent4": "The storm was so strong that it was busting the windows.",
            "sent5": "The angry man was busting the vase in a fit of rage."
        },
        {
            "definition": "To catch someone in the act of doing something wrong",
            "pos": "verb",
            "sent1": "The police were busting the thieves during the robbery.",
            "sent2": "She was busting her brother sneaking cookies from the jar.",
            "sent3": "The teacher was busting the students passing notes in class.",
            "sent4": "The detective was busting the criminal red-handed.",
            "sent5": "The security guard was busting the shoplifters in the store."
        },
        {
            "definition": "To defeat or overcome someone or something",
            "pos": "verb",
            "sent1": "The hero was busting the villain in the final battle.",
            "sent2": "The team was busting their opponents in the championship game.",
            "sent3": "The underdog was busting the odds and winning the race.",
            "sent4": "The army was busting the enemy forces in the war.",
            "sent5": "The student was busting the difficult exam with determination."
        },
        {
            "definition": "To burst or explode",
            "pos": "verb",
            "sent1": "The balloon was busting with a loud pop.",
            "sent2": "The firecracker was busting in the night sky.",
            "sent3": "The microwave popcorn was busting with a delicious smell.",
            "sent4": "The dam was busting under the pressure of the water.",
            "sent5": "The volcano was busting with molten lava."
        },
        {
            "definition": "To work very hard or put in a lot of effort",
            "pos": "verb",
            "sent1": "She was busting her brain to solve the puzzle.",
            "sent2": "The students were busting their assignments before the deadline.",
            "sent3": "The chef was busting to prepare the perfect dish for the competition.",
            "sent4": "The construction workers were busting to finish the building on time.",
            "sent5": "The athlete was busting to improve his performance for the race."
        }
    ]
}