{
    "term": "bust",
    "meanings": [
        {
            "definition": "A sculpture of a person's head, shoulders, and chest.",
            "pos": "noun",
            "sent1": "The artist created a beautiful bust of the famous writer.",
            "sent2": "The museum displayed a collection of ancient busts of Roman emperors.",
            "sent3": "The bust of the poet seemed to come alive in the moonlight.",
            "sent4": "The marble bust captured the essence of the historical figure.",
            "sent5": "Visitors admired the intricate details of the sculpted bust."
        },
        {
            "definition": "A failure or collapse.",
            "pos": "noun",
            "sent1": "The economic bust led to many job losses in the city.",
            "sent2": "After the company's bust, they had to declare bankruptcy.",
            "sent3": "The party was a bust when the cake fell on the floor.",
            "sent4": "The plan's bust left everyone disappointed and confused.",
            "sent5": "The project's bust was a setback for the team's progress."
        },
        {
            "definition": "To break or smash something.",
            "pos": "verb",
            "sent1": "He accidentally bust the vase while cleaning the shelf.",
            "sent2": "The children were playing and managed to bust the pinata open.",
            "sent3": "She tried to bust the lock with a hairpin but failed.",
            "sent4": "The storm's strong winds could easily bust the windows.",
            "sent5": "The hammer was used to bust the old concrete wall."
        },
        {
            "definition": "To arrest someone.",
            "pos": "verb",
            "sent1": "The police decided to bust the suspect during the night raid.",
            "sent2": "The undercover officers planned to bust the criminal gang.",
            "sent3": "The detectives were ready to bust the notorious thief.",
            "sent4": "The authorities worked together to bust the illegal operation.",
            "sent5": "The officers managed to bust the drug dealers in a successful operation."
        },
        {
            "definition": "A woman's chest area.",
            "pos": "noun",
            "sent1": "She wore a beautiful necklace that accentuated her bust.",
            "sent2": "The dress was designed to flatter her bust and waist.",
            "sent3": "The fashion designer focused on creating elegant bust lines.",
            "sent4": "The magazine cover featured a model with a stunning bust.",
            "sent5": "The tailor adjusted the dress to fit perfectly around the bust."
        }
    ]
}