{
    "term": "butchery",
    "meanings": [
        {
            "definition": "The act of slaughtering animals for food.",
            "pos": "noun",
            "sent1": "The butchery of cows and pigs provides meat for our meals.",
            "sent2": "The local farm specializes in butchery of chickens and turkeys.",
            "sent3": "At the family barbecue, Uncle Joe joked about his 'butchery skills' with the grill.",
            "sent4": "The butchery of innocent animals for profit is a cruel reality.",
            "sent5": "The butchery process ensures that every part of the animal is used efficiently."
        },
        {
            "definition": "The practice of cutting meat into smaller pieces for sale.",
            "pos": "noun",
            "sent1": "In the market, the skilled butcher's butchery of beef attracts many customers.",
            "sent2": "The butchery at the local deli is known for its quality and freshness.",
            "sent3": "The chef's butchery of the steak was so precise that it looked like artwork.",
            "sent4": "The butchery of the large meat slab into steaks was done swiftly.",
            "sent5": "The butchery of the meat into portions made it easier for cooking."
        },
        {
            "definition": "A place where meat is prepared and sold.",
            "pos": "noun",
            "sent1": "The new butchery in town offers a variety of cuts to choose from.",
            "sent2": "Customers enjoy the friendly service at the local butchery.",
            "sent3": "The butchery down the street always has a tempting aroma of fresh meat.",
            "sent4": "The butchery's display of sausages and hams looked appetizing.",
            "sent5": "Visiting the butchery is a sensory experience with all the different meats on display."
        },
        {
            "definition": "The brutal or indiscriminate killing of people.",
            "pos": "noun",
            "sent1": "The dictator's butchery of innocent civilians shocked the world.",
            "sent2": "The war crimes tribunal investigated the butchery of prisoners of war.",
            "sent3": "In the horror movie, the villain's butchery of victims was gruesome.",
            "sent4": "The butchery of the villagers by the invaders left a trail of devastation.",
            "sent5": "The history books recount the butchery committed during the war."
        }
    ]
}