{
    "term": "butohs",
    "meanings": [
        {
            "definition": "Butohs (noun): a form of Japanese dance theater characterized by slow, controlled movements and expressive gestures.",
            "pos": "noun",
            "sent1": "The performers showcased their mastery of butohs with their graceful movements on stage.",
            "sent2": "She studied butohs for years to perfect her dance technique.",
            "sent3": "The butohs dancers moved as if they were underwater, creating a mesmerizing performance.",
            "sent4": "The butohs dancers seemed to embody the essence of nature with their movements.",
            "sent5": "The audience was captivated by the haunting beauty of the butohs performance."
        },
        {
            "definition": "Butohs (verb): to perform in the style of butoh dance.",
            "pos": "verb",
            "sent1": "They decided to butohs at the cultural festival to showcase their unique talent.",
            "sent2": "She loves to butohs with her friends whenever they have a dance party.",
            "sent3": "He tried to butohs in the park, but his movements were more comical than graceful.",
            "sent4": "Her dance moves butohs through the air like a gentle breeze.",
            "sent5": "The dancers butohs across the stage with precision and emotion."
        },
        {
            "definition": "Butohs (adjective): relating to or characteristic of butoh dance.",
            "pos": "adjective",
            "sent1": "The butohs performance left a lasting impression on the audience.",
            "sent2": "She wore a stunning butohs costume for the dance recital.",
            "sent3": "The butohs music played softly in the background, setting the mood for the performance.",
            "sent4": "His movements were so butohs, they seemed to transcend the physical realm.",
            "sent5": "The butohs style of dance is known for its unique blend of tradition and innovation."
        }
    ]
}