{
    "term": "buttons",
    "meanings": [
        {
            "definition": "A small disc or knob sewn onto a garment for fastening or decoration.",
            "pos": "noun",
            "sent1": "She sewed colorful buttons onto her dress.",
            "sent2": "The coat had shiny buttons that matched the fabric.",
            "sent3": "The clown's outfit was covered in oversized buttons.",
            "sent4": "Her smile was like a bright button on a dark coat.",
            "sent5": "The buttons on the shirt were like tiny jewels."
        },
        {
            "definition": "A small, usually circular object used to operate a machine or electronic device.",
            "pos": "noun",
            "sent1": "He pressed the buttons on the remote control to change the channel.",
            "sent2": "The calculator had colorful buttons for each number.",
            "sent3": "The robot's buttons were so big, it looked like a toy.",
            "sent4": "The buttons on the microwave beeped like tiny birds.",
            "sent5": "The elevator buttons lit up like stars in the dark."
        },
        {
            "definition": "To fasten with buttons.",
            "pos": "verb",
            "sent1": "She carefully buttons her coat before going outside.",
            "sent2": "He buttons his shirt all the way to the top.",
            "sent3": "The magician tried to button his hat onto a rabbit.",
            "sent4": "His words buttoned up her heart, keeping it safe.",
            "sent5": "The flowers buttoned up the garden, closing it off from view."
        },
        {
            "definition": "To close or fasten with buttons.",
            "pos": "verb",
            "sent1": "She buttons her bag to keep her belongings safe.",
            "sent2": "He buttons his jacket against the cold wind.",
            "sent3": "The chef tried to button the lid onto the pot.",
            "sent4": "The music buttoned up the room, filling it with joy.",
            "sent5": "The night buttoned up the sky, covering it with stars."
        }
    ]
}