{
    "term": "button",
    "meanings": [
        {
            "definition": "A small disk or knob sewn onto a garment for fastening or decoration.",
            "pos": "noun",
            "sent1": "She sewed a shiny button onto her dress.",
            "sent2": "The blue shirt had buttons down the front.",
            "sent3": "Why did the button refuse to hold the fabric together? It was feeling a bit buttoned-up.",
            "sent4": "Her smile was like a bright button on a dark coat, bringing joy to everyone around.",
            "sent5": "The button sparkled like a tiny star on her jacket."
        },
        {
            "definition": "A small, usually circular object used to operate a machine or electronic device.",
            "pos": "noun",
            "sent1": "Press the button to turn on the light.",
            "sent2": "The remote control has buttons for different functions.",
            "sent3": "Why did the button go to school? To become a smart button!",
            "sent4": "His words were like pushing a button, instantly igniting her anger.",
            "sent5": "The red button glowed in the dark, tempting him to press it."
        },
        {
            "definition": "To fasten with a button.",
            "pos": "verb",
            "sent1": "She will button her coat before going outside.",
            "sent2": "He buttoned up his shirt neatly.",
            "sent3": "Why did the coat refuse to button up? It was feeling a bit rebellious.",
            "sent4": "His words seemed to button up her heart, keeping her emotions hidden.",
            "sent5": "The sun began to set, signaling the time to button up for the night."
        },
        {
            "definition": "To be capable of being fastened by a button.",
            "pos": "verb",
            "sent1": "The dress buttons easily at the back.",
            "sent2": "The fabric buttons without any trouble.",
            "sent3": "Why did the shirt enjoy being buttoned? It felt secure and snug.",
            "sent4": "Her heart seemed to button to his, forming an unbreakable bond.",
            "sent5": "The friendship between them was like two pieces of a puzzle that buttoned perfectly together."
        }
    ]
}