{
    "term": "butterflyers",
    "meanings": [
        {
            "definition": "A person who flutters or moves in a light and graceful manner.",
            "pos": "noun",
            "sent1": "The little girl in the park was a butterflyer, dancing around with joy.",
            "sent2": "The butterflyers at the ballet performance moved elegantly across the stage.",
            "sent3": "The butterflyer in the garden charmed the flowers with her delicate steps.",
            "sent4": "She floated through the room like a butterflyer, bringing a sense of grace to all.",
            "sent5": "The butterflyer's movements were as light as a feather, captivating everyone's attention."
        },
        {
            "definition": "A group of butterflies flying together.",
            "pos": "noun",
            "sent1": "In the meadow, a beautiful sight awaited us - a cloud of butterflyers fluttering around.",
            "sent2": "The butterflyers painted the sky with their colorful wings as they flew in harmony.",
            "sent3": "The butterflyers seemed to be having a party in the air, celebrating their freedom.",
            "sent4": "The field was filled with fluttering butterflyers, creating a magical scene.",
            "sent5": "The garden was alive with the fluttering of countless butterflyers, a true spectacle of nature."
        },
        {
            "definition": "To flutter or move in a light and graceful manner.",
            "pos": "verb",
            "sent1": "The leaves on the tree butterflyed in the gentle breeze, swaying back and forth.",
            "sent2": "Her dress butterflyed around her as she twirled in the sunlight.",
            "sent3": "The colorful kites butterflyed in the sky, dancing with the wind.",
            "sent4": "The curtains butterflyed in the open window, creating a soft rustling sound.",
            "sent5": "The butterflies butterflyed from flower to flower, spreading beauty wherever they went."
        }
    ]
}