{
    "term": "butylene",
    "meanings": [
        {
            "definition": "A colorless gas used in the production of plastics and synthetic rubber.",
            "pos": "noun",
            "sent1": "The factory released butylene into the air during the manufacturing process.",
            "sent2": "The butylene was essential for creating the new type of plastic.",
            "sent3": "The butylene gas decided to take a break from being a key ingredient in plastic production.",
            "sent4": "The butylene floated through the air like a ghost haunting the factory.",
            "sent5": "The smell of butylene lingered in the factory, a reminder of its role in plastic making."
        },
        {
            "definition": "A chemical compound with the formula C4H8.",
            "pos": "noun",
            "sent1": "The scientist studied the structure of butylene under the microscope.",
            "sent2": "Butylene is a compound that consists of specific elements in a precise arrangement.",
            "sent3": "The butylene molecule threw a party with carbon and hydrogen atoms.",
            "sent4": "In the world of chemistry, butylene stood out like a shining star.",
            "sent5": "The formula C4H8 represented the unique identity of butylene."
        },
        {
            "definition": "A hydrocarbon with four carbon atoms and eight hydrogen atoms.",
            "pos": "noun",
            "sent1": "The students learned about butylene's structure in their science class.",
            "sent2": "Butylene is a hydrocarbon that contains a specific number of carbon and hydrogen atoms.",
            "sent3": "The butylene molecule went on a quest to find more carbon and hydrogen friends.",
            "sent4": "Butylene, with its four carbon and eight hydrogen companions, traveled through the chemical world.",
            "sent5": "The hydrocarbon butylene was like a tiny universe of carbon and hydrogen."
        }
    ]
}