{
    "term": "buzzers",
    "meanings": [
        {
            "definition": "A device that makes a buzzing sound",
            "pos": "noun",
            "sent1": "The buzzers in the classroom signaled the end of the test.",
            "sent2": "I could hear the buzzers of the alarm system going off in the building.",
            "sent3": "The buzzers in the game show were so loud that they made everyone jump.",
            "sent4": "The buzzers of the doorbell sounded like angry bees waiting outside.",
            "sent5": "The buzzers on the old microwave were so loud, they could wake up the whole house."
        },
        {
            "definition": "A person or thing that buzzes",
            "pos": "noun",
            "sent1": "The bee was a tiny buzzer flying around the flowers.",
            "sent2": "The mosquito was a persistent buzzer in the room, bothering everyone.",
            "sent3": "The little buzzer of a fly kept landing on my food, making me shoo it away.",
            "sent4": "The buzzer of a hummingbird was a delightful sound in the garden.",
            "sent5": "The buzzer of the bee was a gentle hum in the peaceful meadow."
        },
        {
            "definition": "A slang term for a telephone",
            "pos": "noun",
            "sent1": "She picked up the buzzer to call her friend and chat for hours.",
            "sent2": "The old rotary buzzer on the desk rang loudly, startling her.",
            "sent3": "He joked that the buzzer was his best friend, always ready to connect him with others.",
            "sent4": "The buzzer on the wall was like a lifeline, allowing her to reach out to loved ones.",
            "sent5": "The buzzer in her hand was her link to the outside world, bringing news and conversations."
        },
        {
            "definition": "A slang term for an alarm or warning signal",
            "pos": "noun",
            "sent1": "The buzzer on the smoke detector alerted us to the fire in the kitchen.",
            "sent2": "The buzzer on the car's security system went off, scaring away the thief.",
            "sent3": "The buzzer on the weather alert system warned of an incoming storm.",
            "sent4": "The buzzer on the countdown clock signaled the start of the race.",
            "sent5": "The buzzer on the emergency exit door sounded, signaling the need to evacuate."
        }
    ]
}