{
    "term": "buzzing",
    "meanings": [
        {
            "definition": "Make a low, continuous humming sound.",
            "pos": "verb",
            "sent1": "The bees were buzzing around the flowers.",
            "sent2": "The old refrigerator was buzzing loudly in the kitchen.",
            "sent3": "The classroom was buzzing with the sound of students chatting.",
            "sent4": "The city was buzzing with life and activity even late into the night.",
            "sent5": "The summer air was buzzing with the sound of cicadas in the trees."
        },
        {
            "definition": "A feeling of excitement or energy.",
            "pos": "noun",
            "sent1": "The children were buzzing with anticipation before the birthday party.",
            "sent2": "The stadium was buzzing with cheers as the home team scored a goal.",
            "sent3": "The office was buzzing with excitement about the upcoming team-building event.",
            "sent4": "Her heart was buzzing with joy when she received the good news.",
            "sent5": "The atmosphere was buzzing with energy during the music concert."
        },
        {
            "definition": "A phone call or message.",
            "pos": "noun",
            "sent1": "She received a buzzing from her friend about the movie night.",
            "sent2": "I missed the buzzing from my mom while I was in a meeting.",
            "sent3": "The buzzing from her boss made her nervous about the upcoming presentation.",
            "sent4": "The buzzing from the group chat kept her updated on the weekend plans.",
            "sent5": "The buzzing from the voicemail indicated an important message waiting for her."
        },
        {
            "definition": "A state of being busy or active.",
            "pos": "noun",
            "sent1": "The office was buzzing with employees preparing for the big meeting.",
            "sent2": "The kitchen was buzzing with activity as they prepared dinner for the guests.",
            "sent3": "The park was buzzing with families enjoying the sunny weekend.",
            "sent4": "The city center was buzzing with shoppers during the holiday season.",
            "sent5": "The school was buzzing with students rushing to finish their assignments before the bell rang."
        }
    ]
}