{
    "term": "buzz",
    "meanings": [
        {
            "definition": "A low, continuous humming or murmuring sound",
            "pos": "noun",
            "sent1": "The buzz of the bees filled the garden with a soothing sound.",
            "sent2": "I heard a buzz coming from the old refrigerator.",
            "sent3": "The classroom was so quiet that even a tiny buzz from a fly could be heard.",
            "sent4": "The buzz of the distant traffic reminded me of the city's constant movement.",
            "sent5": "The buzz of the fan overhead helped me relax and fall asleep."
        },
        {
            "definition": "A feeling of excitement or energy",
            "pos": "noun",
            "sent1": "The buzz of anticipation before the concert was palpable.",
            "sent2": "There was a buzz in the air as the team prepared for the championship game.",
            "sent3": "The buzz of the crowd at the game made me even more excited to be there.",
            "sent4": "The buzz of energy in the room was contagious, and I couldn't help but join in.",
            "sent5": "The buzz of excitement in the room was electric, making everyone smile."
        },
        {
            "definition": "To make a low, continuous humming sound",
            "pos": "verb",
            "sent1": "The bees buzzed around the flowers in the garden.",
            "sent2": "I could hear the old refrigerator buzzing in the kitchen.",
            "sent3": "The old car would always buzz loudly when starting up.",
            "sent4": "The phone continued to buzz with notifications throughout the day.",
            "sent5": "The cicadas buzzed in the trees, creating a peaceful atmosphere."
        },
        {
            "definition": "To move quickly and busily",
            "pos": "verb",
            "sent1": "The bees buzzed from flower to flower in the garden.",
            "sent2": "I saw the busy worker bees buzzing around the hive.",
            "sent3": "The children would buzz around the playground during recess.",
            "sent4": "The delivery trucks would buzz in and out of the warehouse all day.",
            "sent5": "The students would buzz around the classroom, eager to start the experiment."
        },
        {
            "definition": "To talk excitedly or gossip",
            "pos": "verb",
            "sent1": "The group of friends would buzz about the latest gossip in town.",
            "sent2": "I overheard my coworkers buzzing about the upcoming office party.",
            "sent3": "The neighbors would buzz about the new family moving in next door.",
            "sent4": "The students would buzz with excitement about the upcoming field trip.",
            "sent5": "The fans would buzz with anticipation before the start of the concert."
        },
        {
            "definition": "To be filled with a buzzing sound",
            "pos": "verb",
            "sent1": "The room buzzed with the sound of conversation during the party.",
            "sent2": "The garden buzzed with the sound of bees collecting nectar.",
            "sent3": "The stadium would buzz with excitement during the final moments of the game.",
            "sent4": "The city streets would buzz with activity during rush hour.",
            "sent5": "The forest would buzz with life as the sun began to rise."
        }
    ]
}