{
    "term": "buzzes",
    "meanings": [
        {
            "definition": "A low, continuous humming or murmuring sound",
            "pos": "noun",
            "sent1": "The buzzes of the bees filled the garden with a soothing melody.",
            "sent2": "The distant buzzes of the cars on the highway could be heard in the quiet night.",
            "sent3": "The buzzes of the refrigerator seemed to lull the cat into a peaceful nap.",
            "sent4": "The buzzes of the city at night wrapped around her like a comforting blanket.",
            "sent5": "The buzzes of the cicadas in the summer heat created a symphony of nature."
        },
        {
            "definition": "A feeling of excitement or energy",
            "pos": "noun",
            "sent1": "She felt the buzzes of anticipation before opening her birthday present.",
            "sent2": "The buzzes of excitement in the crowd grew louder as the concert began.",
            "sent3": "The buzzes of energy in the room were contagious, making everyone smile.",
            "sent4": "The buzzes of excitement in her heart were like fireworks on a dark night.",
            "sent5": "The buzzes of joy and energy filled the air, making everything seem brighter."
        },
        {
            "definition": "To make a low, continuous humming sound",
            "pos": "verb",
            "sent1": "The bees buzzes around the flowers in the garden.",
            "sent2": "The fan buzzes softly in the background, creating a relaxing atmosphere.",
            "sent3": "The old radio buzzes with static before finally tuning in to a clear station.",
            "sent4": "The wind buzzes through the trees, creating a peaceful melody.",
            "sent5": "The phone buzzes on the table, signaling a new message."
        },
        {
            "definition": "To move quickly and busily",
            "pos": "verb",
            "sent1": "The bees buzzes from flower to flower, collecting nectar.",
            "sent2": "The children buzzes around the playground, full of energy.",
            "sent3": "The workers buzzes around the office, preparing for the big meeting.",
            "sent4": "The busy streets buzzes with people rushing to their destinations.",
            "sent5": "The bees buzzes in and out of the hive, each with a specific task."
        },
        {
            "definition": "To talk excitedly or gossip",
            "pos": "verb",
            "sent1": "She buzzes with her friends about the latest gossip in school.",
            "sent2": "The neighbors buzzes about the new family that moved in next door.",
            "sent3": "The group buzzes with excitement as they plan their upcoming trip.",
            "sent4": "The office buzzes with rumors about the upcoming changes in management.",
            "sent5": "The students buzzes with anticipation before the start of the school play."
        }
    ]
}