{
    "term": "bye",
    "meanings": [
        {
            "definition": "A secondary matter or consideration",
            "pos": "noun",
            "sent1": "The color of the car was just a bye, the important thing was its safety features.",
            "sent2": "In the project, the deadline was the main focus, with budget being just a bye.",
            "sent3": "When choosing a pet, the color of its fur was a bye compared to its temperament.",
            "sent4": "In the story, the characters' emotions were the main focus, with their appearance just a bye.",
            "sent5": "During the debate, the candidate's policies were crucial, while their clothing choices were just a bye."
        },
        {
            "definition": "A pass or free round in a tournament",
            "pos": "noun",
            "sent1": "The player received a bye in the first round of the tournament, advancing to the next stage.",
            "sent2": "Due to his excellent performance, he earned a bye to the semi-finals.",
            "sent3": "Getting a bye in the competition felt like winning a small victory without even playing.",
            "sent4": "Receiving a bye was like a lucky break, giving him a chance to rest before the next match.",
            "sent5": "The bye allowed him to skip a round and proceed further in the tournament."
        },
        {
            "definition": "A farewell or goodbye",
            "pos": "noun",
            "sent1": "Saying bye to her friends at the airport was emotional.",
            "sent2": "He waved bye to his family as he boarded the train.",
            "sent3": "The puppy's sad eyes bid bye to its owner as they left for work.",
            "sent4": "The sunset painted the sky in hues of orange, signaling nature's bye to the day.",
            "sent5": "The gentle breeze whispered bye as it rustled through the leaves."
        },
        {
            "definition": "A run scored in cricket without the ball hitting the bat",
            "pos": "noun",
            "sent1": "The team celebrated the bye that helped them inch closer to victory.",
            "sent2": "The batsman was surprised by the unexpected bye that added to their score.",
            "sent3": "The fielding team groaned as the batsman gained a bye due to their mistake.",
            "sent4": "The bye turned the match around, giving the batting team a chance to catch up.",
            "sent5": "The crowd cheered as the batsman sprinted between the wickets to secure a crucial bye."
        }
    ]
}