{
    "term": "byes",
    "meanings": [
        {
            "definition": "A situation in which a competitor or team advances to the next round of a competition without playing a game.",
            "pos": "noun",
            "sent1": "The team received byes and moved to the next round effortlessly.",
            "sent2": "The tennis player got two byes in a row, making it to the finals without breaking a sweat.",
            "sent3": "The byes were like magic tickets, granting instant passage to victory.",
            "sent4": "Byes acted as invisible wings, propelling the team forward in the tournament.",
            "sent5": "The byes were like secret shortcuts, bypassing all the challenges in the competition."
        },
        {
            "definition": "A free pass given to a batter in baseball after four balls have been thrown.",
            "pos": "noun",
            "sent1": "The batter happily accepted the byes and took his base without swinging.",
            "sent2": "After the pitcher's wild throws, the batter was awarded byes and advanced to first base.",
            "sent3": "The byes in baseball felt like unexpected gifts from the pitcher.",
            "sent4": "The byes were like golden tickets to the batter, granting him a free pass to the base.",
            "sent5": "The byes in baseball were like safety nets, saving the batter from striking out."
        },
        {
            "definition": "A secondary or extra item included with a purchase.",
            "pos": "noun",
            "sent1": "The toy car was a fun byes that came with the happy meal.",
            "sent2": "The byes of a free keychain made the purchase even more exciting for the customer.",
            "sent3": "The byes of a bonus sticker added a touch of surprise to the package.",
            "sent4": "The byes were like little treasures hidden within the main purchase.",
            "sent5": "The byes were like unexpected gifts, making the shopping experience delightful."
        }
    ]
}