{
    "term": "cab",
    "meanings": [
        {
            "definition": "A taxi",
            "pos": "noun",
            "sent1": "I hailed a cab to take me to the airport.",
            "sent2": "The cab driver knew all the shortcuts in the city.",
            "sent3": "The cab driver told a joke that made me laugh all the way to my destination.",
            "sent4": "In the bustling city, the yellow cab stood out like a beacon of hope.",
            "sent5": "The neon sign on the cab glowed brightly in the night, beckoning passengers."
        },
        {
            "definition": "The compartment of a truck where the driver sits",
            "pos": "noun",
            "sent1": "The cab of the truck was spacious and comfortable.",
            "sent2": "The driver adjusted the mirrors before starting the engine in the cab.",
            "sent3": "The cab of the truck felt like a cozy little office on wheels.",
            "sent4": "From the cab, the driver had a clear view of the road ahead.",
            "sent5": "The radio in the cab played upbeat music as the truck rumbled along."
        },
        {
            "definition": "A horse-drawn vehicle for hire",
            "pos": "noun",
            "sent1": "The cab driver guided the horse-drawn cab through the busy streets.",
            "sent2": "People waved from the sidewalks as the cab passed by.",
            "sent3": "The horse pulling the cab seemed to enjoy the attention from passersby.",
            "sent4": "The sound of hooves on the cobblestone announced the arrival of the cab.",
            "sent5": "The cab driver skillfully maneuvered the horse-drawn cab through the narrow alleyways."
        },
        {
            "definition": "A small room or compartment on a ship",
            "pos": "noun",
            "sent1": "The captain's quarters were located near the cab of the ship.",
            "sent2": "The crew gathered in the cab for their daily briefing.",
            "sent3": "During the storm, the rocking motion made the cab feel like a cozy nest.",
            "sent4": "The captain emerged from the cab with a map in hand, ready to navigate.",
            "sent5": "The wooden door to the cab creaked open as the first mate entered."
        },
        {
            "definition": "A unit of measurement for volume of wood",
            "pos": "noun",
            "sent1": "The lumberjack measured the woodpile in cords and cabs.",
            "sent2": "Each cab of wood was neatly stacked in the storage shed.",
            "sent3": "The cab of firewood was just enough to keep the fireplace burning all night.",
            "sent4": "The carpenter estimated the project would require several cabs of timber.",
            "sent5": "The delivery truck was loaded with cabs of wood for the construction site."
        }
    ]
}