{
    "term": "cabotage",
    "meanings": [
        {
            "definition": "The transport of goods or passengers between two points in the same country by a vessel or aircraft registered in another country.",
            "pos": "noun",
            "sent1": "Cabotage allows foreign ships or planes to carry passengers within a country.",
            "sent2": "The cabotage rules restrict which vessels can transport goods domestically.",
            "sent3": "The cabotage regulations made for some interesting discussions at the shipping conference.",
            "sent4": "Her understanding of cabotage was as clear as the blue sky above.",
            "sent5": "The concept of cabotage was etched in his mind like a permanent marker on a whiteboard."
        },
        {
            "definition": "The exclusive right of a country to control the air traffic within its own borders.",
            "pos": "noun",
            "sent1": "Cabotage ensures that only local airlines can operate within a country's airspace.",
            "sent2": "The government's cabotage policy aimed to protect its aviation industry.",
            "sent3": "The cabotage privilege was like having a VIP pass for air traffic control.",
            "sent4": "In the world of aviation, cabotage was the king of regulations.",
            "sent5": "The importance of cabotage was as vital as oxygen for a country's aviation sovereignty."
        },
        {
            "definition": "The practice of a foreign airline transporting passengers between two cities within a country.",
            "pos": "noun",
            "sent1": "Cabotage allows international airlines to carry passengers on domestic routes.",
            "sent2": "The cabotage agreement opened up new travel opportunities for passengers.",
            "sent3": "The foreign airline's cabotage service made the local carriers step up their game.",
            "sent4": "The idea of cabotage in aviation was like a bridge connecting different countries.",
            "sent5": "The impact of cabotage on air travel was as significant as a jet engine in flight."
        }
    ]
}