{
    "term": "cabrestos",
    "meanings": [
        {
            "definition": "A type of Spanish bullfighting maneuver where the bull is controlled by a rope attached to its horns.",
            "pos": "noun",
            "sent1": "During the cabrestos, the bullfighter skillfully guides the bull with the rope.",
            "sent2": "The cabrestos is a traditional technique used in Spanish bullfighting.",
            "sent3": "The bull, confused by the cabrestos, tried to shake off the rope in a playful manner.",
            "sent4": "In the heat of the bullfight, the cabrestos became a dance of control and agility.",
            "sent5": "The audience gasped as the matador executed the cabrestos with precision and grace."
        },
        {
            "definition": "A type of knot used to control a horse or bull.",
            "pos": "noun",
            "sent1": "The cowboy quickly tied a cabrestos to rein in the wild horse.",
            "sent2": "The cabrestos knot is known for its strength and reliability.",
            "sent3": "Trying to untangle the cabrestos knot, the rancher ended up in a comical situation.",
            "sent4": "With a swift movement, the cowboy secured the cabrestos around the horse's neck.",
            "sent5": "The cabrestos knot held firm, preventing the bull from breaking free."
        },
        {
            "definition": "A term used in Portuguese to refer to a rebellious or stubborn person.",
            "pos": "noun",
            "sent1": "Pedro was known as a cabrestos among his friends for always going against the rules.",
            "sent2": "In Portuguese culture, being called a cabrestos is not taken lightly.",
            "sent3": "Despite his stubbornness, Maria found Pedro's cabrestos attitude endearing.",
            "sent4": "Her determination was like that of a cabrestos, refusing to yield to anyone's demands.",
            "sent5": "The cabrestos in the group always led to interesting debates and decisions."
        }
    ]
}