{
    "term": "cachexias",
    "meanings": [
        {
            "definition": "A general physical wasting and malnutrition usually associated with chronic disease",
            "pos": "noun",
            "sent1": "The patient's cachexias were evident from his extreme weight loss and weakness.",
            "sent2": "The doctor diagnosed the cachexias based on the patient's severe malnutrition.",
            "sent3": "Despite his cachexias, the patient tried to maintain a positive attitude.",
            "sent4": "The cachexias of the land were visible in the barren fields and wilted crops.",
            "sent5": "The image of cachexias in the mirror shocked the patient into seeking medical help."
        },
        {
            "definition": "A condition of ill health, malnutrition, and wasting",
            "pos": "noun",
            "sent1": "Her cachexias made it difficult for her to perform daily tasks.",
            "sent2": "The homeless man's cachexias were a result of prolonged hunger and poor living conditions.",
            "sent3": "The cachexias of the neglected garden were a sad sight to behold.",
            "sent4": "The company's financial cachexias were evident in its declining profits and layoffs.",
            "sent5": "The cachexias of the old building were visible in its crumbling walls and sagging roof."
        },
        {
            "definition": "A state of physical decline and weakness",
            "pos": "noun",
            "sent1": "The athlete's cachexias were a stark contrast to his previous strength and agility.",
            "sent2": "The elderly woman's cachexias made it hard for her to walk without assistance.",
            "sent3": "The cachexias of the once vibrant city were a result of neglect and mismanagement.",
            "sent4": "The tree showed signs of cachexias with its drooping branches and withered leaves.",
            "sent5": "The cachexias of the economy were felt by all, leading to job losses and inflation."
        }
    ]
}