{
    "term": "cadasters",
    "meanings": [
        {
            "definition": "A public record, survey, or map of the value, extent, and ownership of land for taxation.",
            "pos": "noun",
            "sent1": "The cadasters showed the exact size of each piece of land in the village.",
            "sent2": "The government used the cadasters to determine property taxes for the residents.",
            "sent3": "The cadasters were so detailed that they even included the number of trees on each property.",
            "sent4": "She studied the cadasters like a treasure map, searching for hidden gems of information.",
            "sent5": "The cadasters were like a puzzle, fitting together to reveal the entire landscape."
        },
        {
            "definition": "A register of such records.",
            "pos": "noun",
            "sent1": "The cadasters were neatly organized in the town hall for easy access.",
            "sent2": "Every year, the town updated the cadasters with new property information.",
            "sent3": "The cadasters were so important that they were kept under lock and key.",
            "sent4": "The cadasters served as a historical archive of land ownership in the region.",
            "sent5": "The cadasters were like a library of land records, preserving the past for the future."
        },
        {
            "definition": "To survey and record the boundaries of land for taxation purposes.",
            "pos": "verb",
            "sent1": "The surveyor cadasters the land to create accurate property maps.",
            "sent2": "They cadasters the fields to ensure fair taxation for all farmers.",
            "sent3": "He cadasters the land with precision, leaving no boundary unmarked.",
            "sent4": "Cadastering the area was a meticulous task that required attention to detail.",
            "sent5": "She cadasters the land as if painting a picture, capturing every border and corner."
        }
    ]
}