{
    "term": "cahier",
    "meanings": [
        {
            "definition": "A notebook or journal for writing notes or keeping records.",
            "pos": "noun",
            "sent1": "I always carry my cahier to jot down important information.",
            "sent2": "She opened her cahier to a blank page and started writing.",
            "sent3": "The cahier seemed to have a mind of its own, filling up with notes faster than she could write.",
            "sent4": "Her cahier was a treasure trove of memories, each page holding a piece of her life.",
            "sent5": "The cahier was like a loyal friend, always there to listen to her thoughts and secrets."
        },
        {
            "definition": "A booklet or pamphlet containing information or exercises.",
            "pos": "noun",
            "sent1": "The teacher handed out a cahier to each student for the upcoming assignment.",
            "sent2": "He flipped through the cahier, scanning the exercises to be completed.",
            "sent3": "The cahier was so full of facts, it felt like a mini library in his hands.",
            "sent4": "Her cahier was a map to success, guiding her through each lesson with precision.",
            "sent5": "The colorful cahier was a beacon of knowledge, drawing students in with its vibrant pages."
        },
        {
            "definition": "A collection of sheets of paper folded together and sewn or stapled along one edge.",
            "pos": "noun",
            "sent1": "She carefully bound the loose papers into a cahier to keep them organized.",
            "sent2": "The cahier lay flat on the table, its pages neatly aligned.",
            "sent3": "The mischievous wind picked up the cahier and scattered its pages like confetti.",
            "sent4": "His thoughts were like loose pages until he compiled them into a cahier of ideas.",
            "sent5": "The cahier was a bridge between chaos and order, holding together the scattered pieces of his work."
        }
    ]
}