{
    "term": "caisson",
    "meanings": [
        {
            "definition": "A watertight structure used in construction work underwater or as a foundation.",
            "pos": "noun",
            "sent1": "The workers carefully lowered the caisson into the river to build the bridge foundation.",
            "sent2": "The caisson was essential for the underwater construction project.",
            "sent3": "The caisson decided to take a swim in the river and ended up becoming a foundation for a new building.",
            "sent4": "The caisson stood strong underwater, like a fortress protecting the construction site.",
            "sent5": "The caisson, a sturdy underwater box, kept the workers dry and safe during the construction."
        },
        {
            "definition": "A two-wheeled vehicle for carrying ammunition.",
            "pos": "noun",
            "sent1": "The soldiers loaded the caisson with ammunition for the upcoming battle.",
            "sent2": "The caisson rattled along the bumpy road, carrying vital supplies.",
            "sent3": "The caisson accidentally rolled down the hill, spilling ammunition everywhere.",
            "sent4": "The caisson moved swiftly like a silent messenger delivering its precious cargo.",
            "sent5": "The caisson, a trusty carrier, transported ammunition to the frontline with precision."
        },
        {
            "definition": "A floating gate used in the construction of locks.",
            "pos": "noun",
            "sent1": "The caisson helped control the water levels in the lock system.",
            "sent2": "The caisson floated gracefully as it guided boats through the lock.",
            "sent3": "The mischievous caisson played hide and seek with passing boats in the lock.",
            "sent4": "The caisson, like a guardian angel, protected the boats as they passed through the lock.",
            "sent5": "The caisson, a gentle giant, ensured smooth passage for boats in the lock."
        }
    ]
}