{
    "term": "cal",
    "meanings": [
        {
            "definition": "A unit of measurement for heat energy.",
            "pos": "noun",
            "sent1": "I measured the heat energy in the room using a cal.",
            "sent2": "The scientist used a cal to determine the amount of heat produced.",
            "sent3": "The cal sat on the shelf, waiting to be used in the experiment.",
            "sent4": "The cal was like a tiny detective, uncovering the secrets of the heat energy.",
            "sent5": "The cal glowed brightly, revealing the intensity of the heat energy."
        },
        {
            "definition": "To calculate or estimate.",
            "pos": "verb",
            "sent1": "She needed to cal the total cost before making a decision.",
            "sent2": "I always cal how much time it will take to finish my homework.",
            "sent3": "He tried to cal the number of jellybeans in the jar but kept getting it wrong.",
            "sent4": "Her mind began to cal the possibilities, trying to find the best solution.",
            "sent5": "The students were asked to cal the distance between two points on the map."
        },
        {
            "definition": "A call or summons.",
            "pos": "noun",
            "sent1": "The cal for help echoed through the forest.",
            "sent2": "She heard the cal for volunteers to assist with the event.",
            "sent3": "The cal from the other room made her jump in surprise.",
            "sent4": "The cal from the mountain seemed to reach every corner of the valley.",
            "sent5": "The cal from the lifeguard alerted everyone to the swimmer in trouble."
        },
        {
            "definition": "A type of fish.",
            "pos": "noun",
            "sent1": "The cal swam gracefully in the clear water.",
            "sent2": "We saw a school of colorful cal while snorkeling.",
            "sent3": "The cal in the aquarium seemed to be watching the visitors.",
            "sent4": "The cal moved with such agility, it was mesmerizing to watch.",
            "sent5": "The cal's scales shimmered in the sunlight, creating a beautiful sight."
        },
        {
            "definition": "A type of tree.",
            "pos": "noun",
            "sent1": "The cal provided shade for the picnic area.",
            "sent2": "The leaves of the cal rustled in the gentle breeze.",
            "sent3": "The cal stood tall and proud in the middle of the forest.",
            "sent4": "The branches of the cal reached out like welcoming arms.",
            "sent5": "The cal's trunk was sturdy and strong, a symbol of resilience."
        }
    ]
}