{
    "term": "calcifuge",
    "meanings": [
        {
            "definition": "A plant that thrives in acidic soil and is intolerant of lime.",
            "pos": "noun",
            "sent1": "The calcifuge in my garden looks vibrant and healthy in the acidic soil.",
            "sent2": "The gardener carefully selected calcifuge plants for the lime-free garden bed.",
            "sent3": "The calcifuge plant refused to grow in the chalky soil, throwing a tiny protest.",
            "sent4": "The calcifuge stood out like a rebel among the lime-loving flowers.",
            "sent5": "The calcifuge's preference for acidic soil is like a secret code for gardeners to decipher."
        },
        {
            "definition": "A substance that prevents the formation of calcium deposits.",
            "pos": "noun",
            "sent1": "The calcifuge additive in the detergent keeps the washing machine free from calcium buildup.",
            "sent2": "Dentists recommend using a calcifuge toothpaste to protect against calcium deposits on teeth.",
            "sent3": "The calcifuge solution worked like magic, keeping the pipes clear of calcium clogs.",
            "sent4": "Her secret weapon against limescale was the powerful calcifuge spray.",
            "sent5": "The calcifuge agent shielded the surfaces from the relentless calcium invaders."
        },
        {
            "definition": "To avoid or resist the presence of calcium.",
            "pos": "verb",
            "sent1": "The plant roots calcifuge the surrounding soil to maintain their acidic environment.",
            "sent2": "She had to calcifuge her diet to prevent calcium buildup in her arteries.",
            "sent3": "The chef tried to calcifuge the recipe, but the cheese insisted on adding calcium-rich flavor.",
            "sent4": "He tried to calcifuge his thoughts from dwelling on the calcium-rich foods he couldn't eat.",
            "sent5": "The athlete had to calcifuge his training routine to avoid excessive calcium intake."
        }
    ]
}