{
    "term": "caliper",
    "meanings": [
        {
            "definition": "A tool used for measuring thickness or distance between two points.",
            "pos": "noun",
            "sent1": "The mechanic used a caliper to check the thickness of the brake pads.",
            "sent2": "The scientist used a caliper to measure the distance between the two points accurately.",
            "sent3": "The carpenter accidentally mistook the caliper for a ruler and measured the thickness incorrectly.",
            "sent4": "Her eyes were like a caliper, always accurately measuring the distance between objects.",
            "sent5": "The caliper clicked as it closed around the wire, giving a precise measurement of its thickness."
        },
        {
            "definition": "A device for measuring the thickness of objects.",
            "pos": "noun",
            "sent1": "The jeweler used a caliper to measure the thickness of the diamond.",
            "sent2": "The engineer relied on the caliper to ensure the precise thickness of the metal sheet.",
            "sent3": "The caliper looked like a tiny robot, diligently measuring the thickness of each object.",
            "sent4": "His mind was a caliper, always assessing the thickness of every situation.",
            "sent5": "The caliper beeped as it recorded the exact thickness of the glass pane."
        },
        {
            "definition": "To measure the thickness of something using a caliper.",
            "pos": "verb",
            "sent1": "She carefully calipered the fabric before cutting it to ensure accuracy.",
            "sent2": "The technician calipering the wires to make sure they met the required thickness.",
            "sent3": "He jokingly calipered his sandwich to see if it was thick enough to eat.",
            "sent4": "The artist calipered the colors on his palette, seeking the perfect thickness for his brushstrokes.",
            "sent5": "The tailor calipered the seams of the dress, aiming for precision in every measurement."
        }
    ]
}