{
    "term": "calibration",
    "meanings": [
        {
            "definition": "The act of checking or adjusting a measuring instrument to ensure accuracy.",
            "pos": "noun",
            "sent1": "During the calibration of the thermometer, the technician made sure it showed the correct temperature.",
            "sent2": "The calibration of the scale on the ruler was necessary to measure the length accurately.",
            "sent3": "The calibration of the clock turned into a fun challenge as the hands kept moving unexpectedly.",
            "sent4": "Her sense of time was like a well-calibrated clock, always accurate and reliable.",
            "sent5": "The calibration of the compass was crucial for the explorers to find their way through the dense forest."
        },
        {
            "definition": "The process of marking a scale on a measuring instrument.",
            "pos": "noun",
            "sent1": "The calibration of the ruler involved marking the inches and centimeters clearly.",
            "sent2": "Precision in the calibration of the weighing scale was essential for accurate measurements.",
            "sent3": "The calibration of the measuring tape became a colorful task as each mark was carefully added.",
            "sent4": "Her attention to detail in the calibration of the ruler was like an artist painting fine lines.",
            "sent5": "The calibration of the speedometer was done meticulously to ensure safe driving on the road."
        },
        {
            "definition": "The act of standardizing or adjusting a device or system to a known reference.",
            "pos": "noun",
            "sent1": "The calibration of the machine was necessary to align it with the industry standards.",
            "sent2": "In the calibration of the computer system, each component was adjusted for optimal performance.",
            "sent3": "The calibration of the robot's movements turned into a dance routine as it followed the set pattern.",
            "sent4": "His ability to adapt to new situations was like the calibration of a versatile tool, always ready for any task.",
            "sent5": "The calibration of the telescope allowed astronomers to observe distant stars with precision."
        }
    ]
}