{
    "term": "caligo",
    "meanings": [
        {
            "definition": "Darkness or obscurity",
            "pos": "noun",
            "sent1": "The caligo of the night made it hard to see.",
            "sent2": "The room was filled with a caligo that enveloped everything.",
            "sent3": "The caligo in the haunted house added to the spooky atmosphere.",
            "sent4": "His mind was shrouded in a caligo of confusion.",
            "sent5": "The caligo of sorrow hung heavy in the air."
        },
        {
            "definition": "A cloud of smoke or mist",
            "pos": "noun",
            "sent1": "The caligo from the bonfire rose into the sky.",
            "sent2": "The caligo of pollution obscured the city skyline.",
            "sent3": "The caligo from the barbecue made everyone hungry.",
            "sent4": "The caligo of incense filled the temple with a sacred aura.",
            "sent5": "The caligo of fog blanketed the valley in the early morning."
        },
        {
            "definition": "A genus of butterflies",
            "pos": "noun",
            "sent1": "The caligo butterflies fluttered gracefully in the garden.",
            "sent2": "The caligo species was known for its striking wing patterns.",
            "sent3": "The caligo butterflies added a touch of beauty to the park.",
            "sent4": "The caligo butterflies danced in the sunlight like delicate petals.",
            "sent5": "The caligo butterflies brought color to the meadow with their presence."
        },
        {
            "definition": "A type of cloud formation in meteorology",
            "pos": "noun",
            "sent1": "The caligo cloud loomed ominously in the sky.",
            "sent2": "The weather forecast predicted a caligo formation later in the day.",
            "sent3": "The caligo cloud resembled a giant cotton ball in the sky.",
            "sent4": "The caligo formation signaled an incoming storm.",
            "sent5": "The caligo cloud cast a shadow over the landscape."
        }
    ]
}