{
    "term": "calibrations",
    "meanings": [
        {
            "definition": "The act of checking or adjusting a measuring instrument to ensure accuracy.",
            "pos": "noun",
            "sent1": "Regular calibrations of the thermometer are important for accurate readings.",
            "sent2": "The calibrations on the scale helped ensure the experiment's precision.",
            "sent3": "During the science fair, the talking robot joked about needing calibrations for its voice.",
            "sent4": "Her sense of direction needed calibrations like a compass finding true north.",
            "sent5": "The calibrations on the telescope made the stars appear crystal clear."
        },
        {
            "definition": "A set of graduations on a measuring instrument.",
            "pos": "noun",
            "sent1": "The ruler's calibrations showed inches and centimeters for accurate measurements.",
            "sent2": "She carefully followed the calibrations on the syringe to administer the correct dosage.",
            "sent3": "The musician's guitar had colorful calibrations that made it look like a rainbow.",
            "sent4": "His emotions were like the calibrations on a mood ring, changing with every interaction.",
            "sent5": "The calibrations on the speedometer helped the driver stay within the speed limit."
        },
        {
            "definition": "The process of determining the correct range or scale of a measuring device.",
            "pos": "noun",
            "sent1": "The technician performed calibrations on the scale to ensure it was properly set.",
            "sent2": "After the calibrations, the microscope provided accurate magnification levels.",
            "sent3": "The chef's calibrations for spice levels turned the dish into a fiery surprise.",
            "sent4": "Her laughter filled the room, needing no calibrations to measure its joy.",
            "sent5": "The calibrations on the barometer predicted a storm was approaching."
        }
    ]
}