{
    "term": "callout",
    "meanings": [
        {
            "definition": "A challenge or demand for explanation or justification.",
            "pos": "noun",
            "sent1": "During the meeting, there was a callout for the team to explain their project.",
            "sent2": "The teacher issued a callout to the students to justify their answers.",
            "sent3": "The callout for a reason behind the decision left everyone puzzled.",
            "sent4": "Her callout for honesty was like a spotlight on the truth.",
            "sent5": "The callout for accountability echoed through the room."
        },
        {
            "definition": "A statement or announcement made over a public address system.",
            "pos": "noun",
            "sent1": "The callout over the loudspeaker informed everyone about the upcoming event.",
            "sent2": "The airport callout for boarding echoed through the terminal.",
            "sent3": "The callout for lost items was a regular occurrence at the train station.",
            "sent4": "His callout for attention was heard by everyone in the room.",
            "sent5": "The callout for volunteers was met with enthusiasm."
        },
        {
            "definition": "A highlighted section of text in a document or presentation.",
            "pos": "noun",
            "sent1": "The callout in the report drew attention to the key findings.",
            "sent2": "The callout in the presentation emphasized the main points.",
            "sent3": "The callout in the brochure caught the reader's eye.",
            "sent4": "Her callout in the document was like a beacon for important information.",
            "sent5": "The callout in the slide made the data stand out."
        },
        {
            "definition": "To publicly criticize or challenge someone.",
            "pos": "verb",
            "sent1": "She decided to callout the unfair treatment in front of everyone.",
            "sent2": "The coach would callout players who didn't follow the rules.",
            "sent3": "He would callout his friends jokingly for their fashion choices.",
            "sent4": "The activist would callout the government for their actions.",
            "sent5": "The teacher would callout students for not completing their homework."
        }
    ]
}