{
    "term": "calliper",
    "meanings": [
        {
            "definition": "A tool for measuring thickness or diameter, typically used in engineering and mechanics.",
            "pos": "noun",
            "sent1": "The engineer used a calliper to measure the width of the metal sheet.",
            "sent2": "Make sure to use the calliper to check the size of the pipe accurately.",
            "sent3": "The calliper decided the metal's width was too shy to come out and play.",
            "sent4": "Her eyes were like callipers, accurately assessing every detail of the room.",
            "sent5": "The calliper clicked shut around the wire, revealing its exact thickness."
        },
        {
            "definition": "To measure the thickness or diameter of something using a calliper.",
            "pos": "verb",
            "sent1": "He will calliper the wood to ensure it fits perfectly in the frame.",
            "sent2": "Remember to calliper the bolts before tightening them to avoid any issues.",
            "sent3": "The curious cat tried to calliper the mouse, but it kept running away.",
            "sent4": "Her gaze seemed to calliper his every move, making him feel exposed.",
            "sent5": "The tailor would calliper the fabric before cutting to avoid any mistakes."
        },
        {
            "definition": "The part of a bicycle brake that presses against the wheel rim to slow or stop the bike.",
            "pos": "noun",
            "sent1": "The calliper on the bike brake needed adjusting to work properly.",
            "sent2": "Make sure the calliper is aligned correctly to ensure effective braking.",
            "sent3": "The calliper on the bike brake seemed to have a mind of its own, deciding when to stop.",
            "sent4": "His determination was like a calliper, pressing against obstacles to slow him down.",
            "sent5": "The calliper on the bike brake screeched as it gripped the wheel tightly."
        }
    ]
}