{
    "term": "calls",
    "meanings": [
        {
            "definition": "To cry out in a loud voice",
            "pos": "verb",
            "sent1": "The child calls for help when he is scared.",
            "sent2": "She calls out to her friend across the playground.",
            "sent3": "The cat calls loudly for its favorite toy.",
            "sent4": "The whistle calls out over the stadium, signaling the end of the game.",
            "sent5": "The teacher calls for attention before starting the lesson."
        },
        {
            "definition": "To make a telephone call",
            "pos": "verb",
            "sent1": "He calls his grandma every Sunday to chat.",
            "sent2": "I will call you later to discuss the project.",
            "sent3": "The phone calls at odd hours always startle her.",
            "sent4": "The urgent call from the boss made him rush back to the office.",
            "sent5": "She calls the customer service hotline for assistance with her order."
        },
        {
            "definition": "To summon someone by shouting",
            "pos": "verb",
            "sent1": "The coach calls the players to gather for practice.",
            "sent2": "She calls her dog by name, and it comes running.",
            "sent3": "The hiker calls for help when he gets lost in the woods.",
            "sent4": "The captain calls the crew to attention before setting sail.",
            "sent5": "The teacher calls the students back to their seats after recess."
        },
        {
            "definition": "To give a name or title to",
            "pos": "verb",
            "sent1": "She calls her car 'Blue Lightning' because of its color.",
            "sent2": "He calls his favorite stuffed animal 'Mr. Cuddles'.",
            "sent3": "The child calls the new puppy 'Buddy' as soon as they meet.",
            "sent4": "The artist calls her masterpiece 'Sunset Serenade'.",
            "sent5": "He calls his secret hideout 'Fort Adventure'."
        },
        {
            "definition": "A loud cry or shout",
            "pos": "noun",
            "sent1": "The calls of the seagulls fill the air at the beach.",
            "sent2": "His call for help echoed through the empty hallway.",
            "sent3": "The loud calls of the protesters could be heard from afar.",
            "sent4": "The animal's distress call alerted the park rangers.",
            "sent5": "The haunting call of the owl pierced the silence of the night."
        }
    ]
}