{
    "term": "call",
    "meanings": [
        {
            "definition": "To cry out in a loud voice; shout.",
            "pos": "verb",
            "sent1": "I heard my mom call my name from the kitchen.",
            "sent2": "The coach had to call out the play for the team.",
            "sent3": "The cat decided to call for attention by meowing loudly.",
            "sent4": "The thunderstorm seemed to call out warnings in the dark sky.",
            "sent5": "The teacher's call for silence echoed through the classroom."
        },
        {
            "definition": "To communicate or try to communicate with someone by telephone.",
            "pos": "verb",
            "sent1": "I will call you later to discuss the project details.",
            "sent2": "She called her friend to invite her to the party.",
            "sent3": "The phone seemed to call out for attention with its ringing.",
            "sent4": "The urgent call from the boss made her heart race.",
            "sent5": "The call from the hospital brought both worry and relief."
        },
        {
            "definition": "To give a specified name or title to.",
            "pos": "verb",
            "sent1": "They decided to call their new puppy 'Buddy'.",
            "sent2": "The author chose to call her book 'The Mystery of the Missing Key'.",
            "sent3": "The kids wanted to call their secret club 'The Adventure Seekers'.",
            "sent4": "The ancient ruins were often called 'The Lost City'.",
            "sent5": "The majestic mountain was aptly called 'The Peak of Serenity'."
        },
        {
            "definition": "To make a brief visit.",
            "pos": "verb",
            "sent1": "I will call at your house on my way home from work.",
            "sent2": "She called on her friend to drop off the gift.",
            "sent3": "The squirrel decided to call by the bird feeder for a quick snack.",
            "sent4": "The butterfly called in the garden for a moment of rest.",
            "sent5": "The traveler planned to call by the famous landmark for a photo."
        },
        {
            "definition": "To predict or describe as being.",
            "pos": "verb",
            "sent1": "The weather forecast called for rain all day.",
            "sent2": "He called it a success even before the results were in.",
            "sent3": "The fortune teller called the future full of surprises.",
            "sent4": "The old legend called the hidden treasure a test of bravery.",
            "sent5": "The historian called the ancient civilization a marvel of engineering."
        }
    ]
}