{
    "term": "calligraphically",
    "meanings": [
        {
            "definition": "In a manner related to calligraphy.",
            "pos": "adverb",
            "sent1": "She wrote the letter calligraphically, with elegant swirls and loops.",
            "sent2": "The artist signed the painting calligraphically, adding a touch of sophistication.",
            "sent3": "The chicken tried to peck calligraphically on the paper, attempting to mimic human writing.",
            "sent4": "Her dance moves flowed calligraphically across the stage, like ink on parchment.",
            "sent5": "The wind moved the branches calligraphically, creating a natural masterpiece."
        },
        {
            "definition": "In a way that pertains to the art of beautiful handwriting.",
            "pos": "adverb",
            "sent1": "The invitation was written calligraphically, making it look elegant and fancy.",
            "sent2": "She practiced writing calligraphically to improve her penmanship.",
            "sent3": "The cat walked across the keyboard calligraphically, leaving a trail of gibberish.",
            "sent4": "His words flowed calligraphically from his pen, creating a work of art on the page.",
            "sent5": "The waves crashed calligraphically against the shore, leaving intricate patterns in the sand."
        },
        {
            "definition": "In a style characteristic of calligraphy.",
            "pos": "adverb",
            "sent1": "The logo was designed calligraphically, giving it a classic and timeless look.",
            "sent2": "She signed her name calligraphically, adding a personal touch to the document.",
            "sent3": "The squirrel ran calligraphically along the tree branches, moving with grace and agility.",
            "sent4": "The music notes danced calligraphically on the sheet, creating a beautiful melody.",
            "sent5": "The clouds drifted calligraphically across the sky, painting a picturesque scene."
        }
    ]
}