{
    "term": "callouses",
    "meanings": [
        {
            "definition": "A thickened and hardened part of the skin or soft tissue, especially on the hands or feet, caused by repeated friction or pressure.",
            "pos": "noun",
            "sent1": "Her callouses protected her hands while she worked in the garden.",
            "sent2": "The guitarist's callouses allowed him to play the strings without pain.",
            "sent3": "The callouses on his feet were like tiny shields against the rough ground.",
            "sent4": "His callouses were like armor, shielding his skin from the constant rubbing.",
            "sent5": "The callouses on her feet were as tough as old leather, proof of her hard work."
        },
        {
            "definition": "To develop callouses on the hands from working with tools.",
            "pos": "verb",
            "sent1": "He will callouses his hands if he keeps using the shovel without gloves.",
            "sent2": "Working in the carpentry shop will callouses his palms over time.",
            "sent3": "She joked that he would soon callouses his hands into rocks from all the hammering.",
            "sent4": "The sculptor's hands calloused from chiseling away at the marble.",
            "sent5": "The gardener's hands calloused from tending to the soil day in and day out."
        },
        {
            "definition": "The callouses on his feet made it easier for him to walk on rough terrain.",
            "pos": "noun",
            "sent1": "His callouses helped him trek through the rocky path without pain.",
            "sent2": "The hiker's callouses were proof of his adventurous spirit.",
            "sent3": "He joked that his callouses were like built-in shoes for hiking.",
            "sent4": "The callouses on his feet were like nature's way of giving him sturdy boots.",
            "sent5": "With his callouses, he could conquer any terrain with ease."
        }
    ]
}