{
    "term": "calutrons",
    "meanings": [
        {
            "definition": "A type of mass spectrometer used for isotope separation.",
            "pos": "noun",
            "sent1": "The scientist studied the calutrons to learn about different isotopes.",
            "sent2": "The calutrons in the lab were busy separating isotopes for research.",
            "sent3": "The calutrons at the facility had a party, celebrating their successful isotope separation.",
            "sent4": "The calutrons hummed like busy bees, sorting isotopes with precision.",
            "sent5": "The shiny calutrons gleamed under the lab lights, showcasing their isotope-separating magic."
        },
        {
            "definition": "The process of separating isotopes using a calutron.",
            "pos": "noun",
            "sent1": "Isotope separation with calutrons requires careful planning and execution.",
            "sent2": "Scientists explained the calutrons' role in the isotope separation process.",
            "sent3": "The calutrons decided to race each other in a friendly competition of isotope separation.",
            "sent4": "The calutrons danced around the isotopes, gracefully performing their separation process.",
            "sent5": "The room buzzed with excitement as the calutrons began their isotope-separating journey."
        },
        {
            "definition": "The facility where calutrons are used for isotope separation.",
            "pos": "noun",
            "sent1": "The facility's calutrons were essential for the isotope separation work.",
            "sent2": "Visitors marveled at the high-tech calutrons in the facility.",
            "sent3": "The calutrons in the facility had a secret meeting to discuss isotope separation strategies.",
            "sent4": "The facility's calutrons stood tall, guardians of the precious isotopes.",
            "sent5": "The hum of the calutrons echoed through the facility, signaling the start of isotope separation."
        }
    ]
}