{
    "term": "camails",
    "meanings": [
        {
            "definition": "A flexible medieval armor for the neck and shoulders.",
            "pos": "noun",
            "sent1": "The knight wore camails to protect his neck and shoulders in battle.",
            "sent2": "The camails were essential pieces of armor for the medieval warriors.",
            "sent3": "The camails clinked softly as the knight moved, making him sound like a walking bell.",
            "sent4": "Her camails of courage shielded her from the harsh words of her critics.",
            "sent5": "The camails shimmered in the sunlight, reflecting the bravery of the wearer."
        },
        {
            "definition": "A piece of armor for the neck and shoulders, often made of chain mail.",
            "pos": "noun",
            "sent1": "The shiny camails protected the knight's neck and shoulders from enemy strikes.",
            "sent2": "In battles, the camails were crucial for safeguarding the vulnerable areas of the body.",
            "sent3": "The camails jingled lightly as the knight rode into the castle, announcing his arrival.",
            "sent4": "Her camails of kindness were her shield against the negativity around her.",
            "sent5": "The camails gleamed like silver serpents, warding off any harm from the wearer."
        },
        {
            "definition": "To equip with a camail.",
            "pos": "verb",
            "sent1": "The blacksmith would camail the armor before sending it off to the knights.",
            "sent2": "It was important to camail the soldiers properly to ensure their safety in battle.",
            "sent3": "The young squire learned how to camail the armor under the guidance of the experienced knight.",
            "sent4": "She camailed the shield with care, knowing it would protect her in times of need.",
            "sent5": "The armor glinted after she camailed it, ready for the upcoming challenges."
        }
    ]
}