{
    "term": "cambism",
    "meanings": [
        {
            "definition": "The belief in the superiority of one's own country or culture over others.",
            "pos": "noun",
            "sent1": "Her cambism led her to think her country was the best in the world.",
            "sent2": "Many people exhibit cambism by valuing their culture above all others.",
            "sent3": "His extreme cambism made him insist that his country's food was the only good cuisine.",
            "sent4": "The professor's cambism towards his own culture colored his views on international relations.",
            "sent5": "The student's cambism was so strong that she refused to try anything new from other cultures."
        },
        {
            "definition": "A system of government in which power is concentrated in the hands of a single ruler.",
            "pos": "noun",
            "sent1": "In a cambism, all decisions are made by the ruler without consulting others.",
            "sent2": "The history book described the rise and fall of a cambism in a distant land.",
            "sent3": "The children playfully pretended to establish a cambism in their make-believe kingdom.",
            "sent4": "The dictator's cambism led to unrest and rebellion among the citizens.",
            "sent5": "The movie depicted a dystopian society ruled by a cruel cambism."
        },
        {
            "definition": "The practice of favoring one's own interests over those of others.",
            "pos": "noun",
            "sent1": "Her cambism in the workplace made her overlook the needs of her colleagues.",
            "sent2": "Some politicians are known for their cambism, always putting themselves first.",
            "sent3": "The cat's cambism was evident when it refused to share its toys with other pets.",
            "sent4": "The company's cambism resulted in unfair treatment of its employees.",
            "sent5": "The selfish cambism of the character made him unpopular among his friends."
        }
    ]
}