{
    "term": "cameo",
    "meanings": [
        {
            "definition": "A small character part in a play or movie, typically played by a well-known actor.",
            "pos": "noun",
            "sent1": "In the school play, the famous actress had a cameo as the wise old grandmother.",
            "sent2": "The movie star made a cameo appearance in the film, surprising the audience.",
            "sent3": "The cameo by the comedian added a touch of humor to the serious drama.",
            "sent4": "Her unexpected cameo in the scene brought a burst of energy to the film.",
            "sent5": "The cameo by the singer left a lasting impression on the viewers."
        },
        {
            "definition": "A piece of jewelry, typically oval in shape, on which a portrait or relief is carved in profile.",
            "pos": "noun",
            "sent1": "She wore a beautiful cameo necklace that belonged to her grandmother.",
            "sent2": "The antique shop displayed a variety of intricate cameo brooches.",
            "sent3": "The cameo on her bracelet depicted a delicate flower design.",
            "sent4": "The cameo on the ring seemed to hold a mysterious story within its carving.",
            "sent5": "The cameo earrings sparkled under the light, catching everyone's attention."
        },
        {
            "definition": "A short literary sketch or portrait.",
            "pos": "noun",
            "sent1": "The author included a cameo of his friend in the novel as a tribute.",
            "sent2": "The magazine published a cameo of the famous artist in their latest issue.",
            "sent3": "The cameo of the quirky neighbor in the story brought a smile to the readers.",
            "sent4": "The writer's cameo of the bustling cityscape painted a vivid picture in the readers' minds.",
            "sent5": "The literary magazine featured a cameo of the poet, capturing her essence beautifully."
        }
    ]
}