{
    "term": "camps",
    "meanings": [
        {
            "definition": "A place with temporary accommodations for a group of people, typically in tents or cabins.",
            "pos": "noun",
            "sent1": "During the summer, we went to camps in the woods to sleep in cabins.",
            "sent2": "The scouts gathered at the campsites to set up their tents.",
            "sent3": "The family reunion at the camp was full of laughter and s'mores.",
            "sent4": "In the sea of tents, the camp resembled a colorful patchwork quilt.",
            "sent5": "The image of the camp nestled among the trees stayed in my mind for years."
        },
        {
            "definition": "A group of people with shared beliefs or interests.",
            "pos": "noun",
            "sent1": "The bird-watching camp met every Saturday to observe different species.",
            "sent2": "The book club members formed a close-knit camp of avid readers.",
            "sent3": "The camp of movie enthusiasts debated about their favorite films.",
            "sent4": "In the camp of artists, creativity flowed like a river.",
            "sent5": "Being part of the camp of hikers brought a sense of belonging and adventure."
        },
        {
            "definition": "To set up a camp for temporary shelter.",
            "pos": "verb",
            "sent1": "We need to camps near the river before it gets dark.",
            "sent2": "They camps at the base of the mountain to rest for the night.",
            "sent3": "Let's camps here for the night and continue our journey in the morning.",
            "sent4": "The team decided to camps at the beach for the weekend getaway.",
            "sent5": "As the sun set, they hurried to camps in a safe spot for the night."
        },
        {
            "definition": "To live in a camp, especially as a camper.",
            "pos": "verb",
            "sent1": "During the summer, we camps in the wilderness to enjoy nature.",
            "sent2": "She camps by the lake every year to relax and unwind.",
            "sent3": "He loves to camps in the mountains, surrounded by peace and quiet.",
            "sent4": "The family decided to camps by the ocean for the entire vacation.",
            "sent5": "Camping under the stars allows you to truly camps in the great outdoors."
        }
    ]
}