{
    "term": "camphines",
    "meanings": [
        {
            "definition": "A type of resinous substance obtained from the camphor tree.",
            "pos": "noun",
            "sent1": "The camphines from the tree were used to make fragrant candles.",
            "sent2": "The camphines were carefully extracted from the camphor tree for medicinal purposes.",
            "sent3": "The mischievous squirrel mistook the camphines for nuts and tried to bury them.",
            "sent4": "The scent of camphines filled the air, reminiscent of a forest after rain.",
            "sent5": "As the sun set, the camphines glowed like tiny fireflies in the dark forest."
        },
        {
            "definition": "A colorless, volatile liquid used as a solvent.",
            "pos": "noun",
            "sent1": "The workers wore masks to protect themselves from inhaling the strong camphines.",
            "sent2": "The laboratory stored various chemicals, including camphines, in sealed containers.",
            "sent3": "The spilled camphines created a slippery surface, causing everyone to slide around comically.",
            "sent4": "Her words evaporated into the room like camphines, leaving a lingering impact.",
            "sent5": "The camphines bubbled and hissed in the glass beaker, releasing a pungent odor."
        },
        {
            "definition": "To treat with camphor or camphor oil.",
            "pos": "verb",
            "sent1": "She carefully camphined the wooden chest to protect it from insects.",
            "sent2": "The ancient recipe instructed to camphine the fabric before storing it.",
            "sent3": "He playfully camphined his friend's backpack, leaving a faint scent of camphor behind.",
            "sent4": "The idea camphined through her mind, leaving a refreshing clarity in its wake.",
            "sent5": "The healer's hands seemed to camphine with magic as she applied the soothing oil."
        }
    ]
}