{
    "term": "camp",
    "meanings": [
        {
            "definition": "A place with temporary accommodations, such as tents or cabins, typically used for recreation or military purposes.",
            "pos": "noun",
            "sent1": "During the summer, we went to a camp by the lake to fish and swim.",
            "sent2": "The scouts gathered around the campfire to sing songs and roast marshmallows.",
            "sent3": "At the camp, the raccoons tried to steal our snacks, thinking they were invited too!",
            "sent4": "The camp nestled in the valley looked like a cozy village under the starlit sky.",
            "sent5": "The camp was filled with laughter and the smell of pine trees, creating unforgettable memories."
        },
        {
            "definition": "To set up a camp.",
            "pos": "verb",
            "sent1": "We need to camp near the river to be closer to the fishing spot.",
            "sent2": "Every summer, we camp in the mountains to enjoy the fresh air and nature.",
            "sent3": "Let's camp in the backyard tonight and pretend we're on a wilderness adventure!",
            "sent4": "The protesters decided to camp outside the government building until their demands were met.",
            "sent5": "Camping under the stars allows you to appreciate the beauty of the night sky."
        },
        {
            "definition": "A group of people with a common interest or purpose, often characterized by exaggerated or theatrical behavior.",
            "pos": "noun",
            "sent1": "The drama camp students were always full of energy and excitement.",
            "sent2": "The fan camp gathered outside the stadium to support their favorite team.",
            "sent3": "During the talent show, the magician camp amazed everyone with their tricks.",
            "sent4": "The political camp held a rally to voice their opinions on the upcoming election.",
            "sent5": "The cosplay camp members dressed up as their favorite characters and paraded through the convention."
        }
    ]
}