{
    "term": "camping",
    "meanings": [
        {
            "definition": "The activity of staying in a tent or shelter outdoors for a vacation or recreation.",
            "pos": "noun",
            "sent1": "Last summer, we went camping in the woods and roasted marshmallows over a campfire.",
            "sent2": "Families often enjoy camping together during the holidays to bond and have fun.",
            "sent3": "After a long day of camping, we all gathered around the fire and shared funny stories.",
            "sent4": "Camping is like creating a temporary home in the wilderness, away from the hustle and bustle of the city.",
            "sent5": "The sound of crickets chirping at night while camping can be both soothing and eerie."
        },
        {
            "definition": "The act of setting up a camp or temporary living space.",
            "pos": "noun",
            "sent1": "Before starting the camping trip, we need to organize all the gear for setting up the campsite.",
            "sent2": "Proper camping etiquette includes leaving the area cleaner than you found it when setting up camp.",
            "sent3": "The camping competition turned into a race to see who could set up their tent the fastest.",
            "sent4": "Setting up a camp is like building a small village in the middle of the wilderness.",
            "sent5": "The camping enthusiasts were experts at quickly assembling their temporary living spaces."
        },
        {
            "definition": "The practice of spending time in nature, typically sleeping in a tent or under the stars.",
            "pos": "noun",
            "sent1": "Camping allows us to disconnect from technology and reconnect with nature's beauty.",
            "sent2": "Many people find solace in the simplicity of camping under the open sky.",
            "sent3": "The camping trip turned into a stargazing adventure under the clear night sky.",
            "sent4": "In a world full of chaos, camping offers a peaceful retreat in the arms of nature.",
            "sent5": "The experience of camping under a blanket of stars is truly magical and unforgettable."
        }
    ]
}