{
    "term": "candidiases",
    "meanings": [
        {
            "definition": "a fungal infection caused by Candida species, especially Candida albicans.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with candidiases after examining the skin rash.",
            "sent2": "Candidiases can be treated with antifungal medications prescribed by a healthcare provider.",
            "sent3": "The candidiases decided to throw a party in the warm, moist environment of the basement.",
            "sent4": "Her candidiases spread like wildfire through the community, affecting many individuals.",
            "sent5": "The classroom was a battleground where candidiases fought against the immune system defenders."
        },
        {
            "definition": "the presence of excessive Candida organisms in the body, leading to infection.",
            "pos": "noun",
            "sent1": "The doctor explained that the patient's symptoms were due to candidiases in the gut.",
            "sent2": "Candidiases can cause discomfort and require medical attention to resolve.",
            "sent3": "The candidiases in the body threw a party, causing chaos and disruption.",
            "sent4": "Her candidiases in the bloodstream were like uninvited guests overstaying their welcome.",
            "sent5": "The invasion of candidiases in the body was akin to an army storming the gates."
        },
        {
            "definition": "a condition characterized by white patches on the mucous membranes of the mouth and throat.",
            "pos": "noun",
            "sent1": "The dentist identified candidiases in the patient's mouth during the check-up.",
            "sent2": "Candidiases on the tongue can be painful and affect taste perception.",
            "sent3": "The candidiases on the mucous membranes threw a party, making speech difficult.",
            "sent4": "Her candidiases on the throat were like snowy patches on a winter landscape.",
            "sent5": "The white candidiases on the tongue stood out like beacons in the dark."
        }
    ]
}