{
    "term": "canephors",
    "meanings": [
        {
            "definition": "A person who carries a sacred vessel or basket in ancient Greek religious processions.",
            "pos": "noun",
            "sent1": "During the festival, the canephors walked solemnly, holding the sacred basket.",
            "sent2": "The canephors led the procession, each carrying a beautiful vessel on their head.",
            "sent3": "The canephors accidentally dropped the sacred basket, causing a moment of panic.",
            "sent4": "She moved gracefully through the crowd, like a canephors carrying a precious vessel.",
            "sent5": "The image of the canephors with their baskets stayed etched in my memory."
        },
        {
            "definition": "A decorative motif in ancient Greek art featuring a basket or vessel carried on the head.",
            "pos": "noun",
            "sent1": "The painting displayed intricate canephors, adding elegance to the artwork.",
            "sent2": "In the sculpture, the canephors motif symbolized grace and beauty.",
            "sent3": "The artist playfully incorporated canephors into the mural, surprising the viewers.",
            "sent4": "Her hat resembled the canephors motif, making her stand out in the crowd.",
            "sent5": "The canephors design on the vase was striking and captivating."
        },
        {
            "definition": "A type of ancient Greek vase depicting a canephoros.",
            "pos": "noun",
            "sent1": "The museum displayed a collection of canephors vases from different eras.",
            "sent2": "The canephors vase depicted a scene from a religious procession.",
            "sent3": "The ancient canephors vase was accidentally knocked over during the exhibit.",
            "sent4": "The intricate details on the canephors vase revealed the skill of the artist.",
            "sent5": "The canephors vase stood out among the other artifacts in the museum."
        }
    ]
}