{
    "term": "caneh",
    "meanings": [
        {
            "definition": "A long, hollow, slender piece of wood or metal used for support while walking.",
            "pos": "noun",
            "sent1": "Grandpa uses a caneh to help him walk.",
            "sent2": "She leaned on her caneh while strolling in the park.",
            "sent3": "The mischievous squirrel tried to use the caneh as a tightrope.",
            "sent4": "The caneh stood tall like a loyal friend by his side.",
            "sent5": "The caneh clicked on the pavement with each step."
        },
        {
            "definition": "To walk with a caneh for support.",
            "pos": "verb",
            "sent1": "He canehs slowly along the path.",
            "sent2": "She canehed confidently after her injury.",
            "sent3": "The penguin tried to caneh on the ice but slipped comically.",
            "sent4": "She canehed through the crowd like a graceful dancer.",
            "sent5": "The elderly man canehs with determination despite the pain."
        },
        {
            "definition": "A type of sugar made from sugarcane.",
            "pos": "noun",
            "sent1": "The recipe called for a spoonful of caneh.",
            "sent2": "She added caneh to sweeten the tea.",
            "sent3": "The mischievous child sprinkled caneh all over the kitchen floor.",
            "sent4": "The caneh melted in the hot drink like a sweet dream.",
            "sent5": "The caneh crystals sparkled in the sunlight like tiny diamonds."
        },
        {
            "definition": "A type of plant with a tall, woody stem.",
            "pos": "noun",
            "sent1": "The caneh swayed gently in the breeze.",
            "sent2": "She admired the lush green caneh in the garden.",
            "sent3": "The mischievous cat tried to climb the caneh but failed miserably.",
            "sent4": "The caneh towered over the other plants like a giant in a forest.",
            "sent5": "The caneh rustled softly as the wind passed through its leaves."
        }
    ]
}