{
    "term": "canicular",
    "meanings": [
        {
            "definition": "of or relating to the dog days of summer",
            "pos": "adjective",
            "sent1": "The canicular heat made it unbearable to stay outside for long.",
            "sent2": "During the canicular days, people seek shade to escape the intense sun.",
            "sent3": "The canicular weather turned everyone into lazy cats, lounging in the cool indoors.",
            "sent4": "The canicular sun beat down relentlessly, like a fiery dragon breathing heat.",
            "sent5": "The canicular atmosphere felt like being trapped in an oven, with no relief in sight."
        },
        {
            "definition": "pertaining to or characteristic of Sirius, the Dog Star",
            "pos": "adjective",
            "sent1": "The canicular brightness of Sirius lit up the night sky.",
            "sent2": "Astronomers study the canicular properties of Sirius to understand its impact on other stars.",
            "sent3": "The canicular glow of Sirius seemed to wink playfully at the stargazers below.",
            "sent4": "The canicular presence of Sirius in the constellation added a celestial charm to the night.",
            "sent5": "The canicular radiance of Sirius outshone all other stars, creating a mesmerizing display."
        },
        {
            "definition": "occurring in or characteristic of the period of the dog days",
            "pos": "adjective",
            "sent1": "The canicular haze settled over the town, signaling the start of the dog days.",
            "sent2": "Farmers prepared for the canicular droughts that often accompany the dog days.",
            "sent3": "The canicular lethargy of the dog days made even the most energetic kids want to nap all day.",
            "sent4": "The canicular stillness of the dog days enveloped the countryside in a sleepy embrace.",
            "sent5": "The canicular days of the dog days seemed to stretch on endlessly, like a never-ending summer dream."
        }
    ]
}