{
    "term": "cannabinols",
    "meanings": [
        {
            "definition": "Any of a group of closely related compounds that include cannabinol and the active constituents of cannabis.",
            "pos": "noun",
            "sent1": "Scientists study different types of cannabinols to understand their effects on the body.",
            "sent2": "The pharmacist explained that cannabinols are the key components of medical marijuana.",
            "sent3": "The detective found a clue related to cannabinols in the suspect's bag.",
            "sent4": "Her love for cooking was like the variety of cannabinols in a cannabis plant.",
            "sent5": "The teacher used colorful diagrams to explain the concept of cannabinols to the students."
        },
        {
            "definition": "A compound found in cannabis plants that has psychoactive properties.",
            "pos": "noun",
            "sent1": "Some people believe that cannabinols can alter a person's mood.",
            "sent2": "The doctor warned about the potential side effects of consuming cannabinols.",
            "sent3": "The comedian joked about a funny experience with cannabinols at a party.",
            "sent4": "His mind was a rollercoaster ride after consuming cannabinols.",
            "sent5": "The artist painted a surreal scene inspired by the effects of cannabinols."
        },
        {
            "definition": "A type of chemical compound that interacts with the body's endocannabinoid system.",
            "pos": "noun",
            "sent1": "Researchers are exploring how cannabinols affect the endocannabinoid system.",
            "sent2": "The nurse explained the role of cannabinols in regulating pain perception.",
            "sent3": "The cat seemed unusually calm after accidentally ingesting cannabinols.",
            "sent4": "Her thoughts raced like cannabinols interacting with the body's systems.",
            "sent5": "The athlete felt a surge of energy as the cannabinols kicked in during the race."
        }
    ]
}