{
    "term": "cannibalistic",
    "meanings": [
        {
            "definition": "Relating to or characteristic of cannibals.",
            "pos": "adjective",
            "sent1": "The cannibalistic tribe was known for their unusual eating habits.",
            "sent2": "The movie depicted a cannibalistic character who preyed on unsuspecting victims.",
            "sent3": "The children giggled at the idea of a cannibalistic monster under their beds.",
            "sent4": "His cannibalistic gaze made her feel uneasy, as if he could devour her with his eyes.",
            "sent5": "The author's vivid description painted a cannibalistic picture of the ancient ritual."
        },
        {
            "definition": "Involving the practice of eating the flesh of one's own species.",
            "pos": "adjective",
            "sent1": "The cannibalistic act shocked the entire community.",
            "sent2": "The survival story featured a group resorting to cannibalistic behavior to stay alive.",
            "sent3": "The idea of a cannibalistic potluck dinner made everyone chuckle nervously.",
            "sent4": "The cannibalistic nature of the crime scene left the investigators speechless.",
            "sent5": "The artist's painting depicted a hauntingly cannibalistic scene of desperation."
        },
        {
            "definition": "Showing behavior reminiscent of cannibals.",
            "pos": "adjective",
            "sent1": "The cannibalistic gestures of the actor added depth to his performance.",
            "sent2": "The novel's antagonist displayed cannibalistic tendencies towards his rivals.",
            "sent3": "The comedian's joke about a cannibalistic fashion trend left the audience in stitches.",
            "sent4": "Her cannibalistic competitiveness in sports often intimidated her opponents.",
            "sent5": "The documentary captured the cannibalistic rituals of a remote tribe with unsettling clarity."
        }
    ]
}