{
    "term": "cannibalise",
    "meanings": [
        {
            "definition": "To use parts of something to repair or build something else.",
            "pos": "verb",
            "sent1": "I had to cannibalise my old computer to fix my new one.",
            "sent2": "The mechanic had to cannibalise an old car to get the spare parts needed for the repair.",
            "sent3": "When my toy broke, I decided to cannibalise it and make a new one out of the parts.",
            "sent4": "In order to create a unique sculpture, the artist would cannibalise various materials from old projects.",
            "sent5": "The inventor had to cannibalise different gadgets to build his latest invention."
        },
        {
            "definition": "To use or take for one's own advantage.",
            "pos": "verb",
            "sent1": "She would cannibalise her sister's ideas and present them as her own.",
            "sent2": "The company decided to cannibalise the competitor's market share by offering better deals.",
            "sent3": "The clever student would cannibalise the study notes of others to improve her own grades.",
            "sent4": "The politician would cannibalise his opponent's speeches to gain more support.",
            "sent5": "The cunning fox would cannibalise the leftovers of larger predators for an easy meal."
        },
        {
            "definition": "To consume the flesh of one's own species.",
            "pos": "verb",
            "sent1": "In the horror movie, the monster would cannibalise other creatures in the forest.",
            "sent2": "The tribe's tradition forbade them to cannibalise their own kind, even in times of famine.",
            "sent3": "The zombie apocalypse story featured undead creatures that would cannibalise humans.",
            "sent4": "The survival show contestants were shocked to discover they had to cannibalise to stay alive.",
            "sent5": "The mythical creature was said to cannibalise its own kind to gain their powers."
        }
    ]
}