{
    "term": "canon",
    "meanings": [
        {
            "definition": "A general law, rule, principle, or criterion by which something is judged.",
            "pos": "noun",
            "sent1": "In our society, honesty is a canon that guides our actions.",
            "sent2": "The constitution serves as the canon for determining the legality of government actions.",
            "sent3": "Following the canon of 'no running in the halls' can be challenging for energetic kids.",
            "sent4": "She viewed the golden rule as the ultimate canon for moral behavior.",
            "sent5": "The teacher emphasized the importance of punctuality as a canon for success."
        },
        {
            "definition": "A collection or list of sacred books accepted as genuine.",
            "pos": "noun",
            "sent1": "The Bible is a well-known canon in Christianity.",
            "sent2": "Monks carefully preserved the canon of scriptures in the monastery.",
            "sent3": "The librarian jokingly referred to the Harry Potter series as her personal canon.",
            "sent4": "To her, the cookbook was the culinary canon that guided her kitchen experiments.",
            "sent5": "He treated the ancient scrolls with reverence, recognizing them as part of the religious canon."
        },
        {
            "definition": "A group of literary works that are considered to be permanently established as being of the highest quality.",
            "pos": "noun",
            "sent1": "Shakespeare's plays are often included in the literary canon.",
            "sent2": "The school curriculum includes a diverse range of works from the literary canon.",
            "sent3": "The detective novel, though not a classic, found its way into the literary canon.",
            "sent4": "She aspired to write a novel that would one day be part of the literary canon.",
            "sent5": "The library proudly displayed the canon of timeless literary masterpieces."
        }
    ]
}