{
    "term": "cans",
    "meanings": [
        {
            "definition": "A cylindrical metal container used for storing food or drink.",
            "pos": "noun",
            "sent1": "I bought some soup in cans from the store.",
            "sent2": "The cans of soda were stacked neatly on the shelf.",
            "sent3": "When the cans rolled off the table, it sounded like a drumroll.",
            "sent4": "Her laughter echoed through the room like the clinking of cans.",
            "sent5": "The shiny cans gleamed under the sunlight, attracting everyone's attention."
        },
        {
            "definition": "A slang term for headphones.",
            "pos": "noun",
            "sent1": "He put on his favorite song, adjusting the cans over his ears.",
            "sent2": "The DJ wore stylish cans during the music festival.",
            "sent3": "She mistook his cans for earmuffs and burst out laughing.",
            "sent4": "The sound quality of these cans is like music to my ears.",
            "sent5": "The cans blocked out all external noise, creating a peaceful bubble."
        },
        {
            "definition": "To preserve food by sealing it in airtight containers.",
            "pos": "verb",
            "sent1": "She cans fruits and vegetables every summer to enjoy in winter.",
            "sent2": "The chef cans homemade jams for sale at the market.",
            "sent3": "He joked that he could can a whole meal in a jar.",
            "sent4": "Her memories were like canned emotions, sealed away for later.",
            "sent5": "The idea of canning food seemed like a magical way to keep it fresh."
        },
        {
            "definition": "To dismiss someone from their job or position.",
            "pos": "verb",
            "sent1": "The company cans employees who do not meet their targets.",
            "sent2": "He feared getting canned after the budget cuts were announced.",
            "sent3": "She playfully threatened to can him if he didn't stop teasing her.",
            "sent4": "Losing the competition felt like being canned in front of a live audience.",
            "sent5": "The coach decided to can the player for breaking team rules."
        }
    ]
}