{
    "term": "canvassers",
    "meanings": [
        {
            "definition": "People who solicit votes or orders, as for a political party or business.",
            "pos": "noun",
            "sent1": "The canvassers knocked on doors to ask for support during the election.",
            "sent2": "The company hired canvassers to promote their new product in the neighborhood.",
            "sent3": "The group of canvassers accidentally went to the wrong neighborhood and ended up promoting the wrong candidate!",
            "sent4": "The canvassers were like busy bees buzzing from one house to another, gathering votes.",
            "sent5": "The image of the canvassers with their clipboards became a familiar sight in the community."
        },
        {
            "definition": "People who conduct a survey or gather information.",
            "pos": "noun",
            "sent1": "The team of canvassers went around the city collecting data for the research project.",
            "sent2": "The organization hired canvassers to gather opinions on the new policy.",
            "sent3": "The group of canvassers found out that most people preferred chocolate ice cream over vanilla.",
            "sent4": "The canvassers were like detectives, piecing together information from different sources.",
            "sent5": "The canvassers diligently recorded every response they received during the survey."
        },
        {
            "definition": "People who examine carefully or discuss thoroughly.",
            "pos": "noun",
            "sent1": "The team of canvassers carefully reviewed each document before presenting their findings.",
            "sent2": "The group of canvassers sat down to discuss the implications of the new law.",
            "sent3": "The canvassers spent hours debating the best course of action to take.",
            "sent4": "The canvassers were like scholars, delving deep into the subject matter.",
            "sent5": "The image of the canvassers poring over books and notes became a common sight in the office."
        }
    ]
}