{
    "term": "canyoneering",
    "meanings": [
        {
            "definition": "The sport of exploring canyons by hiking, climbing, rappelling, and swimming.",
            "pos": "noun",
            "sent1": "Canyoneering can be an exciting way to explore nature's hidden wonders.",
            "sent2": "Many adventurers enjoy canyoneering in the rugged terrain of the desert.",
            "sent3": "During canyoneering, I accidentally splashed my friend with water while rappelling.",
            "sent4": "Her canyoneering skills were as sharp as the cliffs she descended.",
            "sent5": "The thrill of canyoneering made my heart race with each step down the canyon."
        },
        {
            "definition": "The act of descending canyons using a variety of techniques.",
            "pos": "noun",
            "sent1": "Exploring the canyon through canyoneering requires careful planning and skill.",
            "sent2": "Canyoneering enthusiasts often use ropes and harnesses to safely navigate steep cliffs.",
            "sent3": "I felt like a canyoneering superhero as I gracefully rappelled down the canyon walls.",
            "sent4": "The canyoneering adventure felt like a thrilling rollercoaster ride through nature.",
            "sent5": "His passion for canyoneering was evident in the way he moved with confidence down the canyon."
        },
        {
            "definition": "The practice of navigating narrow gorges and ravines.",
            "pos": "noun",
            "sent1": "Canyoneering requires a good sense of direction to navigate the twists and turns of the canyon.",
            "sent2": "The group embarked on a canyoneering expedition to explore the hidden beauty of the ravine.",
            "sent3": "We laughed as we stumbled through the canyoneering course, trying to find our way out.",
            "sent4": "Her mind was a map, guiding her through the canyoneering challenge with ease.",
            "sent5": "The echoes of our voices bounced off the canyon walls during our canyoneering adventure."
        }
    ]
}