{
    "term": "cap",
    "meanings": [
        {
            "definition": "A type of head covering",
            "pos": "noun",
            "sent1": "I wore a red cap to protect my head from the sun.",
            "sent2": "The baseball player always wears his team's cap during games.",
            "sent3": "The cap flew off my head and landed in the pond, making the ducks curious.",
            "sent4": "Her cap of curly hair framed her face like a halo.",
            "sent5": "The cap with a propeller on top made everyone laugh at the party."
        },
        {
            "definition": "The top part of something",
            "pos": "noun",
            "sent1": "The cap of the bottle was difficult to twist open.",
            "sent2": "He carefully placed the cap back on the pen after writing.",
            "sent3": "The cap of the mountain was covered in snow, making it glisten in the sunlight.",
            "sent4": "The cap of the wave crashed loudly against the shore.",
            "sent5": "The cap of the volcano released a plume of smoke into the sky."
        },
        {
            "definition": "To cover or close something",
            "pos": "verb",
            "sent1": "Please cap the bottle tightly to prevent any spills.",
            "sent2": "She quickly capped the marker before it dried out.",
            "sent3": "I tried to cap the overflowing sink with my hand, but water still spilled everywhere.",
            "sent4": "The chef needed to cap the pot to let the soup simmer.",
            "sent5": "He decided to cap the well to protect it from contamination."
        },
        {
            "definition": "To reach the maximum limit",
            "pos": "verb",
            "sent1": "The team's score will cap at 100 points if they keep playing well.",
            "sent2": "Her excitement seemed to cap when she saw her favorite singer in person.",
            "sent3": "The laughter in the room seemed to cap at the joke the comedian told.",
            "sent4": "The price of the rare stamp could cap at a million dollars in the auction.",
            "sent5": "His energy levels always cap at the end of a long day at work."
        }
    ]
}