{
    "term": "capas",
    "meanings": [
        {
            "definition": "A covering for the head, usually with a visor and a close-fitting crown.",
            "pos": "noun",
            "sent1": "I wear my capas to shield my face from the sun.",
            "sent2": "The soldier's capas protected him from the rain.",
            "sent3": "The cat tried to wear a tiny capas, but it kept falling off.",
            "sent4": "Her capas of confidence was her signature look.",
            "sent5": "The capas of snow on the mountain sparkled in the sunlight."
        },
        {
            "definition": "The top part of something.",
            "pos": "noun",
            "sent1": "The capas of the mountain was covered in snow.",
            "sent2": "He reached the capas of the tree to pick the ripe fruit.",
            "sent3": "The capas of the cake was decorated with colorful sprinkles.",
            "sent4": "The capas of the building seemed to touch the sky.",
            "sent5": "The capas of the wave crashed against the shore."
        },
        {
            "definition": "To cover or provide with a cap.",
            "pos": "verb",
            "sent1": "She likes to capas her head with a hat when it's sunny.",
            "sent2": "The chef decided to capas the dish with a sprinkle of herbs.",
            "sent3": "The magician tried to capas the rabbit with a tiny hat.",
            "sent4": "He wanted to capas the project with a successful presentation.",
            "sent5": "The artist will capas the painting with a beautiful frame."
        },
        {
            "definition": "To surpass in performance.",
            "pos": "verb",
            "sent1": "She always manages to capas her previous score in the game.",
            "sent2": "The new model aims to capas the old one in sales.",
            "sent3": "The student tried to capas his classmates in the science fair.",
            "sent4": "The team worked hard to capas their rivals in the competition.",
            "sent5": "His dedication helped him capas his own expectations."
        }
    ]
}