{
    "term": "capacitances",
    "meanings": [
        {
            "definition": "The ability to store electric charge.",
            "pos": "noun",
            "sent1": "The capacitances of the battery allowed it to hold a lot of energy.",
            "sent2": "The capacitances of the power bank determine how long it can charge your phone.",
            "sent3": "The capacitances of the outlet were so high that it seemed to never run out of power.",
            "sent4": "Her mind had capacitances like a well-charged battery, ready to tackle any problem.",
            "sent5": "The capacitances of the lightning bolt were so intense that it lit up the entire sky."
        },
        {
            "definition": "The measure of a capacitor's ability to store charge.",
            "pos": "noun",
            "sent1": "The technician checked the capacitances of the capacitor to ensure it was functioning properly.",
            "sent2": "The capacitances of the new capacitor were higher than expected, providing better performance.",
            "sent3": "The capacitances of the capacitor were so precise that it could store just the right amount of charge.",
            "sent4": "His memory had capacitances like a capacitor, holding onto important details for a long time.",
            "sent5": "The capacitances of the capacitor were like a reservoir, ready to release energy when needed."
        },
        {
            "definition": "The total charge that can be stored in a capacitor.",
            "pos": "noun",
            "sent1": "The capacitances of the capacitor were crucial for powering the device.",
            "sent2": "The capacitances of the capacitor determined how much energy it could hold.",
            "sent3": "The capacitances of the capacitor were so full that it seemed to glow with stored charge.",
            "sent4": "Her heart had capacitances like a capacitor, holding onto love and memories.",
            "sent5": "The capacitances of the capacitor were like a treasure chest, full of electric potential."
        }
    ]
}