{
    "term": "capa",
    "meanings": [
        {
            "definition": "A covering for the head, usually with a visor and a close-fitting crown.",
            "pos": "noun",
            "sent1": "I wore my red capa to protect my head from the sun.",
            "sent2": "The soldier's capa shielded him from the rain during the march.",
            "sent3": "The capa flew off in the wind, making me chase after it comically.",
            "sent4": "Her capa of confidence never wavered, even in challenging situations.",
            "sent5": "The capa was so bright and colorful, it stood out in the crowd."
        },
        {
            "definition": "The top part of something.",
            "pos": "noun",
            "sent1": "The capa of the mountain was covered in snow.",
            "sent2": "She carefully placed the capa back on the bottle.",
            "sent3": "The capa of the cake was decorated with tiny sugar flowers.",
            "sent4": "The capa of the tree reached high into the sky, touching the clouds.",
            "sent5": "The capa of the building gleamed in the sunlight, reflecting the sky."
        },
        {
            "definition": "The ability or power to do something.",
            "pos": "noun",
            "sent1": "With his capa for music, he could play any instrument beautifully.",
            "sent2": "Her capa to lead the team was evident in how well they worked together.",
            "sent3": "The cat showed its capa for catching mice by bringing one home every day.",
            "sent4": "His capa to learn new languages amazed everyone around him.",
            "sent5": "The capa to heal others was a gift she cherished and used wisely."
        },
        {
            "definition": "A layer or coating on a surface.",
            "pos": "noun",
            "sent1": "The capa of paint on the wall was a vibrant shade of blue.",
            "sent2": "The car's capa of dust indicated it hadn't been used in a while.",
            "sent3": "She added a capa of icing on top of the cupcakes for extra sweetness.",
            "sent4": "The capa of frost on the grass sparkled in the morning sunlight.",
            "sent5": "The capa of snow blanketed the town, creating a winter wonderland."
        }
    ]
}