{
    "term": "capitations",
    "meanings": [
        {
            "definition": "A tax or fee imposed per person",
            "pos": "noun",
            "sent1": "The government collected capitations from each citizen to fund public services.",
            "sent2": "The capitations levied on the population helped finance the new school building.",
            "sent3": "The capitations were like little coins people had to give to the king for permission to enter the city gates.",
            "sent4": "Paying the capitations felt like handing over a piece of your own hard-earned money to the authorities.",
            "sent5": "The capitations were like tiny drops of water filling up a large tax bucket."
        },
        {
            "definition": "The act of decapitating someone",
            "pos": "noun",
            "sent1": "The executioner's job was to perform capitations as a form of punishment.",
            "sent2": "Capitations were carried out in ancient times as a severe penalty for crimes.",
            "sent3": "The magician's trick involved a fake capitations act that amazed the audience.",
            "sent4": "In the horror movie, the villain's signature move was a swift capitations of his victims.",
            "sent5": "The legend spoke of a ghost seeking revenge through capitations of unsuspecting travelers."
        },
        {
            "definition": "The process of counting heads or individuals",
            "pos": "noun",
            "sent1": "The census involved the capitations of every person living in the kingdom.",
            "sent2": "Capitations were necessary to determine the population growth of the village.",
            "sent3": "During the game, the players engaged in a friendly capitations contest to see who could count faster.",
            "sent4": "The capitations of attendees at the event revealed a larger turnout than expected.",
            "sent5": "The capitations of students in the classroom showed a decrease in absenteeism."
        }
    ]
}