{
    "term": "capital",
    "meanings": [
        {
            "definition": "The city or town that is the official seat of government in a country or region.",
            "pos": "noun",
            "sent1": "The capital of our country is where the president lives.",
            "sent2": "Washington D.C. is the capital of the United States.",
            "sent3": "I heard a joke about the capital city, but I forgot the punchline.",
            "sent4": "In the game of chess, the king's safety is of capital importance.",
            "sent5": "Visiting the capital during a national holiday is always exciting."
        },
        {
            "definition": "Wealth in the form of money or other assets owned by a person or organization.",
            "pos": "noun",
            "sent1": "She invested all her capital in the new business venture.",
            "sent2": "The company's capital increased significantly after the merger.",
            "sent3": "I dreamt of swimming in a pool of capital coins last night.",
            "sent4": "His knowledge is his capital in the competitive job market.",
            "sent5": "The entrepreneur risked all her capital to start her own company."
        },
        {
            "definition": "The most important city or town of a country or region, usually its seat of government and administrative center.",
            "pos": "noun",
            "sent1": "Paris is known as the capital of fashion.",
            "sent2": "London is the capital of the United Kingdom.",
            "sent3": "The capital of the land of unicorns is said to be magical.",
            "sent4": "New York City is considered the financial capital of the world.",
            "sent5": "The capital of a country often reflects its culture and history."
        },
        {
            "definition": "A letter of the alphabet that is written or printed in larger form.",
            "pos": "noun",
            "sent1": "The teacher wrote the letter 'A' in capital on the board.",
            "sent2": "When writing a title, remember to capitalize the first letter.",
            "sent3": "I always mix up my lowercase and capital letters in handwriting.",
            "sent4": "The sign was written in bold capital letters to grab attention.",
            "sent5": "The book cover had the title in elegant capital font."
        }
    ]
}