{
    "term": "capitalism",
    "meanings": [
        {
            "definition": "An economic system in which private individuals own the means of production and operate for profit.",
            "pos": "noun",
            "sent1": "In capitalism, individuals own businesses to make money.",
            "sent2": "Capitalism allows people to start their own companies and earn profits.",
            "sent3": "The party was a capitalism-themed event where guests traded homemade goods for fun.",
            "sent4": "Her passion for capitalism was like a fire burning bright, driving her to create new businesses.",
            "sent5": "The concept of capitalism can be compared to a game where players strive to earn the most money."
        },
        {
            "definition": "The accumulation of wealth and resources for investment in order to generate profit.",
            "pos": "noun",
            "sent1": "His success in capitalism led to the growth of his savings and investments.",
            "sent2": "Capitalism involves saving money to make more money in the future.",
            "sent3": "The squirrel's capitalism of collecting nuts for winter storage was quite impressive.",
            "sent4": "The idea of capitalism as a money-making machine fueled his ambition to succeed.",
            "sent5": "The image of capitalism as a tree growing money leaves a lasting impression on young minds."
        },
        {
            "definition": "The belief in the importance of private ownership and free market competition.",
            "pos": "noun",
            "sent1": "Her strong belief in capitalism motivated her to support small businesses.",
            "sent2": "Capitalism values competition and individual ownership of property.",
            "sent3": "The penguin's capitalism of claiming its own iceberg made the other animals chuckle.",
            "sent4": "The essence of capitalism as a race to success inspired many entrepreneurs.",
            "sent5": "The teacher used a fun game to explain capitalism to her students, making it easy to understand."
        }
    ]
}