{
    "term": "capitate",
    "meanings": [
        {
            "definition": "Having a head or top",
            "pos": "adjective",
            "sent1": "The tall tree had a capitate crown that stood out in the forest.",
            "sent2": "The chef placed a capitate cherry on top of the cake as decoration.",
            "sent3": "The capitate mountain peak seemed to touch the sky.",
            "sent4": "Her capitate leadership style made her stand out among her peers.",
            "sent5": "The capitate flower at the center of the garden caught everyone's attention."
        },
        {
            "definition": "To form a head or top",
            "pos": "verb",
            "sent1": "The artist carefully capitated the sculpture to give it a distinct shape.",
            "sent2": "The clouds started to capitate, signaling an incoming storm.",
            "sent3": "He tried to capitate the sandcastle, but it kept crumbling.",
            "sent4": "The ideas began to capitate in his mind, forming a clear plan.",
            "sent5": "The water droplets capitated on the leaf, creating a perfect sphere."
        },
        {
            "definition": "A bone in the wrist",
            "pos": "noun",
            "sent1": "The doctor pointed to the capitate bone on the X-ray.",
            "sent2": "She felt a sharp pain in her capitate after the fall.",
            "sent3": "The capitate bone is crucial for wrist movement.",
            "sent4": "He studied the anatomy of the capitate in his medical class.",
            "sent5": "The capitate bone provides stability to the wrist joint."
        },
        {
            "definition": "To come together in a head or top",
            "pos": "verb",
            "sent1": "The clouds started to capitate, forming a dark storm cloud.",
            "sent2": "The ideas began to capitate in his mind, leading to a breakthrough.",
            "sent3": "The group decided to capitate their efforts for a common goal.",
            "sent4": "The team capitated their skills to create an impressive project.",
            "sent5": "The ingredients capitated perfectly to create a delicious dish."
        }
    ]
}