{
    "term": "capo",
    "meanings": [
        {
            "definition": "A device placed on the fingerboard of a guitar to raise the pitch of all the strings at once.",
            "pos": "noun",
            "sent1": "I used a capo to play higher notes on my guitar.",
            "sent2": "The musician placed the capo on the guitar to change the sound.",
            "sent3": "The capo on the guitar felt like a magic tool for music.",
            "sent4": "With the capo on, the guitar sang like a bird in the sky.",
            "sent5": "The capo transformed the guitar into a new instrument."
        },
        {
            "definition": "A leader or chief, especially in a criminal organization.",
            "pos": "noun",
            "sent1": "The capo of the gang made all the decisions.",
            "sent2": "The capo was feared and respected by all in the organization.",
            "sent3": "The capo's tough exterior hid a love for fluffy kittens.",
            "sent4": "The capo ruled the criminal world with an iron fist.",
            "sent5": "The capo's presence commanded authority and obedience."
        },
        {
            "definition": "A detachable cover for an object.",
            "pos": "noun",
            "sent1": "I put the capo on my pen to keep the ink from drying out.",
            "sent2": "The capo protected the fragile object from dust and damage.",
            "sent3": "The capo on the pen was like a tiny shield against accidents.",
            "sent4": "The capo acted as a guardian for the precious item.",
            "sent5": "The capo added a layer of security to the valuable object."
        },
        {
            "definition": "A high-ranking member of the Mafia.",
            "pos": "noun",
            "sent1": "The capo was known for his influence and power in the Mafia.",
            "sent2": "The capo controlled a vast network of criminal activities.",
            "sent3": "The capo's favorite hobby was baking cookies for his crew.",
            "sent4": "The capo's words were as sharp as a knife in the shadows.",
            "sent5": "The capo's presence sent shivers down the spines of his enemies."
        }
    ]
}