{
    "term": "capsules",
    "meanings": [
        {
            "definition": "A small case or container, typically made of gelatin, containing a dose of medicine.",
            "pos": "noun",
            "sent1": "The doctor prescribed two capsules to be taken after breakfast.",
            "sent2": "She always carries her vitamins in a small container of capsules.",
            "sent3": "The capsules rattled in the bottle like tiny maracas.",
            "sent4": "His words were like capsules of wisdom, easy to swallow but full of meaning.",
            "sent5": "The capsules gleamed under the bright lights of the pharmacy, promising relief."
        },
        {
            "definition": "A small, soluble case of gelatin containing a liquid for use in a capsule gun.",
            "pos": "noun",
            "sent1": "The soldier loaded the capsules into the capsule gun before the training exercise.",
            "sent2": "The capsules dissolved quickly in the water, releasing a burst of color.",
            "sent3": "The kids had a water fight using capsules instead of water balloons.",
            "sent4": "The capsules shot out of the gun like tiny rockets, surprising everyone.",
            "sent5": "The capsule gun was a fun toy, shooting colorful capsules across the yard."
        },
        {
            "definition": "A small, soluble case of gelatin containing a liquid for use in a capsule gun.",
            "pos": "noun",
            "sent1": "The capsule gun malfunctioned, causing the capsules to leak out.",
            "sent2": "The capsules were carefully loaded into the gun for the demonstration.",
            "sent3": "The teacher used capsules in the science experiment to demonstrate chemical reactions.",
            "sent4": "The capsules in the gun reminded him of tiny submarines ready to launch.",
            "sent5": "The children were amazed by the capsules shooting out of the gun, creating a colorful display."
        }
    ]
}