{
    "term": "caps",
    "meanings": [
        {
            "definition": "A type of head covering",
            "pos": "noun",
            "sent1": "I wear my favorite CAPS to keep my head warm in winter.",
            "sent2": "The baseball players wore their team CAPS during the game.",
            "sent3": "The CAPS flew off in the strong wind, making everyone laugh.",
            "sent4": "Her collection of colorful CAPS was a rainbow on the shelf.",
            "sent5": "The shiny CAPS sparkled under the bright sun."
        },
        {
            "definition": "To cover or seal something",
            "pos": "verb",
            "sent1": "Please CAPS the bottle tightly to prevent any leaks.",
            "sent2": "She decided to CAPS the jar of jam before putting it in the fridge.",
            "sent3": "He tried to CAPS the secret with a joke, but we all knew.",
            "sent4": "The darkness CAPS the city as night falls.",
            "sent5": "The snow CAPS the mountain peaks in a blanket of white."
        },
        {
            "definition": "The top part of a mushroom",
            "pos": "noun",
            "sent1": "The chef carefully removed the CAPS of the mushrooms before cooking.",
            "sent2": "The mushroom's CAPS were a rich brown color.",
            "sent3": "The tiny CAPS of the mushrooms looked like little umbrellas.",
            "sent4": "The CAPS of the mushrooms held the spores ready to spread.",
            "sent5": "The CAPS of the mushrooms opened up like delicate flowers."
        },
        {
            "definition": "To surpass or exceed something",
            "pos": "verb",
            "sent1": "Her skills in math CAPS those of her classmates.",
            "sent2": "The new movie's box office earnings CAPS all expectations.",
            "sent3": "The student's grades always manage to CAPS the previous semester.",
            "sent4": "His determination to succeed CAPS any obstacles in his way.",
            "sent5": "The athlete's speed CAPS that of all his competitors."
        }
    ]
}