{
    "term": "capsule",
    "meanings": [
        {
            "definition": "A small container or envelope containing medicine or other substances.",
            "pos": "noun",
            "sent1": "The doctor prescribed a capsule for my headache.",
            "sent2": "I always carry a capsule of painkillers in my bag.",
            "sent3": "The capsule rattled in the bottle like a tiny maraca.",
            "sent4": "Her words were like a capsule of wisdom, easy to swallow and remember.",
            "sent5": "The capsule was as small as a ladybug, but it held powerful medicine."
        },
        {
            "definition": "A small, soluble gelatin container used for enclosing a dose of medicine.",
            "pos": "noun",
            "sent1": "I find it easier to swallow a capsule than a tablet.",
            "sent2": "The pharmacist recommended the liquid form instead of the capsule.",
            "sent3": "The capsule wobbled on the spoon like a tiny jelly dessert.",
            "sent4": "Her laughter burst out of her like a capsule of joy.",
            "sent5": "The capsule dissolved in water, releasing its healing contents."
        },
        {
            "definition": "A small, compact structure enclosing an organ or part of an organism.",
            "pos": "noun",
            "sent1": "The protective capsule around the seed kept it safe.",
            "sent2": "The eye is surrounded by a protective capsule called the sclera.",
            "sent3": "The capsule of the acorn cracked open, revealing new life inside.",
            "sent4": "Her heart felt like it was encased in a protective capsule.",
            "sent5": "The capsule around the delicate flower bud kept it from harm."
        },
        {
            "definition": "A small, compact vehicle or spacecraft.",
            "pos": "noun",
            "sent1": "The astronauts boarded the capsule for their space mission.",
            "sent2": "The capsule landed softly in the ocean after reentry.",
            "sent3": "The capsule zoomed through space like a tiny shooting star.",
            "sent4": "His sports car was like a sleek capsule speeding down the highway.",
            "sent5": "The capsule soared through the sky, leaving a trail of fire behind."
        }
    ]
}