{
    "term": "captivities",
    "meanings": [
        {
            "definition": "The state of being held captive or imprisoned.",
            "pos": "noun",
            "sent1": "During their captivities, the animals were kept in small cages.",
            "sent2": "The captivities of the soldiers lasted for months in the enemy camp.",
            "sent3": "The captivities of the mischievous kittens in the laundry room led to a messy situation.",
            "sent4": "Her captivities in the boring office job felt like being trapped in a never-ending cycle.",
            "sent5": "The captivities of the characters in the book painted a vivid picture of their struggles."
        },
        {
            "definition": "The condition of being under someone else's control or influence.",
            "pos": "noun",
            "sent1": "The captivities of the students by the strict teacher made them follow all the rules.",
            "sent2": "She felt the captivities of society's expectations weighing heavily on her.",
            "sent3": "The captivities of the puppy to his favorite toy were adorable to watch.",
            "sent4": "His captivities to his fears held him back from pursuing his dreams.",
            "sent5": "The captivities of the employees to their demanding boss were evident in their actions."
        },
        {
            "definition": "The act of capturing or taking someone prisoner.",
            "pos": "noun",
            "sent1": "The captivities of the criminals by the police were swift and efficient.",
            "sent2": "The captivities of the explorers by the enemy tribe were unexpected.",
            "sent3": "The captivities of the cookies by the kids from the cookie jar were discovered too late.",
            "sent4": "The captivities of the spy by the enemy agents led to valuable information being leaked.",
            "sent5": "The captivities of the rare bird by the researchers allowed for important scientific study."
        }
    ]
}