{
    "term": "caput",
    "meanings": [
        {
            "definition": "The head of a person or animal.",
            "pos": "noun",
            "sent1": "She gently patted her caput to show affection.",
            "sent2": "The caput houses the brain, eyes, and mouth.",
            "sent3": "The caput of the family, the dog, always gets the most attention.",
            "sent4": "His caput was filled with knowledge and wisdom.",
            "sent5": "The caput is crucial for sensing the world around us."
        },
        {
            "definition": "The top or highest point of something.",
            "pos": "noun",
            "sent1": "The mountain's caput was covered in snow.",
            "sent2": "The caput of the tree reached towards the sky.",
            "sent3": "The caput of the tower seemed to touch the clouds.",
            "sent4": "At the caput of the hill, you could see for miles.",
            "sent5": "The caput of the flagpole waved proudly in the wind."
        },
        {
            "definition": "A leader or chief.",
            "pos": "noun",
            "sent1": "The wise owl was considered the caput of the forest animals.",
            "sent2": "The caput of the tribe made important decisions.",
            "sent3": "The caput of the team always led by example.",
            "sent4": "As the caput of the company, she guided it to success.",
            "sent5": "The caput of the council was respected by all."
        },
        {
            "definition": "The main or central part of something.",
            "pos": "noun",
            "sent1": "The caput of the book contained the most exciting plot twists.",
            "sent2": "In the caput of the city, you can find all the major attractions.",
            "sent3": "The caput of the problem was finally identified.",
            "sent4": "Her caput was filled with creative ideas.",
            "sent5": "The caput of the flower held the sweetest nectar."
        }
    ]
}