{
    "term": "carbureted",
    "meanings": [
        {
            "definition": "(verb) to mix air and fuel in a carburetor for use in an internal combustion engine",
            "pos": "verb",
            "sent1": "He carefully carbureted the mixture to ensure the engine would run smoothly.",
            "sent2": "The mechanic carbureted the fuel before starting the car.",
            "sent3": "The chef carbureted the ingredients in the blender, creating a delicious smoothie.",
            "sent4": "She carbureted her thoughts with creativity, preparing for the upcoming presentation.",
            "sent5": "The gardener carbureted the soil with nutrients, helping the plants grow strong."
        },
        {
            "definition": "(adjective) equipped with a carburetor for fuel delivery",
            "pos": "adjective",
            "sent1": "The old truck was carbureted, unlike the newer models with fuel injection.",
            "sent2": "The carbureted motorcycle roared to life as he revved the engine.",
            "sent3": "The carbureted lawnmower sputtered to a start, ready to tackle the overgrown grass.",
            "sent4": "She preferred the carbureted car for its classic feel and simplicity.",
            "sent5": "The carbureted boat glided smoothly across the lake, powered by its reliable engine."
        },
        {
            "definition": "(noun) a device used in older vehicles to mix air and fuel before entering the engine",
            "pos": "noun",
            "sent1": "The mechanic inspected the carbureted to ensure it was functioning properly.",
            "sent2": "The classic car's carbureted was a key component of its vintage design.",
            "sent3": "He accidentally dropped a tool into the carbureted, causing a minor delay in repairs.",
            "sent4": "The carbureted of the antique vehicle required regular maintenance to keep it running smoothly.",
            "sent5": "The old truck's carbureted was a reminder of automotive technology from a bygone era."
        }
    ]
}