{
    "term": "carbonize",
    "meanings": [
        {
            "definition": "To convert or be converted into carbon.",
            "pos": "verb",
            "sent1": "After the fire, the wood began to carbonize and turn into charcoal.",
            "sent2": "The scientist studied how different materials carbonize when exposed to high temperatures.",
            "sent3": "The chef accidentally left the bread in the oven too long, causing it to carbonize and become inedible.",
            "sent4": "The intense heat of the sun seemed to slowly carbonize the plastic toys left outside.",
            "sent5": "The ancient civilization used a special technique to carbonize wood for building structures."
        },
        {
            "definition": "To char or burn (organic matter) so as to leave a carbon residue.",
            "pos": "verb",
            "sent1": "The campfire was so hot that it started to carbonize the marshmallows on the sticks.",
            "sent2": "The blacksmith would carefully carbonize the metal to create intricate designs.",
            "sent3": "The clumsy chef managed to carbonize the entire pot of soup, much to the amusement of the restaurant staff.",
            "sent4": "The wildfire had the power to carbonize entire forests, leaving behind only ash and charcoal.",
            "sent5": "The volcanic eruption was so intense that it could carbonize anything in its path within seconds."
        },
        {
            "definition": "To subject (organic matter) to destructive distillation.",
            "pos": "verb",
            "sent1": "The ancient alchemists would carbonize various substances in their experiments.",
            "sent2": "The factory used a special process to carbonize the raw materials before turning them into products.",
            "sent3": "The magician's trick involved a potion that would mysteriously carbonize objects placed inside.",
            "sent4": "The intense pressure and heat in the earth's core can slowly carbonize rocks over millions of years.",
            "sent5": "The artist used a unique technique to carbonize the canvas, creating a striking visual effect."
        }
    ]
}