{
    "term": "carbonise",
    "meanings": [
        {
            "definition": "To convert or be converted into carbon.",
            "pos": "verb",
            "sent1": "After the fire, the wood began to carbonise, turning into charcoal.",
            "sent2": "If you leave a piece of bread in the toaster for too long, it will carbonise and become blackened.",
            "sent3": "The chef accidentally let the steak carbonise on the grill, making it extra crispy.",
            "sent4": "The intense heat of the sun seemed to slowly carbonise the fallen leaves on the ground.",
            "sent5": "The ancient scrolls were so old that they seemed to carbonise at the slightest touch."
        },
        {
            "definition": "To char or burn (organic matter) so as to leave a carbon residue.",
            "pos": "verb",
            "sent1": "The campfire was so hot that it started to carbonise the marshmallows on the sticks.",
            "sent2": "If you forget about the pot on the stove, the food inside will carbonise and create a burnt smell.",
            "sent3": "The baker accidentally let the cookies carbonise in the oven, resulting in a smoky kitchen.",
            "sent4": "The wildfire was so intense that it seemed to carbonise everything in its path.",
            "sent5": "The old newspapers left near the fireplace began to slowly carbonise over time."
        },
        {
            "definition": "To subject (organic matter) to destructive distillation.",
            "pos": "verb",
            "sent1": "The scientist decided to carbonise the wood chips to study the chemical composition.",
            "sent2": "In the laboratory, they would often carbonise various substances to analyze their properties.",
            "sent3": "The students accidentally tried to carbonise the wrong sample, causing a small explosion.",
            "sent4": "The volcanic eruption seemed to carbonise everything in its path, leaving only ash behind.",
            "sent5": "The ancient alchemists believed they could carbonise metals to create new elements."
        }
    ]
}