{
    "term": "careens",
    "meanings": [
        {
            "definition": "To sway or lurch while in motion",
            "pos": "verb",
            "sent1": "The boat careens from side to side in the rough waves.",
            "sent2": "The car careens around the sharp curve on the mountain road.",
            "sent3": "The playful puppy careens around the yard, chasing its tail.",
            "sent4": "Her emotions careen wildly as she watches the intense movie.",
            "sent5": "The dancer careens gracefully across the stage, captivating the audience."
        },
        {
            "definition": "To lean or tip to one side while in motion",
            "pos": "verb",
            "sent1": "The tower careens slightly in the strong wind.",
            "sent2": "The bicycle careens to the left as the rider loses balance.",
            "sent3": "The leaning tree careens towards the fence after the storm.",
            "sent4": "The old bookshelf careens to one side under the weight of the books.",
            "sent5": "The tired hiker careens to the right on the steep trail, trying to keep balance."
        },
        {
            "definition": "To rush headlong or carelessly",
            "pos": "verb",
            "sent1": "The reckless driver careens down the road, endangering others.",
            "sent2": "The excited child careens through the playground, full of energy.",
            "sent3": "The mischievous squirrel careens across the backyard, causing chaos.",
            "sent4": "The enthusiastic student careens through the exam, answering quickly.",
            "sent5": "The busy bee careens from flower to flower, collecting nectar in a hurry."
        },
        {
            "definition": "A sudden change of direction or movement",
            "pos": "noun",
            "sent1": "The unexpected careens of the roller coaster thrilled the riders.",
            "sent2": "The sudden careens of the plot in the movie kept the audience guessing.",
            "sent3": "The surprising careens of the weather made planning difficult.",
            "sent4": "The dramatic careens of the stock market caused panic among investors.",
            "sent5": "The abrupt careens of the conversation left everyone speechless."
        }
    ]
}