{
    "term": "caricatural",
    "meanings": [
        {
            "definition": "Of or relating to caricature.",
            "pos": "adjective",
            "sent1": "The artist created a caricatural drawing of the politician, emphasizing his prominent features.",
            "sent2": "The caricatural portrait captured the essence of the subject's unique characteristics.",
            "sent3": "The caricatural illustration of the teacher made the students giggle.",
            "sent4": "Her exaggerated gestures were so caricatural, they could be seen from across the room.",
            "sent5": "The comedian's caricatural impersonation of the celebrity was a hit with the audience."
        },
        {
            "definition": "Resembling a caricature.",
            "pos": "adjective",
            "sent1": "The actor's over-the-top performance was so caricatural that it felt like a live cartoon.",
            "sent2": "The costume designer created a caricatural outfit that perfectly matched the character's personality.",
            "sent3": "The cake was decorated in a caricatural style, with oversized frosting flowers.",
            "sent4": "Her reaction to the surprise was so caricatural, it seemed like she was acting.",
            "sent5": "The painting's colors were so bright and bold, giving it a caricatural appearance."
        },
        {
            "definition": "Exaggerating or distorting features for comic effect.",
            "pos": "adjective",
            "sent1": "The comedian's caricatural facial expressions had the audience roaring with laughter.",
            "sent2": "The cartoonist's caricatural style added humor to the illustrations.",
            "sent3": "The caricatural voice the actor used in the play had everyone in stitches.",
            "sent4": "Her caricatural walk down the runway brought a playful element to the fashion show.",
            "sent5": "The caricatural mannerisms of the character made the scene unforgettable."
        }
    ]
}