{
    "term": "carnifying",
    "meanings": [
        {
            "definition": "To turn into flesh.",
            "pos": "verb",
            "sent1": "The magic potion slowly started carnifying the wooden doll into a real human.",
            "sent2": "The caterpillar was carnifying into a beautiful butterfly inside the cocoon.",
            "sent3": "The chef's secret ingredient was so powerful that it was carnifying the vegetables into meat!",
            "sent4": "Her love and care seemed to be carnifying his cold heart into something warm and alive.",
            "sent5": "The artist's brush strokes were carnifying the blank canvas into a masterpiece of flesh and color."
        },
        {
            "definition": "To make or become flesh.",
            "pos": "verb",
            "sent1": "The ancient spell was said to have the power to carnify any spirit into a physical form.",
            "sent2": "The healing ointment was believed to have the ability to carnify wounds and promote faster recovery.",
            "sent3": "The scientist's experiment accidentally carnified the plant into a strange, fleshy structure.",
            "sent4": "The sculptor's hands seemed to carnify the cold marble into warm, lifelike statues.",
            "sent5": "The warm sunlight seemed to gently carnify the frost-covered ground into soft, welcoming earth."
        },
        {
            "definition": "To convert into flesh.",
            "pos": "verb",
            "sent1": "The alien technology was able to carnify any object it touched into living tissue.",
            "sent2": "The ancient ritual was believed to have the power to carnify the spirits of the departed into physical bodies.",
            "sent3": "The wizard's spell accidentally carnified the stone statue into a living, breathing creature.",
            "sent4": "The mysterious potion was rumored to be able to carnify dreams into tangible, flesh-like forms.",
            "sent5": "The sacred river was said to have the ability to carnify any offerings into real flesh and blood."
        }
    ]
}