{
    "term": "carnivorousness",
    "meanings": [
        {
            "definition": "The quality or state of being carnivorous.",
            "pos": "noun",
            "sent1": "Her carnivorousness was evident in her preference for meat over vegetables.",
            "sent2": "The lion's carnivorousness led it to hunt for prey in the wild.",
            "sent3": "The party's carnivorousness for snacks was unmatched as they devoured the entire buffet.",
            "sent4": "His eyes gleamed with carnivorousness as he spotted the juicy steak on the grill.",
            "sent5": "The image of the wolf's carnivorousness stayed with her long after the nature documentary ended."
        },
        {
            "definition": "The behavior or characteristic of consuming meat.",
            "pos": "noun",
            "sent1": "The bear's carnivorousness was evident as it caught a fish from the river.",
            "sent2": "In the wild, the tiger's carnivorousness is crucial for its survival.",
            "sent3": "The cat's carnivorousness was on full display as it pounced on the mouse.",
            "sent4": "The restaurant's carnivorousness for quality meat dishes attracted meat lovers from far and wide.",
            "sent5": "The shark's carnivorousness was a sight to behold as it swiftly devoured its prey."
        },
        {
            "definition": "The trait of being a meat-eater.",
            "pos": "noun",
            "sent1": "The cheetah's carnivorousness made it a formidable predator on the savannah.",
            "sent2": "The hawk's carnivorousness was evident as it swooped down to catch its prey.",
            "sent3": "The dog's carnivorousness was apparent when it eagerly devoured its food.",
            "sent4": "The tribe's carnivorousness was a key aspect of their hunting and gathering lifestyle.",
            "sent5": "The crocodile's carnivorousness was on full display as it snapped its jaws shut on the unsuspecting prey."
        }
    ]
}