{
    "term": "carn",
    "meanings": [
        {
            "definition": "Flesh",
            "pos": "noun",
            "sent1": "The lion's powerful jaws tore into the carn of its prey.",
            "sent2": "The butcher displayed various types of carn at the market.",
            "sent3": "The chef's secret to tender meat is marinating the carn overnight.",
            "sent4": "The artist sculpted the human form from cold, hard carn of marble.",
            "sent5": "The smell of cooked carn wafted through the kitchen, making everyone hungry."
        },
        {
            "definition": "Meat",
            "pos": "noun",
            "sent1": "Grilling carn on a barbecue is a popular summer activity.",
            "sent2": "The restaurant served a delicious dish made with exotic carn.",
            "sent3": "The comedian joked that he loved his steak so rare, it was practically still moving carn.",
            "sent4": "The coach advised the athletes to eat protein-rich carn for muscle recovery.",
            "sent5": "The aroma of sizzling carn filled the air, making mouths water."
        },
        {
            "definition": "Corpse",
            "pos": "noun",
            "sent1": "The detective examined the carn to gather clues about the crime.",
            "sent2": "In horror movies, the carn often comes back to life as a zombie.",
            "sent3": "The haunted house was filled with eerie sounds of moving carn.",
            "sent4": "The graveyard was silent, except for the occasional rustle of carn.",
            "sent5": "The ghostly figure hovered over the carn, seeking revenge."
        },
        {
            "definition": "Reincarnation",
            "pos": "noun",
            "sent1": "Many believe in the concept of carn, where the soul is reborn.",
            "sent2": "The spiritual leader spoke about the cycle of life and carn.",
            "sent3": "The idea of carn fascinated the young girl, who wondered if she had lived before.",
            "sent4": "The ancient myth spoke of gods who could control the process of carn.",
            "sent5": "The philosopher pondered the mysteries of carn and the afterlife."
        },
        {
            "definition": "Carnivore",
            "pos": "noun",
            "sent1": "The tiger is a fierce carn that hunts for its food.",
            "sent2": "A lion is a well-known example of a powerful carn in the wild.",
            "sent3": "The documentary showcased the hunting skills of various carns in the jungle.",
            "sent4": "The zookeeper fed the hungry carns their daily meal of raw meat.",
            "sent5": "The pack of carns roamed the savannah, searching for their next meal."
        }
    ]
}