{
    "term": "carpetbagger",
    "meanings": [
        {
            "definition": "A person who moves to a new region for political or financial gain.",
            "pos": "noun",
            "sent1": "The carpetbagger arrived in town hoping to gain power and money.",
            "sent2": "The carpetbagger ran for office in a place where they had never lived before.",
            "sent3": "The carpetbagger thought they could make a quick buck by moving to a different city.",
            "sent4": "The carpetbagger's arrival was like a storm, stirring up both excitement and suspicion.",
            "sent5": "The image of the carpetbagger sneaking into town stuck in everyone's minds."
        },
        {
            "definition": "A political candidate who seeks election in an area where they have no local connections.",
            "pos": "noun",
            "sent1": "The carpetbagger campaigned tirelessly in the unfamiliar town.",
            "sent2": "The locals were skeptical of the carpetbagger running for mayor.",
            "sent3": "The carpetbagger's attempt to win over the voters with cookies backfired comically.",
            "sent4": "The carpetbagger's presence in the election was like a puzzle to the townspeople.",
            "sent5": "The image of the carpetbagger knocking on doors became a symbol of the election season."
        },
        {
            "definition": "A person who seeks to profit from a situation without concern for the consequences.",
            "pos": "noun",
            "sent1": "The carpetbagger saw an opportunity to make money and jumped at it.",
            "sent2": "The company hired a carpetbagger to exploit a legal loophole.",
            "sent3": "The carpetbagger's plan to cut corners led to a hilarious disaster.",
            "sent4": "The carpetbagger's actions were like a ticking time bomb waiting to explode.",
            "sent5": "The image of the carpetbagger scheming in the shadows was unsettling to many."
        }
    ]
}