{
    "term": "carrier",
    "meanings": [
        {
            "definition": "A person or thing that carries or transports something.",
            "pos": "noun",
            "sent1": "The strong carrier lifted the heavy boxes effortlessly.",
            "sent2": "The delivery carrier dropped off the package at the doorstep.",
            "sent3": "The carrier ant worked tirelessly to move food to its nest.",
            "sent4": "Her smile was a carrier of joy to everyone around her.",
            "sent5": "The river acted as a carrier, carrying logs downstream."
        },
        {
            "definition": "A company that provides transportation services.",
            "pos": "noun",
            "sent1": "The carrier offered affordable shipping rates for businesses.",
            "sent2": "The airline carrier had flights to various destinations.",
            "sent3": "The carrier's logo was a cute cartoon character.",
            "sent4": "Their reputation as a reliable carrier spread quickly.",
            "sent5": "The carrier's trucks were always on time for pickups."
        },
        {
            "definition": "A substance that carries a disease or infection without displaying symptoms.",
            "pos": "noun",
            "sent1": "The mosquito acted as a carrier of the deadly virus.",
            "sent2": "The carrier of the flu unknowingly spread it to others.",
            "sent3": "The carrier pigeon delivered secret messages during the war.",
            "sent4": "The carrier of the illness was identified and isolated.",
            "sent5": "The carrier of the infection was traced back to the source."
        },
        {
            "definition": "A signal that carries information.",
            "pos": "noun",
            "sent1": "The radio waves served as the carrier for the broadcast.",
            "sent2": "The carrier frequency was crucial for clear communication.",
            "sent3": "The carrier of the news was excited to share the update.",
            "sent4": "The carrier wave transmitted data across the network.",
            "sent5": "The carrier signal carried the instructions to the device."
        }
    ]
}