{
    "term": "carry",
    "meanings": [
        {
            "definition": "To support the weight of something and move it from one place to another.",
            "pos": "verb",
            "sent1": "I carry the heavy box to the car.",
            "sent2": "She carries her backpack to school every day.",
            "sent3": "Why did the ant carry the leaf on its back?",
            "sent4": "Her determination carries her through difficult times.",
            "sent5": "The crane carries the load effortlessly."
        },
        {
            "definition": "To have something with you as you go from one place to another.",
            "pos": "verb",
            "sent1": "He likes to carry his favorite book wherever he goes.",
            "sent2": "Do you always carry an umbrella in your bag?",
            "sent3": "The squirrel carries nuts in its cheeks for later.",
            "sent4": "Her smile carries a sense of warmth wherever she goes.",
            "sent5": "The scent of flowers carries memories of spring."
        },
        {
            "definition": "To transport or convey something from one place to another.",
            "pos": "verb",
            "sent1": "The truck will carry the goods to the warehouse.",
            "sent2": "The river carries debris downstream after the storm.",
            "sent3": "The wind can carry the sound of laughter for miles.",
            "sent4": "His words carry a message of hope to those in need.",
            "sent5": "The current carries the boat gently along the stream."
        },
        {
            "definition": "To hold or support something while moving it.",
            "pos": "verb",
            "sent1": "Please carry the vase carefully to the table.",
            "sent2": "She carries the tray of drinks without spilling any.",
            "sent3": "The cat carries her kittens one by one to a new hiding spot.",
            "sent4": "His steady hands carry the fragile glassware safely.",
            "sent5": "The basket carries the weight of the fruits without breaking."
        },
        {
            "definition": "To have a particular quality or feature.",
            "pos": "verb",
            "sent1": "His stories always carry a sense of adventure.",
            "sent2": "The painting carries a feeling of tranquility.",
            "sent3": "The song carries a catchy tune that sticks in your head.",
            "sent4": "Her dress carries an elegant design that catches everyone's eye.",
            "sent5": "The dish carries a unique blend of flavors that surprise the taste buds."
        }
    ]
}