{
    "term": "carryons",
    "meanings": [
        {
            "definition": "Small luggage that can be carried onto a plane.",
            "pos": "noun",
            "sent1": "I always pack my essentials in my carryons when I travel.",
            "sent2": "The flight attendant reminded passengers to stow their carryons in the overhead bins.",
            "sent3": "The little girl's teddy bear was too big for her carryons, so she had to leave it behind.",
            "sent4": "Her carryons were like tiny treasure chests filled with memories from her adventures.",
            "sent5": "The bright red carryons stood out among the sea of black suitcases at the airport."
        },
        {
            "definition": "The act of carrying on or continuing an activity.",
            "pos": "noun",
            "sent1": "His carryons of singing in the shower often annoyed his roommates.",
            "sent2": "Despite the rain, the team's carryons of the soccer game lifted everyone's spirits.",
            "sent3": "The carryons of the squirrel trying to steal nuts from the bird feeder provided endless entertainment.",
            "sent4": "Her carryons of telling jokes at the office made her the unofficial comedian of the team.",
            "sent5": "The carryons of the clock ticking in the silent room seemed louder than ever."
        },
        {
            "definition": "Items that are carried on one's person.",
            "pos": "noun",
            "sent1": "She always kept her important carryons like keys and wallet in her pockets.",
            "sent2": "The hiker's carryons included a map, a compass, and a flashlight.",
            "sent3": "The magician's trick involved making his carryons disappear and reappear in different places.",
            "sent4": "His carryons of snacks in his backpack were a lifesaver during the long hike.",
            "sent5": "The detective carefully examined the victim's carryons for any clues to the crime."
        }
    ]
}