{
    "term": "cartouche",
    "meanings": [
        {
            "definition": "A carved tablet or drawing representing a scroll with rolled-up ends, used ornamentally or bearing an inscription.",
            "pos": "noun",
            "sent1": "The ancient artifact displayed a beautiful cartouche with intricate designs.",
            "sent2": "The museum showcased a cartouche from ancient Egypt with hieroglyphics inscribed on it.",
            "sent3": "The cartouche on the wall seemed to wink at the visitors, as if sharing a secret message.",
            "sent4": "Her tattoo resembled a cartouche, with swirling patterns wrapping around her arm like a scroll.",
            "sent5": "The cartouche on the monument stood out, drawing attention with its elaborate carvings."
        },
        {
            "definition": "A protective case for holding a roll of film in a camera.",
            "pos": "noun",
            "sent1": "The photographer carefully placed the film roll in the cartouche to protect it from light.",
            "sent2": "She always carried an extra cartouche to keep her camera film safe during travels.",
            "sent3": "The cartouche for the film roll looked like a tiny house for the memories captured.",
            "sent4": "His camera bag held a magical cartouche that safeguarded the precious film inside.",
            "sent5": "The cartouche shielded the film from harm, preserving moments frozen in time."
        },
        {
            "definition": "A decorative panel or tablet bearing an inscription or design.",
            "pos": "noun",
            "sent1": "The ornate cartouche on the wall added elegance to the room's decor.",
            "sent2": "The artist engraved a meaningful quote on the cartouche, making it a unique piece of art.",
            "sent3": "The cartouche on the door seemed to whisper words of welcome to all who entered.",
            "sent4": "Her necklace pendant resembled a cartouche, with a delicate pattern etched on it.",
            "sent5": "The cartouche on the award plaque gleamed under the spotlight, showcasing the winner's name."
        }
    ]
}