{
    "term": "caryatids",
    "meanings": [
        {
            "definition": "Caryatids: sculpted female figures serving as architectural support",
            "pos": "noun",
            "sent1": "The caryatids stood gracefully, holding up the roof with their outstretched arms.",
            "sent2": "The ancient temple was adorned with intricate caryatids supporting the grand structure.",
            "sent3": "The caryatids seemed to chat with each other as they held up the heavy building.",
            "sent4": "The caryatids bore the weight of the world on their shoulders, a symbol of strength and beauty.",
            "sent5": "Visitors marveled at the caryatids, their delicate features frozen in time."
        },
        {
            "definition": "Caryatids: a group of caryatids used to support a structure",
            "pos": "noun",
            "sent1": "The majestic building was held up by a row of caryatids, each one playing a vital role.",
            "sent2": "Tourists admired the row of caryatids that formed a strong foundation for the ancient palace.",
            "sent3": "The caryatids took turns supporting the structure, like a team of silent helpers.",
            "sent4": "The caryatids stood together in unity, embodying the strength of teamwork.",
            "sent5": "The caryatids worked in harmony, their collective effort keeping the building steady."
        },
        {
            "definition": "Caryatids: the caryatids were beautifully carved and added elegance to the building",
            "pos": "noun",
            "sent1": "Each caryatid was a masterpiece of art, enhancing the beauty of the entire structure.",
            "sent2": "The caryatids' intricate details brought a touch of sophistication to the plain building.",
            "sent3": "Passersby couldn't help but smile at the charming caryatids adorning the facade.",
            "sent4": "The caryatids seemed to dance in the moonlight, their grace captivating all who saw them.",
            "sent5": "The caryatids glowed in the sunlight, casting a magical aura over the entire building."
        }
    ]
}