{
    "term": "casco",
    "meanings": [
        {
            "definition": "A protective head covering worn for safety.",
            "pos": "noun",
            "sent1": "I always wear my casco when riding my bike.",
            "sent2": "The construction worker put on his casco before entering the site.",
            "sent3": "The squirrel found a tiny casco and pretended to be a knight.",
            "sent4": "Her casco of confidence shielded her from criticism.",
            "sent5": "The shiny casco gleamed under the sun, a symbol of protection."
        },
        {
            "definition": "The hard outer covering of a nut or seed.",
            "pos": "noun",
            "sent1": "The casco of the walnut cracked open easily.",
            "sent2": "She carefully removed the casco of the almond before eating it.",
            "sent3": "The squirrel struggled to crack the tough casco of the hazelnut.",
            "sent4": "The acorn's casco protected the seed inside like armor.",
            "sent5": "The casco of the coconut was difficult to break, hiding the delicious flesh within."
        },
        {
            "definition": "The shell of a crustacean or mollusk.",
            "pos": "noun",
            "sent1": "The hermit crab searched for a new casco to call home.",
            "sent2": "The lobster's casco was hard and spiky for protection.",
            "sent3": "The snail carried its casco on its back wherever it went.",
            "sent4": "The crab's casco blended perfectly with the sandy ocean floor.",
            "sent5": "The colorful casco of the seashell caught the eye of the beachcomber."
        },
        {
            "definition": "The upper part of a ship's hull.",
            "pos": "noun",
            "sent1": "The waves crashed against the casco of the ship.",
            "sent2": "The sailors painted the casco of the vessel to prevent rust.",
            "sent3": "The pirate captain stood proudly on the casco of his ship.",
            "sent4": "The casco of the boat creaked as it sailed through the rough sea.",
            "sent5": "The intricate carvings on the casco of the galleon told stories of its voyages."
        },
        {
            "definition": "A helmet worn for riding a motorcycle or bicycle.",
            "pos": "noun",
            "sent1": "Before going for a ride, make sure to wear your casco.",
            "sent2": "The cyclist adjusted the straps on his casco before starting the race.",
            "sent3": "The raccoon tried to wear a tiny casco while riding a toy bike.",
            "sent4": "Her casco of protection made her feel invincible on the road.",
            "sent5": "The sleek design of the casco made the rider look like a futuristic warrior."
        }
    ]
}