{
    "term": "cassino",
    "meanings": [
        {
            "definition": "A card game in which cards are laid out in a pattern and players try to match pairs.",
            "pos": "noun",
            "sent1": "During the family game night, we played cassino and tried to find matching cards.",
            "sent2": "At the party, they set up a table for cassino, and everyone enjoyed playing.",
            "sent3": "The cassino game got so competitive that even the quietest player started cheering.",
            "sent4": "Her memory was like a game of cassino, trying to match the pairs of information.",
            "sent5": "The colorful cards in cassino made it easy to remember which ones matched."
        },
        {
            "definition": "A building or room used for social gatherings, typically for gambling.",
            "pos": "noun",
            "sent1": "The luxurious cassino in town attracted many visitors looking to try their luck.",
            "sent2": "In Las Vegas, the cassino was filled with the sound of slot machines and laughter.",
            "sent3": "The cassino was so fancy that even the chandeliers seemed to sparkle with excitement.",
            "sent4": "Her smile lit up the room like the lights in a bustling cassino.",
            "sent5": "The atmosphere in the cassino was electric, with people hoping for a lucky night."
        },
        {
            "definition": "A military fortification or defensive position.",
            "pos": "noun",
            "sent1": "The soldiers fortified the cassino to protect it from enemy attacks.",
            "sent2": "The cassino on the hill provided a strategic advantage during the battle.",
            "sent3": "The enemy's attempt to breach the cassino was met with strong resistance.",
            "sent4": "The cassino stood like a guardian, shielding the troops from harm.",
            "sent5": "The view from the cassino allowed the soldiers to see any approaching threats."
        }
    ]
}