{
    "term": "castes",
    "meanings": [
        {
            "definition": "A social class in Hindu society",
            "pos": "noun",
            "sent1": "In some countries, people are divided into different castes based on their family background.",
            "sent2": "The Indian caste system has four main castes: Brahmins, Kshatriyas, Vaishyas, and Shudras.",
            "sent3": "At the costume party, each friend dressed up as a different caste, creating a fun mix of characters.",
            "sent4": "The castes in society are like distinct colors on a painter's palette, each contributing to the overall picture.",
            "sent5": "The concept of castes helps to understand the social structure in ancient civilizations."
        },
        {
            "definition": "A system of dividing society into hereditary classes",
            "pos": "noun",
            "sent1": "The caste system in India has been a long-standing tradition that divides society into different groups.",
            "sent2": "Historically, the castes were determined by birth and were difficult to change.",
            "sent3": "The idea of castes in society is like organizing people into different teams based on their ancestors.",
            "sent4": "The rigid division of castes can sometimes create barriers between individuals.",
            "sent5": "Learning about the castes in different cultures can be fascinating and eye-opening."
        },
        {
            "definition": "To assign a role or occupation to someone",
            "pos": "verb",
            "sent1": "The teacher will castes each student a specific role in the school play.",
            "sent2": "It is important for a manager to castes tasks effectively to team members.",
            "sent3": "During the game, the coach decided to castes each player a different position to try.",
            "sent4": "The director will castes the lead role to the most talented actor in the audition.",
            "sent5": "The company will castes new employees to different departments based on their skills."
        },
        {
            "definition": "To throw something forcefully",
            "pos": "verb",
            "sent1": "The pitcher castes the ball with great speed towards home plate.",
            "sent2": "She castes the stone into the pond, creating ripples on the water's surface.",
            "sent3": "The angry child decided to castes his toys across the room in a fit of frustration.",
            "sent4": "The magician will castes the playing cards into the audience during the show.",
            "sent5": "The fisherman castes his net into the river to catch fresh fish for dinner."
        },
        {
            "definition": "To form an object by pouring material into a mold",
            "pos": "verb",
            "sent1": "The artist will castes a beautiful sculpture using molten metal in the foundry.",
            "sent2": "They castes the concrete into the shape of a statue for the city park.",
            "sent3": "The chef will castes the chocolate into heart-shaped molds for Valentine's Day treats.",
            "sent4": "The jeweler will castes the gold into intricate designs for the new collection.",
            "sent5": "The craftsman castes the pottery with precision to create unique ceramic pieces."
        }
    ]
}