{
    "term": "castellated",
    "meanings": [
        {
            "definition": "Having battlements like a castle.",
            "pos": "adjective",
            "sent1": "The old fortress had a castellated appearance with its tall walls and battlements.",
            "sent2": "The castellated tower stood proudly at the entrance of the medieval town.",
            "sent3": "The children built a sandcastle with castellated edges, pretending it was a grand palace.",
            "sent4": "Her hair, styled in a castellated bun, resembled the turrets of a fairy-tale castle.",
            "sent5": "The artist painted a castellated landscape, capturing the majestic beauty of the ancient castle."
        },
        {
            "definition": "To build or fortify with battlements.",
            "pos": "verb",
            "sent1": "The king ordered his men to castellate the city walls to protect against invaders.",
            "sent2": "The architects planned to castellate the tower to give it a more imposing look.",
            "sent3": "The chef decided to castellate the cake by adding decorative battlements made of icing.",
            "sent4": "The general's strategy was to castellate the borders to secure the kingdom from enemy attacks.",
            "sent5": "The workers began to castellate the fortress, adding sturdy walls and protective towers."
        },
        {
            "definition": "A structure with battlements, typically a castle.",
            "pos": "noun",
            "sent1": "The ancient ruins of the castellated stood as a reminder of the kingdom's former glory.",
            "sent2": "Visitors marveled at the grandeur of the castellated perched on the hill.",
            "sent3": "The children played make-believe in the old castellated, imagining themselves as brave knights.",
            "sent4": "The silhouette of the castellated against the sunset was a sight to behold.",
            "sent5": "The travelers approached the castellated, eager to explore its hidden chambers and winding corridors."
        }
    ]
}