{
    "term": "castor",
    "meanings": [
        {
            "definition": "A beaver-like aquatic rodent with webbed hind feet and a broad flat tail.",
            "pos": "noun",
            "sent1": "The castor built a dam in the river to create a safe home for its family.",
            "sent2": "I saw a castor swimming gracefully in the pond near my house.",
            "sent3": "The castor chuckled as it splashed water on its siblings during playtime.",
            "sent4": "The castor's tail moved like a paddle, propelling it swiftly through the water.",
            "sent5": "The castor's fur glistened in the sunlight as it emerged from the river."
        },
        {
            "definition": "A small wheel or roller on the bottom of a piece of furniture.",
            "pos": "noun",
            "sent1": "The chair's castor made it easy to move around the room without scratching the floor.",
            "sent2": "I replaced the broken castor on the table to ensure it could be moved smoothly.",
            "sent3": "The castor on the cabinet squeaked loudly whenever someone tried to push it.",
            "sent4": "The castor on the bed rolled silently, allowing the cat to hide underneath undisturbed.",
            "sent5": "The castor on the desk glided effortlessly as I rearranged the room."
        },
        {
            "definition": "A dark, strong-smelling oil obtained from the castor bean.",
            "pos": "noun",
            "sent1": "The castor oil was used in traditional medicine to soothe various ailments.",
            "sent2": "I added a few drops of castor oil to the mixture for its beneficial properties.",
            "sent3": "The strong scent of castor oil filled the room, making everyone wrinkle their noses.",
            "sent4": "The castor oil acted as a protective barrier, shielding the skin from harsh weather.",
            "sent5": "The bottle of castor oil stood out on the shelf with its distinctive aroma."
        }
    ]
}