{
    "term": "castoff",
    "meanings": [
        {
            "definition": "Something that has been discarded or rejected.",
            "pos": "noun",
            "sent1": "The old toy was a castoff that nobody wanted anymore.",
            "sent2": "The castoff clothes were donated to charity.",
            "sent3": "The castoff book found a new home on the library shelf.",
            "sent4": "The castoff furniture filled the yard sale with memories.",
            "sent5": "The castoff shoes lay forgotten in the corner of the room."
        },
        {
            "definition": "A person or thing that has been abandoned or left behind.",
            "pos": "noun",
            "sent1": "The lonely teddy bear became a castoff in the attic.",
            "sent2": "The castoff from the group felt a pang of sadness.",
            "sent3": "The castoff puppy wagged its tail, hoping for a new friend.",
            "sent4": "The castoff shipwreck stood as a silent reminder of the past.",
            "sent5": "The castoff key jingled in the bottom of the drawer."
        },
        {
            "definition": "To get rid of or discard something.",
            "pos": "verb",
            "sent1": "She decided to castoff the broken vase.",
            "sent2": "They castoff their worries and embraced the moment.",
            "sent3": "He tried to castoff his bad habits but found it difficult.",
            "sent4": "The decision to castoff the old ways brought a sense of freedom.",
            "sent5": "The urge to castoff the past grew stronger with each passing day."
        },
        {
            "definition": "To throw or toss something away.",
            "pos": "verb",
            "sent1": "He would castoff his troubles into the sea of forgetfulness.",
            "sent2": "She castoff the paper airplane and watched it soar.",
            "sent3": "The magician would castoff his cape in a dramatic flourish.",
            "sent4": "The chef would castoff the ingredients into the sizzling pan.",
            "sent5": "The child would castoff the worries like a kite in the wind."
        }
    ]
}