{
    "term": "cast",
    "meanings": [
        {
            "definition": "Throw forcefully in a specified direction.",
            "pos": "verb",
            "sent1": "He cast the ball towards the goal with all his might.",
            "sent2": "She cast her fishing line into the lake to catch some fish.",
            "sent3": "The magician cast a spell on the audience, making them all laugh uncontrollably.",
            "sent4": "The storm clouds cast a shadow over the entire town, signaling the impending rain.",
            "sent5": "The blacksmith would cast molten metal into intricate shapes to create beautiful jewelry."
        },
        {
            "definition": "An object made by shaping metal or other material in a mold.",
            "pos": "noun",
            "sent1": "The artist displayed a beautiful bronze cast of a lion in the gallery.",
            "sent2": "She admired the intricate details of the metal cast of a flower.",
            "sent3": "The children used a sandcastle mold to create a perfect sand cast of a castle.",
            "sent4": "The archaeologist carefully examined the ancient cast of a Roman coin.",
            "sent5": "The museum showcased a collection of casts of famous sculptures from around the world."
        },
        {
            "definition": "The actors taking part in a play, movie, or other production.",
            "pos": "noun",
            "sent1": "The cast of the new movie includes famous actors from Hollywood.",
            "sent2": "She was excited to meet the cast of her favorite TV show at the fan event.",
            "sent3": "The cast of the school play rehearsed their lines diligently every day.",
            "sent4": "The director was impressed by the talent of the entire cast during auditions.",
            "sent5": "The theater announced the cast list for the upcoming musical production."
        },
        {
            "definition": "A slight squint.",
            "pos": "noun",
            "sent1": "She gave him a suspicious cast as he tried to explain his absence.",
            "sent2": "He had a habit of looking at people with a slight cast in his eyes.",
            "sent3": "The comedian exaggerated a funny cast in his eyes to make the audience laugh.",
            "sent4": "The old man's cast made him appear wise and contemplative.",
            "sent5": "Her cast gave her a mysterious and enigmatic look that intrigued others."
        }
    ]
}