{
    "term": "casted",
    "meanings": [
        {
            "definition": "To throw or hurl",
            "pos": "verb",
            "sent1": "He casted the ball to his friend.",
            "sent2": "She casted the stone into the pond.",
            "sent3": "The boy casted the toy car across the room, pretending it was a rocket.",
            "sent4": "The fisherman casted his line into the water, hoping for a big catch.",
            "sent5": "With a swift motion, he casted the paper airplane into the air."
        },
        {
            "definition": "To assign roles in a play or movie",
            "pos": "verb",
            "sent1": "The director casted the lead role to a talented actor.",
            "sent2": "She casted the supporting characters for the school play.",
            "sent3": "In the pretend game, she casted her friends as superheroes.",
            "sent4": "The casting director casted the perfect actress for the role.",
            "sent5": "He casted the roles with precision, ensuring each actor fit the character."
        },
        {
            "definition": "To form by pouring into a mold",
            "pos": "verb",
            "sent1": "She casted a beautiful sculpture out of clay.",
            "sent2": "The blacksmith casted a metal sword in the forge.",
            "sent3": "The baker casted the cake batter into the pan before baking.",
            "sent4": "The artist casted the liquid resin into a silicone mold.",
            "sent5": "He casted the molten metal into the shape of a key."
        },
        {
            "definition": "To cover with a plaster or bandage",
            "pos": "verb",
            "sent1": "The nurse casted the patient's broken arm.",
            "sent2": "He casted his injured knee to protect it.",
            "sent3": "The superhero casted his wounded side with a special healing bandage.",
            "sent4": "She casted her sprained ankle to help it heal faster.",
            "sent5": "After the accident, the doctor casted his leg to aid in recovery."
        },
        {
            "definition": "To calculate or predict",
            "pos": "verb",
            "sent1": "The fortune teller casted the future of her clients.",
            "sent2": "He casted the outcome of the game in his mind.",
            "sent3": "The scientist casted the results of the experiment before conducting it.",
            "sent4": "She casted the budget for the project accurately.",
            "sent5": "The mathematician casted the trajectory of the rocket launch."
        }
    ]
}