{
    "term": "casting",
    "meanings": [
        {
            "definition": "An object made by pouring molten metal or other material into a mold.",
            "pos": "noun",
            "sent1": "The metal casting was still hot from the mold.",
            "sent2": "The artist displayed a beautiful bronze casting in the gallery.",
            "sent3": "The casting of the metal looked like a shiny treasure.",
            "sent4": "Her eyes sparkled like a newly made casting in the sunlight.",
            "sent5": "The casting of the statue captured every detail perfectly."
        },
        {
            "definition": "The act of throwing something forcefully.",
            "pos": "noun",
            "sent1": "His casting of the ball was strong and accurate.",
            "sent2": "The fisherman's casting landed the lure right by the big fish.",
            "sent3": "The child's casting of the toy car across the room surprised everyone.",
            "sent4": "The storm's wind felt like a powerful casting of nature's fury.",
            "sent5": "The quarterback's casting of the football set up the winning play."
        },
        {
            "definition": "The process of selecting actors for a play or movie.",
            "pos": "noun",
            "sent1": "The casting for the lead role took weeks of auditions.",
            "sent2": "She was thrilled to be part of the casting for the new film.",
            "sent3": "The casting of the villain turned out to be the hero's best friend.",
            "sent4": "The director's casting choices brought the characters to life.",
            "sent5": "The casting director had a keen eye for spotting talent."
        },
        {
            "definition": "The act of shedding skin or feathers.",
            "pos": "noun",
            "sent1": "The snake's casting of its skin left a perfect replica behind.",
            "sent2": "The bird's casting of feathers signaled the start of a new season.",
            "sent3": "The cat's casting of fur made it look like a fluffy cloud.",
            "sent4": "The butterfly's casting of its chrysalis was a magical transformation.",
            "sent5": "The crab's casting of its shell revealed its vibrant new colors."
        }
    ]
}