{
    "term": "caste",
    "meanings": [
        {
            "definition": "A social class or system based on heredity, wealth, or occupation.",
            "pos": "noun",
            "sent1": "In some cultures, people are born into a specific caste that determines their place in society.",
            "sent2": "The Indian caste system has different levels like Brahmins, Kshatriyas, and Vaishyas.",
            "sent3": "At the costume party, each friend chose a different caste to dress up as, creating a fun mix of characters.",
            "sent4": "The rigid caste system in the company made it difficult for employees to move up regardless of their skills.",
            "sent5": "The idea of a caste system can be compared to a ladder where each rung represents a different social level."
        },
        {
            "definition": "A specialized group within a society, often associated with a specific occupation or role.",
            "pos": "noun",
            "sent1": "The medical caste in the hospital worked tirelessly to save lives every day.",
            "sent2": "In the film industry, there is a caste of talented actors who always deliver outstanding performances.",
            "sent3": "The cooking caste in the family consisted of Grandma and Aunt Lisa, known for their delicious recipes.",
            "sent4": "The tech support caste at the office was always ready to assist with any computer issues.",
            "sent5": "The gardening caste in the neighborhood took pride in maintaining beautiful flower beds and lawns."
        },
        {
            "definition": "To assign a role or status to someone based on their background or characteristics.",
            "pos": "verb",
            "sent1": "The teacher decided to caste the lead role in the school play to the student with the most enthusiasm.",
            "sent2": "It is unfair to caste judgment on someone without knowing the full story.",
            "sent3": "The fortune teller playfully casted predictions for each zodiac sign at the fair.",
            "sent4": "The director casted the perfect actor for the villain role in the upcoming movie.",
            "sent5": "She casted a spell to bring good luck and positivity into her life."
        }
    ]
}