{
    "term": "casteisms",
    "meanings": [
        {
            "definition": "Prejudice or discrimination based on caste.",
            "pos": "noun",
            "sent1": "The community was divided by casteisms, leading to unfair treatment of certain groups.",
            "sent2": "The casteisms in society were evident in the unequal opportunities available to individuals.",
            "sent3": "The children found humor in the silly casteisms displayed during the school play.",
            "sent4": "The shadow of casteisms loomed over the village, causing tension among neighbors.",
            "sent5": "The impact of casteisms on social interactions was profound and damaging."
        },
        {
            "definition": "Beliefs or practices related to the caste system.",
            "pos": "noun",
            "sent1": "Her family held strong casteisms, following traditions passed down for generations.",
            "sent2": "Studying the casteisms of different cultures helped broaden his understanding of society.",
            "sent3": "The festival celebrated the colorful casteisms of the community with dances and songs.",
            "sent4": "The ancient texts revealed the intricate casteisms that governed daily life.",
            "sent5": "The intricate web of casteisms shaped the social structure of the kingdom."
        },
        {
            "definition": "Instances of discrimination or bias based on caste.",
            "pos": "noun",
            "sent1": "The workplace faced allegations of casteisms, leading to investigations by authorities.",
            "sent2": "The government implemented policies to address the casteisms prevalent in society.",
            "sent3": "The comedy show humorously portrayed the absurdity of casteisms in modern times.",
            "sent4": "The artist's painting depicted the harsh reality of casteisms faced by many.",
            "sent5": "The documentary shed light on the deep-rooted casteisms that still exist in certain regions."
        }
    ]
}