{
    "term": "casual",
    "meanings": [
        {
            "definition": "relaxed and unconcerned",
            "pos": "adjective",
            "sent1": "She had a casual attitude towards the upcoming exam.",
            "sent2": "He always appears casual and carefree in his demeanor.",
            "sent3": "The cat took a casual approach to catching the mouse, almost as if it was a game.",
            "sent4": "Her casual demeanor masked the storm of emotions brewing inside her.",
            "sent5": "The casual way he shrugged off the criticism left a lasting impression on his colleagues."
        },
        {
            "definition": "occurring by chance",
            "pos": "adjective",
            "sent1": "Their casual meeting at the park was unexpected.",
            "sent2": "The casual encounter with an old friend brought back fond memories.",
            "sent3": "It was a casual twist of fate that led them to cross paths again.",
            "sent4": "The casual alignment of events seemed almost too perfect to be mere chance.",
            "sent5": "The casual way they stumbled upon the hidden treasure felt like destiny in disguise."
        },
        {
            "definition": "informal or relaxed in style",
            "pos": "adjective",
            "sent1": "The party had a casual dress code, allowing guests to feel comfortable.",
            "sent2": "She preferred a casual approach to decorating her home, opting for cozy over formal.",
            "sent3": "The casual tone of the meeting made it easier for everyone to express their ideas.",
            "sent4": "His casual attire stood out among the crowd of formal suits and ties.",
            "sent5": "The casual ambiance of the cafe invited customers to linger and chat for hours."
        },
        {
            "definition": "without definite or serious intention",
            "pos": "adjective",
            "sent1": "Their casual promise to meet again was left unfulfilled.",
            "sent2": "He made a casual remark about visiting, but it never materialized.",
            "sent3": "The casual plan to go hiking turned into a spontaneous road trip.",
            "sent4": "Her casual suggestion to try a new restaurant sparked an impromptu adventure.",
            "sent5": "The casual invitation to join them for dinner felt more like a polite gesture than a genuine offer."
        },
        {
            "definition": "showing little concern or interest",
            "pos": "adjective",
            "sent1": "His casual response to the urgent situation surprised everyone.",
            "sent2": "She gave a casual shrug when asked about her future plans.",
            "sent3": "The casual way he dismissed her concerns left her feeling unheard.",
            "sent4": "Their casual reaction to the news hinted at a deeper indifference.",
            "sent5": "The casual glance he gave her held no hint of recognition or interest."
        }
    ]
}