{
    "term": "catawbas",
    "meanings": [
        {
            "definition": "A type of grape",
            "pos": "noun",
            "sent1": "The vineyard grew sweet catawbas for making delicious wine.",
            "sent2": "She bought a bunch of catawbas from the market to snack on.",
            "sent3": "The mischievous squirrel stole the ripe catawbas and had a fruity feast.",
            "sent4": "The catawbas hung from the vines like clusters of purple jewels.",
            "sent5": "The aroma of the ripe catawbas filled the air with sweetness."
        },
        {
            "definition": "A type of shrub",
            "pos": "noun",
            "sent1": "The garden was adorned with colorful catawbas that bloomed in spring.",
            "sent2": "The landscaper planted catawbas along the fence for privacy.",
            "sent3": "The mischievous cat hid behind the catawbas, waiting to pounce.",
            "sent4": "The catawbas swayed gently in the breeze, adding beauty to the yard.",
            "sent5": "The dense catawbas provided a cozy hiding spot for the birds."
        },
        {
            "definition": "A Native American tribe",
            "pos": "noun",
            "sent1": "The catawbas were known for their skilled pottery craftsmanship.",
            "sent2": "The history book discussed the customs of the catawbas.",
            "sent3": "The catawbas celebrated their harvest with a grand feast.",
            "sent4": "The catawbas' traditional dances echoed through the village.",
            "sent5": "The catawbas' chief led the tribe with wisdom and strength."
        },
        {
            "definition": "A river in the United States",
            "pos": "noun",
            "sent1": "The fishermen enjoyed a peaceful day by the catawbas, hoping for a big catch.",
            "sent2": "The children played by the catawbas, skipping stones across the water.",
            "sent3": "The adventurous explorers paddled their canoe down the catawbas.",
            "sent4": "The catawbas meandered through the valley like a silver ribbon.",
            "sent5": "The wildlife thrived along the banks of the catawbas."
        }
    ]
}