{
    "term": "catalepsies",
    "meanings": [
        {
            "definition": "Catalepsies: a condition characterized by a trancelike state with loss of voluntary motion and failure to react to stimuli",
            "pos": "noun",
            "sent1": "During the catalepsies, she remained frozen and unresponsive.",
            "sent2": "The doctor diagnosed her with catalepsies after observing her unresponsiveness.",
            "sent3": "In the play, the character's catalepsies led to a comedic misunderstanding.",
            "sent4": "Her catalepsies were like being trapped in a statue, unable to move or speak.",
            "sent5": "The catalepsies engulfed her, turning her into a living statue."
        },
        {
            "definition": "Catalepsies: a sudden and brief loss of consciousness, often caused by a seizure or other medical condition",
            "pos": "noun",
            "sent1": "After the catalepsies, he woke up confused and disoriented.",
            "sent2": "The paramedics rushed to help the woman experiencing catalepsies.",
            "sent3": "During the meeting, his catalepsies caused an unexpected interruption.",
            "sent4": "Her sudden catalepsies were like a fleeting shadow passing over her.",
            "sent5": "The catalepsies hit him like a bolt of lightning, leaving him dazed."
        },
        {
            "definition": "Catalepsies: a state of immobility and rigidity, often associated with certain mental disorders",
            "pos": "noun",
            "sent1": "The patient's catalepsies made it difficult for him to move or speak.",
            "sent2": "The psychiatrist recognized the signs of catalepsies in the patient's behavior.",
            "sent3": "His catalepsies at the party made him the center of attention.",
            "sent4": "The weight of her worries felt like a heavy cloak of catalepsies.",
            "sent5": "The catalepsies gripped him, turning his limbs into stiff branches."
        }
    ]
}