{
    "term": "catchwords",
    "meanings": [
        {
            "definition": "A word or phrase that is repeated or emphasized in a document or speech.",
            "pos": "noun",
            "sent1": "The teacher's catchwords in the lecture were 'pay attention' and 'take notes'.",
            "sent2": "The catchwords in the speech were 'unity' and 'progress'.",
            "sent3": "The cat's catchwords to the mice were 'beware' and 'run away'.",
            "sent4": "The catchwords of the wise are like beacons in the night, guiding lost souls.",
            "sent5": "The catchwords of the oath echoed through the ancient hall, binding all who heard."
        },
        {
            "definition": "A word or phrase used as a guide to the contents of a book or other document.",
            "pos": "noun",
            "sent1": "The index page listed the catchwords for each chapter in the textbook.",
            "sent2": "The catchwords on the cover hinted at the thrilling adventure within the novel.",
            "sent3": "The catchwords whispered secrets of the hidden treasure buried in the map.",
            "sent4": "The catchwords acted as signposts in the labyrinth of knowledge, guiding the curious.",
            "sent5": "The catchwords were like keys unlocking the mysteries of the ancient manuscript."
        },
        {
            "definition": "A word or phrase used to summarize or highlight key points.",
            "pos": "noun",
            "sent1": "The presenter used catchwords to emphasize the main ideas of the report.",
            "sent2": "The catchwords on the slide drew attention to the crucial statistics.",
            "sent3": "The catchwords danced around the page, teasing the reader with hints of the story.",
            "sent4": "The catchwords shone brightly in the sea of text, guiding the reader's focus.",
            "sent5": "The catchwords were like beacons, illuminating the path through the dense information."
        }
    ]
}