{
    "term": "catches",
    "meanings": [
        {
            "definition": "To intercept and hold (something that has been thrown, propelled, or dropped)",
            "pos": "verb",
            "sent1": "The baseball player catches the ball with his glove.",
            "sent2": "She catches the bus every morning to go to work.",
            "sent3": "The cat catches the toy mouse with its paws, thinking it's real.",
            "sent4": "Her smile catches the attention of everyone in the room.",
            "sent5": "The spider's web catches unsuspecting insects for its meal."
        },
        {
            "definition": "To capture or seize, especially after pursuit",
            "pos": "verb",
            "sent1": "The police officer catches the thief after a long chase.",
            "sent2": "He catches the fish and proudly shows it to his friends.",
            "sent3": "The little girl catches her mischievous puppy after it escapes.",
            "sent4": "His words catch the essence of the story perfectly.",
            "sent5": "The hunter catches his prey with skill and precision."
        },
        {
            "definition": "To become entangled or snared",
            "pos": "verb",
            "sent1": "The kite catches in the tree branches and won't come down.",
            "sent2": "Her hair catches in the brush as she walks through the forest.",
            "sent3": "The cat catches its tail and spins in circles trying to free itself.",
            "sent4": "His foot catches on the rug, causing him to stumble.",
            "sent5": "The spider's web catches unsuspecting insects for its meal."
        },
        {
            "definition": "To attract and hold the attention or interest of",
            "pos": "verb",
            "sent1": "The colorful poster catches the eye of passersby.",
            "sent2": "Her story catches the imagination of the children listening.",
            "sent3": "The catchy tune catches in your head and you can't stop humming it.",
            "sent4": "The movie's plot twist catches the audience by surprise.",
            "sent5": "The bright lights of the city catch your attention from miles away."
        }
    ]
}