{
    "term": "catch",
    "meanings": [
        {
            "definition": "To capture or seize",
            "pos": "verb",
            "sent1": "I try to catch the ball when it comes towards me.",
            "sent2": "She tried to catch the butterfly fluttering by.",
            "sent3": "The cat tried to catch the laser pointer light on the wall.",
            "sent4": "His words caught my attention like a sudden gust of wind.",
            "sent5": "The fisherman's net was ready to catch any fish that swam by."
        },
        {
            "definition": "To intercept and hold",
            "pos": "verb",
            "sent1": "The goalkeeper managed to catch the soccer ball before it went in.",
            "sent2": "He reached out to catch the falling vase before it broke.",
            "sent3": "The spider's web was designed to catch unsuspecting insects.",
            "sent4": "Her eyes caught mine from across the crowded room.",
            "sent5": "The safety net was there to catch anyone who fell from the trapeze."
        },
        {
            "definition": "To become entangled or hooked",
            "pos": "verb",
            "sent1": "The kite got caught in the tree branches and wouldn't come down.",
            "sent2": "Her hairbrush accidentally caught on the edge of the table.",
            "sent3": "The cat's tail got caught in the door as it closed.",
            "sent4": "His fishing line caught on a rock underwater, making it hard to reel in.",
            "sent5": "The sweater caught on a nail sticking out of the wall."
        },
        {
            "definition": "A device for holding or fastening",
            "pos": "noun",
            "sent1": "She used a simple catch to keep the gate closed.",
            "sent2": "The suitcase had a broken catch, making it hard to open.",
            "sent3": "The catch on the window was rusted shut and wouldn't budge.",
            "sent4": "The jewelry box had an intricate catch that required a special key.",
            "sent5": "The door had a faulty catch that needed to be replaced."
        },
        {
            "definition": "A game of throwing and catching a ball",
            "pos": "noun",
            "sent1": "The children played catch in the park on a sunny day.",
            "sent2": "He enjoyed a game of catch with his friends after school.",
            "sent3": "The dog eagerly joined in the game of catch, chasing after the ball.",
            "sent4": "The baseball team practiced their catch skills before the big game.",
            "sent5": "Playing catch with a frisbee is a fun way to spend time outdoors."
        }
    ]
}