{
    "term": "catechus",
    "meanings": [
        {
            "definition": "A person who catechizes or instructs others in the principles of religion.",
            "pos": "noun",
            "sent1": "The catechus at the church taught the children about faith and beliefs.",
            "sent2": "The catechus led the Sunday school class in learning about religious teachings.",
            "sent3": "The catechus dressed up as a friendly character to make learning about religion fun.",
            "sent4": "The catechus's words were like a guiding light, illuminating the path of spirituality for the students.",
            "sent5": "The catechus's passion for teaching made the religious lessons engaging and memorable."
        },
        {
            "definition": "A manual of instruction in the principles of religion, usually in the form of questions and answers.",
            "pos": "noun",
            "sent1": "The catechus handed out the religious booklet to each student for study.",
            "sent2": "The catechus used the catechism to help the congregation understand the teachings.",
            "sent3": "The catechus accidentally dropped the catechism, causing a flurry of pages to scatter around.",
            "sent4": "The catechus's catechism was a treasure trove of wisdom, guiding many seekers.",
            "sent5": "The catechus's worn-out catechism held the key to unlocking spiritual knowledge."
        },
        {
            "definition": "To instruct or teach by the method of catechism.",
            "pos": "verb",
            "sent1": "The catechus would catechize the new members on the beliefs of the church.",
            "sent2": "The catechus decided to catechize the youth group on the importance of prayer.",
            "sent3": "The catechus playfully pretended to catechize the pets on the ways of religion.",
            "sent4": "The catechus's words catechized the hearts of the listeners, leaving a lasting impact.",
            "sent5": "The catechus's ability to catechize effectively made the complex teachings easy to understand."
        }
    ]
}