{
    "term": "catheterizing",
    "meanings": [
        {
            "definition": "Inserting a catheter into a body cavity or organ.",
            "pos": "verb",
            "sent1": "The nurse was catheterizing the patient to help with urine flow.",
            "sent2": "Doctors often catheterize patients before surgeries to monitor their fluid levels.",
            "sent3": "The clumsy intern kept catheterizing the wrong area, causing a lot of confusion.",
            "sent4": "She felt like she was catheterizing her thoughts, trying to extract the truth from her memories.",
            "sent5": "The mechanic described catheterizing the engine with precision, like a delicate surgery."
        },
        {
            "definition": "The act of using a catheter to drain urine from the bladder.",
            "pos": "noun",
            "sent1": "After the surgery, the patient experienced discomfort due to the catheterizing.",
            "sent2": "Nurses are trained in the proper catheterizing of patients to ensure their comfort.",
            "sent3": "The comedian joked about the awkwardness of catheterizing during a family dinner.",
            "sent4": "The catheterizing of the bladder was like a lifeline for the patient, ensuring proper drainage.",
            "sent5": "The sound of catheterizing echoed through the hospital, a routine yet essential procedure."
        },
        {
            "definition": "The process of introducing a catheter into the urethra for medical purposes.",
            "pos": "noun",
            "sent1": "The doctor explained the catheterizing procedure to the nervous patient.",
            "sent2": "Catheterizing can be uncomfortable but is necessary for certain medical conditions.",
            "sent3": "The cat in the vet's office seemed fascinated by the catheterizing equipment.",
            "sent4": "The catheterizing of the urethra felt like a strange invasion to the patient.",
            "sent5": "The nurse demonstrated the catheterizing process with care and expertise."
        }
    ]
}