{
    "term": "cathexis",
    "meanings": [
        {
            "definition": "The investment of emotional energy in a person, object, or idea.",
            "pos": "noun",
            "sent1": "Her cathexis towards her favorite book was evident in how she always carried it with her.",
            "sent2": "His cathexis for his childhood teddy bear never waned, even as he grew older.",
            "sent3": "The cat's cathexis towards the shiny toy mouse made it believe it was a real prey.",
            "sent4": "The artist's cathexis on the blank canvas transformed it into a masterpiece.",
            "sent5": "The cathexis she felt for her newborn baby was overwhelming and pure."
        },
        {
            "definition": "The process of mentally focusing on a particular thought or feeling.",
            "pos": "noun",
            "sent1": "During meditation, she achieved a deep cathexis on inner peace.",
            "sent2": "His cathexis on solving the puzzle was so intense that he lost track of time.",
            "sent3": "The student's cathexis on the math problem was so strong that he forgot about the bell ringing.",
            "sent4": "Her cathexis on the distant horizon made her forget all her worries.",
            "sent5": "The cathexis on her favorite song lyrics helped her get through tough times."
        },
        {
            "definition": "The act of attaching significance or value to something.",
            "pos": "noun",
            "sent1": "The cathexis she placed on her grandmother's ring was priceless.",
            "sent2": "His cathexis on the old photograph made it a cherished family heirloom.",
            "sent3": "The child's cathexis on the shiny rock turned it into a treasure.",
            "sent4": "The cathexis on the handwritten letter from a loved one made it a precious keepsake.",
            "sent5": "The cathexis she had for her favorite childhood toy was irreplaceable."
        }
    ]
}