{
    "term": "cathectic",
    "meanings": [
        {
            "definition": "Relating to emotional investment or attachment.",
            "pos": "adjective",
            "sent1": "The cathectic bond between the mother and her child was evident in their loving gazes.",
            "sent2": "Their cathectic relationship grew stronger with each passing day.",
            "sent3": "The cathectic connection between the two friends was so strong that they could finish each other's sentences.",
            "sent4": "Her cathectic love for animals was like a warm blanket on a cold winter night.",
            "sent5": "The cathectic memories of their time together lingered in her heart long after they had parted ways."
        },
        {
            "definition": "Involving strong emotional attachment or investment.",
            "pos": "adjective",
            "sent1": "The cathectic friendship between the two girls was unbreakable.",
            "sent2": "Their cathectic bond was evident in the way they always supported each other.",
            "sent3": "The cathectic attachment to her favorite childhood toy brought her comfort during tough times.",
            "sent4": "His cathectic dedication to his work was truly admirable.",
            "sent5": "The cathectic emotions overwhelmed her as she watched her child take their first steps."
        },
        {
            "definition": "Showing strong emotional attachment or investment.",
            "pos": "adjective",
            "sent1": "The cathectic expression on his face revealed his deep love for his family.",
            "sent2": "Her cathectic gestures towards her friends demonstrated her loyalty.",
            "sent3": "The cathectic way she hugged her pet bunny showed her affection.",
            "sent4": "Their cathectic commitment to each other was unwavering.",
            "sent5": "The cathectic tears in her eyes spoke volumes about her emotional connection to the place."
        }
    ]
}