{
    "term": "caudillismo",
    "meanings": [
        {
            "definition": "The leadership or dominance of a political boss or military leader.",
            "pos": "noun",
            "sent1": "In some countries, caudillismo has led to a concentration of power in the hands of a single leader.",
            "sent2": "During the civil war, the region was marked by caudillismo as different leaders fought for control.",
            "sent3": "The idea of caudillismo can sometimes make people feel uneasy about the concentration of power.",
            "sent4": "His caudillismo over the army was so strong that no one dared to challenge his authority.",
            "sent5": "The history books are filled with tales of caudillismo and its impact on society."
        },
        {
            "definition": "The practice of rule by a caudillo.",
            "pos": "noun",
            "sent1": "Caudillismo often results in decisions being made by a single leader without much input from others.",
            "sent2": "The country's political landscape was shaped by years of caudillismo under various leaders.",
            "sent3": "Some people find the concept of caudillismo amusing, imagining a leader making all decisions alone.",
            "sent4": "Her caudillismo in the workplace earned her both admiration and fear from her colleagues.",
            "sent5": "The movie portrayed the protagonist's caudillismo in a way that left a lasting impression on the audience."
        },
        {
            "definition": "The system of government characterized by the rule of a caudillo.",
            "pos": "noun",
            "sent1": "Caudillismo can sometimes lead to a lack of checks and balances in the government.",
            "sent2": "The country's history is marked by periods of caudillismo where one leader held all the power.",
            "sent3": "The comedy show exaggerated the idea of caudillismo in a hilarious skit.",
            "sent4": "The novel used caudillismo as a metaphor for the dangers of unchecked authority.",
            "sent5": "The painting vividly depicted the chaos that can arise from a system based on caudillismo."
        }
    ]
}