{
    "term": "caudillismos",
    "meanings": [
        {
            "definition": "The practice of military dictatorship in Latin America.",
            "pos": "noun",
            "sent1": "During the era of caudillismos, military leaders ruled with absolute power.",
            "sent2": "The country fell into chaos under the grip of caudillismos.",
            "sent3": "The comedy show portrayed a humorous version of caudillismos, with soldiers trying to rule a small town.",
            "sent4": "In the novel, the protagonist faced the oppressive force of caudillismos in the form of a ruthless general.",
            "sent5": "The history book vividly described the impact of caudillismos on the region."
        },
        {
            "definition": "The rule or leadership of a military dictator.",
            "pos": "noun",
            "sent1": "The people lived in fear under the caudillismos of the dictator.",
            "sent2": "Caudillismos often led to suppression of freedoms and rights.",
            "sent3": "The movie depicted a fictional caudillismos where a dictator controlled every aspect of life.",
            "sent4": "The artist's painting symbolized the darkness of caudillismos through the figure of a dictator.",
            "sent5": "The documentary highlighted the consequences of caudillismos on society."
        },
        {
            "definition": "The system of government in which a military leader holds power.",
            "pos": "noun",
            "sent1": "Under caudillismos, the military leader made all the decisions for the nation.",
            "sent2": "Caudillismos often resulted in political instability and unrest.",
            "sent3": "The children's book featured a whimsical tale of animals living under the rule of caudillismos.",
            "sent4": "The metaphorical weight of caudillismos was felt by all citizens as the general tightened his grip.",
            "sent5": "The painting captured the essence of caudillismos through the imposing figure of the military leader."
        }
    ]
}