{
    "term": "causalgia",
    "meanings": [
        {
            "definition": "A persistent, severe burning sensation in a limb caused by nerve damage.",
            "pos": "noun",
            "sent1": "The causalgia in his arm made it feel like it was on fire.",
            "sent2": "She winced in pain as the causalgia in her leg intensified.",
            "sent3": "Despite the causalgia in his foot, he couldn't help but laugh at the ticklish sensation.",
            "sent4": "The causalgia in her hand was like a blazing torch, impossible to ignore.",
            "sent5": "The causalgia was a relentless inferno, consuming every thought and movement."
        },
        {
            "definition": "A condition characterized by intense, burning pain in a specific area of the body.",
            "pos": "noun",
            "sent1": "The doctor diagnosed her with causalgia after she described the burning pain in her shoulder.",
            "sent2": "The causalgia in his back made it hard for him to sit still.",
            "sent3": "Despite the causalgia in her neck, she managed to crack a joke and lighten the mood.",
            "sent4": "The causalgia in his chest felt like a furnace, radiating heat throughout his body.",
            "sent5": "The causalgia was a fiery dragon, breathing scorching flames of agony."
        },
        {
            "definition": "A type of neuropathic pain resulting from damage to a peripheral nerve.",
            "pos": "noun",
            "sent1": "The causalgia in her wrist was a constant reminder of the accident.",
            "sent2": "He winced as the causalgia in his ankle flared up unexpectedly.",
            "sent3": "Despite the causalgia in his fingers, he managed to type with precision.",
            "sent4": "The causalgia in her toe felt like tiny electric shocks, jolting her with each step.",
            "sent5": "The causalgia was a tangled web of pain, ensnaring his nerves in relentless torment."
        }
    ]
}