{
    "term": "cavaliering",
    "meanings": [
        {
            "definition": "To behave in a haughty or disdainful manner.",
            "pos": "verb",
            "sent1": "She was cavaliering towards her classmates, acting superior and dismissive.",
            "sent2": "He was always cavaliering towards the staff, never showing respect for their hard work.",
            "sent3": "The cat was cavaliering around the house, ignoring everyone as if it ruled the place.",
            "sent4": "His cavaliering attitude towards the rules made him a rebel in the eyes of his peers.",
            "sent5": "The politician's cavaliering behavior towards the public cost him their trust."
        },
        {
            "definition": "A supporter of King Charles I during the English Civil War.",
            "pos": "noun",
            "sent1": "The cavaliering soldier fought bravely for King Charles I in the Civil War.",
            "sent2": "Many nobles were known for their cavaliering loyalty to the king during the war.",
            "sent3": "The children playfully pretended to be cavaliering knights from the past.",
            "sent4": "In the historical reenactment, he portrayed a cavaliering supporter of the king with pride.",
            "sent5": "The painting depicted a group of cavaliering men standing by King Charles I."
        },
        {
            "definition": "A gallant or chivalrous man.",
            "pos": "noun",
            "sent1": "He was known as a true cavaliering gentleman, always courteous and brave.",
            "sent2": "The knight's actions on the battlefield were truly cavaliering, inspiring others.",
            "sent3": "The dog's playful antics made him seem like a cavaliering hero in the eyes of the children.",
            "sent4": "His cavaliering demeanor won the hearts of many, earning him the title of a gallant man.",
            "sent5": "In the story, the prince was described as a cavaliering figure, ready to defend his kingdom."
        }
    ]
}