{
    "term": "cavaleros",
    "meanings": [
        {
            "definition": "A man trained in arms and horsemanship.",
            "pos": "noun",
            "sent1": "The cavaleros showed great skill in handling weapons and riding horses.",
            "sent2": "The village celebrated the arrival of the cavaleros, skilled in both combat and horsemanship.",
            "sent3": "The cavaleros impressed the crowd with their swordsmanship and equestrian abilities.",
            "sent4": "In the battlefield, the cavaleros were like swift-moving shadows, striking fear into their enemies.",
            "sent5": "The image of the cavaleros riding into battle stayed etched in the minds of all who witnessed it."
        },
        {
            "definition": "A mounted soldier; a knight.",
            "pos": "noun",
            "sent1": "The king's loyal cavaleros rode into battle with bravery and honor.",
            "sent2": "In the medieval tales, the cavaleros were often depicted as noble warriors on horseback.",
            "sent3": "The cavaleros' armor clanked loudly as they rode through the castle gates, announcing their arrival.",
            "sent4": "The cavaleros' steeds galloped like thunder, carrying them swiftly towards the enemy lines.",
            "sent5": "Legends spoke of the cavaleros' chivalry and valor in protecting the kingdom."
        },
        {
            "definition": "A courtly gentleman; gallant.",
            "pos": "noun",
            "sent1": "The young cavaleros at the ball danced gracefully with the ladies, charming everyone with their manners.",
            "sent2": "The cavaleros in their fine attire exuded an air of sophistication and elegance.",
            "sent3": "The cavaleros' polite gestures and courteous behavior won the admiration of all the guests.",
            "sent4": "Among the nobles, he was known as the cavaleros with the most refined etiquette and gallantry.",
            "sent5": "The cavaleros' presence at the royal court added a touch of class and charm to the evening."
        }
    ]
}