{
    "term": "cedarbird",
    "meanings": [
        {
            "definition": "A bird that feeds on cedar berries.",
            "pos": "noun",
            "sent1": "The cedarbird perched on the tree, pecking at the cedar berries.",
            "sent2": "I spotted a cedarbird in the forest, enjoying a meal of cedar berries.",
            "sent3": "The cedarbird seemed to be having a feast, munching on the cedar berries with delight.",
            "sent4": "The cedarbird was like a tiny gourmet, savoring the cedar berries as if they were a delicacy.",
            "sent5": "The cedarbird's beak was stained purple from the juicy cedar berries it had been eating."
        },
        {
            "definition": "A bird known for its distinctive call.",
            "pos": "noun",
            "sent1": "The cedarbird's melodious call echoed through the woods, signaling the start of spring.",
            "sent2": "We could always recognize the cedarbird by its unique and beautiful song.",
            "sent3": "The cedarbird's call was so enchanting that even the other birds stopped to listen.",
            "sent4": "The cedarbird's song cut through the silence like a ray of sunshine on a cloudy day.",
            "sent5": "The cedarbird's call was a sweet melody that lingered in the air long after it had flown away."
        },
        {
            "definition": "A bird with gray and brown plumage.",
            "pos": "noun",
            "sent1": "The cedarbird's feathers were a mix of gray and brown, blending perfectly with the tree bark.",
            "sent2": "I saw a cedarbird camouflaged among the branches due to its gray and brown plumage.",
            "sent3": "The cedarbird looked like a tiny cloud with its soft gray and brown feathers.",
            "sent4": "The cedarbird's plumage was a natural work of art, resembling the colors of the forest itself.",
            "sent5": "The cedarbird's gray and brown feathers shimmered in the sunlight, creating a beautiful sight."
        }
    ]
}