{
    "term": "ceili",
    "meanings": [
        {
            "definition": "A social gathering with traditional Irish music and dancing.",
            "pos": "noun",
            "sent1": "The ceili was filled with lively music and joyful dancing.",
            "sent2": "We had a great time at the ceili last night, dancing to Irish tunes.",
            "sent3": "At the ceili, everyone danced so much that they were all out of breath!",
            "sent4": "The ceili was a whirlwind of music and movement, like a colorful festival.",
            "sent5": "The memory of the ceili lingered in their minds, a happy gathering of friends."
        },
        {
            "definition": "The type of music played at a ceili.",
            "pos": "noun",
            "sent1": "The ceili music had a lively beat that made everyone want to dance.",
            "sent2": "The traditional ceili music filled the room with its cheerful melodies.",
            "sent3": "The ceili music was so catchy that it stayed in their heads all night.",
            "sent4": "The ceili music was like a cheerful soundtrack to the evening's festivities.",
            "sent5": "The joyous notes of the ceili music echoed through the hall, inviting everyone to join in the fun."
        },
        {
            "definition": "To participate in a ceili.",
            "pos": "verb",
            "sent1": "We love to ceili with our friends on weekends.",
            "sent2": "Let's ceili together at the next gathering, it's always so much fun!",
            "sent3": "They decided to ceili every Friday night to unwind after a long week.",
            "sent4": "Ceiliing with others brought a sense of community and joy to their lives.",
            "sent5": "Ceiliing together created lasting memories and strong bonds among the group."
        },
        {
            "definition": "A type of Irish dance performed at a ceili.",
            "pos": "noun",
            "sent1": "The ceili dance was energetic and full of traditional steps.",
            "sent2": "She practiced the ceili dance for weeks to prepare for the event.",
            "sent3": "The ceili dance was so fun, it felt like skipping through a meadow.",
            "sent4": "The dancers moved in perfect harmony, like a well-choreographed ceili dance.",
            "sent5": "The rhythm of the ceili dance pulsed through the room, captivating everyone's attention."
        }
    ]
}