{
    "term": "celerity",
    "meanings": [
        {
            "definition": "Swiftness or speed in movement",
            "pos": "noun",
            "sent1": "The cheetah's celerity allowed it to catch its prey effortlessly.",
            "sent2": "The delivery truck moved with celerity to ensure packages reached customers on time.",
            "sent3": "The race between the tortoise and the hare ended in a surprising victory for the tortoise due to its unexpected celerity.",
            "sent4": "Her celerity on the dance floor was like a whirlwind, captivating everyone's attention.",
            "sent5": "The celerity of the waterfall cascading down the rocks was a mesmerizing sight."
        },
        {
            "definition": "Rapidity of motion or action",
            "pos": "noun",
            "sent1": "The emergency response team acted with celerity to save the trapped hikers.",
            "sent2": "The celerity of the athlete's movements impressed the spectators at the competition.",
            "sent3": "The chef's celerity in preparing the meals left the restaurant patrons amazed at the efficiency.",
            "sent4": "Time seemed to slow down as the car approached with celerity, narrowly avoiding a collision.",
            "sent5": "The celerity of the squirrel as it darted across the yard was a blur of motion."
        },
        {
            "definition": "Quickness in doing things",
            "pos": "noun",
            "sent1": "The student completed the test with impressive celerity, finishing well before the others.",
            "sent2": "The celerity with which she responded to emails earned her praise for her efficiency.",
            "sent3": "The magician's celerity in performing tricks left the audience in awe of his quick hands.",
            "sent4": "The celerity of the decision-making process surprised everyone in the boardroom.",
            "sent5": "Her celerity in solving puzzles was unmatched, earning her the title of puzzle master."
        }
    ]
}