{
    "term": "cellule",
    "meanings": [
        {
            "definition": "A small room or compartment",
            "pos": "noun",
            "sent1": "In the corner of the house, there is a tiny cellule for storing tools.",
            "sent2": "The prisoner spent hours in the dark cellule, waiting for the guard.",
            "sent3": "The cat found a cozy cellule in the closet to take a nap.",
            "sent4": "Her mind felt like a crowded cellule, filled with memories and thoughts.",
            "sent5": "The cellule under the stairs was a perfect hiding spot for the kids."
        },
        {
            "definition": "A small group of people forming a nucleus within a larger organization",
            "pos": "noun",
            "sent1": "The cellule of dedicated volunteers worked tirelessly to help the community.",
            "sent2": "The marketing team was a strong cellule within the company, driving sales.",
            "sent3": "The cellule of friends always sat together at lunch, sharing stories and laughter.",
            "sent4": "Their friendship was like a tight-knit cellule, supporting each other through thick and thin.",
            "sent5": "The cellule of musicians played harmoniously together, creating beautiful melodies."
        },
        {
            "definition": "A small biological unit that is the basic structural and functional unit of living organisms",
            "pos": "noun",
            "sent1": "The scientist observed the cellule under the microscope, studying its structure.",
            "sent2": "Each cellule in the body plays a vital role in maintaining health.",
            "sent3": "The cellule in the plant was busy photosynthesizing, turning sunlight into energy.",
            "sent4": "The cellule in the beehive worked diligently to produce sweet honey for the colony.",
            "sent5": "The cellule in the leaf was like a tiny factory, producing food for the plant."
        }
    ]
}