{
    "term": "cells",
    "meanings": [
        {
            "definition": "The smallest structural and functional unit of an organism.",
            "pos": "noun",
            "sent1": "Our bodies are made up of tiny cells that work together to keep us healthy.",
            "sent2": "Under the microscope, you can see the cells that make up plants and animals.",
            "sent3": "The cells in our body must be having a party, they never seem to stop moving!",
            "sent4": "Just like a city, our body is a bustling metropolis of cells, each with its own job to do.",
            "sent5": "In a single drop of blood, there are millions of cells, each with a specific role to play."
        },
        {
            "definition": "A small room in a prison or monastery.",
            "pos": "noun",
            "sent1": "The prisoner spent hours pacing back and forth in his cramped cell.",
            "sent2": "The monk found solace in the quiet of his monastery cell.",
            "sent3": "The cell in the old prison was so small, it felt like a closet!",
            "sent4": "Locked in his cell, the inmate felt the weight of his confinement.",
            "sent5": "The monk's cell was sparse, with only a bed and a small desk for meditation."
        },
        {
            "definition": "A device containing electrodes immersed in an electrolyte, used for generating electricity.",
            "pos": "noun",
            "sent1": "The scientist carefully examined the fuel cell to ensure it was functioning properly.",
            "sent2": "The battery in your phone is made up of tiny cells that store and release energy.",
            "sent3": "The electric car's cells were charged up and ready to go for a long drive.",
            "sent4": "The solar panel converts sunlight into electricity through its photovoltaic cells.",
            "sent5": "Each cell in the power grid plays a crucial role in supplying electricity to homes and businesses."
        }
    ]
}