{
    "term": "cell",
    "meanings": [
        {
            "definition": "A small room in a prison or monastery.",
            "pos": "noun",
            "sent1": "The prisoner spent the night in a dark cell.",
            "sent2": "The monk meditated in his quiet cell.",
            "sent3": "The mischievous cat sneaked into the empty cell and got stuck.",
            "sent4": "Her mind felt like a lonely cell, isolated from the world.",
            "sent5": "The damp, cold walls of the cell echoed every sound."
        },
        {
            "definition": "A small compartment in a honeycomb.",
            "pos": "noun",
            "sent1": "The bee stored nectar in each cell of the honeycomb.",
            "sent2": "The sweet honey filled every cell of the comb.",
            "sent3": "The hungry bear eagerly searched for the last cell with honey.",
            "sent4": "The hexagonal shape of each cell in the honeycomb fascinated the scientist.",
            "sent5": "The golden sunlight gleamed on the wax cell of the hive."
        },
        {
            "definition": "A basic unit of life in living organisms.",
            "pos": "noun",
            "sent1": "The human body is made up of countless cells.",
            "sent2": "Each cell performs specific functions in the body.",
            "sent3": "The tiny cell threw a party with the mitochondria and nucleus.",
            "sent4": "In the bustling city of cells, the mitochondria was the powerhouse.",
            "sent5": "The cell danced with joy as it received nutrients and oxygen."
        },
        {
            "definition": "A device for converting chemical energy into electrical energy.",
            "pos": "noun",
            "sent1": "The solar cell on the roof generated electricity from sunlight.",
            "sent2": "The fuel cell provided power for the remote cabin.",
            "sent3": "The portable cell charger saved the day during the blackout.",
            "sent4": "Her invention revolutionized the efficiency of the energy cell.",
            "sent5": "The small cell hummed softly as it converted energy for the device."
        }
    ]
}