{
    "term": "cementitious",
    "meanings": [
        {
            "definition": "Having the properties of cement.",
            "pos": "adjective",
            "sent1": "The new building material was very cementitious, making it durable and strong.",
            "sent2": "The cementitious mixture dried quickly in the sun, just like regular cement.",
            "sent3": "The cementitious sidewalk seemed to have a mind of its own, expanding and contracting with the weather.",
            "sent4": "Their friendship was as cementitious as the strongest bond, unbreakable and reliable.",
            "sent5": "The cementitious nature of the glue made it perfect for fixing broken pottery."
        },
        {
            "definition": "Resembling or containing cement.",
            "pos": "adjective",
            "sent1": "The old walls were crumbling and cementitious, showing their age.",
            "sent2": "The statue had a cementitious appearance, fooling many into thinking it was made of stone.",
            "sent3": "The cake was so dry it tasted cementitious, causing everyone to laugh at the failed baking attempt.",
            "sent4": "Her smile was as cementitious as a statue's, unmoving and cold.",
            "sent5": "The artist used a special paint to give the sculpture a cementitious look."
        },
        {
            "definition": "Capable of forming a strong bond with other materials.",
            "pos": "adjective",
            "sent1": "The cementitious adhesive held the pieces together firmly, preventing any further damage.",
            "sent2": "The cementitious grout filled the gaps between the tiles, ensuring they stayed in place.",
            "sent3": "The superhero's cape was so cementitious that it never tore, no matter how many times he flew through obstacles.",
            "sent4": "Their partnership was as cementitious as the strongest steel, unbreakable and supportive.",
            "sent5": "The cementitious bond between the two materials was so strong that even a hurricane couldn't separate them."
        }
    ]
}