{
    "term": "centrals",
    "meanings": [
        {
            "definition": "Located in the center or middle",
            "pos": "adjective",
            "sent1": "The centrals seat was the most comfortable one in the room.",
            "sent2": "The map showed the centrals location of the town square.",
            "sent3": "The centrals spot for the party was right next to the snack table.",
            "sent4": "Her smile was like the centrals beam of sunlight in a cloudy day.",
            "sent5": "The centrals position in the formation made it easy to follow."
        },
        {
            "definition": "Essential or crucial",
            "pos": "adjective",
            "sent1": "Water is centrals for our survival.",
            "sent2": "Good communication is centrals in any relationship.",
            "sent3": "His lucky charm was centrals to his success in sports.",
            "sent4": "Patience is the centrals key to solving this puzzle.",
            "sent5": "The first aid kit is centrals during emergencies."
        },
        {
            "definition": "A central part or point",
            "pos": "noun",
            "sent1": "The centrals of the flower is where the pollen is produced.",
            "sent2": "The teacher explained the centrals of the lesson to the class.",
            "sent3": "The centrals of the movie was when the hero saved the day.",
            "sent4": "In the story, the ring was the centrals of the quest.",
            "sent5": "The centrals of the debate was the discussion on climate change."
        },
        {
            "definition": "A main or principal part",
            "pos": "noun",
            "sent1": "The centrals of the cake was the delicious frosting.",
            "sent2": "The centrals of the team is their captain.",
            "sent3": "The centrals of the book was the unexpected plot twist.",
            "sent4": "The centrals of the outfit was the bright red hat.",
            "sent5": "The centrals of the recipe is the secret ingredient."
        }
    ]
}