{
    "term": "centum",
    "meanings": [
        {
            "definition": "One hundred",
            "pos": "adjective",
            "sent1": "The teacher had a centum candies to give out to the students.",
            "sent2": "She counted a centum colorful balloons at the party.",
            "sent3": "The centum cupcakes disappeared in seconds at the school bake sale.",
            "sent4": "The centum stars in the sky twinkled brightly on a clear night.",
            "sent5": "The centum dollar bill was a rare find in the old book."
        },
        {
            "definition": "A hundred years",
            "pos": "noun",
            "sent1": "The ancient tree had stood for over a centum years in the forest.",
            "sent2": "They celebrated their town's centum anniversary with a big parade.",
            "sent3": "The centum-year-old tortoise moved slowly across the garden.",
            "sent4": "The centum years passed like a gentle breeze in their memories.",
            "sent5": "The centum-year milestone marked a new chapter in history books."
        },
        {
            "definition": "A hundredth part of a dollar or other currency",
            "pos": "noun",
            "sent1": "She saved a centum of her allowance to buy a new toy.",
            "sent2": "The charity received a centum donation from a generous benefactor.",
            "sent3": "He found a centum coin hidden in the couch cushions.",
            "sent4": "A centum of pennies jingled in her piggy bank.",
            "sent5": "The beggar's cup held only a centum coins from kind passersby."
        },
        {
            "definition": "A hundredth part of a unit of measure",
            "pos": "noun",
            "sent1": "The recipe called for a centum of a teaspoon of salt.",
            "sent2": "She measured a centum of a meter of fabric for the dress.",
            "sent3": "The ruler was marked with divisions down to a centum of an inch.",
            "sent4": "A centum of a kilogram of flour was just enough for the cake.",
            "sent5": "The scientist needed only a centum of a milliliter of liquid for the experiment."
        }
    ]
}