{
    "term": "centrifugation",
    "meanings": [
        {
            "definition": "The process of separating substances of different densities using centrifugal force.",
            "pos": "noun",
            "sent1": "During centrifugation, heavier particles move outward due to the spinning motion.",
            "sent2": "Scientists use centrifugation to separate blood components for analysis.",
            "sent3": "I tried to use centrifugation to separate my vegetables, but they all ended up mixed together.",
            "sent4": "The centrifugation of opinions in the meeting room led to a clear division between two sides.",
            "sent5": "The centrifugation of the paint mixture created beautiful layers of colors."
        },
        {
            "definition": "The act of spinning a mixture at high speeds to separate its components.",
            "pos": "noun",
            "sent1": "After the centrifugation, the mixture was divided into distinct layers.",
            "sent2": "The lab technician performed centrifugation to isolate the DNA from the sample.",
            "sent3": "The centrifugation of the cake batter was so fast that it flew out of the bowl!",
            "sent4": "Her thoughts went through a mental centrifugation, sorting out the important from the trivial.",
            "sent5": "The centrifugation of the sand and water mixture revealed the heavier particles at the bottom."
        },
        {
            "definition": "A method of separating particles based on their size and density through rapid rotation.",
            "pos": "noun",
            "sent1": "Centrifugation is commonly used in laboratories to separate cell components.",
            "sent2": "The centrifugation of the soil sample helped determine its composition.",
            "sent3": "The centrifugation of the toy box was like a whirlwind of toys flying around.",
            "sent4": "In the chaos of emotions, her mind felt like a centrifugation of conflicting feelings.",
            "sent5": "The centrifugation of the liquid revealed layers of different densities."
        }
    ]
}