{
    "term": "centrifugations",
    "meanings": [
        {
            "definition": "The process of separating substances of different densities using a centrifuge.",
            "pos": "noun",
            "sent1": "During the centrifugations, the heavier particles settled at the bottom.",
            "sent2": "Scientists use centrifugations to extract DNA from cells.",
            "sent3": "The centrifugations turned the liquid into layers like a colorful rainbow.",
            "sent4": "Her thoughts whirled in her mind like a centrifugations machine.",
            "sent5": "The centrifugations transformed the murky liquid into clear layers of different densities."
        },
        {
            "definition": "The act of spinning a mixture at high speeds to separate its components.",
            "pos": "noun",
            "sent1": "The lab technician carefully monitored the centrifugations of the blood sample.",
            "sent2": "After the centrifugations, the oil separated from the water in the mixture.",
            "sent3": "The centrifugations made the liquid dance in the tubes.",
            "sent4": "His head felt like it was in a centrifugations, everything spinning around him.",
            "sent5": "The centrifugations revealed the hidden layers of the mixture with precision."
        },
        {
            "definition": "The result of using a centrifuge to separate materials based on their density.",
            "pos": "noun",
            "sent1": "The scientist observed the clear separation achieved through the centrifugations.",
            "sent2": "Centrifugations are essential in the purification of biological samples.",
            "sent3": "The centrifugations left a distinct pattern in the mixture.",
            "sent4": "Her emotions went through a centrifugations, leaving her feeling drained.",
            "sent5": "The centrifugations displayed the different layers of the mixture like a work of art."
        }
    ]
}