{
    "term": "cervelat",
    "meanings": [
        {
            "definition": "A type of sausage",
            "pos": "noun",
            "sent1": "I enjoy grilling cervelat sausages on weekends.",
            "sent2": "The butcher recommended trying the cervelat sausage.",
            "sent3": "At the picnic, the kids pretended the cervelat sausages were worms!",
            "sent4": "The aroma of sizzling cervelat sausages filled the air.",
            "sent5": "The juicy cervelat sausage burst with flavor in every bite."
        },
        {
            "definition": "A type of salami",
            "pos": "noun",
            "sent1": "The deli offered a special on cervelat salami slices.",
            "sent2": "The charcuterie board featured a variety of cervelat salami.",
            "sent3": "The cat thought the hanging cervelat salami looked like a toy!",
            "sent4": "The rich aroma of cervelat salami lingered in the room.",
            "sent5": "The savory taste of the cervelat salami left a lasting impression."
        },
        {
            "definition": "A type of processed meat",
            "pos": "noun",
            "sent1": "Cervelat processed meat is a popular choice for sandwiches.",
            "sent2": "The grocery store had a sale on cervelat processed meat.",
            "sent3": "The chef joked that the aliens would love cervelat processed meat.",
            "sent4": "The convenience of cervelat processed meat made meal prep easy.",
            "sent5": "The quality of the cervelat processed meat was evident in every bite."
        },
        {
            "definition": "A type of cold cut",
            "pos": "noun",
            "sent1": "The party platter included slices of cervelat cold cut.",
            "sent2": "I prefer my sandwiches with cervelat cold cut slices.",
            "sent3": "The raccoon stole the cervelat cold cut from the picnic basket!",
            "sent4": "The freshness of the cervelat cold cut added a delightful crunch.",
            "sent5": "The deli's special cervelat cold cut was a hit among customers."
        }
    ]
}