{
    "term": "chafe",
    "meanings": [
        {
            "definition": "To irritate or annoy",
            "pos": "verb",
            "sent1": "His constant complaints chafe me.",
            "sent2": "The rough fabric can chafe your skin if you wear it for too long.",
            "sent3": "The noisy neighbors chafe my patience.",
            "sent4": "The repetitive sound of the dripping faucet chafes my nerves.",
            "sent5": "Her sharp tone seemed to chafe against his calm demeanor."
        },
        {
            "definition": "To rub or wear away by friction",
            "pos": "verb",
            "sent1": "The rope chafed against the rough edge of the rock.",
            "sent2": "The new shoes chafed his heels and caused blisters.",
            "sent3": "The constant friction between the two materials chafed away the paint.",
            "sent4": "The sandpaper slowly chafed the wood to a smooth finish.",
            "sent5": "The wind chafed against the exposed skin, making it raw and sore."
        },
        {
            "definition": "To become irritated or annoyed",
            "pos": "verb",
            "sent1": "She tends to chafe easily when things don't go her way.",
            "sent2": "The long wait in line started to chafe on his nerves.",
            "sent3": "His teasing remarks began to chafe her good mood.",
            "sent4": "The repetitive noise of the construction work chafed on her patience.",
            "sent5": "The constant interruptions chafed at his concentration."
        },
        {
            "definition": "A sore or irritation caused by rubbing",
            "pos": "noun",
            "sent1": "Applying a soothing cream can help relieve the chafe.",
            "sent2": "The hiker developed a painful chafe from his backpack rubbing against his skin.",
            "sent3": "The swimmer's chafe from the wetsuit made it uncomfortable to move.",
            "sent4": "The runner applied a bandage to protect the chafe on his inner thigh.",
            "sent5": "The cyclist wore padded shorts to prevent chafes during the long ride."
        }
    ]
}