{
    "term": "challa",
    "meanings": [
        {
            "definition": "A type of bread typically eaten on the Jewish Sabbath.",
            "pos": "noun",
            "sent1": "During the Sabbath, the family enjoyed delicious challa together.",
            "sent2": "The challa was soft and fragrant, perfect for the special day.",
            "sent3": "The challa loaf looked so happy to be part of the Sabbath meal.",
            "sent4": "The challa's golden crust shone like a treasure in the candlelight.",
            "sent5": "The aroma of the freshly baked challa filled the kitchen with warmth."
        },
        {
            "definition": "To call out or shout loudly.",
            "pos": "verb",
            "sent1": "She had to challa to get the attention of the crowd.",
            "sent2": "The coach had to challa to make himself heard over the cheering fans.",
            "sent3": "He decided to challa for help when he got lost in the maze.",
            "sent4": "The thunder challa'd across the sky, announcing the coming storm.",
            "sent5": "The teacher had to challa to quiet down the excited students."
        },
        {
            "definition": "A type of Indian flatbread.",
            "pos": "noun",
            "sent1": "The restaurant served delicious challa with spicy curry.",
            "sent2": "The aroma of the freshly baked challa filled the room.",
            "sent3": "She loved to eat challa with her favorite chutney.",
            "sent4": "The warm challa melted in her mouth with each bite.",
            "sent5": "The fluffy challa was the perfect accompaniment to the flavorful curry."
        },
        {
            "definition": "A type of traditional Punjabi folk dance.",
            "pos": "noun",
            "sent1": "The dancers moved gracefully to the beat of the challa.",
            "sent2": "The music for the challa was lively and energetic.",
            "sent3": "She twirled and spun in the challa, feeling the rhythm in her heart.",
            "sent4": "The colorful costumes added to the beauty of the challa performance.",
            "sent5": "The community gathered to watch the traditional challa dance with joy."
        }
    ]
}