{
    "term": "chang",
    "meanings": [
        {
            "definition": "To make or become different",
            "pos": "verb",
            "sent1": "She decided to chang her hairstyle for a new look.",
            "sent2": "The seasons chang throughout the year.",
            "sent3": "The color-changing chameleon was a sight to see.",
            "sent4": "His perspective on life began to chang after the trip.",
            "sent5": "The caterpillar's transformation into a butterfly was a beautiful chang."
        },
        {
            "definition": "To substitute or replace",
            "pos": "verb",
            "sent1": "They had to chang the broken light bulb in the hallway.",
            "sent2": "The teacher asked the student to chang his answer on the test.",
            "sent3": "The actor had to quickly chang his costume backstage.",
            "sent4": "The new technology will eventually chang the old ways of doing things.",
            "sent5": "The chef had to chang an ingredient in the recipe due to allergies."
        },
        {
            "definition": "A unit of currency in Vietnam",
            "pos": "noun",
            "sent1": "He exchanged his dollars for Vietnamese chang before the trip.",
            "sent2": "The market displayed the current exchange rate for chang.",
            "sent3": "She saved up enough chang for a souvenir.",
            "sent4": "The tourist was unfamiliar with the value of Vietnamese chang.",
            "sent5": "The chang in his pocket jingled as he walked."
        },
        {
            "definition": "A traditional Chinese unit of length equal to about one-third of a meter",
            "pos": "noun",
            "sent1": "The carpenter measured the wood using a chang.",
            "sent2": "The ancient scroll depicted the use of a chang for measurements.",
            "sent3": "The tailor needed a precise chang for the fabric.",
            "sent4": "The map showed distances in both meters and chang.",
            "sent5": "The old building's dimensions were recorded in chang."
        }
    ]
}