{
    "term": "chandelles",
    "meanings": [
        {
            "definition": "A maneuver in aviation involving a steep climb followed by a sharp turn.",
            "pos": "noun",
            "sent1": "During the air show, the pilot performed impressive chandelles, climbing high before turning sharply.",
            "sent2": "The pilot practiced chandelles to improve their aerial maneuvering skills.",
            "sent3": "The chandelles the pilot executed were so sharp that even the clouds seemed surprised.",
            "sent4": "Her career took a chandelles-like turn when she switched from accounting to becoming a pilot.",
            "sent5": "The chandelles in the sky looked like giant question marks, puzzling the onlookers."
        },
        {
            "definition": "A type of candlestick or candle holder.",
            "pos": "noun",
            "sent1": "She placed the candle in the ornate chandelles on the dining table.",
            "sent2": "The antique shop had a beautiful collection of chandelles from different eras.",
            "sent3": "The chandelles on the mantelpiece seemed to gossip about the other decorations.",
            "sent4": "The flickering flame in the chandelles cast a warm glow in the room.",
            "sent5": "The chandelles in the church were lit to create a serene atmosphere during the ceremony."
        },
        {
            "definition": "A type of dessert made with whipped cream and fruit.",
            "pos": "noun",
            "sent1": "The bakery's specialty was the delicious chandelles topped with fresh berries.",
            "sent2": "She enjoyed a refreshing serving of chandelles on a hot summer day.",
            "sent3": "The chandelles at the party disappeared quickly as everyone savored the sweet treat.",
            "sent4": "The chandelles melted in her mouth, leaving a delightful fruity aftertaste.",
            "sent5": "The chandelles were a hit at the potluck, with everyone asking for the recipe."
        }
    ]
}