{
    "term": "chaqueta",
    "meanings": [
        {
            "definition": "A short, lightweight jacket",
            "pos": "noun",
            "sent1": "She wore a chaqueta to stay warm in the cool breeze.",
            "sent2": "The chaqueta matched perfectly with her dress for the party.",
            "sent3": "He pretended his chaqueta was a superhero cape and ran around the yard.",
            "sent4": "The chaqueta of clouds covered the sky, promising rain.",
            "sent5": "The bright red chaqueta stood out in the sea of black coats."
        },
        {
            "definition": "A protective covering for an object",
            "pos": "noun",
            "sent1": "The fragile vase was wrapped in a soft chaqueta to prevent damage.",
            "sent2": "The phone case acted as a chaqueta, shielding the device from scratches.",
            "sent3": "The book was like a chaqueta, guarding its secrets from prying eyes.",
            "sent4": "The thick walls of the castle served as a chaqueta, protecting the royal family.",
            "sent5": "The umbrella was a chaqueta against the rain, keeping her dry on the walk home."
        },
        {
            "definition": "A sleeveless garment worn over a shirt",
            "pos": "noun",
            "sent1": "He put on a colorful chaqueta to add flair to his outfit.",
            "sent2": "The traditional chaqueta was embroidered with intricate patterns.",
            "sent3": "She mistakenly wore her chaqueta inside out, revealing the seams.",
            "sent4": "The knitted chaqueta kept her shoulders warm on chilly evenings.",
            "sent5": "The denim chaqueta was a trendy addition to her wardrobe."
        },
        {
            "definition": "A slang term for a lie or false story",
            "pos": "noun",
            "sent1": "Don't believe him; it's just a chaqueta to cover up the truth.",
            "sent2": "She spun a chaqueta about meeting a celebrity at the store.",
            "sent3": "His excuse for being late was such a ridiculous chaqueta.",
            "sent4": "The gossip spread like wildfire, each person adding their own chaqueta.",
            "sent5": "In the world of politics, a chaqueta can quickly become a headline."
        }
    ]
}