{
    "term": "charming",
    "meanings": [
        {
            "definition": "Delightful or attractive",
            "pos": "adjective",
            "sent1": "The puppy's charming eyes melted everyone's heart.",
            "sent2": "She wore a charming dress to the party.",
            "sent3": "The charming little squirrel stole the show with its acrobatic tricks.",
            "sent4": "The old bookstore had a charming smell of aged paper and ink.",
            "sent5": "The charming melody of the song lingered in the air long after it ended."
        },
        {
            "definition": "Pleasing or appealing",
            "pos": "adjective",
            "sent1": "The garden was charming with its colorful flowers.",
            "sent2": "His charming smile brightened up the room.",
            "sent3": "The charming aroma of freshly baked cookies filled the kitchen.",
            "sent4": "Her charming personality made her the favorite among her friends.",
            "sent5": "The charming view from the hilltop took their breath away."
        },
        {
            "definition": "Having the power to attract or please",
            "pos": "adjective",
            "sent1": "The charming painting caught the attention of all visitors.",
            "sent2": "The charming voice of the singer mesmerized the audience.",
            "sent3": "The charming magic trick left everyone in awe.",
            "sent4": "His charming wit always made people laugh.",
            "sent5": "The charming garden path led to a hidden oasis."
        },
        {
            "definition": "Enchanting or captivating",
            "pos": "adjective",
            "sent1": "The charming fairy tale kept the children spellbound.",
            "sent2": "The charming sunset painted the sky in hues of pink and gold.",
            "sent3": "The charming dance performance left the audience in a trance.",
            "sent4": "The charming old house had a mysterious aura around it.",
            "sent5": "The charming starlit night was like a scene from a dream."
        }
    ]
}