{
    "term": "charivari",
    "meanings": [
        {
            "definition": "A noisy mock serenade made with kettles, pans, and other utensils to a newly married couple.",
            "pos": "noun",
            "sent1": "During the wedding, the guests surprised the couple with a charivari using pots and pans.",
            "sent2": "The neighbors organized a charivari for the newlyweds, creating a joyful racket.",
            "sent3": "The charivari at the wedding was so loud that even the birds stopped chirping.",
            "sent4": "The clanging of the charivari echoed through the quiet night, announcing the marriage.",
            "sent5": "The charivari filled the air with a cacophony of celebration and love."
        },
        {
            "definition": "A discordant mock serenade to express disapproval or protest.",
            "pos": "noun",
            "sent1": "The protesters outside the building started a charivari to voice their discontent.",
            "sent2": "The crowd's charivari could be heard from blocks away, a chorus of dissatisfaction.",
            "sent3": "The charivari of disapproval grew louder as more people joined the protest.",
            "sent4": "The charivari of dissent rose like a storm, shaking the foundations of the establishment.",
            "sent5": "The charivari of protest reverberated through the streets, demanding to be heard."
        },
        {
            "definition": "A noisy, confused, and discordant sound or collection of sounds.",
            "pos": "noun",
            "sent1": "In the busy marketplace, the charivari of voices and music created a vibrant atmosphere.",
            "sent2": "The charivari of the city streets was a symphony of urban life, chaotic yet harmonious.",
            "sent3": "Amidst the charivari of the carnival, children laughed and adults cheered.",
            "sent4": "The charivari of nature's sounds in the forest was a soothing melody to the ears.",
            "sent5": "As the storm approached, the charivari of thunder and rain grew louder and more intense."
        }
    ]
}