{
    "term": "charters",
    "meanings": [
        {
            "definition": "A document issued by a government or other authority granting a right or power to an individual or group.",
            "pos": "noun",
            "sent1": "The school received a charter to operate independently.",
            "sent2": "The company's charter outlined its purpose and rules.",
            "sent3": "The pirate found a treasure map in an old charter.",
            "sent4": "Her smile was like a charter, granting happiness to all around her.",
            "sent5": "The ancient charter was written on yellowed parchment, filled with royal seals."
        },
        {
            "definition": "A formal statement of the rights and privileges of a company or organization.",
            "pos": "noun",
            "sent1": "The charter clearly listed the benefits for employees.",
            "sent2": "The organization's charter emphasized transparency and honesty.",
            "sent3": "The charter for the club included free pizza Fridays.",
            "sent4": "His handshake was a charter of trustworthiness.",
            "sent5": "The charter hung proudly on the office wall, symbolizing unity and purpose."
        },
        {
            "definition": "To hire or lease for exclusive use.",
            "pos": "verb",
            "sent1": "They decided to charter a boat for the fishing trip.",
            "sent2": "The family chartered a bus for the reunion.",
            "sent3": "She wanted to charter a hot air balloon for her birthday.",
            "sent4": "Chartering a private jet made the travel experience luxurious.",
            "sent5": "The group chartered a yacht for a day of sailing in the sun."
        },
        {
            "definition": "To establish by charter.",
            "pos": "verb",
            "sent1": "The king chartered a new town in the kingdom.",
            "sent2": "The company chartered a subsidiary to expand its operations.",
            "sent3": "They decided to charter a club for stargazing enthusiasts.",
            "sent4": "Chartering a new business required careful planning.",
            "sent5": "The explorer chartered a course through uncharted waters."
        }
    ]
}