{
    "term": "charitableness",
    "meanings": [
        {
            "definition": "The quality or state of being charitable.",
            "pos": "noun",
            "sent1": "Her charitableness was evident in the way she always helped others in need.",
            "sent2": "The community greatly appreciated his charitableness towards the homeless shelter.",
            "sent3": "His charitableness was so extreme that he once gave away his entire allowance.",
            "sent4": "The charitableness of the volunteers shone brightly during the charity event.",
            "sent5": "The little girl's charitableness knew no bounds as she shared her toys with everyone."
        },
        {
            "definition": "The act of giving help, typically in the form of money, to those in need.",
            "pos": "noun",
            "sent1": "The charitableness of the donors made a significant impact on the orphanage.",
            "sent2": "During the fundraiser, many people showed their charitableness by donating generously.",
            "sent3": "The businessman's charitableness extended to sponsoring the local youth soccer team.",
            "sent4": "Her charitableness was like a beacon of hope for the struggling families in the neighborhood.",
            "sent5": "The charitableness of the community was heartwarming as they rallied together to support the food bank."
        },
        {
            "definition": "A disposition to be kind and generous.",
            "pos": "noun",
            "sent1": "His charitableness towards animals led him to volunteer at the animal shelter.",
            "sent2": "The teacher's charitableness was evident in the way she supported her students.",
            "sent3": "Even in jest, his charitableness shone through as he offered his last cookie to a friend.",
            "sent4": "The charitableness of the elderly couple was like a warm hug to everyone they met.",
            "sent5": "The charitableness of the young boy was infectious, inspiring others to be kind as well."
        }
    ]
}