{
    "term": "charged",
    "meanings": [
        {
            "definition": "Having an electric charge.",
            "pos": "adjective",
            "sent1": "The charged balloon stuck to the ceiling.",
            "sent2": "The phone was fully charged and ready to use.",
            "sent3": "The charged socks made the cat's fur stand on end.",
            "sent4": "The charged atmosphere crackled with energy.",
            "sent5": "The charged wire sparked brightly when touched."
        },
        {
            "definition": "Filled with an emotional or intense quality.",
            "pos": "adjective",
            "sent1": "Her charged emotions overwhelmed her.",
            "sent2": "The room was charged with excitement before the concert.",
            "sent3": "The charged puppy wagged its tail happily.",
            "sent4": "The charged silence between them was palpable.",
            "sent5": "His charged words left a lasting impact on the audience."
        },
        {
            "definition": "Accused formally of a crime.",
            "pos": "noun",
            "sent1": "The charged stood silently in the courtroom.",
            "sent2": "The charged denied all allegations against him.",
            "sent3": "The charged's hat matched his suit perfectly.",
            "sent4": "The charged's expression remained stoic throughout the trial.",
            "sent5": "The charged's family supported him during the legal proceedings."
        },
        {
            "definition": "To ask for payment for goods or services.",
            "pos": "verb",
            "sent1": "The shopkeeper charged a fair price for the goods.",
            "sent2": "She charged her clients for the consultation.",
            "sent3": "The waiter charged the bill to the table.",
            "sent4": "He charged the customer for the repair work.",
            "sent5": "The company charged a fee for the delivery service."
        },
        {
            "definition": "To rush forward in attack.",
            "pos": "verb",
            "sent1": "The soldiers charged bravely towards the enemy.",
            "sent2": "The bull charged at the matador in the arena.",
            "sent3": "The knight charged into battle with his sword raised.",
            "sent4": "The players charged towards the goal in a final attempt.",
            "sent5": "The horse charged ahead, carrying its rider swiftly."
        }
    ]
}