{
    "term": "charr",
    "meanings": [
        {
            "definition": "To burn slightly or to scorch",
            "pos": "verb",
            "sent1": "She accidentally charrs the toast every morning.",
            "sent2": "The chef will charr the vegetables for extra flavor.",
            "sent3": "The campfire charrs the marshmallows perfectly.",
            "sent4": "The sun's rays charr the leaves in the heat of summer.",
            "sent5": "The candle charrs the edges of the paper as it burns."
        },
        {
            "definition": "A type of fish, similar to a trout",
            "pos": "noun",
            "sent1": "The charr swims gracefully in the clear stream.",
            "sent2": "Fishermen enjoy catching charr in the mountain lakes.",
            "sent3": "The charr in the aquarium seems to be the boss of the tank.",
            "sent4": "The shimmering scales of the charr reflect the sunlight beautifully.",
            "sent5": "The charr's swift movements make it a challenge to catch."
        },
        {
            "definition": "A type of fish, similar to a trout, that lives in cold water",
            "pos": "noun",
            "sent1": "The Arctic charr thrives in icy waters.",
            "sent2": "The charr's cold-water habitat keeps it healthy.",
            "sent3": "The charr family reunion in the chilly lake was a success.",
            "sent4": "The charr's silver scales glisten in the frigid lake.",
            "sent5": "The charr's survival skills in cold water are impressive."
        },
        {
            "definition": "To make a crackling sound when burning",
            "pos": "verb",
            "sent1": "The logs charr in the fireplace, creating a cozy atmosphere.",
            "sent2": "The bonfire charrs loudly on the beach at night.",
            "sent3": "The firewood charrs like popcorn in the campfire.",
            "sent4": "The leaves charr as they are consumed by the flames.",
            "sent5": "The old book charrs as it is thrown into the fire."
        }
    ]
}