{
    "term": "chartism",
    "meanings": [
        {
            "definition": "A political movement in Britain in the 19th century that advocated for political and social reform.",
            "pos": "noun",
            "sent1": "The history book discussed the impact of chartism on British society.",
            "sent2": "Many people studied chartism to understand its goals and impact.",
            "sent3": "The teacher joked that if she lived during chartism, she would have been a passionate reformer.",
            "sent4": "In the sea of political movements, chartism stood out like a bright beacon of change.",
            "sent5": "The echoes of chartism still resonate in the calls for social justice today."
        },
        {
            "definition": "The principles or practices of the Chartists.",
            "pos": "noun",
            "sent1": "Understanding chartism involves grasping its core beliefs and actions.",
            "sent2": "Scholars delve deep into the history of chartism to uncover its principles.",
            "sent3": "The humorist quipped that following chartism would mean a lot of meetings and manifestos.",
            "sent4": "In the realm of political ideologies, chartism shines with its unique values.",
            "sent5": "The essence of chartism is a tapestry woven with threads of reform and progress."
        },
        {
            "definition": "A supporter or member of the Chartists.",
            "pos": "noun",
            "sent1": "She proudly declared herself a champion of chartism.",
            "sent2": "Many workers in the factories became ardent followers of chartism.",
            "sent3": "The comedian teased that being a chartism enthusiast meant always carrying protest signs.",
            "sent4": "In the crowd of activists, the chartism advocate stood tall and resolute.",
            "sent5": "The spirit of chartism burned brightly in the hearts of its dedicated supporters."
        }
    ]
}