{
    "term": "chark",
    "meanings": [
        {
            "definition": "To burn slightly or to char",
            "pos": "verb",
            "sent1": "I accidentally charked the toast this morning.",
            "sent2": "The chef will chark the steak to perfection on the grill.",
            "sent3": "The marshmallow charked quickly over the campfire.",
            "sent4": "The edges of the paper started to chark under the intense heat.",
            "sent5": "Be careful not to chark the wood while roasting marshmallows."
        },
        {
            "definition": "Charred material",
            "pos": "noun",
            "sent1": "The firefighter found a piece of chark in the burnt building.",
            "sent2": "The artist used chark to create a unique texture in the painting.",
            "sent3": "The chark from the fire pit was used to start the next fire.",
            "sent4": "The ancient scroll showed signs of chark along the edges.",
            "sent5": "The archaeologist discovered a fragment of chark in the ruins."
        },
        {
            "definition": "A charred substance",
            "pos": "noun",
            "sent1": "The campers collected chark to use as tinder for the fire.",
            "sent2": "The chark on the wood indicated it had been burned before.",
            "sent3": "The detective found a trail of chark leading to the suspect.",
            "sent4": "The pot was covered in a layer of chark from the burnt stew.",
            "sent5": "The blacksmith used chark as a base for forging metal."
        },
        {
            "definition": "To scorch or burn slightly",
            "pos": "verb",
            "sent1": "The sun's rays charked my skin during the hike.",
            "sent2": "The iron was left on too long and started to chark the fabric.",
            "sent3": "The hot pan began to chark the pancake batter.",
            "sent4": "The candle flame charked the edges of the paper.",
            "sent5": "The intense heat from the fire charked the wooden fence."
        }
    ]
}