{
    "term": "charter",
    "meanings": [
        {
            "definition": "A written grant by a country's legislative or sovereign power, by which an institution such as a city, university, or corporation is created and its rights and privileges defined.",
            "pos": "noun",
            "sent1": "The city's charter outlined its rights and privileges.",
            "sent2": "The charter of the university established its foundation.",
            "sent3": "The charter for the city was like a special rulebook.",
            "sent4": "Her charter to explore the forest was filled with excitement.",
            "sent5": "The charter of the corporation was as important as a treasure map."
        },
        {
            "definition": "A document issued by a government or other authority, creating a public or private corporation, such as a city, college, or bank, and defining its privileges and purposes.",
            "pos": "noun",
            "sent1": "The bank's charter was signed by the government.",
            "sent2": "The city's charter was carefully reviewed by officials.",
            "sent3": "The charter for the college was like a key to success.",
            "sent4": "Her charter to start a business was a ticket to independence.",
            "sent5": "The charter of the corporation was as valuable as a golden ticket."
        },
        {
            "definition": "A contract by which an entire ship, or part of it, is leased for a voyage or a stated time.",
            "pos": "noun",
            "sent1": "The charter of the ship was agreed upon before the journey.",
            "sent2": "The company's charter for the vessel was signed by both parties.",
            "sent3": "The charter for the boat was like a rental agreement for the sea.",
            "sent4": "Her charter to sail the seas was a dream come true.",
            "sent5": "The charter of the ship was as important as a compass on the voyage."
        }
    ]
}