{
    "term": "chases",
    "meanings": [
        {
            "definition": "To pursue in order to catch or catch up with",
            "pos": "verb",
            "sent1": "The cat chases the mouse around the house.",
            "sent2": "The police officer chases the thief through the streets.",
            "sent3": "The playful puppy chases its tail in circles.",
            "sent4": "Time chases us all, never stopping for anyone.",
            "sent5": "The wind chases the leaves across the yard."
        },
        {
            "definition": "To follow in order to overtake or capture",
            "pos": "verb",
            "sent1": "The cheetah chases the gazelle across the savannah.",
            "sent2": "The detective chases the suspect through the alleys.",
            "sent3": "The child chases after the ice cream truck, hoping for a treat.",
            "sent4": "The shadows chases the light as the sun sets.",
            "sent5": "The waves chases the shore, never giving up."
        },
        {
            "definition": "To seek the favor or company of",
            "pos": "verb",
            "sent1": "The little girl chases her big brother around for attention.",
            "sent2": "The student chases the teacher after class to ask a question.",
            "sent3": "The cat chases its owner for a scratch behind the ears.",
            "sent4": "The fans chases the celebrity for an autograph.",
            "sent5": "The puppy chases its owner, eager for a walk."
        },
        {
            "definition": "To drive or expel by force or threat of force",
            "pos": "verb",
            "sent1": "The scarecrow chases the birds away from the crops.",
            "sent2": "The security guard chases the intruders out of the building.",
            "sent3": "The loud noise chases the silence from the room.",
            "sent4": "The storm chases the picnickers indoors with its rain.",
            "sent5": "The barking dog chases the mail carrier down the street."
        }
    ]
}