{
    "term": "chatoyant",
    "meanings": [
        {
            "definition": "Having a changeable luster or color with an undulating narrow band of white light.",
            "pos": "adjective",
            "sent1": "The chatoyant fabric shimmered in the sunlight, changing colors as I moved.",
            "sent2": "Her chatoyant eyes sparkled with a mesmerizing glow.",
            "sent3": "The chatoyant scarf seemed to dance with the light, making it hard to look away.",
            "sent4": "The lake looked chatoyant under the moonlight, like a magical pathway on water.",
            "sent5": "The butterfly's wings were chatoyant, reflecting a rainbow of colors in the garden."
        },
        {
            "definition": "A gemstone or mineral that exhibits a cat's-eye effect.",
            "pos": "noun",
            "sent1": "He wore a chatoyant ring that caught the light and glowed like a feline eye.",
            "sent2": "The chatoyant gemstone seemed to follow you with its mysterious gaze.",
            "sent3": "The chatoyant stone was so captivating, it felt like having a tiny cat companion.",
            "sent4": "The chatoyant mineral was like holding a piece of the night sky in your hand.",
            "sent5": "The chatoyant gem sparkled like a hidden treasure waiting to be discovered."
        },
        {
            "definition": "A fabric or material that reflects light in a way that resembles the eye of a cat.",
            "pos": "noun",
            "sent1": "The dress was made of a chatoyant material that glinted like a cat's eye in the sun.",
            "sent2": "The curtains in the room were chatoyant, casting playful shadows on the walls.",
            "sent3": "The chatoyant fabric seemed to wink at me as if it had a secret to share.",
            "sent4": "The tablecloth looked chatoyant, as if a mischievous cat had left its mark.",
            "sent5": "The pillow was covered in a chatoyant fabric that made it feel like a cozy cat nap spot."
        }
    ]
}