{
    "term": "chauvinisms",
    "meanings": [
        {
            "definition": "Excessive patriotism or nationalism.",
            "pos": "noun",
            "sent1": "His chauvinisms made him always put his country first.",
            "sent2": "Her chauvinisms were evident in the way she proudly waved the national flag.",
            "sent3": "The man's chauvinisms were so extreme that he painted his entire house in the national colors.",
            "sent4": "The chauvinisms of the politician were like a loud trumpet blaring patriotism.",
            "sent5": "The chauvinisms of the old veteran were as deep as the roots of an ancient tree."
        },
        {
            "definition": "Prejudiced belief in the superiority of one's own gender.",
            "pos": "noun",
            "sent1": "She displayed her chauvinisms by claiming that women were inherently better leaders.",
            "sent2": "His chauvinisms led him to believe that men were more rational than women.",
            "sent3": "The comedian joked about the absurdity of gender chauvinisms in a hilarious skit.",
            "sent4": "Her gender chauvinisms were like a thick fog clouding her judgment.",
            "sent5": "The teacher addressed the students' chauvinisms by promoting equality and respect for all genders."
        },
        {
            "definition": "Belief in the superiority of one's own race.",
            "pos": "noun",
            "sent1": "Their chauvinisms led to discriminatory practices against people of different races.",
            "sent2": "The history of colonialism is filled with examples of racial chauvinisms.",
            "sent3": "The absurdity of racial chauvinisms was highlighted in a satirical cartoon.",
            "sent4": "His racial chauvinisms were like a heavy chain weighing down his interactions with others.",
            "sent5": "The consequences of racial chauvinisms can be seen in the scars it leaves on society."
        }
    ]
}