{
    "term": "chavvy",
    "meanings": [
        {
            "definition": "Resembling or characteristic of a chav",
            "pos": "adjective",
            "sent1": "The outfit she wore was so chavvy, with the flashy jewelry and tracksuit.",
            "sent2": "The graffiti on the wall had a chavvy style, full of bold colors and slang words.",
            "sent3": "He tried to act chavvy by speaking in a fake accent, but it just sounded silly.",
            "sent4": "The car's loud engine noise gave it a chavvy vibe, like it was trying too hard to be cool.",
            "sent5": "The party decorations had a chavvy look, with neon lights and cheap plastic ornaments."
        },
        {
            "definition": "Behaving in a manner associated with chavs",
            "pos": "adjective",
            "sent1": "She acted chavvy by shouting loudly and causing a scene in the store.",
            "sent2": "The group of teenagers were being chavvy, throwing trash on the ground and being rude.",
            "sent3": "His attempt to be chavvy by blasting music from his phone just annoyed everyone around him.",
            "sent4": "The way he spoke with slang and swagger made him seem chavvy to those around him.",
            "sent5": "The rowdy behavior at the concert was definitely chavvy, with people pushing and shoving to get to the front."
        },
        {
            "definition": "A person who exhibits traits typically associated with chavs",
            "pos": "noun",
            "sent1": "The chavvy was known for always wearing oversized hoodies and baseball caps.",
            "sent2": "She avoided sitting near the chavvy in class, who often disrupted the lesson with loud comments.",
            "sent3": "The chavvy at the party tried to impress everyone with his flashy jewelry and loud stories.",
            "sent4": "The group of chavvies gathered at the park, talking loudly and causing a commotion.",
            "sent5": "The chavvy's behavior drew attention, with their loud music and constant swearing."
        }
    ]
}