{
    "term": "cheapen",
    "meanings": [
        {
            "definition": "To make something less valuable or of lower quality.",
            "pos": "verb",
            "sent1": "She tried to cheapen the painting by adding fake signatures.",
            "sent2": "The store decided to cheapen their products to attract more customers.",
            "sent3": "The magician's attempt to cheapen the value of the diamond with a simple trick failed miserably.",
            "sent4": "His constant lies cheapen his reputation like a stain on a white shirt.",
            "sent5": "The factory's decision to use cheaper materials only served to cheapen the final product."
        },
        {
            "definition": "To lower the price of something.",
            "pos": "verb",
            "sent1": "The supermarket decided to cheapen the fruits to clear out the stock.",
            "sent2": "During the sale, the company will cheapen their electronics to attract more buyers.",
            "sent3": "The auctioneer's attempt to cheapen the starting bid resulted in a bidding frenzy.",
            "sent4": "The hotel's decision to cheapen their room rates led to a surge in bookings.",
            "sent5": "The store's strategy to cheapen their prices during the holiday season paid off with increased sales."
        },
        {
            "definition": "To reduce the esteem or respect for something.",
            "pos": "verb",
            "sent1": "His rude behavior towards the guests cheapened the reputation of the hotel.",
            "sent2": "Gossiping about others can cheapen your own character in the eyes of others.",
            "sent3": "The comedian's attempt to cheapen the seriousness of the event with his jokes backfired.",
            "sent4": "The scandal only served to cheapen the image of the once-respected politician.",
            "sent5": "Her constant bragging only served to cheapen her achievements in the eyes of her peers."
        }
    ]
}