{
    "term": "cheat",
    "meanings": [
        {
            "definition": "Act dishonestly or unfairly in order to gain an advantage.",
            "pos": "verb",
            "sent1": "He tried to cheat by peeking at the answers during the test.",
            "sent2": "She felt guilty after she realized her friend was trying to cheat on the game.",
            "sent3": "The magician's rabbit tried to cheat by hiding in the hat instead of coming out.",
            "sent4": "The sun seemed to cheat by peeking through the clouds on the rainy day.",
            "sent5": "The student's attempt to cheat was quickly noticed by the teacher."
        },
        {
            "definition": "Deceive or trick someone.",
            "pos": "verb",
            "sent1": "The scammer tried to cheat the old lady out of her savings.",
            "sent2": "He didn't want to cheat his friend, so he decided to tell the truth.",
            "sent3": "The mischievous cat tried to cheat the dog by hiding behind the curtains.",
            "sent4": "The shadows seemed to cheat the light by dancing on the wall.",
            "sent5": "She felt betrayed when she realized her partner was trying to cheat her."
        },
        {
            "definition": "Avoid something undesirable by luck or skill.",
            "pos": "verb",
            "sent1": "He managed to cheat death by narrowly escaping the car accident.",
            "sent2": "She tried to cheat the rain by running faster to reach home.",
            "sent3": "The clever fox tried to cheat the hunter by leaving false tracks.",
            "sent4": "The butterfly seemed to cheat the wind by fluttering gracefully in the air.",
            "sent5": "The athlete's determination helped him cheat defeat and win the race."
        },
        {
            "definition": "A person who acts dishonestly or unfairly in order to gain an advantage.",
            "pos": "noun",
            "sent1": "The cheat was caught red-handed while trying to alter the scores.",
            "sent2": "She didn't want to be friends with a cheat who always lied.",
            "sent3": "The sneaky raccoon was known as the neighborhood cheat for stealing food.",
            "sent4": "The cheat in the game seemed to have an unfair advantage over the others.",
            "sent5": "The cheat's reputation spread quickly among the students in the school."
        }
    ]
}