{
    "term": "check",
    "meanings": [
        {
            "definition": "To stop or slow down the progress of something.",
            "pos": "verb",
            "sent1": "Please check the speed of the car before it goes too fast.",
            "sent2": "I always check my watch to make sure I'm not late.",
            "sent3": "I tried to check time itself, but it kept moving forward.",
            "sent4": "Her smile was a check on his anger, calming him instantly.",
            "sent5": "The teacher used a bell to check the noisy classroom."
        },
        {
            "definition": "A written order to a bank to pay a stated sum from the drawer's account.",
            "pos": "noun",
            "sent1": "He wrote a check to pay for his groceries at the store.",
            "sent2": "She received a check as a gift for her birthday.",
            "sent3": "The check danced in the wind as it fell from his pocket.",
            "sent4": "The check was like a magic ticket, granting access to anything.",
            "sent5": "The check had the power to turn paper into money."
        },
        {
            "definition": "A mark indicating that something has been noted, verified, or completed.",
            "pos": "noun",
            "sent1": "The check on the paper showed it was approved.",
            "sent2": "He put a check next to each item on the list as he finished it.",
            "sent3": "The check winked at her, letting her know it was done.",
            "sent4": "The check was like a stamp of approval, making everything official.",
            "sent5": "The check was a bright sign that the task was finished."
        },
        {
            "definition": "To examine or inspect something closely.",
            "pos": "verb",
            "sent1": "I need to check the ingredients before I eat this.",
            "sent2": "She always checks her work for mistakes before submitting it.",
            "sent3": "He tried to check the tiny ant with a magnifying glass.",
            "sent4": "The detective had to check every detail to solve the case.",
            "sent5": "She used a flashlight to check the dark corners of the room."
        },
        {
            "definition": "A sudden stop or pause.",
            "pos": "noun",
            "sent1": "The sudden check in the music surprised everyone.",
            "sent2": "He felt a check in his heart when he saw her smile.",
            "sent3": "The check in the conversation made everyone look around.",
            "sent4": "The check in the race allowed the other runner to catch up.",
            "sent5": "The check in the movie made everyone hold their breath."
        }
    ]
}