{
    "term": "checkrows",
    "meanings": [
        {
            "definition": "A series of rows in a field where crops are planted in a checked or alternating pattern.",
            "pos": "noun",
            "sent1": "The farmer planted the corn in neat checkrows to ensure proper spacing.",
            "sent2": "The checkrows in the field made it easier to navigate and harvest the crops.",
            "sent3": "The birds hopped along the checkrows, pretending to be tiny farmers inspecting their land.",
            "sent4": "The checkrows stretched out like a giant patchwork quilt across the vast field.",
            "sent5": "The checkrows stood out like soldiers in formation, ready to protect the growing crops."
        },
        {
            "definition": "To mark off or divide into rows, especially in a checked or alternating pattern.",
            "pos": "verb",
            "sent1": "She used a stick to checkrows the garden for planting different vegetables.",
            "sent2": "The farmer decided to checkrows the field to make it easier to manage.",
            "sent3": "The kids playfully checkrowsed the sand at the beach, creating imaginary boundaries.",
            "sent4": "His words seemed to checkrows the audience into distinct groups of agreement and disagreement.",
            "sent5": "The artist's brush strokes checkrowsed the canvas, creating a beautiful masterpiece."
        },
        {
            "definition": "To inspect or examine something closely or carefully.",
            "pos": "verb",
            "sent1": "The detective had to checkrows the evidence to solve the mystery.",
            "sent2": "Before buying a used car, it's important to checkrows it thoroughly for any issues.",
            "sent3": "The curious cat decided to checkrows the new visitor in the house.",
            "sent4": "Her eyes seemed to checkrows every detail of the painting, trying to understand its meaning.",
            "sent5": "The scientist used a magnifying glass to checkrows the tiny insect under the microscope."
        }
    ]
}