{
    "term": "cheders",
    "meanings": [
        {
            "definition": "A traditional Jewish elementary school",
            "pos": "noun",
            "sent1": "The cheders in the neighborhood provide education to young children.",
            "sent2": "Parents often send their kids to cheders to learn about their faith.",
            "sent3": "The cheders were so full of energy, it felt like a bustling marketplace of knowledge.",
            "sent4": "In the sea of learning, the cheders stood tall like ancient libraries of wisdom.",
            "sent5": "The colorful walls of the cheders echoed with the laughter of students eager to learn."
        },
        {
            "definition": "The plural form of 'cheder', meaning a traditional Jewish elementary school",
            "pos": "noun",
            "sent1": "Many cheders across the city cater to the Jewish community's educational needs.",
            "sent2": "Visiting different cheders helped me understand the diversity within Jewish education.",
            "sent3": "The cheders lined up next to each other looked like a row of colorful beehives.",
            "sent4": "The cheders, like blooming flowers, spread knowledge and wisdom in the community.",
            "sent5": "The cheders hummed with the sounds of children learning and growing together."
        },
        {
            "definition": "The possessive form of 'cheder', meaning belonging to a traditional Jewish elementary school",
            "pos": "noun",
            "sent1": "The teacher's dedication to the cheders' success was truly inspiring.",
            "sent2": "The students' artwork adorned the walls of the cheders with creativity.",
            "sent3": "The cheders' playground was a lively hub of laughter and play.",
            "sent4": "The cheders' influence on the community was profound and long-lasting.",
            "sent5": "The cheders' doors welcomed all who sought knowledge and understanding."
        }
    ]
}