{
    "term": "cheer",
    "meanings": [
        {
            "definition": "a shout of encouragement, praise, or joy",
            "pos": "noun, interjection",
            "sent1": "The crowd let out a cheer when the team scored a goal.",
            "sent2": "I heard a cheer from the audience after the performance.",
            "sent3": "The cheer from the fans motivated the players to do their best.",
            "sent4": "Her cheer echoed through the stadium, filling everyone with excitement.",
            "sent5": "The cheer of the crowd was deafening, showing their support for the team."
        },
        {
            "definition": "a feeling of happiness or positivity",
            "pos": "noun",
            "sent1": "Seeing her smile filled me with cheer.",
            "sent2": "The holiday season always brings a sense of cheer to the town.",
            "sent3": "His cheerful attitude spread cheer to everyone around him.",
            "sent4": "The cheer in the air was contagious, lifting everyone's spirits.",
            "sent5": "The cheer in her voice was evident, reflecting her inner joy."
        },
        {
            "definition": "to make happier or more cheerful",
            "pos": "verb",
            "sent1": "I tried to cheer up my friend by telling jokes.",
            "sent2": "Her favorite song never fails to cheer her during tough times.",
            "sent3": "The funny movie managed to cheer him up after a long day.",
            "sent4": "The surprise visit from her family cheered her immensely.",
            "sent5": "The kind words from her friend cheered her instantly."
        },
        {
            "definition": "to applaud or shout in support or praise",
            "pos": "verb",
            "sent1": "The audience began to cheer as the speaker concluded his speech.",
            "sent2": "We all cheered for our friend as she crossed the finish line.",
            "sent3": "The students decided to cheer for their teacher during the assembly.",
            "sent4": "The fans continued to cheer for their team despite the rain.",
            "sent5": "The crowd started to cheer loudly, showing their appreciation for the performance."
        }
    ]
}