{
    "term": "chemotherapists",
    "meanings": [
        {
            "definition": "A person who administers chemotherapy to treat cancer.",
            "pos": "noun",
            "sent1": "The chemotherapists carefully prepare the chemotherapy for the patient.",
            "sent2": "The hospital hired more chemotherapists to help with the increasing number of cancer cases.",
            "sent3": "The chemotherapists joked that mixing chemotherapy was like creating a magical potion.",
            "sent4": "The chemotherapists are the warriors fighting against cancer with their powerful weapon.",
            "sent5": "The image of the chemotherapists diligently working to save lives stayed with me."
        },
        {
            "definition": "A medical professional specializing in the use of chemotherapy.",
            "pos": "noun",
            "sent1": "The experienced chemotherapists knew exactly how to adjust the chemotherapy dosage.",
            "sent2": "Becoming a chemotherapists requires years of specialized training and dedication.",
            "sent3": "The chemotherapists were like wizards using chemotherapy to battle the evil cancer cells.",
            "sent4": "In the world of cancer treatment, the chemotherapists are the heroes in white coats.",
            "sent5": "The role of the chemotherapists in saving lives cannot be overstated."
        },
        {
            "definition": "Those who provide chemotherapy treatment to patients.",
            "pos": "noun",
            "sent1": "The team of chemotherapists worked together to ensure each patient received the best care.",
            "sent2": "The chemotherapists comforted the patients during their chemotherapy sessions.",
            "sent3": "The chemotherapists turned the chemotherapy room into a place of hope and healing.",
            "sent4": "To the patients, the chemotherapists were the angels guiding them through a difficult journey.",
            "sent5": "The dedication of the chemotherapists shone brightly in the oncology department."
        }
    ]
}