{
    "term": "cherished",
    "meanings": [
        {
            "definition": "Hold dear",
            "pos": "verb",
            "sent1": "I cherished the handmade gift from my friend.",
            "sent2": "She cherishes her family more than anything else.",
            "sent3": "The little girl cherished her teddy bear so much that she took it everywhere.",
            "sent4": "The memories of that summer camp will always be cherished in my heart.",
            "sent5": "The old man cherished the photo of his late wife, holding it close every night."
        },
        {
            "definition": "Adored",
            "pos": "adjective",
            "sent1": "The cherished puppy wagged its tail happily.",
            "sent2": "The cherished painting was displayed prominently in the gallery.",
            "sent3": "The cherished kitten purred contently in its owner's lap.",
            "sent4": "The cherished book was passed down through generations.",
            "sent5": "The cherished ring sparkled on her finger, a symbol of their love."
        },
        {
            "definition": "Treasured",
            "pos": "adjective",
            "sent1": "The cherished memories of childhood brought a smile to her face.",
            "sent2": "The cherished necklace was a family heirloom.",
            "sent3": "The cherished toy was carefully kept on the shelf, away from dust.",
            "sent4": "The cherished friendship lasted a lifetime.",
            "sent5": "The cherished possession was kept safe in a locked box."
        },
        {
            "definition": "Valued highly",
            "pos": "adjective",
            "sent1": "The cherished antique vase was worth a fortune.",
            "sent2": "The cherished employee was given a promotion for their hard work.",
            "sent3": "The cherished recipe was a closely guarded secret.",
            "sent4": "The cherished painting was the centerpiece of the art collection.",
            "sent5": "The cherished heirloom was passed down from generation to generation."
        }
    ]
}