{
    "term": "chi",
    "meanings": [
        {
            "definition": "The vital energy that is held to animate the body internally",
            "pos": "noun",
            "sent1": "She believed in the power of her chi to keep her strong and healthy.",
            "sent2": "Yoga and meditation can help balance your chi and improve your well-being.",
            "sent3": "When he drank his morning coffee, he joked that it was his chi fueling him for the day.",
            "sent4": "Her positive attitude acted as a source of chi, radiating energy to those around her.",
            "sent5": "The ancient practice of Tai Chi focuses on harnessing and directing one's chi for health benefits."
        },
        {
            "definition": "A Chinese unit of length equal to about 0.3 meters",
            "pos": "noun",
            "sent1": "The table was approximately one chi wide.",
            "sent2": "The fabric was measured in chis to ensure it was the right length.",
            "sent3": "She laughed when her friend guessed her height as three chis tall.",
            "sent4": "The road sign indicated the distance to the next town was two chis away.",
            "sent5": "The carpenter used a chi ruler to mark the wood for cutting."
        },
        {
            "definition": "A letter of the Greek alphabet",
            "pos": "noun",
            "sent1": "In Greek class, they learned about the letter chi and its pronunciation.",
            "sent2": "The word 'chorus' starts with the letter chi in Greek.",
            "sent3": "He doodled the letter chi on his notebook while daydreaming in class.",
            "sent4": "The symbol for chi in the Greek alphabet resembles an 'X'.",
            "sent5": "The ancient text was written in Greek, with the letter chi appearing frequently."
        },
        {
            "definition": "A letter of the Hebrew alphabet",
            "pos": "noun",
            "sent1": "The Hebrew word for 'life' starts with the letter chi.",
            "sent2": "She practiced writing the letter chi in Hebrew calligraphy.",
            "sent3": "During the lesson, they discussed the significance of the letter chi in Hebrew texts.",
            "sent4": "The Torah contains many instances of the letter chi in its verses.",
            "sent5": "The rabbi pointed to the letter chi on the board, explaining its meaning in the alphabet."
        }
    ]
}