{
    "term": "chiao",
    "meanings": [
        {
            "definition": "A Chinese monetary unit",
            "pos": "noun",
            "sent1": "In ancient China, people used the chiao to buy goods.",
            "sent2": "The shopkeeper accepted the chiao as payment for the silk.",
            "sent3": "The chiao rolled off the table and into the piggy bank, eager to join its friends.",
            "sent4": "The chiao shone like a tiny sun in the merchant's hand.",
            "sent5": "The sound of the chiao hitting the wooden counter echoed through the market."
        },
        {
            "definition": "A Vietnamese noodle soup",
            "pos": "noun",
            "sent1": "The aroma of the chiao filled the kitchen, making everyone hungry.",
            "sent2": "She slurped the hot chiao eagerly, savoring the flavors.",
            "sent3": "The chiao jumped out of the bowl and danced around the table, much to everyone's surprise.",
            "sent4": "The steam rising from the chiao looked like a cloud of deliciousness.",
            "sent5": "With each spoonful of chiao, she felt warmth spreading through her body."
        },
        {
            "definition": "A type of Italian bread",
            "pos": "noun",
            "sent1": "The baker's chiao was crusty on the outside and soft inside.",
            "sent2": "She spread butter on the warm chiao and enjoyed it with her soup.",
            "sent3": "The chiao tried to escape from the bread basket, but the napkin caught it just in time.",
            "sent4": "The aroma of freshly baked chiao filled the entire neighborhood.",
            "sent5": "The chiao crunched satisfyingly under her teeth, releasing a burst of flavor."
        },
        {
            "definition": "A greeting in Italian",
            "pos": "noun",
            "sent1": "As they passed each other on the street, they exchanged a friendly chiao.",
            "sent2": "The chiao echoed in the quiet room, breaking the silence.",
            "sent3": "The chiao waved at her from across the room, making her smile.",
            "sent4": "The chiao hung in the air like a musical note, harmonizing with the surroundings.",
            "sent5": "His cheerful chiao brightened her day, even though they were strangers."
        },
        {
            "definition": "A type of Chinese martial art",
            "pos": "noun",
            "sent1": "He practiced chiao diligently, aiming to master the art.",
            "sent2": "The chiao master moved with grace and precision, impressing the spectators.",
            "sent3": "The chiao leaped off the page of the ancient scroll, coming to life before his eyes.",
            "sent4": "His movements in chiao were as fluid as a river, unstoppable and powerful.",
            "sent5": "The chiao training left his muscles sore but his spirit invigorated."
        }
    ]
}