{
    "term": "chichier",
    "meanings": [
        {
            "definition": "Stylish or fashionable in a pretentious or excessive way.",
            "pos": "adjective",
            "sent1": "She wore a chichier dress to the party, standing out with its flashy design.",
            "sent2": "The boutique displayed chichier clothes that caught everyone's attention.",
            "sent3": "His chichier hat made him look like a walking fashion show.",
            "sent4": "The chichier decorations at the event transformed the venue into a glamorous paradise.",
            "sent5": "The chichier jewelry sparkled under the bright lights, drawing admiring glances."
        },
        {
            "definition": "Someone who is overly concerned with being fashionable or stylish.",
            "pos": "noun",
            "sent1": "She was known as the chichier of the group, always following the latest trends.",
            "sent2": "The chichier in the office always had the most eye-catching outfits.",
            "sent3": "The chichier's closet was overflowing with designer labels and accessories.",
            "sent4": "Being a chichier meant constantly seeking validation through appearance.",
            "sent5": "The chichier's Instagram was filled with selfies showcasing their fashion sense."
        },
        {
            "definition": "To make something more elaborate or showy in a way that is considered excessive or pretentious.",
            "pos": "verb",
            "sent1": "She decided to chichier up the room by adding glitter to the decorations.",
            "sent2": "The designer chichiered the dress with sequins and feathers for the runway show.",
            "sent3": "He always chichiered up his stories to make them more interesting.",
            "sent4": "The chef chichiered the dessert with edible gold leaf for a touch of luxury.",
            "sent5": "The artist chichiered the painting by adding intricate details to every corner."
        }
    ]
}