{
    "term": "chiliarchs",
    "meanings": [
        {
            "definition": "A commander of a thousand soldiers in ancient Greece or Rome.",
            "pos": "noun",
            "sent1": "The chiliarchs led a group of one thousand soldiers into battle.",
            "sent2": "The chiliarchs were responsible for organizing and commanding large military units.",
            "sent3": "The chiliarchs decided to have a chili cook-off to boost morale among the soldiers.",
            "sent4": "The chiliarchs' authority over the troops was as strong as the aroma of a spicy chili.",
            "sent5": "The chiliarchs' presence on the battlefield was as powerful as a thousand soldiers marching in unison."
        },
        {
            "definition": "A military officer in charge of a thousand men.",
            "pos": "noun",
            "sent1": "Each chiliarchs oversaw the training of one thousand soldiers.",
            "sent2": "The chiliarchs were respected leaders among the troops under their command.",
            "sent3": "The chiliarchs organized a surprise party for the soldiers to boost morale.",
            "sent4": "The chiliarchs' influence over the soldiers was as significant as a thousand voices united.",
            "sent5": "The chiliarchs' orders echoed through the ranks like the sound of a thousand marching feet."
        },
        {
            "definition": "A leader of a thousand troops.",
            "pos": "noun",
            "sent1": "The chiliarchs strategized the movements of a large army.",
            "sent2": "As chiliarchs, they were responsible for the well-being of a thousand troops.",
            "sent3": "The chiliarchs organized a team-building retreat for the soldiers.",
            "sent4": "The chiliarchs' guidance was as crucial as a beacon for a thousand lost souls.",
            "sent5": "The chiliarchs' presence on the battlefield was as commanding as a thousand flags waving in the wind."
        }
    ]
}