{
    "term": "chimineas",
    "meanings": [
        {
            "definition": "A freestanding fireplace or oven with a bulbous body and a vertical chimney.",
            "pos": "noun",
            "sent1": "We gathered around the chimineas to roast marshmallows on a chilly evening.",
            "sent2": "The chimineas in the backyard kept us warm during the outdoor party.",
            "sent3": "The chimineas looked like friendly giants with their tall chimneys puffing smoke.",
            "sent4": "The chimineas stood like guardians, protecting us from the cold with their fiery hearts.",
            "sent5": "The chimineas glowed in the darkness, casting a cozy light around the patio."
        },
        {
            "definition": "A type of outdoor fireplace or fire pit typically made of clay or metal.",
            "pos": "noun",
            "sent1": "The chimineas in the garden added a rustic charm to the outdoor space.",
            "sent2": "We sat around the chimineas, enjoying the crackling sound of the fire.",
            "sent3": "The chimineas seemed to whisper stories of ancient gatherings around the flames.",
            "sent4": "The chimineas gleamed like treasure chests, holding the warmth of the fire within.",
            "sent5": "The chimineas danced with flames, painting shadows on the grass around them."
        },
        {
            "definition": "A decorative and functional outdoor heating appliance.",
            "pos": "noun",
            "sent1": "The chimineas on the patio added a touch of elegance to the outdoor decor.",
            "sent2": "We gathered around the chimineas, feeling the heat radiating from the fire.",
            "sent3": "The chimineas winked playfully in the moonlight, inviting us to sit by the fire.",
            "sent4": "The chimineas hummed with warmth, like a cozy heartbeat in the cool evening.",
            "sent5": "The chimineas stood proudly, their chimneys reaching for the stars above."
        }
    ]
}