{
    "term": "chink",
    "meanings": [
        {
            "definition": "A narrow opening or crack",
            "pos": "noun",
            "sent1": "The sunlight peeked through the chink in the curtains.",
            "sent2": "I found a chink in the wall where the mouse could have entered.",
            "sent3": "The squirrel squeezed through the chink in the fence and escaped.",
            "sent4": "Her smile revealed a chink of light in his gloomy day.",
            "sent5": "The detective discovered a crucial chink in the suspect's alibi."
        },
        {
            "definition": "A derogatory term for a person of Chinese descent",
            "pos": "noun",
            "sent1": "Using the word 'chink' to refer to someone is offensive and hurtful.",
            "sent2": "She was hurt by the racial slur that called her a chink.",
            "sent3": "The comedian's joke about being a 'chink in the armor' fell flat.",
            "sent4": "The term 'chink' is a hurtful label that should never be used.",
            "sent5": "He felt the sting of being called a 'chink' by his classmate."
        },
        {
            "definition": "A sharp, metallic sound",
            "pos": "noun",
            "sent1": "The chink of the hammer hitting the metal echoed in the workshop.",
            "sent2": "The chink of the coins in the jar signaled his arrival home.",
            "sent3": "The chink of the glass breaking startled the sleeping cat.",
            "sent4": "The chink of the sword being drawn sent shivers down his spine.",
            "sent5": "The chink of the keys jingling announced her entrance into the room."
        },
        {
            "definition": "To make a narrow opening or crack",
            "pos": "verb",
            "sent1": "He used a chisel to chink a hole in the stone wall.",
            "sent2": "The carpenter will chink the logs to seal the cabin from the cold.",
            "sent3": "She tried to chink the door open with a credit card.",
            "sent4": "The hiker had to chink a path through the thick bushes.",
            "sent5": "The mason will chink the bricks carefully to avoid any gaps."
        }
    ]
}