{
    "term": "chinook",
    "meanings": [
        {
            "definition": "A warm, dry wind that blows down the eastern slopes of the Rocky Mountains.",
            "pos": "noun",
            "sent1": "The gentle chinook brought relief from the cold winter.",
            "sent2": "I felt the chinook on my face as I walked outside.",
            "sent3": "The chinook whispered secrets as it passed through the valley.",
            "sent4": "The chinook danced through the trees, carrying warmth with it.",
            "sent5": "The chinook's arrival signaled the end of winter's grasp."
        },
        {
            "definition": "A breed of large, powerful sled dog.",
            "pos": "noun",
            "sent1": "The chinook sled dog pulled the heavy load effortlessly.",
            "sent2": "We trained the chinook to be a reliable companion on our expeditions.",
            "sent3": "The playful chinook pup chased its tail in circles.",
            "sent4": "The chinook's strength and loyalty made it a favorite among mushers.",
            "sent5": "The chinook's howl echoed through the snowy landscape."
        },
        {
            "definition": "A type of salmon found in the Pacific Northwest.",
            "pos": "noun",
            "sent1": "The chinook salmon leaped upstream to spawn.",
            "sent2": "We grilled the chinook salmon for dinner last night.",
            "sent3": "The cheeky chinook salmon splashed water at the fishermen.",
            "sent4": "The shimmering scales of the chinook salmon caught the sunlight.",
            "sent5": "The chinook salmon's journey was filled with obstacles and triumphs."
        },
        {
            "definition": "A type of helicopter used for transporting troops and equipment.",
            "pos": "noun",
            "sent1": "The chinook helicopter landed gracefully on the field.",
            "sent2": "Soldiers boarded the chinook for their mission behind enemy lines.",
            "sent3": "The noisy chinook helicopter startled the wildlife in the area.",
            "sent4": "The powerful blades of the chinook sliced through the air.",
            "sent5": "The chinook helicopter's arrival signaled reinforcements were on the way."
        }
    ]
}