{
    "term": "ching",
    "meanings": [
        {
            "definition": "A sharp ringing sound",
            "pos": "noun",
            "sent1": "The ching of the bell echoed through the quiet room.",
            "sent2": "I heard a ching coming from the wind chimes outside.",
            "sent3": "The ching of the alarm clock woke me up with a start.",
            "sent4": "The ching of the metal against metal was like music to his ears.",
            "sent5": "The ching of the glass breaking made everyone jump in surprise."
        },
        {
            "definition": "Money, especially in large amounts",
            "pos": "noun",
            "sent1": "He made a ching from his successful business venture.",
            "sent2": "She saved up quite a ching from her part-time job.",
            "sent3": "Finding a bag full of ching on the street would be a dream come true!",
            "sent4": "His eyes gleamed at the sight of the shiny ching in the briefcase.",
            "sent5": "The ching in his pocket made him feel like a wealthy man."
        },
        {
            "definition": "To make a high-pitched ringing sound",
            "pos": "verb",
            "sent1": "The teapot began to ching as the water inside boiled.",
            "sent2": "The metal wires ching when you run your fingers along them.",
            "sent3": "The old door chinged loudly every time it was opened.",
            "sent4": "Her laughter chinged like bells in the crisp winter air.",
            "sent5": "The wind chinged through the trees, creating a soothing melody."
        },
        {
            "definition": "To hit or strike something with force",
            "pos": "verb",
            "sent1": "He chinged the hammer against the nail to secure it in place.",
            "sent2": "The boxer chinged his opponent with a powerful punch.",
            "sent3": "She accidentally chinged her elbow on the corner of the table.",
            "sent4": "The waves chinged against the rocks, creating a rhythmic sound.",
            "sent5": "The knight chinged his sword against his shield before battle."
        }
    ]
}