{
    "term": "chipotle",
    "meanings": [
        {
            "definition": "A smoked and dried jalapeño pepper.",
            "pos": "noun",
            "sent1": "I added some chopped chipotle to the stew for a smoky flavor.",
            "sent2": "The chipotle added a nice kick to the salsa.",
            "sent3": "The chipotle pepper walked into the barbecue, feeling all smoked and dried.",
            "sent4": "Her laughter was like a chipotle, spicy and lingering in the air.",
            "sent5": "The chipotle pepper, with its deep red color, looked like a little sun-dried jewel."
        },
        {
            "definition": "A spicy sauce made from chipotle peppers.",
            "pos": "noun",
            "sent1": "The chipotle sauce gave the tacos a delicious heat.",
            "sent2": "She drizzled the chipotle over the grilled chicken for extra flavor.",
            "sent3": "The chipotle sauce whispered to the tacos, 'I'm here to spice things up!'",
            "sent4": "His words were like chipotle sauce, leaving a fiery trail in her mind.",
            "sent5": "The aroma of chipotle sauce filled the kitchen, making mouths water."
        },
        {
            "definition": "A type of seasoning made from chipotle peppers.",
            "pos": "noun",
            "sent1": "The chipotle seasoning added a smoky taste to the dish.",
            "sent2": "I sprinkled some chipotle on the popcorn for a flavorful snack.",
            "sent3": "The chipotle seasoning tap-danced on the chicken, adding a spicy twist.",
            "sent4": "Her smile was like chipotle seasoning, adding warmth to the room.",
            "sent5": "The chipotle seasoning danced on the taste buds, leaving a delightful tingle."
        },
        {
            "definition": "A type of chili pepper.",
            "pos": "noun",
            "sent1": "The chipotle pepper had a rich, smoky flavor.",
            "sent2": "She used chipotle peppers in her chili for a bold taste.",
            "sent3": "The chipotle pepper high-fived the jalapeño, feeling like a spicy superstar.",
            "sent4": "His passion burned like a chipotle pepper, intense and unforgettable.",
            "sent5": "The chipotle pepper stood out in the garden with its deep red hue."
        }
    ]
}