{
    "term": "chivalrousness",
    "meanings": [
        {
            "definition": "The qualities idealized by knighthood such as bravery, courtesy, honor, and gallantry.",
            "pos": "noun",
            "sent1": "His chivalrousness was evident in the way he always stood up for the weak.",
            "sent2": "The knight's chivalrousness shone through as he helped the elderly lady cross the street.",
            "sent3": "The chivalrousness of the squirrel offering a nut to the bird made everyone chuckle.",
            "sent4": "Her chivalrousness was like a shining armor protecting those in need.",
            "sent5": "The chivalrousness of the firefighter rushing into the burning building was truly heroic."
        },
        {
            "definition": "The act of being courteous and gallant, especially towards women.",
            "pos": "noun",
            "sent1": "His chivalrousness towards his grandmother was heartwarming.",
            "sent2": "She appreciated his chivalrousness when he held the door open for her.",
            "sent3": "The chivalrousness of the cat bringing a mouse as a gift to its owner was amusing.",
            "sent4": "Her chivalrousness towards strangers was like a breath of fresh air.",
            "sent5": "The chivalrousness of the young boy offering his seat to the elderly lady was touching."
        },
        {
            "definition": "The practice of upholding the values of chivalry.",
            "pos": "noun",
            "sent1": "In the medieval times, chivalrousness was a code that knights followed.",
            "sent2": "She admired his chivalrousness in always treating others with respect.",
            "sent3": "The chivalrousness of the penguin offering a pebble to its mate was endearing.",
            "sent4": "His chivalrousness in defending his beliefs was unwavering.",
            "sent5": "The chivalrousness of the student helping a classmate with their work was commendable."
        }
    ]
}