{
    "term": "chivalry",
    "meanings": [
        {
            "definition": "The medieval knightly system with its religious, moral, and social code.",
            "pos": "noun",
            "sent1": "In stories, knights often follow the code of chivalry to be brave and kind.",
            "sent2": "During the Middle Ages, chivalry was an important part of a knight's life.",
            "sent3": "The knight's dedication to chivalry sometimes led to humorous situations in tales.",
            "sent4": "Chivalry can be seen as a shining armor that knights wear in their hearts.",
            "sent5": "The concept of chivalry is like a beacon guiding knights through darkness."
        },
        {
            "definition": "The combination of qualities expected of an ideal knight, especially courage, honor, courtesy, justice, and a readiness to help the weak.",
            "pos": "noun",
            "sent1": "His chivalry shone through when he bravely defended the helpless villagers.",
            "sent2": "Knights were admired for their chivalry and noble deeds.",
            "sent3": "The knight's commitment to chivalry sometimes led to amusing misunderstandings.",
            "sent4": "Chivalry is like a shield that protects the virtues of a true knight.",
            "sent5": "The essence of chivalry is a tapestry woven with threads of valor and kindness."
        },
        {
            "definition": "Courteous behavior, especially towards women.",
            "pos": "noun",
            "sent1": "His chivalry was evident in the way he held the door open for the lady.",
            "sent2": "Chivalry dictates that a gentleman should always treat women with respect.",
            "sent3": "The man's exaggerated display of chivalry made the lady chuckle.",
            "sent4": "Chivalry is like a bouquet of flowers, brightening the day of those around.",
            "sent5": "The beauty of chivalry lies in its simplicity and genuine kindness."
        }
    ]
}