{
    "term": "chloropicrin",
    "meanings": [
        {
            "definition": "A colorless, oily liquid used as a pesticide.",
            "pos": "noun",
            "sent1": "Farmers sprayed chloropicrin on the crops to protect them from insects.",
            "sent2": "The chloropicrin was stored safely in a labeled container.",
            "sent3": "The mischievous cat knocked over the bottle of chloropicrin, causing a commotion.",
            "sent4": "The chloropicrin spread through the soil like a silent guardian against pests.",
            "sent5": "The smell of chloropicrin lingered in the air, a reminder of its protective power."
        },
        {
            "definition": "To treat with chloropicrin to kill pests.",
            "pos": "verb",
            "sent1": "The farmers decided to chloropicrin the fields to eliminate the pests.",
            "sent2": "She carefully chloropicrined the affected areas in the garden.",
            "sent3": "The children joked that they could chloropicrin the bugs away with a magic spell.",
            "sent4": "His determination to chloropicrin the entire orchard showed his dedication to pest control.",
            "sent5": "The decision to chloropicrin the garden was met with relief by the worried homeowners."
        },
        {
            "definition": "The act of using chloropicrin as a pesticide.",
            "pos": "noun",
            "sent1": "The chloropicrin application was scheduled for early morning to avoid harming beneficial insects.",
            "sent2": "Her expertise in chloropicrin made her a sought-after consultant in pest management.",
            "sent3": "The unexpected rain ruined the chloropicrin application, causing delays.",
            "sent4": "The effectiveness of chloropicrin as a pesticide was evident in the thriving crops.",
            "sent5": "The careful handling of chloropicrin ensured the safety of both humans and plants."
        }
    ]
}