{
    "term": "chocks",
    "meanings": [
        {
            "definition": "A wedge or block placed against a wheel or rounded object to prevent it from moving.",
            "pos": "noun",
            "sent1": "The mechanic placed chocks under the car's wheels to keep it from rolling.",
            "sent2": "Make sure to always use chocks when parking on a slope to avoid accidents.",
            "sent3": "The chocks decided to take a break and relax by the tire, enjoying the view.",
            "sent4": "Her determination was like sturdy chocks, keeping her from being swayed by doubts.",
            "sent5": "The chocks were like loyal guards, standing firm and protecting the wheel from any movement."
        },
        {
            "definition": "To secure or support with chocks.",
            "pos": "verb",
            "sent1": "He chocks the airplane wheels before the passengers board.",
            "sent2": "Remember to always chocks the boat properly before leaving the dock.",
            "sent3": "The chef chocks the cutting board in place to prevent it from sliding around.",
            "sent4": "She chocks her emotions, not letting them overwhelm her during stressful times.",
            "sent5": "The mountain climber chocks the rope securely, ensuring a safe ascent."
        },
        {
            "definition": "A pair of metal or wooden supports used to hold a boat or ship in place.",
            "pos": "noun",
            "sent1": "The sailor placed the chocks on the dock to secure the ship in position.",
            "sent2": "The chocks were essential for keeping the boat steady during the storm.",
            "sent3": "The mischievous seagull perched on one of the chocks, pretending to be a ship captain.",
            "sent4": "The chocks were like sturdy pillars, holding the boat firmly in place.",
            "sent5": "The old sailor always trusted his lucky chocks to keep his vessel safe at sea."
        }
    ]
}