{
    "term": "choker",
    "meanings": [
        {
            "definition": "A person or thing that chokes.",
            "pos": "noun",
            "sent1": "The little boy was a choker when he tried to eat too quickly.",
            "sent2": "The wrestler was a choker in the competition, unable to handle the pressure.",
            "sent3": "The toaster became a choker when it got clogged with crumbs.",
            "sent4": "The traffic jam was a choker on the highway, causing long delays.",
            "sent5": "The tight knot in the rope turned it into a choker, making it hard to untangle."
        },
        {
            "definition": "A tight-fitting necklace.",
            "pos": "noun",
            "sent1": "She wore a beautiful choker with a pendant for the party.",
            "sent2": "The choker she wore accentuated her elegant neckline.",
            "sent3": "The choker felt like a fancy ribbon hugging her throat.",
            "sent4": "The choker sparkled under the lights, drawing attention to her collarbones.",
            "sent5": "The choker was a perfect accessory to complete her outfit."
        },
        {
            "definition": "A device used to constrict the flow of fluid in a pipe.",
            "pos": "noun",
            "sent1": "The plumber used a choker to control the water flow in the pipe.",
            "sent2": "The choker prevented the water from leaking out of the pipe.",
            "sent3": "The choker looked like a tiny belt tightening around the pipe.",
            "sent4": "The choker regulated the water pressure, ensuring a steady flow.",
            "sent5": "The choker was essential for maintaining the pipe system."
        },
        {
            "definition": "A person who fails to perform well under pressure.",
            "pos": "noun",
            "sent1": "He was known as a choker in the final moments of the game.",
            "sent2": "The singer became a choker on stage, forgetting the lyrics under stress.",
            "sent3": "The choker froze during the presentation, unable to speak.",
            "sent4": "The actor turned into a choker during the audition, stumbling over lines.",
            "sent5": "The student became a choker during the exam, blanking out on answers."
        }
    ]
}