{
    "term": "chokeholds",
    "meanings": [
        {
            "definition": "A method of restraining someone by applying pressure to the neck",
            "pos": "noun",
            "sent1": "During the fight, the wrestler used a chokehold to control his opponent.",
            "sent2": "The police officer used a chokehold to stop the criminal from escaping.",
            "sent3": "The karate student accidentally applied a chokehold on his own arm during practice.",
            "sent4": "In the movie, the villain's chokehold on the hero symbolized his power over him.",
            "sent5": "The image of a chokehold can be unsettling, showing the intensity of the situation."
        },
        {
            "definition": "A tactic used in combat sports to restrict an opponent's breathing",
            "pos": "noun",
            "sent1": "The MMA fighter executed a perfect chokehold to win the match.",
            "sent2": "In jiu-jitsu, mastering different chokeholds is essential for success.",
            "sent3": "During the boxing match, the unexpected chokehold move surprised everyone.",
            "sent4": "The chokehold in the martial arts tournament left the audience in awe.",
            "sent5": "The effectiveness of a well-timed chokehold can turn the tide of a fight."
        },
        {
            "definition": "A technique used by law enforcement to subdue a suspect",
            "pos": "noun",
            "sent1": "The police officer applied a chokehold to safely restrain the suspect.",
            "sent2": "Using a chokehold is a last resort for officers in dangerous situations.",
            "sent3": "The clumsy detective accidentally ended up in a chokehold while trying to make an arrest.",
            "sent4": "The idea of justice can sometimes feel like a chokehold on those who break the law.",
            "sent5": "The suspect felt the tight grip of the chokehold as he was brought under control."
        }
    ]
}