{
    "term": "cholangiography",
    "meanings": [
        {
            "definition": "A diagnostic imaging technique used to visualize the bile ducts.",
            "pos": "noun",
            "sent1": "The doctor recommended a cholangiography to see inside the bile ducts.",
            "sent2": "The hospital performed a cholangiography to check for any blockages.",
            "sent3": "During the cholangiography, the technician joked about finding hidden treasures in the ducts.",
            "sent4": "The cholangiography revealed a maze of pathways within the bile ducts.",
            "sent5": "The cholangiography image was as clear as a sunny day, showing every detail."
        },
        {
            "definition": "The process of obtaining images of the bile ducts using contrast material.",
            "pos": "noun",
            "sent1": "After drinking the contrast material, the patient underwent cholangiography.",
            "sent2": "The radiologist explained the importance of cholangiography in detecting abnormalities.",
            "sent3": "The contrast material for the cholangiography tasted surprisingly sweet.",
            "sent4": "The cholangiography highlighted the bile ducts like a neon sign in the dark.",
            "sent5": "The contrast material made the cholangiography results pop with color."
        },
        {
            "definition": "The medical procedure of examining the bile ducts through radiographic imaging.",
            "pos": "noun",
            "sent1": "The hospital scheduled a cholangiography to investigate the patient's symptoms.",
            "sent2": "The doctor explained the risks and benefits of cholangiography before the procedure.",
            "sent3": "During the cholangiography, the patient couldn't help but feel like a movie star under the spotlight.",
            "sent4": "The cholangiography provided a detailed map of the bile ducts like an explorer's guide.",
            "sent5": "The radiographic images from the cholangiography were like puzzle pieces coming together."
        }
    ]
}