{
    "term": "chop",
    "meanings": [
        {
            "definition": "To cut into pieces with a sharp tool",
            "pos": "verb",
            "sent1": "She used a knife to chop the vegetables for the salad.",
            "sent2": "The chef will chop the onions finely for the sauce.",
            "sent3": "I tried to chop the wood with a spoon, but it didn't work!",
            "sent4": "His words seemed to chop through her defenses, leaving her vulnerable.",
            "sent5": "The sound of the axe chopping echoed through the forest."
        },
        {
            "definition": "A thick, firm cut of meat",
            "pos": "noun",
            "sent1": "The butcher displayed a beautiful chop of beef in the shop window.",
            "sent2": "I prefer to grill pork chops for dinner.",
            "sent3": "The giant chop on his plate made his mouth water.",
            "sent4": "The chop on the plate looked like a piece of art.",
            "sent5": "The savory aroma of the chop filled the kitchen."
        },
        {
            "definition": "A swift downward blow or stroke",
            "pos": "noun",
            "sent1": "He felt a sharp chop on his shoulder during the game.",
            "sent2": "The karate master delivered a powerful chop to the wooden board.",
            "sent3": "The magician's wand made a chop in the air before the trick.",
            "sent4": "The chop of the axe split the log in half effortlessly.",
            "sent5": "The chop of the sword ended the duel decisively."
        },
        {
            "definition": "To reduce or decrease drastically",
            "pos": "verb",
            "sent1": "The company had to chop its budget due to financial constraints.",
            "sent2": "They decided to chop the prices to attract more customers.",
            "sent3": "She had to chop her to-do list in half to manage her time better.",
            "sent4": "The unexpected expenses forced them to chop their vacation plans.",
            "sent5": "The decision to chop the staff was a difficult one for the manager."
        },
        {
            "definition": "A mark or indentation made by chopping",
            "pos": "noun",
            "sent1": "The woodcutter admired the clean chop he made on the tree trunk.",
            "sent2": "The sculptor added a precise chop to the marble block.",
            "sent3": "The chop on the table showed the history of the old chopping board.",
            "sent4": "The chop on the door revealed the strength of the intruder.",
            "sent5": "The chop on the log displayed the wood's age and quality."
        }
    ]
}