{
    "term": "chorial",
    "meanings": [
        {
            "definition": "Of or relating to a choir.",
            "pos": "adjective",
            "sent1": "The chorial music filled the hall with harmonious melodies.",
            "sent2": "The chorial performance at the concert was breathtaking.",
            "sent3": "The chorial voices blended together like a beautiful painting.",
            "sent4": "Her chorial leadership brought unity to the singing group.",
            "sent5": "The chorial harmonies resonated in the hearts of the audience."
        },
        {
            "definition": "Of or relating to a chorus.",
            "pos": "adjective",
            "sent1": "The chorial singing in the play added depth to the performance.",
            "sent2": "The chorial section of the song was the most captivating.",
            "sent3": "The chorial dancers moved in perfect synchronization.",
            "sent4": "The chorial voices echoed through the theater like waves.",
            "sent5": "The chorial arrangement of voices created a powerful impact."
        },
        {
            "definition": "Of or relating to a group of singers.",
            "pos": "adjective",
            "sent1": "The chorial group practiced diligently for the upcoming show.",
            "sent2": "The chorial ensemble sang with passion and precision.",
            "sent3": "The chorial choir members shared a strong bond.",
            "sent4": "The chorial performance showcased the talent of the singers.",
            "sent5": "The chorial group harmonized beautifully during the concert."
        },
        {
            "definition": "Of or relating to a church choir.",
            "pos": "adjective",
            "sent1": "The chorial hymns echoed through the church walls.",
            "sent2": "The chorial singers gathered for their weekly rehearsal.",
            "sent3": "The chorial robes worn by the choir were elegant and traditional.",
            "sent4": "The chorial voices lifted the spirits of the congregation.",
            "sent5": "The chorial choir sang with reverence and devotion."
        }
    ]
}