{
    "term": "choriocarcinoma",
    "meanings": [
        {
            "definition": "A malignant tumor of the placenta.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with choriocarcinoma after examining the placenta.",
            "sent2": "The choriocarcinoma was detected during the routine ultrasound of the pregnant woman.",
            "sent3": "The choriocarcinoma in the placenta seemed to have a mind of its own, growing rapidly.",
            "sent4": "Her choriocarcinoma was like a dark cloud looming over her pregnancy.",
            "sent5": "The choriocarcinoma was a sinister invader in the placenta, spreading its harmful cells."
        },
        {
            "definition": "A type of cancer that develops from trophoblastic cells.",
            "pos": "noun",
            "sent1": "Researchers are studying the genetic mutations that lead to choriocarcinoma in trophoblastic cells.",
            "sent2": "The oncologist explained the treatment options for choriocarcinoma originating from trophoblastic cells.",
            "sent3": "The trophoblastic cells decided to rebel and form a choriocarcinoma, causing chaos in the body.",
            "sent4": "Her choriocarcinoma from trophoblastic cells was like a rogue army attacking from within.",
            "sent5": "The choriocarcinoma emerged stealthily from the trophoblastic cells, spreading its harmful influence."
        },
        {
            "definition": "A fast-growing cancer that occurs in a woman's uterus.",
            "pos": "noun",
            "sent1": "The doctors rushed to treat the choriocarcinoma growing rapidly in the woman's uterus.",
            "sent2": "She underwent surgery to remove the choriocarcinoma from her uterus.",
            "sent3": "The choriocarcinoma in her uterus seemed to have a need for speed, growing at an alarming rate.",
            "sent4": "Her uterus felt like a battleground invaded by the choriocarcinoma's rapid growth.",
            "sent5": "The choriocarcinoma in her uterus was like a wildfire, spreading uncontrollably."
        }
    ]
}