{
    "term": "chromatographed",
    "meanings": [
        {
            "definition": "Separate (a mixture) into its components by passing it through a medium in which the components move at different rates.",
            "pos": "verb",
            "sent1": "In science class, we chromatographed a mixture to see its different parts.",
            "sent2": "The scientist chromatographed the sample to identify its various elements.",
            "sent3": "The curious student chromatographed the colored liquid and was amazed by the results.",
            "sent4": "The river acted like a chromatograph, naturally separating the debris as it flowed.",
            "sent5": "The process of chromatography can be compared to sorting a bag of mixed candies into different types."
        },
        {
            "definition": "Analyze or separate (a mixture) by chromatography.",
            "pos": "verb",
            "sent1": "The lab technician chromatographed the unknown substance to determine its composition.",
            "sent2": "She carefully chromatographed the ink sample to reveal its hidden components.",
            "sent3": "The detective humorously chromatographed the spilled coffee to solve the mystery.",
            "sent4": "The chromatography process can be like unraveling a complex puzzle.",
            "sent5": "Chromatographing a mixture is like decoding a secret message written in invisible ink."
        },
        {
            "definition": "Subject (a substance) to chromatography.",
            "pos": "verb",
            "sent1": "The chemist chromatographed the new compound to study its properties.",
            "sent2": "They chromatographed the soil sample to analyze its nutrient content.",
            "sent3": "The chef playfully chromatographed the sauce to understand its flavors better.",
            "sent4": "Chromatographing a substance is like shining a light on its hidden secrets.",
            "sent5": "The artist compared chromatographing paint colors to revealing a rainbow's true hues."
        }
    ]
}