{
    "term": "chuck",
    "meanings": [
        {
            "definition": "To throw or toss something with a quick motion.",
            "pos": "verb",
            "sent1": "I will chuck the ball to you.",
            "sent2": "He likes to chuck stones into the pond.",
            "sent3": "She chuckled as she tried to chuck the heavy bag.",
            "sent4": "The wind can chuck the leaves around like a playful child.",
            "sent5": "Remember to chuck the garbage into the bin with care."
        },
        {
            "definition": "A cut of beef taken from the shoulder.",
            "pos": "noun",
            "sent1": "The chef prepared a delicious chuck steak for dinner.",
            "sent2": "I prefer using chuck for my beef stew.",
            "sent3": "The chuck looked so tender and juicy at the butcher's shop.",
            "sent4": "The chuck sizzled on the grill, filling the air with a mouthwatering aroma.",
            "sent5": "The chuck roast was the highlight of the barbecue party."
        },
        {
            "definition": "A device used to hold a workpiece in place in a lathe or other machine tool.",
            "pos": "noun",
            "sent1": "The chuck securely held the metal rod in place.",
            "sent2": "He adjusted the chuck to fit the piece he was working on.",
            "sent3": "The mechanic's favorite tool was the sturdy chuck.",
            "sent4": "The precision of the chuck ensured the perfect alignment of the workpiece.",
            "sent5": "The old chuck had served him well through many projects."
        },
        {
            "definition": "A friendly or affectionate term for a person's chin.",
            "pos": "noun",
            "sent1": "The baby's chubby chuck was irresistible.",
            "sent2": "Grandma always pinched my chuck lovingly.",
            "sent3": "He planted a gentle kiss on her chuck.",
            "sent4": "The dimple on her chuck added to her charm.",
            "sent5": "His beard tickled her chuck when he hugged her."
        }
    ]
}