{
    "term": "chucked",
    "meanings": [
        {
            "definition": "To throw or toss something in a casual or careless manner.",
            "pos": "verb",
            "sent1": "He chucked the ball to his friend.",
            "sent2": "She chucked the paper into the recycling bin.",
            "sent3": "The monkey chucked the banana peel at the zookeeper.",
            "sent4": "The wind chucked the leaves around the yard.",
            "sent5": "The child chucked the toy across the room with glee."
        },
        {
            "definition": "To discard or get rid of something.",
            "pos": "verb",
            "sent1": "They chucked the old clothes in the donation bin.",
            "sent2": "He chucked the broken mug into the trash.",
            "sent3": "She chucked the expired food from the fridge.",
            "sent4": "The gardener chucked the wilted flowers from the vase.",
            "sent5": "The teacher chucked the incorrect papers into the recycling bin."
        },
        {
            "definition": "To give up or abandon something.",
            "pos": "verb",
            "sent1": "He chucked his unhealthy habits for a better lifestyle.",
            "sent2": "She chucked her dreams of becoming an artist.",
            "sent3": "The explorer chucked the idea of climbing the mountain.",
            "sent4": "The student chucked the difficult math problem and moved on.",
            "sent5": "The athlete chucked the old training routine for a new one."
        },
        {
            "definition": "To make a sudden movement or change in direction.",
            "pos": "verb",
            "sent1": "The squirrel chucked to the side to avoid the car.",
            "sent2": "She chucked forward to catch the falling book.",
            "sent3": "He chucked back in surprise at the loud noise.",
            "sent4": "The bird chucked upwards to reach the higher branch.",
            "sent5": "The cat chucked sideways to pounce on the toy mouse."
        }
    ]
}