{
    "term": "chudders",
    "meanings": [
        {
            "definition": "Chudders (noun): a person who chatters incessantly",
            "pos": "noun",
            "sent1": "The classroom was always noisy because of the chudders who never stopped talking.",
            "sent2": "My little sister is a real chudders; she talks from the moment she wakes up until she falls asleep.",
            "sent3": "The chudders in the office made it hard for anyone to concentrate on their work.",
            "sent4": "Her mouth moved like a chudders, never taking a break from the constant chatter.",
            "sent5": "The chudders at the party dominated every conversation with their non-stop talking."
        },
        {
            "definition": "Chudders (verb): to make a continuous, low rumbling sound",
            "pos": "verb",
            "sent1": "The old car engine chudders noisily when starting up in the morning.",
            "sent2": "The distant thunder chudders softly in the background as the storm approaches.",
            "sent3": "The washing machine chudders rhythmically as it goes through its spin cycle.",
            "sent4": "The train chudders along the tracks, creating a soothing sound for passengers.",
            "sent5": "The wind chudders through the trees, creating a calming atmosphere in the forest."
        },
        {
            "definition": "Chudders (adjective): characterized by constant talking or noise",
            "pos": "adjective",
            "sent1": "The chudders group of friends always had something to say about everything.",
            "sent2": "The chudders neighbors could be heard arguing loudly every night.",
            "sent3": "The chudders party next door kept me up all night with their loud music.",
            "sent4": "The chudders radio station played non-stop music throughout the day.",
            "sent5": "The chudders birds outside my window woke me up every morning with their chirping."
        }
    ]
}