{
    "term": "chunder",
    "meanings": [
        {
            "definition": "To vomit",
            "pos": "verb",
            "sent1": "After the roller coaster ride, he felt sick and had to chunder.",
            "sent2": "She chundered after eating too much candy at the fair.",
            "sent3": "The baby chundered all over the new carpet, much to the dismay of the parents.",
            "sent4": "The overflowing garbage can made him chunder with disgust.",
            "sent5": "The smell of the spoiled milk was enough to make anyone chunder."
        },
        {
            "definition": "Vomit",
            "pos": "noun",
            "sent1": "The smell of the chunder filled the room.",
            "sent2": "She couldn't bear to look at the chunder on the sidewalk.",
            "sent3": "The dog's unexpected chunder on the rug was a surprise for everyone.",
            "sent4": "The sight of the chunder made her stomach turn.",
            "sent5": "The chunder on the bus seat was a terrible surprise for the next passenger."
        },
        {
            "definition": "Vomiting",
            "pos": "noun",
            "sent1": "His chundering was loud and unpleasant.",
            "sent2": "The sound of her chundering echoed through the house.",
            "sent3": "The chundering during the movie made it hard to focus on the plot.",
            "sent4": "The constant chundering was a sign of his illness.",
            "sent5": "The chundering could be heard from the next room."
        },
        {
            "definition": "Vomited",
            "pos": "verb",
            "sent1": "She chundered all over the bathroom floor.",
            "sent2": "He chundered in the bushes after the wild ride.",
            "sent3": "The cat chundered on the couch, much to the dismay of its owner.",
            "sent4": "The food poisoning caused him to chunder violently.",
            "sent5": "The bad seafood made her chunder uncontrollably."
        }
    ]
}