{
    "term": "chundering",
    "meanings": [
        {
            "definition": "To vomit",
            "pos": "verb",
            "sent1": "After the roller coaster ride, she couldn't stop chundering.",
            "sent2": "He chundered after eating too much candy.",
            "sent3": "The dog started chundering all over the carpet, much to the family's dismay.",
            "sent4": "The overflowing river chundered mud and debris onto the banks.",
            "sent5": "The turbulent flight had passengers chundering into their airsick bags."
        },
        {
            "definition": "Vomit",
            "pos": "noun",
            "sent1": "The smell of chundering filled the room.",
            "sent2": "She slipped on a puddle of chundering in the hallway.",
            "sent3": "The sight of the chundering on the sidewalk made her queasy.",
            "sent4": "The overflowing trash can looked like a pile of chundering.",
            "sent5": "The chundering on the bathroom floor was a nasty surprise."
        },
        {
            "definition": "Vomiting",
            "pos": "noun",
            "sent1": "His chundering was loud and messy.",
            "sent2": "The sound of chundering echoed through the house.",
            "sent3": "The chundering at the party cleared the room in seconds.",
            "sent4": "The chundering in the movie scene was surprisingly realistic.",
            "sent5": "The smell of chundering lingered in the air long after the party ended."
        },
        {
            "definition": "Vomited",
            "pos": "verb",
            "sent1": "She chundered all over the bathroom floor.",
            "sent2": "He chundered up his dinner in the bushes.",
            "sent3": "The cat chundered on the rug, much to the owner's dismay.",
            "sent4": "The sick child chundered quietly in the corner.",
            "sent5": "The upset stomach caused him to chunder unexpectedly."
        }
    ]
}