{
    "term": "churn",
    "meanings": [
        {
            "definition": "To stir or agitate (a liquid) vigorously",
            "pos": "verb",
            "sent1": "She used a big spoon to churn the soup.",
            "sent2": "The storm caused the ocean to churn violently.",
            "sent3": "The kids took turns to churn the milk for fun.",
            "sent4": "Emotions churned inside her like a turbulent sea.",
            "sent5": "The blender started to churn the ingredients into a smooth paste."
        },
        {
            "definition": "To produce something in an abundant and continuous manner",
            "pos": "verb",
            "sent1": "The factory can churn out hundreds of toys every day.",
            "sent2": "The bakery churns fresh bread daily.",
            "sent3": "The writer could churn out stories effortlessly.",
            "sent4": "The machine churned out paper at a rapid pace.",
            "sent5": "The artist's mind seemed to churn out ideas endlessly."
        },
        {
            "definition": "A container or machine used to make butter",
            "pos": "noun",
            "sent1": "She used the old wooden churn to make butter.",
            "sent2": "The churn was passed down through generations.",
            "sent3": "The antique churn added a rustic charm to the kitchen.",
            "sent4": "The churn had intricate carvings on its surface.",
            "sent5": "The churn had a smooth handle for easy operation."
        },
        {
            "definition": "The act of churning or being churned",
            "pos": "noun",
            "sent1": "The churn of the waves against the rocks was mesmerizing.",
            "sent2": "The churn of events left everyone in shock.",
            "sent3": "The sudden churn of emotions caught her off guard.",
            "sent4": "The market experienced a churn in prices due to the new regulations.",
            "sent5": "The constant churn of thoughts kept him awake at night."
        }
    ]
}