{
    "term": "chuting",
    "meanings": [
        {
            "definition": "The act of descending or falling rapidly through the air using a parachute.",
            "pos": "noun",
            "sent1": "Skydivers enjoy chuting from planes to feel the thrill of freefall.",
            "sent2": "Parachuting is a popular form of chuting for adrenaline junkies.",
            "sent3": "The penguin tried chuting with an umbrella, pretending to be Mary Poppins.",
            "sent4": "Her heart was chuting with excitement as she leaped from the plane.",
            "sent5": "The sensation of chuting through the clouds was both terrifying and exhilarating."
        },
        {
            "definition": "A sport or activity involving the use of a parachute for descending from an aircraft or elevated point.",
            "pos": "noun",
            "sent1": "Chuting competitions attract skilled parachutists from around the world.",
            "sent2": "People often take lessons before trying chuting for the first time.",
            "sent3": "During the chuting event, the wind unexpectedly carried the parachutist off course.",
            "sent4": "The chuting team moved gracefully in the sky, like synchronized dancers.",
            "sent5": "The sound of the wind during chuting is a unique experience that stays with you."
        },
        {
            "definition": "The action of shooting or launching something through a chute or tube.",
            "pos": "noun",
            "sent1": "The factory workers observed the chuting of materials down the tube.",
            "sent2": "Chuting items down the slide made the task quicker and more efficient.",
            "sent3": "The mischievous raccoon was caught chuting acorns at unsuspecting passersby.",
            "sent4": "The watermelon went chuting down the water slide, splashing everyone nearby.",
            "sent5": "The chuting of confetti at the celebration added a festive touch to the event."
        }
    ]
}