{
    "term": "ciborium",
    "meanings": [
        {
            "definition": "A container for holding the consecrated bread in Christian religious services.",
            "pos": "noun",
            "sent1": "The priest placed the consecrated bread in the ciborium after the service.",
            "sent2": "During the church ceremony, the ciborium was carefully carried to the altar.",
            "sent3": "The ciborium decided to take a break from holding bread and tried holding flowers instead.",
            "sent4": "Her hands were like a ciborium, cradling the precious memories of her childhood.",
            "sent5": "The golden ciborium gleamed under the church's soft lights, a symbol of reverence."
        },
        {
            "definition": "A canopy over an altar in a church.",
            "pos": "noun",
            "sent1": "The intricate design of the ciborium above the altar amazed the visitors.",
            "sent2": "The sunlight filtered through the ciborium, casting a warm glow on the altar below.",
            "sent3": "The mischievous squirrel thought the ciborium was a perfect spot to hide its acorns.",
            "sent4": "The ciborium stood tall like a guardian over the sacred space of the altar.",
            "sent5": "The delicate carvings on the ciborium added an ethereal touch to the church's interior."
        },
        {
            "definition": "A vessel used for holding the Eucharist in Catholic worship.",
            "pos": "noun",
            "sent1": "The priest carefully cleansed the ciborium before the Eucharist service.",
            "sent2": "Parishioners donated a new silver ciborium for the church's special celebrations.",
            "sent3": "The mischievous cat knocked over the ciborium, spilling the Eucharist wafers everywhere.",
            "sent4": "Her heart felt like a ciborium, overflowing with gratitude during the communion.",
            "sent5": "The ornate ciborium held the sacred Eucharist, a symbol of faith and unity in the congregation."
        }
    ]
}