{
    "term": "cinematheques",
    "meanings": [
        {
            "definition": "A place where films are shown.",
            "pos": "noun",
            "sent1": "The local cinematheques offer a variety of classic movies for everyone to enjoy.",
            "sent2": "Let's go to the cinematheques downtown to watch the latest blockbuster film.",
            "sent3": "I accidentally walked into the cinematheques while looking for the library!",
            "sent4": "Her mind was a cinematheques of memories, each film representing a different moment in her life.",
            "sent5": "The cinematheques glowed with the flickering light of the projector, creating a cozy atmosphere."
        },
        {
            "definition": "A collection of films.",
            "pos": "noun",
            "sent1": "His personal cinematheques contained rare and valuable movies from around the world.",
            "sent2": "The cinematheques in the archive were carefully organized and cataloged for easy access.",
            "sent3": "She proudly displayed her cinematheques of animated films on the shelf.",
            "sent4": "The cinematheques of horror movies in the basement gave me chills just looking at them.",
            "sent5": "The old trunk in the attic turned out to be a hidden cinematheques of family films from the past."
        },
        {
            "definition": "An organization that preserves and screens films.",
            "pos": "noun",
            "sent1": "The cinematheques in town work tirelessly to restore and showcase classic films.",
            "sent2": "I volunteered at the cinematheques to help with the film screenings during the festival.",
            "sent3": "The cinematheques hosted a movie marathon that lasted for 24 hours straight!",
            "sent4": "The cinematheques acted as a guardian of cinematic history, protecting films for future generations.",
            "sent5": "Visiting the cinematheques felt like stepping into a time capsule of film culture."
        }
    ]
}