{
    "term": "cipollino",
    "meanings": [
        {
            "definition": "A type of onion with a small flattened shape and mild flavor.",
            "pos": "noun",
            "sent1": "I added some chopped cipollino to the salad for extra flavor.",
            "sent2": "The recipe called for cipollino onions, but I used regular ones instead.",
            "sent3": "The cipollino onion rolled off the counter and onto the floor, making a funny noise.",
            "sent4": "Her tears fell like cipollino onions, each one a small reminder of her sadness.",
            "sent5": "The cipollino onion, with its unique shape, stood out among the other vegetables."
        },
        {
            "definition": "A type of marble with greenish-gray streaks.",
            "pos": "noun",
            "sent1": "The kitchen countertop was made of cipollino marble, giving it a luxurious look.",
            "sent2": "The sculptor chose cipollino marble for its beautiful natural patterns.",
            "sent3": "The cipollino marble slab seemed to sparkle in the sunlight, as if it had a secret to share.",
            "sent4": "Her eyes were drawn to the cipollino marble, its streaks resembling a hidden message in stone.",
            "sent5": "The cipollino marble gleamed like a hidden treasure waiting to be discovered."
        },
        {
            "definition": "A character in a children's book series by Gianni Rodari.",
            "pos": "noun",
            "sent1": "My favorite character in the book is Cipollino, the brave little onion.",
            "sent2": "Cipollino always finds a clever way to outsmart his enemies in the stories.",
            "sent3": "Cipollino's adventures often lead to hilarious situations that make me laugh.",
            "sent4": "In the world of the book, Cipollino is like a small hero with a big heart.",
            "sent5": "Children everywhere love to read about Cipollino and his exciting escapades."
        }
    ]
}