{
    "term": "cipolin",
    "meanings": [
        {
            "definition": "A type of marble with greenish-gray bands.",
            "pos": "noun",
            "sent1": "The cipolin in the museum had beautiful greenish-gray bands.",
            "sent2": "The kitchen countertop was made of cipolin, adding a touch of elegance to the room.",
            "sent3": "When the sculptor accidentally dropped the cipolin slab, it created a unique pattern on the floor.",
            "sent4": "The cipolin walls of the ancient castle seemed to tell stories of the past through their intricate bands.",
            "sent5": "The sunlight filtering through the cipolin windows cast a mesmerizing pattern on the floor."
        },
        {
            "definition": "A mineral consisting of silicate of aluminum and calcium.",
            "pos": "noun",
            "sent1": "Miners discovered a vein of cipolin deep within the earth's crust.",
            "sent2": "The jeweler crafted a stunning necklace using cipolin as the centerpiece.",
            "sent3": "The scientist's experiment revealed the unique properties of cipolin under extreme pressure.",
            "sent4": "The cipolin sparkled like a hidden treasure unearthed from the depths of the mine.",
            "sent5": "The cipolin's composition of aluminum and calcium made it a valuable mineral for industrial use."
        },
        {
            "definition": "A variety of onion with a white bulb and green streaks.",
            "pos": "noun",
            "sent1": "The chef used cipolin onions to add flavor to the dish.",
            "sent2": "At the farmer's market, customers eagerly bought bundles of fresh cipolin.",
            "sent3": "The mischievous raccoon stole a cipolin onion from the garden and rolled it down the hill.",
            "sent4": "The cipolin onion's white bulb with green streaks resembled a miniature work of art.",
            "sent5": "The aroma of sautéed cipolin filled the kitchen, making everyone's mouth water."
        }
    ]
}