{
    "term": "circumcircle",
    "meanings": [
        {
            "definition": "A circle that passes through all the vertices of a polygon.",
            "pos": "noun",
            "sent1": "The circumcircle of the triangle touched each vertex perfectly.",
            "sent2": "The mathematician drew the circumcircle around the polygon to solve the problem.",
            "sent3": "The circus performer balanced on the circumcircle of the polygon, impressing the audience.",
            "sent4": "Her laughter echoed like a circumcircle around the room, reaching every corner.",
            "sent5": "The bright red color of the circumcircle made it stand out against the white background."
        },
        {
            "definition": "The circle that circumscribes a triangle.",
            "pos": "noun",
            "sent1": "The circumcircle of the triangle was drawn with a compass.",
            "sent2": "The circumcircle neatly enclosed the entire triangle within its boundary.",
            "sent3": "The mischievous cat tried to catch the mouse hiding inside the circumcircle of the triangle.",
            "sent4": "Her love for him was like a warm embrace within the circumcircle of her heart.",
            "sent5": "The circumcircle of the triangle glowed in the sunlight, creating a beautiful sight."
        },
        {
            "definition": "The circle that contains a polygon.",
            "pos": "noun",
            "sent1": "The circumcircle of the polygon was carefully calculated by the architect.",
            "sent2": "The circumcircle expanded to encompass the entire polygon within its curve.",
            "sent3": "The mischievous squirrel ran around the circumcircle of the polygon, playing a game of chase.",
            "sent4": "Her kindness enveloped everyone around her like a warm circumcircle of comfort.",
            "sent5": "The circumcircle of the polygon shone brightly under the moonlight, illuminating the area."
        }
    ]
}