{
    "term": "circumscissile",
    "meanings": [
        {
            "definition": "Capable of being split around the circumference.",
            "pos": "adjective",
            "sent1": "The circumscissile fruit easily splits open along its circumference.",
            "sent2": "The circumscissile shell cracked neatly around the middle.",
            "sent3": "The circumscissile cookie broke perfectly in half, surprising everyone.",
            "sent4": "Her heart felt circumscissile, torn between two conflicting emotions.",
            "sent5": "The circumscissile balloon burst with a loud pop, scattering confetti everywhere."
        },
        {
            "definition": "A plant organ that splits open around the circumference to release seeds.",
            "pos": "noun",
            "sent1": "The circumscissile pod burst open, scattering seeds in all directions.",
            "sent2": "The circumscissile fruit split open to disperse its seeds.",
            "sent3": "The circumscissile flower opened up like a surprise gift, revealing its seeds.",
            "sent4": "The circumscissile plant seemed to explode with life as its seeds were released.",
            "sent5": "The circumscissile seed pod resembled a tiny treasure chest, revealing its contents."
        },
        {
            "definition": "A type of dehiscence in which a fruit or seed pod splits open around the circumference.",
            "pos": "noun",
            "sent1": "The circumscissile dehiscence of the seed pod allowed for easy seed dispersal.",
            "sent2": "The circumscissile dehiscence of the fruit ensured the seeds were spread far and wide.",
            "sent3": "The circumscissile dehiscence of the plant was like a natural fireworks show.",
            "sent4": "The circumscissile dehiscence of the pod was a beautiful display of nature's design.",
            "sent5": "The circumscissile dehiscence of the fruit pod was a marvel to behold, releasing seeds gracefully."
        }
    ]
}