{
    "term": "circulator",
    "meanings": [
        {
            "definition": "A person or thing that circulates.",
            "pos": "noun",
            "sent1": "The circulator in the library ensures that books are returned to their proper shelves.",
            "sent2": "The fan in the room acts as a circulator, keeping the air fresh.",
            "sent3": "The little robot circulator zipped around the house, picking up toys left on the floor.",
            "sent4": "Her laughter was like a circulator, spreading joy throughout the room.",
            "sent5": "The circulator in the heart pumps blood to all parts of the body, keeping us alive and healthy."
        },
        {
            "definition": "A device or machine that circulates air or liquid.",
            "pos": "noun",
            "sent1": "The circulator in the kitchen helps to evenly distribute heat while cooking.",
            "sent2": "The water circulator in the fish tank keeps the water clean and oxygenated.",
            "sent3": "The circulator hummed softly as it worked to cool down the room on a hot summer day.",
            "sent4": "Her words acted as a circulator, spreading rumors throughout the school.",
            "sent5": "The circulator in the car's engine ensures that coolant flows properly to prevent overheating."
        },
        {
            "definition": "A person who moves in a circular path or route.",
            "pos": "noun",
            "sent1": "The circulator at the amusement park guided visitors along the scenic route.",
            "sent2": "The cyclist was a circulator, pedaling around the park in a loop.",
            "sent3": "The little dog became a circulator, chasing its tail in circles.",
            "sent4": "Her dance moves were like a circulator, spinning gracefully on the dance floor.",
            "sent5": "The circulator in the parade led the marching band in a circular formation around the town square."
        }
    ]
}