{
    "term": "citers",
    "meanings": [
        {
            "definition": "A person who cites or quotes something.",
            "pos": "noun",
            "sent1": "The teacher asked the students to find examples in the book, so the citers started searching.",
            "sent2": "Scholars and researchers are often considered citers because they reference various sources in their work.",
            "sent3": "The citers at the library were like detectives, hunting for evidence in the texts.",
            "sent4": "She was a citer of wisdom, always sharing insightful quotes with her friends.",
            "sent5": "The citers in the courtroom presented compelling evidence to support their case."
        },
        {
            "definition": "To mention or refer to as an example or proof.",
            "pos": "verb",
            "sent1": "During the debate, he would often citers statistics to support his argument.",
            "sent2": "When writing a research paper, it is important to properly citer your sources.",
            "sent3": "She would playfully citers her favorite movie quotes during conversations.",
            "sent4": "His words citered through the silence, leaving a lasting impact on the audience.",
            "sent5": "The speaker would citer historical events to illustrate his point."
        },
        {
            "definition": "The act of quoting or referring to something.",
            "pos": "noun",
            "sent1": "In academic writing, proper citers are essential to avoid plagiarism.",
            "sent2": "The professor emphasized the importance of accurate citers in the research paper.",
            "sent3": "The citers in the debate club were known for their quick wit and sharp arguments.",
            "sent4": "Her speech was filled with powerful citers from famous leaders throughout history.",
            "sent5": "The book was full of interesting citers that sparked discussions in the classroom."
        }
    ]
}