{
    "term": "civicism",
    "meanings": [
        {
            "definition": "The practice of participating in community activities and organizations.",
            "pos": "noun",
            "sent1": "Civicism is about being involved in local events and groups.",
            "sent2": "She showed her civicism by volunteering at the neighborhood clean-up.",
            "sent3": "The town's civicism was evident in the large turnout for the charity fundraiser.",
            "sent4": "His dedication to civicism shone brightly in his commitment to improving public spaces.",
            "sent5": "Participating in civicism makes our community stronger and more united."
        },
        {
            "definition": "The belief in the importance of civic duty.",
            "pos": "noun",
            "sent1": "For her, civicism means always putting the needs of the community first.",
            "sent2": "The mayor's speech emphasized the value of civicism in shaping a better society.",
            "sent3": "His extreme civicism led him to run for every local election, even dog catcher.",
            "sent4": "In times of crisis, true civicism emerges as people come together to help one another.",
            "sent5": "Teaching children about civicism early on can instill a sense of responsibility towards society."
        },
        {
            "definition": "The study of the rights and responsibilities of citizens.",
            "pos": "noun",
            "sent1": "Civicism involves learning about what it means to be a good citizen.",
            "sent2": "The university offers a course on civicism to educate students on civic engagement.",
            "sent3": "Studying civicism may not be everyone's cup of tea, but it's essential for informed citizenship.",
            "sent4": "The professor's passion for civicism inspired many students to pursue careers in public service.",
            "sent5": "Understanding civicism helps individuals navigate their role in society more effectively."
        }
    ]
}