{
    "term": "civilisation",
    "meanings": [
        {
            "definition": "The stage of human social development and organization that is considered most advanced.",
            "pos": "noun",
            "sent1": "In ancient times, the entire civilisation worked together to build great structures.",
            "sent2": "The ancient civilisation had impressive architecture and advanced technology.",
            "sent3": "The civilisation decided to have a dance-off to determine the best dancer in the village.",
            "sent4": "Her kindness and compassion built a civilisation of love and understanding.",
            "sent5": "The bustling marketplace was a true reflection of the vibrant civilisation."
        },
        {
            "definition": "The society, culture, and way of life of a particular area.",
            "pos": "noun",
            "sent1": "The nomadic tribe had a unique civilisation based on hunting and gathering.",
            "sent2": "The civilisation of the islanders revolved around fishing and storytelling.",
            "sent3": "The civilisation's favorite pastime was organizing picnics in the park.",
            "sent4": "Her laughter echoed through the civilisation like a joyful melody.",
            "sent5": "The civilisation's traditions were passed down from generation to generation."
        },
        {
            "definition": "The process of bringing or achieving a state of civilization.",
            "pos": "noun",
            "sent1": "The teacher dedicated her life to educating children and promoting civilisation.",
            "sent2": "The explorers' mission was to spread civilisation to remote lands.",
            "sent3": "The civilisation makeover show transformed the rundown town into a bustling city.",
            "sent4": "His words sparked a revolution that led to the birth of a new civilisation.",
            "sent5": "The artist's masterpiece symbolized the beauty of cultural civilisation."
        }
    ]
}