{
    "term": "civil",
    "meanings": [
        {
            "definition": "Courteous and polite",
            "pos": "adjective",
            "sent1": "She always speaks in a civil tone to everyone she meets.",
            "sent2": "It is important to be civil when discussing differing opinions.",
            "sent3": "The civil waiter made sure to attend to all the customers with a smile.",
            "sent4": "His civil demeanor in the face of criticism was admirable.",
            "sent5": "The civil exchange of pleasantries set a friendly tone for the meeting."
        },
        {
            "definition": "Of or relating to citizens and their concerns",
            "pos": "adjective",
            "sent1": "The civil rights movement fought for equality among all citizens.",
            "sent2": "The civil duty of voting is essential for a functioning democracy.",
            "sent3": "The civil discussion at the town hall meeting addressed community issues.",
            "sent4": "Her commitment to civil engagement in society was commendable.",
            "sent5": "The civil liberties of the people were protected by the constitution."
        },
        {
            "definition": "Behaving in a reasonable and respectful manner",
            "pos": "adjective",
            "sent1": "He always tries to be civil even in the most challenging situations.",
            "sent2": "It is important to remain civil when resolving conflicts.",
            "sent3": "The civil way he handled the disagreement prevented further escalation.",
            "sent4": "Her civil response to criticism showed maturity and grace.",
            "sent5": "The civil behavior of the students impressed the teacher."
        },
        {
            "definition": "Not criminal or military",
            "pos": "adjective",
            "sent1": "The dispute was settled through civil means rather than violence.",
            "sent2": "Civil cases are resolved in court without involving the military.",
            "sent3": "The civil resolution of the conflict avoided any legal repercussions.",
            "sent4": "His decision to handle the matter in a civil manner was wise.",
            "sent5": "The civil approach to resolving disputes promotes peace in society."
        },
        {
            "definition": "Of or relating to the state or its citizens",
            "pos": "adjective",
            "sent1": "The civil service provides essential support to the government.",
            "sent2": "Civil law governs the relationships between citizens and the state.",
            "sent3": "The civil responsibilities of citizens include paying taxes.",
            "sent4": "Her work in the civil sector focused on public welfare.",
            "sent5": "The civil rights of individuals are protected by the constitution."
        }
    ]
}