{
    "term": "civics",
    "meanings": [
        {
            "definition": "The study of the rights and duties of citizenship.",
            "pos": "noun",
            "sent1": "In civics class, we learn about our responsibilities as citizens.",
            "sent2": "She found the civics textbook very informative.",
            "sent3": "The civics quiz was so tricky, it felt like a citizenship obstacle course!",
            "sent4": "Understanding civics is like having a map to navigate the duties of citizenship.",
            "sent5": "The importance of civics education cannot be overstated for a thriving society."
        },
        {
            "definition": "The study of the rights and duties of citizenship in a particular society.",
            "pos": "noun",
            "sent1": "Our school focuses on teaching civics with examples from our own community.",
            "sent2": "He researched the history of civics in our country.",
            "sent3": "The civics project required us to explore the unique aspects of our society.",
            "sent4": "Civics in our town is like a puzzle where each piece represents a citizen's role.",
            "sent5": "Learning about civics in our society helps us understand our place in the community."
        },
        {
            "definition": "The branch of political science that deals with civic affairs and the rights and duties of citizens.",
            "pos": "noun",
            "sent1": "Studying civics involves analyzing how governments interact with citizens.",
            "sent2": "The professor specializes in the field of civics and governance.",
            "sent3": "The debate on civics turned into a lively discussion about citizen engagement.",
            "sent4": "Civics is like a lens through which we can examine the relationship between citizens and the state.",
            "sent5": "The complexities of civics require a deep understanding of political structures."
        }
    ]
}