{
    "term": "clammer",
    "meanings": [
        {
            "definition": "A person who gathers clams.",
            "pos": "noun",
            "sent1": "The clammer collected clams by the shore.",
            "sent2": "The clammer sells the clams at the market.",
            "sent3": "The clammer found a pearl while clamming.",
            "sent4": "The clammer's bucket overflowed with clams like a treasure trove.",
            "sent5": "The clammer's hands were always covered in sand and salt from clamming."
        },
        {
            "definition": "To gather clams.",
            "pos": "verb",
            "sent1": "We can clammer for clams during low tide.",
            "sent2": "She likes to clammer at the beach on weekends.",
            "sent3": "Don't clammer too fast, or you might miss some clams!",
            "sent4": "The children clammered for clams eagerly, filling their buckets.",
            "sent5": "The sound of the waves accompanied our clammering for clams."
        },
        {
            "definition": "A loud noise or commotion.",
            "pos": "noun",
            "sent1": "The sudden clammer of pots and pans startled the cat.",
            "sent2": "The clammer of the crowd made it hard to hear the speaker.",
            "sent3": "The clammer of the children playing echoed through the park.",
            "sent4": "The clammer of the storm outside made it hard to sleep.",
            "sent5": "The clammer of the fireworks filled the night sky with bursts of light."
        },
        {
            "definition": "To make a loud noise or commotion.",
            "pos": "verb",
            "sent1": "The kids clammered noisily in the playground.",
            "sent2": "The wind clammered against the windows during the storm.",
            "sent3": "The birds clammered loudly in the trees at dawn.",
            "sent4": "The protesters clammered for change in the streets.",
            "sent5": "The thunder clammered ominously in the distance."
        }
    ]
}