{
    "term": "clap",
    "meanings": [
        {
            "definition": "To strike the palms of the hands together with a sudden explosive sound",
            "pos": "verb",
            "sent1": "The children clap happily at the end of the show.",
            "sent2": "She likes to clap along with the music.",
            "sent3": "The monkeys clap in the jungle, imitating the humans.",
            "sent4": "The waves clap against the shore in a rhythmic dance.",
            "sent5": "The audience clap enthusiastically, showing their appreciation."
        },
        {
            "definition": "A sudden, explosive sound made by striking the palms of the hands together",
            "pos": "noun",
            "sent1": "The loud clap of thunder startled the dog.",
            "sent2": "I heard a clap coming from the kitchen.",
            "sent3": "The clap of hands echoed through the empty hall.",
            "sent4": "The sudden clap of the door closing made me jump.",
            "sent5": "The clap of applause filled the room with energy."
        },
        {
            "definition": "To applaud by clapping the hands",
            "pos": "verb",
            "sent1": "The audience will clap for the talented performers.",
            "sent2": "People clap to show their support and appreciation.",
            "sent3": "I clap loudly for my friend's success.",
            "sent4": "She will clap for her favorite team at the game.",
            "sent5": "Let's clap together to cheer them on!"
        },
        {
            "definition": "A sudden, sharp noise, as of thunder or a door slamming",
            "pos": "noun",
            "sent1": "The clap of the door closing made me jump.",
            "sent2": "The sudden clap of thunder scared the cat.",
            "sent3": "The loud clap of the book hitting the floor surprised everyone.",
            "sent4": "A single clap of thunder broke the silence of the night.",
            "sent5": "The clap of the window shutting woke me up."
        }
    ]
}