{
    "term": "classism",
    "meanings": [
        {
            "definition": "Prejudice or discrimination based on social class.",
            "pos": "noun",
            "sent1": "Classism can lead to unfair treatment of people from different social classes.",
            "sent2": "The teacher's actions showed clear classism towards students from lower-income families.",
            "sent3": "At the party, there was a hint of classism when the host only spoke to the wealthy guests.",
            "sent4": "The company's hiring practices revealed a deep-rooted classism that favored candidates from privileged backgrounds.",
            "sent5": "The documentary shed light on the damaging effects of classism in our society."
        },
        {
            "definition": "The belief that people of a certain social class are superior to others.",
            "pos": "noun",
            "sent1": "Some individuals hold onto the harmful belief of classism, thinking they are better than others.",
            "sent2": "Her snobbish behavior at the event displayed a clear sense of classism.",
            "sent3": "It's quite comical to see someone exhibit such blatant classism without realizing how ridiculous they sound.",
            "sent4": "The notion of classism creates an invisible barrier between those who feel superior and those who are looked down upon.",
            "sent5": "The character in the story epitomized the worst aspects of classism, thinking themselves above everyone else."
        },
        {
            "definition": "The systemic oppression and marginalization of individuals based on their social class.",
            "pos": "noun",
            "sent1": "Classism in society can prevent individuals from advancing due to their social status.",
            "sent2": "The cycle of poverty is often perpetuated by the effects of classism.",
            "sent3": "In a humorous twist, the comedy show highlighted the absurdity of classism through exaggerated characters.",
            "sent4": "The weight of classism can feel like a heavy burden on those who are constantly judged based on their social class.",
            "sent5": "The artist's painting vividly depicted the struggles faced by individuals caught in the web of classism."
        }
    ]
}