{
    "term": "classically",
    "meanings": [
        {
            "definition": "In a traditional or typical manner",
            "pos": "adverb",
            "sent1": "She dressed classically for the school play, wearing a white shirt and black pants.",
            "sent2": "The old house was decorated classically with antique furniture and elegant curtains.",
            "sent3": "The cat meowed classically as if it were reciting a Shakespearean sonnet.",
            "sent4": "Her handwriting flowed classically across the page like a well-composed symphony.",
            "sent5": "The clock chimed classically, marking the passage of time with a sense of nostalgia."
        },
        {
            "definition": "In a way that is characteristic of a particular style or period",
            "pos": "adverb",
            "sent1": "The artist painted classically, using techniques reminiscent of the Renaissance masters.",
            "sent2": "The music from the 80s is classically upbeat and full of energy.",
            "sent3": "The chef prepared the dish classically, following a recipe passed down through generations.",
            "sent4": "Her dance moves were classically elegant, evoking images of ballrooms from the past.",
            "sent5": "The building was designed classically, with columns and arches that echoed ancient architecture."
        },
        {
            "definition": "In a manner that is considered to be of the highest quality or standard",
            "pos": "adverb",
            "sent1": "The tailor crafted the suit classically, ensuring every stitch was perfect.",
            "sent2": "The pianist played the piece classically, eliciting applause from the audience.",
            "sent3": "The comedian delivered his jokes classically, leaving the crowd in stitches.",
            "sent4": "Her speech was classically eloquent, captivating everyone in the room.",
            "sent5": "The garden was landscaped classically, with meticulous attention to detail."
        }
    ]
}