{
    "term": "clashed",
    "meanings": [
        {
            "definition": "To come into conflict or disagreement",
            "pos": "verb",
            "sent1": "The two friends clashed over which game to play.",
            "sent2": "The siblings often clashed over who gets to use the computer first.",
            "sent3": "During the game, the players clashed over the rules, causing laughter.",
            "sent4": "The ideas clashed like thunder in a storm, creating sparks of creativity.",
            "sent5": "Their opinions clashed like swords in a fierce battle, leaving no room for compromise."
        },
        {
            "definition": "To make a loud, harsh noise",
            "pos": "verb",
            "sent1": "The cymbals clashed loudly during the music performance.",
            "sent2": "The pots and pans clashed noisily as they fell from the shelf.",
            "sent3": "The clash of the symbols startled the sleeping cat, making it jump.",
            "sent4": "The clash of the metal gates echoed through the empty street, signaling the end of the day.",
            "sent5": "The clash of the waves against the rocks sounded like a fierce battle between nature's forces."
        },
        {
            "definition": "A loud, harsh noise",
            "pos": "noun",
            "sent1": "The clash of thunder could be heard in the distance.",
            "sent2": "The clash of metal against metal rang through the battlefield.",
            "sent3": "The clash of the symbols added a dramatic touch to the music piece.",
            "sent4": "The clash of the car crash made everyone turn their heads in alarm.",
            "sent5": "The clash of the pots and pans in the kitchen indicated a busy cooking session."
        },
        {
            "definition": "A conflict or disagreement",
            "pos": "noun",
            "sent1": "The clash between the two teams led to a heated argument.",
            "sent2": "The clash of opinions in the meeting resulted in a stalemate.",
            "sent3": "The clash of schedules caused confusion among the group.",
            "sent4": "The clash of interests between the siblings created tension in the household.",
            "sent5": "The clash of personalities in the office made it difficult to work together."
        }
    ]
}