{
    "term": "classisms",
    "meanings": [
        {
            "definition": "Discrimination or prejudice against people based on their social class.",
            "pos": "noun",
            "sent1": "Classisms can lead to unfair treatment of individuals from different social classes.",
            "sent2": "The teacher addressed the issue of classisms in society during the lesson.",
            "sent3": "At the party, the classisms between the guests were evident in their interactions.",
            "sent4": "The shadow of classisms loomed over the workplace, affecting promotions and opportunities.",
            "sent5": "The documentary shed light on the harmful effects of classisms on communities."
        },
        {
            "definition": "The belief in the superiority of one social class over another.",
            "pos": "noun",
            "sent1": "Her strong classisms made her look down on those from less affluent backgrounds.",
            "sent2": "The notion of classisms often leads to division and inequality in society.",
            "sent3": "His classisms were so extreme that he refused to associate with anyone outside his social circle.",
            "sent4": "The concept of classisms is like a barrier that separates people based on wealth.",
            "sent5": "The novel portrayed the destructive consequences of extreme classisms."
        },
        {
            "definition": "Actions or attitudes that favor one social class over another.",
            "pos": "noun",
            "sent1": "The company's policies showed clear signs of classisms in their hiring practices.",
            "sent2": "Classisms can be subtle, but their impact on society is significant.",
            "sent3": "Her classisms were evident when she only invited wealthy individuals to her events.",
            "sent4": "The political leader's classisms alienated a large portion of the population.",
            "sent5": "Overcoming classisms requires a shift in mindset and behavior towards equality."
        }
    ]
}