{
    "term": "classis",
    "meanings": [
        {
            "definition": "A group of students meeting regularly to study a subject.",
            "pos": "noun",
            "sent1": "In our classis, we learn about math every day.",
            "sent2": "The biology classis is full of eager learners.",
            "sent3": "The classis on dinosaurs was so fun, we felt like explorers!",
            "sent4": "The classis of young minds sailed through the sea of knowledge.",
            "sent5": "The classis on space made us feel like we were astronauts."
        },
        {
            "definition": "A group of students in a school or college of the same year.",
            "pos": "noun",
            "sent1": "The senior classis is preparing for graduation.",
            "sent2": "My classis is very supportive and friendly.",
            "sent3": "The classis of 2023 is known for their school spirit.",
            "sent4": "The classis of freshmen navigated high school together.",
            "sent5": "Being part of the classis of 2022 was a memorable experience."
        },
        {
            "definition": "A group of people or things with shared characteristics.",
            "pos": "noun",
            "sent1": "The classis of artists showcased their work at the gallery.",
            "sent2": "The classis of birds flew together in perfect formation.",
            "sent3": "The classis of ice cream flavors made it hard to choose just one.",
            "sent4": "The classis of superheroes united to save the city.",
            "sent5": "The classis of flowers in the garden bloomed beautifully."
        },
        {
            "definition": "A group of warships under a single command.",
            "pos": "noun",
            "sent1": "The naval classis patrolled the waters to protect the coast.",
            "sent2": "The classis of battleships sailed in formation towards the enemy.",
            "sent3": "The classis of toy boats in the bathtub had a fierce battle.",
            "sent4": "The classis of warships stood ready for any threat on the horizon.",
            "sent5": "The classis of ships moved as one, a force to be reckoned with."
        }
    ]
}