{
    "term": "class",
    "meanings": [
        {
            "definition": "A group of students meeting regularly to study a subject.",
            "pos": "noun",
            "sent1": "In math class, we learn about numbers and shapes.",
            "sent2": "The science class is in room 203 on the second floor.",
            "sent3": "During art class, we painted with our feet for fun.",
            "sent4": "Her dance moves were like a master class in elegance.",
            "sent5": "The history class felt like a journey through time."
        },
        {
            "definition": "A group of people or things with shared characteristics.",
            "pos": "noun",
            "sent1": "The upper class in society often has more privileges.",
            "sent2": "The working class includes people who do manual labor.",
            "sent3": "The class of superheroes all had unique powers.",
            "sent4": "Their team was a class of skilled professionals.",
            "sent5": "The class of birds in the forest sang harmoniously."
        },
        {
            "definition": "A set or category of things having some property or attribute in common.",
            "pos": "noun",
            "sent1": "The luxury class of cars is known for its comfort.",
            "sent2": "The middle class forms a significant part of the population.",
            "sent3": "The class of desserts at the party was irresistible.",
            "sent4": "His collection included a class of rare stamps.",
            "sent5": "The class of flowers in the garden bloomed beautifully."
        },
        {
            "definition": "A social stratum sharing basic economic, political, or cultural characteristics.",
            "pos": "noun",
            "sent1": "The ruling class made decisions for the country.",
            "sent2": "The lower class often struggles to make ends meet.",
            "sent3": "The class of artists showcased their talents at the event.",
            "sent4": "She belonged to a class of intellectuals who valued knowledge.",
            "sent5": "The class of musicians played in perfect harmony."
        }
    ]
}