{
    "term": "clash",
    "meanings": [
        {
            "definition": "A violent confrontation or skirmish.",
            "pos": "noun",
            "sent1": "The clash between the two rival gangs was intense.",
            "sent2": "The clash between the two armies resulted in casualties.",
            "sent3": "The clash over the last piece of cake was settled with a game of rock-paper-scissors.",
            "sent4": "The clash of thunder and lightning echoed through the night sky.",
            "sent5": "The clash of swords in the movie battle scene was thrilling to watch."
        },
        {
            "definition": "A disagreement or conflict.",
            "pos": "noun",
            "sent1": "The clash between the siblings was about who gets to choose the TV show.",
            "sent2": "The clash between the coworkers led to a heated argument.",
            "sent3": "The clash over which flavor of ice cream to get caused laughter at the ice cream shop.",
            "sent4": "The clash of opinions in the meeting made it hard to reach a decision.",
            "sent5": "The clash of personalities in the group project created tension among the team members."
        },
        {
            "definition": "To collide or come into conflict.",
            "pos": "verb",
            "sent1": "The two cars will clash if they both try to park in the same spot.",
            "sent2": "The waves clash against the rocks along the shore.",
            "sent3": "The colors of the two paintings clash in a way that strangely works together.",
            "sent4": "The ideas clash in his mind, making it hard to focus on one solution.",
            "sent5": "The two political candidates clash on various issues during the debate."
        },
        {
            "definition": "To be incompatible or at odds.",
            "pos": "verb",
            "sent1": "His red shirt will clash with the green pants he wants to wear.",
            "sent2": "The loud music from the party clashed with the peaceful atmosphere of the library.",
            "sent3": "The flavors in the dish clash, creating a unique taste that some love and others dislike.",
            "sent4": "Their schedules clash, making it difficult to find a time to meet.",
            "sent5": "The different styles of architecture clash in the city skyline, creating a diverse look."
        }
    ]
}