{
    "term": "claudications",
    "meanings": [
        {
            "definition": "The act of limping or walking with difficulty due to pain or stiffness.",
            "pos": "noun",
            "sent1": "After injuring his leg, he experienced claudications while trying to walk.",
            "sent2": "The elderly man's claudications made it hard for him to keep up with his grandchildren.",
            "sent3": "During the race, the turtle's claudications caused much amusement among the spectators.",
            "sent4": "Her claudications were like invisible chains holding her back from reaching her full potential.",
            "sent5": "The sound of his claudications echoed through the quiet forest."
        },
        {
            "definition": "A symptom of peripheral artery disease characterized by cramping or pain in the legs during physical activity.",
            "pos": "noun",
            "sent1": "She visited the doctor to discuss her claudications that worsened with exercise.",
            "sent2": "His claudications often forced him to stop and rest during his morning walks.",
            "sent3": "The clown's exaggerated claudications during the performance had the audience in stitches.",
            "sent4": "The claudications of the city's traffic mirrored the congested arteries of the patients in the hospital.",
            "sent5": "The sharp pain of her claudications felt like tiny daggers stabbing her legs."
        },
        {
            "definition": "A medical term for the condition of having difficulty walking due to pain or weakness in the legs.",
            "pos": "noun",
            "sent1": "The doctor explained that her claudications were a result of nerve damage.",
            "sent2": "His claudications made it challenging for him to navigate the steep mountain trails.",
            "sent3": "The robot's claudications in the sci-fi movie added a humorous touch to the intense scene.",
            "sent4": "The weight of his worries felt like heavy claudications dragging him down.",
            "sent5": "The vivid image of her claudications stayed etched in his memory."
        }
    ]
}