{
    "term": "clear",
    "meanings": [
        {
            "definition": "Easy to perceive, understand, or interpret.",
            "pos": "adjective",
            "sent1": "The instructions were clear and simple to follow.",
            "sent2": "The water in the glass was clear and easy to see through.",
            "sent3": "It was clear as day that the cat was trying to catch the laser pointer.",
            "sent4": "Her voice was as clear as a bell, ringing through the quiet room.",
            "sent5": "The teacher's explanation was so clear that even the youngest student understood."
        },
        {
            "definition": "Free from clouds, mist, or haze.",
            "pos": "adjective",
            "sent1": "The sky was clear and blue on a sunny day.",
            "sent2": "The lake was clear, reflecting the surrounding mountains perfectly.",
            "sent3": "The path ahead was clear, with no fog to obscure the view.",
            "sent4": "Her mind was as clear as the cloudless sky, focused and sharp.",
            "sent5": "The air was so clear after the rain, you could see for miles."
        },
        {
            "definition": "Transparent or unclouded.",
            "pos": "adjective",
            "sent1": "The clear glass allowed us to see the fish swimming inside.",
            "sent2": "The crystal was so clear, it sparkled in the sunlight.",
            "sent3": "The lake was so clear, it looked like a giant mirror reflecting the sky.",
            "sent4": "Her eyes were as clear as the glass of a window, revealing her emotions.",
            "sent5": "The diamond was so clear and bright, it seemed to glow from within."
        },
        {
            "definition": "Free from obstruction or obstacles.",
            "pos": "adjective",
            "sent1": "The path was clear of fallen branches, making it easy to walk.",
            "sent2": "The road ahead was clear, with no traffic in sight.",
            "sent3": "With a clear path to the finish line, she sprinted towards victory.",
            "sent4": "His mind was as clear as the open road, free from distractions.",
            "sent5": "The field was so clear of rocks that it was perfect for a picnic."
        },
        {
            "definition": "Free from doubt or confusion.",
            "pos": "adjective",
            "sent1": "After the explanation, her doubts were clear and resolved.",
            "sent2": "His intentions were clear, with no room for misinterpretation.",
            "sent3": "The map provided a clear path through the maze of confusion.",
            "sent4": "Her decision was as clear as a crystal, unwavering and final.",
            "sent5": "The answer to the riddle became clear as day once she solved it."
        }
    ]
}