{
    "term": "clean",
    "meanings": [
        {
            "definition": "Free from dirt, marks, or stains.",
            "pos": "adjective",
            "sent1": "She wore a clean dress to the party.",
            "sent2": "The kitchen floor is clean after mopping.",
            "sent3": "He was proud of his clean record at school.",
            "sent4": "Her clean reputation made her a trustworthy person.",
            "sent5": "The clean windows sparkled in the sunlight."
        },
        {
            "definition": "Not contaminated or polluted.",
            "pos": "adjective",
            "sent1": "The water in the mountain stream is clean to drink.",
            "sent2": "The fresh air in the countryside is clean and pure.",
            "sent3": "The clean environment helped the animals thrive.",
            "sent4": "Her clean conscience allowed her to sleep peacefully.",
            "sent5": "The clean air filled his lungs with freshness."
        },
        {
            "definition": "Morally uncontaminated; pure; innocent.",
            "pos": "adjective",
            "sent1": "She had a clean heart and always helped others.",
            "sent2": "The child's clean intentions were evident in his actions.",
            "sent3": "His clean soul shone through his kind gestures.",
            "sent4": "The clean spirit of the volunteers inspired everyone.",
            "sent5": "Her clean thoughts guided her to do good deeds."
        },
        {
            "definition": "Neat and tidy; well-organized.",
            "pos": "adjective",
            "sent1": "The clean desk had all the papers neatly arranged.",
            "sent2": "Her room was clean and tidy, with everything in its place.",
            "sent3": "The clean layout of the website made navigation easy.",
            "sent4": "His clean handwriting made the letter easy to read.",
            "sent5": "The clean shelves displayed the books beautifully."
        },
        {
            "definition": "Free from unwanted substances or impurities.",
            "pos": "adjective",
            "sent1": "The clean water from the filter tasted refreshing.",
            "sent2": "The clean ingredients in the recipe made it healthy.",
            "sent3": "The clean fuel helped the car run smoothly.",
            "sent4": "Her clean diet consisted of fresh fruits and vegetables.",
            "sent5": "The clean fabric felt soft against her skin."
        }
    ]
}