{
    "term": "clears",
    "meanings": [
        {
            "definition": "Remove objects from an area",
            "pos": "verb",
            "sent1": "She clears the table after dinner every night.",
            "sent2": "The janitor clears the trash from the school hallway.",
            "sent3": "The magician clears the stage of all props, leaving the audience in awe.",
            "sent4": "As the sun sets, it clears the sky of its golden hues.",
            "sent5": "With a swift motion, he clears the clutter, revealing a clean space."
        },
        {
            "definition": "Free from clouds or mist",
            "pos": "adjective",
            "sent1": "The sky is clear and blue on a sunny day.",
            "sent2": "The weather forecast predicts clear skies for the weekend.",
            "sent3": "The clear sky allows the stars to shine brightly at night.",
            "sent4": "Her mind was clear like a cloudless sky, free from any doubts.",
            "sent5": "The lake reflects the clear sky, creating a beautiful mirror image."
        },
        {
            "definition": "Easily understood or perceived",
            "pos": "adjective",
            "sent1": "His instructions were clear and easy to follow.",
            "sent2": "The teacher's explanation was clear, and the students understood the concept.",
            "sent3": "The map was so clear that even a child could navigate using it.",
            "sent4": "Her intentions were as clear as crystal, impossible to misinterpret.",
            "sent5": "The road signs were clear, guiding the travelers on their journey."
        },
        {
            "definition": "Pass through a checkpoint or inspection",
            "pos": "verb",
            "sent1": "The security guard clears each visitor before allowing them inside.",
            "sent2": "The customs officer clears the passengers for international travel.",
            "sent3": "The detective clears the suspect after a thorough investigation.",
            "sent4": "The athlete clears the doping test, proving his innocence.",
            "sent5": "The document clears all security checks, ensuring its authenticity."
        },
        {
            "definition": "Make a profit after expenses",
            "pos": "verb",
            "sent1": "The business clears a significant profit this quarter.",
            "sent2": "After careful calculations, the company clears a profit margin.",
            "sent3": "The farmer clears a profit from selling his crops at the market.",
            "sent4": "The store clears a profit despite the economic downturn.",
            "sent5": "With smart investments, he clears a profit in the stock market."
        }
    ]
}