{
    "term": "cleat",
    "meanings": [
        {
            "definition": "A metal or wooden fitting on a boat or ship to which a rope is fastened.",
            "pos": "noun",
            "sent1": "The sailor tied the rope securely to the cleat on the boat.",
            "sent2": "The captain instructed the crew to fasten the rope to the cleat on the ship.",
            "sent3": "As the storm approached, the cleat on the boat whispered to the rope, 'Hold on tight!'",
            "sent4": "The cleat on the ship stood strong like a loyal guardian, keeping the rope safe.",
            "sent5": "The shiny cleat on the boat gleamed in the sunlight, a beacon for the sailors."
        },
        {
            "definition": "A wedge-shaped piece of wood or metal used to secure or support something.",
            "pos": "noun",
            "sent1": "The carpenter hammered the cleat firmly to secure the shelf in place.",
            "sent2": "She used a cleat to support the wobbly table leg.",
            "sent3": "The mischievous squirrel balanced on the cleat, pretending to be a tightrope walker.",
            "sent4": "The cleat acted like a sturdy anchor, keeping the shelf from falling.",
            "sent5": "With a loud thud, the cleat locked the shelf securely in place."
        },
        {
            "definition": "A piece of metal or plastic with projecting arms for holding a shoe in position on a pedal.",
            "pos": "noun",
            "sent1": "The cyclist adjusted the cleat on the pedal for a comfortable ride.",
            "sent2": "She attached the cleat to her shoe to improve her cycling performance.",
            "sent3": "The mischievous cat tried to play with the cleat on the pedal, thinking it was a toy.",
            "sent4": "With the cleat in place, her shoe felt like it was part of the pedal, moving as one.",
            "sent5": "The cleat clicked into position, ready to provide a strong grip for the cyclist's shoe."
        }
    ]
}