{
    "term": "clenches",
    "meanings": [
        {
            "definition": "Grasps tightly",
            "pos": "verb",
            "sent1": "She clenches her fists when she is angry.",
            "sent2": "He clenches the rope to hold on tight.",
            "sent3": "The teddy bear clenches the blanket for comfort.",
            "sent4": "The storm clenches the town in its fierce grip.",
            "sent5": "The child clenches the toy with excitement."
        },
        {
            "definition": "Holds firmly",
            "pos": "verb",
            "sent1": "The squirrel clenches the nut in its paws.",
            "sent2": "The rock climber clenches the ledge to stay safe.",
            "sent3": "The robot clenches the key to unlock the door.",
            "sent4": "The memory clenches her heart with nostalgia.",
            "sent5": "The detective clenches the evidence to solve the case."
        },
        {
            "definition": "Tightens the muscles in a fist",
            "pos": "verb",
            "sent1": "He clenches his hand before throwing the ball.",
            "sent2": "She clenches her fingers to show determination.",
            "sent3": "The magician clenches his hand to reveal a surprise.",
            "sent4": "The warrior clenches his fist before battle.",
            "sent5": "The pianist clenches his fingers before playing a difficult piece."
        },
        {
            "definition": "Secures tightly",
            "pos": "verb",
            "sent1": "She clenches the lid on the jar to keep it closed.",
            "sent2": "He clenches the lock to ensure it stays shut.",
            "sent3": "The chef clenches the lid on the pot to prevent spills.",
            "sent4": "The guard clenches the gate to secure the entrance.",
            "sent5": "The builder clenches the nails to fasten the boards together."
        },
        {
            "definition": "Closes tightly",
            "pos": "verb",
            "sent1": "The flower clenches its petals at night.",
            "sent2": "The book clenches its pages in the wind.",
            "sent3": "The door clenches shut against the strong wind.",
            "sent4": "The box clenches its lid to protect its contents.",
            "sent5": "The window clenches tightly during the storm."
        }
    ]
}