{
    "term": "clew",
    "meanings": [
        {
            "definition": "A ball of yarn or thread.",
            "pos": "noun",
            "sent1": "I found a clew of yarn in the basket.",
            "sent2": "She used a clew of thread to sew the button back on.",
            "sent3": "The mischievous kitten played with the clew, unraveling it all over the room.",
            "sent4": "The clew of yarn was like a colorful snake winding through the house.",
            "sent5": "The clew of thread was so tangled, it looked like a tiny maze."
        },
        {
            "definition": "A hint or indication.",
            "pos": "noun",
            "sent1": "The detective followed every clew to solve the case.",
            "sent2": "His sudden cough was a clew that he was hiding something.",
            "sent3": "The mysterious note left on the table was a clever clew to the surprise party.",
            "sent4": "Her smile was a bright clew that everything would be okay.",
            "sent5": "The old map provided a valuable clew to the hidden treasure."
        },
        {
            "definition": "To unravel or solve a mystery.",
            "pos": "verb",
            "sent1": "She tried to clew the puzzle of the missing sock.",
            "sent2": "The detective worked hard to clew the mysterious disappearance.",
            "sent3": "He cleverly clewed the riddle by following the clues.",
            "sent4": "The key evidence helped them clew the crime in no time.",
            "sent5": "They managed to clew the secret code and unlock the door."
        },
        {
            "definition": "To guide or direct.",
            "pos": "verb",
            "sent1": "The lighthouse clewed the ships safely to shore.",
            "sent2": "She clewed her friends through the maze to the exit.",
            "sent3": "The wise old owl clewed the young birds on their first flight.",
            "sent4": "His experience helped him clew the new employees in their tasks.",
            "sent5": "The map clewed them to the hidden waterfall deep in the forest."
        }
    ]
}