{
    "term": "clifty",
    "meanings": [
        {
            "definition": "Having steep cliffs",
            "pos": "adjective",
            "sent1": "The mountain was very clifty, with steep sides that were hard to climb.",
            "sent2": "The clifty terrain made hiking difficult but provided stunning views.",
            "sent3": "The clifty hill looked like a giant staircase for adventurous ants.",
            "sent4": "The clifty walls of the canyon rose high above, casting shadows on the valley below.",
            "sent5": "The clifty cliffs loomed ominously, daring any brave soul to attempt the ascent."
        },
        {
            "definition": "A steep cliff or slope",
            "pos": "noun",
            "sent1": "The hiker cautiously approached the clifty edge, marveling at the view below.",
            "sent2": "The birds nested on the clifty ledges, safe from predators below.",
            "sent3": "The children pretended the backyard hill was a clifty mountain, scaling its heights with glee.",
            "sent4": "The ship sailed close to the clifty shore, the waves crashing against the rocky cliffs.",
            "sent5": "The climber paused at the clifty precipice, taking a deep breath before descending into the unknown."
        },
        {
            "definition": "A place with steep cliffs",
            "pos": "noun",
            "sent1": "The coastal town was known for its clifty coastline, attracting tourists and rock climbers alike.",
            "sent2": "The explorer marveled at the beauty of the clifty region, untouched by human hands.",
            "sent3": "The village nestled in the clifty valley, protected from harsh winds by the towering cliffs.",
            "sent4": "The ancient ruins perched on the clifty plateau, overlooking the vast expanse below.",
            "sent5": "The sunset painted the clifty landscape in hues of orange and pink, a breathtaking sight to behold."
        }
    ]
}