{
    "term": "clip",
    "meanings": [
        {
            "definition": "A small piece of metal or plastic used to hold things together or in place.",
            "pos": "noun",
            "sent1": "I used a clip to hold my papers together.",
            "sent2": "She put a clip in her hair to keep it from falling in her face.",
            "sent3": "The clip on the bag broke, and all the groceries spilled out!",
            "sent4": "His words were like a clip to my heart, leaving me feeling exposed.",
            "sent5": "The clip gleamed in the sunlight, a tiny hero keeping order in chaos."
        },
        {
            "definition": "To cut something short with scissors or shears.",
            "pos": "verb",
            "sent1": "I need to clip my nails before they get too long.",
            "sent2": "She decided to clip the bushes in the garden to make them look neat.",
            "sent3": "He accidentally tried to clip the wrong wire, causing a small explosion.",
            "sent4": "Time seemed to clip by as they laughed and talked late into the night.",
            "sent5": "The barber would deftly clip away at the hair, transforming each head into a work of art."
        },
        {
            "definition": "A short extract from a film or video.",
            "pos": "noun",
            "sent1": "I watched a clip of the new movie on my phone.",
            "sent2": "The teacher showed a clip from a documentary to illustrate her point.",
            "sent3": "The funny clip made everyone in the room burst into laughter.",
            "sent4": "The clip of the car chase was so intense, it felt like I was in the movie.",
            "sent5": "The clip of the sunset was so beautiful, it brought tears to my eyes."
        },
        {
            "definition": "To fasten or attach something with a clip.",
            "pos": "verb",
            "sent1": "She needed to clip the microphone onto her shirt before going on stage.",
            "sent2": "He used a clip to attach the photo to the bulletin board.",
            "sent3": "The magician clipped the card to his sleeve, ready for a surprise trick.",
            "sent4": "Her words seemed to clip onto his heart, making him feel understood.",
            "sent5": "The astronaut had to clip the safety harness before stepping out into space."
        },
        {
            "definition": "A sharp blow or hit.",
            "pos": "noun",
            "sent1": "The boxer delivered a powerful clip to his opponent's jaw.",
            "sent2": "The tree branch gave a sharp clip to my shoulder as I walked by.",
            "sent3": "The unexpected clip on the head left him seeing stars.",
            "sent4": "His words had a sharp clip to them, making her realize the truth.",
            "sent5": "The clip of thunder echoed through the valley, shaking the ground beneath our feet."
        }
    ]
}