{
    "term": "clipped",
    "meanings": [
        {
            "definition": "Trimmed or cut short",
            "pos": "adjective",
            "sent1": "The boy's hair was clipped neatly for school.",
            "sent2": "The hedge was clipped to keep it tidy.",
            "sent3": "She clipped the coupon carefully to save money.",
            "sent4": "The artist's clipped brushstrokes gave the painting a unique style.",
            "sent5": "The clipped edges of the paper made it easier to fit in the folder."
        },
        {
            "definition": "To fasten or hold together with a clip",
            "pos": "verb",
            "sent1": "She clipped the papers together before handing them in.",
            "sent2": "The teacher clipped the student's work to the bulletin board.",
            "sent3": "He clipped the leash onto the dog's collar before going for a walk.",
            "sent4": "The astronaut clipped his safety harness before the spacewalk.",
            "sent5": "The tailor clipped the fabric to keep it in place while sewing."
        },
        {
            "definition": "To move quickly and sharply",
            "pos": "verb",
            "sent1": "The squirrel clipped across the yard to reach the tree.",
            "sent2": "The car clipped along the highway, eager to reach its destination.",
            "sent3": "The ball clipped the edge of the table before bouncing off.",
            "sent4": "The bird clipped through the air with grace and speed.",
            "sent5": "The wind clipped through the trees, rustling the leaves."
        },
        {
            "definition": "To speak in a concise or abrupt manner",
            "pos": "verb",
            "sent1": "She clipped her words, getting straight to the point.",
            "sent2": "The boss clipped his instructions, leaving no room for confusion.",
            "sent3": "He clipped his response, not wanting to waste time on explanations.",
            "sent4": "The comedian clipped his jokes, making the audience laugh quickly.",
            "sent5": "The teacher clipped her feedback, giving clear and direct comments."
        }
    ]
}