{
    "term": "clipping",
    "meanings": [
        {
            "definition": "A small piece that has been cut off something.",
            "pos": "noun",
            "sent1": "I found a clipping of paper on the floor.",
            "sent2": "The gardener trimmed a clipping from the bush.",
            "sent3": "The cat played with the clipping of ribbon, thinking it was a toy.",
            "sent4": "Her heart felt like a clipping of sadness, torn away from her.",
            "sent5": "The clipping of sunlight through the trees was beautiful."
        },
        {
            "definition": "The act of cutting something off.",
            "pos": "noun",
            "sent1": "The clipping of the coupon saved her money at the store.",
            "sent2": "His quick clipping of the thread fixed the tear in his shirt.",
            "sent3": "The barber's clipping of hair left him with a stylish new look.",
            "sent4": "The clipping of the wire was necessary to repair the fence.",
            "sent5": "The loud clipping of the scissors echoed in the room."
        },
        {
            "definition": "A short extract from a film or recording.",
            "pos": "noun",
            "sent1": "The movie trailer showed a clipping of the action scenes.",
            "sent2": "She shared a clipping of the song from her favorite band.",
            "sent3": "The comedian's clipping of the show had everyone laughing.",
            "sent4": "The news report included a clipping of the interview with the celebrity.",
            "sent5": "The podcast played a clipping of the interesting conversation."
        },
        {
            "definition": "A shortened form of a word or phrase.",
            "pos": "noun",
            "sent1": "The clipping of 'info' is commonly used for information.",
            "sent2": "In texting, 'LOL' is a clipping for 'laugh out loud'.",
            "sent3": "The abbreviation 'ASAP' is a clipping often seen in emails.",
            "sent4": "The term 'gym' is a clipping of 'gymnasium'.",
            "sent5": "Using 'photo' as a clipping for 'photograph' is common in casual speech."
        }
    ]
}