{
    "term": "cloakrooms",
    "meanings": [
        {
            "definition": "A room in a public building where coats and other outer garments may be left.",
            "pos": "noun",
            "sent1": "The cloakrooms at the museum were filled with visitors' jackets.",
            "sent2": "After the play, everyone rushed to the cloakrooms to retrieve their coats.",
            "sent3": "The cloakrooms were so crowded that finding my coat felt like a treasure hunt.",
            "sent4": "In the sea of coats, the cloakrooms resembled a colorful forest of fabric.",
            "sent5": "The cloakrooms smelled of damp wool and perfume, a unique blend of scents."
        },
        {
            "definition": "A room in a theater or school where coats and other personal belongings may be stored.",
            "pos": "noun",
            "sent1": "Students hurried to the cloakrooms to grab their backpacks before the bell rang.",
            "sent2": "During intermission, the theater's cloakrooms were buzzing with activity.",
            "sent3": "The cloakrooms became a hub of gossip as students chatted while grabbing their jackets.",
            "sent4": "The cloakrooms were like a safe harbor for belongings in the storm of school life.",
            "sent5": "The theater's cloakrooms were a maze of hangers and shelves, a secret world behind the curtains."
        },
        {
            "definition": "A room in a house used for storing coats and other outerwear.",
            "pos": "noun",
            "sent1": "Every winter, the family gathered in the cloakrooms to pick out their warmest coats.",
            "sent2": "The cloakrooms in old houses often had a distinct musty smell.",
            "sent3": "The cloakrooms were a treasure trove of forgotten scarves and gloves.",
            "sent4": "In the cloakrooms, memories hung on the hooks along with the coats.",
            "sent5": "The cloakrooms were a cozy nook where the family's winter gear found refuge."
        }
    ]
}