{
    "term": "cloches",
    "meanings": [
        {
            "definition": "A bell-shaped glass cover used to protect plants from frost.",
            "pos": "noun",
            "sent1": "The gardener placed the cloches over the delicate flowers to shield them from the cold.",
            "sent2": "She bought a set of cloches to safeguard her plants during the winter months.",
            "sent3": "The mischievous squirrel tried to wear the cloches as a tiny helmet.",
            "sent4": "The cloches were like magical shields, keeping the garden safe from the icy fingers of frost.",
            "sent5": "The transparent cloches transformed the garden into a cozy haven for the fragile blooms."
        },
        {
            "definition": "A woman's close-fitting hat with a deep rounded crown and narrow brim.",
            "pos": "noun",
            "sent1": "She wore a stylish cloches that matched her outfit perfectly.",
            "sent2": "The elegant lady donned a cloches for the outdoor event.",
            "sent3": "The mischievous cat knocked the cloches off her head and played with it.",
            "sent4": "Her cloches perched on her head like a regal crown, adding a touch of sophistication to her look.",
            "sent5": "The cloches framed her face delicately, enhancing her beauty with its simple charm."
        },
        {
            "definition": "A bell-shaped cover placed over food to keep it warm.",
            "pos": "noun",
            "sent1": "The chef used the cloches to maintain the temperature of the dish until serving.",
            "sent2": "The guests were impressed by the fancy cloches covering the appetizers.",
            "sent3": "The cloches danced on the table as the steam escaped from the hot food below.",
            "sent4": "The cloches trapped the heat like a cozy blanket, preserving the delicious aroma of the meal.",
            "sent5": "The silver cloches gleamed under the warm lights, hinting at the culinary delights hidden beneath."
        }
    ]
}