{
    "term": "cloche",
    "meanings": [
        {
            "definition": "A bell-shaped cover used to protect plants from frost.",
            "pos": "noun",
            "sent1": "I placed a cloche over my delicate flowers to shield them from the cold.",
            "sent2": "The gardener carefully placed a cloche over the fragile seedlings to keep them warm.",
            "sent3": "The mischievous squirrel tried to wear the cloche as a tiny hat, thinking it was for fashion.",
            "sent4": "The cloche was like a guardian angel, watching over the plants and keeping them safe from harm.",
            "sent5": "The cloche enveloped the garden like a gentle hug, protecting the flowers from the harsh weather."
        },
        {
            "definition": "A woman's close-fitting hat with a bell-shaped crown.",
            "pos": "noun",
            "sent1": "She wore a stylish cloche that perfectly complemented her outfit.",
            "sent2": "In the vintage store, I found a beautiful cloche that reminded me of old Hollywood glamour.",
            "sent3": "The mischievous cat knocked the cloche off the mannequin's head and played with it like a toy.",
            "sent4": "Her cloche was a crown of elegance, adding a touch of sophistication to her ensemble.",
            "sent5": "The cloche perched on her head like a regal bird, giving her an air of grace and charm."
        },
        {
            "definition": "A bell-shaped glass cover used for serving food.",
            "pos": "noun",
            "sent1": "The chef placed a cloche over the dessert to keep it fresh until serving time.",
            "sent2": "The waiter lifted the cloche to reveal the steaming dish, releasing a tantalizing aroma.",
            "sent3": "The curious child peeked under the cloche to see what delicious treat was hidden inside.",
            "sent4": "The cloche transformed the simple dish into a mysterious surprise, adding to the dining experience.",
            "sent5": "Under the cloche, the food seemed to sparkle like a hidden treasure waiting to be discovered."
        }
    ]
}