{
    "term": "clocker",
    "meanings": [
        {
            "definition": "A person who times or records the speed of horses during workouts.",
            "pos": "noun",
            "sent1": "The clocker at the racetrack measured how fast the horses were running.",
            "sent2": "The experienced clocker knew exactly when to start and stop the timer for each horse.",
            "sent3": "The clocker chuckled as the horses raced past, trying to beat their own records.",
            "sent4": "The clocker's keen eye caught every detail of the horses' movements, like a hawk hunting its prey.",
            "sent5": "The clocker's job was to be as precise as a surgeon, timing each horse with utmost accuracy."
        },
        {
            "definition": "A device used to measure time, typically with hands or a digital display.",
            "pos": "noun",
            "sent1": "The clocker on the wall chimed every hour to let us know the time.",
            "sent2": "I glanced at the clocker on my wrist to see how much time had passed.",
            "sent3": "The digital clocker beeped loudly, startling everyone in the room.",
            "sent4": "The antique clocker in the hallway ticked like a heartbeat, marking the passage of time.",
            "sent5": "The clocker's hands moved slowly, as if reluctant to show the approaching deadline."
        },
        {
            "definition": "To time or record the speed of something, especially in sports or racing.",
            "pos": "verb",
            "sent1": "She had to clocker each runner's time as they crossed the finish line.",
            "sent2": "The coach asked me to clocker how fast the players were running during practice.",
            "sent3": "I tried to clocker the speed of my cat as she zoomed around the house.",
            "sent4": "The radar gun clocker the pitcher's fastball at an impressive speed.",
            "sent5": "He clocker the car's acceleration, impressed by its quickness."
        }
    ]
}