{
    "term": "cloff",
    "meanings": [
        {
            "definition": "To close or shut tightly",
            "pos": "verb",
            "sent1": "She had to cloff the door to keep the cold air out.",
            "sent2": "Please remember to cloff the window before leaving the room.",
            "sent3": "He tried to cloff the suitcase, but it was too full to close.",
            "sent4": "The flowers bloomed, and the petals seemed to cloff together at night.",
            "sent5": "The old house had shutters that would cloff with a loud noise when the wind blew."
        },
        {
            "definition": "A barrier or obstruction",
            "pos": "noun",
            "sent1": "The fallen tree acted as a cloff on the path through the forest.",
            "sent2": "The fence served as a cloff between the two properties.",
            "sent3": "The long line at the amusement park was a cloff to getting on the roller coaster.",
            "sent4": "Misunderstandings can create a cloff between friends.",
            "sent5": "The thick fog acted as a cloff, making it hard to see the road ahead."
        },
        {
            "definition": "A sound made by a heavy object falling",
            "pos": "noun",
            "sent1": "The loud cloff echoed through the empty warehouse.",
            "sent2": "The sudden cloff startled the sleeping cat.",
            "sent3": "The unexpected cloff made everyone jump in surprise.",
            "sent4": "The cloff of the book hitting the floor broke the silence in the library.",
            "sent5": "The cloff of the hammer hitting the nail could be heard from the next room."
        },
        {
            "definition": "To hit or strike forcefully",
            "pos": "verb",
            "sent1": "He accidentally cloffed his hand against the table while reaching for the phone.",
            "sent2": "The boxer trained hard to cloff his opponent with a powerful punch.",
            "sent3": "She playfully cloffed her brother on the shoulder to get his attention.",
            "sent4": "The storm cloffed the trees with strong winds, causing branches to fall.",
            "sent5": "The blacksmith would cloff the hot metal to shape it into tools."
        }
    ]
}