{
    "term": "clomipramine",
    "meanings": [
        {
            "definition": "A tricyclic antidepressant drug used to treat obsessive-compulsive disorder.",
            "pos": "noun",
            "sent1": "The doctor prescribed clomipramine to help with my OCD symptoms.",
            "sent2": "She takes clomipramine every day to manage her obsessive thoughts.",
            "sent3": "When the clomipramine kicked in, I suddenly felt like organizing everything in sight!",
            "sent4": "Her mind became a clear sky after taking clomipramine, sweeping away the storm of obsessions.",
            "sent5": "The effect of clomipramine on her OCD was like a gentle wave washing away the intrusive thoughts."
        },
        {
            "definition": "The generic name for a medication commonly prescribed for anxiety disorders.",
            "pos": "noun",
            "sent1": "My friend's doctor recommended clomipramine for her anxiety.",
            "sent2": "Clomipramine is known to be effective in treating various anxiety disorders.",
            "sent3": "After taking clomipramine, she felt as calm as a sleeping kitten.",
            "sent4": "The clomipramine acted like a shield against the anxiety that used to overwhelm her.",
            "sent5": "The relief she felt from clomipramine was like a warm hug on a cold day."
        },
        {
            "definition": "A type of medication that affects the levels of certain chemicals in the brain.",
            "pos": "noun",
            "sent1": "The pharmacist explained how clomipramine works on brain chemicals.",
            "sent2": "Clomipramine helps regulate neurotransmitters in the brain.",
            "sent3": "After taking clomipramine, it felt like my brain was dancing with joy!",
            "sent4": "The clomipramine was like a conductor orchestrating the brain's chemical symphony.",
            "sent5": "The impact of clomipramine on brain chemistry was like a key unlocking a hidden door."
        }
    ]
}