{
    "term": "closes",
    "meanings": [
        {
            "definition": "To shut something",
            "pos": "verb",
            "sent1": "She closes the door quietly.",
            "sent2": "He always closes the windows before leaving the house.",
            "sent3": "The magician closes the box and makes the rabbit disappear.",
            "sent4": "As the day closes, the sky turns into a canvas of colors.",
            "sent5": "The gate closes with a loud bang, echoing through the garden."
        },
        {
            "definition": "The end of a street or passage",
            "pos": "noun",
            "sent1": "The park is at the closes of the road.",
            "sent2": "The shop at the closes sells handmade crafts.",
            "sent3": "At the closes, you'll find a hidden gem of a cafe.",
            "sent4": "The mystery novel led the detective to the closes where the crime occurred.",
            "sent5": "The children played hide-and-seek around the closes."
        },
        {
            "definition": "The final part of a musical piece",
            "pos": "noun",
            "sent1": "The orchestra played the closes with great emotion.",
            "sent2": "The singer's voice soared in the closes of the song.",
            "sent3": "The closes of the symphony left the audience in awe.",
            "sent4": "The pianist's fingers danced gracefully in the closes.",
            "sent5": "The closes of the opera brought tears to many eyes."
        },
        {
            "definition": "Near in time or space",
            "pos": "adjective",
            "sent1": "The closes store is just around the corner.",
            "sent2": "We live in the closes neighborhood to the park.",
            "sent3": "The closes friends always support each other.",
            "sent4": "The closes bus stop is only a few steps away.",
            "sent5": "The closes planets in the solar system are Mercury and Venus."
        }
    ]
}