{
    "term": "closedowns",
    "meanings": [
        {
            "definition": "The act of closing down a business or operation.",
            "pos": "noun",
            "sent1": "The closedowns of small shops during the pandemic have been devastating for many owners.",
            "sent2": "The government ordered the closedowns of all non-essential services to curb the spread of the virus.",
            "sent3": "The closedowns of the ice cream parlors left the town feeling a bit too quiet.",
            "sent4": "The closedowns of factories echoed through the empty streets like a silent drumbeat.",
            "sent5": "The closedowns of the local stores painted a bleak picture of the economic situation."
        },
        {
            "definition": "The process of shutting down or ceasing operations.",
            "pos": "noun",
            "sent1": "The closedowns of the factories were gradual, giving workers time to find new jobs.",
            "sent2": "During the storm, the closedowns of flights caused chaos at the airport.",
            "sent3": "The closedowns of the amusement park rides made the children pout in disappointment.",
            "sent4": "The closedowns of the old coal mines marked the end of an era for the town.",
            "sent5": "The closedowns of the computer systems led to a complete halt in production."
        },
        {
            "definition": "The state of being closed or shut down.",
            "pos": "noun",
            "sent1": "The closedowns of the schools meant students had to switch to online learning.",
            "sent2": "The closedowns of the roads due to snow made commuting impossible.",
            "sent3": "The closedowns of the theme park attractions left visitors feeling stranded.",
            "sent4": "The closedowns of the shops on Sundays gave the town a peaceful vibe.",
            "sent5": "The closedowns of the train stations caused confusion among travelers."
        }
    ]
}