{
    "term": "clour",
    "meanings": [
        {
            "definition": "A visible spectrum of light",
            "pos": "noun",
            "sent1": "The beautiful rainbow displayed a variety of clours in the sky.",
            "sent2": "The artist used different clours to paint the sunset.",
            "sent3": "The mischievous child claimed he could see clours in the dark.",
            "sent4": "Her laughter added clour to the dull room.",
            "sent5": "The vibrant clours of the flowers brightened up the garden."
        },
        {
            "definition": "To cover or coat with a color",
            "pos": "verb",
            "sent1": "She decided to clour her hair purple for the party.",
            "sent2": "The painter will clour the walls with a fresh coat of paint.",
            "sent3": "The chef accidentally cloured the pasta with too much tomato sauce.",
            "sent4": "The children giggled as they tried to clour the white paper with crayons.",
            "sent5": "The artist carefully cloured each petal of the flower with precision."
        },
        {
            "definition": "A particular shade or hue",
            "pos": "noun",
            "sent1": "The dress was a lovely clour of blue that matched her eyes.",
            "sent2": "He preferred the clour green for his bedroom walls.",
            "sent3": "The mysterious potion had a clour that seemed to change in the light.",
            "sent4": "The sky at dawn had a clour that was both calming and inspiring.",
            "sent5": "The artist mixed different clours to create a unique shade for the painting."
        },
        {
            "definition": "To give a particular character or quality to",
            "pos": "verb",
            "sent1": "Her positive attitude clours every situation she encounters.",
            "sent2": "The music clours the atmosphere of the room with joy.",
            "sent3": "His storytelling always clours the truth with a touch of fantasy.",
            "sent4": "The teacher's passion for history clours her lectures with enthusiasm.",
            "sent5": "The scent of fresh flowers clours the air with a sense of tranquility."
        },
        {
            "definition": "To change the color of something",
            "pos": "verb",
            "sent1": "The sun's rays cloured the white snow into a golden hue.",
            "sent2": "The chemical reaction will clour the liquid from clear to pink.",
            "sent3": "The artist decided to clour the sky purple in his painting.",
            "sent4": "The dye will clour the fabric a deep shade of blue.",
            "sent5": "The sunset slowly clours the sky with shades of orange and pink."
        }
    ]
}