{
    "term": "clunk",
    "meanings": [
        {
            "definition": "A dull, metallic sound.",
            "pos": "noun",
            "sent1": "The clunk of the hammer hitting the metal echoed in the workshop.",
            "sent2": "I heard a loud clunk when the metal pipe fell on the ground.",
            "sent3": "The clunk of the old car engine made everyone chuckle.",
            "sent4": "The clunk of the closing door signaled the end of the day.",
            "sent5": "The clunk of the coins dropping into the piggy bank was music to his ears."
        },
        {
            "definition": "To make a dull, metallic sound.",
            "pos": "verb",
            "sent1": "He accidentally clunked the pots together while washing dishes.",
            "sent2": "The old engine clunked loudly before finally starting.",
            "sent3": "The robot clunked around the room, bumping into walls.",
            "sent4": "Her heart clunked in her chest as she nervously waited for the results.",
            "sent5": "The heavy book clunked onto the table as she dropped it in exhaustion."
        },
        {
            "definition": "A heavy, dull sound.",
            "pos": "noun",
            "sent1": "The clunk of the falling tree branch startled the birds.",
            "sent2": "The clunk of the rock hitting the ground echoed through the canyon.",
            "sent3": "The clunk of the hammer hitting the nail was oddly satisfying.",
            "sent4": "The clunk of the heavy door closing behind him signaled his departure.",
            "sent5": "The clunk of the weights hitting the gym floor indicated a successful workout."
        },
        {
            "definition": "To move with a heavy, dull sound.",
            "pos": "verb",
            "sent1": "The old truck clunked along the bumpy road.",
            "sent2": "The suitcase clunked down the stairs as she struggled to carry it.",
            "sent3": "The robot clunked its way through the obstacle course, surprising everyone.",
            "sent4": "His boots clunked on the wooden floor as he walked towards the door.",
            "sent5": "The heavy machinery clunked as it started up, ready for another day of work."
        }
    ]
}