{
    "term": "clutching",
    "meanings": [
        {
            "definition": "Grasping or holding tightly",
            "pos": "adjective",
            "sent1": "The scared kitten was clutching onto its mother for safety.",
            "sent2": "The strong man had a clutching grip on the heavy box.",
            "sent3": "The clutching monkey held onto the branch as if its life depended on it.",
            "sent4": "Her clutching fear of heights kept her from looking down.",
            "sent5": "The clutching vines wrapped around the tree trunk, refusing to let go."
        },
        {
            "definition": "To seize or grasp firmly",
            "pos": "verb",
            "sent1": "The child was clutching the toy tightly in his hand.",
            "sent2": "She was clutching her umbrella in the windy storm.",
            "sent3": "The detective was clutching at straws trying to solve the case.",
            "sent4": "The singer's voice clutching the audience's attention throughout the performance.",
            "sent5": "The hiker was clutching the map, trying to find the right path."
        },
        {
            "definition": "To try to hold onto something tightly",
            "pos": "verb",
            "sent1": "The little girl was clutching onto her balloon, afraid it might fly away.",
            "sent2": "He was clutching onto the railing as the boat rocked back and forth.",
            "sent3": "The comedian was clutching onto the microphone for dear life during his stand-up routine.",
            "sent4": "The student was clutching onto his notes, hoping to remember the answers for the test.",
            "sent5": "The squirrel was clutching onto the acorn, not willing to share it with anyone."
        },
        {
            "definition": "To hold onto something tightly in a time of need",
            "pos": "verb",
            "sent1": "She was clutching onto her phone, waiting for an important call.",
            "sent2": "The injured player was clutching onto his knee in pain.",
            "sent3": "The survivor was clutching onto the raft, hoping to be rescued soon.",
            "sent4": "The child was clutching onto his teddy bear for comfort during the thunderstorm.",
            "sent5": "The climber was clutching onto the rope, trying to reach the summit."
        }
    ]
}