{
    "term": "coals",
    "meanings": [
        {
            "definition": "A combustible black or dark brown rock consisting mainly of carbonized plant matter, used as fuel.",
            "pos": "noun",
            "sent1": "The miners dug deep to extract the coals for heating their homes.",
            "sent2": "The fireplace crackled with the warmth of burning coals on a cold winter night.",
            "sent3": "The mischievous squirrel mistook the coals for nuts and tried to bury them in the garden.",
            "sent4": "Her passion for music was like a burning coal, always glowing and providing warmth to those around her.",
            "sent5": "The coals glowed red in the darkness, casting a comforting light in the room."
        },
        {
            "definition": "A burning fuel or material, such as wood or charcoal, in a fireplace or stove.",
            "pos": "noun",
            "sent1": "The campfire crackled with the coals, sending sparks into the night sky.",
            "sent2": "She added more coals to the stove to keep the house warm during the storm.",
            "sent3": "The chef accidentally dropped the coals on the floor, creating a mess in the kitchen.",
            "sent4": "His anger simmered like hidden coals, ready to ignite at any moment.",
            "sent5": "The coals glowed brightly, providing a cozy atmosphere in the cabin."
        },
        {
            "definition": "A piece of glowing or charred wood or other material.",
            "pos": "noun",
            "sent1": "The coals from the bonfire illuminated the faces of the campers.",
            "sent2": "She carefully placed the coals in the grill to cook the burgers to perfection.",
            "sent3": "The artist used the coals to create intricate patterns on the canvas.",
            "sent4": "His eyes smoldered like hidden coals, revealing his intense emotions.",
            "sent5": "The coals crackled and popped, releasing a warm and inviting aroma."
        },
        {
            "definition": "A source of vitality or energy.",
            "pos": "noun",
            "sent1": "Her laughter was like a burst of coals, spreading joy to everyone around her.",
            "sent2": "The sun's rays felt like golden coals, filling him with renewed energy.",
            "sent3": "The coals of determination burned within him, driving him to achieve his goals.",
            "sent4": "His passion for the project was like a banked coal, ready to ignite into action.",
            "sent5": "The coals of inspiration fueled her creativity, leading to a masterpiece."
        }
    ]
}