{
    "term": "coaler",
    "meanings": [
        {
            "definition": "A person who works in a coal mine.",
            "pos": "noun",
            "sent1": "The coaler dug deep underground to extract coal.",
            "sent2": "The coaler used a pickaxe to mine coal from the earth.",
            "sent3": "The coaler told jokes to his fellow miners to lighten the mood.",
            "sent4": "The coaler's dedication to his work was as strong as the coal he mined.",
            "sent5": "In the dim tunnels, the coaler's silhouette was a symbol of hard labor."
        },
        {
            "definition": "A ship designed for carrying coal.",
            "pos": "noun",
            "sent1": "The coaler sailed across the ocean with a cargo of coal.",
            "sent2": "The coaler's hull was filled with tons of coal for transport.",
            "sent3": "The coaler ship had a cheerful red chimney that stood out at sea.",
            "sent4": "The coaler ship cut through the waves like a knife through butter.",
            "sent5": "The coaler ship's deck was black with coal dust, a testament to its purpose."
        },
        {
            "definition": "A machine used for loading coal.",
            "pos": "noun",
            "sent1": "The coaler efficiently loaded coal onto the train cars.",
            "sent2": "The coaler machine hummed as it transferred coal to the storage bins.",
            "sent3": "The coaler machine had a quirky habit of whistling while working.",
            "sent4": "The coaler machine's gears turned smoothly, like a well-oiled engine.",
            "sent5": "The coaler machine's conveyor belt moved coal with precision and speed."
        },
        {
            "definition": "A coal-fired power plant.",
            "pos": "noun",
            "sent1": "The coaler generated electricity for the town using coal.",
            "sent2": "The coaler's smokestack billowed with white smoke from burning coal.",
            "sent3": "The coaler plant had a mascot, a cartoon coal character named Coaly.",
            "sent4": "The coaler plant's turbines roared to life, fueled by coal's energy.",
            "sent5": "The coaler plant's glow at night was a beacon of power in the darkness."
        }
    ]
}