{
    "term": "coarseness",
    "meanings": [
        {
            "definition": "Rough or harsh in texture or appearance.",
            "pos": "adjective",
            "sent1": "The sandpaper had a coarseness that made it perfect for smoothing rough wood surfaces.",
            "sent2": "Her hands felt the coarseness of the burlap sack as she carried it over her shoulder.",
            "sent3": "The coarseness of the cat's tongue surprised the little girl as it licked her hand.",
            "sent4": "The coarseness of his words left a bitter taste in her mouth.",
            "sent5": "The coarseness of the wind against his face made him pull his scarf tighter."
        },
        {
            "definition": "Lacking refinement or delicacy; vulgar or crude behavior.",
            "pos": "adjective",
            "sent1": "His coarseness at the dinner table embarrassed his date with his loud chewing.",
            "sent2": "The comedian's jokes were often criticized for their coarseness and lack of subtlety.",
            "sent3": "Despite his coarseness, he had a heart of gold and always helped those in need.",
            "sent4": "The coarseness of his humor made some people uncomfortable, but others found it refreshing.",
            "sent5": "The coarseness of his manners was a stark contrast to the elegance of the event."
        },
        {
            "definition": "The quality of being rough or harsh in texture or appearance.",
            "pos": "noun",
            "sent1": "She couldn't stand the coarseness of the wool sweater against her skin.",
            "sent2": "The coarseness of the sandpaper made it ideal for smoothing out rough edges.",
            "sent3": "The coarseness of the gravel path made it difficult to walk in high heels.",
            "sent4": "The coarseness of the fabric irritated his sensitive skin.",
            "sent5": "The coarseness of the tree bark scratched his palm as he climbed higher."
        }
    ]
}