{
    "term": "coasting",
    "meanings": [
        {
            "definition": "To move easily without using power or effort.",
            "pos": "verb",
            "sent1": "The bicycle was coasting down the hill effortlessly.",
            "sent2": "The car was coasting along the highway smoothly.",
            "sent3": "The skateboarder was coasting so smoothly that it looked like magic.",
            "sent4": "She felt like she was coasting through life without any obstacles.",
            "sent5": "The boat was coasting on the calm waters, gliding peacefully."
        },
        {
            "definition": "To progress without making much effort.",
            "pos": "verb",
            "sent1": "He was coasting through the easy exam without any stress.",
            "sent2": "The team was coasting to victory with their strong lead.",
            "sent3": "The student was coasting through the assignment, not realizing the mistakes made.",
            "sent4": "The company was coasting towards success with their innovative ideas.",
            "sent5": "The bird was coasting effortlessly through the sky, enjoying the freedom."
        },
        {
            "definition": "To sail along without using power.",
            "pos": "verb",
            "sent1": "The sailboat was coasting gracefully on the calm sea.",
            "sent2": "The yacht was coasting smoothly with the wind in its sails.",
            "sent3": "The pirate ship was coasting towards the treasure island, ready for adventure.",
            "sent4": "The canoe was coasting silently through the peaceful lake.",
            "sent5": "The fishing boat was coasting slowly, waiting for the perfect catch."
        },
        {
            "definition": "To proceed easily without exertion.",
            "pos": "verb",
            "sent1": "After the hard work, she was coasting through the final presentation.",
            "sent2": "The athlete was coasting towards the finish line, confident in their lead.",
            "sent3": "The car was coasting smoothly on the empty road, enjoying the ride.",
            "sent4": "The project was coasting towards completion, with everything falling into place.",
            "sent5": "The skier was coasting down the slope, feeling the thrill of the speed."
        }
    ]
}