{
    "term": "cob",
    "meanings": [
        {
            "definition": "A rounded mass or lump, especially of coal or clay.",
            "pos": "noun",
            "sent1": "The miner found a heavy cob of coal in the mine.",
            "sent2": "She picked up a small cob of clay to mold into a sculpture.",
            "sent3": "The mischievous dog rolled the cob of coal down the hill.",
            "sent4": "The artist's hands shaped the cob of clay into a beautiful vase.",
            "sent5": "The cob of coal was so dense, it felt like a rock in his hand."
        },
        {
            "definition": "A male swan.",
            "pos": "noun",
            "sent1": "The cob gracefully glided across the pond with his mate.",
            "sent2": "The cob protected his cygnets from any potential threats.",
            "sent3": "The cob swan proudly showed off his elegant feathers.",
            "sent4": "The cob's majestic presence commanded respect from the other birds.",
            "sent5": "The cob's call echoed through the tranquil lake, signaling his territory."
        },
        {
            "definition": "A type of corn with large kernels grown for human consumption.",
            "pos": "noun",
            "sent1": "She roasted the golden cob of corn over the fire.",
            "sent2": "The farmer harvested the ripe cobs of corn from the field.",
            "sent3": "The children eagerly bit into the buttered cob of corn at the picnic.",
            "sent4": "The aroma of the freshly cooked cob of corn filled the kitchen.",
            "sent5": "The juicy kernels on the cob of corn burst with flavor in every bite."
        },
        {
            "definition": "A short-legged, thickset horse.",
            "pos": "noun",
            "sent1": "The cob trotted happily around the paddock with its rider.",
            "sent2": "The farmer used the sturdy cob to plow the fields.",
            "sent3": "The mischievous children giggled as they rode the cob around the farm.",
            "sent4": "The cob's strong legs carried it effortlessly through the rough terrain.",
            "sent5": "The cob's gentle nature made it a favorite among the stable hands."
        }
    ]
}