{
    "term": "cocains",
    "meanings": [
        {
            "definition": "A highly addictive stimulant drug derived from the coca plant.",
            "pos": "noun",
            "sent1": "Cocains can be very harmful to a person's health if used excessively.",
            "sent2": "The police found a stash of cocains hidden in the suspect's house.",
            "sent3": "The comedian joked about a squirrel addicted to cocains, causing laughter in the audience.",
            "sent4": "The allure of cocains can be as dangerous as a siren's song, leading many astray.",
            "sent5": "The news report highlighted the devastating effects of cocains on individuals and families."
        },
        {
            "definition": "To treat with or use cocaine.",
            "pos": "verb",
            "sent1": "The doctor decided to cocains the patient's severe pain to provide relief.",
            "sent2": "Some people cocains themselves to escape from reality temporarily.",
            "sent3": "The chef decided to cocains the dish with a sprinkle of exotic spices for added flavor.",
            "sent4": "She cocainsed her worries away, losing herself in the music's rhythm.",
            "sent5": "The athlete cocainsed before the race to enhance performance, unaware of the risks involved."
        },
        {
            "definition": "A white crystalline powder used as a narcotic.",
            "pos": "noun",
            "sent1": "The authorities seized a large shipment of cocains hidden in a cargo container.",
            "sent2": "The addict craved the euphoric effects of cocains to escape reality.",
            "sent3": "The magician pulled a rabbit out of his hat, but it turned out to be cocains instead.",
            "sent4": "The cocains sparkled like freshly fallen snow, enticing those seeking escape.",
            "sent5": "The undercover agent infiltrated the drug cartel to disrupt the distribution of cocains."
        }
    ]
}