{
    "term": "cockering",
    "meanings": [
        {
            "definition": "To pamper or indulge",
            "pos": "verb",
            "sent1": "She enjoys cockering her pet dog with treats and belly rubs.",
            "sent2": "Parents often find joy in cockering their children with love and affection.",
            "sent3": "The cat felt cockered when it was served a gourmet meal on a silver platter.",
            "sent4": "The wealthy heiress was cockered by her servants, fulfilling her every whim.",
            "sent5": "The spa's luxurious treatments were designed to cocker guests and make them feel special."
        },
        {
            "definition": "To treat with excessive care or attention",
            "pos": "verb",
            "sent1": "The fragile antique vase was cockered by the museum staff to prevent any damage.",
            "sent2": "Some people cocker their plants by talking to them daily and playing music for them.",
            "sent3": "The chef cockered the dish, adding a sprinkle of gold dust for a touch of extravagance.",
            "sent4": "The elderly lady cockered her prized possessions, dusting them meticulously every day.",
            "sent5": "The royal family's pet was cockered with elaborate costumes and a personal chef."
        },
        {
            "definition": "To coddle or spoil",
            "pos": "verb",
            "sent1": "Grandparents often cocker their grandchildren with sweets and toys.",
            "sent2": "Some people believe it's important not to cocker pets too much to avoid behavioral issues.",
            "sent3": "The millionaire's son was cockered with expensive gifts and a lavish lifestyle.",
            "sent4": "The celebrity was cockered by fans who showered her with gifts and adoration.",
            "sent5": "The pampered cat was cockered with a custom-made bed and daily massages."
        },
        {
            "definition": "To dote on or fuss over",
            "pos": "verb",
            "sent1": "The grandmother cockers her grandchildren, always baking them their favorite treats.",
            "sent2": "Some people cocker their plants by talking to them daily and playing music for them.",
            "sent3": "The artist cockered over every detail of the painting, ensuring it was perfect.",
            "sent4": "The mother cockered her newborn baby, constantly checking on him throughout the night.",
            "sent5": "The teacher cockered the students, providing extra help and encouragement during exams."
        }
    ]
}