{
    "term": "cocklofts",
    "meanings": [
        {
            "definition": "The space between the rafters and the ceiling of a building.",
            "pos": "noun",
            "sent1": "The cocklofts in the old barn were filled with dust and cobwebs.",
            "sent2": "The carpenter climbed up to inspect the cocklofts for any signs of leaks.",
            "sent3": "As the cat chased a mouse, it ended up stuck in the cocklofts, trying to find a way out.",
            "sent4": "Her thoughts soared high like birds nesting in the cocklofts of her mind.",
            "sent5": "The sunlight streaming through the cocklofts illuminated the hidden corners of the attic."
        },
        {
            "definition": "The uppermost part of a building, especially one with a steep roof.",
            "pos": "noun",
            "sent1": "The birds perched on the cocklofts of the church, singing their morning songs.",
            "sent2": "The snow gathered on the cocklofts of the mountain cabins during the winter.",
            "sent3": "The mischievous children claimed the cocklofts of the school as their secret hideout.",
            "sent4": "His dreams reached the cocklofts of ambition, aiming for the highest goals.",
            "sent5": "The flag fluttered proudly from the cocklofts of the castle, announcing victory."
        },
        {
            "definition": "A small loft or attic space in a building.",
            "pos": "noun",
            "sent1": "The cozy cocklofts in the cottage were perfect for stargazing at night.",
            "sent2": "She stored her old books and trinkets in the cocklofts above the garage.",
            "sent3": "The cat napped peacefully in the warm cocklofts, away from the hustle below.",
            "sent4": "His memories were hidden in the dusty cocklofts of his mind, waiting to be explored.",
            "sent5": "The mysterious sound seemed to come from the dark cocklofts, sending shivers down her spine."
        }
    ]
}