{
    "term": "cock",
    "meanings": [
        {
            "definition": "A male bird, especially a rooster.",
            "pos": "noun",
            "sent1": "The colorful cock crowed loudly at dawn.",
            "sent2": "The farmer raised several cocks on his farm.",
            "sent3": "The cock strutted around the henhouse like he owned the place.",
            "sent4": "The cock's vibrant feathers shimmered in the sunlight.",
            "sent5": "The cock's crow signaled the start of a new day."
        },
        {
            "definition": "A faucet or valve for controlling the flow of liquid.",
            "pos": "noun",
            "sent1": "Please turn the cock to stop the water flow.",
            "sent2": "The plumber fixed the leaky cock in the bathroom.",
            "sent3": "The cock in the kitchen sink decided to leak at the worst possible time.",
            "sent4": "She turned the cock tightly to prevent any more water from dripping.",
            "sent5": "The old cock in the garden needed to be replaced to stop the leak."
        },
        {
            "definition": "To tilt or turn up in a jaunty manner.",
            "pos": "verb",
            "sent1": "He would cock his hat to the side before heading out.",
            "sent2": "She cocked her head to the side in curiosity.",
            "sent3": "The cat would cock its head when hearing a strange noise.",
            "sent4": "The detective cocked an eyebrow in suspicion.",
            "sent5": "The cowboy would cock his gun before entering a duel."
        },
        {
            "definition": "A male bird, especially a rooster.",
            "pos": "noun",
            "sent1": "The cock crowed to wake everyone up on the farm.",
            "sent2": "The colorful cock strutted proudly in the yard.",
            "sent3": "The cock's crow could be heard throughout the countryside.",
            "sent4": "The cock's feathers glistened in the morning sun.",
            "sent5": "The cock's call echoed across the fields."
        },
        {
            "definition": "A faucet or valve for controlling the flow of liquid.",
            "pos": "noun",
            "sent1": "The plumber tightened the cock to stop the dripping.",
            "sent2": "She turned the cock to increase the water pressure.",
            "sent3": "The old cock in the shower needed to be replaced.",
            "sent4": "The cock in the garden hose was difficult to turn.",
            "sent5": "The cock in the kitchen sink was leaking again."
        }
    ]
}