{
    "term": "cockshies",
    "meanings": [
        {
            "definition": "A game in which stones or other missiles are thrown at a target.",
            "pos": "noun",
            "sent1": "During the fair, children enjoyed playing cockshies by aiming stones at a wooden target.",
            "sent2": "The boys set up a makeshift cockshies game in the backyard and took turns throwing pebbles at a tree stump.",
            "sent3": "At the carnival, the clown volunteered to be the target for the cockshies game, wearing a funny hat for protection.",
            "sent4": "In medieval times, knights would practice their aim by participating in cockshies, honing their skills for battle.",
            "sent5": "The sound of stones hitting the target echoed through the field during the intense cockshies competition."
        },
        {
            "definition": "To throw stones or other missiles at a target.",
            "pos": "verb",
            "sent1": "The mischievous kids would cockshies apples at the scarecrow in the farmer's field.",
            "sent2": "She carefully cockshies small pebbles at the cans lined up on the fence, trying to knock them down.",
            "sent3": "During the snowball fight, Tim decided to cockshies a snowball at his friend's backpack, causing a burst of laughter.",
            "sent4": "The protesters planned to cockshies eggs at the politician's car to show their disapproval.",
            "sent5": "As part of the training, the archers practiced cockshies arrows at the bullseye, aiming for perfect accuracy."
        },
        {
            "definition": "A target for stones or other missiles.",
            "pos": "noun",
            "sent1": "The scarecrow stood as a lonely cockshies in the middle of the cornfield, its arms outstretched.",
            "sent2": "The old tree near the river served as a natural cockshies for the kids who enjoyed skipping stones on the water.",
            "sent3": "The abandoned building became a popular cockshies for the neighborhood kids, who aimed at the broken windows.",
            "sent4": "The giant rock at the edge of the cliff became a challenging cockshies for the hikers testing their throwing skills.",
            "sent5": "The colorful target board was set up as the main cockshies for the archery competition, attracting participants from all around."
        }
    ]
}