{
    "term": "cocobolos",
    "meanings": [
        {
            "definition": "A type of tropical hardwood tree.",
            "pos": "noun",
            "sent1": "The cocobolos in the forest provide shade and shelter for many animals.",
            "sent2": "The explorer marveled at the tall cocobolos swaying gently in the breeze.",
            "sent3": "The mischievous monkey used the cocobolos as a hiding spot during the game of hide-and-seek.",
            "sent4": "The cocobolos stood strong like ancient guardians of the jungle.",
            "sent5": "The vibrant green leaves of the cocobolos rustled softly in the wind."
        },
        {
            "definition": "The hard, reddish-brown wood of the cocobolo tree.",
            "pos": "noun",
            "sent1": "Craftsmen carved intricate designs into the cocobolos to create beautiful sculptures.",
            "sent2": "The cabinet was made from polished cocobolos, adding a touch of elegance to the room.",
            "sent3": "The musician tapped the cocobolos lightly, producing a melodic sound that enchanted the audience.",
            "sent4": "The cocobolos gleamed in the sunlight, revealing its rich, reddish-brown hues.",
            "sent5": "The sweet aroma of cocobolos filled the workshop as the carpenter worked on the new table."
        },
        {
            "definition": "A type of wood used for making furniture and musical instruments.",
            "pos": "noun",
            "sent1": "The skilled craftsman selected the finest cocobolos for crafting a grand piano.",
            "sent2": "The luxurious chair was upholstered with soft cushions and cocobolos armrests.",
            "sent3": "The orchestra conductor tapped the cocobolos baton against the music stand to signal the start of the performance.",
            "sent4": "The cocobolos resonated with a deep, rich tone when the musician played the guitar.",
            "sent5": "The intricate carvings on the cocobolos table showcased the artisan's talent and attention to detail."
        }
    ]
}