{
    "term": "coco",
    "meanings": [
        {
            "definition": "Coconut",
            "pos": "noun",
            "sent1": "I love the taste of coco in my smoothie.",
            "sent2": "She bought a fresh coco from the market.",
            "sent3": "The coco rolled off the table and onto the floor.",
            "sent4": "The coco's hard shell protects the delicious fruit inside.",
            "sent5": "The scent of ripe coco filled the kitchen."
        },
        {
            "definition": "A tropical palm tree",
            "pos": "noun",
            "sent1": "The coco swayed gently in the warm breeze.",
            "sent2": "We rested under the shade of a tall coco.",
            "sent3": "The monkeys played in the branches of the coco.",
            "sent4": "The coco's leaves rustled in the wind like whispers.",
            "sent5": "The coconuts on the coco tree were ripe and ready to be picked."
        },
        {
            "definition": "A type of bird",
            "pos": "noun",
            "sent1": "The colorful coco chirped happily in the morning.",
            "sent2": "I spotted a beautiful coco perched on the branch.",
            "sent3": "The mischievous cat tried to catch the coco.",
            "sent4": "The coco soared high in the sky with grace.",
            "sent5": "The coco's song filled the forest with melody."
        },
        {
            "definition": "A type of color",
            "pos": "noun",
            "sent1": "She painted her room in a lovely coco shade.",
            "sent2": "The artist mixed green and white to create a soft coco hue.",
            "sent3": "The walls glowed in the warm coco color.",
            "sent4": "Her dress was a beautiful blend of coco and cream.",
            "sent5": "The sunset painted the sky in vibrant coco tones."
        },
        {
            "definition": "A type of fabric",
            "pos": "noun",
            "sent1": "She sewed a dress using a delicate coco material.",
            "sent2": "The curtains were made of a light and airy coco fabric.",
            "sent3": "The coco cloth felt smooth against her skin.",
            "sent4": "The coco fabric draped elegantly over the furniture.",
            "sent5": "The coco fabric shimmered in the sunlight."
        }
    ]
}