{
    "term": "cod",
    "meanings": [
        {
            "definition": "A large marine fish found in the North Atlantic",
            "pos": "noun",
            "sent1": "The cod swam gracefully in the ocean.",
            "sent2": "Fishermen caught a cod for dinner.",
            "sent3": "Why did the cod refuse to share its seaweed? It was a selfish fish!",
            "sent4": "The cod was a king of the sea, ruling over its underwater kingdom.",
            "sent5": "The silver scales of the cod shimmered under the sunlight."
        },
        {
            "definition": "To deceive or trick someone",
            "pos": "verb",
            "sent1": "She tried to cod her friend into believing a tall tale.",
            "sent2": "He decided to cod his brother by hiding his favorite toy.",
            "sent3": "The magician used sleight of hand to cod the audience into thinking the coin disappeared.",
            "sent4": "Her sweet words were meant to cod him into buying the unnecessary gadget.",
            "sent5": "The scammer's promises were designed to cod unsuspecting victims."
        },
        {
            "definition": "A bag or sack for holding things, especially fish",
            "pos": "noun",
            "sent1": "The fisherman carried his catch in a sturdy cod.",
            "sent2": "She packed the fresh cod with ice to keep it cold.",
            "sent3": "The cod was so full of fish that it almost burst at the seams!",
            "sent4": "The cod's handle broke under the weight of the heavy fish.",
            "sent5": "The salty smell of the sea lingered on the old cod."
        },
        {
            "definition": "A joke or prank",
            "pos": "noun",
            "sent1": "The children played a funny cod on their teacher.",
            "sent2": "She couldn't help but laugh at the clever cod her friend pulled.",
            "sent3": "The cod about the talking fish had everyone in stitches.",
            "sent4": "His cod about the flying pig was so absurd, it became legendary.",
            "sent5": "The cod at the party made everyone burst into laughter."
        }
    ]
}