{
    "term": "codders",
    "meanings": [
        {
            "definition": "A person who tells jokes or amusing stories.",
            "pos": "noun",
            "sent1": "The codders at the party had everyone laughing with their funny tales.",
            "sent2": "The stand-up comedian was known as the best codders in town.",
            "sent3": "The codders decided to have a joke-telling contest to see who could make the others laugh the most.",
            "sent4": "Her grandpa was a true codders, always ready with a witty remark to brighten everyone's day.",
            "sent5": "The codders' performance was so entertaining that the audience couldn't stop smiling."
        },
        {
            "definition": "A group of people who engage in playful or mischievous behavior.",
            "pos": "noun",
            "sent1": "The codders in the park were playing pranks on each other and giggling.",
            "sent2": "The codders in the neighborhood were known for their mischievous antics.",
            "sent3": "The codders decided to have a water balloon fight to add some fun to their day.",
            "sent4": "The codders' laughter echoed through the halls as they plotted their next playful scheme.",
            "sent5": "The codders' mischief always kept things interesting in the small town."
        },
        {
            "definition": "To engage in playful banter or teasing.",
            "pos": "verb",
            "sent1": "They would codders each other during lunch, trying to come up with the wittiest remarks.",
            "sent2": "Friends often codders as a way to show affection and bond with each other.",
            "sent3": "The siblings would codders back and forth, each trying to outdo the other with clever comebacks.",
            "sent4": "As they codders, their laughter filled the room, creating a light-hearted atmosphere.",
            "sent5": "The classmates would codders playfully, making the school days more enjoyable."
        }
    ]
}