{
    "term": "codependence",
    "meanings": [
        {
            "definition": "Excessive emotional or psychological reliance on a partner, typically one who requires support due to an addiction or illness.",
            "pos": "noun",
            "sent1": "Her codependence on her husband's approval was evident in every decision she made.",
            "sent2": "Their codependence was so strong that they couldn't imagine life without each other.",
            "sent3": "The codependence between the cat and the mouse was comical, as they pretended to be enemies but secretly enjoyed each other's company.",
            "sent4": "The codependence between the two rival gangs was like a tangled web, each side needing the other to maintain their power.",
            "sent5": "The codependence between the flower and the bee was essential for both of their survival."
        },
        {
            "definition": "A dysfunctional relationship pattern where one person enables another's unhealthy behavior.",
            "pos": "noun",
            "sent1": "Their codependence led to a cycle of enabling and destructive behavior.",
            "sent2": "Breaking free from codependence was the first step towards a healthier relationship.",
            "sent3": "The codependence between the clown and the acrobat was amusing, as they constantly enabled each other's silly antics.",
            "sent4": "The codependence between the teacher and the student was like a dance, each step enabling the other to grow and learn.",
            "sent5": "The codependence between the chef and the waiter was crucial for the smooth running of the restaurant."
        },
        {
            "definition": "The state of being mutually reliant on each other in an unhealthy or enabling way.",
            "pos": "noun",
            "sent1": "Their codependence created a toxic cycle of need and enablement.",
            "sent2": "The siblings' codependence was so strong that they struggled to function independently.",
            "sent3": "The codependence between the tree and the vine was amusing, as they relied on each other for support and growth.",
            "sent4": "The codependence between the sun and the moon was like a delicate balance, each dependent on the other for the cycle of day and night.",
            "sent5": "The codependence between the writer and the editor was essential for producing quality work."
        }
    ]
}