{
    "term": "codependency",
    "meanings": [
        {
            "definition": "Excessive emotional or psychological reliance on a partner, typically one who requires support due to an addiction or illness.",
            "pos": "noun",
            "sent1": "Her codependency on her husband made it difficult for her to make decisions on her own.",
            "sent2": "Their codependency was evident in how they always relied on each other for emotional support.",
            "sent3": "In their codependency, they were like two puzzle pieces that couldn't function without each other.",
            "sent4": "The codependency between them was like a tangled web of emotions that neither could escape.",
            "sent5": "The codependency was suffocating, like a heavy weight on their shoulders."
        },
        {
            "definition": "A dysfunctional relationship pattern where one person enables another's unhealthy behavior.",
            "pos": "noun",
            "sent1": "The codependency between the siblings led to enabling destructive habits.",
            "sent2": "Codependency often involves one person unknowingly supporting the other's harmful actions.",
            "sent3": "Their codependency was like a dance where one led the other down a destructive path.",
            "sent4": "The codependency was a vicious cycle of enabling and dependence.",
            "sent5": "Their codependency was like a sinking ship, pulling them both under."
        },
        {
            "definition": "A psychological condition where individuals prioritize the needs of others over their own well-being.",
            "pos": "noun",
            "sent1": "Her codependency led her to neglect her own needs in favor of others.",
            "sent2": "Codependency can result in individuals sacrificing their own happiness for the sake of others.",
            "sent3": "In their codependency, they were like selfless martyrs putting others before themselves.",
            "sent4": "The codependency was a silent thief stealing their own joy for the benefit of others.",
            "sent5": "The codependency was like a shadow, always following them and overshadowing their own desires."
        }
    ]
}