{
    "term": "codependences",
    "meanings": [
        {
            "definition": "The condition of being mutually reliant on each other, especially in a dysfunctional or unhealthy way.",
            "pos": "noun",
            "sent1": "Their codependences led to a cycle of unhealthy behaviors.",
            "sent2": "The siblings' codependences made it difficult for them to make decisions independently.",
            "sent3": "In a strange twist of fate, their codependences became the root of their problems.",
            "sent4": "The codependences between the two friends were like tangled vines, suffocating their individuality.",
            "sent5": "The codependences in their relationship were like chains, binding them together in a toxic bond."
        },
        {
            "definition": "A relationship in which one person enables another person's addiction, poor mental health, or other negative behavior.",
            "pos": "noun",
            "sent1": "Her codependences with him only fueled his destructive habits.",
            "sent2": "The codependences between the two roommates worsened their already troubled situation.",
            "sent3": "Their codependences were like a twisted dance of enabling and self-destruction.",
            "sent4": "The codependences in their partnership were like a dark shadow, following them wherever they went.",
            "sent5": "The codependences in their dynamic were like a poisonous well, contaminating everything around them."
        },
        {
            "definition": "The state of being excessively emotionally or psychologically dependent on another person.",
            "pos": "noun",
            "sent1": "His codependences made him feel lost without her constant presence.",
            "sent2": "The codependences she felt towards him clouded her judgment and sense of self.",
            "sent3": "Their codependences were like a heavy burden, weighing them down in every interaction.",
            "sent4": "The codependences in their bond were like a thick fog, obscuring their individual identities.",
            "sent5": "The codependences in their relationship were like a deep pit, trapping them in a cycle of emotional neediness."
        }
    ]
}