{
    "term": "coelacanths",
    "meanings": [
        {
            "definition": "Coelacanths: A type of fish that was thought to be extinct but was rediscovered in the 20th century.",
            "pos": "noun",
            "sent1": "The coelacanths are ancient fish that have been around for millions of years.",
            "sent2": "Scientists were amazed to find coelacanths alive and well in the ocean.",
            "sent3": "The aquarium had a tank full of coelacanths, and they all seemed to be chatting with each other.",
            "sent4": "In the dark depths of the sea, the coelacanths swam gracefully like ancient guardians.",
            "sent5": "The coelacanths moved slowly, their fins gliding through the water with ease."
        },
        {
            "definition": "Coelacanths: Plural form of coelacanth, a type of fish.",
            "pos": "noun",
            "sent1": "Many coelacanths were spotted swimming together near the coral reef.",
            "sent2": "The divers were excited to see a school of coelacanths in the deep sea.",
            "sent3": "At the fish market, the coelacanths were having a party to celebrate their uniqueness.",
            "sent4": "The coelacanths moved in unison, creating a mesmerizing dance in the water.",
            "sent5": "The coelacanths' scales shimmered under the sunlight, creating a beautiful sight."
        },
        {
            "definition": "Coelacanths: The coelacanth is a rare fish that lives in deep waters.",
            "pos": "noun",
            "sent1": "A group of scientists embarked on a mission to study the coelacanths in their natural habitat.",
            "sent2": "The documentary crew captured stunning footage of the coelacanths swimming gracefully.",
            "sent3": "The coelacanths threw a surprise party for the other deep-sea creatures.",
            "sent4": "In the mysterious depths, the coelacanths glowed like hidden treasures waiting to be discovered.",
            "sent5": "The coelacanths' unique features make them stand out among other marine species."
        }
    ]
}