{
    "term": "coelostats",
    "meanings": [
        {
            "definition": "Coelostats: devices used in astronomy to track the motion of celestial objects",
            "pos": "noun",
            "sent1": "The coelostats in the observatory help astronomers follow the stars' paths.",
            "sent2": "Astronomers rely on coelostats to monitor the movement of planets and stars.",
            "sent3": "The mischievous alien thought the coelostats were toys for tracking shooting stars.",
            "sent4": "Her eyes were like coelostats, always fixed on the twinkling night sky.",
            "sent5": "The intricate coelostats painted a picture of the universe's dance above."
        },
        {
            "definition": "Coelostats: a type of instrument that reflects light in a fixed direction",
            "pos": "noun",
            "sent1": "The coelostats in the lab redirected sunlight towards the solar panels.",
            "sent2": "The coelostats efficiently directed the light towards the experiment setup.",
            "sent3": "The misaligned coelostats caused the light to bounce around like a pinball.",
            "sent4": "Her smile was a coelostat, always shining brightly in one direction.",
            "sent5": "The polished coelostats mirrored the sun's rays with precision and grace."
        },
        {
            "definition": "Coelostats: a mechanism used to keep a telescope pointed at a specific area of the sky",
            "pos": "noun",
            "sent1": "The coelostats adjusted the telescope to focus on the distant galaxy.",
            "sent2": "With the help of coelostats, the telescope remained fixed on the constellation.",
            "sent3": "The playful squirrel mistook the coelostats for a game of hide-and-seek.",
            "sent4": "His determination was a coelostat, always aiming towards his dreams.",
            "sent5": "The reliable coelostats ensured the telescope never lost sight of the moon."
        }
    ]
}