{
    "term": "cofferdam",
    "meanings": [
        {
            "definition": "A temporary watertight enclosure constructed to allow construction work below the waterline.",
            "pos": "noun",
            "sent1": "The workers built a cofferdam to keep the water out while they repaired the ship.",
            "sent2": "The cofferdam was essential for the workers to fix the bridge's foundation underwater.",
            "sent3": "The cofferdam looked like a giant bathtub surrounding the construction area.",
            "sent4": "The cofferdam stood strong like a fortress against the rushing water.",
            "sent5": "The cofferdam resembled a massive shield protecting the workers from the sea."
        },
        {
            "definition": "A structure used to divert water from a construction site.",
            "pos": "noun",
            "sent1": "The cofferdam redirected the river water away from the building project.",
            "sent2": "Builders relied on the cofferdam to keep the construction area dry.",
            "sent3": "The cofferdam seemed like a clever way to trick the water into flowing elsewhere.",
            "sent4": "The cofferdam acted as a clever magician, making the water disappear from the site.",
            "sent5": "The cofferdam functioned like a skilled engineer, guiding the water away from the project."
        },
        {
            "definition": "A barrier used to contain or control water flow.",
            "pos": "noun",
            "sent1": "The cofferdam prevented the flood from spreading further into the town.",
            "sent2": "Farmers installed a cofferdam to manage the irrigation water in the field.",
            "sent3": "The cofferdam seemed like a strict lifeguard, keeping the water in its place.",
            "sent4": "The cofferdam acted as a firm gatekeeper, regulating the flow of the river.",
            "sent5": "The cofferdam functioned like a sturdy dam, holding back the water with ease."
        }
    ]
}