{
    "term": "cogue",
    "meanings": [
        {
            "definition": "A small boat",
            "pos": "noun",
            "sent1": "The fishermen rowed the cogue gently on the calm lake.",
            "sent2": "We rented a cogue to explore the river during our vacation.",
            "sent3": "The cogue bobbed up and down like a playful duck in the water.",
            "sent4": "The cogue was a trusty companion, carrying them safely across the river.",
            "sent5": "The colorful cogue sparkled in the sunlight, a tiny gem on the water."
        },
        {
            "definition": "To deceive or trick",
            "pos": "verb",
            "sent1": "He tried to cogue his friends into believing his tall tale.",
            "sent2": "She didn't want to cogue anyone, so she always told the truth.",
            "sent3": "The magician's trick was to cogue the audience with his disappearing act.",
            "sent4": "Her smile cogueed him into thinking everything was fine.",
            "sent5": "The sly fox tried to cogue the rabbit out of its burrow."
        },
        {
            "definition": "A wooden block used in metalworking",
            "pos": "noun",
            "sent1": "The blacksmith hammered the red-hot metal onto the cogue.",
            "sent2": "The apprentice carefully shaped the metal around the cogue.",
            "sent3": "The cogue rolled off the table and startled the blacksmith.",
            "sent4": "The cogue held the metal firmly in place, aiding in the crafting process.",
            "sent5": "The old cogue had seen many years of hard work in the forge."
        },
        {
            "definition": "A type of fishing net",
            "pos": "noun",
            "sent1": "The fishermen cast the cogue into the water to catch fish.",
            "sent2": "The cogue was woven with care to ensure a good catch.",
            "sent3": "The cogue tangled with seaweed, making it difficult to retrieve.",
            "sent4": "The cogue glistened in the sun as it lay ready for the next fishing trip.",
            "sent5": "The intricate design of the cogue made it efficient in catching fish."
        },
        {
            "definition": "A type of medieval helmet",
            "pos": "noun",
            "sent1": "The knight donned his cogue before heading into battle.",
            "sent2": "The cogue protected his head during the fierce jousting match.",
            "sent3": "The shiny cogue reflected the knight's determined expression.",
            "sent4": "The cogue gleamed under the torchlight, a symbol of strength and honor.",
            "sent5": "The intricate engravings on the cogue told tales of past victories."
        }
    ]
}