{
    "term": "coilabilities",
    "meanings": [
        {
            "definition": "The ability to be coiled or wound into a spiral shape.",
            "pos": "noun",
            "sent1": "The coilabilities of the spring allow it to bounce back when compressed.",
            "sent2": "The metal wire's coilabilities make it perfect for creating springs.",
            "sent3": "The snake's coilabilities were put to the test when it wrapped around the tree branch for a nap.",
            "sent4": "Her hair's coilabilities resembled a spring, bouncing with every step she took.",
            "sent5": "The coilabilities of the slinky toy fascinated the children as it moved down the stairs."
        },
        {
            "definition": "The potential for something to be twisted or turned into a coil.",
            "pos": "noun",
            "sent1": "The rope's coilabilities made it easy to store neatly in a small bag.",
            "sent2": "The wire's coilabilities allowed it to be shaped into intricate designs.",
            "sent3": "The garden hose's coilabilities led to a tangled mess after the kids played with it.",
            "sent4": "The dancer's ribbon displayed impressive coilabilities as it twirled in the air.",
            "sent5": "The coilabilities of the phone cord made it prone to tangling if not handled carefully."
        },
        {
            "definition": "The quality of being able to coil or wrap around something.",
            "pos": "noun",
            "sent1": "The vine's coilabilities helped it climb up the trellis effortlessly.",
            "sent2": "The cable tie's coilabilities made it convenient for organizing cables.",
            "sent3": "The scarf's coilabilities caused it to wrap around the fan blades, creating a funny sight.",
            "sent4": "The octopus's tentacles showed remarkable coilabilities as they wrapped around the coral.",
            "sent5": "The snake's coilabilities allowed it to coil around its prey with precision and speed."
        }
    ]
}