{
    "term": "cointerring",
    "meanings": [
        {
            "definition": "To counteract or oppose",
            "pos": "verb",
            "sent1": "She was cointerring the negative effects of the medicine with a healthier lifestyle.",
            "sent2": "The superhero cointerred the villain's evil plans with his own sense of justice.",
            "sent3": "The cat was cointerring the dog's attempts to steal its food by cleverly hiding it in a secret spot.",
            "sent4": "The bright sunlight cointerred the darkness of the night, bringing a new day.",
            "sent5": "The determined student was cointerring all distractions to focus on acing the exam."
        },
        {
            "definition": "To prevent or hinder",
            "pos": "verb",
            "sent1": "The locked gate cointerred any unauthorized entry into the restricted area.",
            "sent2": "The firewall cointerred any attempts to access the confidential files without permission.",
            "sent3": "The mischievous squirrel was cointerring the bird's efforts to reach the bird feeder by chasing it away.",
            "sent4": "The heavy rain cointerred the progress of the construction workers, causing delays.",
            "sent5": "The strong password cointerred any hacking attempts, keeping the data secure."
        },
        {
            "definition": "To resist or obstruct",
            "pos": "verb",
            "sent1": "The protesters were cointerring the construction of the new highway through their neighborhood.",
            "sent2": "The dam was cointerring the flow of the river, creating a reservoir.",
            "sent3": "The tangled vines were cointerring the hiker's path through the dense forest.",
            "sent4": "The stubborn stain was cointerring all efforts to remove it from the fabric.",
            "sent5": "The massive boulder was cointerring the progress of the climbers, blocking their way up the mountain."
        }
    ]
}