{
    "term": "cokes",
    "meanings": [
        {
            "definition": "To persuade or urge someone to do something",
            "pos": "verb",
            "sent1": "She cokes her friends to join the study group.",
            "sent2": "The coach cokes the team to give their best effort.",
            "sent3": "He cokes his cat to play with a toy mouse.",
            "sent4": "The motivational speaker cokes the audience to reach for their dreams.",
            "sent5": "The teacher cokes the students to participate actively in class."
        },
        {
            "definition": "A solid fuel made by heating coal in the absence of air",
            "pos": "noun",
            "sent1": "The factory uses cokes to power its machinery.",
            "sent2": "Cokes are essential for heating homes in the winter.",
            "sent3": "The miners loaded the cokes onto the train for transport.",
            "sent4": "The blacksmith used cokes to forge the metal into shape.",
            "sent5": "The furnace burned brightly with the help of cokes."
        },
        {
            "definition": "A sweet carbonated soft drink",
            "pos": "noun",
            "sent1": "She enjoys sipping cokes on a hot summer day.",
            "sent2": "Cokes are popular at parties and gatherings.",
            "sent3": "The vending machine was filled with refreshing cokes.",
            "sent4": "He grabbed a cold can of cokes from the fridge.",
            "sent5": "The bubbles in cokes tickle her nose as she drinks."
        },
        {
            "definition": "To treat with cokes",
            "pos": "verb",
            "sent1": "The chef cokes the meat to enhance its flavor.",
            "sent2": "They decided to coke the vegetables for a unique taste.",
            "sent3": "She cokes the salad with a special dressing.",
            "sent4": "The recipe calls for coking the chicken before grilling.",
            "sent5": "He loves to coke his favorite dish for dinner."
        }
    ]
}