{
    "term": "coking",
    "meanings": [
        {
            "definition": "The process of converting coal into coke.",
            "pos": "noun",
            "sent1": "The coking of coal is essential for making coke in industries.",
            "sent2": "My dad explained the coking process to me while we watched the factory.",
            "sent3": "I tried coking coal at home, but it didn't turn into coke like in the factory.",
            "sent4": "The coking of coal in the factory was like a magical transformation into valuable coke.",
            "sent5": "The coking process turned the coal into a hard, useful material called coke."
        },
        {
            "definition": "The act of preparing food by dry heat in an oven or on a grill.",
            "pos": "noun",
            "sent1": "Mom's coking of the turkey for Thanksgiving always fills the house with a delicious smell.",
            "sent2": "I enjoy coking chicken on the grill during summer barbecues.",
            "sent3": "The coking of the cookies in the oven made the whole kitchen smell amazing.",
            "sent4": "The coking of the steak on the grill made it sizzle and smell irresistible.",
            "sent5": "The coking of the pizza in the oven made it crispy and cheesy."
        },
        {
            "definition": "The formation of a hard, black, carbonaceous residue from petroleum products.",
            "pos": "noun",
            "sent1": "The coking of the oil in the refinery led to the production of valuable byproducts.",
            "sent2": "The coking of the petroleum products created a black residue that needed to be cleaned.",
            "sent3": "The coking of the fuel in the engine caused a buildup of black residue.",
            "sent4": "The coking of the gasoline resulted in a hard, black substance that needed to be removed.",
            "sent5": "The coking of the oil produced a dark residue that was difficult to clean."
        }
    ]
}