{
    "term": "cold",
    "meanings": [
        {
            "definition": "Having a low temperature",
            "pos": "adjective",
            "sent1": "The ice cream was cold and refreshing on a hot day.",
            "sent2": "She wore a warm jacket to protect herself from the cold wind.",
            "sent3": "The cold popsicle melted quickly in the sun, making a sticky mess.",
            "sent4": "The cold metal bench felt like sitting on a block of ice.",
            "sent5": "The cold water from the fridge quenched his thirst instantly."
        },
        {
            "definition": "Lacking warmth or affection",
            "pos": "adjective",
            "sent1": "Her response was cold and distant, showing no emotion.",
            "sent2": "The old house had a cold atmosphere, making visitors feel unwelcome.",
            "sent3": "The cat gave a cold stare to the new puppy in the house.",
            "sent4": "His words were like a cold slap in the face, shocking everyone in the room.",
            "sent5": "The teacher's cold tone made the students nervous during the exam."
        },
        {
            "definition": "A common illness characterized by a runny nose and sore throat",
            "pos": "noun",
            "sent1": "She caught a cold after walking in the rain without an umbrella.",
            "sent2": "He stayed home from work to recover from a bad cold.",
            "sent3": "The cold spread quickly through the office, affecting many employees.",
            "sent4": "Having a cold made her voice sound hoarse and congested.",
            "sent5": "Drinking hot tea with honey helped soothe his cold symptoms."
        },
        {
            "definition": "A sensation of coldness",
            "pos": "noun",
            "sent1": "The sudden cold in the room made her shiver.",
            "sent2": "Walking outside in the rain, he felt the cold seeping into his bones.",
            "sent3": "The cold of the ice cream gave her brain freeze, making her laugh.",
            "sent4": "The cold of the winter morning made the trees look like they were covered in diamonds.",
            "sent5": "The cold of the ocean water took his breath away as he jumped in for a swim."
        }
    ]
}