{
    "term": "collectivization",
    "meanings": [
        {
            "definition": "The act of bringing together or organizing into a collective or communal system.",
            "pos": "noun",
            "sent1": "The collectivization of resources helped the community work together for a common goal.",
            "sent2": "The collectivization of ideas in the meeting led to a successful project.",
            "sent3": "The collectivization of toys in the playroom made it easier for everyone to share.",
            "sent4": "Her leadership style was like the collectivization of a beehive, with everyone working in harmony.",
            "sent5": "The collectivization of voices in the choir created a beautiful harmony."
        },
        {
            "definition": "The process of converting private property into collective or state ownership.",
            "pos": "noun",
            "sent1": "The collectivization of land was a major step towards equality in the country.",
            "sent2": "The collectivization of factories helped boost the economy.",
            "sent3": "The collectivization of the old building turned it into a community center.",
            "sent4": "The collectivization of ideas transformed the company into a collaborative environment.",
            "sent5": "The collectivization of responsibilities among the team members improved efficiency."
        },
        {
            "definition": "The policy of combining individual farms or enterprises into collective units.",
            "pos": "noun",
            "sent1": "The collectivization of farms increased productivity in the region.",
            "sent2": "The collectivization of businesses led to shared success among owners.",
            "sent3": "The collectivization of tasks in the office made teamwork essential.",
            "sent4": "The collectivization of efforts resulted in a stronger community bond.",
            "sent5": "The collectivization of skills among team members created a well-rounded workforce."
        }
    ]
}