{
    "term": "colluviums",
    "meanings": [
        {
            "definition": "Colluviums: Loose, unconsolidated material that has accumulated at the base of a slope.",
            "pos": "noun",
            "sent1": "After heavy rain, colluviums gathered at the foot of the hill.",
            "sent2": "The geologist studied the colluviums found near the mountain.",
            "sent3": "The colluviums seemed to enjoy sliding down the slope after the storm.",
            "sent4": "The colluviums resembled a soft blanket covering the ground.",
            "sent5": "Children played in the colluviums, feeling the loose material under their feet."
        },
        {
            "definition": "Colluviums: Sediment deposited by gravity-driven processes such as landslides or erosion.",
            "pos": "noun",
            "sent1": "The colluviums formed a natural barrier at the base of the cliff.",
            "sent2": "Erosion caused colluviums to accumulate near the riverbank.",
            "sent3": "The colluviums giggled as they slid down the slope, carried by gravity.",
            "sent4": "The colluviums acted like a sponge, absorbing the impact of the landslide.",
            "sent5": "The colluviums resembled a soft pillow supporting the hillside."
        },
        {
            "definition": "Colluviums: Material that has been transported downslope by gravity and deposited at the base of a slope.",
            "pos": "noun",
            "sent1": "Hikers had to be careful while walking on the colluviums to avoid slipping.",
            "sent2": "The colluviums at the bottom of the valley showed signs of recent movement.",
            "sent3": "The colluviums whispered to each other as they slowly moved downhill.",
            "sent4": "The colluviums acted like a conveyor belt, transporting debris to the base of the slope.",
            "sent5": "The colluviums resembled a moving carpet as they shifted with gravity."
        }
    ]
}