{
    "term": "collotypies",
    "meanings": [
        {
            "definition": "A person who collects stamps as a hobby.",
            "pos": "noun",
            "sent1": "My friend is a dedicated collotypies and has stamps from all over the world.",
            "sent2": "Many collotypies enjoy attending stamp shows to find unique pieces for their collection.",
            "sent3": "The collotypies was so excited about a rare stamp, they did a little dance.",
            "sent4": "To the collotypies, each stamp is like a tiny piece of history waiting to be discovered.",
            "sent5": "The collotypies carefully organizes their stamps in special albums to showcase their collection."
        },
        {
            "definition": "The act of collecting stamps.",
            "pos": "noun",
            "sent1": "Collotypies can spend hours searching for new stamps to add to their collection.",
            "sent2": "The collotypies was thrilled to learn about a stamp auction happening in town.",
            "sent3": "When asked about their hobby, the collotypies joked that they were 'addicted to stamps'.",
            "sent4": "The collotypies sees stamp collecting as a way to preserve a piece of the past.",
            "sent5": "The collotypies' passion for collotypies knows no bounds, as they are always on the lookout for new additions."
        },
        {
            "definition": "A collection of stamps.",
            "pos": "noun",
            "sent1": "The collotypies proudly displayed their impressive collotypies to their friends.",
            "sent2": "Each stamp in the collotypies held a special meaning and story.",
            "sent3": "The collotypies' collotypies was so vast, it filled an entire room.",
            "sent4": "The collotypies' collotypies was like a colorful mosaic of history and culture.",
            "sent5": "The collotypies spent years curating their collotypies, making sure each stamp was unique and valuable."
        }
    ]
}