{
    "term": "collimations",
    "meanings": [
        {
            "definition": "The act of aligning or adjusting in a straight line.",
            "pos": "noun",
            "sent1": "During the construction, the collimations of the walls were carefully checked to ensure they were perfectly straight.",
            "sent2": "The engineer used precise collimations to make sure the pipes were aligned correctly.",
            "sent3": "The collimations of the pencils on the desk made them look like soldiers standing in formation.",
            "sent4": "Her strict collimations in organizing the books on the shelf made it look like a perfectly ordered library.",
            "sent5": "The collimations of the stars in the night sky created a beautiful pattern."
        },
        {
            "definition": "The process of making something parallel or straight.",
            "pos": "noun",
            "sent1": "The carpenter's collimations ensured that the table legs were perfectly aligned.",
            "sent2": "The collimations of the road markings made driving safer for everyone.",
            "sent3": "The collimations of the trees in the forest made it look like a perfectly organized garden.",
            "sent4": "Her collimations in arranging the flowers in the vase made it look like a work of art.",
            "sent5": "The collimations of the buildings in the city skyline were impressive."
        },
        {
            "definition": "The act of focusing light or other electromagnetic waves into a parallel beam.",
            "pos": "noun",
            "sent1": "The scientist's collimations allowed the laser to produce a concentrated beam of light.",
            "sent2": "The collimations of the telescope helped astronomers observe distant galaxies.",
            "sent3": "The collimations of the flashlight beam made shadows look like mysterious shapes on the wall.",
            "sent4": "Her collimations in directing the spotlight made the stage performance captivating.",
            "sent5": "The collimations of the sunlight through the window created a bright line on the floor."
        }
    ]
}