{
    "term": "collars",
    "meanings": [
        {
            "definition": "A band of material worn around the neck.",
            "pos": "noun",
            "sent1": "She wore a beautiful necklace with a sparkling collar.",
            "sent2": "The dog's collar had his name and phone number on it.",
            "sent3": "The collar matched perfectly with her dress, making her look elegant.",
            "sent4": "The collar of the shirt stood out with its intricate lace design.",
            "sent5": "The collar felt snug but comfortable around his neck."
        },
        {
            "definition": "To seize or arrest.",
            "pos": "verb",
            "sent1": "The police officer collars the thief before he could escape.",
            "sent2": "He collars the suspect as soon as he steps out of the building.",
            "sent3": "The detective collars the criminal in a dramatic chase scene.",
            "sent4": "She collars the shoplifter just as he tries to leave the store.",
            "sent5": "The security guard collars the troublemaker swiftly and efficiently."
        },
        {
            "definition": "To restrain or control.",
            "pos": "verb",
            "sent1": "She collars her excitement when she sees the surprise party.",
            "sent2": "He collars his temper before it gets out of control.",
            "sent3": "The teacher collars the noisy students with a stern look.",
            "sent4": "He collars his fear and bravely faces the challenge.",
            "sent5": "She collars her laughter during the serious meeting."
        },
        {
            "definition": "To put a collar on an animal.",
            "pos": "verb",
            "sent1": "The farmer collars the sheep before letting them out to graze.",
            "sent2": "She collars the cat before it runs outside.",
            "sent3": "The vet collars the puppy with a colorful collar.",
            "sent4": "He collars the horse gently to make sure it fits properly.",
            "sent5": "She collars the parrot with a shiny new collar."
        }
    ]
}