{
    "term": "collaborative",
    "meanings": [
        {
            "definition": "Involving two or more people working together for a common goal.",
            "pos": "adjective",
            "sent1": "The students had a collaborative project where they all worked together to build a model volcano.",
            "sent2": "The team's collaborative effort resulted in a successful presentation.",
            "sent3": "The ants had a collaborative picnic, each bringing a different type of food to share.",
            "sent4": "Their collaborative spirit was like a symphony, each person playing a different instrument but creating beautiful music together.",
            "sent5": "The collaborative atmosphere in the office made everyone feel motivated and supported."
        },
        {
            "definition": "Characterized by cooperation and teamwork.",
            "pos": "adjective",
            "sent1": "The company's culture was collaborative, with everyone always willing to help each other out.",
            "sent2": "The sports team's success was due to their collaborative approach to training and playing.",
            "sent3": "The squirrels had a collaborative tree-climbing competition, cheering each other on as they raced to the top.",
            "sent4": "Their collaborative mindset was like a well-oiled machine, smoothly working together towards a common goal.",
            "sent5": "The collaborative nature of the project made it enjoyable and rewarding for everyone involved."
        },
        {
            "definition": "Able to work together effectively.",
            "pos": "adjective",
            "sent1": "The duo was highly collaborative, seamlessly coordinating their actions to achieve their mission.",
            "sent2": "The committee's collaborative decision-making process ensured that all voices were heard.",
            "sent3": "The penguins had a collaborative fishing expedition, taking turns diving into the water to catch fish.",
            "sent4": "Their collaborative skills were like a puzzle, each piece fitting perfectly to complete the picture.",
            "sent5": "The collaborative team tackled the project with enthusiasm and unity."
        }
    ]
}