{
    "term": "collimating",
    "meanings": [
        {
            "definition": "Aligning or adjusting (an optical or other instrument) so that its parts are in proper relation to each other",
            "pos": "verb",
            "sent1": "She spent hours collimating the telescope to make sure it would show clear images.",
            "sent2": "The mechanic had to collimate the car's headlights to ensure they were pointing in the right direction.",
            "sent3": "The scientist joked that collimating the microscope was like solving a puzzle.",
            "sent4": "He thought of collimating the camera as aligning puzzle pieces to create a perfect picture.",
            "sent5": "Collimating the laser beam was crucial for the experiment to work properly."
        },
        {
            "definition": "To make parallel or bring into line",
            "pos": "verb",
            "sent1": "The carpenter was collimating the edges of the wood to ensure they would fit together perfectly.",
            "sent2": "The teacher asked the students to collimate their desks in a straight row.",
            "sent3": "The chef humorously compared collimating the vegetables to lining up soldiers for battle.",
            "sent4": "She imagined collimating the books on the shelf as organizing an army in formation.",
            "sent5": "Collimating the fence posts made the garden look neat and tidy."
        },
        {
            "definition": "To make (light or particles) parallel by using a collimator",
            "pos": "verb",
            "sent1": "The scientist was collimating the light beams to create a focused laser.",
            "sent2": "The technician was collimating the particles to ensure accurate measurements.",
            "sent3": "The magician playfully said he was collimating the magic sparks for his next trick.",
            "sent4": "She described collimating the sunlight as gathering rays into a single beam.",
            "sent5": "Collimating the flashlight beam made it shine brightly in the dark room."
        }
    ]
}