{
    "term": "collusive",
    "meanings": [
        {
            "definition": "Secret agreement or cooperation for deceitful purposes.",
            "pos": "noun",
            "sent1": "The collusive between the two companies was discovered by the authorities.",
            "sent2": "The collusive between the students led to their success in the competition.",
            "sent3": "The collusive between the siblings to hide the surprise party was almost ruined by their laughter.",
            "sent4": "The collusive between the thieves was like a well-oiled machine, smoothly executing their plan.",
            "sent5": "The collusive between the characters in the mystery novel kept readers guessing until the very end."
        },
        {
            "definition": "Involving or characteristic of collusion.",
            "pos": "adjective",
            "sent1": "The collusive behavior of the two employees raised suspicions among their colleagues.",
            "sent2": "The collusive actions of the group were finally exposed by the investigation.",
            "sent3": "The collusive plot in the movie kept the audience on the edge of their seats.",
            "sent4": "The collusive atmosphere in the room made it clear that something shady was going on.",
            "sent5": "The collusive nature of the deal was evident from the very beginning."
        },
        {
            "definition": "Acting together in secret toward a fraudulent or illegal end.",
            "pos": "noun",
            "sent1": "The collusive of the criminals was uncovered by the detective.",
            "sent2": "The collusive of the group to manipulate the market was met with severe consequences.",
            "sent3": "The collusive of the kids to prank their teacher backfired hilariously.",
            "sent4": "The collusive of the politicians was like a web of lies waiting to be unraveled.",
            "sent5": "The collusive of the team to cheat in the game was eventually exposed by the referee."
        }
    ]
}