{
    "term": "collects",
    "meanings": [
        {
            "definition": "To bring or gather together in one place",
            "pos": "verb",
            "sent1": "She collects all her toys in a big box.",
            "sent2": "The teacher collects the homework from the students every morning.",
            "sent3": "The ants collect food for their queen in an organized manner.",
            "sent4": "The detective collects evidence to solve the mystery.",
            "sent5": "The farmer collects ripe fruits from the orchard."
        },
        {
            "definition": "To accumulate or amass",
            "pos": "verb",
            "sent1": "He collects coins from different countries.",
            "sent2": "Over time, dust collects on the shelves if not cleaned regularly.",
            "sent3": "The snowball collects more snow as it rolls down the hill.",
            "sent4": "She collects memories of her travels in a scrapbook.",
            "sent5": "The library collects a wide range of books for its readers."
        },
        {
            "definition": "To solicit or receive donations or contributions",
            "pos": "verb",
            "sent1": "The charity collects funds to help those in need.",
            "sent2": "During the fundraiser, volunteers collect donations from generous donors.",
            "sent3": "The team collects money for a good cause by selling homemade cookies.",
            "sent4": "The organization collects clothes for the homeless community.",
            "sent5": "The school collects supplies for students who cannot afford them."
        },
        {
            "definition": "A short prayer or petition in a religious service",
            "pos": "noun",
            "sent1": "The priest led the congregation in a collect before the sermon.",
            "sent2": "During the service, the choir sang hymns between the collects.",
            "sent3": "The collect at the end of the service brought a sense of peace to the attendees.",
            "sent4": "The collect included blessings for the sick and the suffering.",
            "sent5": "The nun recited the collect with reverence and devotion."
        }
    ]
}