{
    "term": "collect",
    "meanings": [
        {
            "definition": "To bring or gather together in one place",
            "pos": "verb",
            "sent1": "I will collect all the toys and put them in the box.",
            "sent2": "The teacher asked the students to collect their books before leaving.",
            "sent3": "The ants decided to collect all the food in the picnic basket for their feast.",
            "sent4": "The clouds seemed to collect above the mountain, ready to burst with rain.",
            "sent5": "She tried to collect her thoughts before giving her presentation."
        },
        {
            "definition": "To receive payment for",
            "pos": "verb",
            "sent1": "He will collect the money for the tickets at the entrance.",
            "sent2": "The cashier will collect the payment for the groceries at the checkout.",
            "sent3": "The young boy pretended to collect payment for his imaginary ice cream stand.",
            "sent4": "The singer's voice seemed to collect coins from the audience's applause.",
            "sent5": "The landlord will collect the rent at the beginning of each month."
        },
        {
            "definition": "To accumulate or amass",
            "pos": "verb",
            "sent1": "She likes to collect seashells during her beach trips.",
            "sent2": "Over the years, he managed to collect a vast collection of stamps.",
            "sent3": "The squirrel tried to collect as many acorns as possible before winter.",
            "sent4": "The library seemed to collect books of all genres on its shelves.",
            "sent5": "The artist would collect various colors of paint for her masterpiece."
        },
        {
            "definition": "To call for and take away",
            "pos": "verb",
            "sent1": "The courier will collect the package from your doorstep.",
            "sent2": "The garbage truck will collect the trash from the neighborhood.",
            "sent3": "The vacuum cleaner robot can collect dust from all corners of the room.",
            "sent4": "The police officer will collect the evidence from the crime scene.",
            "sent5": "The delivery person will collect the returned items from your house."
        },
        {
            "definition": "To gather or assemble for a specific purpose",
            "pos": "verb",
            "sent1": "The team will collect for a meeting to discuss the project.",
            "sent2": "The volunteers will collect at the park for the clean-up event.",
            "sent3": "The students will collect in the auditorium for the school assembly.",
            "sent4": "The family will collect at the dining table for dinner every evening.",
            "sent5": "The fans will collect at the stadium to cheer for their favorite team."
        }
    ]
}