{
    "term": "colonialize",
    "meanings": [
        {
            "definition": "To establish a colony in or on",
            "pos": "verb",
            "sent1": "The explorers decided to colonialize the new land they discovered.",
            "sent2": "Many countries in the past have tried to colonialize distant territories.",
            "sent3": "The idea to colonialize the uninhabited island seemed like a fun adventure.",
            "sent4": "Her dream was to colonialize the barren land and turn it into a thriving community.",
            "sent5": "The settlers worked hard to colonialize the wild frontier and build a new home."
        },
        {
            "definition": "To subject to colonial rule",
            "pos": "verb",
            "sent1": "The powerful empire sought to colonialize weaker nations for resources.",
            "sent2": "During the Age of Exploration, many indigenous peoples were colonialized by European powers.",
            "sent3": "The mischievous children pretended to colonialize their backyard and declare it a new country.",
            "sent4": "The oppressive regime aimed to colonialize the neighboring regions and expand its control.",
            "sent5": "The conquerors used force to colonialize the native tribes and impose their authority."
        },
        {
            "definition": "To make colonial in character",
            "pos": "verb",
            "sent1": "The architecture of the building was colonialized to reflect the historical period.",
            "sent2": "The influence of the colonial powers colonialized the local traditions and customs.",
            "sent3": "The fashion designer decided to colonialize the runway with vintage-inspired clothing.",
            "sent4": "The artist's work aimed to colonialize modern art with traditional techniques.",
            "sent5": "The restaurant's decor was colonialized to transport diners back in time to a bygone era."
        }
    ]
}