{
    "term": "colours",
    "meanings": [
        {
            "definition": "The property possessed by an object of producing different sensations on the eye as a result of the way it reflects or emits light.",
            "pos": "noun",
            "sent1": "The beautiful colours of the rainbow filled the sky after the rain.",
            "sent2": "She loved to paint with bright colours to make her artwork stand out.",
            "sent3": "The mischievous kitten played with the colours of the yarn, creating a mess.",
            "sent4": "His words painted a picture with vivid colours in her mind.",
            "sent5": "The garden was a burst of colours, with flowers of every hue imaginable."
        },
        {
            "definition": "A substance used to give something a particular color.",
            "pos": "noun",
            "sent1": "She mixed different colours of paint to create a unique shade for the walls.",
            "sent2": "The artist carefully selected the colours for his palette before starting the painting.",
            "sent3": "The chef added a pinch of colours to the dish to enhance its visual appeal.",
            "sent4": "The sunset painted the sky with warm colours as the day came to an end.",
            "sent5": "The tailor chose vibrant colours of fabric to make a striking dress for the fashion show."
        },
        {
            "definition": "The use of all colors, not just black, white, and gray, in a work of art or design.",
            "pos": "noun",
            "sent1": "Her abstract painting was a burst of colours that mesmerized the viewers.",
            "sent2": "The interior designer incorporated bold colours to create a lively atmosphere in the room.",
            "sent3": "The clown's outfit was a riot of colours that made everyone smile.",
            "sent4": "The music festival was a celebration of sounds and colours that filled the air.",
            "sent5": "The children's book was illustrated with vibrant colours to capture their imagination."
        }
    ]
}