{
    "term": "colonised",
    "meanings": [
        {
            "definition": "To establish a colony in (a place).",
            "pos": "verb",
            "sent1": "The explorers colonised the new land, building homes and farms.",
            "sent2": "Many European countries colonised various regions around the world in the past.",
            "sent3": "The ants colonised the picnic area, claiming all the crumbs for themselves.",
            "sent4": "Her love for gardening colonised every corner of her backyard, turning it into a lush paradise.",
            "sent5": "The idea of starting a new business colonised his mind, driving him to take action."
        },
        {
            "definition": "To settle in (a place) as a colony.",
            "pos": "verb",
            "sent1": "Families from different countries colonised the small island, creating a diverse community.",
            "sent2": "The early settlers colonised the harsh land, adapting to its challenges.",
            "sent3": "The group of friends jokingly decided to colonise the local park for their weekend hangout spot.",
            "sent4": "Her laughter colonised the room, filling it with joy and warmth.",
            "sent5": "The music festival colonised the town, bringing in crowds of excited attendees."
        },
        {
            "definition": "To subject (a place) to political control and exploit its resources.",
            "pos": "verb",
            "sent1": "The powerful empire colonised the neighboring lands, imposing its laws and taxes.",
            "sent2": "During the gold rush, many prospectors colonised the riverbanks in search of riches.",
            "sent3": "The squirrels seemed to have colonised the backyard, storing nuts in every nook and cranny.",
            "sent4": "His ambition colonised his actions, driving him to climb the corporate ladder.",
            "sent5": "The invasive species quickly colonised the forest, disrupting the ecosystem."
        }
    ]
}