{
    "term": "colportage",
    "meanings": [
        {
            "definition": "The distribution of religious literature by traveling salespeople.",
            "pos": "noun",
            "sent1": "The colportage of religious pamphlets helped spread the message to remote areas.",
            "sent2": "She earned a living through colportage, going from house to house selling religious books.",
            "sent3": "The colportage of holy texts was so successful that even the squirrels in the park wanted to buy some.",
            "sent4": "His colportage of faith was like a river flowing through the town, touching every heart it passed.",
            "sent5": "The image of colportage under the starry sky stayed with her, a reminder of the power of spreading knowledge."
        },
        {
            "definition": "The act of selling or distributing books or religious materials door-to-door.",
            "pos": "noun",
            "sent1": "Every Saturday, she embarked on her colportage journey, knocking on doors with a smile.",
            "sent2": "Colportage was a common sight in the neighborhood, with vendors offering religious books and pamphlets.",
            "sent3": "The colportage competition between friends turned into a friendly race to see who could sell the most.",
            "sent4": "His colportage of books was like a gentle tap on the door of knowledge, inviting people to explore.",
            "sent5": "The sound of footsteps approaching for colportage made her heart race with anticipation of new stories to discover."
        },
        {
            "definition": "The business or practice of selling books or religious materials in public places.",
            "pos": "noun",
            "sent1": "The colportage of books in the bustling market attracted curious shoppers looking for new reads.",
            "sent2": "Colportage at the fair was a tradition that brought joy to both sellers and buyers.",
            "sent3": "The colportage of religious materials at the park turned into a spontaneous book club meeting.",
            "sent4": "His colportage of ancient texts in the square felt like a journey back in time for those who listened.",
            "sent5": "The colorful display of colportage items caught the eye of passersby, drawing them in with the promise of knowledge."
        }
    ]
}