{
    "term": "coltishness",
    "meanings": [
        {
            "definition": "Playful behavior resembling that of a young horse.",
            "pos": "noun",
            "sent1": "The children's coltishness in the park brought smiles to everyone's faces.",
            "sent2": "Her coltishness during the game of tag made her the center of attention.",
            "sent3": "The puppy's coltishness as it chased its tail was both adorable and amusing.",
            "sent4": "His coltishness on the dance floor was a sight to behold, full of energy and joy.",
            "sent5": "The coltishness of the foal as it frolicked in the meadow was a pure delight to watch."
        },
        {
            "definition": "The quality of being energetic and spirited, like a colt.",
            "pos": "noun",
            "sent1": "Her coltishness in the race was unmatched, showing determination and vigor.",
            "sent2": "The team's coltishness on the field led them to victory with their lively spirit.",
            "sent3": "The coltishness of the crowd at the concert created an electric atmosphere.",
            "sent4": "His coltishness in the debate was evident as he passionately argued his points.",
            "sent5": "The coltishness of the river as it rushed downstream was invigorating to witness."
        },
        {
            "definition": "The state of being awkward or uncoordinated, like a young horse.",
            "pos": "noun",
            "sent1": "His coltishness on the ice rink was endearing, though he often stumbled.",
            "sent2": "The kitten's coltishness as it tried to climb the tree was both clumsy and cute.",
            "sent3": "The coltishness of the robot's movements made it seem almost human in its errors.",
            "sent4": "Her coltishness in learning to ride a bike was a mix of determination and wobbling.",
            "sent5": "The coltishness of the newborn giraffe as it took its first steps was a heartwarming sight."
        }
    ]
}