{
    "term": "columned",
    "meanings": [
        {
            "definition": "Having columns",
            "pos": "adjective",
            "sent1": "The grand mansion had a columned entrance, with tall pillars framing the doorway.",
            "sent2": "The ancient temple was known for its columned structure, showcasing the architectural beauty of the past.",
            "sent3": "The columned hallway made the little girl feel like she was walking through a magical forest of stone trees.",
            "sent4": "The columned facade of the building stood like a row of soldiers, guarding the secrets within.",
            "sent5": "The columned palace gleamed in the sunlight, a symbol of power and strength."
        },
        {
            "definition": "Supported by columns",
            "pos": "adjective",
            "sent1": "The balcony was columned, offering a sturdy place to enjoy the view from above.",
            "sent2": "The gazebo in the garden was columned, providing a shaded spot for relaxation.",
            "sent3": "The cake looked precarious on the columned stand, as if it might topple over at any moment.",
            "sent4": "The bridge, columned on either side, spanned the river like a giant's pathway.",
            "sent5": "The statue, columned on its pedestal, seemed to reach for the sky in eternal grace."
        },
        {
            "definition": "Arranged in columns",
            "pos": "adjective",
            "sent1": "The columned text on the page made it easy to follow each line of the poem.",
            "sent2": "The data was neatly columned in the spreadsheet, making comparisons simple.",
            "sent3": "The toys were columned on the shelf, creating a colorful display for the children.",
            "sent4": "The soldiers, columned in formation, marched with precision and unity.",
            "sent5": "The flowers, columned in rows of vibrant hues, painted a beautiful picture in the garden."
        }
    ]
}