{
    "term": "combat",
    "meanings": [
        {
            "definition": "To fight or contend against",
            "pos": "verb",
            "sent1": "The brave knight must combat the fierce dragon to save the kingdom.",
            "sent2": "Soldiers train hard to combat the enemy on the battlefield.",
            "sent3": "I tried to combat my fear of spiders by imagining them wearing tiny hats.",
            "sent4": "She had to combat her nerves before giving a speech in front of a large audience.",
            "sent5": "The superhero's mission is to combat evil and protect the city from harm."
        },
        {
            "definition": "A fight or battle between armed forces",
            "pos": "noun",
            "sent1": "The combat between the two armies lasted for days.",
            "sent2": "Warriors prepare for combat by sharpening their swords and donning armor.",
            "sent3": "The epic combat scene in the movie had everyone on the edge of their seats.",
            "sent4": "The combat in the ancient war was depicted in vivid detail on the walls of the temple.",
            "sent5": "The sound of combat echoed through the valley as the armies clashed."
        },
        {
            "definition": "To struggle against",
            "pos": "verb",
            "sent1": "She had to combat the strong currents while swimming across the river.",
            "sent2": "The hiker had to combat fatigue as he climbed the steep mountain trail.",
            "sent3": "I tried to combat the urge to eat the entire cake in one sitting.",
            "sent4": "He had to combat his inner demons to overcome his addiction.",
            "sent5": "The team had to combat the opposing players' aggressive tactics to win the game."
        },
        {
            "definition": "A physical confrontation between individuals",
            "pos": "noun",
            "sent1": "The combat between the two boxers was intense and thrilling.",
            "sent2": "In martial arts competitions, combat skills are put to the test.",
            "sent3": "The playful combat between the siblings turned into a pillow fight.",
            "sent4": "The combat in the wrestling ring captivated the audience with its energy.",
            "sent5": "The combat in the movie was choreographed to perfection, making it look realistic."
        }
    ]
}