{
    "term": "combe",
    "meanings": [
        {
            "definition": "A deep hollow or valley, especially one with steep sides",
            "pos": "noun",
            "sent1": "The hikers explored the combe, marveling at its depth and steep sides.",
            "sent2": "The combe was a beautiful natural formation with its deep hollow and steep sides.",
            "sent3": "The combe was so deep that even the echoes sounded like they were coming from far away.",
            "sent4": "As the sun set, the combe cast long shadows, making it seem even deeper than it was.",
            "sent5": "The combe's steep sides made it a challenging but rewarding hike."
        },
        {
            "definition": "A long, narrow valley or hollow, typically with a stream running through it",
            "pos": "noun",
            "sent1": "The stream meandered through the combe, creating a peaceful atmosphere.",
            "sent2": "The combe stretched far into the distance, with a gentle stream flowing through it.",
            "sent3": "The combe was like a natural water slide, with the stream providing endless fun.",
            "sent4": "The combe's stream whispered secrets as it flowed through the narrow valley.",
            "sent5": "The combe's beauty was enhanced by the tranquil stream running through it."
        },
        {
            "definition": "A small, sheltered valley or hollow, often wooded",
            "pos": "noun",
            "sent1": "The combe was a cozy spot, sheltered by the surrounding trees.",
            "sent2": "Birds chirped happily in the combe's wooded hollow, creating a peaceful ambiance.",
            "sent3": "The combe was like a hidden treasure chest, tucked away in the woods.",
            "sent4": "The combe's trees embraced it like protective arms, keeping it safe and secluded.",
            "sent5": "The combe's wooded surroundings added a sense of magic to the small valley."
        }
    ]
}