{
    "term": "combes",
    "meanings": [
        {
            "definition": "A valley or hollow, typically with steep sides.",
            "pos": "noun",
            "sent1": "The hikers explored the deep combes in the mountains.",
            "sent2": "The combes were filled with lush greenery and wildlife.",
            "sent3": "The children played hide-and-seek in the combes, giggling as they hid behind rocks.",
            "sent4": "The combes resembled giant cradles, holding the secrets of nature within their embrace.",
            "sent5": "The combes echoed with the sound of rushing water, creating a serene atmosphere."
        },
        {
            "definition": "To search or rummage through something.",
            "pos": "verb",
            "sent1": "She combes through her closet looking for her favorite sweater.",
            "sent2": "The detective combed through the evidence to find the clue.",
            "sent3": "The cat combed through the pile of leaves, searching for its toy mouse.",
            "sent4": "He combed through the old books, hoping to find a hidden treasure.",
            "sent5": "The archaeologist combed through the ancient ruins, uncovering lost artifacts."
        },
        {
            "definition": "A person who combs hair.",
            "pos": "noun",
            "sent1": "The combes at the salon are skilled in creating beautiful hairstyles.",
            "sent2": "She visited the combe regularly to get her hair styled.",
            "sent3": "The combe at the barbershop always had a line of customers waiting.",
            "sent4": "The combe's gentle hands worked magic on her tangled hair.",
            "sent5": "The combe's expertise in hair care was well-known in the community."
        },
        {
            "definition": "A tool with teeth used for untangling or arranging hair.",
            "pos": "noun",
            "sent1": "She used the combe to detangle her long hair after showering.",
            "sent2": "The combe helped her create a neat braid for the special occasion.",
            "sent3": "The combe's teeth glided smoothly through her hair, making it silky and smooth.",
            "sent4": "The antique combe had intricate designs carved into its handle.",
            "sent5": "The combe's fine teeth were perfect for styling intricate updos."
        }
    ]
}