{
    "term": "combativenesses",
    "meanings": [
        {
            "definition": "The quality or state of being combative or aggressive in behavior.",
            "pos": "noun",
            "sent1": "His combativenesses often led to arguments with his classmates.",
            "sent2": "The boxer's combativenesses were evident in the way he approached the match.",
            "sent3": "Despite his small size, his combativenesses made him a formidable opponent in debates.",
            "sent4": "The team's combativenesses on the field were like a fierce storm, overwhelming their opponents.",
            "sent5": "Her combativenesses shone through in her determined stance and unwavering gaze."
        },
        {
            "definition": "The tendency to engage in physical or verbal conflict.",
            "pos": "noun",
            "sent1": "The siblings' constant combativenesses often resulted in loud arguments at home.",
            "sent2": "His combativenesses were evident in the way he always stood up for himself.",
            "sent3": "The two cats' playful combativenesses made them a joy to watch as they chased each other around the house.",
            "sent4": "The political debate was filled with combativenesses, each candidate trying to outdo the other.",
            "sent5": "The teacher tried to calm down the students' combativenesses by encouraging peaceful discussions."
        },
        {
            "definition": "A disposition to fight or argue.",
            "pos": "noun",
            "sent1": "Her combativenesses often got her into trouble with her peers.",
            "sent2": "The dog's combativenesses were a result of feeling threatened by strangers.",
            "sent3": "The comedian's witty combativenesses made the audience burst into laughter.",
            "sent4": "The workplace was filled with hidden combativenesses, waiting to surface during team meetings.",
            "sent5": "The politician's combative speeches were fueled by his deep-seated combativenesses."
        }
    ]
}