{
    "term": "combinatorial",
    "meanings": [
        {
            "definition": "Relating to the selection and arrangement of elements in a set",
            "pos": "adjective",
            "sent1": "The combinatorial puzzle required arranging the colored blocks in a specific order.",
            "sent2": "The math problem involved a combinatorial approach to organizing the numbers.",
            "sent3": "The combinatorial game of matching socks turned into a fun challenge.",
            "sent4": "Her mind worked in a combinatorial way, always seeking the best arrangement of ideas.",
            "sent5": "The artist's combinatorial skills in mixing colors created a beautiful masterpiece."
        },
        {
            "definition": "Involving the study of combinations and permutations",
            "pos": "adjective",
            "sent1": "The students were excited to learn about combinatorial mathematics in class.",
            "sent2": "The research project required a deep understanding of combinatorial principles.",
            "sent3": "The combinatorial study group made solving puzzles a collaborative effort.",
            "sent4": "Her approach to problem-solving was like a combinatorial dance, gracefully exploring all possibilities.",
            "sent5": "The scientist's combinatorial analysis of data revealed interesting patterns."
        },
        {
            "definition": "Characterized by the use of combinations or permutations",
            "pos": "adjective",
            "sent1": "The chef's recipe was a combinatorial mix of flavors that surprised everyone.",
            "sent2": "The game designer created a combinatorial challenge that kept players engaged.",
            "sent3": "The combinatorial approach to decorating the room resulted in a unique and eclectic style.",
            "sent4": "Her decision-making process was like a combinatorial puzzle, carefully selecting the best options.",
            "sent5": "The team's combinatorial strategy led to a successful outcome in the competition."
        }
    ]
}