{
    "term": "comic",
    "meanings": [
        {
            "definition": "A humorous or amusing person or thing.",
            "pos": "noun",
            "sent1": "The class clown was known for being a comic during lunchtime.",
            "sent2": "The audience burst into laughter at the comic's jokes.",
            "sent3": "The playful puppy tried to be a comic by chasing its tail in circles.",
            "sent4": "Her cheerful personality made her the comic of the group.",
            "sent5": "The little girl's silly dance was a comic sight to behold."
        },
        {
            "definition": "A comedian or comic actor.",
            "pos": "noun",
            "sent1": "The famous comic had the audience in stitches with his stand-up routine.",
            "sent2": "The comic's witty one-liners always brought smiles to people's faces.",
            "sent3": "The comic's exaggerated facial expressions added to the humor of his performance.",
            "sent4": "The talented comic could turn any situation into a hilarious anecdote.",
            "sent5": "The comic's timing and delivery were impeccable, leaving the audience roaring with laughter."
        },
        {
            "definition": "A magazine or book containing comic strips or cartoons.",
            "pos": "noun",
            "sent1": "Every Sunday, he would eagerly read the comic section of the newspaper.",
            "sent2": "The children loved to read the colorful comics in their favorite magazine.",
            "sent3": "The comic book store had a wide selection of superhero comics for sale.",
            "sent4": "She spent hours immersed in the world of fantasy through her comic collection.",
            "sent5": "The comic anthology featured a variety of artists and storytelling styles."
        },
        {
            "definition": "Of or relating to comedy.",
            "pos": "adjective",
            "sent1": "The audience enjoyed the comic performance at the theater.",
            "sent2": "Her witty remarks added a comic touch to the conversation.",
            "sent3": "The comic timing of the actors made the play even more entertaining.",
            "sent4": "The comic elements in the movie made it a lighthearted and enjoyable watch.",
            "sent5": "His playful antics brought a comic relief to the tense situation."
        }
    ]
}