{
    "term": "commission",
    "meanings": [
        {
            "definition": "An instruction, command, or duty given to a person or group.",
            "pos": "noun",
            "sent1": "The boss gave me a commission to finish the report by Friday.",
            "sent2": "The teacher's commission was to supervise the students during the field trip.",
            "sent3": "I received a commission to walk the dog, but I accidentally walked the cat instead!",
            "sent4": "Her eyes sparkled with determination as she carried out her commission to find the lost treasure.",
            "sent5": "The commission to clean the entire house felt like an impossible task."
        },
        {
            "definition": "A fee paid to a salesperson for selling a product or service.",
            "pos": "noun",
            "sent1": "The salesperson earned a commission for selling the expensive watch.",
            "sent2": "She was excited to receive a commission for her hard work at the store.",
            "sent3": "The commission for selling the old bicycle was enough to buy a new one.",
            "sent4": "His commission for closing the deal was a generous bonus from the company.",
            "sent5": "The commission for selling the painting was a pleasant surprise for the artist."
        },
        {
            "definition": "A group of people officially appointed to perform a specific task or function.",
            "pos": "noun",
            "sent1": "The commission gathered to discuss the new project and assign roles.",
            "sent2": "She was part of the commission responsible for organizing the event.",
            "sent3": "The commission of superheroes saved the city from the alien invasion.",
            "sent4": "The commission of experts worked tirelessly to find a solution to the problem.",
            "sent5": "Being part of the commission felt like being part of a special team with a crucial mission."
        }
    ]
}