{
    "term": "communion",
    "meanings": [
        {
            "definition": "The act of sharing thoughts and feelings with someone else.",
            "pos": "noun",
            "sent1": "After a long day, Sarah and her best friend had a deep communion about their worries.",
            "sent2": "During the therapy session, the patient felt comfortable enough to have a communion with the counselor.",
            "sent3": "At the family dinner, there was a funny communion about everyone's favorite TV shows.",
            "sent4": "The artist felt a communion with nature as she painted the vibrant sunset.",
            "sent5": "The communion between the two musicians on stage was evident in their harmonious performance."
        },
        {
            "definition": "A Christian religious service in which bread and wine are consecrated and shared.",
            "pos": "noun",
            "sent1": "The community gathered at the church for Sunday communion.",
            "sent2": "The priest led the congregation in communion during the Easter service.",
            "sent3": "During the communion, the toddler accidentally spilled the grape juice.",
            "sent4": "The communion symbolized the unity of the church members in their faith.",
            "sent5": "The solemnity of the communion service brought peace to the worshipers' hearts."
        },
        {
            "definition": "A feeling of emotional or spiritual closeness or connection with someone or something.",
            "pos": "noun",
            "sent1": "The siblings shared a deep communion after reconciling their differences.",
            "sent2": "In the quiet forest, Sarah felt a communion with nature and its beauty.",
            "sent3": "The dog's wagging tail showed a communion of joy with its owner.",
            "sent4": "The artist's painting captured the communion between light and shadow.",
            "sent5": "The elderly couple's love was a beautiful communion that lasted a lifetime."
        }
    ]
}