{
    "term": "commercialised",
    "meanings": [
        {
            "definition": "To make something commercial in character.",
            "pos": "verb",
            "sent1": "The small bakery commercialised their famous cookie recipe to sell to more customers.",
            "sent2": "The company decided to commercialise their new product by advertising it on TV.",
            "sent3": "The kids commercialised their lemonade stand by adding a fun mascot to attract more buyers.",
            "sent4": "She commercialised her hobby of painting by selling her artwork online.",
            "sent5": "The artist commercialised his unique style by opening a gallery in the city center."
        },
        {
            "definition": "To exploit for profit.",
            "pos": "verb",
            "sent1": "Some companies commercialise the natural resources of developing countries for their own gain.",
            "sent2": "The unethical businessman tried to commercialise the situation for his personal benefit.",
            "sent3": "The sneaky salesman tried to commercialise the customer's confusion to make a quick sale.",
            "sent4": "The scam artist commercialised people's trust to deceive them into investing in fake schemes.",
            "sent5": "The greedy corporation commercialised the vulnerability of consumers to increase their profits."
        },
        {
            "definition": "To adapt for commerce.",
            "pos": "verb",
            "sent1": "The traditional family business decided to commercialise their products for online sales.",
            "sent2": "The local market vendors are looking to commercialise their goods for export.",
            "sent3": "The old bookstore commercialised their inventory by offering online ordering and delivery.",
            "sent4": "The farmer commercialised his crops by selling them at the new farmers' market.",
            "sent5": "The artisan commercialised her handmade crafts by setting up a booth at the craft fair."
        }
    ]
}