{
    "term": "commutators",
    "meanings": [
        {
            "definition": "A person or thing that commutes.",
            "pos": "noun",
            "sent1": "The commutators on the train help people travel to work every day.",
            "sent2": "The bus driver is an essential commutator for many passengers.",
            "sent3": "I wish I had magical commutators that could teleport me to different places instantly.",
            "sent4": "Her bicycle wheels spun like commutators, swiftly carrying her through the city streets.",
            "sent5": "The commutators in the office elevator efficiently move people between floors."
        },
        {
            "definition": "A device in an electric motor that reverses the direction of current.",
            "pos": "noun",
            "sent1": "The commutators in the motor ensure the electricity flows in the right direction.",
            "sent2": "Electricians need to understand how commutators work to fix motor issues.",
            "sent3": "The mischievous robot kept playing with the commutators, causing the motor to go haywire.",
            "sent4": "The commutators acted like traffic cops, directing the electrical current smoothly.",
            "sent5": "Without functioning commutators, the motor would not be able to operate effectively."
        },
        {
            "definition": "A mathematical operation that changes the order of two elements in a group.",
            "pos": "noun",
            "sent1": "In algebra, commutators are used to rearrange terms in equations.",
            "sent2": "Mathematicians study commutators to understand group theory better.",
            "sent3": "The math magician performed tricks with commutators, dazzling the audience.",
            "sent4": "The commutators in the equation danced around, swapping numbers effortlessly.",
            "sent5": "Understanding commutators is crucial for solving complex mathematical problems."
        }
    ]
}