{
    "term": "commo",
    "meanings": [
        {
            "definition": "Common",
            "pos": "adjective",
            "sent1": "It is commo to see birds in the sky.",
            "sent2": "The color blue is a commo choice for painting walls.",
            "sent3": "In our town, it is commo for everyone to know each other.",
            "sent4": "The commo goal of all students is to graduate with honors.",
            "sent5": "The commo cold virus spreads easily during winter."
        },
        {
            "definition": "Communication",
            "pos": "noun",
            "sent1": "Clear commo is essential in any relationship.",
            "sent2": "We use commo to express our thoughts and feelings.",
            "sent3": "The commo between the two friends was filled with laughter.",
            "sent4": "The commo between the team members was seamless and effective.",
            "sent5": "Effective commo can prevent misunderstandings and conflicts."
        },
        {
            "definition": "Command",
            "pos": "noun",
            "sent1": "The officer gave a commo to start the race.",
            "sent2": "She spoke with authority and gave a clear commo to her team.",
            "sent3": "The commo to evacuate the building was given by the fire alarm.",
            "sent4": "His commo was followed without question by the troops.",
            "sent5": "The commo to halt construction came from the city council."
        },
        {
            "definition": "Commission",
            "pos": "noun",
            "sent1": "The artist received a commo to create a masterpiece.",
            "sent2": "She was appointed to lead the commo on environmental conservation.",
            "sent3": "The commo for the new building project was awarded to the top architect.",
            "sent4": "The commo for the investigation was given to the experienced detective.",
            "sent5": "The commo for the art exhibition was well received by the public."
        }
    ]
}