{
    "term": "commutation",
    "meanings": [
        {
            "definition": "The act of substituting one thing for another.",
            "pos": "noun",
            "sent1": "In math class, we learned about commutation when we swapped the order of numbers in an equation.",
            "sent2": "During the game, the coach made a commutation, replacing one player with another.",
            "sent3": "At the party, there was a funny commutation of desserts, with cookies being exchanged for cupcakes.",
            "sent4": "The commutation of roles between the teacher and student made the classroom feel like a whole new world.",
            "sent5": "The commutation of paint colors on the walls transformed the room into a vibrant space."
        },
        {
            "definition": "The reduction of a penalty to a less severe one.",
            "pos": "noun",
            "sent1": "The judge decided on commutation, lessening the punishment for the minor offense.",
            "sent2": "After considering the circumstances, the principal granted commutation for the student's tardiness.",
            "sent3": "The commutation of detention to a warning brought a smile to the student's face.",
            "sent4": "The commutation of the fine felt like a weight lifted off the driver's shoulders.",
            "sent5": "The commutation of the sentence from jail time to community service was a relief for the offender."
        },
        {
            "definition": "The process of exchanging one form of payment for another.",
            "pos": "noun",
            "sent1": "The commutation of cash for gift cards made shopping more convenient.",
            "sent2": "At the bank, customers often request commutation of large bills for smaller ones.",
            "sent3": "The commutation of coins for bills at the arcade was a fun way to get prizes.",
            "sent4": "The commutation of checks for cash at the counter saved time for the busy customers.",
            "sent5": "The commutation of online credits for physical goods was a popular option for shoppers."
        }
    ]
}