{
    "term": "commandeer",
    "meanings": [
        {
            "definition": "To officially take possession or control of something, especially for military purposes.",
            "pos": "verb",
            "sent1": "The general decided to commandeer the enemy's supplies to support his troops.",
            "sent2": "The army commandeer the building for their headquarters during the war.",
            "sent3": "The soldiers tried to commandeer the ice cream truck, thinking it was a military vehicle.",
            "sent4": "The pirate captain managed to commandeer the enemy ship in a daring raid.",
            "sent5": "The king's order to commandeer all available horses for the cavalry was carried out swiftly."
        },
        {
            "definition": "To seize for military or official use.",
            "pos": "verb",
            "sent1": "During the emergency, the government may commandeer private vehicles for evacuation purposes.",
            "sent2": "The military had to commandeer civilian boats to reach the island under siege.",
            "sent3": "The mayor jokingly threatened to commandeer all the office supplies for his own use.",
            "sent4": "The superhero had to commandeer a helicopter to reach the villain's hideout in time.",
            "sent5": "The commander decided to commandeer the radio station to broadcast important updates to the public."
        },
        {
            "definition": "To take control or possession of something without authority.",
            "pos": "verb",
            "sent1": "The kids tried to commandeer the playground equipment before the park officially opened.",
            "sent2": "The protestors attempted to commandeer the stage to make their voices heard.",
            "sent3": "The cat managed to commandeer the warm spot by the fireplace from the dog.",
            "sent4": "The ambitious intern tried to commandeer the project from her supervisor.",
            "sent5": "The students decided to commandeer the empty classroom for their impromptu study session."
        }
    ]
}