{
    "term": "commandeering",
    "meanings": [
        {
            "definition": "To officially take possession or control of something, especially for military purposes.",
            "pos": "verb",
            "sent1": "During the war, the general ordered commandeering of all vehicles for transportation.",
            "sent2": "The army was accused of commandeering civilian supplies for their own use.",
            "sent3": "The soldiers were caught commandeering the local bakery's bread for their breakfast.",
            "sent4": "The storm seemed to be commandeering the entire sky with its dark clouds.",
            "sent5": "The mayor's speech about commandeering resources for the town was met with mixed reactions."
        },
        {
            "definition": "To seize for military or official use.",
            "pos": "verb",
            "sent1": "The government decided to start commandeering private land for the new military base.",
            "sent2": "The rebels were accused of commandeering weapons from the armory.",
            "sent3": "The kids were playfully commandeering the teacher's desk during recess.",
            "sent4": "The music seemed to be commandeering everyone's attention at the concert.",
            "sent5": "The detective was commandeering all available resources to solve the case."
        },
        {
            "definition": "To take control or possession of something without authority.",
            "pos": "verb",
            "sent1": "The thief was caught commandeering items from the store without paying.",
            "sent2": "The hacker was arrested for commandeering sensitive information from the company's database.",
            "sent3": "The cat was commandeering the best spot on the couch for its nap.",
            "sent4": "The idea of love seemed to be commandeering her thoughts and emotions.",
            "sent5": "The artist was commandeering attention with their stunning masterpiece at the gallery."
        }
    ]
}