{
    "term": "commonwealths",
    "meanings": [
        {
            "definition": "Independent country or community",
            "pos": "noun",
            "sent1": "The small island nation was a commonwealths where everyone worked together for the good of all.",
            "sent2": "Australia is known as a commonwealths, with its own government and laws.",
            "sent3": "In the land of commonwealths, even the animals had a say in important decisions.",
            "sent4": "The commonwealths stood strong like a mighty oak tree, rooted in unity and freedom.",
            "sent5": "The commonwealths sparkled like a gem, each citizen a precious facet in the whole."
        },
        {
            "definition": "Political unit founded on laws and united by compact or tacit agreement",
            "pos": "noun",
            "sent1": "The ancient empire was a commonwealths, ruled by a council of elders.",
            "sent2": "The commonwealths had strict rules governing the behavior of its citizens.",
            "sent3": "The commonwealths had a secret handshake that sealed their political unity.",
            "sent4": "The commonwealths was a fortress of laws, protecting its people from chaos.",
            "sent5": "The commonwealths was a tapestry of governance, each thread woven with care and purpose."
        },
        {
            "definition": "Group of people united by common interests or goals",
            "pos": "noun",
            "sent1": "The book club was a commonwealths of avid readers, sharing their love for literature.",
            "sent2": "The environmental activists formed a commonwealths to protect the local wildlife.",
            "sent3": "The commonwealths of bakers traded recipes like precious treasures.",
            "sent4": "Their friendship was a commonwealths, a bond stronger than steel.",
            "sent5": "The commonwealths of artists painted the town with colors of unity and creativity."
        }
    ]
}