{
    "term": "compact",
    "meanings": [
        {
            "definition": "Closely and neatly packed together",
            "pos": "adjective",
            "sent1": "The toys were compact in the box, fitting perfectly.",
            "sent2": "The compact suitcase held all her clothes for the trip.",
            "sent3": "The compact puzzle pieces made it challenging to assemble.",
            "sent4": "Her thoughts were so compact, she could hardly process them.",
            "sent5": "The compact room felt cozy and snug."
        },
        {
            "definition": "A small, flat case containing a mirror and powder for makeup",
            "pos": "noun",
            "sent1": "She always carries her compact for quick touch-ups.",
            "sent2": "The compact slipped into her purse easily.",
            "sent3": "The compact opened with a satisfying click.",
            "sent4": "Her compact reflected her tired but happy face.",
            "sent5": "The compact's mirror showed a clear image."
        },
        {
            "definition": "A formal agreement or contract",
            "pos": "noun",
            "sent1": "The two countries signed a compact for peace.",
            "sent2": "The compact outlined the terms of their partnership.",
            "sent3": "The compact was sealed with a handshake.",
            "sent4": "Their verbal compact was as binding as any written contract.",
            "sent5": "The compact ensured mutual respect and cooperation."
        },
        {
            "definition": "A small car that is economical and easy to park",
            "pos": "noun",
            "sent1": "She loved her compact for zipping around the city.",
            "sent2": "The compact fit perfectly into the tight parking spot.",
            "sent3": "The compact's engine purred softly as she drove.",
            "sent4": "In the compact, she felt like she owned the road.",
            "sent5": "The compact's fuel efficiency saved her money on gas."
        }
    ]
}