{
    "term": "complexes",
    "meanings": [
        {
            "definition": "A group of related buildings or structures",
            "pos": "noun",
            "sent1": "The apartment complexes in the city offer various amenities for residents.",
            "sent2": "The industrial complexes in the area house multiple factories and warehouses.",
            "sent3": "The office complexes in town always seem to have a never-ending supply of paperwork.",
            "sent4": "The shopping complex stood tall, a maze of stores and eateries waiting to be explored.",
            "sent5": "The hospital complex was a bustling hub of activity, with patients coming and going."
        },
        {
            "definition": "A group of related ideas or emotions",
            "pos": "noun",
            "sent1": "Her emotional complexes often made it difficult for her to express herself.",
            "sent2": "The novel explores the character's inner complexes and struggles.",
            "sent3": "His fear of spiders was just one of his many irrational complexes.",
            "sent4": "The movie portrayed the protagonist's emotional complex with depth and authenticity.",
            "sent5": "The painting captured a complex mix of emotions, leaving viewers contemplative."
        },
        {
            "definition": "A feeling of inferiority or inadequacy, often resulting from an unconscious conflict",
            "pos": "noun",
            "sent1": "She struggled with a deep-seated inferiority complex that affected her confidence.",
            "sent2": "His constant need for validation stemmed from his underlying inadequacy complex.",
            "sent3": "The comedian's humor often masked his own insecurities and complexes.",
            "sent4": "The character in the play grappled with his inner demons, battling his own sense of inadequacy.",
            "sent5": "The student's inferiority complex hindered her from reaching her full potential in school."
        }
    ]
}