{
    "term": "complementary",
    "meanings": [
        {
            "definition": "Combining in such a way as to enhance or emphasize the qualities of each other.",
            "pos": "adjective",
            "sent1": "The red and green colors were complementary and made the painting vibrant.",
            "sent2": "The chef used complementary spices to enhance the flavor of the dish.",
            "sent3": "The clown's outfit was so colorful and complementary that it made everyone smile.",
            "sent4": "Their personalities were complementary like puzzle pieces fitting perfectly together.",
            "sent5": "The music and lyrics were so complementary that it created a beautiful harmony."
        },
        {
            "definition": "Completing or making whole.",
            "pos": "adjective",
            "sent1": "The final piece of the puzzle was complementary and completed the picture.",
            "sent2": "The missing ingredient was complementary and made the recipe whole.",
            "sent3": "The last chapter of the book was so complementary that it tied up all loose ends.",
            "sent4": "Her smile was like a missing piece, complementary and making his day whole.",
            "sent5": "The sunset was complementary, completing the day with its beauty."
        },
        {
            "definition": "Something that completes or brings to perfection.",
            "pos": "noun",
            "sent1": "In their relationship, she was the complementary that brought out the best in him.",
            "sent2": "The final touch on the painting was the perfect complementary to make it a masterpiece.",
            "sent3": "The secret ingredient in the recipe turned out to be the missing complementary for perfection.",
            "sent4": "His supportive nature was the complementary that completed her sense of fulfillment.",
            "sent5": "The diamond necklace was the ideal complementary to her elegant dress."
        }
    ]
}