{
    "term": "complementizers",
    "meanings": [
        {
            "definition": "A word or phrase that introduces a subordinate clause.",
            "pos": "noun",
            "sent1": "In the sentence 'I know that she is coming,' the word 'that' is a complementizers.",
            "sent2": "Complementizers are important for connecting different parts of a sentence.",
            "sent3": "The complementizers in a sentence are like little helpers that bring extra information.",
            "sent4": "Complementizers act as bridges between the main clause and the subordinate clause.",
            "sent5": "Remember, complementizers are like the glue that holds complex sentences together."
        },
        {
            "definition": "A word that links a main clause to a subordinate clause.",
            "pos": "noun",
            "sent1": "She explained why she was late, using complementizers to connect her reasons to the main story.",
            "sent2": "Complementizers help us understand the relationship between different parts of a sentence.",
            "sent3": "The complementizers in the sentence were like tiny connectors joining the clauses.",
            "sent4": "Just like a bridge, complementizers smoothly link the main idea to additional details.",
            "sent5": "Using complementizers correctly ensures that your sentences flow logically and clearly."
        },
        {
            "definition": "A word that connects two clauses in a sentence.",
            "pos": "noun",
            "sent1": "The teacher explained how complementizers join clauses to form complex sentences.",
            "sent2": "Complementizers are like little words that help sentences make sense.",
            "sent3": "The complementizers in the story were like magical threads weaving the clauses together.",
            "sent4": "Complementizers are the secret agents that link clauses without us even noticing.",
            "sent5": "Imagine complementizers as invisible hands holding sentence parts together seamlessly."
        }
    ]
}