{
    "term": "compulsions",
    "meanings": [
        {
            "definition": "An irresistible urge to behave in a certain way, especially against one's conscious wishes.",
            "pos": "noun",
            "sent1": "Her compulsions to check the door multiple times before leaving the house were overwhelming.",
            "sent2": "His compulsions to organize his desk every morning were a part of his daily routine.",
            "sent3": "Sarah's compulsions to rearrange the furniture in the office led to a more efficient layout.",
            "sent4": "The compulsions to constantly seek approval can be a heavy burden to carry.",
            "sent5": "The compulsions to count each step she took made her walk seem like a dance."
        },
        {
            "definition": "The action or state of forcing or being forced to do something.",
            "pos": "noun",
            "sent1": "The compulsions of the strict teacher made the students follow the rules diligently.",
            "sent2": "His compulsions to finish the project on time were driven by his sense of responsibility.",
            "sent3": "The compulsions of the traffic lights controlled the flow of cars smoothly.",
            "sent4": "The compulsions of nature dictated the behavior of the animals in the wild.",
            "sent5": "The compulsions of the deadline pushed him to work late into the night."
        },
        {
            "definition": "The action or state of being forced to do something.",
            "pos": "noun",
            "sent1": "The compulsions of the storm forced everyone to seek shelter indoors.",
            "sent2": "His compulsions to attend the meeting were met with understanding by his colleagues.",
            "sent3": "The compulsions of the alarm clock woke him up abruptly every morning.",
            "sent4": "The compulsions of tradition guided their actions during the holiday season.",
            "sent5": "The compulsions of duty compelled him to fulfill his responsibilities without fail."
        }
    ]
}