{
    "term": "competition",
    "meanings": [
        {
            "definition": "The act of competing",
            "pos": "noun",
            "sent1": "In the competition, everyone tried their best to win.",
            "sent2": "The school organized a competition to see who could run the fastest.",
            "sent3": "During the competition, the turtle surprisingly beat the rabbit.",
            "sent4": "Life is like a competition where we all strive to reach the top.",
            "sent5": "The fierce competition made the event exciting and intense."
        },
        {
            "definition": "A contest between rivals",
            "pos": "noun",
            "sent1": "The two friends had a friendly competition to see who could eat the most hot dogs.",
            "sent2": "The soccer match was a tough competition between the two rival teams.",
            "sent3": "During the baking competition, the cakes of the two rivals mysteriously disappeared.",
            "sent4": "Their competition for the title of best singer was like a battle of voices.",
            "sent5": "The intense competition between the siblings made family game night thrilling."
        },
        {
            "definition": "The rivalry between businesses for market share",
            "pos": "noun",
            "sent1": "The competition between the two ice cream shops led to creative marketing strategies.",
            "sent2": "In the fierce competition, both companies slashed their prices to attract customers.",
            "sent3": "The competition between the bakeries for the best croissant was heating up.",
            "sent4": "The competition for market share was like a chess game, with each move carefully planned.",
            "sent5": "The intense competition between the tech giants shaped the industry's future."
        },
        {
            "definition": "The struggle for superiority or victory",
            "pos": "noun",
            "sent1": "The competition for the top spot in the class was fierce.",
            "sent2": "The athletes trained hard for the upcoming competition.",
            "sent3": "During the cooking competition, the chefs battled for the title of best dish.",
            "sent4": "The competition for the leadership role was a test of skills and determination.",
            "sent5": "The fierce competition between the teams made the game thrilling to watch."
        }
    ]
}