{
    "term": "companions",
    "meanings": [
        {
            "definition": "A person who accompanies or associates with another.",
            "pos": "noun",
            "sent1": "My dog is my loyal companion on all my walks.",
            "sent2": "She always brings her companions to the park for a picnic.",
            "sent3": "The little girl's stuffed bear was her constant companion, even at the dinner table.",
            "sent4": "In the vast forest, the trees stood as silent companions to the wandering traveler.",
            "sent5": "The old man's wrinkled hands reached out for his companion's touch, seeking comfort."
        },
        {
            "definition": "A member of a group of people who are in each other's company.",
            "pos": "noun",
            "sent1": "The hiking group set out with their companions, ready for the adventure.",
            "sent2": "The astronaut's fellow companions cheered as they entered space.",
            "sent3": "The mischievous kitten led its companions on a chase around the house.",
            "sent4": "The stars in the night sky shone brightly, like distant companions watching over the earth.",
            "sent5": "The students formed a close-knit group, each one a valued companion in their academic journey."
        },
        {
            "definition": "A person or animal with whom one spends a lot of time or with whom one travels.",
            "pos": "noun",
            "sent1": "The explorer's loyal companions never left his side during the dangerous expedition.",
            "sent2": "The horse was the farmer's faithful companion in the fields.",
            "sent3": "The mischievous monkey became an unexpected companion on the family's camping trip.",
            "sent4": "The old watchman's faithful dog was his constant companion during the quiet nights.",
            "sent5": "The chirping birds in the garden were the old lady's cheerful companions every morning."
        }
    ]
}