{
    "term": "compounder",
    "meanings": [
        {
            "definition": "A person or thing that compounds",
            "pos": "noun",
            "sent1": "The compounder mixed different ingredients to create a new medicine.",
            "sent2": "The compounder carefully combined the elements to form a unique substance.",
            "sent3": "The compounder decided to mix peanut butter with pickles for a strange snack.",
            "sent4": "Her mind was a compounder of ideas, blending them together to form innovative solutions.",
            "sent5": "The compounder's workshop was filled with various tools for mixing and blending materials."
        },
        {
            "definition": "A pharmacist who prepares and dispenses medications",
            "pos": "noun",
            "sent1": "The compounder at the pharmacy filled the prescription with precision.",
            "sent2": "The compounder counted out the pills and labeled the medication bottles.",
            "sent3": "The compounder accidentally mixed up the cough syrup with the eye drops.",
            "sent4": "She was a compounder of health, creating remedies to help her community.",
            "sent5": "The compounder's white coat was always spotless, a symbol of cleanliness and care."
        },
        {
            "definition": "An investor who reinvests earnings to generate more earnings",
            "pos": "noun",
            "sent1": "The compounder wisely reinvested his profits to grow his wealth.",
            "sent2": "The compounder understood the power of compounding interest over time.",
            "sent3": "The compounder joked that his money was like a plant, growing when watered with more investments.",
            "sent4": "Her portfolio was a compounder of financial success, multiplying gains year after year.",
            "sent5": "The compounder's strategy was like a snowball rolling down a hill, getting bigger with each turn."
        }
    ]
}