{
    "term": "computerphobias",
    "meanings": [
        {
            "definition": "Computerphobias: an irrational fear or aversion to computers.",
            "pos": "noun",
            "sent1": "Her computerphobias made it difficult for her to even turn on a laptop.",
            "sent2": "Many people with computerphobias prefer to use pen and paper instead.",
            "sent3": "His computerphobias were so extreme that he would break out in a sweat at the sight of a keyboard.",
            "sent4": "The computerphobias lurking within her mind felt like a dark cloud overshadowing her digital life.",
            "sent5": "The intensity of her computerphobias was like a monster hiding in the shadows of technology."
        },
        {
            "definition": "Computerphobias: the act of experiencing anxiety or panic when faced with using a computer.",
            "pos": "noun",
            "sent1": "His computerphobias often led to sweaty palms and a racing heart whenever he had to use a computer.",
            "sent2": "Computerphobias can be overwhelming for those who struggle with technology.",
            "sent3": "The computerphobias kicked in right before his important presentation, causing him to freeze up.",
            "sent4": "The grip of computerphobias felt like a tight knot in his stomach, making it hard to focus.",
            "sent5": "The weight of his computerphobias felt like a heavy burden on his shoulders, dragging him down."
        },
        {
            "definition": "Computerphobias: a condition characterized by a strong dislike or avoidance of technology.",
            "pos": "noun",
            "sent1": "Her computerphobias led her to choose a career path that didn't involve any digital devices.",
            "sent2": "People with computerphobias may feel more comfortable with traditional methods of communication.",
            "sent3": "His computerphobias were so intense that he refused to even own a smartphone.",
            "sent4": "The roots of his computerphobias ran deep, stemming from a childhood filled with tech-related mishaps.",
            "sent5": "The grip of computerphobias felt like a barrier separating him from the digital world around him."
        }
    ]
}