{
    "term": "compactors",
    "meanings": [
        {
            "definition": "A machine or device used to compress or reduce the size of waste or other materials.",
            "pos": "noun",
            "sent1": "The compactors at the recycling plant help squash the garbage efficiently.",
            "sent2": "The city invested in new compactors to manage the increasing amount of trash.",
            "sent3": "The compactors in the factory worked so hard, they deserved a break!",
            "sent4": "Her determination was like a compactor, squeezing out every bit of potential in her team.",
            "sent5": "The loud rumble of the compactors echoed through the alley, signaling the start of a new day."
        },
        {
            "definition": "A person or thing that compacts or compresses something.",
            "pos": "noun",
            "sent1": "The manual compactors in the warehouse were used to flatten cardboard boxes.",
            "sent2": "She was a natural compactor, always organizing and condensing her belongings.",
            "sent3": "The little boy pretended to be a superhero with the power of a compactor, squishing imaginary villains.",
            "sent4": "His words acted like emotional compactors, pressing down her spirits with each cruel remark.",
            "sent5": "The chef's hands moved like skilled compactors, shaping the dough into perfect spheres."
        },
        {
            "definition": "A type of construction equipment used to compact soil or other materials.",
            "pos": "noun",
            "sent1": "The compactors on the construction site smoothed out the ground for the new building.",
            "sent2": "The heavy compactors were essential for preparing the road for traffic.",
            "sent3": "The compactors seemed to dance across the soil, leaving a perfectly leveled surface behind.",
            "sent4": "The compactors roared to life, their steel plates pressing down with incredible force.",
            "sent5": "The sun glinted off the compactors, turning them into shining giants against the backdrop of the construction site."
        }
    ]
}