{
    "term": "compensative",
    "meanings": [
        {
            "definition": "Serving to compensate or make amends",
            "pos": "adjective",
            "sent1": "Her compensative gesture of baking cookies for her friend showed her desire to make up for the mistake.",
            "sent2": "The compensative payment for the damaged goods was promptly issued by the insurance company.",
            "sent3": "The cat's compensative offering of a toy mouse to its owner after knocking over a vase was both cute and thoughtful.",
            "sent4": "The sunset's compensative colors painted the sky in a breathtaking display of beauty.",
            "sent5": "The teacher's compensative praise for the student's hard work boosted his confidence."
        },
        {
            "definition": "Providing compensation or reparation",
            "pos": "adjective",
            "sent1": "The compensative bonus at the end of the year was a welcome surprise for the employees.",
            "sent2": "The compensative measures taken by the company helped restore trust with its customers.",
            "sent3": "The clown's compensative act of juggling while balancing on a unicycle brought laughter to the audience.",
            "sent4": "The rain was a compensative gift to the dry, thirsty land.",
            "sent5": "The compensative hug from a friend can sometimes heal a broken heart."
        },
        {
            "definition": "Involving or relating to compensation or reimbursement",
            "pos": "adjective",
            "sent1": "The compensative policy of the company ensured fair treatment for all employees.",
            "sent2": "The compensative process for travel expenses was straightforward and efficient.",
            "sent3": "The dog's compensative behavior of fetching the ball repeatedly delighted its owner.",
            "sent4": "The stars in the night sky seemed like compensative jewels scattered across a dark canvas.",
            "sent5": "The compensative voucher provided a discount on the next purchase."
        }
    ]
}