{
    "term": "compassionatenesses",
    "meanings": [
        {
            "definition": "The quality of being compassionate.",
            "pos": "noun",
            "sent1": "Her compassionatenesses towards stray animals touched everyone's hearts.",
            "sent2": "The community admired her compassionatenesses towards those in need.",
            "sent3": "His compassionatenesses were so evident, even the grumpiest neighbor couldn't resist smiling.",
            "sent4": "In a world full of selfishness, her compassionatenesses shone like a beacon of light.",
            "sent5": "The teacher's compassionatenesses created a warm and welcoming classroom environment."
        },
        {
            "definition": "The state of feeling or showing compassion.",
            "pos": "noun",
            "sent1": "After the accident, a sense of compassionatenesses filled the room.",
            "sent2": "In times of crisis, it's important to embrace compassionatenesses towards others.",
            "sent3": "The movie's plot revolved around the characters' lack of compassionatenesses towards each other.",
            "sent4": "The compassionatenesses in her voice made it clear she truly cared.",
            "sent5": "The community came together in a beautiful display of compassionatenesses after the natural disaster."
        },
        {
            "definition": "Acts of kindness and understanding towards others.",
            "pos": "noun",
            "sent1": "Small acts of compassionatenesses can make a big difference in someone's day.",
            "sent2": "Volunteering at the shelter showed her true compassionatenesses.",
            "sent3": "His random acts of compassionatenesses always brought a smile to people's faces.",
            "sent4": "The world could certainly use more compassionatenesses towards one another.",
            "sent5": "The compassionatenesses of the community was evident in their support for the local charity event."
        }
    ]
}