{
    "term": "comradery",
    "meanings": [
        {
            "definition": "The quality of affording easy familiarity and sociability.",
            "pos": "noun",
            "sent1": "The comradery among the teammates was evident in their shared laughter and inside jokes.",
            "sent2": "The office had a warm atmosphere of comradery, making it a pleasant place to work.",
            "sent3": "The comradery at the family reunion made even the shyest relatives feel at ease.",
            "sent4": "The comradery in the classroom was like a safety net, ensuring everyone felt supported.",
            "sent5": "The comradery on the camping trip created lasting bonds among the group."
        },
        {
            "definition": "The quality of being friendly and welcoming to others.",
            "pos": "noun",
            "sent1": "Her comradery towards new students helped them feel included in the school community.",
            "sent2": "The comradery of the neighborhood made newcomers feel like part of the family.",
            "sent3": "The comradery of the team captain was so genuine that it put everyone at ease.",
            "sent4": "The comradery of the group was like a warm hug on a cold day.",
            "sent5": "The comradery of the club members created a sense of belonging for everyone."
        },
        {
            "definition": "A feeling of friendship and mutual trust among people who spend a lot of time together.",
            "pos": "noun",
            "sent1": "The comradery among the classmates grew stronger with each group project they completed.",
            "sent2": "The comradery of the hiking group was built on shared experiences and mutual respect.",
            "sent3": "The comradery among the coworkers made even the toughest days more bearable.",
            "sent4": "The comradery of the band members was like a symphony of friendship and trust.",
            "sent5": "The comradery of the sports team was the secret ingredient to their success on and off the field."
        }
    ]
}