{
    "term": "concrete",
    "meanings": [
        {
            "definition": "A building material made from a mixture of cement, sand, and water.",
            "pos": "noun",
            "sent1": "The workers poured concrete to build the foundation.",
            "sent2": "The sidewalk was made of concrete.",
            "sent3": "Why did the concrete refuse to play hide and seek? Because it always stood out!",
            "sent4": "Her determination was as solid as concrete.",
            "sent5": "The weight of the concrete block was immense."
        },
        {
            "definition": "A solid mass formed by the hardening of a liquid substance.",
            "pos": "noun",
            "sent1": "The concrete in the mold slowly hardened into a strong block.",
            "sent2": "The spilled milk dried into a concrete mass on the floor.",
            "sent3": "The concrete in the cupcake batter made them extra crunchy.",
            "sent4": "His love for her was like concrete, unyielding and strong.",
            "sent5": "The concrete of the dam held back the rushing water."
        },
        {
            "definition": "Specific, definite, and tangible.",
            "pos": "adjective",
            "sent1": "She gave a concrete example to explain the concept.",
            "sent2": "The instructions were clear and concrete.",
            "sent3": "His plan was as concrete as a brick wall.",
            "sent4": "The memory of that day was concrete in her mind.",
            "sent5": "The evidence was concrete and undeniable."
        },
        {
            "definition": "To make something solid or real.",
            "pos": "verb",
            "sent1": "He tried to concrete his dream into a successful business.",
            "sent2": "The artist concreted his vision into a beautiful sculpture.",
            "sent3": "She concreted her commitment by signing the contract.",
            "sent4": "The team concreted their bond through hard work.",
            "sent5": "They concreted their friendship with a handshake."
        }
    ]
}