{
    "term": "concern",
    "meanings": [
        {
            "definition": "To relate to; be connected with.",
            "pos": "verb",
            "sent1": "My friend's story doesn't concern me.",
            "sent2": "The safety of the children is a top concern for the school.",
            "sent3": "I can't help but concern myself with the missing sock mystery.",
            "sent4": "The threads of fate concern us all in their intricate weaving.",
            "sent5": "The bond between siblings concerns their shared memories and experiences."
        },
        {
            "definition": "To be of interest or importance to; affect.",
            "pos": "verb",
            "sent1": "The new policy changes don't concern the old employees.",
            "sent2": "The weather forecast concerns the outdoor event planners.",
            "sent3": "It might concern you that the cat is plotting world domination.",
            "sent4": "The rising sea levels concern the coastal communities.",
            "sent5": "The mysterious lights in the sky concern the local residents."
        },
        {
            "definition": "A matter that causes worry or distress.",
            "pos": "noun",
            "sent1": "The health concern turned out to be a false alarm.",
            "sent2": "Financial concerns can keep you up at night.",
            "sent3": "The missing cake was a major concern at the party.",
            "sent4": "The looming deadline was a dark cloud of concern over the team.",
            "sent5": "The noise coming from the basement was a growing concern for the family."
        },
        {
            "definition": "Interest in or care for someone or something.",
            "pos": "noun",
            "sent1": "Her concern for the environment led her to volunteer at the park.",
            "sent2": "The teacher's concern for her students goes beyond the classroom.",
            "sent3": "The cat's concern for the mouse was surprisingly heartwarming.",
            "sent4": "His concern for his friend's well-being was evident in his actions.",
            "sent5": "The community's concern for the stray animals led to a successful adoption event."
        }
    ]
}