{
    "term": "concentration",
    "meanings": [
        {
            "definition": "The action or power of focusing one's attention or mental effort.",
            "pos": "noun",
            "sent1": "Her concentration during the test helped her answer all the questions correctly.",
            "sent2": "He needed to improve his concentration to finish the puzzle on time.",
            "sent3": "The magician's concentration was so strong that he made the rabbit disappear and reappear.",
            "sent4": "In a room full of noise, her concentration was a silent force that guided her through the chaos.",
            "sent5": "The athlete's concentration was like a laser beam, unwavering and precise."
        },
        {
            "definition": "The action or process of making a substance more intense, stronger, or purer.",
            "pos": "noun",
            "sent1": "The concentration of flavors in the soup made it incredibly delicious.",
            "sent2": "The concentration of chemicals in the solution needed to be precise for the experiment.",
            "sent3": "The concentration of sugar in the cake batter was so high that it turned out too sweet.",
            "sent4": "The concentration of stars in the night sky was breathtaking, like a galaxy painted above.",
            "sent5": "The concentration of colors in the painting created a vibrant and lively scene."
        },
        {
            "definition": "The proportion of a particular substance in a mixture or solution.",
            "pos": "noun",
            "sent1": "The concentration of salt in the ocean water varies from place to place.",
            "sent2": "The concentration of sugar in the drink was just right, not too sweet or bland.",
            "sent3": "The concentration of students in the library during finals week was a sight to behold.",
            "sent4": "The concentration of talent in the music industry is what makes it so competitive.",
            "sent5": "The concentration of passion in her voice made her speech truly inspiring."
        }
    ]
}