{
    "term": "concretion",
    "meanings": [
        {
            "definition": "A solid or compact mass formed by the accumulation or cohesion of particles.",
            "pos": "noun",
            "sent1": "The concretion of sand and cement created a strong foundation for the building.",
            "sent2": "The scientist studied the concretion of various elements to understand their properties.",
            "sent3": "The concretion of toys in the child's room made it difficult to walk without stepping on something.",
            "sent4": "Her love for him felt like a concretion of warmth and happiness in her heart.",
            "sent5": "The concretion of stars in the night sky was a breathtaking sight."
        },
        {
            "definition": "The process of becoming hard or solid by cooling or drying.",
            "pos": "noun",
            "sent1": "The concretion of the clay pots was evident after they were left out in the sun.",
            "sent2": "The concretion of the lava flow created a new rock formation.",
            "sent3": "The concretion of the ice cream in the freezer made it difficult to scoop out.",
            "sent4": "His determination was like a concretion, unwavering and strong.",
            "sent5": "The concretion of the wet paint on the canvas resulted in a beautiful masterpiece."
        },
        {
            "definition": "A rounded mass of mineral matter occurring in sedimentary rock.",
            "pos": "noun",
            "sent1": "The geologist found a concretion embedded in the sedimentary rock formation.",
            "sent2": "The concretion in the rock layer indicated a rich mineral deposit.",
            "sent3": "The concretion of fossils in the ancient rock layer fascinated the paleontologists.",
            "sent4": "The concretion of gems in the cave walls sparkled in the dim light.",
            "sent5": "The concretion of shells in the sandstone revealed the history of the coastal area."
        }
    ]
}