{
    "term": "condescendences",
    "meanings": [
        {
            "definition": "The act of condescending or behaving in a patronizing manner towards others.",
            "pos": "noun",
            "sent1": "Her constant condescendences towards her classmates made them feel small.",
            "sent2": "His condescendences towards the new employees were evident in his tone.",
            "sent3": "The teacher's condescendences were so exaggerated that they seemed like a comedy sketch.",
            "sent4": "The condescendences of the queen towards her subjects were like a dark cloud over the kingdom.",
            "sent5": "The memory of her condescendences lingered in the minds of all who witnessed them."
        },
        {
            "definition": "An instance of showing superiority or arrogance towards someone perceived as inferior.",
            "pos": "noun",
            "sent1": "The condescendences of the popular kids towards the nerds were hurtful.",
            "sent2": "She couldn't stand his condescendences whenever he spoke about his achievements.",
            "sent3": "His condescendences were so over-the-top that they became the talk of the town.",
            "sent4": "The condescendences of the wealthy towards the poor were like a gaping abyss between them.",
            "sent5": "The impact of his condescendences left a lasting mark on those who witnessed them."
        },
        {
            "definition": "Patronizing behavior or attitude.",
            "pos": "noun",
            "sent1": "Her condescendences were evident in the way she spoke down to others.",
            "sent2": "He couldn't hide his condescendences even when trying to be polite.",
            "sent3": "The condescendences of the celebrity were met with eye rolls from the audience.",
            "sent4": "The condescendences of the politician towards the public were like a slap in the face.",
            "sent5": "The room was filled with tension due to her condescendences towards the staff."
        }
    ]
}