{
    "term": "conditioner",
    "meanings": [
        {
            "definition": "A substance applied to hair to make it softer and smoother.",
            "pos": "noun",
            "sent1": "After using the conditioner, her hair felt silky and shiny.",
            "sent2": "She always makes sure to use conditioner after shampooing her hair.",
            "sent3": "The conditioner worked its magic, turning her hair into a waterfall of silk.",
            "sent4": "The conditioner was like a magic potion, transforming her dull hair into a glossy mane.",
            "sent5": "The conditioner was her secret weapon for achieving luscious locks."
        },
        {
            "definition": "A device that regulates the temperature and humidity in a room.",
            "pos": "noun",
            "sent1": "The air conditioner kept the room cool and comfortable during the hot summer.",
            "sent2": "Don't forget to adjust the conditioner to maintain a pleasant indoor climate.",
            "sent3": "The conditioner hummed softly, like a guardian angel controlling the room's atmosphere.",
            "sent4": "The conditioner was a silent hero, battling the heat and humidity to keep the room cozy.",
            "sent5": "The conditioner's gentle breeze was a welcome relief on a sweltering day."
        },
        {
            "definition": "A clause in a contract that specifies certain requirements or limitations.",
            "pos": "noun",
            "sent1": "Make sure to read the fine print including the conditioner about cancellation fees.",
            "sent2": "The contract had a strict conditioner regarding the use of company resources.",
            "sent3": "The conditioner in the agreement seemed like a sneaky rule hidden in plain sight.",
            "sent4": "The conditioner in the contract was a trap waiting to catch the unwary.",
            "sent5": "The conditioner in the document was a reminder of the boundaries set by the agreement."
        }
    ]
}