{
    "term": "confidence",
    "meanings": [
        {
            "definition": "The feeling or belief that one can rely on someone or something.",
            "pos": "noun",
            "sent1": "She had great confidence in her best friend to keep her secrets.",
            "sent2": "His confidence in the safety of the bridge helped him cross it without fear.",
            "sent3": "With confidence in her lucky charm, she entered the contest with a smile.",
            "sent4": "The old lighthouse stood tall, a beacon of confidence for sailors in the storm.",
            "sent5": "The coach's unwavering confidence in his team inspired them to victory."
        },
        {
            "definition": "A feeling of self-assurance arising from one's appreciation of one's own abilities or qualities.",
            "pos": "noun",
            "sent1": "His confidence in his painting skills led him to enter the art competition.",
            "sent2": "She walked onto the stage with confidence, ready to perform her solo.",
            "sent3": "The cat strutted around the room with confidence, as if it owned the place.",
            "sent4": "The tree stood tall and strong, exuding confidence in its place in the forest.",
            "sent5": "The student's confidence in her knowledge helped her ace the exam."
        },
        {
            "definition": "The state of feeling certain about the truth of something.",
            "pos": "noun",
            "sent1": "His confidence in the evidence presented made him believe in the suspect's guilt.",
            "sent2": "She spoke with confidence about the topic, showing her deep understanding.",
            "sent3": "The detective's confidence in his hunch led him to the missing treasure.",
            "sent4": "The scientist's confidence in her theory drove her to conduct more experiments.",
            "sent5": "The author's confidence in her story's message shone through in every chapter."
        }
    ]
}