{
    "term": "coning",
    "meanings": [
        {
            "definition": "The act of forming into a cone shape.",
            "pos": "noun",
            "sent1": "During the art class, the teacher demonstrated the coning of clay to create a vase.",
            "sent2": "The chef expertly performed the coning of the ice cream scoop onto the cone.",
            "sent3": "The coning of the sandcastle by the beach was a fun activity for the children.",
            "sent4": "The coning of the mountain peak against the sky was a majestic sight.",
            "sent5": "The coning of the paper into a hat made the origami project more interesting."
        },
        {
            "definition": "A type of traffic maneuver where a vehicle moves between lanes in a zigzag pattern.",
            "pos": "noun",
            "sent1": "The coning of cars during rush hour can lead to traffic jams.",
            "sent2": "The driver skillfully avoided an accident by coning through the lanes.",
            "sent3": "The coning of the vehicles on the highway looked like a synchronized dance.",
            "sent4": "The coning of cars in the city resembled a game of chess.",
            "sent5": "The coning of the buses during peak hours was chaotic yet organized."
        },
        {
            "definition": "A method of shaping ice cream into a cone.",
            "pos": "noun",
            "sent1": "The coning of the soft serve ice cream onto the cone was a delightful sight.",
            "sent2": "The coning of the chocolate syrup on top added a sweet touch to the ice cream cone.",
            "sent3": "The coning of the sprinkles on the ice cream cone made it look like a colorful masterpiece.",
            "sent4": "The coning of the whipped cream on the cone was the perfect finishing touch.",
            "sent5": "The coning of the cherry on top made the ice cream cone picture-perfect."
        },
        {
            "definition": "The process of creating a cone-shaped object.",
            "pos": "noun",
            "sent1": "The coning of the paper to make a party hat was a fun craft activity.",
            "sent2": "The coning of the fabric to form a cone shape required precise sewing skills.",
            "sent3": "The coning of the dough to make a cone for the ice cream was a tasty task.",
            "sent4": "The coning of the metal sheet to create a cone structure was a challenging project.",
            "sent5": "The coning of the cardboard to build a cone model was part of the science experiment."
        }
    ]
}