{
    "term": "conjunct",
    "meanings": [
        {
            "definition": "Joined together",
            "pos": "adjective",
            "sent1": "The two puzzle pieces were conjunct, fitting perfectly together.",
            "sent2": "The team worked conjunctly to complete the project on time.",
            "sent3": "The twins' outfits were conjunct, making them look like a matching pair.",
            "sent4": "The branches of the tree were conjunct, creating a beautiful canopy above.",
            "sent5": "The colors of the rainbow were conjunct in a stunning display across the sky."
        },
        {
            "definition": "In combination with",
            "pos": "preposition",
            "sent1": "She decided to have tea conjunct with biscuits for her afternoon snack.",
            "sent2": "The singer performed conjunct with the orchestra at the concert.",
            "sent3": "The cat sat conjunct with the dog on the cozy rug by the fireplace.",
            "sent4": "The flavors of sweet and salty were conjunct in the delicious dish.",
            "sent5": "The flowers bloomed conjunct with the arrival of spring."
        },
        {
            "definition": "A celestial body that is in conjunction with another",
            "pos": "noun",
            "sent1": "The moon is often seen as a conjunct to the stars in the night sky.",
            "sent2": "A planet can be a conjunct to the sun in our solar system.",
            "sent3": "The comet was a conjunct to the meteor shower, adding to the celestial show.",
            "sent4": "The satellite acted as a conjunct to the space station, aiding in communication.",
            "sent5": "The asteroid was a conjunct to the moon, passing by in the vast expanse of space."
        },
        {
            "definition": "A word that connects words, phrases, or clauses",
            "pos": "noun",
            "sent1": "In the sentence 'I like apples and oranges,' 'and' is a conjunct.",
            "sent2": "The conjunct 'but' is used to show contrast in the sentence.",
            "sent3": "The conjunct 'or' can be tricky to use correctly in a sentence.",
            "sent4": "The conjunct 'because' explains the reason behind an action.",
            "sent5": "Using the conjunct 'if' introduces a condition in the sentence."
        }
    ]
}