{
    "term": "conjuration",
    "meanings": [
        {
            "definition": "The act of calling upon or invoking a supernatural power.",
            "pos": "noun",
            "sent1": "During the conjuration, the wizard chanted ancient words to summon the spirits.",
            "sent2": "The witch's conjuration brought forth a powerful entity from another realm.",
            "sent3": "The children giggled as they pretended to perform a conjuration to make their toys come to life.",
            "sent4": "Her voice held a mystical quality as if each word was a conjuration of hidden forces.",
            "sent5": "The conjuration filled the room with an eerie energy, making everyone feel a presence."
        },
        {
            "definition": "A magic spell or incantation.",
            "pos": "noun",
            "sent1": "The old book contained a powerful conjuration that could control the elements.",
            "sent2": "The sorcerer whispered a conjuration to cast a protective barrier around the castle.",
            "sent3": "The magician's failed conjuration turned the rabbit into a hat instead of pulling it out.",
            "sent4": "Her eyes sparkled with the magic of her conjuration, captivating all who watched.",
            "sent5": "The conjuration echoed through the forest, causing leaves to dance and birds to sing along."
        },
        {
            "definition": "The act of summoning a spirit or demon.",
            "pos": "noun",
            "sent1": "The conjuration of the ghostly figure sent shivers down everyone's spine.",
            "sent2": "The ritual involved a complex conjuration to bring forth the ancient entity.",
            "sent3": "The mischievous child claimed to have mastered the art of conjuration to prank his friends.",
            "sent4": "The conjuration seemed to draw the spirit closer, its presence felt by all in the room.",
            "sent5": "The conjuration of the demon was a sight to behold, its form shifting and flickering in the candlelight."
        },
        {
            "definition": "The act of using magic or sorcery to achieve a desired outcome.",
            "pos": "noun",
            "sent1": "With a swift conjuration, the wizard transformed the toad into a prince.",
            "sent2": "The potion required a specific conjuration to activate its enchanting properties.",
            "sent3": "The conjuration of a sunny day seemed to work, as the clouds parted and the sun shone through.",
            "sent4": "Her wand flicked in a precise motion, casting a conjuration that altered reality itself.",
            "sent5": "The conjuration of the spell created a dazzling display of lights and colors, mesmerizing all who witnessed it."
        }
    ]
}