{
    "term": "connatural",
    "meanings": [
        {
            "definition": "Existing in a person or thing from birth; innate.",
            "pos": "adjective",
            "sent1": "Her connatural kindness shone through in every action she took.",
            "sent2": "The siblings had connatural talents for music, both playing the piano effortlessly.",
            "sent3": "It was connatural for the puppy to wag its tail happily when it saw its owner.",
            "sent4": "The connatural beauty of the sunset painted the sky in hues of pink and orange.",
            "sent5": "The connatural bond between the twins was evident in their synchronized movements."
        },
        {
            "definition": "Having the same nature or characteristics; similar in nature.",
            "pos": "adjective",
            "sent1": "Their connatural love for adventure led them to explore new places together.",
            "sent2": "The two friends had connatural tastes in movies, always enjoying the same genres.",
            "sent3": "It seemed connatural for the two old friends to finish each other's sentences.",
            "sent4": "The connatural rhythm of the dancers created a mesmerizing performance on stage.",
            "sent5": "The connatural patterns in the artwork reflected the artist's unique style."
        },
        {
            "definition": "Inborn; natural.",
            "pos": "adjective",
            "sent1": "His connatural ability to make people laugh made him the life of the party.",
            "sent2": "The athlete's connatural agility on the field impressed both teammates and opponents.",
            "sent3": "It was connatural for the baby to reach out for her mother's comforting embrace.",
            "sent4": "The connatural grace of the swan gliding on the lake captivated onlookers.",
            "sent5": "The connatural instincts of the wild animals guided them through the changing seasons."
        }
    ]
}