{
    "term": "connived",
    "meanings": [
        {
            "definition": "To secretly cooperate or conspire",
            "pos": "verb",
            "sent1": "The two friends connived to surprise their teacher with a birthday party.",
            "sent2": "The criminals connived to rob the bank under the cover of darkness.",
            "sent3": "The siblings connived to trick their parents into thinking they were studying when they were actually playing video games.",
            "sent4": "The evil sorcerer connived to overthrow the king and seize the throne for himself.",
            "sent5": "The cunning fox connived to outsmart the hunter and steal his catch."
        },
        {
            "definition": "To overlook or fail to take action against wrongdoing",
            "pos": "verb",
            "sent1": "The corrupt official connived with the criminals to allow illegal activities to continue unchecked.",
            "sent2": "The lazy supervisor connived at the employee's constant tardiness, causing resentment among the team.",
            "sent3": "The mischievous cat connived at the dog's attempts to steal treats from the pantry.",
            "sent4": "The negligent landlord connived at the deteriorating conditions of the rental property, ignoring tenant complaints.",
            "sent5": "The apathetic teacher connived at the students' cheating during the exam, undermining academic integrity."
        },
        {
            "definition": "To scheme or plot in secret",
            "pos": "verb",
            "sent1": "The villain connived to frame the hero for a crime he didn't commit.",
            "sent2": "The ambitious assistant connived to undermine her colleague's position in the company.",
            "sent3": "The sneaky raccoon connived to steal food from the campers' picnic basket.",
            "sent4": "The rival spy connived to intercept the confidential information before it reached the intended recipient.",
            "sent5": "The cunning mastermind connived to outwit his opponents in the high-stakes game of strategy."
        }
    ]
}