{
    "term": "connubialities",
    "meanings": [
        {
            "definition": "The state or quality of being married or united in marriage.",
            "pos": "noun",
            "sent1": "Their connubialities were evident in the way they always supported each other.",
            "sent2": "The connubialities of the couple were evident in their shared laughter and joy.",
            "sent3": "The connubialities of the newlyweds were on full display during the dance at their wedding.",
            "sent4": "Their connubialities shone brightly like a beacon of love in a world of darkness.",
            "sent5": "The connubialities between them were like a beautiful melody, harmonious and sweet."
        },
        {
            "definition": "The rights and responsibilities of married life.",
            "pos": "noun",
            "sent1": "They both understood the connubialities that came with their marriage.",
            "sent2": "The connubialities of marriage include mutual respect and support.",
            "sent3": "The connubialities of sharing household chores can sometimes lead to funny misunderstandings.",
            "sent4": "The connubialities of marriage are like a delicate dance, requiring balance and coordination.",
            "sent5": "Understanding the connubialities of marriage is essential for a strong and lasting relationship."
        },
        {
            "definition": "The customs or rituals associated with marriage.",
            "pos": "noun",
            "sent1": "The connubialities of their culture included a traditional wedding ceremony.",
            "sent2": "Learning about the connubialities of different cultures can be fascinating.",
            "sent3": "The connubialities of marriage customs can vary greatly from one region to another.",
            "sent4": "The connubialities of marriage rituals symbolize the bond between two people.",
            "sent5": "Participating in the connubialities of a traditional wedding was a memorable experience."
        }
    ]
}