{
    "term": "conspiratorial",
    "meanings": [
        {
            "definition": "Relating to or characteristic of a conspiracy.",
            "pos": "adjective",
            "sent1": "The group's behavior had a conspiratorial tone, making everyone suspicious.",
            "sent2": "The detective's conspiratorial look hinted at a hidden plan.",
            "sent3": "The cat's conspiratorial meows made the owner wonder if it was plotting something.",
            "sent4": "The dark alley had a conspiratorial atmosphere, as if secrets were being whispered.",
            "sent5": "Her conspiratorial smile revealed her involvement in the scheme."
        },
        {
            "definition": "Involving or suggesting a conspiracy.",
            "pos": "adjective",
            "sent1": "The mysterious package had a conspiratorial aura, raising doubts among the neighbors.",
            "sent2": "The phone call had a conspiratorial undertone, hinting at hidden motives.",
            "sent3": "The squirrel's behavior seemed conspiratorial, as if it was planning a nut heist.",
            "sent4": "The old book exuded a conspiratorial vibe, as if it held ancient secrets.",
            "sent5": "The meeting had a conspiratorial air, making everyone uneasy."
        },
        {
            "definition": "Inclined to engage in or promote conspiracy theories.",
            "pos": "adjective",
            "sent1": "The man's conspiratorial nature led him to believe in various outlandish theories.",
            "sent2": "Her conspiratorial mindset made her see hidden agendas everywhere.",
            "sent3": "The dog's behavior was so conspiratorial that it seemed to believe in dog treat conspiracies.",
            "sent4": "The politician's speech had a conspiratorial edge, appealing to those who believed in secret plots.",
            "sent5": "The website's conspiratorial content attracted a niche audience fascinated by hidden schemes."
        }
    ]
}