{
    "term": "consecrative",
    "meanings": [
        {
            "definition": "Making or declaring something sacred or holy.",
            "pos": "verb",
            "sent1": "The priest consecrated the new church with a consecrative ceremony.",
            "sent2": "The religious leader consecrated the sacred ground with a consecrative ritual.",
            "sent3": "The children playfully pretended to consecrate their secret hideout with a consecrative dance.",
            "sent4": "Her words had a consecrative effect on the audience, making them feel a sense of reverence.",
            "sent5": "The ancient ritual was so consecrative that it left a lasting impression on all who witnessed it."
        },
        {
            "definition": "Serving to consecrate or dedicate.",
            "pos": "adjective",
            "sent1": "The consecrative ceremony marked the beginning of a new chapter for the community.",
            "sent2": "The consecrative plaque was placed on the building to honor its historical significance.",
            "sent3": "The consecrative cake for the celebration was decorated with intricate designs.",
            "sent4": "Her consecrative speech inspired everyone to work towards a common goal.",
            "sent5": "The consecrative act of planting a tree symbolized growth and renewal for the town."
        },
        {
            "definition": "Involving or relating to the act of consecrating.",
            "pos": "adjective",
            "sent1": "The consecrative process required careful planning and preparation.",
            "sent2": "The consecrative items used in the ceremony were of great importance.",
            "sent3": "The consecrative attire worn by the priest was elaborate and ornate.",
            "sent4": "The consecrative music played during the event added a sense of solemnity.",
            "sent5": "The consecrative symbols used in the ritual held deep spiritual significance."
        }
    ]
}