{
    "term": "constricting",
    "meanings": [
        {
            "definition": "To make narrower or tighter",
            "pos": "verb",
            "sent1": "She was constricting the balloon by squeezing it tightly.",
            "sent2": "The snake was constricting its prey before swallowing it whole.",
            "sent3": "The constricting hug from her friend made her laugh.",
            "sent4": "His fear was constricting his ability to think clearly.",
            "sent5": "The constricting grip of anxiety was suffocating her."
        },
        {
            "definition": "To limit or restrict",
            "pos": "verb",
            "sent1": "The new rules were constricting our freedom to choose.",
            "sent2": "The tight deadline was constricting our ability to innovate.",
            "sent3": "The constricting budget forced us to get creative with our spending.",
            "sent4": "Her overprotective nature was constricting his independence.",
            "sent5": "The constricting regulations made it hard for small businesses to thrive."
        },
        {
            "definition": "Tightening or squeezing",
            "pos": "verb",
            "sent1": "He was constricting his muscles to lift the heavy weight.",
            "sent2": "The constricting feeling in his chest made him gasp for air.",
            "sent3": "The constricting grip of the vice made it hard to open the jar.",
            "sent4": "The constricting pain in his leg made it difficult to walk.",
            "sent5": "The constricting sensation in her throat made her swallow hard."
        },
        {
            "definition": "Restricting or limiting movement",
            "pos": "adjective",
            "sent1": "The constricting pants were uncomfortable to wear.",
            "sent2": "The constricting ropes prevented her from escaping.",
            "sent3": "The constricting seatbelt felt like a hug from a robot.",
            "sent4": "The constricting crowd made it hard to move through the room.",
            "sent5": "The constricting bandage helped support his injured arm."
        }
    ]
}