{
    "term": "consul",
    "meanings": [
        {
            "definition": "An official appointed by a government to live in a foreign city and protect the government's citizens and interests there.",
            "pos": "noun",
            "sent1": "The consul helped the citizens of his country in a faraway land.",
            "sent2": "The consul represented his government in a foreign city.",
            "sent3": "The consul made sure his fellow citizens were safe and sound in a distant place.",
            "sent4": "The consul was like a guardian angel for his people abroad.",
            "sent5": "The consul's duty was to watch over his country's interests in a foreign land."
        },
        {
            "definition": "A government official who works to promote the interests of their country in a foreign city.",
            "pos": "noun",
            "sent1": "The consul worked hard to advance his nation's goals in another country.",
            "sent2": "The consul was dedicated to representing his country's interests abroad.",
            "sent3": "The consul was like a cheerleader for his nation in a distant city.",
            "sent4": "The consul's job was to be a strong advocate for his country in foreign lands.",
            "sent5": "The consul tirelessly promoted his homeland's interests in a foreign city."
        },
        {
            "definition": "A person who is appointed by a government to live in a foreign city and protect the government's citizens and interests there.",
            "pos": "noun",
            "sent1": "The consul was chosen by the government to safeguard their people in a distant place.",
            "sent2": "The consul was a representative of his government in a foreign city.",
            "sent3": "The consul made sure his fellow citizens were well taken care of in a far-off land.",
            "sent4": "The consul was like a shield for his countrymen living abroad.",
            "sent5": "The consul's role was to ensure the well-being of his nation's citizens in a foreign city."
        }
    ]
}