{
    "term": "constitutively",
    "meanings": [
        {
            "definition": "In a way that is inherent or essential to the nature of something.",
            "pos": "adverb",
            "sent1": "The plant's leaves constitutively turn towards the sun for optimal light.",
            "sent2": "The river flows constitutively from the mountains to the sea.",
            "sent3": "The clock constitutively ticked away, reminding everyone of the passing time.",
            "sent4": "Her smile was like a constitutively blooming flower, brightening up the room.",
            "sent5": "The sound of laughter constitutively filled the air, creating a joyful atmosphere."
        },
        {
            "definition": "In a manner that is always present or active.",
            "pos": "adverb",
            "sent1": "The security cameras are constitutively monitoring the premises.",
            "sent2": "The streetlights constitutively illuminate the road at night.",
            "sent3": "The cat constitutively chased after the laser pointer, never tiring of the game.",
            "sent4": "His enthusiasm was like a constitutively burning flame, never dimming.",
            "sent5": "The waves constitutively crashed against the shore, a constant rhythm of nature."
        },
        {
            "definition": "In a manner that is regulated by a constitution or governing document.",
            "pos": "adverb",
            "sent1": "The organization constitutively follows the rules outlined in its charter.",
            "sent2": "The country's laws are constitutively based on the principles of its constitution.",
            "sent3": "The students constitutively referred to the school handbook for guidance.",
            "sent4": "Her actions were like a constitutively ticking clock, always in accordance with the law.",
            "sent5": "The team constitutively abided by the regulations, ensuring fair play in the game."
        }
    ]
}