{
    "term": "consanguinities",
    "meanings": [
        {
            "definition": "The quality of being descended from the same ancestor.",
            "pos": "noun",
            "sent1": "The consanguinities among the siblings were evident in their shared traits.",
            "sent2": "The consanguinities between the cousins were traced back to their grandparents.",
            "sent3": "The consanguinities in the family tree made for interesting conversations during reunions.",
            "sent4": "The consanguinities in their bloodline were like intertwined branches of a family tree.",
            "sent5": "The consanguinities between the twins were so strong that they often finished each other's sentences."
        },
        {
            "definition": "Blood relationship.",
            "pos": "noun",
            "sent1": "The consanguinities between the siblings were evident in their physical resemblance.",
            "sent2": "The consanguinities in the family were celebrated during the annual reunion.",
            "sent3": "The consanguinities in their bloodline made for a unique family bond.",
            "sent4": "The consanguinities between them ran deep, connecting them through generations.",
            "sent5": "The consanguinities among the relatives were clear from the shared family traditions."
        },
        {
            "definition": "A close relationship or connection.",
            "pos": "noun",
            "sent1": "The consanguinities between the friends were strengthened through years of shared experiences.",
            "sent2": "The consanguinities in their friendship were evident in their unwavering support for each other.",
            "sent3": "The consanguinities between them led to many inside jokes and shared memories.",
            "sent4": "The consanguinities in their bond were like a strong thread weaving them together.",
            "sent5": "The consanguinities between the colleagues made for a harmonious work environment."
        }
    ]
}