{
    "term": "consults",
    "meanings": [
        {
            "definition": "Seek information or advice from (someone) with expertise in a particular area.",
            "pos": "verb",
            "sent1": "She consults her teacher for help with difficult math problems.",
            "sent2": "He consults his doctor before starting any new medication.",
            "sent3": "The detective consults the wise old owl for clues to solve the mystery.",
            "sent4": "In times of uncertainty, she consults her inner compass for guidance.",
            "sent5": "The explorer consults the ancient map to navigate through the treacherous terrain."
        },
        {
            "definition": "Have a discussion or conference with (someone) in order to get their opinion or advice.",
            "pos": "verb",
            "sent1": "The team consults with the coach to strategize for the upcoming game.",
            "sent2": "Before making a decision, he consults with his colleagues to gather different perspectives.",
            "sent3": "The penguins consult with each other on the best fishing spots in the icy waters.",
            "sent4": "In the boardroom, the CEO consults with the executives to plan the company's future.",
            "sent5": "The students consult with the librarian to find the right books for their research project."
        },
        {
            "definition": "Refer to (a book, map, etc.) for information.",
            "pos": "verb",
            "sent1": "When writing the essay, she consults various sources to gather relevant data.",
            "sent2": "Before the trip, he consults the travel guide to learn about local customs.",
            "sent3": "The chef consults the recipe book to ensure the correct measurements for the dish.",
            "sent4": "In the library, the student consults the encyclopedia for historical facts.",
            "sent5": "The hiker consults the trail map to find the best route through the forest."
        }
    ]
}