{
    "term": "constringent",
    "meanings": [
        {
            "definition": "Causing contraction or constriction",
            "pos": "adjective",
            "sent1": "The cold water had a constringent effect on the muscles, making them tighten.",
            "sent2": "The constringent medicine helped reduce the swelling in her ankle.",
            "sent3": "The constringent rubber band refused to stretch any further, much to the frustration of the child trying to make a slingshot.",
            "sent4": "His constringent grip on the steering wheel showed his nervousness during the driving test.",
            "sent5": "The constringent embrace of the cold wind made her shiver uncontrollably."
        },
        {
            "definition": "Having astringent properties",
            "pos": "adjective",
            "sent1": "The constringent lotion helped clear up her acne by drying out the pimples.",
            "sent2": "She used a constringent toner to tighten her pores and reduce oiliness on her face.",
            "sent3": "The constringent taste of the bitter medicine made her grimace in disgust.",
            "sent4": "His constringent criticism left her feeling deflated and insecure.",
            "sent5": "The constringent smell of the cleaning solution made her eyes water as she scrubbed the floors."
        },
        {
            "definition": "A substance that causes contraction or constriction",
            "pos": "noun",
            "sent1": "The herbalist recommended a constringent to help with the patient's blood circulation.",
            "sent2": "The constringent in the ointment helped stop the bleeding from the small cut.",
            "sent3": "The constringent was added to the formula to give the lotion its tightening effect.",
            "sent4": "She always kept a constringent in her first aid kit for emergencies.",
            "sent5": "The constringent was a key ingredient in the potion that would shrink the giant's swollen foot."
        }
    ]
}