{
    "term": "constitution",
    "meanings": [
        {
            "definition": "The fundamental principles or established precedents according to which a state or other organization is governed.",
            "pos": "noun",
            "sent1": "The school's constitution outlines the rules and guidelines for student behavior.",
            "sent2": "The country's constitution guarantees the rights of its citizens.",
            "sent3": "It would be chaotic if there was no constitution to guide us in making decisions.",
            "sent4": "In a way, our family's traditions serve as our own mini-constitution.",
            "sent5": "Learning about the constitution helps us understand how our government works."
        },
        {
            "definition": "The physical makeup of a person or thing, especially with regard to the size, shape, and arrangement of its parts.",
            "pos": "noun",
            "sent1": "The constitution of the new building allows for plenty of natural light.",
            "sent2": "His constitution is strong, allowing him to endure long hours of physical labor.",
            "sent3": "Despite its small constitution, the tiny plant grew into a beautiful flower.",
            "sent4": "The constitution of the puzzle pieces made it challenging to put together.",
            "sent5": "The constitution of the recipe called for fresh ingredients to taste the best."
        },
        {
            "definition": "The act of forming or establishing something.",
            "pos": "noun",
            "sent1": "The constitution of the club was a collaborative effort among its founding members.",
            "sent2": "The constitution of a new company requires careful planning and legal documentation.",
            "sent3": "The constitution of a friendship often starts with a shared interest.",
            "sent4": "The constitution of a successful business includes a clear mission and vision.",
            "sent5": "The constitution of a habit takes time and dedication to establish."
        }
    ]
}