{
    "term": "consignation",
    "meanings": [
        {
            "definition": "The act of consigning or delivering something for preservation or safekeeping.",
            "pos": "noun",
            "sent1": "The consignation of valuable documents to the bank vault ensured their safety.",
            "sent2": "The consignation of the family heirlooms to the museum was a wise decision.",
            "sent3": "The consignation of the cookies in the jar led to a mysterious disappearance.",
            "sent4": "Her consignation of memories in her diary kept them safe from forgetfulness.",
            "sent5": "The consignation of secrets in the locked box was a symbol of trust."
        },
        {
            "definition": "The act of assigning or entrusting something to a particular person or group.",
            "pos": "noun",
            "sent1": "The consignation of the task to the most capable team member ensured its success.",
            "sent2": "His consignation of the responsibility to his assistant lightened his workload.",
            "sent3": "The consignation of the class pet to the students brought joy to the classroom.",
            "sent4": "Her consignation of the leadership role to her friend showed her trust in them.",
            "sent5": "The consignation of the treasure map to the young explorer sparked excitement."
        },
        {
            "definition": "The act of marking or designating something for a specific purpose or destination.",
            "pos": "noun",
            "sent1": "The consignation of the boxes with labels made the moving process easier.",
            "sent2": "His consignation of the tools to the designated area kept the workshop organized.",
            "sent3": "The consignation of the plants with colorful tags added a touch of creativity to the garden.",
            "sent4": "Her consignation of the books to different shelves created a sense of order in the library.",
            "sent5": "The consignation of the packages with special stickers ensured they reached the right recipients."
        }
    ]
}