{
    "term": "contemptibleness",
    "meanings": [
        {
            "definition": "Deserving of scorn or disdain.",
            "pos": "adjective",
            "sent1": "The bully's contemptibleness towards others made him unpopular.",
            "sent2": "Her contemptibleness behavior towards her classmates was unacceptable.",
            "sent3": "The cat's contemptibleness towards the mouse was evident in its playful pouncing.",
            "sent4": "The storm's contemptibleness towards the fragile umbrella left it in tatters.",
            "sent5": "The teacher's contemptibleness for cheating students was well-known among the students."
        },
        {
            "definition": "The quality of being worthy of contempt.",
            "pos": "noun",
            "sent1": "The criminal's contemptibleness was evident in his disregard for the law.",
            "sent2": "The politician's actions displayed a level of contemptibleness that shocked the public.",
            "sent3": "The movie's humor relied on the contemptibleness of the main character's antics.",
            "sent4": "The old building's contemptibleness was a stark reminder of neglect and decay.",
            "sent5": "The company's contemptibleness towards customer complaints led to a decline in sales."
        },
        {
            "definition": "Showing a lack of respect or reverence.",
            "pos": "adjective",
            "sent1": "His contemptibleness attitude towards authority figures often got him into trouble.",
            "sent2": "The student's contemptibleness behavior in class disrupted the learning environment.",
            "sent3": "The puppy's contemptibleness towards the 'no chewing' rule was evident in the chewed-up shoes.",
            "sent4": "The artist's contemptibleness approach to traditional art forms challenged societal norms.",
            "sent5": "The guest's contemptibleness behavior at the party offended the host and other attendees."
        }
    ]
}