{
    "term": "controlling",
    "meanings": [
        {
            "definition": "To exercise authority or influence over",
            "pos": "verb",
            "sent1": "The teacher was controlling the class during the lesson.",
            "sent2": "She is controlling the remote to change the channel.",
            "sent3": "The cat was controlling the toy mouse, making it move around.",
            "sent4": "The wind was controlling the direction of the kite in the sky.",
            "sent5": "The conductor was controlling the tempo of the music with his baton."
        },
        {
            "definition": "To regulate or manage",
            "pos": "verb",
            "sent1": "He is controlling the temperature of the oven while baking.",
            "sent2": "The thermostat is controlling the heating system in the house.",
            "sent3": "The farmer was controlling the water flow to the crops in the field.",
            "sent4": "The traffic lights are controlling the flow of cars on the road.",
            "sent5": "The nurse is controlling the dosage of medicine for the patient."
        },
        {
            "definition": "To hold back or limit",
            "pos": "verb",
            "sent1": "She was controlling her laughter during the serious meeting.",
            "sent2": "The dam is controlling the water level in the river.",
            "sent3": "The parent was controlling the urge to eat the last cookie.",
            "sent4": "The gate is controlling access to the private garden.",
            "sent5": "The referee is controlling the players' behavior during the game."
        },
        {
            "definition": "To dominate or command",
            "pos": "verb",
            "sent1": "The dictator was controlling the entire country with fear.",
            "sent2": "The queen bee is controlling the hive and its workers.",
            "sent3": "The evil villain was controlling the minds of innocent people.",
            "sent4": "The hypnotist is controlling the actions of the volunteer on stage.",
            "sent5": "The puppeteer is controlling the movements of the puppet with strings."
        }
    ]
}