{
    "term": "contrives",
    "meanings": [
        {
            "definition": "To plan or scheme",
            "pos": "verb",
            "sent1": "She contrives a surprise party for her best friend.",
            "sent2": "He contrives a way to sneak past the guard.",
            "sent3": "The clever fox contrives a plan to outsmart the farmer.",
            "sent4": "The villain contrives a devious plot to take over the city.",
            "sent5": "The detective contrives a strategy to catch the thief red-handed."
        },
        {
            "definition": "To bring about by skill or cleverness",
            "pos": "verb",
            "sent1": "The chef contrives a delicious recipe using fresh ingredients.",
            "sent2": "She contrives a solution to the complex puzzle.",
            "sent3": "The magician contrives a trick to amaze the audience.",
            "sent4": "The artist contrives a masterpiece with intricate details.",
            "sent5": "The engineer contrives a new design for the bridge."
        },
        {
            "definition": "To invent or devise",
            "pos": "verb",
            "sent1": "He contrives a new gadget to make life easier.",
            "sent2": "She contrives a creative story for the children.",
            "sent3": "The scientist contrives an experiment to test the hypothesis.",
            "sent4": "The inventor contrives a groundbreaking invention that changes the world.",
            "sent5": "The writer contrives a compelling plot for the novel."
        },
        {
            "definition": "To manage or manipulate",
            "pos": "verb",
            "sent1": "The manager contrives the schedule to accommodate everyone.",
            "sent2": "She contrives the situation to her advantage.",
            "sent3": "The politician contrives his speech to win over the voters.",
            "sent4": "The coach contrives the game plan to secure victory.",
            "sent5": "The leader contrives the negotiations to reach a peaceful resolution."
        },
        {
            "definition": "To plot or scheme",
            "pos": "verb",
            "sent1": "The conspirators contrive a plan to overthrow the king.",
            "sent2": "She contrives a way to get revenge on her rival.",
            "sent3": "The spy contrives a secret mission to gather intel.",
            "sent4": "The criminals contrive an elaborate heist to steal the jewels.",
            "sent5": "The rebels contrive a strategy to outwit the enemy forces."
        }
    ]
}