{
    "term": "controversialists",
    "meanings": [
        {
            "definition": "People who engage in controversial discussions or debates.",
            "pos": "noun",
            "sent1": "The controversialists at the debate club always had strong opinions.",
            "sent2": "The controversialists in the group never shied away from expressing their views.",
            "sent3": "The lively discussions among the controversialists often led to heated arguments.",
            "sent4": "In the world of academia, the controversialists are like intellectual gladiators.",
            "sent5": "The controversialists' debates were so intense, they could be heard from across the hall."
        },
        {
            "definition": "Those who provoke controversy or disagreement.",
            "pos": "noun",
            "sent1": "The controversialists' bold statements always stirred up trouble.",
            "sent2": "The controversialists' remarks sparked a heated debate among the group.",
            "sent3": "At the family dinner, Uncle Joe was the designated controversialist, always starting arguments.",
            "sent4": "Her words acted as a catalyst, turning her into a controversialist overnight.",
            "sent5": "The controversialists' presence was like a storm brewing in the calm sea of opinions."
        },
        {
            "definition": "Individuals who are known for their controversial opinions or viewpoints.",
            "pos": "noun",
            "sent1": "The controversialists' unconventional ideas often challenged societal norms.",
            "sent2": "The controversialists' views were always met with mixed reactions.",
            "sent3": "Despite being labeled as controversialists, they never backed down from their beliefs.",
            "sent4": "Her reputation as a controversialist preceded her wherever she went.",
            "sent5": "The controversialists' words were like sparks igniting a fire of debate."
        }
    ]
}