{
    "term": "contain",
    "meanings": [
        {
            "definition": "To hold or have within",
            "pos": "verb",
            "sent1": "The box can contain all the toys.",
            "sent2": "The jar contains candies for the party.",
            "sent3": "I tried to contain my excitement, but I couldn't help jumping up and down.",
            "sent4": "Her heart seemed to contain an endless amount of love for everyone she met.",
            "sent5": "The dam struggled to contain the raging river, but eventually, it burst."
        },
        {
            "definition": "To include as a part of a whole",
            "pos": "verb",
            "sent1": "The book will contain all the information you need.",
            "sent2": "The recipe contains a secret ingredient that makes it special.",
            "sent3": "The surprise party will contain all our friends to celebrate together.",
            "sent4": "His speech contained wise advice that everyone should follow.",
            "sent5": "The treasure chest will contain riches beyond imagination."
        },
        {
            "definition": "To control or restrain",
            "pos": "verb",
            "sent1": "She struggled to contain her laughter during the serious meeting.",
            "sent2": "It's important to contain your anger and think before reacting.",
            "sent3": "The comedian couldn't contain his jokes and made everyone burst into laughter.",
            "sent4": "The teacher tried to contain the noisy classroom by using a bell.",
            "sent5": "The superhero had to contain the villain's destructive powers to save the city."
        },
        {
            "definition": "To be capable of holding or storing",
            "pos": "verb",
            "sent1": "The container can contain all the water we need for the trip.",
            "sent2": "The warehouse contains a variety of products ready for shipment.",
            "sent3": "The fridge couldn't contain all the groceries, so we had to get a bigger one.",
            "sent4": "The bag was able to contain all the books she needed for school.",
            "sent5": "The memory card can contain thousands of photos from your vacation."
        }
    ]
}