{
    "term": "contretemps",
    "meanings": [
        {
            "definition": "An inopportune or embarrassing situation.",
            "pos": "noun",
            "sent1": "During the meeting, a contretemps occurred when the boss spilled coffee on his shirt.",
            "sent2": "The party was going smoothly until a contretemps arose over the seating arrangements.",
            "sent3": "The contretemps at the party made everyone laugh as the cake ended up on the floor.",
            "sent4": "The contretemps at the wedding was like a dark cloud overshadowing the joyous occasion.",
            "sent5": "The contretemps at the airport made the traveler miss their flight, causing frustration."
        },
        {
            "definition": "A minor dispute or disagreement.",
            "pos": "noun",
            "sent1": "The siblings often have contretemps over who gets to use the TV first.",
            "sent2": "Their contretemps about which movie to watch was quickly resolved with a compromise.",
            "sent3": "The contretemps between the friends was settled with a friendly game of rock-paper-scissors.",
            "sent4": "Their contretemps was like a small bump in the road of their otherwise smooth friendship.",
            "sent5": "The contretemps between the students was forgotten after a heartfelt apology."
        },
        {
            "definition": "A mishap or unfortunate incident.",
            "pos": "noun",
            "sent1": "The contretemps with the cake happened when the cat knocked it off the table.",
            "sent2": "She had a contretemps with her umbrella turning inside out in the strong wind.",
            "sent3": "The contretemps with the spilled milk led to a slippery kitchen floor.",
            "sent4": "The contretemps with the broken shoelace delayed his morning jog.",
            "sent5": "The contretemps with the lost keys caused a frantic search around the house."
        }
    ]
}