{
    "term": "continences",
    "meanings": [
        {
            "definition": "The ability to control one's actions, emotions, or desires.",
            "pos": "noun",
            "sent1": "Her continences helped her resist the temptation to eat the entire cake.",
            "sent2": "He showed great continences by remaining calm during the stressful situation.",
            "sent3": "His continences were put to the test when faced with a room full of tempting treats.",
            "sent4": "The athlete's continences on the field were like a shield against distractions.",
            "sent5": "The teacher praised the student for his exceptional continences in following the rules."
        },
        {
            "definition": "Self-restraint or moderation in behavior.",
            "pos": "noun",
            "sent1": "Practicing continences in spending helped her save money for the future.",
            "sent2": "His continences in speaking ensured he did not say anything hurtful in the argument.",
            "sent3": "The comedian's continences in not laughing at his own jokes made the audience laugh even more.",
            "sent4": "Her continences in managing time were like a well-oiled machine.",
            "sent5": "The monk's continences in fasting were a display of his dedication to his beliefs."
        },
        {
            "definition": "The act of refraining from indulging in something.",
            "pos": "noun",
            "sent1": "Her continences in avoiding sweets helped her maintain a healthy diet.",
            "sent2": "He showed continences by not giving in to the urge to check his phone during the meeting.",
            "sent3": "The dog's continences in not chasing the squirrel surprised everyone in the park.",
            "sent4": "His continences in not buying unnecessary items saved him a lot of money.",
            "sent5": "The artist's continences in not revealing the painting until it was finished built up anticipation."
        }
    ]
}