{
    "term": "contemporary",
    "meanings": [
        {
            "definition": "Belonging to the same time period.",
            "pos": "adjective",
            "sent1": "The painting had a contemporary style, fitting in perfectly with the other artworks from the same era.",
            "sent2": "The historian studied contemporary documents to understand the events of that time.",
            "sent3": "It was amusing to see the contemporary fashion trends making a comeback.",
            "sent4": "The contemporary music scene is a melting pot of different genres and influences.",
            "sent5": "The contemporary architecture of the building stood out among the older structures."
        },
        {
            "definition": "A person living or existing at the same time as another.",
            "pos": "noun",
            "sent1": "My neighbor is a contemporary of mine, always sharing stories from our childhood.",
            "sent2": "The artist found inspiration in the works of his contemporaries.",
            "sent3": "It was funny to think that my pet turtle could be considered a contemporary of the dinosaurs.",
            "sent4": "In the bustling city, everyone seemed like a contemporary, rushing to their destinations.",
            "sent5": "The author dedicated her book to her contemporaries who supported her throughout her career."
        },
        {
            "definition": "Modern or current in style or design.",
            "pos": "adjective",
            "sent1": "The contemporary furniture in the room gave it a sleek and modern look.",
            "sent2": "The fashion designer showcased her contemporary collection at the fashion show.",
            "sent3": "It was amusing to see the old car transformed into a contemporary vehicle with new features.",
            "sent4": "Her ideas were as contemporary as they were innovative, pushing the boundaries of traditional thinking.",
            "sent5": "The contemporary art exhibition drew a diverse crowd of art enthusiasts."
        }
    ]
}