{
    "term": "contemptuousnesses",
    "meanings": [
        {
            "definition": "The state of feeling or showing contempt.",
            "pos": "noun",
            "sent1": "Her contemptuousnesses towards her classmates were evident in her sneering remarks.",
            "sent2": "His contemptuousnesses for authority figures often got him into trouble.",
            "sent3": "The cat's contemptuousnesses towards the dog made for a comical rivalry.",
            "sent4": "The storm clouds gathered with a palpable contemptuousnesses, ready to unleash their fury.",
            "sent5": "The teacher's contemptuousnesses of laziness made the students work harder to impress her."
        },
        {
            "definition": "The quality of being contemptuous.",
            "pos": "noun",
            "sent1": "The movie villain's contemptuousnesses added depth to his character.",
            "sent2": "Her speech was filled with contemptuousnesses towards those who had wronged her.",
            "sent3": "The puppy's playful contemptuousnesses towards the vacuum cleaner provided entertainment for the family.",
            "sent4": "The old house exuded a sense of contemptuousnesses towards modern architecture.",
            "sent5": "The artist captured the essence of contemptuousnesses in his painting of a scornful queen."
        },
        {
            "definition": "A feeling or attitude of contempt.",
            "pos": "noun",
            "sent1": "His contemptuousnesses towards dishonesty made him a trustworthy friend.",
            "sent2": "The politician's contemptuousnesses towards his opponents were evident in his speeches.",
            "sent3": "The child's contemptuousnesses towards vegetables made dinnertime a challenge for the parents.",
            "sent4": "The mountain stood tall with a sense of contemptuousnesses towards the valley below.",
            "sent5": "The detective's contemptuousnesses of corruption drove him to seek justice for the victims."
        }
    ]
}