{
    "term": "contracture",
    "meanings": [
        {
            "definition": "A condition in which a muscle becomes permanently shortened and tight",
            "pos": "noun",
            "sent1": "After his injury, he developed a contracture in his leg, making it difficult to walk.",
            "sent2": "The physical therapist worked to prevent contracture in the patient's arm after surgery.",
            "sent3": "The stubborn knot in the rope seemed to have a contracture of its own, refusing to untangle.",
            "sent4": "The city's traffic congestion had a contracture effect on the flow of vehicles, causing delays.",
            "sent5": "The old bridge showed signs of contracture, with its cables pulling tightly against the weight of passing cars."
        },
        {
            "definition": "The process of becoming contracted or shortened",
            "pos": "noun",
            "sent1": "Over time, the gradual contracture of the rubber band caused it to lose elasticity.",
            "sent2": "The contracture of the metal rod made it challenging to bend back into shape.",
            "sent3": "The contracture of the balloon as it deflated created a funny squeaking sound.",
            "sent4": "The contracture of the tree branches in winter resembled a frozen dance in the wind.",
            "sent5": "The contracture of the fabric under tension showed the strength of the material."
        },
        {
            "definition": "A medical condition characterized by the shortening or hardening of muscles, tendons, or other tissues",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with a severe contracture in her hand, requiring treatment.",
            "sent2": "Athletes need to be cautious of developing contracture due to intense training.",
            "sent3": "The garden hose had a strange contracture, making it difficult to coil up neatly.",
            "sent4": "The contracture of the clay sculpture gave it a unique, twisted appearance.",
            "sent5": "The contracture of the rubber band showed signs of wear and tear from repeated use."
        }
    ]
}