{
    "term": "containerboard",
    "meanings": [
        {
            "definition": "A type of paperboard used for making containers.",
            "pos": "noun",
            "sent1": "The containerboard was sturdy and perfect for crafting boxes.",
            "sent2": "The factory ordered a large shipment of containerboard for packaging purposes.",
            "sent3": "When the magician pulled a rabbit out of the containerboard, the audience gasped in surprise.",
            "sent4": "Her mind was a containerboard of memories, neatly stacked and stored away.",
            "sent5": "The children used colorful containerboard to create imaginative forts in the backyard."
        },
        {
            "definition": "The material used to create boxes and packaging.",
            "pos": "noun",
            "sent1": "We need more containerboard to finish assembling the boxes for shipping.",
            "sent2": "The company invested in high-quality containerboard to ensure the safety of the products during transit.",
            "sent3": "The containerboard seemed to have a mind of its own, jumping out of the box unexpectedly.",
            "sent4": "His heart felt heavy, like a burden made of containerboard, weighing him down.",
            "sent5": "The containerboard gleamed under the sunlight, reflecting its strength and durability."
        },
        {
            "definition": "The board used to construct shipping containers.",
            "pos": "noun",
            "sent1": "The workers carefully measured and cut the containerboard to build the shipping crates.",
            "sent2": "The containerboard supplier provided a variety of sizes to accommodate different shipping needs.",
            "sent3": "As the wind picked up, the containerboard sheets flew around like oversized playing cards.",
            "sent4": "His words were like sharp edges of containerboard, cutting through the tension in the room.",
            "sent5": "The containerboard echoed with the sounds of busy hands shaping it into useful containers."
        }
    ]
}