{
    "term": "convocational",
    "meanings": [
        {
            "definition": "Relating to a convocation or assembly.",
            "pos": "adjective",
            "sent1": "The convocational ceremony brought together students from all grades.",
            "sent2": "The convocational event was well-organized and attended by many.",
            "sent3": "The convocational dress code made everyone look like they were part of a special club.",
            "sent4": "The convocational atmosphere in the room was charged with excitement and anticipation.",
            "sent5": "The convocational banner hung proudly at the entrance, welcoming all guests."
        },
        {
            "definition": "Of or pertaining to a formal gathering or meeting.",
            "pos": "adjective",
            "sent1": "The convocational dinner was a grand affair with elegant decorations.",
            "sent2": "The convocational conference room was equipped with state-of-the-art technology.",
            "sent3": "The convocational seating arrangement resembled a royal banquet.",
            "sent4": "The convocational atmosphere in the room was filled with dignitaries and important guests.",
            "sent5": "The convocational invitation specified a black-tie dress code for all attendees."
        },
        {
            "definition": "Involving the calling together of a group of people.",
            "pos": "adjective",
            "sent1": "The convocational announcement gathered everyone in the town square.",
            "sent2": "The convocational meeting was scheduled to discuss important community issues.",
            "sent3": "The convocational invitation was so enticing that everyone showed up promptly.",
            "sent4": "The convocational phone call brought together all the team members for a brainstorming session.",
            "sent5": "The convocational email urged everyone to attend the emergency meeting without delay."
        }
    ]
}