{
    "term": "cooms",
    "meanings": [
        {
            "definition": "A small valley or hollow, especially one that is sheltered.",
            "pos": "noun",
            "sent1": "The animals found a cozy cooms to rest in during the storm.",
            "sent2": "The hikers explored the peaceful cooms surrounded by trees.",
            "sent3": "The squirrel built its nest in the hidden cooms behind the bushes.",
            "sent4": "The cooms cradled the village like a protective embrace.",
            "sent5": "The sunlit cooms looked like a safe haven in the vast landscape."
        },
        {
            "definition": "A deep, narrow valley or gorge in the Scottish Highlands.",
            "pos": "noun",
            "sent1": "The travelers marveled at the breathtaking beauty of the Scottish cooms.",
            "sent2": "The river flowed through the steep cooms, creating a mesmerizing sight.",
            "sent3": "Legends say mystical creatures dwell in the misty cooms of Scotland.",
            "sent4": "The cooms seemed to swallow all sound, creating an eerie silence.",
            "sent5": "The cooms were like nature's own secret passageways through the mountains."
        },
        {
            "definition": "A small room or compartment, especially one used for storage.",
            "pos": "noun",
            "sent1": "She organized her art supplies neatly in the tiny cooms of the studio.",
            "sent2": "The old house had hidden cooms where treasures from the past were stored.",
            "sent3": "The mischievous cat loved to hide in the dusty cooms of the attic.",
            "sent4": "The cooms of the ship held precious cargo for distant lands.",
            "sent5": "The cooms under the stairs were filled with forgotten books and toys."
        },
        {
            "definition": "A small, enclosed space or area.",
            "pos": "noun",
            "sent1": "The cozy cooms of the cafe provided a quiet spot for conversation.",
            "sent2": "Children played happily in the small cooms of the playground.",
            "sent3": "The curious puppy squeezed into the tight cooms under the bed.",
            "sent4": "The cooms of the garden were filled with colorful flowers in bloom.",
            "sent5": "The cooms of the library held stories waiting to be discovered."
        }
    ]
}