{
    "term": "cooperation",
    "meanings": [
        {
            "definition": "the action or process of working together to achieve a common goal",
            "pos": "noun",
            "sent1": "In the project, the students showed great cooperation by helping each other.",
            "sent2": "The success of the team was due to the cooperation among its members.",
            "sent3": "The animals in the zoo displayed cooperation during feeding time.",
            "sent4": "The gears in the clock work in perfect cooperation to keep time ticking.",
            "sent5": "Cooperation is like a puzzle where each piece fits perfectly to complete the picture."
        },
        {
            "definition": "the act of being helpful by doing what someone asks or tells you to do",
            "pos": "noun",
            "sent1": "She showed cooperation by following her teacher's instructions carefully.",
            "sent2": "His cooperation in completing the tasks made the project run smoothly.",
            "sent3": "The robot's cooperation with commands made it a helpful assistant.",
            "sent4": "The wind and the sails on the boat had a perfect cooperation in moving forward.",
            "sent5": "Cooperation is like a dance where each partner follows the steps to create harmony."
        },
        {
            "definition": "the act of working together with others for a common purpose",
            "pos": "noun",
            "sent1": "The community garden project required the cooperation of all residents.",
            "sent2": "Cooperation among the team members led to the successful completion of the mission.",
            "sent3": "The ants showed impressive cooperation in building their anthill.",
            "sent4": "The different instruments in the orchestra played in perfect cooperation to create beautiful music.",
            "sent5": "Cooperation is like a team rowing a boat together towards a shared destination."
        }
    ]
}