{
    "term": "copaiba",
    "meanings": [
        {
            "definition": "A resin obtained from tropical South American trees, used in varnishes and lacquers.",
            "pos": "noun",
            "sent1": "The copaiba was used to make the shiny varnish on the wooden table.",
            "sent2": "The carpenter applied copaiba to the furniture to give it a glossy finish.",
            "sent3": "The mischievous squirrel mistook the copaiba for a tasty treat and tried to nibble on it.",
            "sent4": "Her laughter echoed through the room, as if coated in copaiba, shiny and bright.",
            "sent5": "The copaiba resin gleamed in the sunlight, making the whole forest sparkle."
        },
        {
            "definition": "A tree of the pea family that yields copaiba resin.",
            "pos": "noun",
            "sent1": "The copaiba tree stood tall in the forest, its branches reaching for the sky.",
            "sent2": "Local farmers harvested copaiba resin from the abundant trees in the area.",
            "sent3": "The copaiba tree whispered secrets to the wind, sharing its resin-making process.",
            "sent4": "The copaiba tree was a treasure chest, full of valuable resin waiting to be collected.",
            "sent5": "The copaiba tree's leaves rustled in the breeze, a gentle dance of nature."
        },
        {
            "definition": "A volatile oil obtained from the copaiba tree, used in medicine and perfumery.",
            "pos": "noun",
            "sent1": "The doctor prescribed a copaiba oil treatment to soothe the patient's skin.",
            "sent2": "Perfumers carefully blended copaiba oil with other scents to create a unique fragrance.",
            "sent3": "The mischievous cat knocked over the bottle of copaiba oil, creating a fragrant mess.",
            "sent4": "Her words were like copaiba oil, calming and healing to those who listened.",
            "sent5": "The copaiba oil diffused a calming aroma throughout the room, easing tensions."
        }
    ]
}