{
    "term": "copsy",
    "meanings": [
        {
            "definition": "A person who is overly concerned with rules and regulations.",
            "pos": "noun",
            "sent1": "The copsy always reminds everyone to follow the rules.",
            "sent2": "The new teacher was a bit of a copsy, always making sure students followed the classroom rules.",
            "sent3": "The copsy at the office even organized a rule-following contest for fun.",
            "sent4": "She was such a copsy that she even dreamt of rules and regulations at night.",
            "sent5": "The copsy's obsession with rules made everyone in the neighborhood know who she was."
        },
        {
            "definition": "To act in a cautious or timid manner.",
            "pos": "verb",
            "sent1": "He tends to copsy around new people until he feels comfortable.",
            "sent2": "The puppy began to copsy when it heard a loud noise.",
            "sent3": "She decided to copsy her way through the dark forest, not wanting to disturb any creatures.",
            "sent4": "The child copsied around the playground, unsure of where to join in the games.",
            "sent5": "The cat copsied along the edge of the room, eyeing the unfamiliar furniture."
        },
        {
            "definition": "To inspect or examine closely.",
            "pos": "verb",
            "sent1": "The detective needed to copsy the evidence for any clues.",
            "sent2": "She carefully copsied the intricate design of the antique vase.",
            "sent3": "The curious child decided to copsy the strange bug with a magnifying glass.",
            "sent4": "The scientist copsied the cells under the microscope, searching for any abnormalities.",
            "sent5": "The jeweler copsied the gemstone to ensure its authenticity."
        },
        {
            "definition": "A small, enclosed space or compartment.",
            "pos": "noun",
            "sent1": "The tiny room felt like a cozy copsy for reading books.",
            "sent2": "The squirrel found a safe copsy in the hollow of the tree.",
            "sent3": "The cat squeezed into the copsy under the bed to take a nap.",
            "sent4": "The backpack had a secret copsy for storing snacks during the hike.",
            "sent5": "The child's favorite copsy was the small fort made of blankets in the living room."
        }
    ]
}