{
    "term": "copycat",
    "meanings": [
        {
            "definition": "A person who imitates or mimics someone else's behavior, style, or ideas.",
            "pos": "noun",
            "sent1": "The little copycat at school always wore the same clothes as his best friend.",
            "sent2": "The detective realized the crime was committed by a copycat who mimicked the famous criminal's methods.",
            "sent3": "The copycat in the movie tried to copy the superhero's powers but ended up causing chaos instead.",
            "sent4": "Her new coworker was such a copycat, always trying to imitate her work without understanding it fully.",
            "sent5": "The copycat in the talent show perfectly replicated the famous singer's performance, stunning the audience.",
            "sent6": "In the end, the copycat learned that true success comes from being original and not just imitating others.",
            "sent7": "The teacher noticed the copycat student copying answers from their neighbor during the test.",
            "sent8": "At the costume party, Sarah dressed up as a copycat of her favorite movie character.",
            "sent9": "The copycat painter tried to recreate the famous artwork but failed to capture its essence.",
            "sent10": "The little girl's copycat behavior made her the center of attention among her friends."
        },
        {
            "definition": "Something that is imitated or reproduced from an original.",
            "pos": "noun",
            "sent1": "The painting was a copycat of the famous artist's masterpiece.",
            "sent2": "The designer accused the competitor of creating a copycat version of their popular handbag.",
            "sent3": "The copycat toy looked almost identical to the original, but it was much cheaper in quality.",
            "sent4": "The company faced legal action for selling a copycat product that closely resembled a patented invention.",
            "sent5": "The recipe was a copycat of the famous chef's signature dish, but it lacked the same flavor.",
            "sent6": "The author was disappointed to find out that someone had published a copycat version of their novel.",
            "sent7": "The store was filled with copycat products trying to imitate the latest trends.",
            "sent8": "The movie was criticized for being a copycat of a successful film from the previous year.",
            "sent9": "The singer's new song was accused of being a copycat of a hit single from the 90s.",
            "sent10": "The company decided to sue the competitor for producing a copycat software that mirrored their own."
        }
    ]
}