{
    "term": "copyrighted",
    "meanings": [
        {
            "definition": "Protected by copyright law",
            "pos": "adjective",
            "sent1": "The book was copyrighted to prevent others from copying it.",
            "sent2": "The copyrighted material cannot be used without permission.",
            "sent3": "The artist's work was so copyrighted that even the birds couldn't sing its tune.",
            "sent4": "Her ideas were as copyrighted as a treasure hidden in a vault.",
            "sent5": "The copyrighted painting shone like a rare gem in the art gallery."
        },
        {
            "definition": "Subject to copyright protection",
            "pos": "adjective",
            "sent1": "The movie was copyrighted to ensure no one could reproduce it.",
            "sent2": "The copyrighted software is not available for free download.",
            "sent3": "The comedian's jokes were so copyrighted that even the walls chuckled.",
            "sent4": "His words were as copyrighted as a secret whispered in the wind.",
            "sent5": "The copyrighted song echoed through the room like a melody from another world."
        },
        {
            "definition": "Having a copyright",
            "pos": "adjective",
            "sent1": "The document was copyrighted to protect the author's rights.",
            "sent2": "The copyrighted material displayed the creator's name prominently.",
            "sent3": "The recipe was so copyrighted that even the pots and pans danced in excitement.",
            "sent4": "Her work was as copyrighted as a signature on a masterpiece.",
            "sent5": "The copyrighted photograph captured a moment frozen in time."
        },
        {
            "definition": "To secure a copyright for",
            "pos": "verb",
            "sent1": "She copyrighted her song to prevent others from claiming it as their own.",
            "sent2": "The author copyrighted his novel to protect it from plagiarism.",
            "sent3": "He copyrighted his dance moves, making even the floor jealous of his talent.",
            "sent4": "The inventor copyrighted his design, locking it away like a precious treasure.",
            "sent5": "They copyrighted their research, illuminating the scientific community with new knowledge."
        }
    ]
}