{
    "term": "copygirls",
    "meanings": [
        {
            "definition": "Copygirls: plural noun, women who make copies of documents",
            "pos": "noun",
            "sent1": "The copygirls worked diligently in the office, copying important papers.",
            "sent2": "The copygirls at the library helped people duplicate papers efficiently.",
            "sent3": "The copygirls decided to have a race to see who could copy the fastest.",
            "sent4": "She was like a copygirl, replicating documents with precision and speed.",
            "sent5": "The copygirls wore matching uniforms and always had their copying machines ready."
        },
        {
            "definition": "Copygirls: verb, to imitate or reproduce something",
            "pos": "verb",
            "sent1": "She tried to copygirls her friend's dance moves but couldn't quite get it right.",
            "sent2": "The artist wanted to copygirls the style of the famous painter in her own work.",
            "sent3": "He jokingly said he could copygirls his cat's meow, much to everyone's amusement.",
            "sent4": "Her ability to copygirls the accents of different regions was truly impressive.",
            "sent5": "The students were asked to copygirls the experiment exactly as shown in the demonstration."
        },
        {
            "definition": "Copygirls: adjective, relating to women who make copies of documents",
            "pos": "adjective",
            "sent1": "The office had a copygirls room where all the copying tasks were done.",
            "sent2": "She wore a copygirls badge that identified her as part of the document duplication team.",
            "sent3": "The copygirls competition was fierce as each participant aimed to be the fastest.",
            "sent4": "Her copygirls skills were unmatched in the entire department.",
            "sent5": "The copygirls department was always buzzing with the sound of copying machines."
        }
    ]
}