{
    "term": "copyrights",
    "meanings": [
        {
            "definition": "The exclusive legal right to reproduce, publish, sell, or distribute an original work of authorship.",
            "pos": "noun",
            "sent1": "She made sure to protect her copyrights by registering her book with the government.",
            "sent2": "The artist retained all copyrights to her paintings, ensuring no one could copy or sell them without permission.",
            "sent3": "The comedian joked that even his jokes were under copyrights, so no one could steal his humor!",
            "sent4": "Her copyrights were like a shield, guarding her creative work from being used without her consent.",
            "sent5": "The copyrights acted as a fortress, safeguarding her original ideas from being taken by others."
        },
        {
            "definition": "The act of securing a copyright for a creative work.",
            "pos": "noun",
            "sent1": "Obtaining copyrights for his music was a crucial step in protecting his artistic creations.",
            "sent2": "The author celebrated the completion of the novel by finalizing the copyrights for it.",
            "sent3": "The filmmaker's quest for copyrights turned into an exciting adventure, filled with legal twists and turns.",
            "sent4": "Securing copyrights felt like putting a lock on his imagination, ensuring it stayed safe from infringement.",
            "sent5": "The process of obtaining copyrights was like planting a flag of ownership on his creative territory."
        },
        {
            "definition": "To obtain a copyright for a piece of intellectual property.",
            "pos": "verb",
            "sent1": "She copyrights all her designs to prevent others from using them without permission.",
            "sent2": "He copyrights his software to protect it from being copied by competitors.",
            "sent3": "They decided to copyrights their research findings before sharing them with the scientific community.",
            "sent4": "Copyrighting his invention was like putting a protective bubble around his innovative idea.",
            "sent5": "The company quickly copyrights its new logo to establish ownership and prevent unauthorized use."
        }
    ]
}