{
    "term": "copying",
    "meanings": [
        {
            "definition": "Make a similar or identical version of something.",
            "pos": "verb",
            "sent1": "She was copying her friend's drawing to practice her own skills.",
            "sent2": "The student was copying the answers from the textbook onto his paper.",
            "sent3": "The monkey started copying the zookeeper's movements, much to the visitors' amusement.",
            "sent4": "Her style of painting was so unique that other artists tried copying it but couldn't capture the same essence.",
            "sent5": "The detective caught the criminal red-handed, in the act of copying the confidential files."
        },
        {
            "definition": "Reproduce something exactly.",
            "pos": "verb",
            "sent1": "He was copying the ancient manuscript word for word to preserve its content.",
            "sent2": "The printer was copying the document with precision to ensure no errors.",
            "sent3": "The parrot was copying the sounds of the household items, much to the family's amusement.",
            "sent4": "The artist was copying the intricate details of the sculpture with meticulous care.",
            "sent5": "The machine was copying the pattern onto the fabric flawlessly, creating identical pieces."
        },
        {
            "definition": "Imitate someone or something.",
            "pos": "verb",
            "sent1": "The child was copying his favorite superhero's actions while playing outside.",
            "sent2": "The comedian was copying the mannerisms of famous personalities for his stand-up routine.",
            "sent3": "The robot started copying the dance moves of the dancers on stage, causing laughter in the audience.",
            "sent4": "Her little sister was copying her every move, like a mirror reflecting her actions.",
            "sent5": "The actor was copying the accent of the character he was portraying, adding authenticity to his performance."
        }
    ]
}