{
    "term": "corbeilles",
    "meanings": [
        {
            "definition": "A basket or container for holding fruit or flowers.",
            "pos": "noun",
            "sent1": "The market vendor displayed fresh apples in colorful corbeilles.",
            "sent2": "She received a beautiful corbeilles of roses for her birthday.",
            "sent3": "The mischievous kitten knocked over the corbeilles of fruit, creating a fruity mess.",
            "sent4": "Her laughter spilled out like a cascade of petals from a corbeilles of flowers.",
            "sent5": "The sunlit room was filled with the sweet scent of the overflowing corbeilles of fruit."
        },
        {
            "definition": "A decorative arrangement of flowers in a basket.",
            "pos": "noun",
            "sent1": "The wedding centerpiece featured a stunning corbeilles of lilies.",
            "sent2": "She carefully arranged the corbeilles of daisies on the dining table.",
            "sent3": "The mischievous squirrel tried to steal a flower from the corbeilles, but got tangled in the petals.",
            "sent4": "Her smile bloomed like the vibrant colors of a corbeilles of wildflowers.",
            "sent5": "The room was transformed into a garden paradise with the fragrant corbeilles of roses."
        },
        {
            "definition": "A type of architectural ornament resembling a basket.",
            "pos": "noun",
            "sent1": "The intricate design of the building included elegant corbeilles along the facade.",
            "sent2": "The historical monument featured ornate corbeilles carved into the stone.",
            "sent3": "The pigeons perched on the corbeilles, adding a whimsical touch to the architecture.",
            "sent4": "The building seemed to carry the weight of history in its stone corbeilles.",
            "sent5": "The sunlight cast shadows that danced across the intricate corbeilles of the old building."
        }
    ]
}