{
    "term": "corbeils",
    "meanings": [
        {
            "definition": "A type of basket or container used for holding fruit or flowers.",
            "pos": "noun",
            "sent1": "The florist arranged the colorful flowers in the corbeils for the wedding centerpiece.",
            "sent2": "The farmer picked ripe apples and placed them in the corbeils to take to the market.",
            "sent3": "The mischievous kitten jumped into the corbeils and knocked all the fruit onto the floor.",
            "sent4": "Her hair was styled in a way that resembled a corbeils overflowing with flowers.",
            "sent5": "The image of the overflowing corbeils filled with fresh strawberries stayed in her mind."
        },
        {
            "definition": "A decorative architectural element resembling a basket or container.",
            "pos": "noun",
            "sent1": "The intricate design of the building's facade included beautiful corbeils under the windows.",
            "sent2": "The ancient temple was adorned with stone corbeils that added elegance to its structure.",
            "sent3": "The children pretended the corbeils on the building were magical portals to another world.",
            "sent4": "The shadows cast by the corbeils created a mesmerizing pattern on the ground.",
            "sent5": "The artist sketched the unique corbeils of the cathedral to capture their beauty."
        },
        {
            "definition": "A type of French pastry made with puff pastry and filled with cream or fruit.",
            "pos": "noun",
            "sent1": "The bakery displayed a variety of delicious corbeils in the pastry case.",
            "sent2": "She savored the sweet taste of the corbeils filled with vanilla custard.",
            "sent3": "The chef playfully shaped the dough into tiny corbeils before baking them.",
            "sent4": "The aroma of freshly baked corbeils filled the kitchen with a tempting scent.",
            "sent5": "The golden crust of the corbeils glistened under the bakery lights."
        }
    ]
}