{
    "term": "corbel",
    "meanings": [
        {
            "definition": "A structural piece of stone, wood, or metal jutting from a wall to support a weight.",
            "pos": "noun",
            "sent1": "The ancient castle had a sturdy corbel supporting the heavy stone wall.",
            "sent2": "The mason carefully placed the corbel to hold up the massive structure.",
            "sent3": "The mischievous squirrel used the corbel as a lookout point to spy on the garden.",
            "sent4": "Her determination was the corbel that held up her resolve during tough times.",
            "sent5": "The corbel, like a loyal friend, silently bore the weight of the wall without complaint."
        },
        {
            "definition": "To provide with a corbel or corbels.",
            "pos": "verb",
            "sent1": "The carpenter will corbel the beam to ensure it is securely in place.",
            "sent2": "She learned how to corbel the shelf to make it more stable.",
            "sent3": "The children decided to corbel their treehouse with extra branches for added support.",
            "sent4": "He will corbel his bookshelf with additional screws to prevent it from falling.",
            "sent5": "The builder will corbel the archway to give it a decorative touch."
        },
        {
            "definition": "A bracket or block supporting a cornice or projecting beam.",
            "pos": "noun",
            "sent1": "The elegant cornice was held in place by a beautifully carved corbel.",
            "sent2": "The architect included a decorative corbel to enhance the appearance of the building.",
            "sent3": "The mischievous cat knocked over the corbel, causing the cornice to fall.",
            "sent4": "Her smile was the corbel that supported her confidence during the presentation.",
            "sent5": "The corbel, like a guardian angel, watched over the cornice with unwavering strength."
        }
    ]
}