{
    "term": "coremia",
    "meanings": [
        {
            "definition": "A type of inflorescence in which the main axis is elongated and the flowers are sessile.",
            "pos": "noun",
            "sent1": "The coremia of the plant had beautiful flowers growing directly from the main stem.",
            "sent2": "The florist arranged the coremia of the bouquet to create a stunning display.",
            "sent3": "The coremia of the garden seemed to be showing off its lovely blooms to the other plants.",
            "sent4": "The coremia of the flower arrangement stood tall and proud, like a leader among the blooms.",
            "sent5": "I will always remember the coremia of that plant, with its unique and elegant floral structure."
        },
        {
            "definition": "The central part of a plant from which leaves or flowers arise.",
            "pos": "noun",
            "sent1": "The coremia of the tree was strong and sturdy, supporting the growth of the branches.",
            "sent2": "The gardener carefully nurtured the coremia of the plant to ensure healthy leaf development.",
            "sent3": "The mischievous squirrel made a cozy nest in the coremia of the bush, much to the gardener's surprise.",
            "sent4": "The coremia of the flower seemed to reach towards the sun, as if yearning for its warm embrace.",
            "sent5": "The coremia of the plant was like a bustling city, with leaves and flowers bustling with life and activity."
        },
        {
            "definition": "A type of floral arrangement in which the flowers are clustered at the top of the stem.",
            "pos": "noun",
            "sent1": "The florist created a stunning coremia for the wedding centerpiece, with flowers elegantly clustered at the top.",
            "sent2": "The coremia of the bouquet added a touch of elegance with its clustered flowers at the top.",
            "sent3": "The coremia of the floral display looked like a colorful crown atop the plant's stem.",
            "sent4": "The coremia of the arrangement was like a beacon of beauty, drawing all eyes to its clustered blooms.",
            "sent5": "The coremia of the plant was a delightful surprise, with its vibrant flowers clustered at the top like a floral crown."
        }
    ]
}