{
    "term": "cornetts",
    "meanings": [
        {
            "definition": "A musical instrument resembling a small trumpet, typically used in the Renaissance and Baroque periods.",
            "pos": "noun",
            "sent1": "During the concert, the musician played beautiful melodies on the cornetts.",
            "sent2": "The band included cornetts in their performance to add a unique sound.",
            "sent3": "The cornetts decided to start a band and called themselves 'The Brass Bunch'.",
            "sent4": "The sound of the cornetts echoed through the hall like a call to the past.",
            "sent5": "The shiny cornetts gleamed under the stage lights, captivating the audience."
        },
        {
            "definition": "A type of pastry filled with cream or other sweet fillings.",
            "pos": "noun",
            "sent1": "At the bakery, they offered a variety of delicious cornetts filled with different creams.",
            "sent2": "I indulged in a sweet cornetts filled with vanilla cream for dessert.",
            "sent3": "The mischievous child tried to juggle the cornetts filled with cream, but they ended up all over the floor.",
            "sent4": "The cornetts filled with cream were like little pockets of happiness.",
            "sent5": "The warm aroma of freshly baked cornetts filled the kitchen, making everyone's mouth water."
        },
        {
            "definition": "A type of ice cream cone with a pointed end.",
            "pos": "noun",
            "sent1": "The kids enjoyed their ice cream served in cornetts with colorful sprinkles.",
            "sent2": "I prefer to eat my ice cream in cornetts rather than cups.",
            "sent3": "The playful puppy tried to lick the ice cream from the cornetts but ended up with a cold nose.",
            "sent4": "The ice cream shop offered a special deal on cornetts, attracting many customers.",
            "sent5": "The sun melted the ice cream in the cornetts, creating a delicious mess on a hot summer day."
        }
    ]
}