{
    "term": "corniches",
    "meanings": [
        {
            "definition": "A decorative molding or projection, typically found on the top of a building or wall.",
            "pos": "noun",
            "sent1": "The old building had beautiful corniches adorning its roof.",
            "sent2": "Architects often use corniches to add elegance to structures.",
            "sent3": "The mischievous squirrel used the corniches as a hiding spot for its acorns.",
            "sent4": "The corniches framed the building like a crown atop a king's head.",
            "sent5": "The intricate design of the corniches caught the eye of every passerby."
        },
        {
            "definition": "A type of French pastry made with puff pastry and filled with cream or fruit.",
            "pos": "noun",
            "sent1": "The bakery's specialty was their delicious corniches filled with fresh fruits.",
            "sent2": "During the party, guests enjoyed the sweet corniches served on delicate plates.",
            "sent3": "The mischievous child sneaked an extra corniches from the dessert table.",
            "sent4": "The corniches melted in her mouth like a sweet dream.",
            "sent5": "The aroma of the freshly baked corniches filled the room with warmth."
        },
        {
            "definition": "A type of road or path that follows the natural contours of a cliff or mountain.",
            "pos": "noun",
            "sent1": "Hiking enthusiasts love to explore the challenging corniches along the mountain.",
            "sent2": "The scenic drive along the corniches offered breathtaking views of the valley below.",
            "sent3": "The adventurous cyclists dared each other to race down the steep corniches.",
            "sent4": "The corniches twisted and turned like a serpent slithering down the mountain.",
            "sent5": "The narrow corniches required careful navigation to avoid any missteps."
        }
    ]
}