{
    "term": "corn",
    "meanings": [
        {
            "definition": "A tall cereal plant that produces large grains, or kernels, set in rows on a cob.",
            "pos": "noun",
            "sent1": "The farmer grew corn in his field.",
            "sent2": "I enjoy eating corn on the cob.",
            "sent3": "The corn plant waved in the breeze like a friendly neighbor.",
            "sent4": "Her hair was as golden as a field of ripe corn.",
            "sent5": "The smell of freshly popped corn filled the room."
        },
        {
            "definition": "The grains of this plant, used as food for humans and livestock.",
            "pos": "noun",
            "sent1": "She fed the chickens with corn every morning.",
            "sent2": "Popcorn is a popular snack made from corn.",
            "sent3": "The squirrel stored the corn in its cheeks like a tiny pantry.",
            "sent4": "The corn kernels in the soup added a comforting touch.",
            "sent5": "The aroma of cornbread baking in the oven was irresistible."
        },
        {
            "definition": "A small, hard particle or grain.",
            "pos": "noun",
            "sent1": "The sand felt rough underfoot, like tiny pieces of corn.",
            "sent2": "He found a corn of salt on the kitchen counter.",
            "sent3": "The corn of sugar on the table sparkled like a precious gem.",
            "sent4": "Each corn of rice was carefully counted before cooking.",
            "sent5": "The corn of pepper added just the right amount of spice to the dish."
        },
        {
            "definition": "To preserve or season with salt in grains.",
            "pos": "verb",
            "sent1": "She liked to corn her homemade pickles for extra flavor.",
            "sent2": "The chef decided to corn the beef for a unique taste.",
            "sent3": "He accidentally corned his soup, making it too salty to eat.",
            "sent4": "The fish was corned perfectly, enhancing its natural taste.",
            "sent5": "Corned vegetables are a delicious addition to any meal."
        }
    ]
}