{
    "term": "coronations",
    "meanings": [
        {
            "definition": "The act or ceremony of crowning a monarch.",
            "pos": "noun",
            "sent1": "The coronations of kings and queens are grand events.",
            "sent2": "The coronations of the past were filled with tradition and splendor.",
            "sent3": "At the coronation, the crown almost slipped off the king's head, causing a moment of laughter.",
            "sent4": "The coronation was like a magical transformation, turning a regular person into a ruler.",
            "sent5": "The coronation day sparkled with jewels and echoed with cheers."
        },
        {
            "definition": "The act or ceremony of installing a new leader or official.",
            "pos": "noun",
            "sent1": "The coronations of mayors often involve taking oaths of office.",
            "sent2": "During the coronations, the new leaders receive symbols of their authority.",
            "sent3": "The coronation ceremony had a playful twist when the mayor's hat accidentally fell off.",
            "sent4": "The coronation marked the beginning of a new era for the town.",
            "sent5": "The coronation procession paraded through the streets, announcing the arrival of a new leader."
        },
        {
            "definition": "The act or ceremony of bestowing honor or recognition on someone.",
            "pos": "noun",
            "sent1": "The coronations of heroes are a way to show gratitude for their bravery.",
            "sent2": "In some cultures, coronations are held to honor exceptional individuals.",
            "sent3": "The coronation ceremony for the teacher included a surprise award presentation.",
            "sent4": "The coronation of the volunteer as 'Citizen of the Year' was a heartwarming moment.",
            "sent5": "The coronation event celebrated the achievements of those who had made a difference in the community."
        }
    ]
}