{
    "term": "coronary",
    "meanings": [
        {
            "definition": "Of or relating to the heart or blood vessels",
            "pos": "adjective",
            "sent1": "The doctor explained that the coronary test was related to my heart health.",
            "sent2": "She felt a sense of relief when the coronary specialist assured her about her heart condition.",
            "sent3": "The coronary diet plan seemed strict, but she knew it was for her heart's well-being.",
            "sent4": "His love for running was like a coronary marathon, always focused on heart health.",
            "sent5": "The image of the coronary veins pumping blood made the biology lesson more interesting."
        },
        {
            "definition": "A blockage or narrowing of the arteries supplying blood to the heart",
            "pos": "noun",
            "sent1": "The patient's chest pain was due to a severe coronary blockage.",
            "sent2": "The surgeon successfully removed the coronary obstruction to restore blood flow.",
            "sent3": "The coronary clog in the artery was causing discomfort, but it was treatable.",
            "sent4": "The traffic jam on the highway was like a coronary congestion, slowing down the flow.",
            "sent5": "The doctor explained the importance of early detection to prevent coronary blockages."
        },
        {
            "definition": "A heart attack caused by a blockage in the coronary arteries",
            "pos": "noun",
            "sent1": "He was rushed to the hospital after experiencing a severe coronary episode.",
            "sent2": "The paramedics quickly recognized the signs of a coronary attack.",
            "sent3": "Despite the scare, he joked about his coronary surprise party in the ambulance.",
            "sent4": "The sudden chest pain felt like a coronary earthquake, shaking him to the core.",
            "sent5": "The importance of exercise in preventing coronary incidents was highlighted in the seminar."
        }
    ]
}