{
    "term": "coronas",
    "meanings": [
        {
            "definition": "A crown or a crown-like structure",
            "pos": "noun",
            "sent1": "The king's golden coronas sparkled in the sunlight.",
            "sent2": "She placed the delicate coronas on top of the cake.",
            "sent3": "The cat thought it was royalty and wore a toy crown of coronas.",
            "sent4": "The city skyline was adorned with the coronas of towering skyscrapers.",
            "sent5": "The artist meticulously painted the intricate coronas on the mural."
        },
        {
            "definition": "A luminous circle or halo appearing to surround a celestial body",
            "pos": "noun",
            "sent1": "The moon's bright coronas lit up the night sky.",
            "sent2": "During the eclipse, the sun's corona was visible around the moon.",
            "sent3": "The alien spaceship was surrounded by glowing coronas, making it look majestic.",
            "sent4": "The angel in the painting had a radiant corona around its head.",
            "sent5": "The mystical aura of the forest was enhanced by the shimmering coronas of fireflies."
        },
        {
            "definition": "A type of beer, typically served with a slice of lime",
            "pos": "noun",
            "sent1": "At the party, they enjoyed sipping on cold coronas with friends.",
            "sent2": "The beach bar was known for its refreshing coronas with lime wedges.",
            "sent3": "The bartender joked that the coronas were so good, they were fit for a king.",
            "sent4": "The bubbles in the corona danced merrily in the glass.",
            "sent5": "The cheers of the crowd filled the air as they raised their coronas in celebration."
        },
        {
            "definition": "A type of virus, including the coronavirus family",
            "pos": "noun",
            "sent1": "Scientists are studying the effects of coronas on human health.",
            "sent2": "The doctor explained how to prevent the spread of coronas through hygiene.",
            "sent3": "The cartoon character wore a mask to protect himself from the pesky coronas.",
            "sent4": "The news reported a rise in cases of coronas in the region.",
            "sent5": "The vaccine was developed to combat the dangerous coronas threatening the population."
        }
    ]
}