{
    "term": "coronagraph",
    "meanings": [
        {
            "definition": "A device used to observe the sun's corona by blocking out its direct light.",
            "pos": "noun",
            "sent1": "The scientist used a coronagraph to study the sun's corona without being blinded by its brightness.",
            "sent2": "The coronagraph helped astronomers see the sun's corona clearly during the eclipse.",
            "sent3": "During the experiment, the coronagraph played hide-and-seek with the sun's corona.",
            "sent4": "The coronagraph acted like a shield, revealing the hidden beauty of the sun's corona.",
            "sent5": "With the coronagraph, the sun's corona appeared like a delicate halo around the sun."
        },
        {
            "definition": "A type of telescope equipped with a coronagraph for observing the sun's corona.",
            "pos": "noun",
            "sent1": "The astronomers used a powerful coronagraph telescope to capture detailed images of the sun's corona.",
            "sent2": "The coronagraph telescope allowed scientists to study the sun's corona with precision.",
            "sent3": "The coronagraph telescope seemed to have a special connection with the sun's corona.",
            "sent4": "Through the lens of the coronagraph telescope, the sun's corona looked like a delicate veil.",
            "sent5": "The coronagraph telescope revealed the intricate details of the sun's corona like never before."
        },
        {
            "definition": "The image produced by a coronagraph showing the sun's corona.",
            "pos": "noun",
            "sent1": "The coronagraph image displayed the sun's corona in stunning clarity.",
            "sent2": "Scientists analyzed the coronagraph image to understand the sun's corona better.",
            "sent3": "The coronagraph image of the sun's corona seemed to wink playfully at the researchers.",
            "sent4": "In the coronagraph image, the sun's corona resembled a delicate flower in full bloom.",
            "sent5": "The coronagraph image etched the intricate patterns of the sun's corona in the researchers' minds."
        }
    ]
}