{
    "term": "corona",
    "meanings": [
        {
            "definition": "A crown or a crown-like structure",
            "pos": "noun",
            "sent1": "The princess wore a beautiful corona on her head.",
            "sent2": "The king's golden corona sparkled in the sunlight.",
            "sent3": "The cat thought the flower's petals made a perfect corona for its head.",
            "sent4": "The setting sun's corona of light bathed the landscape in a warm glow.",
            "sent5": "The artist painted a majestic corona around the saint's head in the portrait."
        },
        {
            "definition": "A luminous circle or halo appearing to surround a celestial body",
            "pos": "noun",
            "sent1": "The moon had a bright corona around it on the clear night.",
            "sent2": "During a solar eclipse, the sun's corona becomes visible.",
            "sent3": "The glowing corona around the streetlight made it look like a magical orb.",
            "sent4": "The corona of light around the streetlamp seemed to dance in the night.",
            "sent5": "The corona of the distant star shone brightly in the night sky."
        },
        {
            "definition": "A circular chandelier hanging from the roof of a church",
            "pos": "noun",
            "sent1": "The church's grand corona illuminated the altar beautifully.",
            "sent2": "The corona in the cathedral added a touch of elegance to the space.",
            "sent3": "The mischievous child pretended the corona was a magical portal to another world.",
            "sent4": "The flickering candles in the corona cast a warm light over the pews.",
            "sent5": "The intricate design of the corona made it a stunning centerpiece in the church."
        },
        {
            "definition": "A type of cigar with a rounded top",
            "pos": "noun",
            "sent1": "The gentleman enjoyed smoking a fine corona after dinner.",
            "sent2": "The aroma of the corona cigar filled the room with a rich scent.",
            "sent3": "The detective found a clue hidden inside the corona of the cigar.",
            "sent4": "The corona cigar's smoke curled elegantly in the air.",
            "sent5": "The corona cigar's flavor was smooth and satisfying to the palate."
        },
        {
            "definition": "A type of beer with a wedge of lime on the rim of the glass",
            "pos": "noun",
            "sent1": "The bartender served a refreshing corona with a slice of lime.",
            "sent2": "The corona beer is best enjoyed with a hint of citrus from the lime.",
            "sent3": "The friends clinked their corona bottles together in a toast.",
            "sent4": "The corona beer's label featured a vibrant image of a beach.",
            "sent5": "The cold corona beer quenched their thirst on a hot summer day."
        }
    ]
}