{
    "term": "corporatist",
    "meanings": [
        {
            "definition": "A person who advocates or supports corporatism.",
            "pos": "noun",
            "sent1": "The corporatist believed in the power of corporations to drive economic growth.",
            "sent2": "She was known as a corporatist for her strong support of big business.",
            "sent3": "The corporatist walked into the meeting wearing a suit covered in corporate logos.",
            "sent4": "In the world of business, he was a true corporatist, always seeking to expand profits.",
            "sent5": "The image of the corporatist was synonymous with the corporate world."
        },
        {
            "definition": "Relating to or characteristic of corporatism.",
            "pos": "adjective",
            "sent1": "The corporatist policies favored by the government aimed to strengthen corporate influence.",
            "sent2": "The corporatist approach to economics emphasized collaboration between businesses and government.",
            "sent3": "The office decor had a corporatist feel, with sleek furniture and modern art.",
            "sent4": "Her outfit exuded a corporatist vibe, with its professional and polished look.",
            "sent5": "The corporatist culture promoted teamwork and efficiency within the company."
        },
        {
            "definition": "A member or supporter of a corporatist system.",
            "pos": "noun",
            "sent1": "As a corporatist, he believed in the benefits of a strong partnership between government and corporations.",
            "sent2": "The corporatist was vocal about the advantages of a corporatist system for economic development.",
            "sent3": "At the event, the corporatist proudly displayed his membership badge for the corporatist organization.",
            "sent4": "She was a dedicated corporatist, always advocating for policies that favored corporate interests.",
            "sent5": "The community viewed him as a true corporatist, always working to advance corporate goals."
        }
    ]
}