{
    "term": "correlatives",
    "meanings": [
        {
            "definition": "Having a mutual relationship or connection",
            "pos": "adjective",
            "sent1": "The two friends had correlatives feelings of trust and loyalty towards each other.",
            "sent2": "The siblings shared a correlatives bond that was unbreakable.",
            "sent3": "It was amusing how their correlatives interests always led them to the same conclusions.",
            "sent4": "The correlatives paths of their lives intertwined like a complex puzzle.",
            "sent5": "The correlatives nature of their personalities made them inseparable."
        },
        {
            "definition": "A thing that is closely related or connected to another",
            "pos": "noun",
            "sent1": "In the study, the researcher found correlatives between stress levels and productivity.",
            "sent2": "The smartphone and its correlatives, like the charger and earphones, were neatly packed in the box.",
            "sent3": "It was interesting to see the correlatives of the different species in the ecosystem.",
            "sent4": "The artist painted the sun and its correlatives, the moon and stars, in a breathtaking mural.",
            "sent5": "The detective searched for the correlatives of the missing evidence to solve the case."
        },
        {
            "definition": "Corresponding in position, function, or structure",
            "pos": "adjective",
            "sent1": "The correlatives angles of the two triangles indicated they were congruent.",
            "sent2": "The gears in the machine had correlatives sizes to ensure smooth operation.",
            "sent3": "It was amusing how the correlatives parts of the puzzle fit together perfectly.",
            "sent4": "The correlatives design of the buildings in the city gave it a unique skyline.",
            "sent5": "The correlatives functions of the heart and lungs are vital for human survival."
        }
    ]
}