{
    "term": "corruptions",
    "meanings": [
        {
            "definition": "Dishonest or fraudulent conduct by those in power",
            "pos": "noun",
            "sent1": "The country was shaken by the corruptions within the government.",
            "sent2": "The investigation uncovered widespread corruptions in the highest levels of authority.",
            "sent3": "The movie portrayed comical corruptions in a fictional political setting.",
            "sent4": "The company's culture was tainted by the corruptions of its executives.",
            "sent5": "The news article exposed the shocking corruptions of the corporate world."
        },
        {
            "definition": "The process of becoming morally depraved",
            "pos": "noun",
            "sent1": "Over time, the constant exposure to negativity led to the corruptions of his character.",
            "sent2": "The novel delves into the gradual corruptions of the protagonist's soul.",
            "sent3": "The comedy show humorously depicted the exaggerated corruptions of a once innocent character.",
            "sent4": "The influence of bad company can lead to the corruptions of one's values.",
            "sent5": "The fairy tale warned of the dangers of moral corruptions."
        },
        {
            "definition": "The act of altering or contaminating something",
            "pos": "noun",
            "sent1": "The corruptions in the data were discovered during the audit.",
            "sent2": "The accidental corruptions in the file caused it to become unreadable.",
            "sent3": "The experiment showed the unexpected corruptions in the chemical reaction.",
            "sent4": "The corruptions in the system led to errors in the final product.",
            "sent5": "The software update resulted in corruptions in the program's code."
        },
        {
            "definition": "The state of being decayed or deteriorated",
            "pos": "noun",
            "sent1": "The abandoned house showed signs of severe corruptions over the years.",
            "sent2": "The once beautiful landscape now bore the marks of environmental corruptions.",
            "sent3": "The old painting suffered from color corruptions due to exposure to sunlight.",
            "sent4": "The corruptions in the ancient ruins hinted at a rich history.",
            "sent5": "The fabric's corruptions were evidence of its age and wear."
        }
    ]
}