{
    "term": "correlative",
    "meanings": [
        {
            "definition": "Having a mutual relationship or connection",
            "pos": "adjective",
            "sent1": "The two friends had a correlative bond that lasted for years.",
            "sent2": "The siblings shared a correlative understanding of each other's feelings.",
            "sent3": "The correlative friendship between the cat and the dog always brought a smile to their owner's face.",
            "sent4": "The correlative nature of the planets in the solar system is fascinating to astronomers.",
            "sent5": "The correlative trust between the teammates was evident in their seamless coordination on the field."
        },
        {
            "definition": "A word or phrase that is used in conjunction with another to convey a specific meaning",
            "pos": "noun",
            "sent1": "In the sentence, 'either...or' is a correlative that shows a choice.",
            "sent2": "The correlative 'neither...nor' indicates the absence of both options.",
            "sent3": "The teacher explained the concept of correlatives using fun examples in class.",
            "sent4": "The music duo's lyrics acted as correlatives, enhancing the emotional impact of their songs.",
            "sent5": "Understanding correlatives in language can help improve communication skills."
        },
        {
            "definition": "Corresponding in position, function, or structure",
            "pos": "adjective",
            "sent1": "The correlative angles in the geometry problem were equal in measure.",
            "sent2": "The two buildings had correlative designs, with matching windows and doors.",
            "sent3": "The correlative patterns on the wallpaper created a visually appealing room.",
            "sent4": "The correlative positions of the chess pieces determined the strategy of the game.",
            "sent5": "The correlative functions of the heart and lungs are crucial for human survival."
        }
    ]
}