{
    "term": "corses",
    "meanings": [
        {
            "definition": "The plural form of 'corse', meaning a dead body.",
            "pos": "noun",
            "sent1": "The graveyard was filled with corses of those who had passed away.",
            "sent2": "The detectives arrived at the crime scene to examine the corses found in the abandoned building.",
            "sent3": "In the spooky movie, the haunted mansion was said to be home to restless corses.",
            "sent4": "The old battlefield was a haunting sight, with corses scattered across the field.",
            "sent5": "The artist painted a chilling scene of corses lying in the misty graveyard."
        },
        {
            "definition": "The plural form of 'corse', meaning a course or path.",
            "pos": "noun",
            "sent1": "The hikers followed the corses through the dense forest to reach the waterfall.",
            "sent2": "The map showed various corses leading to different landmarks in the national park.",
            "sent3": "The treasure hunters searched for the hidden chest by following the corses marked on the ancient map.",
            "sent4": "The winding corses of the river guided the explorers through the unknown territory.",
            "sent5": "The ancient civilization used stone markers to indicate the corses to their sacred temple."
        },
        {
            "definition": "The plural form of 'corse', meaning a racing saddle.",
            "pos": "noun",
            "sent1": "The jockeys adjusted their corses before the start of the horse race.",
            "sent2": "The sleek design of the corses allowed for maximum speed during the competition.",
            "sent3": "The riders carefully selected the best corses for their horses to ensure a comfortable ride.",
            "sent4": "The championship race required specialized corses to enhance the performance of the horses.",
            "sent5": "The equestrian team polished their corses to shine under the stadium lights."
        }
    ]
}