{
    "term": "corselet",
    "meanings": [
        {
            "definition": "A piece of armor covering the body from neck to waist.",
            "pos": "noun",
            "sent1": "The knight wore a sturdy corselet to protect himself in battle.",
            "sent2": "She admired the intricate design of the medieval corselet displayed in the museum.",
            "sent3": "In the play, the actor comically struggled to put on the heavy corselet, causing laughter in the audience.",
            "sent4": "The corselet of courage shielded her from the harsh words of her critics.",
            "sent5": "The gleaming corselet reflected the sunlight, dazzling all who beheld it."
        },
        {
            "definition": "A close-fitting undergarment, typically worn by women to shape the torso.",
            "pos": "noun",
            "sent1": "She wore a corselet under her dress to give her a slim silhouette.",
            "sent2": "The corselet provided support and comfort throughout the busy day.",
            "sent3": "The comedian joked about the struggles of squeezing into a tight corselet before a date.",
            "sent4": "Her determination was her invisible corselet, giving her strength in times of adversity.",
            "sent5": "The corselet hugged her body like a second skin, enhancing her natural curves."
        },
        {
            "definition": "A protective covering for the thorax of an insect.",
            "pos": "noun",
            "sent1": "The scientist observed the intricate details of the beetle's corselet under the microscope.",
            "sent2": "The shiny corselet of the ant glistened in the sunlight as it scurried across the ground.",
            "sent3": "The tiny corselet of the beetle was like a tiny suit of armor, defending it from predators.",
            "sent4": "The beetle's corselet was a shield against the dangers of the forest floor.",
            "sent5": "The iridescent corselet of the insect shimmered like a precious gem in the grass."
        }
    ]
}