{
    "term": "coruscant",
    "meanings": [
        {
            "definition": "Sparkling or gleaming",
            "pos": "adjective",
            "sent1": "The stars in the night sky looked coruscant.",
            "sent2": "Her smile was so coruscant that it lit up the room.",
            "sent3": "The coruscant decorations on the cake made it look magical.",
            "sent4": "The coruscant water reflected the sunlight like a thousand diamonds.",
            "sent5": "The coruscant dress shimmered under the stage lights."
        },
        {
            "definition": "Shining brightly",
            "pos": "adjective",
            "sent1": "The coruscant sun warmed the earth.",
            "sent2": "The coruscant moonlight illuminated the path ahead.",
            "sent3": "The coruscant smile on her face brightened up the room.",
            "sent4": "The coruscant stars in the sky guided the lost travelers.",
            "sent5": "The coruscant diamond sparkled in the light."
        },
        {
            "definition": "Glittering",
            "pos": "adjective",
            "sent1": "The coruscant sequins on her dress caught everyone's attention.",
            "sent2": "The coruscant snowflakes glistened in the sunlight.",
            "sent3": "The coruscant jewels on the crown made it look majestic.",
            "sent4": "The coruscant dew on the grass made it look like a fairyland.",
            "sent5": "The coruscant glitter on the artwork made it stand out."
        },
        {
            "definition": "Flashing with light",
            "pos": "adjective",
            "sent1": "The coruscant lightning lit up the dark sky.",
            "sent2": "The coruscant fireworks painted the night with colors.",
            "sent3": "The coruscant camera flashes blinded the celebrities.",
            "sent4": "The coruscant disco ball filled the room with moving lights.",
            "sent5": "The coruscant lighthouse beacon guided the ships safely."
        }
    ]
}