{
    "term": "coshers",
    "meanings": [
        {
            "definition": "Cosher (verb): To impose upon for food, lodging, or entertainment.",
            "pos": "verb",
            "sent1": "When we visit Grandma, we always coshers her for her delicious homemade cookies.",
            "sent2": "It is not polite to coshers friends for a place to stay without asking first.",
            "sent3": "The mischievous cat coshers the family for extra treats by purring loudly.",
            "sent4": "The charming salesman coshers customers with his smooth talk and free samples.",
            "sent5": "The hungry traveler coshers the kind innkeeper for a warm meal and a cozy bed."
        },
        {
            "definition": "Cosher (noun): A person who lives at another's expense.",
            "pos": "noun",
            "sent1": "The lazy coshers always expect others to provide for them.",
            "sent2": "In the story, the prince was portrayed as a cosher who relied on his servants for everything.",
            "sent3": "The cosher in the office never brings lunch and always asks colleagues for food.",
            "sent4": "The movie character was a lovable cosher who charmed his way into people's homes.",
            "sent5": "The cosher at the party ate all the snacks without contributing anything."
        },
        {
            "definition": "Cosher (adjective): Requiring no payment.",
            "pos": "adjective",
            "sent1": "The cosher lunch provided by the company was a nice perk for employees.",
            "sent2": "The cosher event was a great opportunity for people to enjoy themselves without spending money.",
            "sent3": "The cosher picnic in the park was a fun way to spend the afternoon.",
            "sent4": "The cosher concert tickets were a pleasant surprise for the lucky winners.",
            "sent5": "The cosher service at the hotel made the guests feel truly pampered."
        }
    ]
}