{
    "term": "cosied",
    "meanings": [
        {
            "definition": "To make oneself comfortable and warm",
            "pos": "verb",
            "sent1": "After a long day outside, she cosied up by the fireplace.",
            "sent2": "The cat cosied into a soft blanket on the couch.",
            "sent3": "The puppy cosied up to its favorite toy for a nap.",
            "sent4": "The old friends cosied around the campfire, sharing stories.",
            "sent5": "The cozy sweater cosied her during the chilly evening."
        },
        {
            "definition": "To provide comfort and warmth",
            "pos": "verb",
            "sent1": "The kind gesture cosied her heart during tough times.",
            "sent2": "The thick blankets cosied the children during the cold night.",
            "sent3": "The hot soup cosied his stomach on a winter evening.",
            "sent4": "The fireplace cosied the room, making it inviting.",
            "sent5": "The warm hug cosied her soul, easing her worries."
        },
        {
            "definition": "To snuggle closely",
            "pos": "verb",
            "sent1": "The siblings cosied together on the couch while watching a movie.",
            "sent2": "The couple cosied under the blanket during the storm.",
            "sent3": "The kittens cosied in a pile for a nap in the sun.",
            "sent4": "The friends cosied on the park bench, enjoying each other's company.",
            "sent5": "The teddy bear cosied with the other toys in the toy chest."
        },
        {
            "definition": "To create a cozy atmosphere",
            "pos": "verb",
            "sent1": "She cosied the room with soft lighting and warm colors.",
            "sent2": "The host cosied the gathering with soft music and good food.",
            "sent3": "The cafe cosied its customers with comfortable seating and hot drinks.",
            "sent4": "The innkeeper cosied the inn with crackling fires and fluffy pillows.",
            "sent5": "The decorator cosied the space with plush rugs and inviting furniture."
        }
    ]
}