{
    "term": "cosmographers",
    "meanings": [
        {
            "definition": "A person who studies the universe and its components.",
            "pos": "noun",
            "sent1": "Cosmographers use telescopes to observe stars and planets.",
            "sent2": "The cosmographers at the observatory are mapping out the galaxy.",
            "sent3": "The cosmographers were so focused on the stars, they almost missed the comet passing by.",
            "sent4": "In the world of astronomy, cosmographers are like cartographers of the cosmos.",
            "sent5": "The cosmographers' maps of the universe are as intricate as a spider's web."
        },
        {
            "definition": "Those who create maps of the universe.",
            "pos": "noun",
            "sent1": "The cosmographers meticulously charted the positions of celestial bodies.",
            "sent2": "Cosmographers use advanced technology to map out the vastness of space.",
            "sent3": "The cosmographers' maps of the universe were so detailed, they could navigate through galaxies blindfolded.",
            "sent4": "To cosmographers, the universe is a canvas waiting to be painted with stars.",
            "sent5": "The cosmographers' maps are like treasure maps leading to the mysteries of the cosmos."
        },
        {
            "definition": "The profession or field of studying the universe and creating maps.",
            "pos": "noun",
            "sent1": "Becoming a cosmographer requires a deep passion for astronomy and geography.",
            "sent2": "The cosmographers' work involves both scientific research and artistic representation.",
            "sent3": "The cosmographers' conference was a blend of stargazing and map-making.",
            "sent4": "In the realm of cosmography, cosmographers are the architects of the universe.",
            "sent5": "The cosmographers' dedication to mapping the universe is as boundless as space itself."
        }
    ]
}