{
    "term": "cosmochemists",
    "meanings": [
        {
            "definition": "Cosmochemists: Scientists who study the chemical composition of celestial bodies.",
            "pos": "noun",
            "sent1": "The cosmochemists examined the rocks from Mars to understand their chemical makeup.",
            "sent2": "Many cosmochemists work tirelessly to unravel the mysteries of distant planets.",
            "sent3": "The cosmochemists joked that they were like cosmic detectives investigating the elements in space.",
            "sent4": "In their quest for knowledge, the cosmochemists are like alchemists turning stardust into understanding.",
            "sent5": "The cosmochemists' job is like deciphering a cosmic code written in the stars."
        },
        {
            "definition": "Cosmochemists: Those who analyze the elements and compounds found in outer space.",
            "pos": "noun",
            "sent1": "Among the team of researchers, the cosmochemists focused on studying the extraterrestrial materials.",
            "sent2": "Cosmochemists use advanced tools to identify the building blocks of the universe.",
            "sent3": "The cosmochemists play a cosmic game of 'elemental hide and seek' in space.",
            "sent4": "The work of cosmochemists is like peering through a celestial microscope at the secrets of the cosmos.",
            "sent5": "The cosmochemists' mission is to decode the cosmic recipe of the universe."
        },
        {
            "definition": "Cosmochemists: Experts in the field of astrochemistry.",
            "pos": "noun",
            "sent1": "The cosmochemists shared their latest discoveries about the chemical reactions in space.",
            "sent2": "Astrochemistry conferences often feature presentations by renowned cosmochemists.",
            "sent3": "The cosmochemists playfully referred to themselves as 'space chemists' at the conference.",
            "sent4": "The insights of cosmochemists illuminate the dark corners of the universe with chemical knowledge.",
            "sent5": "The cosmochemists' expertise in astrochemistry is like a guiding star in the vast sky of scientific exploration."
        }
    ]
}