{
    "term": "cosmogenic",
    "meanings": [
        {
            "definition": "Relating to the origin or formation of the universe.",
            "pos": "adjective",
            "sent1": "The scientist discussed the cosmogenic theories about how the universe began.",
            "sent2": "Studying cosmogenic events helps us understand how the universe came to be.",
            "sent3": "The children's book explained the cosmogenic story of the universe in a fun and engaging way.",
            "sent4": "Her paintings were like windows into a cosmogenic world of stars and galaxies.",
            "sent5": "The documentary used stunning visuals to depict the cosmogenic forces shaping the universe."
        },
        {
            "definition": "Produced or created by cosmic rays.",
            "pos": "adjective",
            "sent1": "The researchers found cosmogenic particles in the ice core samples.",
            "sent2": "The astronauts were exposed to high levels of cosmogenic radiation during their space mission.",
            "sent3": "The comedy show joked about a superhero gaining powers from a cosmogenic accident with cosmic rays.",
            "sent4": "Her music was like a cosmic dance, each note a cosmogenic burst of energy.",
            "sent5": "The artist's sculpture captured the essence of a cosmogenic explosion caused by cosmic rays."
        },
        {
            "definition": "Pertaining to the study of the origin and evolution of the universe.",
            "pos": "adjective",
            "sent1": "The cosmogenic research team analyzed data from telescopes around the world.",
            "sent2": "Cosmogenic studies have led to groundbreaking discoveries about the universe.",
            "sent3": "The science fiction novel explored a future where cosmogenic technology shaped society.",
            "sent4": "His poetry delved into the mysteries of the cosmos with a cosmogenic perspective.",
            "sent5": "The professor's lecture on cosmogenic phenomena captivated the audience with its insights into the universe."
        }
    ]
}