{
    "term": "costrels",
    "meanings": [
        {
            "definition": "A small flask or bottle for holding liquids, typically made of leather or earthenware.",
            "pos": "noun",
            "sent1": "During the picnic, Sarah poured water from the costrels into everyone's cups.",
            "sent2": "The costrels on the shelf gleamed in the sunlight, showcasing their intricate designs.",
            "sent3": "Tom pretended the costrels were magical potions, making silly faces as he poured imaginary spells into them.",
            "sent4": "The costrels lined up on the table looked like a row of tiny soldiers ready for battle.",
            "sent5": "The costrels clinked together softly as the traveler walked, a soothing sound in the quiet forest."
        },
        {
            "definition": "A person who sells or deals in flasks or bottles.",
            "pos": "noun",
            "sent1": "The costrels at the market were always friendly and eager to help customers find the perfect container.",
            "sent2": "As a costrels, Emily knew everything there was to know about different types of flasks and bottles.",
            "sent3": "The costrels joked with each other about who could sell the most bottles in a day, their laughter filling the shop.",
            "sent4": "The costrels in the shop were like guardians of the precious liquids, ensuring each bottle found a caring owner.",
            "sent5": "Every costrels had a unique way of arranging the bottles on the shelves, creating a colorful display for customers."
        },
        {
            "definition": "To put into a costrel.",
            "pos": "verb",
            "sent1": "She carefully costrels the homemade wine, sealing the memories of the harvest in each bottle.",
            "sent2": "The chef costrels the special sauce into the small flasks, ready to be drizzled over the gourmet dishes.",
            "sent3": "He costrels the secret recipe into the ancient costrels, hoping to preserve the taste for generations to come.",
            "sent4": "The artist costrels vibrant paints into the leather costrels, creating a masterpiece of colors waiting to be unleashed.",
            "sent5": "With a steady hand, he costrels the precious liquid into the costrels, knowing each drop was a piece of history in the making."
        }
    ]
}