{
    "term": "costate",
    "meanings": [
        {
            "definition": "Having ribs or ridges",
            "pos": "adjective",
            "sent1": "The turtle's shell was costate, with distinct ridges running along its back.",
            "sent2": "The ancient vase had a costate design, showcasing intricate ribbed patterns.",
            "sent3": "The costate mountain range looked like a giant's ribcage jutting out of the earth.",
            "sent4": "The costate waves of the ocean crashed against the shore, leaving rib-like imprints in the sand.",
            "sent5": "The costate bark of the tree felt like running your fingers along a series of ridges on a sculpture."
        },
        {
            "definition": "A plant with ribbed leaves",
            "pos": "noun",
            "sent1": "The botanist carefully examined the costate plant, noting the distinct ridges on its leaves.",
            "sent2": "In the garden, the costate fern stood out with its unique ribbed foliage.",
            "sent3": "The costate plant seemed to be wearing a green, ribbed armor against the elements.",
            "sent4": "The costate leaves of the plant whispered in the wind, creating a rustling sound like pages turning.",
            "sent5": "The costate plant in the greenhouse resembled a miniature forest with its ribbed leaves reaching for the sunlight."
        },
        {
            "definition": "To have ribs or ridges",
            "pos": "verb",
            "sent1": "The sculptor costated the marble, carving delicate ridges into the stone.",
            "sent2": "Over time, the river costated the canyon walls, creating deep rib-like grooves.",
            "sent3": "The chef decided to costate the pie crust, adding decorative ridges along the edges.",
            "sent4": "The artist's brush costated the canvas, creating a textured surface reminiscent of ribbed fabric.",
            "sent5": "The carpenter carefully costated the wooden beam, adding ribs for both strength and decoration."
        }
    ]
}