{
    "term": "costume",
    "meanings": [
        {
            "definition": "A set of clothes in a style typical of a particular country or historical period.",
            "pos": "noun",
            "sent1": "For Halloween, she wore a pirate costume with a hat and eyepatch.",
            "sent2": "The costume for the play was designed to resemble traditional Japanese clothing.",
            "sent3": "At the costume party, everyone admired her Egyptian queen outfit.",
            "sent4": "His costume transformed him into a medieval knight ready for battle.",
            "sent5": "The elaborate costume made her look like a character from a fairy tale."
        },
        {
            "definition": "A set of clothes worn by an actor or other performer for a particular role.",
            "pos": "noun",
            "sent1": "The superhero costume was made of shiny spandex and a cape.",
            "sent2": "The theater company provided each actor with a unique costume for the production.",
            "sent3": "In the comedy skit, the costume for the chicken suit was surprisingly realistic.",
            "sent4": "She put on the costume of a detective to solve the mystery at the party.",
            "sent5": "The costume of a clown made everyone laugh with its colorful wig and oversized shoes."
        },
        {
            "definition": "A set of clothes worn in a particular situation or for a particular activity.",
            "pos": "noun",
            "sent1": "The scuba diving costume included a wetsuit, flippers, and a mask.",
            "sent2": "The protective costume for handling hazardous materials was essential for safety.",
            "sent3": "The astronaut costume for the school play had a helmet and silver jumpsuit.",
            "sent4": "She put on her chef costume and apron to help bake cookies in the kitchen.",
            "sent5": "The firefighter costume had a bright red jacket and a helmet with a visor."
        }
    ]
}