{
    "term": "costmary",
    "meanings": [
        {
            "definition": "A perennial herb with aromatic leaves used in cooking and medicine.",
            "pos": "noun",
            "sent1": "I planted costmary in my garden to use its fragrant leaves for cooking.",
            "sent2": "The costmary plant in the backyard has aromatic leaves perfect for seasoning dishes.",
            "sent3": "The costmary herb decided to join the kitchen adventures and add flavor to the meals.",
            "sent4": "The costmary's aromatic leaves danced in the air, enhancing the dish's taste.",
            "sent5": "The costmary's aromatic leaves filled the kitchen with a delightful scent, making cooking a joy."
        },
        {
            "definition": "The dried leaves of the costmary plant used to flavor food and drinks.",
            "pos": "noun",
            "sent1": "I sprinkled some crushed costmary on the salad for a unique flavor.",
            "sent2": "Costmary leaves are often dried and crushed to enhance the taste of various dishes.",
            "sent3": "The costmary leaves took a break from the plant to jazz up the salad.",
            "sent4": "The essence of costmary leaves transformed the drink into a delightful concoction.",
            "sent5": "The aroma of costmary leaves infused the food with a special touch, pleasing everyone's taste buds."
        },
        {
            "definition": "A plant of the mint family with fragrant leaves.",
            "pos": "noun",
            "sent1": "The costmary plant in the garden belongs to the mint family and has aromatic leaves.",
            "sent2": "Costmary, a mint family member, adds a pleasant fragrance to the surroundings.",
            "sent3": "The minty costmary plant shared its secrets for having such fragrant leaves.",
            "sent4": "The costmary plant whispered minty tales to the other herbs, spreading its aromatic charm.",
            "sent5": "The fragrant leaves of the costmary plant invited bees and butterflies, creating a lively garden scene."
        }
    ]
}