{
    "term": "costards",
    "meanings": [
        {
            "definition": "A type of apple",
            "pos": "noun",
            "sent1": "I picked some juicy costards from the tree.",
            "sent2": "The costards at the market looked delicious.",
            "sent3": "The costards rolled off the table and caused a fruity mess.",
            "sent4": "Her smile was as bright as a basket of costards.",
            "sent5": "The costards were like little balls of sunshine."
        },
        {
            "definition": "A type of hat",
            "pos": "noun",
            "sent1": "He tipped his costards to greet the guests.",
            "sent2": "The gentleman wore a stylish costards to the party.",
            "sent3": "The costards flew off in the wind, making everyone laugh.",
            "sent4": "Her thoughts were hidden under the brim of her costards.",
            "sent5": "The costards added a touch of elegance to his outfit."
        },
        {
            "definition": "A type of dance",
            "pos": "noun",
            "sent1": "The dancers moved gracefully to the rhythm of the costards.",
            "sent2": "She learned the steps of the costards for the performance.",
            "sent3": "The costards twirled around the dance floor in perfect harmony.",
            "sent4": "His feet tapped to the beat of the lively costards.",
            "sent5": "The costards brought joy to the audience with their vibrant moves."
        },
        {
            "definition": "A type of weapon",
            "pos": "noun",
            "sent1": "The knight wielded his costards with skill in battle.",
            "sent2": "The soldiers trained with the sharp costards for combat.",
            "sent3": "The costards gleamed menacingly in the sunlight.",
            "sent4": "His words were as cutting as a blade of costards.",
            "sent5": "The costards were a symbol of power and strength on the battlefield."
        }
    ]
}