{
    "term": "cothurns",
    "meanings": [
        {
            "definition": "A type of ancient Greek or Roman boot with a thick sole and high heel.",
            "pos": "noun",
            "sent1": "In the play, the actor wore cothurns to appear taller and more imposing.",
            "sent2": "The museum displayed a pair of cothurns worn by a famous Greek warrior.",
            "sent3": "The comedian tried to walk in cothurns but kept tripping over the exaggerated heels.",
            "sent4": "Her confidence rose as she stepped into the cothurns of leadership.",
            "sent5": "The sound of the actor's cothurns echoed through the ancient amphitheater."
        },
        {
            "definition": "A type of theatrical footwear worn by actors in ancient Greek tragedies.",
            "pos": "noun",
            "sent1": "The actors rehearsed their lines while adjusting their cothurns backstage.",
            "sent2": "The costume designer carefully selected the perfect cothurns for the tragic scene.",
            "sent3": "The actors joked about swapping their cothurns for sneakers during the comedy act.",
            "sent4": "She felt the weight of her character's emotions with each step in the cothurns.",
            "sent5": "The audience gasped as the actor's cothurns clacked on the stage in the climactic moment."
        },
        {
            "definition": "Elevated or exaggerated style of speech or writing.",
            "pos": "noun",
            "sent1": "The poet's words soared to new heights, draped in cothurns of eloquence.",
            "sent2": "The politician's speech was filled with grandiose cothurns to captivate the audience.",
            "sent3": "The children giggled at the teacher's attempt to use cothurns in a story about a talking dog.",
            "sent4": "Her love for him was expressed in cothurns of passion that resonated with everyone.",
            "sent5": "The author's cothurns of imagination led readers on a magical journey through the enchanted forest."
        }
    ]
}