{
    "term": "cotillion",
    "meanings": [
        {
            "definition": "A formal ball or dance, especially one featuring debutantes.",
            "pos": "noun",
            "sent1": "The cotillion was a grand event where young ladies were introduced to society.",
            "sent2": "The annual cotillion was the highlight of the social calendar.",
            "sent3": "At the cotillion, the debutantes twirled in their elegant gowns, capturing everyone's attention.",
            "sent4": "The cotillion was a whirlwind of music and laughter, like a magical evening.",
            "sent5": "The chandeliers sparkled above the cotillion, casting a dreamy glow over the dancers."
        },
        {
            "definition": "A lively French dance resembling a quadrille.",
            "pos": "noun",
            "sent1": "The cotillion was a joyful dance with intricate steps and lively music.",
            "sent2": "Everyone joined in the cotillion, moving in sync to the cheerful rhythm.",
            "sent3": "The cotillion turned into a hilarious mix-up of steps, causing laughter all around.",
            "sent4": "The cotillion was a whirl of movement, like a colorful painting coming to life.",
            "sent5": "The dancers spun and weaved in the cotillion, creating a vibrant spectacle."
        },
        {
            "definition": "A formal social gathering or party.",
            "pos": "noun",
            "sent1": "The cotillion was a sophisticated affair with guests dressed in their finest attire.",
            "sent2": "The elegant decorations set the perfect ambiance for the cotillion.",
            "sent3": "The cotillion was a delightful mix of conversation and laughter, making it a memorable evening.",
            "sent4": "The cotillion was a gathering of friends and family, celebrating in style.",
            "sent5": "The atmosphere at the cotillion was filled with warmth and joy, creating lasting memories for all."
        }
    ]
}