{
    "term": "cotyledon",
    "meanings": [
        {
            "definition": "The primary leaf of the embryo of seed plants, which stores food for the developing plant.",
            "pos": "noun",
            "sent1": "The cotyledon of the seed holds food for the young plant.",
            "sent2": "When the seed sprouts, the cotyledon emerges to nourish the growing plant.",
            "sent3": "The cotyledon was like a lunchbox for the baby plant, packed with nutrients.",
            "sent4": "The cotyledon is the plant's first meal, a tiny treasure chest of sustenance.",
            "sent5": "The cotyledon is a vital pantry for the plant, stocking up on essential nutrients."
        },
        {
            "definition": "A leaf of the embryo of a seed plant, which becomes the first leaf upon germination.",
            "pos": "noun",
            "sent1": "After germination, the cotyledon transforms into the plant's first leaf.",
            "sent2": "The cotyledon unfurls as the initial leaf when the seed begins to grow.",
            "sent3": "The cotyledon was like a green flag signaling the start of the plant's growth.",
            "sent4": "The cotyledon is the plant's pioneer, leading the way for future leaves.",
            "sent5": "The cotyledon is the plant's opening act, setting the stage for further growth."
        },
        {
            "definition": "A seed leaf in a plant embryo, which provides nutrients for the developing plant.",
            "pos": "noun",
            "sent1": "The cotyledon acts as a nutrient reservoir for the young plant.",
            "sent2": "Nutrients stored in the cotyledon fuel the plant's early growth.",
            "sent3": "The cotyledon was like a tiny kitchen, cooking up nutrients for the plant.",
            "sent4": "The cotyledon is the plant's fuel station, supplying energy for growth.",
            "sent5": "The cotyledon is the plant's treasure trove, packed with essential nutrients."
        }
    ]
}