{
    "term": "coucher",
    "meanings": [
        {
            "definition": "One who couches or puts to bed.",
            "pos": "noun",
            "sent1": "The coucher gently tucked the child into bed.",
            "sent2": "The coucher at the daycare ensured all the kids were comfortable for nap time.",
            "sent3": "The coucher made sure the teddy bear was also tucked in for the night.",
            "sent4": "The coucher of dreams guided the children to peaceful sleep.",
            "sent5": "The coucher sang a lullaby to help the baby fall asleep."
        },
        {
            "definition": "A piece of furniture for reclining or sleeping on.",
            "pos": "noun",
            "sent1": "The cozy coucher in the living room was perfect for relaxing.",
            "sent2": "The hotel room had a comfortable coucher for guests to rest on.",
            "sent3": "The old coucher in the attic was covered in dust and memories.",
            "sent4": "The coucher by the window offered a view of the garden.",
            "sent5": "The outdoor coucher was ideal for stargazing on summer nights."
        },
        {
            "definition": "To lay down or recline.",
            "pos": "verb",
            "sent1": "After a long day, she wanted to coucher on the sofa.",
            "sent2": "He liked to coucher on the grass and watch the clouds go by.",
            "sent3": "The cat decided to coucher on the warm spot by the fireplace.",
            "sent4": "The tired hiker finally had a chance to coucher under the shade of a tree.",
            "sent5": "The sunbather planned to coucher by the pool all afternoon."
        },
        {
            "definition": "To put to bed.",
            "pos": "verb",
            "sent1": "The mother would coucher her baby after reading a bedtime story.",
            "sent2": "It was time to coucher the children and say goodnight.",
            "sent3": "The babysitter had to coucher the kids before the parents came home.",
            "sent4": "The nurse would coucher the patients in the hospital ward.",
            "sent5": "The shepherd would coucher the sheep in the barn at night."
        }
    ]
}