{
    "term": "counterinflationary",
    "meanings": [
        {
            "definition": "Acting against inflation.",
            "pos": "adjective",
            "sent1": "The government implemented counterinflationary measures to control rising prices.",
            "sent2": "Counterinflationary policies are crucial in stabilizing the economy.",
            "sent3": "The superhero's counterinflationary cape kept the city safe from skyrocketing costs.",
            "sent4": "Her sharp wit was like a counterinflationary shield against the inflation monster.",
            "sent5": "The counterinflationary strategy was a beacon of hope in the fight against economic instability."
        },
        {
            "definition": "Intended to prevent or reduce inflation.",
            "pos": "adjective",
            "sent1": "Investors welcomed the company's counterinflationary approach to pricing.",
            "sent2": "Counterinflationary measures can help maintain the purchasing power of the currency.",
            "sent3": "The magician's hat seemed to have a counterinflationary effect on the prices of goods inside.",
            "sent4": "Her smile acted as a counterinflationary force, keeping the mood light and positive.",
            "sent5": "The counterinflationary plan was like a shield protecting the economy from price hikes."
        },
        {
            "definition": "Opposing inflation.",
            "pos": "adjective",
            "sent1": "The economist proposed a counterinflationary policy to combat rising costs.",
            "sent2": "Counterinflationary measures aim to keep the economy stable.",
            "sent3": "The cat's playful antics had a counterinflationary effect on the seriousness of the meeting.",
            "sent4": "Her determination was a counterinflationary force pushing back against economic pressures.",
            "sent5": "The counterinflationary stance was a bold move against the threat of inflation."
        }
    ]
}