{
    "term": "countersurveillance",
    "meanings": [
        {
            "definition": "Actions taken to prevent or thwart surveillance by others.",
            "pos": "noun",
            "sent1": "The team used countersurveillance to avoid being followed by the suspicious individuals.",
            "sent2": "The government agency employed countersurveillance to protect sensitive information.",
            "sent3": "The cat practiced countersurveillance to catch the sneaky mouse.",
            "sent4": "Her intuition acted as a form of countersurveillance against potential threats.",
            "sent5": "The ninja's stealth was like a form of countersurveillance in the shadows."
        },
        {
            "definition": "The act of monitoring and detecting surveillance activities.",
            "pos": "noun",
            "sent1": "The security guard's job involved countersurveillance to ensure no unauthorized filming occurred.",
            "sent2": "The countersurveillance team quickly identified the hidden cameras in the room.",
            "sent3": "The robot's malfunction led to hilarious countersurveillance mishaps.",
            "sent4": "Her attention to detail made her a natural at countersurveillance work.",
            "sent5": "The eagle's keen eyes provided excellent countersurveillance over the forest."
        },
        {
            "definition": "Equipment or techniques used to detect and prevent surveillance.",
            "pos": "noun",
            "sent1": "The company invested in advanced countersurveillance gear to protect their trade secrets.",
            "sent2": "The spy relied on high-tech countersurveillance tools to evade detection.",
            "sent3": "The magician's hat contained surprising countersurveillance gadgets.",
            "sent4": "His wit was his best countersurveillance tool in the corporate world.",
            "sent5": "The encryption software acted as a digital countersurveillance shield for the data."
        }
    ]
}