{
    "term": "counterguerillas",
    "meanings": [
        {
            "definition": "counterguerillas: a military unit trained to operate in small groups behind enemy lines",
            "pos": "noun",
            "sent1": "The counterguerillas stealthily moved through the forest to ambush the enemy.",
            "sent2": "The counterguerillas received special training to navigate enemy territory undetected.",
            "sent3": "The counterguerillas decided to have a surprise party behind enemy lines.",
            "sent4": "The counterguerillas were like shadows, striking swiftly and disappearing just as fast.",
            "sent5": "The counterguerillas were the silent protectors of their country, unseen but always ready to defend."
        },
        {
            "definition": "counterguerillas: the act of engaging in guerrilla warfare against an enemy force",
            "pos": "noun",
            "sent1": "The counterguerillas launched a surprise attack on the enemy camp.",
            "sent2": "The counterguerillas used guerrilla tactics to disrupt the enemy's supply lines.",
            "sent3": "The counterguerillas decided to have a paintball match against the enemy.",
            "sent4": "The counterguerillas fought with the cunning of a fox, outsmarting their foes at every turn.",
            "sent5": "The counterguerillas were like ghosts, appearing out of nowhere to strike fear into the enemy's hearts."
        },
        {
            "definition": "counterguerillas: to fight against guerrilla forces in a military operation",
            "pos": "verb",
            "sent1": "The soldiers were ordered to counterguerilla the enemy forces hiding in the mountains.",
            "sent2": "The army counterguerillaed the guerrilla fighters with precision and determination.",
            "sent3": "The general decided to counterguerilla by challenging the guerrillas to a dance-off.",
            "sent4": "The troops counterguerillaed with the ferocity of a lion protecting its pride.",
            "sent5": "The commander's strategy was to counterguerilla swiftly and decisively, catching the enemy off guard."
        }
    ]
}