{
    "term": "counterconvention",
    "meanings": [
        {
            "definition": "A belief or practice that goes against established norms or conventions.",
            "pos": "noun",
            "sent1": "Her counterconvention of wearing pajamas to work raised eyebrows.",
            "sent2": "The protest was a powerful counterconvention against the status quo.",
            "sent3": "At the fancy dinner, his counterconvention of eating dessert first caused a stir.",
            "sent4": "In a world of black and white, she was a burst of color, a counterconvention in every way.",
            "sent5": "The artist's work was a beautiful counterconvention, challenging viewers to see beyond the ordinary."
        },
        {
            "definition": "An event or gathering that opposes or challenges traditional conventions.",
            "pos": "noun",
            "sent1": "The underground concert was a thrilling counterconvention of mainstream music.",
            "sent2": "The street parade was a lively counterconvention to the usual quiet neighborhood.",
            "sent3": "The surprise party was a delightful counterconvention to his usual birthday routine.",
            "sent4": "The art exhibition was a visual counterconvention, showcasing unconventional pieces.",
            "sent5": "The flash mob was a spontaneous counterconvention, surprising everyone in the square."
        },
        {
            "definition": "To act in opposition to established conventions or norms.",
            "pos": "verb",
            "sent1": "She decided to counterconvention by starting her own business instead of following the traditional career path.",
            "sent2": "The students planned to counterconvention by organizing a peaceful protest against the new school policy.",
            "sent3": "He liked to counterconvention by taking the scenic route home, enjoying the journey more than the destination.",
            "sent4": "The rebellious artist chose to counterconvention by creating art that challenged societal expectations.",
            "sent5": "The young inventor sought to counterconvention by designing a device that revolutionized everyday tasks."
        }
    ]
}