{
    "term": "counter",
    "meanings": [
        {
            "definition": "A flat surface on which goods are counted or displayed for sale.",
            "pos": "noun",
            "sent1": "The cashier placed the items on the counter to ring them up.",
            "sent2": "The bakery had a beautiful marble counter to showcase their pastries.",
            "sent3": "The mischievous cat jumped onto the counter and knocked over the display.",
            "sent4": "Her smile was a counter to the gloomy atmosphere in the room.",
            "sent5": "The shiny counter gleamed under the store lights, inviting customers to browse."
        },
        {
            "definition": "A device used to keep track of a number or amount.",
            "pos": "noun",
            "sent1": "The digital counter displayed the total number of visitors to the museum.",
            "sent2": "The old-fashioned cash register had a mechanical counter for coins.",
            "sent3": "The kids played with the counter, pressing the buttons to see the numbers change.",
            "sent4": "Her laughter served as a counter to the seriousness of the meeting.",
            "sent5": "The counter clicked with each rotation, marking the passage of time."
        },
        {
            "definition": "In opposition to; in response to.",
            "pos": "preposition",
            "sent1": "She smiled back at him as a counter to his frown.",
            "sent2": "The team decided to play defensively as a counter to the opponent's aggressive strategy.",
            "sent3": "His joke was a witty counter to her teasing remark.",
            "sent4": "The bright colors of the painting stood as a counter to the dullness of the room.",
            "sent5": "The warm sunshine was a perfect counter to the chilly breeze."
        },
        {
            "definition": "A person or thing that opposes or is opposite to another.",
            "pos": "noun",
            "sent1": "The superhero was a formidable counter to the villain's evil plans.",
            "sent2": "The new product was a strong counter to the competitor's bestseller.",
            "sent3": "The comedian's quick wit was a perfect counter to the serious news anchor.",
            "sent4": "Her calm demeanor was a counter to his nervous energy.",
            "sent5": "The majestic mountain stood as a natural counter to the vast desert landscape."
        }
    ]
}