{
    "term": "coupled",
    "meanings": [
        {
            "definition": "Joined together",
            "pos": "adjective",
            "sent1": "The two trees were coupled by their intertwined branches.",
            "sent2": "The coupled hands of the friends showed their strong bond.",
            "sent3": "The coupled ducks waddled in unison, amusing the onlookers.",
            "sent4": "The coupled gears worked seamlessly, like a well-oiled machine.",
            "sent5": "The coupled puzzle pieces fit perfectly, completing the picture."
        },
        {
            "definition": "Connected",
            "pos": "adjective",
            "sent1": "The coupled wires ensured a steady flow of electricity.",
            "sent2": "The coupled roads made it easy to navigate the city.",
            "sent3": "The coupled train cars danced along the tracks, a whimsical sight.",
            "sent4": "Their thoughts were coupled, flowing effortlessly between them.",
            "sent5": "The coupled devices communicated flawlessly, enhancing productivity."
        },
        {
            "definition": "Paired",
            "pos": "adjective",
            "sent1": "The coupled socks were neatly arranged in the drawer.",
            "sent2": "The coupled shoes sat by the door, ready for the morning.",
            "sent3": "The coupled mittens kept the child's hands warm and cozy.",
            "sent4": "The coupled bookends held up the row of books with ease.",
            "sent5": "The coupled earrings sparkled in the sunlight, a perfect match."
        },
        {
            "definition": "Associated",
            "pos": "adjective",
            "sent1": "The coupled colors created a harmonious palette.",
            "sent2": "The coupled scents reminded her of a distant memory.",
            "sent3": "The coupled flavors in the dish surprised and delighted the guests.",
            "sent4": "Their coupled names were often mistaken for each other.",
            "sent5": "The coupled sounds of nature filled the air with tranquility."
        },
        {
            "definition": "Combined",
            "pos": "adjective",
            "sent1": "The coupled ingredients formed a delicious meal.",
            "sent2": "The coupled efforts of the team led to a successful project.",
            "sent3": "The coupled voices of the choir resonated through the hall.",
            "sent4": "Their coupled strengths complemented each other perfectly.",
            "sent5": "The coupled elements of the design created a stunning effect."
        }
    ]
}