{
    "term": "courtesying",
    "meanings": [
        {
            "definition": "The act of performing a courteous gesture, such as a bow or curtsy.",
            "pos": "noun",
            "sent1": "During the play, the princess ended her performance with a graceful courtesying.",
            "sent2": "At the royal ball, the guests greeted each other with elegant courtesyings.",
            "sent3": "The robot surprised everyone by courtesying to the queen, causing laughter in the court.",
            "sent4": "Her courtesying was like a gentle breeze, leaving a lasting impression on the audience.",
            "sent5": "The courtesying of the young girl was so perfect, it seemed like a scene from a fairy tale."
        },
        {
            "definition": "To show respect or politeness through a formal gesture.",
            "pos": "verb",
            "sent1": "She was courtesying to the elderly lady as a sign of respect.",
            "sent2": "The students were courtesying to their teacher at the end of the school year.",
            "sent3": "The cat surprised us by courtesying to the dog, creating a funny moment.",
            "sent4": "His courtesying to authority was like a shield, protecting him from trouble.",
            "sent5": "Courtesying before entering the dojo was a tradition that showed humility and respect."
        },
        {
            "definition": "A formal act of politeness or respect, typically performed by women.",
            "pos": "noun",
            "sent1": "In the olden days, a lady's courtesying was a sign of her upbringing.",
            "sent2": "The queen's courtesying was a symbol of her royal grace and elegance.",
            "sent3": "The cat mimicked the lady's courtesying, creating a comical sight.",
            "sent4": "Her courtesying was like a delicate flower blooming in the garden of manners.",
            "sent5": "The courtesying of the women at the event added a touch of sophistication to the gathering."
        }
    ]
}