{
    "term": "courtesy",
    "meanings": [
        {
            "definition": "Polite behavior",
            "pos": "noun",
            "sent1": "She always showed courtesy by saying please and thank you.",
            "sent2": "His courtesy towards elders was admired by everyone.",
            "sent3": "The robot's programmed courtesy made it say 'excuse me' when passing by.",
            "sent4": "The forest's silence was a courtesy to the sleeping animals.",
            "sent5": "The teacher's courtesy in listening to each student made them feel valued."
        },
        {
            "definition": "A polite gesture or action",
            "pos": "noun",
            "sent1": "He offered his seat on the bus as a courtesy to the elderly lady.",
            "sent2": "Leaving a small tip at the restaurant is a common courtesy.",
            "sent3": "The cat's courtesy of bringing a mouse as a gift was not appreciated by its owner.",
            "sent4": "The clouds parted as if in courtesy to the rising sun.",
            "sent5": "Her courtesy of holding the door open for others was a kind gesture."
        },
        {
            "definition": "Consideration for others",
            "pos": "noun",
            "sent1": "Showing courtesy by letting others go first in line is polite.",
            "sent2": "His courtesy in sharing his umbrella during the rain was thoughtful.",
            "sent3": "The tree's courtesy in providing shade was a relief on a hot day.",
            "sent4": "The ocean's waves crashed with a loud courtesy, warning sailors of the storm.",
            "sent5": "The team's courtesy in waiting for their injured player to catch up showed unity."
        },
        {
            "definition": "A polite or respectful act or expression",
            "pos": "noun",
            "sent1": "Her courtesy of sending a thank-you card was appreciated by the host.",
            "sent2": "The employee's courtesy in addressing customers made them feel valued.",
            "sent3": "The bird's courtesy of singing a morning song woke up the entire neighborhood.",
            "sent4": "The sun's courtesy of painting the sky with colors at sunset was breathtaking.",
            "sent5": "The artist's courtesy in signing each painting added a personal touch."
        }
    ]
}