{
    "term": "courtlier",
    "meanings": [
        {
            "definition": "Polite and refined in behavior or manners.",
            "pos": "adjective",
            "sent1": "She always speaks in a courtlier tone when talking to her elders.",
            "sent2": "The gentleman's courtlier demeanor impressed everyone at the party.",
            "sent3": "Even the grumpy old cat seemed to appreciate the courtlier way the children played around it.",
            "sent4": "Her courtlier approach to conflict resolution was like a soothing balm in the heated argument.",
            "sent5": "The courtlier handshake he offered left a lasting impression on his new colleagues."
        },
        {
            "definition": "Characteristic of or suitable for a royal court.",
            "pos": "adjective",
            "sent1": "The queen's courtlier attire was adorned with jewels and gold embroidery.",
            "sent2": "The palace was decorated in a courtlier style, fit for a king.",
            "sent3": "The courtlier music playing in the background made the event feel regal and grand.",
            "sent4": "The courtlier language used in the royal decree added an air of importance to the announcement.",
            "sent5": "The courtlier manners of the royal family set them apart from the common folk."
        },
        {
            "definition": "Showing manners and respect towards others, especially in a formal setting.",
            "pos": "adjective",
            "sent1": "He gave a courtlier bow before entering the grand hall.",
            "sent2": "The students were taught to be courtlier when addressing their teachers.",
            "sent3": "The courtlier greetings exchanged between the diplomats set a positive tone for the negotiations.",
            "sent4": "Her courtlier behavior at the dinner party earned her compliments from the host.",
            "sent5": "The courtlier treatment of guests in their home reflected their upbringing and values."
        }
    ]
}