{
    "term": "court",
    "meanings": [
        {
            "definition": "A place where legal matters are heard and decided",
            "pos": "noun",
            "sent1": "In the court, the judge listened to the arguments from both sides.",
            "sent2": "The court was filled with people waiting for the verdict.",
            "sent3": "The court was like a stage where the lawyers performed their legal drama.",
            "sent4": "Her eyes darted around the court, searching for any signs of doubt.",
            "sent5": "The grandeur of the court made even the accused feel small and insignificant."
        },
        {
            "definition": "To attempt to gain the favor or support of someone",
            "pos": "verb",
            "sent1": "He tried to court her with flowers and chocolates.",
            "sent2": "The politician knew how to court the voters with promises.",
            "sent3": "His attempts to court her attention were met with a polite smile.",
            "sent4": "She decided to court danger by going on the thrilling roller coaster ride.",
            "sent5": "The singer's performance was designed to court the audience's admiration."
        },
        {
            "definition": "An area marked off for playing certain sports, such as basketball or tennis",
            "pos": "noun",
            "sent1": "The basketball court was buzzing with players practicing for the big game.",
            "sent2": "Children were playing happily on the playground court.",
            "sent3": "The court was a battleground where teams fought for victory.",
            "sent4": "She ruled the tennis court with her powerful serves and swift footwork.",
            "sent5": "The court echoed with the sounds of sneakers squeaking and balls bouncing."
        },
        {
            "definition": "The residence of a monarch or other high dignitary",
            "pos": "noun",
            "sent1": "The royal court was a place of luxury and extravagance.",
            "sent2": "The king held court in the grand palace, surrounded by advisors.",
            "sent3": "The court was abuzz with gossip about the queen's latest decree.",
            "sent4": "She felt like a stranger in the opulent court of the foreign dignitary.",
            "sent5": "The court was a symbol of power and authority, with its towering walls and imposing gates."
        }
    ]
}