{
    "term": "cousinages",
    "meanings": [
        {
            "definition": "The relationship between cousins.",
            "pos": "noun",
            "sent1": "Family reunions are filled with cousinages, with everyone catching up and sharing stories.",
            "sent2": "I have a close cousinages with my cousin Sarah; we grew up together and are like siblings.",
            "sent3": "At the family picnic, the cousinages were all playing games and laughing together.",
            "sent4": "The cousinages in our family tree branch out far and wide, connecting us in unexpected ways.",
            "sent5": "The bond of cousinages is special, as cousins can be both friends and family at the same time."
        },
        {
            "definition": "The state of being cousins.",
            "pos": "noun",
            "sent1": "Our cousinages began when our parents got married and we became family.",
            "sent2": "Growing up, I always enjoyed the cousinages I had with my relatives during holidays.",
            "sent3": "The cousinages between us mean we have a built-in support system for life's ups and downs.",
            "sent4": "In the cousinages of our family, we share not just blood but also memories and traditions.",
            "sent5": "The cousinages we share create a sense of belonging and togetherness that is truly special."
        },
        {
            "definition": "The collective cousins in a family.",
            "pos": "noun",
            "sent1": "During family gatherings, the cousinages always have a great time playing games and chatting.",
            "sent2": "The cousinages in our family range from toddlers to grandparents, creating a diverse group.",
            "sent3": "The cousinages decided to organize a surprise party for their grandparents' anniversary.",
            "sent4": "Our family's cousinages are like a big, extended family that we can always rely on.",
            "sent5": "The cousinages in our family are like a close-knit community, supporting each other through thick and thin."
        }
    ]
}