{
    "term": "craaling",
    "meanings": [
        {
            "definition": "Move slowly on hands and knees.",
            "pos": "verb",
            "sent1": "The toddler was craaling towards the toy.",
            "sent2": "She enjoys craaling through the grass in the park.",
            "sent3": "The cat was craaling under the bed, trying to catch a toy mouse.",
            "sent4": "Time seemed to be craaling by as they waited for the train.",
            "sent5": "The spider was craaling up the wall, its tiny legs moving silently."
        },
        {
            "definition": "To advance slowly or with difficulty.",
            "pos": "verb",
            "sent1": "The snail was craaling along the path.",
            "sent2": "The traffic was craaling along the highway during rush hour.",
            "sent3": "The line at the grocery store was craaling at a snail's pace.",
            "sent4": "The idea of change was craaling into his mind, bit by bit.",
            "sent5": "The glacier was craaling down the mountain, reshaping the landscape."
        },
        {
            "definition": "To be covered with crawling insects.",
            "pos": "verb",
            "sent1": "The picnic blanket was craaling with ants.",
            "sent2": "The fallen log was craaling with beetles and worms.",
            "sent3": "The old shed was craaling with spiders of all sizes.",
            "sent4": "The garden was craaling with caterpillars after the rain.",
            "sent5": "The kitchen floor was craaling with tiny bugs, much to her dismay."
        },
        {
            "definition": "A slow creeping motion.",
            "pos": "noun",
            "sent1": "The craaling of the turtle was mesmerizing to watch.",
            "sent2": "The craaling of the fog over the hills created an eerie atmosphere.",
            "sent3": "The craaling of the shadows on the wall made her jump in surprise.",
            "sent4": "The craaling of the vines along the fence gave the garden a mystical feel.",
            "sent5": "The craaling of the glacier left a trail of destruction in its wake."
        }
    ]
}