{
    "term": "crabbing",
    "meanings": [
        {
            "definition": "To catch or attempt to catch crabs",
            "pos": "verb",
            "sent1": "We went crabbing at the beach and caught some big ones.",
            "sent2": "The fishermen were crabbing early in the morning by the pier.",
            "sent3": "After crabbing for hours, we finally got a delicious dinner.",
            "sent4": "She was crabbing for compliments after her performance.",
            "sent5": "Crabbing requires patience and a steady hand to succeed."
        },
        {
            "definition": "Moving sideways in a crab-like manner",
            "pos": "adverb",
            "sent1": "The crabbing toddler shuffled across the room playfully.",
            "sent2": "The crabbing crab scuttled along the sandy shore.",
            "sent3": "The robot moved crabbingly, mimicking a crab's sideways motion.",
            "sent4": "The dancer's movements on stage were crabbing, captivating the audience.",
            "sent5": "The sideways crabbing motion was both amusing and intriguing."
        },
        {
            "definition": "A method of fishing using a crab trap or net",
            "pos": "noun",
            "sent1": "He learned the art of crabbing from his grandfather at a young age.",
            "sent2": "The locals shared their secret spots for successful crabbing.",
            "sent3": "The family enjoyed a day of crabbing by the lake, hoping for a good catch.",
            "sent4": "Crabbing with a net requires skill and precision to trap the elusive creatures.",
            "sent5": "The old fisherman's tales were filled with adventures of crabbing in the bay."
        },
        {
            "definition": "A feeling of irritation or annoyance",
            "pos": "noun",
            "sent1": "Her constant complaints were a source of crabbing for everyone around her.",
            "sent2": "The long wait in line caused a sense of crabbing among the customers.",
            "sent3": "The unexpected delay led to a collective feeling of crabbing in the waiting room.",
            "sent4": "The persistent buzzing of the fly became a constant crabbing in the peaceful room.",
            "sent5": "The repetitive sound of the dripping faucet was a subtle form of crabbing in the quiet house."
        }
    ]
}