{
    "term": "cracker",
    "meanings": [
        {
            "definition": "A thin, crisp biscuit",
            "pos": "noun",
            "sent1": "I love to eat a cracker with cheese.",
            "sent2": "She packed some crackers for the picnic.",
            "sent3": "The cracker crumbled in my hand, making a mess.",
            "sent4": "The cracker was as crunchy as autumn leaves underfoot.",
            "sent5": "The salty cracker melted in my mouth like a snowflake on a warm day."
        },
        {
            "definition": "A person or thing that cracks",
            "pos": "noun",
            "sent1": "The nutcracker is a useful cracker.",
            "sent2": "The earthquake caused the cracker in the wall.",
            "sent3": "The cracker in the sidewalk made me stumble.",
            "sent4": "His words were like a cracker, breaking the silence.",
            "sent5": "The cracker in the ice signaled the start of the race."
        },
        {
            "definition": "A person who breaks into computer systems",
            "pos": "noun",
            "sent1": "The cracker hacked into the system.",
            "sent2": "The company hired a cracker to test their security.",
            "sent3": "The cracker left a digital trail behind.",
            "sent4": "The cracker's code cracked the encryption like a safe.",
            "sent5": "The cracker's skills were as sharp as a knife in the dark."
        },
        {
            "definition": "A loud, harsh noise",
            "pos": "noun",
            "sent1": "The thunder made a loud cracker in the sky.",
            "sent2": "The cracker of the whip echoed through the valley.",
            "sent3": "The cracker of the old floorboards startled the cat.",
            "sent4": "The cracker of the fireworks lit up the night sky.",
            "sent5": "The cracker of the car backfiring made everyone jump."
        },
        {
            "definition": "A firework that makes a sharp noise",
            "pos": "noun",
            "sent1": "The kids enjoyed watching the colorful crackers in the sky.",
            "sent2": "The crackers at the celebration were dazzling.",
            "sent3": "The cracker burst with a bang, lighting up the darkness.",
            "sent4": "The cracker exploded like a tiny star in the night.",
            "sent5": "The cracker's sound was as sharp as a needle piercing the silence."
        }
    ]
}