{
    "term": "cracked",
    "meanings": [
        {
            "definition": "Damaged or broken",
            "pos": "adjective",
            "sent1": "The cracked vase lay in pieces on the floor.",
            "sent2": "The old mirror was cracked from top to bottom.",
            "sent3": "She tried to use the cracked phone, but the screen remained dark.",
            "sent4": "The ice on the pond cracked loudly under the weight of the skater.",
            "sent5": "The cracked window let in a chilly draft, making the room cold."
        },
        {
            "definition": "Mentally unstable",
            "pos": "adjective",
            "sent1": "The cracked man spoke to imaginary friends in the park.",
            "sent2": "Her behavior became increasingly erratic and cracked.",
            "sent3": "Despite his cracked behavior, he always had a smile on his face.",
            "sent4": "The cracked patient believed he was a superhero from a comic book.",
            "sent5": "The cracked artist painted wild and colorful scenes that puzzled viewers."
        },
        {
            "definition": "To break or cause to break open",
            "pos": "verb",
            "sent1": "He cracked the nut open with a nutcracker.",
            "sent2": "The egg cracked open, revealing a fluffy chick inside.",
            "sent3": "The detective cracked the safe using his skills and tools.",
            "sent4": "The thunder cracked loudly as the storm approached.",
            "sent5": "She cracked the code and unlocked the secret message."
        },
        {
            "definition": "To solve or decipher",
            "pos": "verb",
            "sent1": "She finally cracked the difficult math problem after hours of studying.",
            "sent2": "The detective cracked the case and caught the criminal.",
            "sent3": "He cracked the riddle by thinking outside the box.",
            "sent4": "The archaeologist cracked the ancient code and revealed the hidden treasure.",
            "sent5": "After many attempts, he finally cracked the password and accessed the account."
        },
        {
            "definition": "To make a sharp sound",
            "pos": "verb",
            "sent1": "The whip cracked loudly in the air.",
            "sent2": "As he stepped on the dry leaves, they cracked under his feet.",
            "sent3": "The fire cracked and popped, sending sparks into the night sky.",
            "sent4": "The ice on the lake cracked as the temperature dropped.",
            "sent5": "The branches cracked under the weight of the heavy snow."
        }
    ]
}