{
    "term": "cracks",
    "meanings": [
        {
            "definition": "A narrow opening or fissure",
            "pos": "noun",
            "sent1": "The sunlight peeked through the cracks in the wall.",
            "sent2": "She fell through the cracks in the sidewalk.",
            "sent3": "The squirrel squeezed through the cracks in the fence like a tiny acrobat.",
            "sent4": "The old bridge showed cracks, like wrinkles on a face worn by time.",
            "sent5": "The sound of footsteps echoed through the cracks in the floorboards."
        },
        {
            "definition": "A sudden sharp or explosive noise",
            "pos": "noun",
            "sent1": "The thunder made loud cracks in the sky.",
            "sent2": "The firecracker exploded with a series of cracks.",
            "sent3": "The joke was so funny, it caused cracks of laughter in the room.",
            "sent4": "The ice cracked with a loud noise, like a whip in the cold air.",
            "sent5": "The sudden crack of the whip startled the horses."
        },
        {
            "definition": "A weakness or flaw in something",
            "pos": "noun",
            "sent1": "The cracks in his argument were easy to spot.",
            "sent2": "Her plan had a few cracks that needed fixing.",
            "sent3": "The team's defense showed cracks, allowing the opponent to score easily.",
            "sent4": "The vase had a tiny crack, barely visible but weakening its structure.",
            "sent5": "The cracks in the dam threatened to cause a flood."
        },
        {
            "definition": "To break or cause to break without complete separation of parts",
            "pos": "verb",
            "sent1": "He cracks the eggs into the bowl for the cake.",
            "sent2": "The ice cracks under the weight of the skater.",
            "sent3": "She cracks a smile when she sees her favorite dessert.",
            "sent4": "The whip cracks in the air, signaling the start of the race.",
            "sent5": "The old door cracks open, revealing a hidden room."
        }
    ]
}