{
    "term": "cracking",
    "meanings": [
        {
            "definition": "Breaking or causing to break open",
            "pos": "verb",
            "sent1": "She was cracking the nut with a hammer.",
            "sent2": "The earthquake caused the ground to start cracking.",
            "sent3": "The little boy was cracking open his piggy bank to buy a toy.",
            "sent4": "The detective was cracking the code to solve the mystery.",
            "sent5": "The sun was cracking the ice on the pond as it rose higher in the sky."
        },
        {
            "definition": "Very good or impressive",
            "pos": "adjective",
            "sent1": "That was a cracking goal in the soccer match!",
            "sent2": "The team put on a cracking performance at the concert.",
            "sent3": "The chef prepared a cracking meal that left everyone satisfied.",
            "sent4": "The artist's painting was cracking, capturing the beauty of the landscape.",
            "sent5": "The students gave a cracking presentation that impressed the entire class."
        },
        {
            "definition": "Making a sharp sound",
            "pos": "adjective",
            "sent1": "The cracking sound of thunder echoed through the valley.",
            "sent2": "The cracking of twigs underfoot alerted the hiker to nearby wildlife.",
            "sent3": "The cracking noise of the firewood burning added to the cozy atmosphere.",
            "sent4": "The cracking sound of the whip startled the horses into action.",
            "sent5": "The cracking noise of the ice breaking on the lake was both beautiful and eerie."
        },
        {
            "definition": "The process of extracting useful substances from raw materials",
            "pos": "noun",
            "sent1": "The cracking of crude oil produces various petroleum products.",
            "sent2": "Chemical engineers study the cracking of minerals to create new materials.",
            "sent3": "The company invested in a new cracking facility to improve production.",
            "sent4": "The cracking of ores is essential in the mining industry.",
            "sent5": "The cracking of seeds is a crucial step in the production of oils and fats."
        }
    ]
}