{
    "term": "crags",
    "meanings": [
        {
            "definition": "A steep or rugged cliff or rock face",
            "pos": "noun",
            "sent1": "The hikers carefully climbed the crags to reach the mountaintop.",
            "sent2": "The crags along the coastline provided a stunning view of the ocean.",
            "sent3": "The goats played hide-and-seek among the crags, pretending to be mountain kings.",
            "sent4": "The crags stood like ancient guardians, watching over the valley below.",
            "sent5": "The sun set behind the crags, casting long shadows across the landscape."
        },
        {
            "definition": "A rough, broken, projecting point of a rock",
            "pos": "noun",
            "sent1": "The climber found a secure foothold on the crags and continued upward.",
            "sent2": "The waves crashed against the crags, sending salty spray into the air.",
            "sent3": "The birds nested in the crags, creating a bustling community of feathered friends.",
            "sent4": "The crags jutted out from the cliff like jagged teeth, ready to bite into the sky.",
            "sent5": "The moonlight illuminated the crags, turning them into silver spires in the night."
        },
        {
            "definition": "A steep, rugged rock or cliff",
            "pos": "noun",
            "sent1": "The mountain goats skillfully navigated the crags, leaping from one to another.",
            "sent2": "The climbers marveled at the sheer size of the crags they were about to conquer.",
            "sent3": "The crags loomed overhead, casting a shadow over the weary travelers.",
            "sent4": "The crags seemed to whisper ancient tales of the land's formation to those who listened.",
            "sent5": "The storm clouds gathered above the crags, warning of impending rain."
        },
        {
            "definition": "A rugged, rocky projection on a cliff or mountain",
            "pos": "noun",
            "sent1": "The eagle perched on the crags, scanning the valley below for prey.",
            "sent2": "The climbers used ropes to descend safely down the crags to the valley floor.",
            "sent3": "The crags provided a natural shelter for the weary travelers caught in the storm.",
            "sent4": "The crags resembled the fingers of a giant reaching up from the earth towards the sky.",
            "sent5": "The sunlight danced on the crags, creating a dazzling display of light and shadow."
        }
    ]
}