{
    "term": "cranking",
    "meanings": [
        {
            "definition": "To turn a handle or key to start a machine or engine.",
            "pos": "verb",
            "sent1": "She was cranking the old car to start the engine.",
            "sent2": "He cranked the lawnmower to get it running smoothly.",
            "sent3": "The kids took turns cranking the toy car to make it zoom across the floor.",
            "sent4": "The DJ was cranking up the volume to get the party started.",
            "sent5": "With a swift motion, she began cranking the generator to power up the lights."
        },
        {
            "definition": "To move or operate something by turning a handle or key.",
            "pos": "verb",
            "sent1": "He was cranking the fishing reel to bring in a big catch.",
            "sent2": "She cranked the window open to let in some fresh air.",
            "sent3": "The old man kept cranking the music box, lost in memories of his youth.",
            "sent4": "The clockmaker carefully cranked the gears into place, ensuring perfect timing.",
            "sent5": "With a steady rhythm, she started cranking the handle to lift the heavy load."
        },
        {
            "definition": "To start or cause something to start moving or working.",
            "pos": "verb",
            "sent1": "The windmill began cranking as the breeze picked up.",
            "sent2": "He cranked the generator to provide power during the outage.",
            "sent3": "The kids were cranking the swing higher and higher, laughing with joy.",
            "sent4": "Her words cranked up the excitement in the room, sparking a lively discussion.",
            "sent5": "With a push and a pull, he managed to crank the stubborn door open."
        },
        {
            "definition": "To play music loudly and energetically.",
            "pos": "verb",
            "sent1": "The band started cranking out their hit songs to the cheering crowd.",
            "sent2": "She cranked up the radio in the car to sing along to her favorite song.",
            "sent3": "The party was in full swing, with the DJ cranking out the tunes all night.",
            "sent4": "The street performer cranked out a lively melody on his accordion.",
            "sent5": "As the sun set, the festival stage lit up with the band cranking out their final song."
        }
    ]
}