{
    "term": "cranked",
    "meanings": [
        {
            "definition": "Turned or twisted",
            "pos": "adjective",
            "sent1": "The cranked handle made the music box play a sweet melody.",
            "sent2": "The cranked knob adjusted the volume of the radio.",
            "sent3": "She cranked the toy car's wheels, making it zoom across the floor.",
            "sent4": "The cranked lid of the jar finally opened after much effort.",
            "sent5": "The cranked lever controlled the movement of the machine."
        },
        {
            "definition": "Irritated or annoyed",
            "pos": "adjective",
            "sent1": "He felt cranked when his plans were suddenly changed.",
            "sent2": "She became cranked after waiting in line for too long.",
            "sent3": "The cranked customer complained about the slow service.",
            "sent4": "The cranked expression on his face showed his frustration.",
            "sent5": "The cranked tone of her voice revealed her impatience."
        },
        {
            "definition": "Operated by a crank",
            "pos": "adjective",
            "sent1": "The cranked flashlight needed manual power to work.",
            "sent2": "The cranked music box played a nostalgic tune.",
            "sent3": "He used the cranked pencil sharpener to sharpen his pencil.",
            "sent4": "The cranked generator provided electricity during the outage.",
            "sent5": "The cranked toy car required winding up to move."
        },
        {
            "definition": "Intoxicated or high",
            "pos": "adjective",
            "sent1": "After a few drinks, he felt a bit cranked.",
            "sent2": "She seemed cranked after smoking with her friends.",
            "sent3": "The cranked partygoers danced wildly to the music.",
            "sent4": "He acted cranked at the concert, laughing at everything.",
            "sent5": "The cranked group of friends giggled uncontrollably at the jokes."
        }
    ]
}