{
    "term": "crankle",
    "meanings": [
        {
            "definition": "To cause to become irritated or annoyed.",
            "pos": "verb",
            "sent1": "His constant complaints about the noise would crankle his neighbors.",
            "sent2": "The loud music from the party next door started to crankle her nerves.",
            "sent3": "The barking dog seemed to crankle the usually calm cat, making it hiss in annoyance.",
            "sent4": "The repetitive sound of the dripping faucet began to crankle her like a mosquito buzzing in her ear.",
            "sent5": "The never-ending traffic jam began to crankle everyone's patience, causing honking and frustration."
        },
        {
            "definition": "To make a sharp turn or twist.",
            "pos": "verb",
            "sent1": "The car had to crankle sharply to avoid hitting the deer on the road.",
            "sent2": "She had to crankle the knob quickly to open the stubborn jar lid.",
            "sent3": "The unexpected plot twist in the movie seemed to crankle the audience, leaving them in awe.",
            "sent4": "The winding mountain road would crankle sharply, making the driver grip the steering wheel tightly.",
            "sent5": "The gymnast had to crankle her body in a perfect twist to execute the difficult move."
        },
        {
            "definition": "A sharp twist or turn in a road or path.",
            "pos": "noun",
            "sent1": "The hikers were surprised by the sudden crankle in the trail that led them to a beautiful waterfall.",
            "sent2": "The old map didn't show the sharp crankle in the road, causing the driver to miss the turn.",
            "sent3": "The roller coaster had a thrilling crankle that made everyone scream with excitement.",
            "sent4": "The river took a sharp crankle around the bend, revealing a hidden cave entrance.",
            "sent5": "The bike race course had a challenging crankle that tested the cyclists' skills in maneuvering sharp turns."
        }
    ]
}