{
    "term": "crawdaddies",
    "meanings": [
        {
            "definition": "A small freshwater crustacean resembling a lobster, often used as bait for fishing.",
            "pos": "noun",
            "sent1": "The kids caught some crawdaddies by the creek.",
            "sent2": "I saw a crawdaddy crawling along the riverbed.",
            "sent3": "The crawdaddies were having a party in the pond.",
            "sent4": "The crawdaddies scuttled around like tiny red lobsters.",
            "sent5": "The crawdaddies pinched at the bait with their tiny claws."
        },
        {
            "definition": "A group of crawdaddies gathered in a bucket.",
            "pos": "noun",
            "sent1": "The bucket was full of crawdaddies squirming around.",
            "sent2": "We found a bunch of crawdaddies huddled together.",
            "sent3": "The crawdaddies in the bucket seemed to be having a meeting.",
            "sent4": "The crawdaddies crowded together like a tiny army.",
            "sent5": "The crawdaddies clambered over each other in the pail."
        },
        {
            "definition": "The act of catching crawdaddies in a stream.",
            "pos": "noun",
            "sent1": "Fishing for crawdaddies is a fun summer activity.",
            "sent2": "We spent the afternoon hunting for crawdaddies in the creek.",
            "sent3": "The crawdaddies played hard to get in the stream.",
            "sent4": "Catching crawdaddies felt like a challenging treasure hunt.",
            "sent5": "The kids giggled as they chased after the elusive crawdaddies."
        },
        {
            "definition": "The flavor of crawdaddies boiled with Cajun spices.",
            "pos": "noun",
            "sent1": "The aroma of Cajun crawdaddies filled the kitchen.",
            "sent2": "I savored the taste of spicy crawdaddies at the picnic.",
            "sent3": "The crawdaddies danced in the pot as they cooked.",
            "sent4": "The Cajun crawdaddies exploded with flavor in my mouth.",
            "sent5": "The spicy crawdaddies tingled my taste buds with delight."
        }
    ]
}