{
    "term": "cream",
    "meanings": [
        {
            "definition": "The fatty part of milk that rises to the top.",
            "pos": "noun",
            "sent1": "I poured the cream over my dessert.",
            "sent2": "The cream in the milkshake made it extra rich.",
            "sent3": "The cat licked the cream off the top of the milk.",
            "sent4": "Her voice was as smooth as cream, soothing everyone around her.",
            "sent5": "The cream on the soup looked like a delicate swirl of clouds."
        },
        {
            "definition": "A thick liquid or semi-solid substance used in cooking or as a cosmetic.",
            "pos": "noun",
            "sent1": "She applied the cream to her face before going to bed.",
            "sent2": "The cake recipe called for a cup of heavy cream.",
            "sent3": "The cream smelled like fresh flowers, making her smile.",
            "sent4": "The cream oozed out of the tube like a slow-moving river.",
            "sent5": "The cream on the pie glistened under the sunlight, tempting everyone to take a bite."
        },
        {
            "definition": "To beat or churn milk or cream to make it thicker.",
            "pos": "verb",
            "sent1": "I need to cream the butter and sugar for the cake.",
            "sent2": "She used a whisk to cream the ingredients together.",
            "sent3": "The machine whirred as it started to cream the milk.",
            "sent4": "He creamed the mixture until it was smooth and fluffy.",
            "sent5": "The chef showed us how to cream the sauce for the pasta dish."
        },
        {
            "definition": "The best part of something.",
            "pos": "noun",
            "sent1": "The cream of the crop was chosen for the award.",
            "sent2": "She always aims for the cream of the opportunities.",
            "sent3": "The cream of the joke made everyone burst into laughter.",
            "sent4": "His performance was the cream of the entire show.",
            "sent5": "The cream of the book was the unexpected plot twist at the end."
        }
    ]
}