{
    "term": "crematory",
    "meanings": [
        {
            "definition": "A place where dead bodies are burned to ashes.",
            "pos": "noun",
            "sent1": "The crematory was a solemn place where bodies were turned to ashes.",
            "sent2": "Families often visit the crematory to say their final goodbyes to loved ones.",
            "sent3": "The crematory worker accidentally spilled coffee on his uniform during a busy day.",
            "sent4": "The crematory stood tall like a silent guardian, watching over the deceased.",
            "sent5": "The billowing smoke from the crematory chimney filled the air with a distinct scent."
        },
        {
            "definition": "Relating to or characteristic of a crematory.",
            "pos": "adjective",
            "sent1": "The crematory process requires specific equipment and expertise.",
            "sent2": "The crematory staff wore uniforms that were designed for safety and efficiency.",
            "sent3": "The crematory music played softly in the background, creating a peaceful atmosphere.",
            "sent4": "Her eyes held a crematory gaze, reflecting the solemnity of the moment.",
            "sent5": "The crematory scent lingered on his clothes, a reminder of his day's work."
        },
        {
            "definition": "The act or process of cremating a dead body.",
            "pos": "noun",
            "sent1": "The crematory of the deceased was a solemn event attended by family and friends.",
            "sent2": "The crematory process is chosen by some as a final farewell to their loved ones.",
            "sent3": "The crematory ceremony was filled with both tears and laughter, honoring the departed.",
            "sent4": "The crematory flames danced and crackled, consuming the remains with gentle heat.",
            "sent5": "The crematory ashes were scattered in the garden, becoming part of the earth once more."
        }
    ]
}