{
    "term": "crems",
    "meanings": [
        {
            "definition": "A creamy substance used in cooking.",
            "pos": "noun",
            "sent1": "I added a dollop of crems to the soup for extra flavor.",
            "sent2": "The recipe called for crems to make the sauce rich and smooth.",
            "sent3": "The chef accidentally spilled the crems all over the kitchen!",
            "sent4": "The crems was like a cloud of deliciousness in my mouth.",
            "sent5": "The crems melted on the warm pie, creating a heavenly dessert."
        },
        {
            "definition": "To apply a creamy substance onto something.",
            "pos": "verb",
            "sent1": "She carefully cremsed the cake with frosting for the party.",
            "sent2": "I always crems my hands with lotion to keep them soft.",
            "sent3": "He cremsed the bread with butter so generously it dripped down his chin.",
            "sent4": "The artist cremsed the canvas with paint, creating a masterpiece.",
            "sent5": "The baker cremsed the cupcakes with swirls of colorful icing."
        },
        {
            "definition": "A feeling of intense fear or horror.",
            "pos": "noun",
            "sent1": "A sudden crems washed over her as she heard a loud noise in the dark.",
            "sent2": "The movie filled me with crems as the suspenseful music played.",
            "sent3": "The haunted house was full of fake crems and spooky surprises.",
            "sent4": "The crems in the room was so thick, you could almost touch it.",
            "sent5": "His eyes widened in crems as he saw the shadowy figure in the alley."
        },
        {
            "definition": "To experience intense fear or horror.",
            "pos": "verb",
            "sent1": "She cremsed when she saw the spider crawling towards her.",
            "sent2": "I always crems when I have to speak in front of a large crowd.",
            "sent3": "He cremsed at the thought of walking through the dark forest alone.",
            "sent4": "The child cremsed at the sight of the thunder and lightning outside.",
            "sent5": "The hiker cremsed as he realized he was lost in the dense forest."
        }
    ]
}