{
    "term": "cremates",
    "meanings": [
        {
            "definition": "To reduce (a dead body) to ashes by burning.",
            "pos": "verb",
            "sent1": "The funeral home cremates deceased individuals to respectfully handle their remains.",
            "sent2": "The family decided to cremate their loved one instead of opting for a traditional burial.",
            "sent3": "The cat accidentally cremated its toy mouse by leaving it too close to the candle.",
            "sent4": "The intense heat of the sun can almost cremate anything left in its path.",
            "sent5": "The volcanic eruption was so powerful that it seemed to cremate everything in its wake."
        },
        {
            "definition": "To incinerate (something, especially a dead body).",
            "pos": "verb",
            "sent1": "The firefighter had to cremate the pile of leaves to prevent a forest fire.",
            "sent2": "The crematorium was busy as it cremated several bodies each day.",
            "sent3": "The chef accidentally cremated the dish by leaving it in the oven for too long.",
            "sent4": "The dragon's fiery breath could easily cremate anything in its path.",
            "sent5": "The intense heat of the bonfire seemed to cremate the marshmallows in seconds."
        },
        {
            "definition": "To perform the act of cremation on a dead body.",
            "pos": "verb",
            "sent1": "The funeral director cremates bodies with utmost care and respect for the deceased.",
            "sent2": "The cremator carefully cremated each body according to the family's wishes.",
            "sent3": "The magician's trick involved cremating a fake body on stage, much to the audience's amazement.",
            "sent4": "The wildfire seemed to cremate the entire forest, leaving only ashes behind.",
            "sent5": "The intense heat of the furnace can quickly cremate a body, leaving only ashes as a result."
        }
    ]
}