{
    "term": "crests",
    "meanings": [
        {
            "definition": "The highest point of a hill or mountain.",
            "pos": "noun",
            "sent1": "The hiker reached the crests of the mountain after a long climb.",
            "sent2": "The sun sets behind the crests of the hills, painting the sky in beautiful colors.",
            "sent3": "The mischievous squirrel balanced on the crests of the hill, pretending to be the king of the forest.",
            "sent4": "As the storm approached, dark clouds gathered over the crests of the mountains like a menacing army.",
            "sent5": "From the crests of the hill, you could see the entire valley spread out below like a patchwork quilt."
        },
        {
            "definition": "The top of a wave.",
            "pos": "noun",
            "sent1": "The surfer rode the crests of the waves with skill and grace.",
            "sent2": "The seagulls hovered above the crests of the waves, searching for fish.",
            "sent3": "The playful dolphins leaped out of the water, their fins breaking the crests of the waves.",
            "sent4": "The moonlight shimmered on the crests of the waves, creating a magical glow.",
            "sent5": "The boat gently rocked on the crests of the waves, like a cradle on the sea."
        },
        {
            "definition": "A decorative emblem worn on a helmet or hat.",
            "pos": "noun",
            "sent1": "The knight's helmet was adorned with a golden crests, symbolizing his bravery.",
            "sent2": "The soldier proudly displayed his regiment's crests on his hat.",
            "sent3": "The clown wore a silly hat with colorful crests that jingled when he moved.",
            "sent4": "The royal family's crests were intricately embroidered on the ceremonial helmets.",
            "sent5": "The pirate captain's hat bore the ominous crests of a skull and crossbones."
        },
        {
            "definition": "The highest point of a bird's head.",
            "pos": "noun",
            "sent1": "The colorful parrot had vibrant crests on its head, making it stand out in the jungle.",
            "sent2": "The majestic eagle's crests were a striking contrast against its white feathers.",
            "sent3": "The curious toucan used its crests to attract a mate during mating season.",
            "sent4": "The peacock proudly displayed its iridescent crests during courtship dances.",
            "sent5": "The rooster's crests glowed in the morning sun, signaling the start of a new day."
        }
    ]
}