{
    "term": "crested",
    "meanings": [
        {
            "definition": "Having a crest or tuft",
            "pos": "adjective",
            "sent1": "The crested bird looked majestic perched on the tree.",
            "sent2": "The rooster with a crested head strutted proudly around the farm.",
            "sent3": "The crested cat costume for Halloween was a big hit.",
            "sent4": "Her crested hairstyle stood out in the crowd like a beacon.",
            "sent5": "The crested mountain peak was visible from miles away."
        },
        {
            "definition": "Having a crest of feathers on the head",
            "pos": "adjective",
            "sent1": "The crested parrot chirped happily in its cage.",
            "sent2": "The crested peacock displayed its vibrant feathers.",
            "sent3": "The crested chicken looked like it was wearing a fancy hat.",
            "sent4": "Her crested hairdo was as colorful as a tropical bird.",
            "sent5": "The crested cardinal stood out among the other birds."
        },
        {
            "definition": "Having a crest of feathers on the head, as a bird",
            "pos": "adjective",
            "sent1": "The crested robin sang a beautiful melody.",
            "sent2": "The crested eagle soared high in the sky.",
            "sent3": "The crested penguin waddled awkwardly on the ice.",
            "sent4": "Her crested hairstyle was as striking as a bird in flight.",
            "sent5": "The crested flamingo's pink feathers were a sight to behold."
        },
        {
            "definition": "Having a crest of feathers on the head, as a bird or other animal",
            "pos": "adjective",
            "sent1": "The crested peacock danced gracefully in the garden.",
            "sent2": "The crested iguana basked in the sun on the rock.",
            "sent3": "The crested dinosaur toy was a favorite among the kids.",
            "sent4": "Her crested hairstyle was as unique as a rare bird.",
            "sent5": "The crested dragon's scales shimmered in the moonlight."
        }
    ]
}