{
    "term": "cribwork",
    "meanings": [
        {
            "definition": "A framework of wooden or metal beams used to support a mine roof or walls.",
            "pos": "noun",
            "sent1": "The miners reinforced the tunnel with sturdy cribwork to prevent collapses.",
            "sent2": "The construction workers installed cribwork to provide stability to the building's foundation.",
            "sent3": "The cribwork in the mine was so strong, even the rocks envied its support.",
            "sent4": "Her determination was like cribwork, holding up her dreams against the weight of doubt.",
            "sent5": "The cribwork stood tall, a silent guardian of the underground world."
        },
        {
            "definition": "A lattice or framework used in construction or as a barrier.",
            "pos": "noun",
            "sent1": "The garden fence was made of delicate cribwork, adding charm to the backyard.",
            "sent2": "The cribwork on the bridge provided both safety and aesthetic appeal.",
            "sent3": "The cribwork around the flower bed kept the pesky rabbits at bay.",
            "sent4": "Her words formed a protective cribwork around her heart, shielding it from harm.",
            "sent5": "The cribwork of branches intertwined, creating a natural barrier against the wind."
        },
        {
            "definition": "A structure resembling a crib, such as a baby's crib or a manger.",
            "pos": "noun",
            "sent1": "The cozy cabin had a rustic cribwork that added to its charm.",
            "sent2": "The cribwork in the stable cradled the newborn foal gently.",
            "sent3": "The cribwork of the dollhouse made the tiny furniture look even cuter.",
            "sent4": "Her arms formed a cribwork of love around the child, keeping them safe and warm.",
            "sent5": "The cribwork of the bird's nest was a masterpiece of natural engineering."
        }
    ]
}