{
    "term": "cribber",
    "meanings": [
        {
            "definition": "A person who cheats or plagiarizes.",
            "pos": "noun",
            "sent1": "The student was caught copying his friend's work, he was a known cribber.",
            "sent2": "The cribber was expelled from school for repeatedly stealing others' ideas.",
            "sent3": "The cribber thought they could get away with cheating, but the teacher caught them red-handed.",
            "sent4": "The writer was exposed as a cribber when their work was found to be identical to another author's.",
            "sent5": "Being a cribber may seem like an easy way out, but it always leads to trouble in the end."
        },
        {
            "definition": "A device used to prevent a horse from biting or chewing on objects.",
            "pos": "noun",
            "sent1": "The stable had a cribber attached to the horse's stall to protect the wooden beams.",
            "sent2": "The cribber was effective in stopping the horse from damaging the barn.",
            "sent3": "The mischievous horse tried to outsmart the cribber, but it held firm.",
            "sent4": "The cribber acted like a guardian, keeping the horse's teeth away from trouble.",
            "sent5": "The cribber was a simple yet essential tool for maintaining the horse's health and the stable's integrity."
        },
        {
            "definition": "A structure used for housing livestock.",
            "pos": "noun",
            "sent1": "The farmer built a sturdy cribber to shelter the cows during the harsh winter.",
            "sent2": "The cribber provided a safe and warm environment for the animals to rest.",
            "sent3": "The curious piglets explored every nook and cranny of the cribber.",
            "sent4": "The cribber stood strong against the storm, protecting the livestock within.",
            "sent5": "The cribber was the heart of the farm, where the animals found comfort and security."
        }
    ]
}