{
    "term": "crimp",
    "meanings": [
        {
            "definition": "Press or squeeze into small folds or ridges",
            "pos": "verb",
            "sent1": "She tried to crimp the paper to make it look like a fan.",
            "sent2": "The chef used a tool to crimp the edges of the pie crust.",
            "sent3": "The tailor accidentally crimped the fabric too much, making it look like a tiny mountain range.",
            "sent4": "The old book's pages were crimped from years of use, like waves frozen in time.",
            "sent5": "The child's fingers struggled to crimp the playdough into a perfect circle."
        },
        {
            "definition": "A device used for crimping",
            "pos": "noun",
            "sent1": "The metal crimp was essential for sealing the plastic bag.",
            "sent2": "The electrician always carried a crimp in his toolbox for wire connections.",
            "sent3": "The tiny crimp looked like a miniature alligator clip.",
            "sent4": "The shiny crimp gleamed under the bright lights of the workshop.",
            "sent5": "The crimp's sharp edges ensured a secure hold on the cable."
        },
        {
            "definition": "A person who crimps hair",
            "pos": "noun",
            "sent1": "The skilled crimp styled the model's hair for the fashion show.",
            "sent2": "The professional crimp used a special iron to create the perfect waves.",
            "sent3": "The friendly crimp joked that they could crimp hair in their sleep.",
            "sent4": "The talented crimp's fingers moved swiftly through the client's hair.",
            "sent5": "The experienced crimp knew all the latest hair trends."
        },
        {
            "definition": "A sudden decrease in activity or production",
            "pos": "noun",
            "sent1": "The market experienced a crimp in sales during the economic downturn.",
            "sent2": "The unexpected power outage caused a crimp in the factory's production schedule.",
            "sent3": "The holiday season brought a crimp in the usual traffic flow.",
            "sent4": "The sudden snowstorm put a crimp in the weekend plans.",
            "sent5": "The last-minute change in schedule created a crimp in the event preparation."
        }
    ]
}