{
    "term": "crimps",
    "meanings": [
        {
            "definition": "To press or squeeze into small folds or ridges",
            "pos": "verb",
            "sent1": "She carefully crimps the edge of the pie crust to make it look pretty.",
            "sent2": "The tailor crimps the fabric to create a decorative border on the dress.",
            "sent3": "The mischievous child crimps the paper into tiny shapes for a secret project.",
            "sent4": "The old book's pages are crimped from years of use, adding character to its appearance.",
            "sent5": "The artist crimps the clay to give the sculpture a unique texture."
        },
        {
            "definition": "A person who makes or repairs shoes",
            "pos": "noun",
            "sent1": "The skilled crimps at the local shop fixed my favorite pair of boots.",
            "sent2": "The crimps in the workshop are known for their craftsmanship and attention to detail.",
            "sent3": "The friendly crimps always greet customers with a smile when they enter the store.",
            "sent4": "In the cobblers' competition, the fastest crimp finished repairing the shoe in record time.",
            "sent5": "The experienced crimp carefully selects the right materials for each shoe repair job."
        },
        {
            "definition": "A device used for curling or waving hair",
            "pos": "noun",
            "sent1": "She plugged in the crimps and waited for them to heat up before styling her hair.",
            "sent2": "The hairstylist used the crimps to add volume and texture to the client's hair.",
            "sent3": "The crimps accidentally got tangled in her hair, causing a funny moment during the styling session.",
            "sent4": "The crimps worked their magic, transforming her straight hair into beautiful waves.",
            "sent5": "The new crimps on the market promise to create stunning curls with minimal effort."
        },
        {
            "definition": "To interfere with or manipulate in a dishonest way",
            "pos": "verb",
            "sent1": "The con artist tried to crimp the results of the game by bribing the referee.",
            "sent2": "The corrupt official attempted to crimp the investigation to protect their own interests.",
            "sent3": "The sneaky character in the movie always finds a way to crimp the hero's plans.",
            "sent4": "The villain's evil scheme was designed to crimp the protagonist's chances of success.",
            "sent5": "The cunning antagonist constantly seeks to crimp the hero's progress at every turn."
        }
    ]
}