{
    "term": "crimped",
    "meanings": [
        {
            "definition": "To press into small regular folds",
            "pos": "verb",
            "sent1": "She crimped the paper to make a fan.",
            "sent2": "The chef crimped the pie crust for a decorative edge.",
            "sent3": "The squirrel crimped the leaf to create a cozy bed.",
            "sent4": "His words crimped her heart with joy.",
            "sent5": "The tailor crimped the fabric with precision."
        },
        {
            "definition": "To mold or shape with a tool",
            "pos": "verb",
            "sent1": "He crimped the clay into a beautiful vase.",
            "sent2": "The artist crimped the wire to form a unique sculpture.",
            "sent3": "The child crimped the playdough into funny shapes.",
            "sent4": "Her laughter crimped the air with happiness.",
            "sent5": "The carpenter crimped the metal with skill."
        },
        {
            "definition": "To secure or hold in place with a crimp",
            "pos": "verb",
            "sent1": "She crimped the ribbon to the gift box.",
            "sent2": "The hairdresser crimped the hairpin to keep the style in place.",
            "sent3": "The magician crimped the card in an unexpected spot.",
            "sent4": "His promise crimped her trust in him.",
            "sent5": "The farmer crimped the fence to keep the animals safe."
        },
        {
            "definition": "A small bend or fold in something, especially hair or fabric",
            "pos": "noun",
            "sent1": "Her hair had a cute crimped look after braiding.",
            "sent2": "The vintage dress had delicate crimps along the hem.",
            "sent3": "The puppy's tail had a crimped shape, wagging happily.",
            "sent4": "The road had a crimped appearance from the heavy traffic.",
            "sent5": "The chef added a crimped detail to the dessert presentation."
        }
    ]
}