{
    "term": "crinolines",
    "meanings": [
        {
            "definition": "A stiff fabric used to make petticoats and underskirts.",
            "pos": "noun",
            "sent1": "The dressmaker used crinolines to create a puffy underskirt.",
            "sent2": "She bought a yard of crinolines to sew a petticoat for the costume party.",
            "sent3": "The mischievous cat got tangled in the crinolines and ran around the room in circles.",
            "sent4": "Her dreams were like crinolines, full of layers and structure.",
            "sent5": "The sunlight filtered through the crinolines, casting a soft glow on the floor."
        },
        {
            "definition": "A woman's hooped skirt worn in the mid-19th century.",
            "pos": "noun",
            "sent1": "The elegant lady twirled in her crinolines, feeling like a princess.",
            "sent2": "In the historical movie, the actress wore crinolines to portray the character accurately.",
            "sent3": "The crinolines rustled softly as she walked, making her feel like a character from a novel.",
            "sent4": "Her laughter bubbled out from under the crinolines, filling the room with joy.",
            "sent5": "The wind caught the crinolines, billowing them out like a colorful cloud."
        },
        {
            "definition": "A type of underskirt made of stiffened fabric or hoops.",
            "pos": "noun",
            "sent1": "The ballerina's costume included crinolines to give her skirt volume and shape.",
            "sent2": "The vintage fashion exhibit displayed beautiful crinolines from the 19th century.",
            "sent3": "She pretended the crinolines were a magical barrier protecting her from invisible foes.",
            "sent4": "The crinolines whispered secrets as she moved, creating an aura of mystery.",
            "sent5": "The dancer's movements were enhanced by the swish of the crinolines, adding drama to the performance."
        }
    ]
}