{
    "term": "crisper",
    "meanings": [
        {
            "definition": "A container or compartment for storing vegetables at a low temperature",
            "pos": "noun",
            "sent1": "I put the fresh lettuce in the crisper to keep it cool.",
            "sent2": "The carrots in the crisper stayed fresh for a long time.",
            "sent3": "The crisper was like a chilly hideout for the veggies.",
            "sent4": "The crisper was a frosty sanctuary for the leafy greens.",
            "sent5": "The crisper kept the vegetables as cold as a winter morning."
        },
        {
            "definition": "A device used to make food crispy",
            "pos": "noun",
            "sent1": "The air fryer is a popular crisper in many kitchens.",
            "sent2": "The oven's crisper function makes the fries crunchy.",
            "sent3": "The crisper worked its magic on the soggy chicken strips.",
            "sent4": "The crisper transformed the soft bread into a crispy delight.",
            "sent5": "The crisper turned the dough into a golden, crunchy treat."
        },
        {
            "definition": "Having a sharp or distinct appearance",
            "pos": "adjective",
            "sent1": "Her crisper haircut made her look more stylish.",
            "sent2": "The crisper lines of the design gave it a modern look.",
            "sent3": "His crisper outfit made him stand out in the crowd.",
            "sent4": "The crisper edges of the painting added depth to the artwork.",
            "sent5": "The crisper details in the photo made it more captivating."
        },
        {
            "definition": "A person or thing that makes something crisper",
            "pos": "noun",
            "sent1": "The baker was known as the crisper of cookies in town.",
            "sent2": "The crisper of the potato chips ensured they were crunchy.",
            "sent3": "The crisper of the toast was a master at making it golden brown.",
            "sent4": "The crisper of the fried chicken made it irresistible.",
            "sent5": "The crisper of the pie crust made it perfectly flaky."
        }
    ]
}