{
    "term": "crispier",
    "meanings": [
        {
            "definition": "Having a firm, dry texture or quality",
            "pos": "adjective",
            "sent1": "The apple slices were crispier after baking in the oven.",
            "sent2": "The crackers were much crispier than the bread.",
            "sent3": "I like my potato chips crispier than my friend's.",
            "sent4": "The autumn leaves were crispier than a bag of chips underfoot.",
            "sent5": "The toast was so crispier that it crumbled easily."
        },
        {
            "definition": "Becoming firm and dry when cooked",
            "pos": "adjective",
            "sent1": "The cookies were crispier after they cooled down.",
            "sent2": "The bacon was crispier than expected after frying.",
            "sent3": "The cake turned out crispier than a biscuit!",
            "sent4": "The firewood crackled, becoming crispier in the flames.",
            "sent5": "The fried chicken was so crispier that it made a satisfying crunch."
        },
        {
            "definition": "Having a pleasingly firm, dry quality",
            "pos": "adjective",
            "sent1": "The fresh lettuce was crispier than the wilted one.",
            "sent2": "The cookies were crispier than usual, making them irresistible.",
            "sent3": "The toast was so crispier that it made a delightful sound when bitten.",
            "sent4": "The air in the morning was crispier than a fresh apple.",
            "sent5": "The crackers were so crispier that they seemed to shatter in your mouth."
        },
        {
            "definition": "Becoming firm and dry when cooked",
            "pos": "adjective",
            "sent1": "The fish fillet was crispier after being fried.",
            "sent2": "The vegetables were crispier than expected after roasting.",
            "sent3": "The bread turned out crispier than a cracker!",
            "sent4": "The autumn air was crispier than a bag of chips.",
            "sent5": "The fried chicken was so crispier that it was a delight to eat."
        }
    ]
}