{
    "term": "crocks",
    "meanings": [
        {
            "definition": "A container or pot made of earthenware.",
            "pos": "noun",
            "sent1": "My grandma keeps her spices in old crocks on the kitchen shelf.",
            "sent2": "The crocks on the shelf were beautifully painted with floral designs.",
            "sent3": "I accidentally dropped the crocks, and they shattered into pieces.",
            "sent4": "The crocks lined up on the windowsill looked like a colorful army ready for battle.",
            "sent5": "The smell of herbs wafted from the crocks, filling the kitchen with a comforting aroma."
        },
        {
            "definition": "A broken piece of pottery.",
            "pos": "noun",
            "sent1": "The archaeologist carefully collected the crocks found at the ancient site.",
            "sent2": "The crocks from the excavation were fragile and needed delicate handling.",
            "sent3": "The crocks in the museum display were once part of grand vases and bowls.",
            "sent4": "The shattered crocks lay scattered across the ground, telling a story of the past.",
            "sent5": "Each crock shard held a piece of history waiting to be uncovered by experts."
        },
        {
            "definition": "Nonsense or rubbish.",
            "pos": "noun",
            "sent1": "Don't listen to him; he's just talking crocks.",
            "sent2": "The internet is full of misleading crocks that people believe without question.",
            "sent3": "The politician's speech was nothing but crocks and empty promises.",
            "sent4": "She dismissed his excuses as mere crocks to avoid taking responsibility.",
            "sent5": "His theory was quickly debunked as a load of crocks by the scientific community."
        },
        {
            "definition": "To break or damage something.",
            "pos": "verb",
            "sent1": "Be careful not to crocks the delicate vase when moving it.",
            "sent2": "The children accidentally crocks the window while playing ball.",
            "sent3": "I hope I don't crocks the new phone I just bought.",
            "sent4": "The storm's strong winds threatened to crocks the old tree in the backyard.",
            "sent5": "She felt a pang of guilt as she realized her actions could crocks their friendship."
        }
    ]
}