{
    "term": "crossbars",
    "meanings": [
        {
            "definition": "A horizontal bar fixed across another bar or between two upright bars, especially one used in a vehicle for support or stability.",
            "pos": "noun",
            "sent1": "The car's roof rack had sturdy crossbars for holding luggage securely.",
            "sent2": "The soccer goal had crossbars that the ball needed to pass under to score.",
            "sent3": "The mischievous squirrel tried to balance on the crossbars of the fence.",
            "sent4": "Her determination was the crossbars that supported her through tough times.",
            "sent5": "The image of the crossbars stayed etched in his memory as a symbol of strength."
        },
        {
            "definition": "A horizontal bar on a goalpost, dividing the goal into upper and lower sections.",
            "pos": "noun",
            "sent1": "The football player aimed for the crossbars to score a goal.",
            "sent2": "The goalie leaped to block the ball from hitting the crossbars.",
            "sent3": "The birds perched on the crossbars of the goalpost, watching the game.",
            "sent4": "The crossbars stood tall, separating victory from defeat.",
            "sent5": "The sound of the ball hitting the crossbars echoed through the stadium."
        },
        {
            "definition": "A horizontal bar on a bicycle frame connecting the handlebars and the seat.",
            "pos": "noun",
            "sent1": "He adjusted the crossbars on his bike for a more comfortable ride.",
            "sent2": "The old bicycle had rusty crossbars that needed replacement.",
            "sent3": "The cat walked along the crossbars of the bike frame, curious about the ride.",
            "sent4": "Her dreams rode on the crossbars of the bicycle, taking her to new adventures.",
            "sent5": "The sun glinted off the crossbars, creating a shimmering effect as she pedaled."
        }
    ]
}