{
    "term": "crossed",
    "meanings": [
        {
            "definition": "To move or extend across something",
            "pos": "verb",
            "sent1": "The cat crossed the road carefully.",
            "sent2": "The river crossed the entire forest.",
            "sent3": "The squirrel crossed the playground in a zigzag pattern.",
            "sent4": "The sunlight crossed the room, painting it in warm hues.",
            "sent5": "The shadow of the tree crossed the path, creating a natural canopy."
        },
        {
            "definition": "To intersect or meet at a point",
            "pos": "verb",
            "sent1": "The two roads crossed at the intersection.",
            "sent2": "The hiking trails crossed near the mountain peak.",
            "sent3": "The lines on the graph crossed unexpectedly, causing confusion.",
            "sent4": "Their paths crossed in the bustling city, leading to a chance encounter.",
            "sent5": "The beams of light crossed in the sky, forming a beautiful rainbow."
        },
        {
            "definition": "To go against or oppose",
            "pos": "verb",
            "sent1": "She crossed her arms in defiance.",
            "sent2": "The protestors crossed the street, chanting slogans.",
            "sent3": "The cat crossed its owner's plans by hiding the keys.",
            "sent4": "His decision crossed the expectations of his friends.",
            "sent5": "The wind crossed the direction of the sailboat, slowing its progress."
        },
        {
            "definition": "To mark with a cross",
            "pos": "verb",
            "sent1": "She crossed her 't's and dotted her 'i's carefully.",
            "sent2": "The teacher crossed out the incorrect answers on the test.",
            "sent3": "The child crossed the drawing with colorful lines.",
            "sent4": "He crossed the map with a red marker to mark the route.",
            "sent5": "The artist crossed the canvas with bold strokes, creating a masterpiece."
        },
        {
            "definition": "To mix or blend different things",
            "pos": "verb",
            "sent1": "She crossed the flavors of sweet and salty in her dish.",
            "sent2": "The chef crossed the ingredients to create a unique recipe.",
            "sent3": "The colors crossed on the canvas, forming a beautiful painting.",
            "sent4": "The scents crossed in the kitchen, creating a delightful aroma.",
            "sent5": "The music crossed genres, appealing to a diverse audience."
        }
    ]
}