{
    "term": "cross",
    "meanings": [
        {
            "definition": "A structure consisting of an upright post with a transverse beam used for execution or torture.",
            "pos": "noun",
            "sent1": "The criminal was tied to the cross.",
            "sent2": "The church had a beautiful cross on its roof.",
            "sent3": "The birds perched on the cross and sang a song.",
            "sent4": "The cross of fate hung heavy over his head.",
            "sent5": "The cross stood tall, a symbol of sacrifice and suffering."
        },
        {
            "definition": "A mark, object, or figure formed by two intersecting lines.",
            "pos": "noun",
            "sent1": "She drew a small cross on the paper.",
            "sent2": "The treasure map had a big red cross on it.",
            "sent3": "The chef placed a cross of parsley on the dish.",
            "sent4": "The cross of roads led to different destinations.",
            "sent5": "The cross marked the spot where they first met."
        },
        {
            "definition": "To go across from one side to the other.",
            "pos": "verb",
            "sent1": "The hiker had to cross the river carefully.",
            "sent2": "The cat crossed the street quickly.",
            "sent3": "The idea crossed his mind like a shooting star.",
            "sent4": "She crossed the finish line with a smile.",
            "sent5": "The bridge helped them cross the deep ravine."
        },
        {
            "definition": "To mix or blend together.",
            "pos": "verb",
            "sent1": "She decided to cross the two paint colors.",
            "sent2": "The flavors in the dish crossed perfectly.",
            "sent3": "The scents of flowers crossed in the garden.",
            "sent4": "Their paths crossed at the market unexpectedly.",
            "sent5": "The music crossed genres, creating a unique sound."
        }
    ]
}