{
    "term": "crown",
    "meanings": [
        {
            "definition": "A circular ornamental headdress worn by a monarch.",
            "pos": "noun",
            "sent1": "The shiny crown sparkled on the king's head.",
            "sent2": "The queen's crown was adorned with precious gems.",
            "sent3": "The crown looked too heavy for the tiny prince to wear.",
            "sent4": "Her laughter echoed through the hall, her joy a crown for all to see.",
            "sent5": "The crown gleamed in the sunlight, a symbol of royal power."
        },
        {
            "definition": "The top or highest part of something.",
            "pos": "noun",
            "sent1": "The mountain's snowy crown glistened in the morning light.",
            "sent2": "The crown of the tree swayed gently in the breeze.",
            "sent3": "The cake's cherry crown made it look too pretty to eat.",
            "sent4": "The crown of the building reached towards the sky, touching the clouds.",
            "sent5": "The crown of the hill offered a breathtaking view of the valley below."
        },
        {
            "definition": "To declare or acknowledge someone as a champion or winner.",
            "pos": "verb",
            "sent1": "The crowd cheered to crown the victorious athlete.",
            "sent2": "The judges will crown the best singer of the competition.",
            "sent3": "The playful cat seemed to crown itself the ruler of the house.",
            "sent4": "Her smile crowned her as the kindest person in the room.",
            "sent5": "The golden trophy will crown the winner of the contest."
        },
        {
            "definition": "To cover or encircle the top of something.",
            "pos": "verb",
            "sent1": "The snow will crown the mountain peaks in winter.",
            "sent2": "The flowers beautifully crowned the wedding cake.",
            "sent3": "The chef decided to crown the dish with a sprinkle of herbs.",
            "sent4": "The rainbow crowned the waterfall, creating a magical scene.",
            "sent5": "The sunset's colors crowned the horizon with a fiery glow."
        }
    ]
}