{
    "term": "crumbiest",
    "meanings": [
        {
            "definition": "Crumbiest: superlative form of crumby, meaning covered in or containing crumbs",
            "pos": "adjective",
            "sent1": "The cookie was the crumbiest treat I had ever seen.",
            "sent2": "The crumbiest part of the cake was the delicious crumb topping.",
            "sent3": "I accidentally sat on the crumbiest chair in the room, and now I have crumbs all over me!",
            "sent4": "The crumbiest path through the forest was a trail of fallen leaves and broken twigs.",
            "sent5": "The crumbiest picnic blanket was covered in a colorful array of crumbs from various snacks."
        },
        {
            "definition": "Crumbiest: superlative form of crumby, meaning of poor quality or unpleasant",
            "pos": "adjective",
            "sent1": "The crumbiest movie I watched last night was so boring.",
            "sent2": "The crumbiest part of the day was when it started raining during the picnic.",
            "sent3": "I tried to fix the crumbiest toy, but it kept falling apart in my hands.",
            "sent4": "The crumbiest gift I ever received was a broken clock that couldn't be fixed.",
            "sent5": "The crumbiest restaurant in town had terrible service and cold food."
        },
        {
            "definition": "Crumbiest: superlative form of crumby, meaning easily broken into small pieces",
            "pos": "adjective",
            "sent1": "The crumbiest cookie crumbled as soon as I picked it up.",
            "sent2": "The crumbiest bread was so delicate that it fell apart with a gentle touch.",
            "sent3": "I tried to build a sandcastle, but the crumbiest sand kept slipping through my fingers.",
            "sent4": "The crumbiest ice cream cone shattered into pieces when it hit the ground.",
            "sent5": "The crumbiest pottery was so fragile that it broke with the lightest tap."
        }
    ]
}