{
    "term": "crumble",
    "meanings": [
        {
            "definition": "To break or fall apart into small pieces",
            "pos": "verb",
            "sent1": "The cookie started to crumble when I touched it.",
            "sent2": "The old building began to crumble due to neglect.",
            "sent3": "I tried to build a sandcastle, but it would just crumble away.",
            "sent4": "Her dreams of success seemed to crumble like a sandcastle in the rain.",
            "sent5": "The ancient ruins stood tall, but one touch would make them crumble into dust."
        },
        {
            "definition": "To weaken or collapse suddenly",
            "pos": "verb",
            "sent1": "The bridge started to crumble under the weight of the truck.",
            "sent2": "The dictator's regime began to crumble after the uprising.",
            "sent3": "The superhero's powers would crumble under the influence of kryptonite.",
            "sent4": "The trust between them would crumble like a house of cards in a strong wind.",
            "sent5": "The athlete's confidence started to crumble after a series of losses."
        },
        {
            "definition": "To disintegrate gradually",
            "pos": "verb",
            "sent1": "The old book's pages would crumble at the slightest touch.",
            "sent2": "Over time, the ancient parchment would crumble into dust.",
            "sent3": "The sandcastle would crumble slowly as the tide came in.",
            "sent4": "The once strong friendship would crumble bit by bit over misunderstandings.",
            "sent5": "The neglected garden statue began to crumble away, forgotten by time."
        },
        {
            "definition": "To become weak or ineffective",
            "pos": "verb",
            "sent1": "His resolve would crumble in the face of adversity.",
            "sent2": "The team's defense started to crumble under the opponent's relentless attacks.",
            "sent3": "The politician's promises would crumble under scrutiny.",
            "sent4": "The foundation of the argument would crumble when faced with evidence.",
            "sent5": "The once proud empire began to crumble as internal conflicts arose."
        }
    ]
}