{
    "term": "crushing",
    "meanings": [
        {
            "definition": "To press or squeeze with great force",
            "pos": "verb",
            "sent1": "She was crushing the grapes to make juice.",
            "sent2": "The bulldozer was crushing the rocks into small pieces.",
            "sent3": "The chef's secret to delicious juice was crushing the fruits with care.",
            "sent4": "The weight of the world seemed to be crushing down on his shoulders.",
            "sent5": "The hydraulic press was crushing the metal with a loud noise."
        },
        {
            "definition": "Overwhelming or devastating in intensity",
            "pos": "adjective",
            "sent1": "The crushing heat made it hard to breathe.",
            "sent2": "The team faced a crushing defeat in the final match.",
            "sent3": "The amount of homework she had was crushing, but she tackled it one step at a time.",
            "sent4": "The news of the accident was a crushing blow to the family.",
            "sent5": "The weight of the responsibility felt crushing on his young shoulders."
        },
        {
            "definition": "To defeat or subdue completely",
            "pos": "verb",
            "sent1": "The army was crushing the enemy forces in battle.",
            "sent2": "The champion boxer was known for crushing his opponents in the ring.",
            "sent3": "The cat was crushing the mouse toy during playtime.",
            "sent4": "The student was crushing the math problems one after another.",
            "sent5": "The waves were crushing against the shore with great power."
        },
        {
            "definition": "To cause great emotional or mental distress",
            "pos": "verb",
            "sent1": "The rejection letter was crushing for her dreams.",
            "sent2": "The loss of a loved one can be a crushing experience.",
            "sent3": "The thought of failing the test was crushing, but she studied hard.",
            "sent4": "The constant criticism was crushing his self-esteem.",
            "sent5": "The weight of guilt was crushing him, making it hard to move forward."
        }
    ]
}