{
    "term": "crushed",
    "meanings": [
        {
            "definition": "To press or squeeze with force",
            "pos": "verb",
            "sent1": "She crushed the can with her foot.",
            "sent2": "The wrestler crushed his opponent in the match.",
            "sent3": "The little girl crushed the playdough into funny shapes.",
            "sent4": "The weight of the world crushed down on his shoulders.",
            "sent5": "The car crusher crushed the old vehicles into small metal cubes."
        },
        {
            "definition": "To defeat or overwhelm completely",
            "pos": "verb",
            "sent1": "The army crushed the enemy forces in battle.",
            "sent2": "The final exam crushed her hopes of passing the class.",
            "sent3": "His dance moves crushed the competition at the talent show.",
            "sent4": "The storm crushed the fragile sandcastle on the beach.",
            "sent5": "The news of the loss crushed their spirits."
        },
        {
            "definition": "Broken or shattered by being pressed or squeezed",
            "pos": "adjective",
            "sent1": "The crushed cookies were still delicious.",
            "sent2": "The crushed glass glittered in the sunlight.",
            "sent3": "The crushed box looked like it had been sat on.",
            "sent4": "The crushed ice cooled the drink quickly.",
            "sent5": "The crushed petals released a sweet fragrance."
        },
        {
            "definition": "To feel disappointed or humiliated",
            "pos": "verb",
            "sent1": "He felt crushed when his artwork was criticized.",
            "sent2": "She was crushed when her friends didn't invite her to the party.",
            "sent3": "The team was crushed after losing the championship game.",
            "sent4": "His dreams of winning were crushed by the reality of the situation.",
            "sent5": "The student was crushed by the teacher's harsh words."
        }
    ]
}