{
    "term": "crush",
    "meanings": [
        {
            "definition": "To press or squeeze with force",
            "pos": "verb",
            "sent1": "I crush the grapes to make juice.",
            "sent2": "She likes to crush the paper into a ball.",
            "sent3": "The cat tried to crush itself into the tiny box.",
            "sent4": "The weight of the books seemed to crush the small table.",
            "sent5": "The wrestler's powerful grip could crush anything in its path."
        },
        {
            "definition": "A strong feeling of romantic attraction",
            "pos": "noun",
            "sent1": "His crush on her was obvious to everyone.",
            "sent2": "Having a crush can make you feel happy.",
            "sent3": "The puppy's crush on the cat was quite amusing.",
            "sent4": "Her crush on him was like a bright light in her life.",
            "sent5": "The crush between them was undeniable and sweet."
        },
        {
            "definition": "A crowd of people pressed closely together",
            "pos": "noun",
            "sent1": "The concert had a huge crush of fans near the stage.",
            "sent2": "The crush of people at the festival made it hard to move.",
            "sent3": "The crush at the bus stop was both chaotic and funny.",
            "sent4": "In the crush of the crowd, she lost her hat.",
            "sent5": "The crush of students in the hallway was like a river flowing."
        },
        {
            "definition": "To defeat or overcome completely",
            "pos": "verb",
            "sent1": "The army was able to crush the enemy forces.",
            "sent2": "She worked hard to crush her fears and doubts.",
            "sent3": "The team's victory was so great, it seemed to crush their opponents.",
            "sent4": "His determination to succeed helped him crush all obstacles.",
            "sent5": "The storm's power was enough to crush any resistance in its path."
        }
    ]
}