{
    "term": "cryptosporidium",
    "meanings": [
        {
            "definition": "A microscopic parasite that causes the diarrheal disease cryptosporidiosis.",
            "pos": "noun",
            "sent1": "The cryptosporidium parasite can make you sick.",
            "sent2": "Doctors diagnosed her with cryptosporidiosis after finding cryptosporidium in her stool sample.",
            "sent3": "The cryptosporidium parasite decided to throw a party in the intestines, causing chaos.",
            "sent4": "Like a sneaky spy, cryptosporidium infiltrated the body undetected.",
            "sent5": "The cryptosporidium parasite multiplied rapidly, overwhelming the immune system."
        },
        {
            "definition": "An infection caused by the parasite cryptosporidium.",
            "pos": "noun",
            "sent1": "She suffered from a cryptosporidium infection after drinking contaminated water.",
            "sent2": "The cryptosporidium infection left him weak and dehydrated.",
            "sent3": "The cryptosporidium infection played hide and seek with the doctors, making diagnosis tricky.",
            "sent4": "Her body fought the cryptosporidium infection like a brave warrior.",
            "sent5": "The cryptosporidium infection spread quickly through the community, causing concern."
        },
        {
            "definition": "The genus of protozoan parasites that includes cryptosporidium.",
            "pos": "noun",
            "sent1": "Cryptosporidium is a member of the protozoan parasites genus.",
            "sent2": "Scientists study the genus that includes cryptosporidium to understand its behavior.",
            "sent3": "The genus of protozoan parasites threw a surprise party, with cryptosporidium as the guest of honor.",
            "sent4": "In the world of protozoan parasites, cryptosporidium stands out for its unique characteristics.",
            "sent5": "The genus of protozoan parasites, including cryptosporidium, poses challenges for treatment and control."
        }
    ]
}