{
    "term": "crystallizable",
    "meanings": [
        {
            "definition": "Capable of being crystallized.",
            "pos": "adjective",
            "sent1": "The sugar solution was crystallizable, so it formed beautiful crystals when left to cool.",
            "sent2": "The mineral was found to be crystallizable under specific temperature conditions.",
            "sent3": "The chef's attempt to make a crystallizable dessert turned into a sticky mess.",
            "sent4": "Her voice had a crystallizable quality that made her singing truly unique.",
            "sent5": "The idea of time as a crystallizable substance fascinated the young scientist."
        },
        {
            "definition": "Able to form crystals.",
            "pos": "adjective",
            "sent1": "The substance proved to be crystallizable, forming intricate structures under the microscope.",
            "sent2": "Certain chemicals are known to be crystallizable when exposed to certain elements.",
            "sent3": "The artist's paint had a crystallizable quality, creating a mesmerizing effect on the canvas.",
            "sent4": "Her laughter echoed through the room like a crystallizable melody.",
            "sent5": "The crystallizable nature of snowflakes makes each one a unique work of art."
        },
        {
            "definition": "Having the ability to undergo crystallization.",
            "pos": "adjective",
            "sent1": "The solution was found to be crystallizable, allowing for the formation of structured crystals.",
            "sent2": "Metals like gold are known for their crystallizable properties when exposed to heat.",
            "sent3": "The magician's wand had a crystallizable feature that made it glow in the dark.",
            "sent4": "Her eyes had a crystallizable clarity that seemed to pierce through any deception.",
            "sent5": "The crystallizable nature of the gemstone made it highly sought after by collectors."
        }
    ]
}