{
    "term": "cuatro",
    "meanings": [
        {
            "definition": "The number four.",
            "pos": "noun",
            "sent1": "I have cuatro apples in my basket.",
            "sent2": "The clock struck cuatro times at midnight.",
            "sent3": "At the party, we played a game where everyone had to find cuatro hidden objects.",
            "sent4": "The cuatro corners of the room were decorated with colorful balloons.",
            "sent5": "The cuatro seasons are spring, summer, autumn, and winter."
        },
        {
            "definition": "A musical instrument with four strings, typically a guitar or ukulele.",
            "pos": "noun",
            "sent1": "She learned to play the cuatro and performed at the school talent show.",
            "sent2": "The musician strummed the cuatro gently, creating a soothing melody.",
            "sent3": "During the concert, the cuatro player accidentally broke a string and had to improvise.",
            "sent4": "The sound of the cuatro filled the room, captivating the audience.",
            "sent5": "His favorite instrument to play is the cuatro because of its unique sound."
        },
        {
            "definition": "A card with the rank of four.",
            "pos": "noun",
            "sent1": "In the game, the cuatro card is worth four points.",
            "sent2": "She drew a cuatro from the deck, adding it to her hand.",
            "sent3": "During the poker game, he always seemed to have luck with the cuatro card.",
            "sent4": "The cuatro card was the last one needed to complete the set.",
            "sent5": "Players cheered when they drew the cuatro card, knowing it was a lucky draw."
        },
        {
            "definition": "A person who is fourth in a race or competition.",
            "pos": "noun",
            "sent1": "She finished as the cuatro runner in the marathon.",
            "sent2": "The cuatro place winner received a bronze medal.",
            "sent3": "The cuatro competitor crossed the finish line with a big smile.",
            "sent4": "Being the cuatro in the race motivated him to train harder for the next competition.",
            "sent5": "The cuatro position in the tournament secured her a place in the finals."
        }
    ]
}