{
    "term": "cubature",
    "meanings": [
        {
            "definition": "The process of calculating the volume of a solid figure by measuring its length, width, and height.",
            "pos": "noun",
            "sent1": "In math class, we learned about cubature when we measured the dimensions of a box to find its volume.",
            "sent2": "Architects use cubature to determine how much space is inside a building.",
            "sent3": "The students found cubature quite interesting as they measured the dimensions of various objects in the classroom.",
            "sent4": "Her understanding of cubature was as clear as a glass of water on a sunny day.",
            "sent5": "The concept of cubature stuck in his mind like a catchy tune."
        },
        {
            "definition": "The amount of space enclosed by a three-dimensional figure.",
            "pos": "noun",
            "sent1": "The cubature of the room was calculated to ensure it could fit all the furniture.",
            "sent2": "The cubature of the box was larger than expected, allowing for more storage space.",
            "sent3": "The cubature of the balloon animal made it seem like a real creature.",
            "sent4": "Her love for books filled her room to the cubature with shelves of stories.",
            "sent5": "The cubature of the cave was vast, echoing with each step."
        },
        {
            "definition": "The act of determining the cubic contents of a solid.",
            "pos": "noun",
            "sent1": "The engineer's job involved cubature calculations for the construction project.",
            "sent2": "Cubature is essential in accurately estimating the amount of concrete needed for a foundation.",
            "sent3": "The chef's cubature of ingredients was precise, resulting in a perfectly balanced dish.",
            "sent4": "His passion for cubature was evident in the meticulous way he measured each block.",
            "sent5": "The artist's cubature of clay transformed into a beautiful sculpture."
        }
    ]
}