{
    "term": "cubage",
    "meanings": [
        {
            "definition": "The amount of space within a three-dimensional object, measured in cubic units.",
            "pos": "noun",
            "sent1": "The cubage of the box was small, so it couldn't hold many toys.",
            "sent2": "The architect calculated the cubage of the room to determine the amount of paint needed.",
            "sent3": "The cubage of the tiny jar was so limited that it could only store a few marbles.",
            "sent4": "Her enthusiasm had a cubage that filled the room with positive energy.",
            "sent5": "The cubage of the balloon determined how much helium it could hold."
        },
        {
            "definition": "The act or process of calculating the volume or capacity of something.",
            "pos": "noun",
            "sent1": "After the cubage of the pool was determined, they knew how much water it could hold.",
            "sent2": "The cubage of the storage unit was crucial for planning the move.",
            "sent3": "The cubage of the cake tin was mistakenly calculated, resulting in an overflowing batter.",
            "sent4": "Her cubage of emotions overflowed as she tried to contain her excitement.",
            "sent5": "The cubage of the suitcase limited the number of clothes she could pack."
        },
        {
            "definition": "The total volume or capacity of a container or enclosed space.",
            "pos": "noun",
            "sent1": "The cubage of the shipping container determined how much cargo it could carry.",
            "sent2": "The cubage of the refrigerator was enough to store a week's worth of groceries.",
            "sent3": "The cubage of the jar surprised her when it held more than expected.",
            "sent4": "His cubage of knowledge was vast, filling every bookshelf in the room.",
            "sent5": "The cubage of the water tank was insufficient for the dry season."
        }
    ]
}