{
    "term": "cubistic",
    "meanings": [
        {
            "definition": "Relating to or characteristic of cubism.",
            "pos": "adjective",
            "sent1": "The artist created a cubistic painting with geometric shapes and bold colors.",
            "sent2": "Her artwork had a cubistic style, with fragmented forms and multiple perspectives.",
            "sent3": "The cubistic portrait of the cat made everyone smile with its quirky angles.",
            "sent4": "His mind worked in a cubistic manner, breaking down complex ideas into simpler parts.",
            "sent5": "The cubistic design of the building made it stand out among the traditional structures."
        },
        {
            "definition": "In the style of cubism.",
            "pos": "adjective",
            "sent1": "The new sculpture had a cubistic look, with sharp edges and overlapping shapes.",
            "sent2": "The artist's latest collection featured paintings done in a cubistic fashion.",
            "sent3": "The cubistic cake was a hit at the party, with its abstract icing design.",
            "sent4": "Her dance moves were so cubistic, with angular gestures and sudden shifts.",
            "sent5": "The room was decorated in a cubistic theme, with furniture arranged in unconventional angles."
        },
        {
            "definition": "Resembling or inspired by the artistic movement of cubism.",
            "pos": "adjective",
            "sent1": "The mural on the wall had a cubistic vibe, reminiscent of Picasso's work.",
            "sent2": "The fashion designer's new collection was clearly cubistic, with bold patterns and shapes.",
            "sent3": "The cubistic hairstyle she tried was a fun experiment, with geometric hair clips.",
            "sent4": "His music had a cubistic feel, blending different genres and sounds.",
            "sent5": "The garden sculpture was a cubistic masterpiece, capturing the essence of the art movement."
        }
    ]
}