{
    "term": "cuddie",
    "meanings": [
        {
            "definition": "A small wooden barrel",
            "pos": "noun",
            "sent1": "The farmer stored his homemade wine in a cuddie in the cellar.",
            "sent2": "The workers rolled the cuddie full of apples down the hill.",
            "sent3": "The mischievous cat tried to hide inside the cuddie, thinking it was a cozy bed.",
            "sent4": "The cuddie stood in the corner of the room, holding memories of the past.",
            "sent5": "The smell of oak emanated from the cuddie, reminding her of the countryside."
        },
        {
            "definition": "A small fishing boat",
            "pos": "noun",
            "sent1": "The fishermen set out to sea in their cuddie early in the morning.",
            "sent2": "The tourists enjoyed a peaceful ride in the cuddie along the river.",
            "sent3": "The cuddie bobbed gently on the water, like a duck swimming in a pond.",
            "sent4": "The old cuddie creaked as it rocked on the waves, telling tales of the ocean.",
            "sent5": "The colorful flags fluttered in the wind as the cuddie sailed into the sunset."
        },
        {
            "definition": "A Scottish dialect term for a donkey or horse",
            "pos": "noun",
            "sent1": "The farmer's children loved to feed the cuddie carrots in the field.",
            "sent2": "The cuddie pulled the cart with ease, its hooves clacking on the cobblestones.",
            "sent3": "The mischievous dog chased the cuddie around the paddock, barking happily.",
            "sent4": "The cuddie's gentle eyes reflected the kindness of its caretaker.",
            "sent5": "The cuddie's braying echoed through the valley, signaling the start of a new day."
        },
        {
            "definition": "A term of endearment for a close friend or companion",
            "pos": "noun",
            "sent1": "Hey, cuddie, want to grab a bite to eat after work?",
            "sent2": "She always knew she could count on her cuddie for support.",
            "sent3": "The group of friends laughed and joked, each one calling the other 'cuddie'.",
            "sent4": "In times of trouble, a true cuddie will stand by your side no matter what.",
            "sent5": "Their bond was unbreakable, like two peas in a cuddie pod."
        }
    ]
}