{
    "term": "cue",
    "meanings": [
        {
            "definition": "A signal for action.",
            "pos": "noun",
            "sent1": "When the bell rings, it's our cue to go home.",
            "sent2": "She took his silence as a cue to start speaking.",
            "sent3": "The barking dog was a cue for the cat to hide.",
            "sent4": "The dark clouds were a cue for the impending storm.",
            "sent5": "The teacher's raised hand was the cue for silence in the classroom."
        },
        {
            "definition": "A hint or indication.",
            "pos": "noun",
            "sent1": "His smile was a cue that he was happy.",
            "sent2": "The sudden drop in temperature was a cue that winter was coming.",
            "sent3": "The spilled milk was a cue that the cat had been there.",
            "sent4": "The loud thunder was a cue that a storm was approaching.",
            "sent5": "The red traffic light was a cue for the cars to stop."
        },
        {
            "definition": "A long, straight stick used in billiards and pool.",
            "pos": "noun",
            "sent1": "He used the cue to hit the white ball into the pocket.",
            "sent2": "The player carefully chalked the cue before taking a shot.",
            "sent3": "The cue slipped from his hand, causing him to miss the shot.",
            "sent4": "The shiny cue gleamed under the bright lights of the pool hall.",
            "sent5": "She held the cue with a steady hand, aiming for the black ball."
        },
        {
            "definition": "A line of text in a script indicating an actor's entrance or speech.",
            "pos": "noun",
            "sent1": "The actor waited for his cue before walking onto the stage.",
            "sent2": "She missed her cue and entered the scene too early.",
            "sent3": "The cue for the actor's entrance was a loud knock on the door.",
            "sent4": "The director gave a subtle nod as the cue for the actor to begin.",
            "sent5": "The spotlight illuminated the actor as he followed his cue to speak."
        }
    ]
}