{
    "term": "cull",
    "meanings": [
        {
            "definition": "Select from a group and remove the less desirable members.",
            "pos": "verb",
            "sent1": "The farmer had to cull the weak plants from the garden to ensure healthy growth.",
            "sent2": "The teacher will cull the incorrect answers from the test papers before grading them.",
            "sent3": "The chef had to cull the overcooked vegetables from the pot before serving.",
            "sent4": "She carefully culls the unnecessary details from her writing to make it more concise.",
            "sent5": "In order to improve the team's performance, the coach decided to cull the less skilled players."
        },
        {
            "definition": "To gather or collect.",
            "pos": "verb",
            "sent1": "The children eagerly cull seashells along the shore during their beach trip.",
            "sent2": "She likes to cull fresh flowers from her garden to decorate the house.",
            "sent3": "The students cull interesting facts from various sources for their research project.",
            "sent4": "He would cull memories of their adventures together in a special photo album.",
            "sent5": "The librarian would cull new books to add to the library's collection."
        },
        {
            "definition": "To kill animals in a population for management or control purposes.",
            "pos": "verb",
            "sent1": "The wildlife officials had to cull a specific number of deer to maintain a balanced ecosystem.",
            "sent2": "Farmers sometimes cull older chickens to make room for new hatchlings.",
            "sent3": "The zookeepers had to cull the invasive species to protect the native animals.",
            "sent4": "In some regions, authorities cull certain fish species to prevent overpopulation.",
            "sent5": "The park rangers carefully cull the deer population to prevent damage to the forest ecosystem."
        }
    ]
}