{
    "term": "cultishnesses",
    "meanings": [
        {
            "definition": "The quality or characteristic of being cultish.",
            "pos": "noun",
            "sent1": "The cultishnesses of the group were evident in their strict rules and rituals.",
            "sent2": "The cultishnesses of the organization included secretive meetings and unwavering loyalty.",
            "sent3": "She jokingly referred to her friend's obsession with unicorns as cultishnesses.",
            "sent4": "The cultishnesses of the fashion industry can sometimes be overwhelming.",
            "sent5": "The cultishnesses of the fan club made new members feel both excited and nervous."
        },
        {
            "definition": "The behavior or practices associated with a cult.",
            "pos": "noun",
            "sent1": "The cultishnesses of the group involved chanting and wearing matching outfits.",
            "sent2": "The cultishnesses of the sect included isolation from the outside world.",
            "sent3": "Their shared love for a particular TV show led to some cultishnesses among the fans.",
            "sent4": "The cultishnesses of the group were like a tightly knit community.",
            "sent5": "The cultishnesses of the club created a sense of belonging among its members."
        },
        {
            "definition": "The state of being influenced or controlled by a cult.",
            "pos": "noun",
            "sent1": "She felt trapped in the cultishnesses of the group, unable to make her own decisions.",
            "sent2": "The cultishnesses of the organization had a strong hold on its followers.",
            "sent3": "He humorously blamed his late-night cravings on the cultishnesses of junk food ads.",
            "sent4": "The cultishnesses of the cult leader's charisma drew people in like a magnet.",
            "sent5": "The cultishnesses of the cult's teachings clouded their judgment and critical thinking skills."
        }
    ]
}