{
    "term": "cunningest",
    "meanings": [
        {
            "definition": "Showing skill in achieving one's ends by deceit or evasion.",
            "pos": "adjective",
            "sent1": "The fox was the cunningest animal in the forest, always outsmarting the other creatures.",
            "sent2": "She was known as the cunningest spy in the agency, able to gather information without anyone suspecting.",
            "sent3": "The cunningest magician in town could make coins disappear and reappear in the blink of an eye.",
            "sent4": "Her cunningest move was pretending to befriend her rival while secretly plotting to sabotage her.",
            "sent5": "The cunningest disguise he wore was that of a harmless old man, fooling everyone around him."
        },
        {
            "definition": "Skillful or clever in a deceptive way.",
            "pos": "adjective",
            "sent1": "The cunningest thief in the city could pick locks without making a sound.",
            "sent2": "He was the cunningest negotiator, always finding a way to get what he wanted.",
            "sent3": "The cunningest actor on stage could make the audience believe any role he played.",
            "sent4": "Her cunningest plan involved creating a diversion to distract the guards while she snuck past.",
            "sent5": "The cunningest disguise he wore was that of a harmless old man, fooling everyone around him."
        },
        {
            "definition": "Attractive or quaint in a way that is striking or unusual.",
            "pos": "adjective",
            "sent1": "The shop on the corner had the cunningest decorations, drawing in customers with its charm.",
            "sent2": "She wore the cunningest dress at the party, catching everyone's eye with its unique design.",
            "sent3": "The cunningest little cottage in the village was rumored to be home to a magical creature.",
            "sent4": "The cunningest flower in the garden bloomed only once a year, captivating all who saw it.",
            "sent5": "The cunningest smile she gave him made his heart skip a beat, its warmth undeniable."
        }
    ]
}