{
    "term": "cup",
    "meanings": [
        {
            "definition": "A small, open container used for drinking",
            "pos": "noun",
            "sent1": "I filled the cup with water from the tap.",
            "sent2": "She sipped tea from a delicate cup.",
            "sent3": "The cup danced on the edge of the table, threatening to fall.",
            "sent4": "His heart overflowed like a cup with love for his family.",
            "sent5": "The cup slipped from her grasp, shattering on the floor."
        },
        {
            "definition": "A unit of measurement equal to eight fluid ounces",
            "pos": "noun",
            "sent1": "The recipe called for one cup of sugar.",
            "sent2": "He poured a cup of milk into the mixing bowl.",
            "sent3": "The baker mistakenly added a cup of salt instead of sugar.",
            "sent4": "Her enthusiasm for baking was measured by the cup of flour she used.",
            "sent5": "The cup of water was just the right amount for the recipe."
        },
        {
            "definition": "To form one's hands into a curved shape",
            "pos": "verb",
            "sent1": "He cupped his hands to catch the falling leaves.",
            "sent2": "She cupped her hands around the butterfly gently.",
            "sent3": "The magician cupped his hands and revealed a hidden coin.",
            "sent4": "The child cupped her hands to drink water from the stream.",
            "sent5": "Cupping his hands, he blew warm air to keep them from freezing."
        },
        {
            "definition": "To hold something in a curved shape",
            "pos": "verb",
            "sent1": "She cupped the fragile bird in her hands.",
            "sent2": "He cupped the injured kitten gently.",
            "sent3": "The chef cupped the dough to form perfect bread rolls.",
            "sent4": "The gardener cupped the delicate flower to protect it from the wind.",
            "sent5": "Cupping the glass ornament, she admired its beauty."
        },
        {
            "definition": "To participate in a sports competition",
            "pos": "verb",
            "sent1": "He trained hard to cup in the upcoming race.",
            "sent2": "She was excited to cup in the swimming competition.",
            "sent3": "The team decided to cup in the basketball tournament.",
            "sent4": "They were determined to cup in the soccer championship.",
            "sent5": "Cupping in the marathon was a dream come true for him."
        }
    ]
}