{
    "term": "cuppers",
    "meanings": [
        {
            "definition": "A person who cups or participates in cupping.",
            "pos": "noun",
            "sent1": "The cuppers carefully evaluated the aroma of the coffee beans.",
            "sent2": "The cuppers gathered to taste and rate different coffee blends.",
            "sent3": "The cuppers joked about having a 'cupping party' to test various coffees.",
            "sent4": "She was a skilled cupper, able to distinguish subtle flavors in the coffee samples.",
            "sent5": "The group of cuppers shared their favorite brewing techniques with each other."
        },
        {
            "definition": "A competition or tournament where teams compete for a cup trophy.",
            "pos": "noun",
            "sent1": "The cuppers cheered loudly as their team scored a goal.",
            "sent2": "The cuppers from different schools competed in the soccer tournament.",
            "sent3": "The cuppers celebrated their victory by hoisting the shiny trophy in the air.",
            "sent4": "In the final match, the cuppers displayed exceptional teamwork and skill.",
            "sent5": "The cuppers proudly displayed their hard-earned trophy in the school's trophy case."
        },
        {
            "definition": "A type of coffee brewing method using a device called a cupper.",
            "pos": "noun",
            "sent1": "The barista demonstrated how to use the cupper to make a perfect cup of coffee.",
            "sent2": "The coffee shop offered a special discount on cuppers for customers interested in trying a new brewing method.",
            "sent3": "The cuppers at the café attracted curious customers who wanted to learn about the unique brewing technique.",
            "sent4": "Using the cupper, the barista was able to extract rich flavors from the coffee beans.",
            "sent5": "The aroma of freshly brewed coffee from the cupper filled the room with a delightful scent."
        }
    ]
}