{
    "term": "cupping",
    "meanings": [
        {
            "definition": "The act of placing a cup on the skin to create suction.",
            "pos": "noun",
            "sent1": "During the cupping session, the therapist placed a warm cup on my back.",
            "sent2": "She experienced relief from her back pain after the cupping treatment.",
            "sent3": "The cupping process felt like a gentle hug on my skin.",
            "sent4": "The cupping sensation was like a tiny vacuum cleaner on my back.",
            "sent5": "The cupping left circular marks on my skin, like little kisses from the cups."
        },
        {
            "definition": "A method of alternative medicine involving the use of cups to create suction on the skin.",
            "pos": "noun",
            "sent1": "The cupping therapy helped improve blood circulation in her body.",
            "sent2": "Many people find relief from pain through cupping treatments.",
            "sent3": "He joked that cupping was like having octopus kisses on his skin.",
            "sent4": "The cupping technique is like a reverse massage pulling the skin gently.",
            "sent5": "After the cupping session, she felt rejuvenated as if the cups had sucked out all the tension."
        },
        {
            "definition": "The process of participating in a cupping competition.",
            "pos": "noun",
            "sent1": "She trained hard for the cupping competition to showcase her skills.",
            "sent2": "The cupping contest drew participants from all over the country.",
            "sent3": "In the cupping championship, the competitors showed impressive cupping techniques.",
            "sent4": "The cupping event was intense, with each participant aiming for victory.",
            "sent5": "The cupping challenge tested their precision and speed in placing the cups."
        },
        {
            "definition": "The act of forming a cup shape with one's hands.",
            "pos": "noun",
            "sent1": "She demonstrated the cupping of her hands to catch the water.",
            "sent2": "The children enjoyed playing with shadows created by cupping their hands.",
            "sent3": "His cupping of hands made a perfect nest for the baby bird.",
            "sent4": "The cupping of his hands resembled a tiny bowl holding imaginary treasures.",
            "sent5": "The cupping of hands created a cozy space for the butterfly to rest."
        }
    ]
}