{
    "term": "cups",
    "meanings": [
        {
            "definition": "A small open container used for drinking",
            "pos": "noun",
            "sent1": "She drank water from the cups.",
            "sent2": "The cups were filled with hot tea.",
            "sent3": "The cups giggled as they were filled with soda.",
            "sent4": "Her laughter bubbled over like a cup overflowing with joy.",
            "sent5": "The cups clinked together in a toast, creating a cheerful sound."
        },
        {
            "definition": "A unit of measurement equal to eight fluid ounces",
            "pos": "noun",
            "sent1": "He needed two cups of flour for the recipe.",
            "sent2": "The recipe called for three cups of milk.",
            "sent3": "The cups in the kitchen were having a race to measure the flour.",
            "sent4": "Her love for baking was immeasurable, like a cup that never runs out.",
            "sent5": "The cups lined up neatly on the shelf, each holding a specific amount of liquid."
        },
        {
            "definition": "A sports competition in which teams compete for a trophy",
            "pos": "noun",
            "sent1": "The soccer team won the cups last year.",
            "sent2": "Fans cheered loudly during the cups final.",
            "sent3": "The cups were so shiny, they blinded the players.",
            "sent4": "The cups competition was a battlefield of skills and determination.",
            "sent5": "The cups tournament brought out the best in each team, pushing them to their limits."
        },
        {
            "definition": "To hold something in a curved shape in one's hands",
            "pos": "verb",
            "sent1": "She cups her hands to catch the raindrops.",
            "sent2": "He cups the fragile butterfly gently.",
            "sent3": "The magician cups the air, pretending to hold an invisible object.",
            "sent4": "Her heart cupped the memories close, treasuring each moment.",
            "sent5": "The child cups the tiny bird, feeling its delicate heartbeat in his palms."
        },
        {
            "definition": "To form into the shape of a cup",
            "pos": "verb",
            "sent1": "She cups the dough before placing it in the oven.",
            "sent2": "The potter cups the clay to create a bowl.",
            "sent3": "The clouds cupped the sun as it set in the horizon.",
            "sent4": "His hands cupped the water, shaping it into a perfect sphere.",
            "sent5": "The flower petals cupped around the dewdrops, glistening in the morning light."
        }
    ]
}