{
    "term": "cur",
    "meanings": [
        {
            "definition": "A mongrel or inferior dog.",
            "pos": "noun",
            "sent1": "The little cur barked loudly at the mailman.",
            "sent2": "I saw a stray cur wandering the streets yesterday.",
            "sent3": "The cur chased its tail in circles, looking quite silly.",
            "sent4": "The cur's fur was a patchwork of different colors, like a quilt.",
            "sent5": "The cur's tail wagged happily as it played in the park."
        },
        {
            "definition": "A mean, cowardly person.",
            "pos": "noun",
            "sent1": "That cur never stands up for what is right.",
            "sent2": "The village was afraid of the cur who spread rumors.",
            "sent3": "The cur always ran away when things got tough.",
            "sent4": "His actions were those of a cur, sneaky and deceitful.",
            "sent5": "The cur hid behind others when faced with a challenge."
        },
        {
            "definition": "To growl or snarl.",
            "pos": "verb",
            "sent1": "The dog began to cur at the stranger approaching the house.",
            "sent2": "The bear curled its lip and curled menacingly.",
            "sent3": "The cat curled up its back and curled at the toy mouse.",
            "sent4": "The wolf's cur echoed through the forest, sending shivers down my spine.",
            "sent5": "The lion's cur could be heard from miles away, a warning to all."
        },
        {
            "definition": "To behave in a cowardly or servile manner.",
            "pos": "verb",
            "sent1": "He would cur whenever his boss raised his voice.",
            "sent2": "The knight refused to cur before the tyrant king.",
            "sent3": "She would cur and apologize even when she did nothing wrong.",
            "sent4": "The soldier's decision to cur in battle cost him the respect of his comrades.",
            "sent5": "The politician would cur to anyone with power, losing the trust of the people."
        }
    ]
}