{
    "term": "curanderas",
    "meanings": [
        {
            "definition": "Curanderas (noun): Traditional healers or folk medicine practitioners in Latin American cultures.",
            "pos": "noun",
            "sent1": "The curanderas in the village use herbs and prayers to heal people.",
            "sent2": "People seek the curanderas' help when they are sick or in pain.",
            "sent3": "The curious cat watched the curanderas mix potions in their hut.",
            "sent4": "The power of the curanderas' knowledge is like a beacon of hope in the community.",
            "sent5": "The colorful robes of the curanderas fluttered in the wind as they worked."
        },
        {
            "definition": "Curanderas (verb): The act of practicing traditional healing methods or folk medicine.",
            "pos": "verb",
            "sent1": "She curanderas with skill and compassion, helping those in need.",
            "sent2": "Many people curanderas to preserve ancient healing traditions.",
            "sent3": "He curanderas every day, passing on the knowledge to the next generation.",
            "sent4": "The music seemed to curanderas through the room, soothing all who listened.",
            "sent5": "The fire crackled as she curanderas, creating a sense of peace and healing."
        },
        {
            "definition": "Curanderas (adjective): Describing someone or something related to traditional healing practices or folk medicine.",
            "pos": "adjective",
            "sent1": "The curanderas rituals were filled with ancient wisdom and tradition.",
            "sent2": "The village was known for its curanderas remedies and cures.",
            "sent3": "Her curanderas charm bracelet jingled softly as she walked.",
            "sent4": "The old book held a curanderas secret that could change everything.",
            "sent5": "The scent of herbs filled the air, creating a curanderas atmosphere of healing."
        }
    ]
}