{
    "term": "curarizations",
    "meanings": [
        {
            "definition": "The process of administering a drug to induce muscle relaxation.",
            "pos": "noun",
            "sent1": "During the curarizations, the patient's muscles become relaxed for the surgery.",
            "sent2": "After the curarizations, the patient's muscles were completely relaxed.",
            "sent3": "The curarizations made the patient's muscles so relaxed that they felt like jelly.",
            "sent4": "The curarizations acted like a magic spell, turning the patient's muscles into soft clay.",
            "sent5": "The curarizations were like a gentle breeze, calming the muscles into a peaceful state."
        },
        {
            "definition": "The state of being under the effects of a muscle relaxant.",
            "pos": "noun",
            "sent1": "The curarizations left the patient feeling pleasantly relaxed.",
            "sent2": "She experienced curarizations after the injection of the muscle relaxant.",
            "sent3": "The curarizations made the patient giggle as their muscles felt like noodles.",
            "sent4": "Under the curarizations, the patient's body felt weightless and free.",
            "sent5": "The curarizations enveloped the patient in a soothing blanket of relaxation."
        },
        {
            "definition": "The act of using a drug to paralyze muscles for medical purposes.",
            "pos": "noun",
            "sent1": "The curarizations were necessary to immobilize the patient's muscles for the procedure.",
            "sent2": "Doctors carefully monitored the curarizations during the surgery.",
            "sent3": "The curarizations made the patient's muscles as still as statues.",
            "sent4": "Under the curarizations, the patient's muscles were as motionless as rocks.",
            "sent5": "The curarizations locked the patient's muscles in place, like a powerful spell."
        }
    ]
}