{
    "term": "curettages",
    "meanings": [
        {
            "definition": "The act of removing tissue or growths from a body cavity using a curette.",
            "pos": "noun",
            "sent1": "During the curettages, the doctor carefully removed the abnormal tissue from the patient's uterus.",
            "sent2": "The curettages performed by the surgeon helped improve the patient's health.",
            "sent3": "The curettages seemed like a tiny garden cleanup inside the body.",
            "sent4": "Her precision in performing the curettages was like an artist delicately sculpting a masterpiece.",
            "sent5": "The curettages were like a tiny vacuum cleaner tidying up the inside of the body."
        },
        {
            "definition": "The surgical procedure of curetting a body cavity.",
            "pos": "noun",
            "sent1": "After the curettages, the patient felt relieved from the discomfort in the body cavity.",
            "sent2": "The curettages were successful in removing the abnormal growth from the body cavity.",
            "sent3": "The curettages turned the body cavity into a construction site for a brief moment.",
            "sent4": "The precision of the curettages was like a skilled sculptor shaping a masterpiece.",
            "sent5": "The curettages were like a gentle breeze cleaning out the body cavity."
        },
        {
            "definition": "The process of scraping or cleaning a surface with a curette.",
            "pos": "noun",
            "sent1": "The curettages on the surface of the tooth removed the plaque effectively.",
            "sent2": "Regular curettages of the skin help maintain its cleanliness and health.",
            "sent3": "The curettages on the surface felt like a mini spa treatment for the skin.",
            "sent4": "Her gentle curettages on the surface were like a painter delicately touching up a canvas.",
            "sent5": "The curettages on the surface were as thorough as a deep cleaning of a room."
        }
    ]
}