{
    "term": "curies",
    "meanings": [
        {
            "definition": "The unit of radioactivity, equal to 3.7 x 10^10 disintegrations per second.",
            "pos": "noun",
            "sent1": "Scientists measure the radioactivity of a substance in curies.",
            "sent2": "The Geiger counter detected high levels of curies in the sample.",
            "sent3": "The curious cat accidentally knocked over the container of curies, causing a radioactive mess.",
            "sent4": "Her enthusiasm for science was like a curie, emitting energy and excitement.",
            "sent5": "The eerie glow of the curies in the dark laboratory was both fascinating and alarming."
        },
        {
            "definition": "The plural form of the noun 'curie', referring to multiple units of radioactivity.",
            "pos": "noun",
            "sent1": "The lab contained several curies, each emitting its own level of radioactivity.",
            "sent2": "Scientists compared the curies from different samples to analyze their radioactivity.",
            "sent3": "The students were amazed by the glowing curies in the science exhibit.",
            "sent4": "The room was filled with curies, creating a surreal atmosphere of scientific wonder.",
            "sent5": "The curies in the radioactive waste disposal facility were carefully monitored to prevent any leaks."
        },
        {
            "definition": "The third person singular form of the verb 'curie', meaning to exhibit radioactivity.",
            "pos": "noun",
            "sent1": "The radioactive material curies when left undisturbed.",
            "sent2": "He observes how the substance curies under specific conditions.",
            "sent3": "The radioactive spider accidentally curies, causing chaos in the lab.",
            "sent4": "The old watch curies faintly, a reminder of its radioactive past.",
            "sent5": "The abandoned nuclear plant curies silently, a ghostly presence in the deserted town."
        }
    ]
}