{
    "term": "curriculums",
    "meanings": [
        {
            "definition": "The subjects comprising a course of study in a school or college.",
            "pos": "noun",
            "sent1": "In our school, the curriculums include math, science, and history.",
            "sent2": "Students can choose from a variety of curriculums to tailor their education.",
            "sent3": "The curious cat decided to explore the curriculums of the library books.",
            "sent4": "Her mind was a garden, with curriculums blooming like colorful flowers.",
            "sent5": "The curriculums were like puzzle pieces, fitting together to form a complete picture of learning."
        },
        {
            "definition": "The total sum of courses offered by an educational institution.",
            "pos": "noun",
            "sent1": "The university's curriculums cover a wide range of subjects for students to choose from.",
            "sent2": "Exploring different curriculums can help students discover their interests.",
            "sent3": "The curriculums on the school website seemed to be never-ending.",
            "sent4": "His knowledge expanded like the branches of a tree, each representing a different curriculum.",
            "sent5": "She dove into the curriculums like a swimmer entering the pool, eager to learn and grow."
        },
        {
            "definition": "The planned sequence of courses and experiences offered by an educational institution.",
            "pos": "noun",
            "sent1": "Following the curriculum ensures that students learn key concepts in a logical order.",
            "sent2": "Teachers work together to create a cohesive curriculum for the school year.",
            "sent3": "The mischievous student tried to sneak a peek at the upcoming curriculums.",
            "sent4": "The curriculum was a roadmap, guiding students through their educational journey.",
            "sent5": "Each curriculum was a chapter in the book of education, building upon the last for a complete story of learning."
        }
    ]
}