{
    "term": "currs",
    "meanings": [
        {
            "definition": "A mongrel or inferior dog.",
            "pos": "noun",
            "sent1": "The shelter took in a few currs looking for a loving home.",
            "sent2": "The neighborhood kids found a stray currs wandering the streets.",
            "sent3": "The little currs tried to chase away a squirrel but ended up getting scared.",
            "sent4": "The currs in the pound longed for a family to call their own.",
            "sent5": "The currs barked happily as they played in the park."
        },
        {
            "definition": "A mean or contemptible person.",
            "pos": "noun",
            "sent1": "The bully at school was known as a currs by everyone.",
            "sent2": "She couldn't believe her friend would turn into such a currs.",
            "sent3": "The currs tried to cheat his way through the game but got caught.",
            "sent4": "He was a currs, always looking out for himself and no one else.",
            "sent5": "The currs smirked as he made fun of others, showing his true colors."
        },
        {
            "definition": "To growl or snarl like a dog.",
            "pos": "verb",
            "sent1": "The dog currs loudly when someone approaches the fence.",
            "sent2": "The puppy currs playfully as it tugs on its toy.",
            "sent3": "She jokingly told her friend to stop currs like a grumpy old dog.",
            "sent4": "The thunder currs in the distance, warning of an approaching storm.",
            "sent5": "The bear currs fiercely, protecting its territory from intruders."
        },
        {
            "definition": "To utter in a low, harsh voice.",
            "pos": "verb",
            "sent1": "The old man currs his disapproval at the noisy neighbors.",
            "sent2": "The singer currs out the emotional lyrics of the song.",
            "sent3": "The teacher currs a warning to the students to quiet down.",
            "sent4": "The wind currs through the trees, creating an eerie sound.",
            "sent5": "The villain currs his sinister plan to his henchmen in secret."
        }
    ]
}