{
    "term": "curriers",
    "meanings": [
        {
            "definition": "A person who dresses and colors leather after it is tanned.",
            "pos": "noun",
            "sent1": "The curriers in the workshop skillfully dyed the leather to make colorful bags.",
            "sent2": "The skilled curriers worked on the leather to give it a beautiful finish.",
            "sent3": "The curious cat watched the curriers work on the leather, wondering what they were doing.",
            "sent4": "The artist used the leather like a canvas, becoming a currier of colors and textures.",
            "sent5": "The smell of leather filled the room as the curriers worked their magic on the hides."
        },
        {
            "definition": "To rub and clean (a horse) with a currycomb.",
            "pos": "verb",
            "sent1": "She gently curriers her horse to keep its coat shiny and smooth.",
            "sent2": "The stable hand curriers the horses every morning to keep them clean.",
            "sent3": "The horse seemed to enjoy being curried, leaning into the brush with pleasure.",
            "sent4": "As she curriers the horse, she notices how the sunlight gleams on its coat.",
            "sent5": "Currying the horse is a soothing routine that strengthens the bond between them."
        },
        {
            "definition": "To dress (tanned hides) by soaking, beating, coloring, and pressing.",
            "pos": "verb",
            "sent1": "The artisan carefully curriers the hides to prepare them for crafting.",
            "sent2": "Curriers use various techniques to transform tanned hides into usable materials.",
            "sent3": "The curious child tried to help currier the hides but ended up making a mess.",
            "sent4": "She curriers the hides with precision, turning them into works of art.",
            "sent5": "The rhythmic sound of curriers working on hides filled the workshop with life."
        }
    ]
}