{
    "term": "curricular",
    "meanings": [
        {
            "definition": "relating to the courses of study offered by an educational institution",
            "pos": "adjective",
            "sent1": "The school's curricular activities include math, science, and art classes.",
            "sent2": "The curricular requirements for graduation include completing a certain number of credits.",
            "sent3": "The students found a curricular loophole that allowed them to take an extra elective.",
            "sent4": "Her passion for curricular exploration led her to pursue a double major in biology and chemistry.",
            "sent5": "The teacher made the curricular material engaging by incorporating hands-on experiments."
        },
        {
            "definition": "of or relating to the curriculum",
            "pos": "adjective",
            "sent1": "The curricular changes were implemented to enhance student learning outcomes.",
            "sent2": "Teachers meet regularly to discuss curricular updates and improvements.",
            "sent3": "The principal's favorite task is reviewing curricular guidelines for the upcoming year.",
            "sent4": "The school board approved the new curricular framework after months of deliberation.",
            "sent5": "The curricular committee worked tirelessly to align the curriculum with state standards."
        },
        {
            "definition": "pertaining to the subjects taught in a school or college",
            "pos": "adjective",
            "sent1": "The university offers a wide range of curricular options for students to choose from.",
            "sent2": "The professor's expertise lies in curricular development and educational planning.",
            "sent3": "Students eagerly anticipate the release of the curricular schedule each semester.",
            "sent4": "The curricular diversity at the school allows students to explore various academic interests.",
            "sent5": "The curricular content is designed to prepare students for future career opportunities."
        }
    ]
}