{
    "term": "custodial",
    "meanings": [
        {
            "definition": "relating to or responsible for the care or protection of someone or something",
            "pos": "adjective",
            "sent1": "The custodial staff ensures the school is clean and safe for students.",
            "sent2": "The custodial duties include keeping the building tidy and secure.",
            "sent3": "The custodial worker joked that they were the 'guardian angel' of the school.",
            "sent4": "The custodial role in the company is like a shield, protecting the premises.",
            "sent5": "The custodial responsibility is like being a watchful guardian, always looking out for others."
        },
        {
            "definition": "relating to or denoting a parent with whom a child has been placed by the court",
            "pos": "adjective",
            "sent1": "The custodial parent picked up their child from school every day.",
            "sent2": "The custodial arrangement allowed the child to spend weekends with their mother.",
            "sent3": "The custodial mom was always there to tuck her child into bed at night.",
            "sent4": "Being the custodial guardian felt like having a special bond with the child.",
            "sent5": "The custodial role of the father was to provide a loving and stable home for the child."
        },
        {
            "definition": "a person who has custody of something",
            "pos": "noun",
            "sent1": "The custodial of the keys was responsible for opening the store every morning.",
            "sent2": "The custodial of the documents ensured they were kept safe and organized.",
            "sent3": "The custodial of the treasure map kept it hidden in a secret location.",
            "sent4": "The custodial of the ancient artifact felt a great sense of responsibility.",
            "sent5": "The custodial of the family heirloom cherished its history and significance."
        }
    ]
}