{
    "term": "cutbacks",
    "meanings": [
        {
            "definition": "Reduction in the amount or extent of something.",
            "pos": "noun",
            "sent1": "The company made cutbacks in production to save money.",
            "sent2": "The government implemented cutbacks in public services due to budget constraints.",
            "sent3": "The idea of cutbacks on dessert portions at the party was met with disappointment.",
            "sent4": "Her decision to make cutbacks in her social media usage was like trimming excess weight off her daily routine.",
            "sent5": "The cutbacks in the number of available parking spots made finding a space a real challenge."
        },
        {
            "definition": "A decrease in spending or resources.",
            "pos": "noun",
            "sent1": "Cutbacks in the household budget meant fewer shopping trips.",
            "sent2": "The organization faced financial difficulties and had to make cutbacks in staff salaries.",
            "sent3": "The cutbacks in snack options for the party left guests craving more variety.",
            "sent4": "Her energy levels felt like they were experiencing cutbacks after a long day at work.",
            "sent5": "The cutbacks in office supplies made it challenging to complete tasks efficiently."
        },
        {
            "definition": "A reduction in the number of employees or services.",
            "pos": "noun",
            "sent1": "The company's cutbacks led to layoffs in various departments.",
            "sent2": "The school district announced cutbacks in bus routes to save on transportation costs.",
            "sent3": "The cutbacks in the number of available lifeguards at the pool raised safety concerns.",
            "sent4": "Her decision to make cutbacks in her social commitments allowed her more time for self-care.",
            "sent5": "The cutbacks in library hours made it difficult for students to access resources for research."
        }
    ]
}