{
    "term": "cutback",
    "meanings": [
        {
            "definition": "A reduction in the amount or extent of something.",
            "pos": "noun",
            "sent1": "The cutback in staff led to longer wait times.",
            "sent2": "The company had to implement a cutback in expenses to stay afloat.",
            "sent3": "The cutback in dessert portions left everyone craving more.",
            "sent4": "Her cutback in screen time resulted in improved focus.",
            "sent5": "The cutback in sugar intake made a noticeable difference in her health."
        },
        {
            "definition": "A decrease in spending or production.",
            "pos": "noun",
            "sent1": "The cutback in production was necessary due to low demand.",
            "sent2": "The government announced a cutback in public spending.",
            "sent3": "The cutback in chocolate consumption caused a stir among the group.",
            "sent4": "His cutback in work hours impacted his income significantly.",
            "sent5": "The cutback in oil production led to a rise in prices."
        },
        {
            "definition": "To reduce or decrease in size, amount, or extent.",
            "pos": "verb",
            "sent1": "She decided to cutback on unnecessary expenses.",
            "sent2": "The team had to cutback on the number of projects to meet deadlines.",
            "sent3": "He tried to cutback on his video game time but found it challenging.",
            "sent4": "The company had to cutback on staff to save costs.",
            "sent5": "To improve his health, he had to cutback on unhealthy snacks."
        },
        {
            "definition": "To make a reduction in spending or production.",
            "pos": "verb",
            "sent1": "The company had to cutback on advertising to balance the budget.",
            "sent2": "They decided to cutback on the number of products to focus on quality.",
            "sent3": "She had to cutback on shopping to save money for the trip.",
            "sent4": "The factory had to cutback on production due to a shortage of materials.",
            "sent5": "To meet the new regulations, they had to cutback on emissions."
        }
    ]
}