{
    "term": "cutbank",
    "meanings": [
        {
            "definition": "A steep bank or cliff created by erosion, especially along a river or stream.",
            "pos": "noun",
            "sent1": "The hikers carefully climbed down the cutbank to reach the river below.",
            "sent2": "The river curved sharply, revealing a tall cutbank on its edge.",
            "sent3": "The adventurous squirrel attempted to climb the cutbank but ended up sliding down comically.",
            "sent4": "Her determination was like a cutbank, unwavering and solid against the forces of nature.",
            "sent5": "The cutbank loomed above them, a testament to the power of water over time."
        },
        {
            "definition": "To erode or wear away the bank of a body of water, creating a cutbank.",
            "pos": "verb",
            "sent1": "The river's strong currents cutbanked the shore, reshaping the landscape.",
            "sent2": "Over time, the flowing water cutbanked the soil, revealing layers of history.",
            "sent3": "The mischievous otters seemed to enjoy cutbanking the muddy riverbed with their playful antics.",
            "sent4": "His words seemed to cutbank through her defenses, leaving her vulnerable and exposed.",
            "sent5": "The relentless waves continued to cutbank the coastline, forever changing its shape."
        },
        {
            "definition": "The act of cutting into a bank or slope, often for construction or landscaping purposes.",
            "pos": "noun",
            "sent1": "The workers began the cutbank to create a level foundation for the new building.",
            "sent2": "The landscaper carefully planned the cutbank to enhance the garden's aesthetics.",
            "sent3": "The children's sandbox became a battleground as they dug trenches in the cutbank.",
            "sent4": "Her creativity was a cutbank, shaping the land of imagination into new possibilities.",
            "sent5": "The cutbank revealed layers of soil history, like pages in a book waiting to be read."
        }
    ]
}