{
    "term": "cutdown",
    "meanings": [
        {
            "definition": "To reduce in size or amount.",
            "pos": "verb",
            "sent1": "I had to cutdown the number of toys I could bring to the party.",
            "sent2": "She decided to cutdown on sugary snacks to improve her health.",
            "sent3": "The suitcase was too heavy, so I had to cutdown on the number of clothes I packed.",
            "sent4": "The tree branches were cutdown to make way for a new road.",
            "sent5": "The chef had to cutdown the recipe to fit the smaller pan."
        },
        {
            "definition": "A reduction in size or amount.",
            "pos": "noun",
            "sent1": "The cutdown in expenses helped the company save money.",
            "sent2": "The doctor recommended a cutdown in daily calorie intake.",
            "sent3": "The cutdown of trees in the forest led to a decrease in wildlife habitat.",
            "sent4": "The cutdown of staff members caused a decrease in productivity.",
            "sent5": "The cutdown of the cake into smaller slices made it easier to share."
        },
        {
            "definition": "To criticize or belittle someone.",
            "pos": "verb",
            "sent1": "She would often cutdown her classmates in front of others.",
            "sent2": "It's not nice to cutdown someone's ideas without giving them a chance.",
            "sent3": "He tried to cutdown my efforts, but I didn't let it bother me.",
            "sent4": "The coach would cutdown the players during practice to push them to improve.",
            "sent5": "The boss would cutdown his employees in meetings, which affected morale."
        },
        {
            "definition": "A critical or belittling remark.",
            "pos": "noun",
            "sent1": "His constant cutdowns were starting to affect her self-esteem.",
            "sent2": "She brushed off the cutdown and continued with her work.",
            "sent3": "The comedian's cutdowns were meant to be funny but sometimes crossed the line.",
            "sent4": "The teacher overheard the cutdown and addressed it immediately.",
            "sent5": "The cutdown from her friend hurt more than she expected."
        }
    ]
}