{
    "term": "cuttling",
    "meanings": [
        {
            "definition": "To move quickly and lightly",
            "pos": "verb",
            "sent1": "The rabbit was cuttling across the field.",
            "sent2": "She cuttled through the crowd to catch the bus.",
            "sent3": "The squirrel was cuttling around the tree, trying to find its hidden acorn.",
            "sent4": "The leaves were cuttling in the wind, creating a rustling sound.",
            "sent5": "The dancer's feet were cuttling on the stage, mesmerizing the audience."
        },
        {
            "definition": "A small, young fish",
            "pos": "noun",
            "sent1": "The pond was full of colorful cuttlings swimming around.",
            "sent2": "The fisherman caught a tiny cuttling in the stream.",
            "sent3": "The little cuttling seemed to be playing hide and seek with the other fish.",
            "sent4": "The school of cuttlings moved gracefully in the water, like a synchronized dance.",
            "sent5": "The children were excited to see the baby cuttlings in the aquarium."
        },
        {
            "definition": "A small, thin piece of wood",
            "pos": "noun",
            "sent1": "She used a cuttling to stir the paint in the can.",
            "sent2": "The craftsman carefully carved the intricate design on the cuttling.",
            "sent3": "The artist picked up a cuttling to use as a makeshift paintbrush.",
            "sent4": "The old table was made of cuttlings, giving it a rustic charm.",
            "sent5": "He found a perfect cuttling to use as a bookmark in his book."
        },
        {
            "definition": "To make a small, quick incision",
            "pos": "verb",
            "sent1": "The surgeon needed to cuttle the patient's skin to remove the splinter.",
            "sent2": "She carefully cuttled the envelope open with a pair of scissors.",
            "sent3": "He decided to cuttle the cake into small slices for easy sharing.",
            "sent4": "The tailor had to cuttle the fabric to make alterations to the dress.",
            "sent5": "The chef used a sharp knife to cuttle the vegetables for the stir-fry."
        }
    ]
}