{
    "term": "cuttlefish",
    "meanings": [
        {
            "definition": "A marine animal with eight arms and two tentacles, a soft body, and a hard internal shell.",
            "pos": "noun",
            "sent1": "The cuttlefish gracefully swam through the ocean, showing off its eight arms.",
            "sent2": "I saw a cuttlefish at the aquarium with its soft body and hard shell.",
            "sent3": "The cuttlefish tried to hide in the sand, but its eight arms gave it away.",
            "sent4": "Her creativity was like a cuttlefish, with many arms reaching out in different directions.",
            "sent5": "The cuttlefish's ability to change colors made it a fascinating creature to watch."
        },
        {
            "definition": "To fish for or catch cuttlefish.",
            "pos": "verb",
            "sent1": "We decided to cuttlefish for dinner and headed out to sea with our fishing gear.",
            "sent2": "He enjoys cuttlefishing on weekends, hoping for a big catch.",
            "sent3": "Cuttlefishing can be relaxing, especially when the weather is nice.",
            "sent4": "She cuttlefishes with skill and patience, always coming back with a full net.",
            "sent5": "The fishermen set out early in the morning to cuttlefish before the sun rose."
        },
        {
            "definition": "The ink-like substance released by a cuttlefish as a defense mechanism.",
            "pos": "noun",
            "sent1": "The cuttlefish released a cloud of ink to confuse its predator and escape.",
            "sent2": "The ink from the cuttlefish spread quickly in the water, creating a dark cloud.",
            "sent3": "The cuttlefish accidentally squirted ink all over itself, creating a funny sight.",
            "sent4": "Her words flowed like the ink of a cuttlefish, leaving a lasting impression.",
            "sent5": "The cuttlefish's ink was a powerful weapon against its enemies, protecting it from harm."
        }
    ]
}