{
    "term": "cutting",
    "meanings": [
        {
            "definition": "The act of making an incision or opening with a sharp tool.",
            "pos": "noun",
            "sent1": "She watched the cutting carefully as the surgeon made the incision.",
            "sent2": "The cutting of the cake was done with precision.",
            "sent3": "The cutting in the movie scene looked so real, she had to look away.",
            "sent4": "His words were like a cutting, revealing the truth in a harsh light.",
            "sent5": "The cutting through the paper was smooth and effortless."
        },
        {
            "definition": "A piece or portion of something that has been cut off.",
            "pos": "noun",
            "sent1": "He picked up the cutting of fabric from the floor.",
            "sent2": "The chef added the cutting of vegetables to the soup.",
            "sent3": "The cutting of the cake was so big, it could feed a whole party.",
            "sent4": "The cutting of the tree branch left a noticeable gap in the canopy.",
            "sent5": "She admired the delicate cutting of the crystal vase."
        },
        {
            "definition": "Causing pain or distress by sharpness or severity.",
            "pos": "adjective",
            "sent1": "The cutting remark stung more than she expected.",
            "sent2": "His cutting words left her feeling hurt.",
            "sent3": "Despite his cutting tone, she couldn't help but laugh.",
            "sent4": "The cutting wind made her shiver uncontrollably.",
            "sent5": "The cutting criticism made her rethink her approach."
        },
        {
            "definition": "A reduction or decrease in size or amount.",
            "pos": "noun",
            "sent1": "The cutting in the budget affected various departments.",
            "sent2": "The cutting of the cake into smaller slices was necessary.",
            "sent3": "The cutting of the prices attracted more customers to the store.",
            "sent4": "The cutting of the team members was a tough decision for the manager.",
            "sent5": "The cutting of the fabric resulted in a perfectly tailored dress."
        }
    ]
}