{
    "term": "cyberpunks",
    "meanings": [
        {
            "definition": "individuals who engage in hacking or other forms of cybercrime",
            "pos": "noun",
            "sent1": "The cyberpunks were caught hacking into the company's database.",
            "sent2": "Cyberpunks are known for their skills in computer hacking.",
            "sent3": "The cyberpunks tried to hack into the school's grading system but ended up changing all the grades to A+.",
            "sent4": "In the world of cybersecurity, the cyberpunks are the modern-day pirates.",
            "sent5": "The cyberpunks lurked in the shadows of the internet, seeking their next target."
        },
        {
            "definition": "a subculture of individuals who embrace technology and reject traditional societal norms",
            "pos": "noun",
            "sent1": "The cyberpunks gathered at the tech convention to showcase their latest innovations.",
            "sent2": "In the cyberpunk community, it is cool to be different from the mainstream.",
            "sent3": "The cyberpunks organized a protest against outdated technology regulations.",
            "sent4": "She stood out in the crowd with her cyberpunk style, a mix of neon colors and futuristic accessories.",
            "sent5": "The cyberpunks lived on the edge of society, embracing a digital way of life."
        },
        {
            "definition": "a genre of science fiction literature or film that focuses on futuristic, dystopian societies",
            "pos": "noun",
            "sent1": "The cyberpunks novel painted a vivid picture of a dark, tech-driven future.",
            "sent2": "Fans of cyberpunks movies enjoy the thrilling blend of technology and rebellion.",
            "sent3": "The cyberpunks film festival featured a marathon of dystopian classics.",
            "sent4": "In the world of cyberpunks literature, imagination knows no bounds.",
            "sent5": "The cyberpunks genre explores the consequences of unchecked technological advancement."
        }
    ]
}