{
    "term": "cyclosporine",
    "meanings": [
        {
            "definition": "A drug used to prevent organ rejection in transplant patients.",
            "pos": "noun",
            "sent1": "After the kidney transplant, the doctors prescribed cyclosporine to help the body accept the new organ.",
            "sent2": "The hospital provided cyclosporine to the patient to stop the body from attacking the transplanted kidney.",
            "sent3": "The cyclosporine was like a shield, protecting the new kidney from harm.",
            "sent4": "The cyclosporine acted as a guardian, ensuring the body did not reject the transplanted organ.",
            "sent5": "The cyclosporine worked like a peacekeeper, calming the immune system's response to the new kidney."
        },
        {
            "definition": "A medication that suppresses the immune system.",
            "pos": "noun",
            "sent1": "The doctor prescribed cyclosporine to lower the immune system's activity.",
            "sent2": "Cyclosporine helps to weaken the immune system's response to prevent rejection of transplanted organs.",
            "sent3": "The immune system felt like a sleeping bear under the influence of cyclosporine.",
            "sent4": "The immune system, subdued by cyclosporine, was like a quiet river instead of a raging storm.",
            "sent5": "Cyclosporine hushed the immune system's usual loud protests, keeping it in check."
        },
        {
            "definition": "A type of immunosuppressant drug.",
            "pos": "noun",
            "sent1": "The pharmacist explained the benefits of using cyclosporine as an immunosuppressant.",
            "sent2": "Cyclosporine is an effective immunosuppressant that helps prevent rejection after organ transplants.",
            "sent3": "The immunosuppressant cyclosporine was like a gatekeeper, controlling the body's reactions.",
            "sent4": "Cyclosporine, the immunosuppressant, acted as a regulator, keeping the immune system in check.",
            "sent5": "The immunosuppressant cyclosporine was a silent guardian, ensuring the body accepted the new organ peacefully."
        }
    ]
}