{
    "term": "cyclosporin",
    "meanings": [
        {
            "definition": "A drug used to prevent organ rejection in transplant patients.",
            "pos": "noun",
            "sent1": "The doctor prescribed cyclosporin to help my body accept the new kidney.",
            "sent2": "After the surgery, the patient took cyclosporin regularly to protect the transplanted organ.",
            "sent3": "The cyclosporin worked like a shield, guarding the new kidney from being attacked.",
            "sent4": "Her daily dose of cyclosporin was like a protective barrier around her transplanted organ.",
            "sent5": "The cyclosporin acted as a guardian, ensuring the body did not reject the new kidney."
        },
        {
            "definition": "A type of immunosuppressant medication.",
            "pos": "noun",
            "sent1": "The immunosuppressant cyclosporin helped lower the risk of rejection after the transplant.",
            "sent2": "Doctors carefully monitored the levels of cyclosporin in the patient's blood to maintain immunity balance.",
            "sent3": "Taking cyclosporin was like pressing a pause button on the immune system's response.",
            "sent4": "Her body's reaction was subdued by the immunosuppressant cyclosporin.",
            "sent5": "The immunosuppressant cyclosporin quieted the immune system's rejection signals."
        },
        {
            "definition": "A compound derived from a fungus.",
            "pos": "noun",
            "sent1": "Scientists discovered that cyclosporin originated from a fungus found in soil.",
            "sent2": "The compound cyclosporin was isolated and studied for its unique properties.",
            "sent3": "The fungus-produced cyclosporin had unexpected medicinal benefits.",
            "sent4": "The fungus's gift, cyclosporin, revolutionized organ transplant treatments.",
            "sent5": "The fungus-derived cyclosporin proved to be a valuable resource in medicine."
        }
    ]
}