{
    "term": "cyclosporas",
    "meanings": [
        {
            "definition": "A genus of parasitic protozoans.",
            "pos": "noun",
            "sent1": "Scientists study cyclosporas to learn more about these tiny organisms.",
            "sent2": "The cyclosporas found in the pond are causing illness in the fish.",
            "sent3": "The cyclosporas threw a party inside the host's body, but forgot to invite the immune system.",
            "sent4": "The cyclosporas multiplied rapidly, spreading like wildfire through the population.",
            "sent5": "Under the microscope, the cyclosporas looked like little jellyfish swimming in a sea of cells."
        },
        {
            "definition": "Infection caused by cyclosporas.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with cyclosporas after examining the symptoms.",
            "sent2": "Avoiding contaminated water sources can help prevent cyclosporas infection.",
            "sent3": "The cyclosporas infection turned the stomach into a chaotic battleground.",
            "sent4": "Her fatigue felt like a heavy cloak, a result of the cyclosporas invading her system.",
            "sent5": "The cyclosporas infection spread through the community like wildfire, causing concern among residents."
        },
        {
            "definition": "The presence of cyclosporas in the body.",
            "pos": "noun",
            "sent1": "The doctor confirmed the cyclosporas in the patient's system through lab tests.",
            "sent2": "Symptoms of the presence of cyclosporas include stomach cramps and diarrhea.",
            "sent3": "The cyclosporas in the body seemed to be having a dance party, causing discomfort to the host.",
            "sent4": "The presence of cyclosporas felt like an unwelcome guest overstaying its welcome.",
            "sent5": "The body's defense mechanisms kicked into high gear upon detecting the presence of cyclosporas."
        }
    ]
}