{
    "term": "cystotomy",
    "meanings": [
        {
            "definition": "Surgical incision into the urinary bladder.",
            "pos": "noun",
            "sent1": "The cystotomy was performed to remove a stone from the bladder.",
            "sent2": "The doctor recommended a cystotomy to address the blockage in the bladder.",
            "sent3": "During the surgery, the cystotomy revealed unexpected findings in the bladder.",
            "sent4": "The precision of the cystotomy was compared to a skilled artist's brushstroke.",
            "sent5": "The sound of the cystotomy echoed through the operating room, marking the beginning of the procedure."
        },
        {
            "definition": "The act of making an incision into the bladder.",
            "pos": "noun",
            "sent1": "After careful consideration, the cystotomy was deemed necessary for the patient's health.",
            "sent2": "The surgeon's expertise was evident during the delicate cystotomy.",
            "sent3": "The nurse joked that the cystotomy was like opening a surprise package.",
            "sent4": "The cystotomy was a gateway to resolving the patient's bladder issue.",
            "sent5": "The bright lights above highlighted the moment of the cystotomy, capturing everyone's attention."
        },
        {
            "definition": "A procedure involving cutting into the bladder.",
            "pos": "noun",
            "sent1": "The cystotomy was scheduled for early next week to avoid complications.",
            "sent2": "Patients may experience relief after a successful cystotomy.",
            "sent3": "The team celebrated the completion of the cystotomy with a round of applause.",
            "sent4": "The cystotomy was the key step in the treatment plan for the bladder condition.",
            "sent5": "The precision required for the cystotomy was compared to a delicate dance, each move crucial for success."
        }
    ]
}