{
    "term": "cytotoxic",
    "meanings": [
        {
            "definition": "Toxic to cells.",
            "pos": "adjective",
            "sent1": "The cytotoxic chemicals harmed the cells in the experiment.",
            "sent2": "Doctors use cytotoxic drugs to treat cancer by targeting harmful cells.",
            "sent3": "The cytotoxic solution was so strong that even the cells seemed to run away from it.",
            "sent4": "Her words were like cytotoxic arrows, piercing through his emotional defenses.",
            "sent5": "The cytotoxic effect of the medication was evident as the cells began to deteriorate rapidly."
        },
        {
            "definition": "Capable of destroying cells.",
            "pos": "adjective",
            "sent1": "The cytotoxic substance had the power to eliminate all the cells in its path.",
            "sent2": "Researchers are studying new ways to develop cytotoxic agents for medical purposes.",
            "sent3": "The superhero's cytotoxic touch could obliterate any villain with a single handshake.",
            "sent4": "The cytotoxic nature of the chemical was like a silent assassin, wiping out cells without a trace.",
            "sent5": "The cytotoxic potential of the treatment was both impressive and concerning for the patient."
        },
        {
            "definition": "A substance that is harmful to cells.",
            "pos": "noun",
            "sent1": "Scientists are investigating the effects of the cytotoxic on cell growth.",
            "sent2": "The lab technician handled the cytotoxic with extreme caution to avoid any accidents.",
            "sent3": "The cytotoxic in the petri dish seemed to have a mind of its own, causing chaos among the cells.",
            "sent4": "The cytotoxic acted like a silent intruder, slowly damaging the cells from within.",
            "sent5": "The presence of cytotoxic in the environment posed a serious threat to the cell population."
        }
    ]
}