{
    "term": "dadaistic",
    "meanings": [
        {
            "definition": "Of or relating to Dadaism, an art movement of the European avant-garde in the early 20th century.",
            "pos": "adjective",
            "sent1": "The artist created a dadaistic painting that challenged traditional art norms.",
            "sent2": "Her dadaistic approach to sculpture was both unconventional and thought-provoking.",
            "sent3": "The dadaistic performance art piece left the audience puzzled but intrigued.",
            "sent4": "His dadaistic interpretation of reality was a bold statement against conformity.",
            "sent5": "The dadaistic exhibit at the museum was a chaotic blend of colors and shapes."
        },
        {
            "definition": "Characterized by absurdity, irrationality, and anti-establishment principles.",
            "pos": "adjective",
            "sent1": "The comedian's jokes had a dadaistic humor that made everyone laugh uncontrollably.",
            "sent2": "The movie's plot took a dadaistic turn, leaving the audience in disbelief.",
            "sent3": "The dadaistic behavior of the clown at the circus was both entertaining and unpredictable.",
            "sent4": "Her dadaistic fashion sense always turned heads wherever she went.",
            "sent5": "The dadaistic protest against the new law caught the attention of the entire city."
        },
        {
            "definition": "Resembling or inspired by the principles of Dadaism.",
            "pos": "adjective",
            "sent1": "The play had a dadaistic vibe that resonated with the audience.",
            "sent2": "His dadaistic writing style challenged traditional literary conventions.",
            "sent3": "The dadaistic music video was a creative blend of visuals and sounds.",
            "sent4": "The artist's dadaistic sculptures were a unique interpretation of modern art.",
            "sent5": "The fashion designer's collection had a dadaistic influence that set it apart from the rest."
        }
    ]
}