{
    "term": "daemonical",
    "meanings": [
        {
            "definition": "Of, relating to, or characteristic of a demon.",
            "pos": "adjective",
            "sent1": "The haunted house had a daemonical presence that sent shivers down my spine.",
            "sent2": "The eerie shadows cast by the flickering candlelight gave the room a daemonical atmosphere.",
            "sent3": "The cat's glowing eyes in the dark made it look daemonical, but it was just a trick of the light.",
            "sent4": "The storm clouds gathered in a daemonical formation, as if nature itself was angry.",
            "sent5": "The old, abandoned graveyard had a daemonical feel, as if spirits lingered among the tombstones."
        },
        {
            "definition": "Possessed or influenced by a demon.",
            "pos": "adjective",
            "sent1": "The possessed girl's daemonical behavior frightened the villagers.",
            "sent2": "The haunted doll seemed to move on its own, a daemonical presence in the room.",
            "sent3": "The mischievous child joked that his brother's messy room looked daemonical.",
            "sent4": "The dark thoughts in his mind felt like a daemonical force trying to take control.",
            "sent5": "The eerie whispers in the abandoned house sounded daemonical, as if spirits were speaking."
        },
        {
            "definition": "Resembling or suggestive of a demon.",
            "pos": "adjective",
            "sent1": "The twisted tree branches cast daemonical shadows on the ground.",
            "sent2": "The mask the actor wore had a daemonical design, striking fear into the audience.",
            "sent3": "The strange rock formation on the cliff looked daemonical in the moonlight.",
            "sent4": "The eerie painting depicted a daemonical figure lurking in the shadows.",
            "sent5": "The howling wind outside had a daemonical sound, like a chorus of lost souls."
        }
    ]
}