{
    "term": "dahabieh",
    "meanings": [
        {
            "definition": "A type of Nile River boat used for transportation and leisure.",
            "pos": "noun",
            "sent1": "The dahabieh slowly sailed down the river, carrying passengers and goods.",
            "sent2": "Tourists enjoyed a relaxing cruise on the dahabieh, taking in the scenic views.",
            "sent3": "The dahabieh decided to take a detour and explore a hidden cove along the river.",
            "sent4": "As majestic as a dahabieh gliding gracefully on the water, the swan moved across the lake.",
            "sent5": "The dahabieh's golden sails shimmered in the sunlight, creating a magical sight."
        },
        {
            "definition": "A traditional Egyptian sailing vessel with a shallow draft.",
            "pos": "noun",
            "sent1": "Fishing boats in Egypt are often similar in design to the dahabieh.",
            "sent2": "The dahabieh navigated the narrow channels of the river with ease due to its shallow draft.",
            "sent3": "The dahabieh challenged a speedboat to a race, much to everyone's amusement.",
            "sent4": "Her thoughts sailed on the dahabieh of memories, drifting back to simpler times.",
            "sent5": "The dahabieh gracefully skimmed the water like a bird gliding effortlessly through the sky."
        },
        {
            "definition": "A wooden boat with a large sail and ornate decorations.",
            "pos": "noun",
            "sent1": "The dahabieh's intricate carvings and colorful flags caught the eye of all who passed by.",
            "sent2": "Local craftsmen spent weeks handcrafting the beautiful dahabieh for the upcoming festival.",
            "sent3": "During the parade, the dahabieh stood out among the other boats with its vibrant decorations.",
            "sent4": "Her dreams set sail on a dahabieh adorned with memories of a distant land.",
            "sent5": "The dahabieh looked like a floating work of art, with every detail meticulously designed."
        }
    ]
}