{
    "term": "dak",
    "meanings": [
        {
            "definition": "A postal system in India.",
            "pos": "noun",
            "sent1": "The dak delivers letters and packages in India.",
            "sent2": "I sent a letter through the dak to my friend in Mumbai.",
            "sent3": "The dak must be very busy during the holiday season.",
            "sent4": "The dak is like a silent messenger connecting people across the country.",
            "sent5": "The colorful dak van always catches my eye as it drives through the village."
        },
        {
            "definition": "A type of drum used in South Asia.",
            "pos": "noun",
            "sent1": "The rhythmic beats of the dak filled the air during the festival.",
            "sent2": "The musician played the dak skillfully during the performance.",
            "sent3": "The dak drummers added an exciting energy to the celebration.",
            "sent4": "The sound of the dak echoed through the valley like a heartbeat.",
            "sent5": "The intricate designs on the dak drum were mesmerizing to watch as it was played."
        },
        {
            "definition": "A type of fabric made from jute or hemp.",
            "pos": "noun",
            "sent1": "The traditional clothing was woven from soft dak fabric.",
            "sent2": "She sewed a beautiful dress using dak material.",
            "sent3": "The dak fabric felt rough but durable to the touch.",
            "sent4": "Her bag made of dak resembled a piece of nature itself.",
            "sent5": "The dak cloth had a natural earthy smell that reminded me of the outdoors."
        },
        {
            "definition": "To run or move quickly.",
            "pos": "verb",
            "sent1": "I had to dak to catch the bus before it left.",
            "sent2": "The children love to dak around the playground during recess.",
            "sent3": "He tried to dak through the crowd to reach the front of the line.",
            "sent4": "The squirrel would dak up the tree trunk in a flash.",
            "sent5": "The athlete's feet seemed to dak effortlessly across the track during the race."
        }
    ]
}