{
    "term": "dame",
    "meanings": [
        {
            "definition": "A woman of rank, station, or authority",
            "pos": "noun",
            "sent1": "The dame led the meeting with grace and confidence.",
            "sent2": "The queen is a dame respected by all in the kingdom.",
            "sent3": "The dame in charge of the event made sure everything ran smoothly.",
            "sent4": "She was a dame of the court, commanding respect with every word.",
            "sent5": "The dame's presence exuded power and authority."
        },
        {
            "definition": "A title of respect for a woman",
            "pos": "noun",
            "sent1": "Everyone addressed her as Dame Sarah out of respect.",
            "sent2": "The title of dame is given to women of high esteem.",
            "sent3": "The young girl jokingly called her friend 'Dame of the Playground'.",
            "sent4": "She earned the title of dame through her noble actions.",
            "sent5": "Being called 'dame' made her feel honored and valued."
        },
        {
            "definition": "A matronly woman",
            "pos": "noun",
            "sent1": "The kind dame always had cookies for the neighborhood children.",
            "sent2": "The elderly dame was known for her wisdom and warmth.",
            "sent3": "The dame's knitting circle was the talk of the town.",
            "sent4": "She was like a fairy godmother, a gentle dame who cared for all.",
            "sent5": "The dame's embrace felt like a warm hug from home."
        },
        {
            "definition": "A female given name",
            "pos": "noun",
            "sent1": "Dame is a beautiful name that suits her perfectly.",
            "sent2": "Her grandmother's name was Dame, a tradition passed down.",
            "sent3": "Dame giggled as she introduced herself, loving her unique name.",
            "sent4": "In the story, Dame was the heroine who saved the day.",
            "sent5": "The name Dame carried a sense of elegance and strength."
        }
    ]
}