{
    "term": "damned",
    "meanings": [
        {
            "definition": "condemned to suffer eternal punishment in hell",
            "pos": "adjective",
            "sent1": "The poor man felt like a damned soul as he trudged through the scorching desert.",
            "sent2": "The criminal was sentenced to a damned existence in the fiery depths of hell.",
            "sent3": "The cat looked at the closed door with a damned expression, unable to reach its favorite toy.",
            "sent4": "The haunted house seemed to hold the spirits of the damned, whispering eerie secrets in the night.",
            "sent5": "The howling wind carried the cries of the damned, chilling the bones of all who heard."
        },
        {
            "definition": "expressing anger or annoyance",
            "pos": "adjective",
            "sent1": "She shot him a damned look when he interrupted her during the meeting.",
            "sent2": "The teacher's damned tone made the students realize they were in trouble.",
            "sent3": "The toddler's tantrum included a series of damned screams that echoed through the house.",
            "sent4": "His damned outburst startled everyone in the room, causing a tense silence to fall.",
            "sent5": "The referee's whistle blew, signaling the coach's damned frustration with the unfair call."
        },
        {
            "definition": "used for emphasis or to express strong feeling",
            "pos": "adjective, interjection",
            "sent1": "She was damned excited to finally meet her favorite singer in person.",
            "sent2": "The damned delicious cake disappeared within minutes at the party.",
            "sent3": "Well, damned, I never expected to see you here at this hour!",
            "sent4": "The view from the mountaintop was damned breathtaking, leaving them speechless.",
            "sent5": "He let out a damned sigh of relief when he found his lost wallet in the car."
        }
    ]
}