{
    "term": "dant",
    "meanings": [
        {
            "definition": "To give",
            "pos": "verb",
            "sent1": "She dants a gift to her friend.",
            "sent2": "He dants his time to help others.",
            "sent3": "The kind fairy dants wishes to those in need.",
            "sent4": "The sun dants warmth to the earth each day.",
            "sent5": "The teacher dants knowledge to her students eagerly."
        },
        {
            "definition": "To grant",
            "pos": "verb",
            "sent1": "The king dants permission for the celebration.",
            "sent2": "They dant access to the secret garden.",
            "sent3": "The genie dants three wishes to the lucky person.",
            "sent4": "The judge dants a fair trial to all accused.",
            "sent5": "The boss dants a day off to the hardworking employee."
        },
        {
            "definition": "To bestow",
            "pos": "verb",
            "sent1": "The queen dants a royal title upon the brave knight.",
            "sent2": "The scholarship dants financial aid to deserving students.",
            "sent3": "The magical ring dants powers to its wearer.",
            "sent4": "The wise elder dants blessings to the young couple.",
            "sent5": "The artist dants talent to create beautiful paintings."
        },
        {
            "definition": "To yield",
            "pos": "verb",
            "sent1": "The tree dants ripe fruits in the autumn.",
            "sent2": "The farm dants a bountiful harvest every year.",
            "sent3": "The land dants crops to the hardworking farmers.",
            "sent4": "The river dants fish to the patient angler.",
            "sent5": "The garden dants colorful flowers in the spring."
        },
        {
            "definition": "To allow",
            "pos": "verb",
            "sent1": "The rules dant students to ask questions.",
            "sent2": "The policy dants employees to work from home.",
            "sent3": "The law dants citizens to vote in elections.",
            "sent4": "The invitation dants guests to join the party.",
            "sent5": "The ticket dants entry to the concert venue."
        }
    ]
}