{
    "term": "darbars",
    "meanings": [
        {
            "definition": "A formal reception room in a palace or large house.",
            "pos": "noun",
            "sent1": "The king welcomed his guests in the grand darbars of the palace.",
            "sent2": "The darbars of the mansion were elegantly decorated for the special event.",
            "sent3": "The darbars looked so fancy that even the paintings on the walls seemed to admire them.",
            "sent4": "In the darbars, the chandeliers sparkled like a thousand stars in the night sky.",
            "sent5": "The darbars exuded an air of sophistication and grandeur that left everyone in awe."
        },
        {
            "definition": "A court or audience chamber in certain Asian countries.",
            "pos": "noun",
            "sent1": "The emperor held court in the magnificent darbars of the ancient palace.",
            "sent2": "The darbars were filled with nobles and officials awaiting the king's decree.",
            "sent3": "As the judge entered the darbars, everyone stood up in respect.",
            "sent4": "The darbars echoed with the sound of important discussions and decisions being made.",
            "sent5": "The darbars were like a stage where the drama of justice unfolded before the audience."
        },
        {
            "definition": "A formal gathering or assembly, especially in South Asia.",
            "pos": "noun",
            "sent1": "The community leaders convened in the local darbars to discuss important matters.",
            "sent2": "The darbars were filled with people from all walks of life, united in purpose.",
            "sent3": "The darbars buzzed with excitement as everyone shared their ideas and opinions.",
            "sent4": "In the darbars, unity and harmony prevailed among the diverse attendees.",
            "sent5": "The darbars became a melting pot of ideas and cultures, fostering understanding and cooperation."
        }
    ]
}