{
    "term": "darbs",
    "meanings": [
        {
            "definition": "Work or labor",
            "pos": "noun",
            "sent1": "After school, I have a darbs to do at the library.",
            "sent2": "The construction workers were busy with their darbs on the new building.",
            "sent3": "The ants were doing their darbs, carrying food to their nest.",
            "sent4": "She saw her darbs as a mountain to climb, but she was determined to reach the top.",
            "sent5": "The darbs of cleaning the entire house seemed never-ending."
        },
        {
            "definition": "A job or task",
            "pos": "noun",
            "sent1": "My darbs for today is to finish my homework before dinner.",
            "sent2": "The chef's darbs in the kitchen kept him busy all evening.",
            "sent3": "The cat's darbs seemed to be napping in the sun all day.",
            "sent4": "Her darbs of organizing the event was like putting together a puzzle.",
            "sent5": "The darbs of watering the plants was soothing and relaxing."
        },
        {
            "definition": "To work or labor",
            "pos": "verb",
            "sent1": "I darbs in the garden every weekend to keep it looking nice.",
            "sent2": "The team darbs hard to meet their project deadline.",
            "sent3": "The robot darbs tirelessly, never needing a break.",
            "sent4": "She darbs away at her novel, hoping to finish it soon.",
            "sent5": "The students darbs together to clean up the classroom after the party."
        },
        {
            "definition": "To engage in a job or task",
            "pos": "verb",
            "sent1": "I darbs on my art project every evening after dinner.",
            "sent2": "The volunteers darbs at the shelter to help those in need.",
            "sent3": "The birds darbs early in the morning to build their nests.",
            "sent4": "He darbs with enthusiasm, always giving his best effort.",
            "sent5": "She darbs with focus and determination to achieve her goals."
        }
    ]
}