{
    "term": "daredevilry",
    "meanings": [
        {
            "definition": "Reckless or bold behavior",
            "pos": "noun",
            "sent1": "His daredevilry in climbing the tall tree without any safety gear amazed everyone.",
            "sent2": "Her daredevilry in trying to jump over the large gap was dangerous.",
            "sent3": "The squirrel's daredevilry in stealing nuts from the bird feeder was quite entertaining.",
            "sent4": "The daredevilry of the acrobat on the high wire left the audience breathless.",
            "sent5": "The daredevilry of the skateboarder attempting the risky trick was unforgettable."
        },
        {
            "definition": "The act of performing dangerous stunts or feats",
            "pos": "noun",
            "sent1": "The circus performer's daredevilry included walking on a tightrope without a safety net.",
            "sent2": "Watching the daredevilry of the motorcyclist jumping through fire hoops was thrilling.",
            "sent3": "The cat's daredevilry in leaping from the roof to the tree branch was quite impressive.",
            "sent4": "The daredevilry of the magician escaping from the locked box was truly magical.",
            "sent5": "The daredevilry of the stunt double in the movie was incredibly realistic."
        },
        {
            "definition": "A person who engages in daring or risky activities",
            "pos": "noun",
            "sent1": "The famous daredevilry was known for his death-defying motorcycle jumps.",
            "sent2": "She admired the daredevilry of the skydiver who jumped from the plane without hesitation.",
            "sent3": "The penguin's daredevilry in diving into the icy water was quite amusing to watch.",
            "sent4": "The daredevilry of the explorer venturing into the unknown jungle was truly courageous.",
            "sent5": "The daredevilry of the firefighter rescuing people from the burning building was heroic."
        }
    ]
}