{
    "term": "dark",
    "meanings": [
        {
            "definition": "Lacking light",
            "pos": "adjective",
            "sent1": "The room was dark, making it hard to see.",
            "sent2": "The night sky was dark and filled with twinkling stars.",
            "sent3": "The dark room hid the surprise party decorations well.",
            "sent4": "Her mood was as dark as the storm clouds overhead.",
            "sent5": "The cave was so dark that even a flashlight couldn't penetrate the darkness."
        },
        {
            "definition": "Having a color closer to black than white",
            "pos": "adjective",
            "sent1": "She wore a dark dress to the formal event.",
            "sent2": "The cat's fur was a beautiful dark shade of brown.",
            "sent3": "The dark chocolate cake looked almost black in the dim light.",
            "sent4": "His dark hair contrasted with his bright blue eyes.",
            "sent5": "The forest was filled with dark green leaves that rustled in the wind."
        },
        {
            "definition": "Hidden or secret",
            "pos": "adjective",
            "sent1": "The dark alley was where they conducted their secret meetings.",
            "sent2": "She kept her dark past hidden from her friends.",
            "sent3": "The dark truth about the missing cookies was finally revealed.",
            "sent4": "The dark intentions of the villain were slowly uncovered.",
            "sent5": "The dark diary held all her deepest secrets locked away."
        },
        {
            "definition": "Gloomy or depressing",
            "pos": "adjective",
            "sent1": "The dark weather matched his somber mood.",
            "sent2": "The news of the accident cast a dark shadow over the day.",
            "sent3": "Despite the dark news, they found a reason to smile.",
            "sent4": "The dark clouds seemed to mirror her troubled thoughts.",
            "sent5": "The dark room echoed with the sound of her heavy sighs."
        }
    ]
}