{
    "term": "darshan",
    "meanings": [
        {
            "definition": "A Hindu term meaning \"sight\" or \"vision\" of a deity or holy person, often received as a blessing.",
            "pos": "noun",
            "sent1": "During the festival, devotees eagerly awaited the darshan of the deity.",
            "sent2": "The darshan of the holy person brought peace to the troubled soul.",
            "sent3": "The mischievous child tried to sneak a darshan of the deity without getting caught.",
            "sent4": "Her smile was like a darshan, filling the room with warmth and light.",
            "sent5": "The darshan of the deity left a lasting impression on the young boy."
        },
        {
            "definition": "The act of seeing or being seen by a deity or holy person, often in the form of a physical object or image.",
            "pos": "noun",
            "sent1": "The devotee felt blessed after receiving darshan from the deity.",
            "sent2": "The darshan of the holy person was a moment of spiritual connection.",
            "sent3": "The cat seemed to be seeking darshan from the statue in the garden.",
            "sent4": "The painting on the wall seemed to follow her, giving her a sense of darshan.",
            "sent5": "The darshan of the deity's statue was a source of comfort during difficult times."
        },
        {
            "definition": "The experience of receiving spiritual guidance or blessings through visual contact with a deity or holy person.",
            "pos": "noun",
            "sent1": "She felt a sense of peace after the darshan with the spiritual leader.",
            "sent2": "The darshan with the deity filled her heart with gratitude.",
            "sent3": "The mischievous squirrel seemed to be seeking darshan from the wise old owl.",
            "sent4": "The sunrise over the mountains was a darshan of nature's beauty.",
            "sent5": "The darshan with the guru left a profound impact on her spiritual journey."
        }
    ]
}