{
    "term": "dash",
    "meanings": [
        {
            "definition": "To run or travel quickly.",
            "pos": "verb",
            "sent1": "The rabbit will dash across the field.",
            "sent2": "I need to dash to catch the bus.",
            "sent3": "I dashed to the store before it closed.",
            "sent4": "She dashed through the finish line with a burst of speed.",
            "sent5": "The cheetah's dash was unmatched in the animal kingdom."
        },
        {
            "definition": "A punctuation mark used to separate parts of a sentence.",
            "pos": "noun",
            "sent1": "Please add a dash between the words.",
            "sent2": "The dash helps to separate ideas in writing.",
            "sent3": "The dash in the sentence made it easier to read.",
            "sent4": "The writer used a dash to create emphasis.",
            "sent5": "The dash is like a small pause in a sentence."
        },
        {
            "definition": "A small amount of a liquid ingredient added to a recipe.",
            "pos": "noun",
            "sent1": "Add a dash of salt to the soup.",
            "sent2": "The recipe calls for a dash of vinegar.",
            "sent3": "She accidentally poured a dash of sugar instead of salt.",
            "sent4": "The chef's secret was to always add a dash of lemon juice.",
            "sent5": "The soup needed a dash of pepper to enhance the flavor."
        },
        {
            "definition": "A sudden burst of energy or emotion.",
            "pos": "noun",
            "sent1": "He felt a dash of excitement when he won the game.",
            "sent2": "A dash of fear ran through her as she heard a noise.",
            "sent3": "The unexpected news brought a dash of surprise to the room.",
            "sent4": "Her speech was filled with a dash of passion.",
            "sent5": "The music brought a dash of nostalgia to the listeners."
        }
    ]
}