{
    "term": "dashers",
    "meanings": [
        {
            "definition": "A person or thing that dashes.",
            "pos": "noun",
            "sent1": "The little boy was one of the fastest \\",
            "sent2": "The dashers in the race sprinted towards the finish line.",
            "sent3": "The energetic puppy was a real dashers around the yard.",
            "sent4": "The wind was like a group of dashers, rushing through the trees.",
            "sent5": "The flash of lightning was as quick as a group of dashers."
        },
        {
            "definition": "A device in a churn for agitating the cream.",
            "pos": "noun",
            "sent1": "The churn had sturdy dashers inside to mix the cream.",
            "sent2": "The dairy farmer used the dashers to make butter.",
            "sent3": "The mischievous cat tried to play with the dashers in the churn.",
            "sent4": "The dashers spun the cream like a whirlwind.",
            "sent5": "The dashers hummed as they worked, blending the cream perfectly."
        },
        {
            "definition": "A dashboard.",
            "pos": "noun",
            "sent1": "The car's dashers displayed the speed and fuel level.",
            "sent2": "The dashboard lights illuminated the car's interior.",
            "sent3": "The squirrel mistook the car's dashers for a cozy nest.",
            "sent4": "The dashboard was a control center, guiding the driver.",
            "sent5": "The shiny dashers reflected the sunlight, dazzling the driver."
        },
        {
            "definition": "A person who makes a dash or dashes.",
            "pos": "noun",
            "sent1": "The sprinter was a talented dashers on the track.",
            "sent2": "The dashers crossed the finish line with a burst of speed.",
            "sent3": "The dashers at the party were always the first to dance.",
            "sent4": "The dashers moved through the crowd like a swift breeze.",
            "sent5": "The dashers' movements were as quick and precise as a dancer's."
        }
    ]
}