{
    "term": "daydream",
    "meanings": [
        {
            "definition": "A series of pleasant thoughts that distract one's attention from the present moment.",
            "pos": "noun",
            "sent1": "During class, Sarah's daydream about the beach made her miss the teacher's question.",
            "sent2": "Sometimes, a daydream can transport you to a world of endless possibilities.",
            "sent3": "While daydreaming about winning the lottery, Tom accidentally walked into a pole.",
            "sent4": "Her daydream was like a fluffy cloud floating through her mind, carrying her away.",
            "sent5": "The daydream of becoming a famous actor fueled his determination to pursue his passion."
        },
        {
            "definition": "To indulge in pleasant fantasies or wishful thinking.",
            "pos": "verb",
            "sent1": "After a long day at work, she would daydream about her upcoming vacation.",
            "sent2": "It's fun to daydream about what you would do if you suddenly became a millionaire.",
            "sent3": "He would often daydream about being a superhero, saving the world from villains.",
            "sent4": "Her mind would daydream about traveling to exotic lands, exploring new cultures.",
            "sent5": "As she lay on the grass, she would daydream about flying through the clouds like a bird."
        },
        {
            "definition": "A dreamlike musing or fantasy while awake.",
            "pos": "noun",
            "sent1": "His daydream of being a famous rock star was always in the back of his mind.",
            "sent2": "Sometimes, a daydream can feel more real than the world around you.",
            "sent3": "In her daydream, she was a fearless explorer discovering hidden treasures.",
            "sent4": "The daydream enveloped her in a warm embrace, shielding her from reality.",
            "sent5": "His daydream was a vivid tapestry of colors and sounds, painting a beautiful escape."
        }
    ]
}