{
    "term": "daylighting",
    "meanings": [
        {
            "definition": "The practice of using natural light to illuminate a building.",
            "pos": "noun",
            "sent1": "Daylighting is important for reducing energy costs in buildings.",
            "sent2": "Architects often consider daylighting when designing sustainable buildings.",
            "sent3": "The building was so dark that daylighting it felt like a magical transformation.",
            "sent4": "In a world of artificial lights, daylighting is a beacon of sustainability.",
            "sent5": "The beauty of daylighting can truly enhance the ambiance of any space."
        },
        {
            "definition": "The act of designing a building to maximize natural light.",
            "pos": "noun",
            "sent1": "Proper daylighting can make a building feel more open and inviting.",
            "sent2": "Daylighting is a key element in creating a pleasant indoor environment.",
            "sent3": "The architect's passion for daylighting was evident in every corner of the building.",
            "sent4": "Her design philosophy revolves around the concept of daylighting as a guiding principle.",
            "sent5": "The strategic placement of windows showcases the art of daylighting in architecture."
        },
        {
            "definition": "The process of installing windows or skylights to bring in sunlight.",
            "pos": "noun",
            "sent1": "Daylighting can significantly improve the mood inside a building.",
            "sent2": "The construction crew focused on daylighting to enhance the building's aesthetics.",
            "sent3": "The window installer joked that daylighting was like bringing sunshine indoors.",
            "sent4": "The skylights acted as portals, daylighting the room with a warm glow.",
            "sent5": "The choice of glass can greatly impact the effectiveness of daylighting in a space."
        }
    ]
}