{
    "term": "deadly",
    "meanings": [
        {
            "definition": "Causing or able to cause death",
            "pos": "adjective",
            "sent1": "The snake's bite was deadly, leading to the unfortunate demise of the small mouse.",
            "sent2": "The doctor warned that the patient's condition was deadly and required immediate attention.",
            "sent3": "The chef's deadly mistake of using expired ingredients resulted in a disastrous dinner service.",
            "sent4": "The storm's deadly winds tore through the town, leaving destruction in its wake.",
            "sent5": "The deadly silence in the haunted house sent shivers down the spine of the brave explorer."
        },
        {
            "definition": "Extremely dangerous or harmful",
            "pos": "adjective",
            "sent1": "The criminal was known for his deadly actions, striking fear into the hearts of the townspeople.",
            "sent2": "The chemicals in the lab were deadly if mishandled, posing a serious risk to the researchers.",
            "sent3": "The toddler's deadly curiosity often led to messy and chaotic situations around the house.",
            "sent4": "The deadly combination of fire and oil created a volatile situation in the kitchen.",
            "sent5": "The deadly predator stalked its prey silently through the dense jungle, waiting for the perfect moment to strike."
        },
        {
            "definition": "In a manner that is likely to cause death or serious harm",
            "pos": "adverb",
            "sent1": "The car raced down the road deadly, narrowly avoiding a collision with the oncoming truck.",
            "sent2": "The hiker navigated the treacherous terrain deadly, aware of the risks of a misstep.",
            "sent3": "The comedian's jokes landed deadly with the audience, eliciting uproarious laughter.",
            "sent4": "The detective pursued the suspect deadly through the crowded marketplace, determined to catch him.",
            "sent5": "The gymnast executed the complex routine deadly, impressing the judges with her precision and skill."
        }
    ]
}