{
    "term": "deal",
    "meanings": [
        {
            "definition": "An agreement or arrangement",
            "pos": "noun",
            "sent1": "The two friends made a deal to share their toys.",
            "sent2": "The real estate agent closed the deal on the house sale.",
            "sent3": "The deal between the siblings was that one would do the dishes and the other would walk the dog.",
            "sent4": "Their secret deal to meet at the park was finally revealed.",
            "sent5": "The deal to trade snacks at lunch was a hit with the kids."
        },
        {
            "definition": "A large amount or quantity",
            "pos": "noun",
            "sent1": "She bought a great deal of candy for the party.",
            "sent2": "There was a good deal of excitement at the concert.",
            "sent3": "The deal of presents under the tree made the room look festive.",
            "sent4": "A deal of laughter filled the air during the comedy show.",
            "sent5": "The deal of books on the shelf caught her eye."
        },
        {
            "definition": "To distribute or apportion",
            "pos": "verb",
            "sent1": "The teacher will deal the cards for the game.",
            "sent2": "He dealt the cookies evenly among his friends.",
            "sent3": "She decided to deal the chores fairly among the family members.",
            "sent4": "The judge will deal the punishment according to the law.",
            "sent5": "The chef will deal the portions onto the plates."
        },
        {
            "definition": "To handle or manage",
            "pos": "verb",
            "sent1": "She knows how to deal with difficult customers at work.",
            "sent2": "He can deal with any problem that comes his way.",
            "sent3": "The robot was programmed to deal with any obstacles in its path.",
            "sent4": "She learned to deal with her fear of heights by facing it head-on.",
            "sent5": "He can deal with stress by taking deep breaths and relaxing."
        },
        {
            "definition": "To engage in commercial transactions",
            "pos": "verb",
            "sent1": "The company will deal with suppliers to get the best prices.",
            "sent2": "He likes to deal with customers directly in his shop.",
            "sent3": "The children pretended to deal with play money in their game.",
            "sent4": "She will deal with negotiations for the new contract.",
            "sent5": "The team will deal with sponsors for the upcoming event."
        }
    ]
}