{
    "term": "dean",
    "meanings": [
        {
            "definition": "The head of a college or university faculty.",
            "pos": "noun",
            "sent1": "The dean welcomed new professors to the university.",
            "sent2": "The dean announced the upcoming faculty meeting.",
            "sent3": "The dean's cat often wandered into faculty meetings, causing laughter.",
            "sent4": "The dean's presence in the faculty was like a guiding light.",
            "sent5": "The dean's office was always bustling with activity."
        },
        {
            "definition": "A person in charge of a division of a university or college.",
            "pos": "noun",
            "sent1": "The dean of students helped organize campus events.",
            "sent2": "The dean of the science department was known for their research.",
            "sent3": "The dean's love for coffee was well-known among students.",
            "sent4": "The dean's leadership was as solid as a rock.",
            "sent5": "The dean's office was a hub of student support."
        },
        {
            "definition": "A person who is in charge of a cathedral or collegiate church.",
            "pos": "noun",
            "sent1": "The cathedral dean oversaw the church's renovations.",
            "sent2": "The dean of the collegiate church led the choir rehearsals.",
            "sent3": "The dean's sense of humor brought joy to the church community.",
            "sent4": "The dean's voice echoed through the cathedral like a melody.",
            "sent5": "The dean's presence in the church was calming and reassuring."
        },
        {
            "definition": "A person who is in charge of a group of students in a school.",
            "pos": "noun",
            "sent1": "The school dean addressed student concerns with care.",
            "sent2": "The dean of discipline ensured a safe learning environment.",
            "sent3": "The dean's dance moves at the school assembly surprised everyone.",
            "sent4": "The dean's words to students were like seeds of wisdom.",
            "sent5": "The dean's smile brightened the school corridors."
        }
    ]
}