{
    "term": "deare",
    "meanings": [
        {
            "definition": "Loved or cherished",
            "pos": "adjective",
            "sent1": "The teddy bear was a deare gift from her grandmother.",
            "sent2": "She held onto the deare locket with tears in her eyes.",
            "sent3": "The deare puppy followed her everywhere, wagging its tail.",
            "sent4": "The deare memories of childhood lingered in her heart like a warm embrace.",
            "sent5": "The deare friendship they shared was unbreakable, like a bond forged in steel."
        },
        {
            "definition": "Expensive or costly",
            "pos": "adjective",
            "sent1": "The deare necklace sparkled under the lights of the store.",
            "sent2": "He hesitated to buy the deare watch, unsure if it was worth the price.",
            "sent3": "The deare painting caught her eye, but she couldn't afford it.",
            "sent4": "Her deare taste in jewelry always left her bank account empty.",
            "sent5": "The deare car gleamed in the showroom, tempting buyers with its luxury."
        },
        {
            "definition": "With affection or fondness",
            "pos": "adverb",
            "sent1": "She smiled dearely at the old photographs in the album.",
            "sent2": "He spoke dearely of his childhood memories with a twinkle in his eye.",
            "sent3": "The grandmother hugged her grandchildren dearely before they left.",
            "sent4": "They waved dearely to their friends as the train pulled away from the station.",
            "sent5": "The couple held hands dearely as they walked along the beach at sunset."
        },
        {
            "definition": "A loved one or sweetheart",
            "pos": "noun",
            "sent1": "She missed her deare while he was away on a business trip.",
            "sent2": "He surprised his deare with a bouquet of flowers on her birthday.",
            "sent3": "The park bench was a favorite spot for young deares to sit and talk.",
            "sent4": "The old love letters revealed the romance between the two deares.",
            "sent5": "The photo album was filled with snapshots of the happy deares over the years."
        }
    ]
}