{
    "term": "deathwatch",
    "meanings": [
        {
            "definition": "A vigil kept beside a dying person.",
            "pos": "noun",
            "sent1": "During the night, the family took turns keeping a deathwatch by their loved one's bedside.",
            "sent2": "The nurse sat quietly in the room, maintaining a deathwatch over the patient.",
            "sent3": "The cat decided to join the deathwatch, curling up next to the sick person.",
            "sent4": "As the hours passed, the deathwatch felt like a heavy burden on the family.",
            "sent5": "The flickering candlelight cast eerie shadows during the deathwatch."
        },
        {
            "definition": "A small beetle that makes a ticking sound, believed in folklore to portend death.",
            "pos": "noun",
            "sent1": "The children were fascinated by the deathwatch beetle they found in the garden.",
            "sent2": "According to superstition, hearing a deathwatch beetle meant someone in the house would soon pass away.",
            "sent3": "The deathwatch beetle's ticking was mistaken for a broken clock by the old man.",
            "sent4": "The eerie silence was broken only by the ominous ticking of the deathwatch beetle.",
            "sent5": "The deathwatch beetle's presence seemed to hang in the air like a dark omen."
        },
        {
            "definition": "A period of time during the night when a person is awake and alert, often spent watching for signs of death.",
            "pos": "noun",
            "sent1": "The soldier stood guard during the deathwatch, scanning the surroundings for any movement.",
            "sent2": "She felt a sense of dread during the deathwatch, anticipating any sudden changes.",
            "sent3": "The deathwatch turned into a game of spotting constellations in the night sky.",
            "sent4": "The quiet of the deathwatch was broken by the distant howl of a lone wolf.",
            "sent5": "Every rustle of leaves outside made the deathwatch feel more tense and eerie."
        }
    ]
}