{
    "term": "decadents",
    "meanings": [
        {
            "definition": "Characterized by or reflecting a state of moral or cultural decline",
            "pos": "adjective",
            "sent1": "The old, crumbling house had a decadents look about it, with peeling paint and overgrown weeds.",
            "sent2": "The once vibrant city now had a decadents atmosphere, with crime rates rising and public spaces neglected.",
            "sent3": "The decadents behavior of the naughty puppy, who kept digging up the garden, amused the children.",
            "sent4": "Her decadents lifestyle was like a sinking ship, slowly deteriorating despite her wealth.",
            "sent5": "The decadents state of the school's library made it a sad reflection of neglect and decline."
        },
        {
            "definition": "A person who is luxuriously self-indulgent",
            "pos": "noun",
            "sent1": "The wealthy businessman was known in town as a decadents, always seen driving luxury cars and wearing designer suits.",
            "sent2": "She lived like a true decadents, spending her days lounging by the pool and shopping at high-end boutiques.",
            "sent3": "The decadents was spotted at the fancy restaurant, ordering the most expensive dishes on the menu.",
            "sent4": "In the world of fashion, she was considered a decadents, always draped in the finest fabrics and jewels.",
            "sent5": "The decadents was the talk of the town, with his extravagant parties and lavish lifestyle."
        },
        {
            "definition": "A group of artists or writers who reject traditional values and seek pleasure in self-expression",
            "pos": "noun",
            "sent1": "The decadents gathered at the cafe, discussing their latest avant-garde projects and challenging societal norms.",
            "sent2": "She joined the group of decadents, eager to explore new forms of art and push boundaries.",
            "sent3": "The decadents' unconventional art exhibition drew a curious crowd, intrigued by their bold statements.",
            "sent4": "In the world of literature, the decadents were known for their provocative writings and rebellious spirit.",
            "sent5": "The decadents' rebellious nature and creative energy sparked a revolution in the art world."
        }
    ]
}