{
    "term": "decamped",
    "meanings": [
        {
            "definition": "To depart suddenly or secretly",
            "pos": "verb",
            "sent1": "The thief decamped with the stolen jewels before anyone noticed.",
            "sent2": "The spy decamped from the enemy's headquarters under the cover of darkness.",
            "sent3": "The mischievous cat decamped from the room after knocking over a vase.",
            "sent4": "After the surprise party, the guests decamped like a flock of startled birds.",
            "sent5": "The students decamped from the classroom as soon as the bell rang, eager to start their weekend."
        },
        {
            "definition": "To leave a place quickly and secretly",
            "pos": "verb",
            "sent1": "The suspect decamped from the crime scene before the police arrived.",
            "sent2": "The adventurers decamped from the haunted house in a hurry, fearing ghosts.",
            "sent3": "The magician decamped from the stage, leaving the audience in awe of his disappearing act.",
            "sent4": "As the storm approached, the campers decamped from the forest to seek shelter.",
            "sent5": "The cat burglar decamped from the mansion with a bag full of valuables, unseen by the security guards."
        },
        {
            "definition": "To pack up and leave a place, especially a camp",
            "pos": "verb",
            "sent1": "After a fun weekend of camping, it was time to decamp and head back home.",
            "sent2": "The hikers decamped from the mountain site, taking only memories and leaving no trace.",
            "sent3": "The circus performers decamped from the field, leaving behind a trail of colorful tents.",
            "sent4": "The nomadic tribe would decamp every few months to find new grazing grounds for their animals.",
            "sent5": "As the sun set, the beachgoers began to decamp, folding their chairs and umbrellas."
        }
    ]
}