{
    "term": "decanting",
    "meanings": [
        {
            "definition": "Pouring liquid from one container to another, typically to separate sediment or to aerate the liquid.",
            "pos": "verb",
            "sent1": "She was decanting the juice into a pitcher.",
            "sent2": "The waiter was decanting the wine into a glass.",
            "sent3": "The chef joked about decanting the soup into a teapot for fun.",
            "sent4": "The waterfall seemed like nature's way of decanting water from the sky.",
            "sent5": "The sound of decanting the oil made a soothing rhythm in the kitchen."
        },
        {
            "definition": "Transferring wine or other liquid from a bottle to a decanter for serving.",
            "pos": "verb",
            "sent1": "He carefully decanted the wine into the crystal decanter.",
            "sent2": "During the dinner party, she was decanting the champagne for the guests.",
            "sent3": "The magician surprised everyone by decanting the liquid into a flower vase.",
            "sent4": "Her words seemed to flow smoothly, like decanting thoughts from her mind.",
            "sent5": "The act of decanting the tea was a graceful ritual in the traditional ceremony."
        },
        {
            "definition": "The act of slowly pouring a liquid, such as wine, from its original container to another to separate it from sediment.",
            "pos": "noun",
            "sent1": "The decanting of the wine was done with precision and care.",
            "sent2": "At the winery, they showcased the art of decanting to the visitors.",
            "sent3": "The cat knocked over the decanter, causing a messy decanting of the red wine.",
            "sent4": "The decanting of memories from the past brought a sense of nostalgia.",
            "sent5": "The gentle decanting of the river water into the pond created a calming effect on the surroundings."
        }
    ]
}