{
    "term": "decentre",
    "meanings": [
        {
            "definition": "To remove the center or focus from something.",
            "pos": "verb",
            "sent1": "She decided to decentre the discussion from herself and focus on the team instead.",
            "sent2": "The artist chose to decentre the main character in the painting to highlight the background.",
            "sent3": "During the magic show, the magician tried to decentre the audience's attention to surprise them.",
            "sent4": "In the play, the spotlight suddenly decentred, leaving the actors in darkness.",
            "sent5": "The teacher used a bright visual aid to decentre the students' attention from distractions."
        },
        {
            "definition": "To cause someone or something to lose their confidence or composure.",
            "pos": "verb",
            "sent1": "The unexpected question seemed to decentre him, making him stumble over his words.",
            "sent2": "The loud noise outside the exam room decentred the students, affecting their concentration.",
            "sent3": "The mischievous puppy's antics never failed to decentre the calm atmosphere at home.",
            "sent4": "The sudden change in weather can decentre even the most experienced hiker on the trail.",
            "sent5": "The comedian's unexpected joke managed to decentre the usually composed news anchor."
        },
        {
            "definition": "To move away from a central location or position.",
            "pos": "verb",
            "sent1": "The birds started to decentre from the tree as the storm approached.",
            "sent2": "The dancers began to decentre from the stage, spreading out to perform their routine.",
            "sent3": "The students were asked to decentre from the middle of the room to create more space.",
            "sent4": "As the meeting progressed, the focus started to decentre from the main agenda.",
            "sent5": "The cars in the parking lot slowly decentred as more spaces became available."
        }
    ]
}