{
    "term": "decentering",
    "meanings": [
        {
            "definition": "To move away from a central position or focus.",
            "pos": "verb",
            "sent1": "She decided to decentering herself from the spotlight and let others shine.",
            "sent2": "The artist decentering the main character to highlight the background scenery.",
            "sent3": "The cat decentering itself from the warm sunbeam to chase a butterfly.",
            "sent4": "The teacher's decentering of the traditional teaching methods sparked creativity in the students.",
            "sent5": "The wind decentering the fallen leaves in all directions."
        },
        {
            "definition": "To shift attention or perspective away from oneself.",
            "pos": "verb",
            "sent1": "He practiced decentering his thoughts from worries and focusing on the present moment.",
            "sent2": "The therapist encouraged decentering from self-criticism and embracing self-compassion.",
            "sent3": "The child decentering from his toy to explore the new toy his friend brought.",
            "sent4": "Her decentering from personal opinions allowed her to see the situation from a different angle.",
            "sent5": "The meditation session guided participants in decentering their minds from distractions."
        },
        {
            "definition": "To disrupt or challenge established norms or beliefs.",
            "pos": "verb",
            "sent1": "The activist group aims to decentering the prevailing stereotypes in society.",
            "sent2": "By decentering the traditional narrative, the author introduced a fresh perspective.",
            "sent3": "The comedian's jokes decentering common assumptions left the audience in stitches.",
            "sent4": "The new scientific discovery is decentering the long-held beliefs in the field.",
            "sent5": "The artist's controversial painting is decentering the art world's conventions."
        }
    ]
}