{
    "term": "decolletages",
    "meanings": [
        {
            "definition": "The neckline of a dress or top that is cut low and reveals the upper part of a woman's chest.",
            "pos": "noun",
            "sent1": "She wore a dress with a beautiful decolletage that showed her collarbones.",
            "sent2": "The elegant gown had intricate lace detailing on the decolletage.",
            "sent3": "At the party, her decolletage stole the spotlight, making heads turn.",
            "sent4": "Her decolletage was like a delicate frame highlighting her radiant smile.",
            "sent5": "The necklace rested gracefully on her decolletage, adding a touch of glamour."
        },
        {
            "definition": "The exposed area of a woman's chest created by a low-cut neckline.",
            "pos": "noun",
            "sent1": "The actress flaunted her decolletage in the plunging neckline of her gown.",
            "sent2": "A hint of perfume lingered on her decolletage, leaving a subtle trail.",
            "sent3": "She jokingly referred to her decolletage as her 'secret weapon' for attention.",
            "sent4": "The moonlight cast a soft glow on her decolletage, creating a mesmerizing effect.",
            "sent5": "The sun kissed her decolletage, giving it a warm, golden hue."
        },
        {
            "definition": "The style of clothing that reveals the upper part of a woman's chest.",
            "pos": "noun",
            "sent1": "In the summer heat, she opted for decolletage-baring tops to stay cool.",
            "sent2": "Fashion designers showcased their latest decolletage designs on the runway.",
            "sent3": "Her collection of decolletage outfits was the envy of her friends.",
            "sent4": "The trend of bold decolletage styles swept through the fashion industry.",
            "sent5": "She felt empowered in her decolletage-revealing attire, embracing her confidence."
        }
    ]
}