{
    "term": "deconditioning",
    "meanings": [
        {
            "definition": "The process of losing physical fitness or conditioning.",
            "pos": "noun",
            "sent1": "After a long period of inactivity, his deconditioning was evident in his reduced stamina.",
            "sent2": "Regular exercise helps prevent deconditioning and maintains overall health.",
            "sent3": "The deconditioning of the athlete's muscles made them feel like jelly during the race.",
            "sent4": "Her deconditioning was like watching a once vibrant flower wilt from lack of sunlight.",
            "sent5": "The deconditioning of the team was a stark reminder of the importance of consistent training."
        },
        {
            "definition": "The act of reversing the effects of conditioning or training.",
            "pos": "noun",
            "sent1": "Physical therapy focused on deconditioning to help the patient regain strength after surgery.",
            "sent2": "The deconditioning program aimed to undo the muscle memory from improper training techniques.",
            "sent3": "The comedian joked about deconditioning his dog to stop it from begging for treats.",
            "sent4": "In the movie, the protagonist undergoes emotional deconditioning to break free from societal norms.",
            "sent5": "The deconditioning process required discipline and dedication to see positive results."
        },
        {
            "definition": "The state of being less physically fit due to lack of exercise.",
            "pos": "noun",
            "sent1": "Her deconditioning was a wake-up call to prioritize regular workouts for better health.",
            "sent2": "The deconditioning of the elderly residents was concerning, prompting the introduction of fitness classes.",
            "sent3": "The deconditioning of the office workers was evident in their struggle to climb a flight of stairs.",
            "sent4": "The deconditioning of the team led to poor performance in the match, highlighting the importance of training.",
            "sent5": "The gradual deconditioning of his body made him realize the impact of a sedentary lifestyle."
        }
    ]
}