{
    "term": "decompensated",
    "meanings": [
        {
            "definition": "To fail to maintain normal physiological balance",
            "pos": "verb",
            "sent1": "After the accident, his body decompensated and struggled to stay balanced.",
            "sent2": "The patient's condition decompensated rapidly, causing concern among the medical staff.",
            "sent3": "The clumsy robot decompensated and kept falling over, much to the amusement of the onlookers.",
            "sent4": "As the storm raged on, the ship decompensated, unable to withstand the powerful waves.",
            "sent5": "The delicate ecosystem decompensated when the invasive species disrupted its balance."
        },
        {
            "definition": "To lose the ability to function effectively",
            "pos": "verb",
            "sent1": "Without proper maintenance, the old car decompensated and could no longer drive smoothly.",
            "sent2": "The team's performance decompensated after their star player got injured.",
            "sent3": "The tired puppy decompensated and couldn't fetch the ball properly, much to the children's amusement.",
            "sent4": "Under extreme pressure, the machine decompensated, unable to complete its task.",
            "sent5": "The aging computer decompensated, struggling to run the latest software efficiently."
        },
        {
            "definition": "To deteriorate or worsen, especially in health or mental state",
            "pos": "verb",
            "sent1": "As the illness progressed, the patient's condition decompensated, requiring immediate intervention.",
            "sent2": "The company's financial situation decompensated due to poor management decisions.",
            "sent3": "The magician's trick decompensated, leaving the audience puzzled and amused.",
            "sent4": "In the face of adversity, his mental health decompensated, affecting his daily life.",
            "sent5": "The situation decompensated quickly, catching everyone off guard."
        }
    ]
}