{
    "term": "decorative",
    "meanings": [
        {
            "definition": "Serving to make something look more attractive or festive.",
            "pos": "adjective",
            "sent1": "The decorative flowers on the table added a festive touch to the room.",
            "sent2": "She bought decorative lights to make her house look more attractive during the holidays.",
            "sent3": "The decorative cupcakes were so pretty that they almost looked too good to eat.",
            "sent4": "Her smile was as decorative as a bouquet of flowers, brightening up the entire room.",
            "sent5": "The decorative curtains fluttered in the breeze, creating a charming atmosphere."
        },
        {
            "definition": "Used to make something look more attractive or festive.",
            "pos": "adjective",
            "sent1": "The decorative ribbons on the gift made it stand out among the others.",
            "sent2": "The decorative candles illuminated the room with a warm and inviting glow.",
            "sent3": "The decorative balloons added a fun and colorful touch to the party.",
            "sent4": "Her laughter was as decorative as a string of twinkling lights, spreading joy to everyone around.",
            "sent5": "The decorative wreath on the door welcomed guests with a festive spirit."
        },
        {
            "definition": "Intended to make something look more attractive or festive.",
            "pos": "adjective",
            "sent1": "The decorative ornaments on the tree sparkled in the soft light of the room.",
            "sent2": "She wore a decorative necklace that shimmered under the evening lights.",
            "sent3": "The decorative banners fluttered in the wind, creating a playful scene.",
            "sent4": "His words were as decorative as a beautifully wrapped gift, making her smile.",
            "sent5": "The decorative tablecloth transformed the plain table into a festive dining area."
        }
    ]
}