{
    "term": "def",
    "meanings": [
        {
            "definition": "To state or set forth the meaning of (a word, phrase, etc.).",
            "pos": "verb",
            "sent1": "She will def the new vocabulary words for the class.",
            "sent2": "Can you def the instructions for me, please?",
            "sent3": "The teacher had to def the concept of gravity using only hand gestures.",
            "sent4": "Her smile defed her happiness better than any words could.",
            "sent5": "He defed the rules of the game with such clarity that no one had any doubts."
        },
        {
            "definition": "To explain the meaning of (a word, phrase, etc.).",
            "pos": "verb",
            "sent1": "He loves to def complex terms in a simple way.",
            "sent2": "Can you def the word 'metaphor' for me?",
            "sent3": "The comedian tried to def the word 'serious' in a funny way.",
            "sent4": "Her eyes defed her emotions more than her words ever could.",
            "sent5": "The teacher defed the scientific theory with a fun experiment."
        },
        {
            "definition": "To describe or identify the nature or essential qualities of.",
            "pos": "verb",
            "sent1": "She will def the main characters in the story for you.",
            "sent2": "Can you def the taste of the cake you baked?",
            "sent3": "The artist tried to def the color blue to a blindfolded audience.",
            "sent4": "His actions defed his character more than his words did.",
            "sent5": "The chef defed the dish with such detail that it made everyone's mouth water."
        },
        {
            "definition": "To determine or fix the boundaries or extent of.",
            "pos": "verb",
            "sent1": "The surveyor will def the property lines for the new construction.",
            "sent2": "Can you def the limits of your responsibilities in this project?",
            "sent3": "The kids tried to def the boundaries of their imaginary kingdom.",
            "sent4": "Her laughter defed the joy in the room.",
            "sent5": "The ruler defed the length of the table with precision."
        }
    ]
}