{
    "term": "defaulting",
    "meanings": [
        {
            "definition": "Fail to fulfill an obligation, especially a financial one.",
            "pos": "verb",
            "sent1": "She kept defaulting on her loan payments, causing her financial troubles.",
            "sent2": "He is defaulting on his promise to pay back the money he borrowed.",
            "sent3": "The character in the story was always defaulting on his debts, leading to comical situations.",
            "sent4": "The old car's brakes were defaulting, making it risky to drive downhill.",
            "sent5": "The student's habit of defaulting on homework assignments finally caught up with him."
        },
        {
            "definition": "To fail to appear in court or respond to a legal summons.",
            "pos": "verb",
            "sent1": "The suspect kept defaulting on his court dates, prolonging the legal process.",
            "sent2": "She was arrested for defaulting on her court appearance after multiple warnings.",
            "sent3": "The movie character comically kept defaulting on his court summons, leading to hilarious misunderstandings.",
            "sent4": "The defendant's excuses for defaulting on the court hearing were as thin as a sheet of paper.",
            "sent5": "The witness was defaulting on showing up in court, causing delays in the trial."
        },
        {
            "definition": "To revert to a standard setting or value.",
            "pos": "verb",
            "sent1": "The thermostat kept defaulting to a high temperature, making the room uncomfortably warm.",
            "sent2": "The computer program kept defaulting to its original settings every time it was restarted.",
            "sent3": "The robot kept defaulting to its factory settings, causing it to act strangely in the house.",
            "sent4": "The clock was defaulting to the wrong time, confusing everyone in the office.",
            "sent5": "The phone's screen kept defaulting to the brightness setting, draining the battery quickly."
        }
    ]
}