{
    "term": "defeminizations",
    "meanings": [
        {
            "definition": "The act of removing feminine qualities or characteristics.",
            "pos": "noun",
            "sent1": "Her defeminizations were evident in her choice of clothing and behavior.",
            "sent2": "The defeminizations in the movie industry have sparked debates about gender representation.",
            "sent3": "The defeminizations in the play added a unique twist to the traditional storyline.",
            "sent4": "Her defeminizations were like peeling layers of an onion, revealing a different side of her.",
            "sent5": "The defeminizations in the painting were so striking that they challenged societal norms."
        },
        {
            "definition": "The process of making something less feminine.",
            "pos": "noun",
            "sent1": "The defeminizations of the room involved removing all floral decorations.",
            "sent2": "She observed the defeminizations of the language used in the advertisement.",
            "sent3": "The defeminizations of the cake design made it look more modern and sleek.",
            "sent4": "The defeminizations of the music transformed it into a more neutral sound.",
            "sent5": "His defeminizations of the outfit gave it a more androgynous appeal."
        },
        {
            "definition": "The state of being stripped of feminine attributes.",
            "pos": "noun",
            "sent1": "After the defeminizations, she felt liberated from societal expectations.",
            "sent2": "The defeminizations of the character made her more relatable to a wider audience.",
            "sent3": "The defeminizations of the room decor created a minimalist and clean aesthetic.",
            "sent4": "His defeminizations of the script brought a fresh perspective to the story.",
            "sent5": "The defeminizations of the garden revealed its true beauty in a new light."
        }
    ]
}