{
    "term": "defeminization",
    "meanings": [
        {
            "definition": "The act of removing or reducing feminine qualities or characteristics.",
            "pos": "noun",
            "sent1": "The defeminization of the room involved removing all the pink decorations.",
            "sent2": "The defeminization of the dress involved removing the frills and lace.",
            "sent3": "The defeminization of the party theme made it more suitable for everyone to enjoy.",
            "sent4": "Her defeminization of her appearance was like shedding a layer of expectations.",
            "sent5": "The defeminization of the advertisement aimed to appeal to a broader audience."
        },
        {
            "definition": "The process of making something less feminine.",
            "pos": "noun",
            "sent1": "The defeminization of the brand aimed to attract a more gender-neutral audience.",
            "sent2": "The defeminization of the logo involved using more neutral colors.",
            "sent3": "The defeminization of the room decor was a challenge but resulted in a modern look.",
            "sent4": "The defeminization of the character's wardrobe symbolized her growth and independence.",
            "sent5": "The defeminization of the product packaging was a strategic move to reach a wider market."
        },
        {
            "definition": "The state of being made less feminine.",
            "pos": "noun",
            "sent1": "The defeminization of the workplace dress code promoted equality among employees.",
            "sent2": "The defeminization of the language used in the advertisement was intentional.",
            "sent3": "The defeminization of the garden design created a more inclusive space for all.",
            "sent4": "Her defeminization after the breakup was a reflection of her newfound strength.",
            "sent5": "The defeminization of the character's behavior challenged traditional gender norms."
        }
    ]
}