{
    "term": "defibrillated",
    "meanings": [
        {
            "definition": "To restore normal heart rhythm by applying an electric shock.",
            "pos": "verb",
            "sent1": "The doctor defibrillated the patient to help their heart beat properly again.",
            "sent2": "In an emergency, medical professionals defibrillate individuals to save lives.",
            "sent3": "The defibrillated person jumped as if they were startled by a sudden noise.",
            "sent4": "The electric shock defibrillated the heart, bringing it back to life like a jolt of energy.",
            "sent5": "The defibrillated heart began to beat steadily, like a drum keeping time."
        },
        {
            "definition": "To treat cardiac arrest by administering a controlled electric shock.",
            "pos": "verb",
            "sent1": "When someone collapses, it is crucial to defibrillate them quickly to try to revive them.",
            "sent2": "Paramedics defibrillate patients to try to restart their heart during a cardiac emergency.",
            "sent3": "The defibrillated individual woke up feeling like they had just been in a strange dream.",
            "sent4": "The shock defibrillated the heart, bringing it back from the brink of stopping completely.",
            "sent5": "The defibrillated person gasped for air, their chest rising and falling with each breath."
        },
        {
            "definition": "The act of using a defibrillator to restore normal heart rhythm.",
            "pos": "noun",
            "sent1": "The defibrillated saved the person's life by quickly delivering the necessary shock.",
            "sent2": "During a medical emergency, the defibrillated is a crucial tool for first responders.",
            "sent3": "The defibrillated beeped loudly, signaling that it was ready to be used.",
            "sent4": "The defibrillated hummed with energy as it prepared to deliver a life-saving shock.",
            "sent5": "The defibrillated was a beacon of hope in the race to save the patient's life."
        }
    ]
}