{
    "term": "deflecting",
    "meanings": [
        {
            "definition": "Cause (something) to change direction by interposing something; turn aside from a straight course.",
            "pos": "verb",
            "sent1": "She quickly moved her hand, deflecting the ball away from hitting her face.",
            "sent2": "The mirror was deflecting the sunlight into the room, brightening it up.",
            "sent3": "The mischievous cat enjoyed deflecting the laser pointer beam all around the room.",
            "sent4": "His calm demeanor acted as a shield, deflecting any negative comments that came his way.",
            "sent5": "The superhero's shield was so powerful that it was capable of deflecting even the strongest attacks."
        },
        {
            "definition": "Turn aside from a straight course or intended purpose.",
            "pos": "verb",
            "sent1": "The student tried to deflect the teacher's attention away from the unfinished homework.",
            "sent2": "The river's strong current was deflecting the boat off its intended path.",
            "sent3": "The comedian's jokes were so funny that they kept deflecting the audience's focus from the main topic.",
            "sent4": "Her determination was like a magnet, deflecting her from any distractions that came her way.",
            "sent5": "The unexpected turn of events deflected their plans, forcing them to come up with a new strategy."
        },
        {
            "definition": "To cause (something that is moving) to change direction.",
            "pos": "verb",
            "sent1": "The goalie's quick reflexes deflected the soccer ball away from the goal.",
            "sent2": "The wind was deflecting the leaves in all directions, creating a beautiful dance in the air.",
            "sent3": "The mischievous squirrel enjoyed deflecting the acorns towards unsuspecting passersby.",
            "sent4": "Her positive attitude acted as a shield, deflecting any negativity that came her way.",
            "sent5": "The lighthouse's beam was so strong that it could deflect ships away from the dangerous rocks."
        }
    ]
}