{
    "term": "defo",
    "meanings": [
        {
            "definition": "Definitely",
            "pos": "adverb",
            "sent1": "She will defo come to the party.",
            "sent2": "I will defo finish my homework on time.",
            "sent3": "He defo knows how to make everyone laugh.",
            "sent4": "The sun defo rises every morning without fail.",
            "sent5": "The teacher defo expects us to study for the test."
        },
        {
            "definition": "Definite",
            "pos": "adjective",
            "sent1": "It is defo the right answer.",
            "sent2": "She made a defo decision about her future.",
            "sent3": "The cat's defo favorite spot is by the window.",
            "sent4": "The old house has a defo charm about it.",
            "sent5": "The recipe calls for a defo amount of sugar."
        },
        {
            "definition": "Defend",
            "pos": "verb",
            "sent1": "He will defo defend his friend in any situation.",
            "sent2": "Soldiers defo defend their country with bravery.",
            "sent3": "The knight defo defended the castle from the dragon.",
            "sent4": "She will defo defend her title as the champion.",
            "sent5": "The lawyer will defo defend her client in court."
        },
        {
            "definition": "Defense",
            "pos": "noun",
            "sent1": "The shield is his defo defense against attacks.",
            "sent2": "The team's strong defense won them the game.",
            "sent3": "The fortress was a defo defense against invaders.",
            "sent4": "She put up a defo defense in the debate competition.",
            "sent5": "The immune system is the body's defo defense against illnesses."
        },
        {
            "definition": "Deforestation",
            "pos": "noun",
            "sent1": "The defo deforestation of the Amazon rainforest is concerning.",
            "sent2": "Deforestation is a major environmental issue.",
            "sent3": "The animals lost their homes due to defo deforestation.",
            "sent4": "The effects of deforestation are visible from space.",
            "sent5": "Deforestation leads to loss of biodiversity and habitats."
        }
    ]
}