{
    "term": "degree",
    "meanings": [
        {
            "definition": "A unit of measurement for angles.",
            "pos": "noun",
            "sent1": "She measured the angle of the triangle using a protractor in degrees.",
            "sent2": "The door swung open at a ninety-degree angle.",
            "sent3": "The cat tried to climb the tree at a 360-degree angle, looking like a skilled acrobat.",
            "sent4": "His honesty was at a 180-degree angle from his usual behavior.",
            "sent5": "The sun's rays hit the water at a perfect 45-degree angle, creating a beautiful reflection."
        },
        {
            "definition": "A unit of measurement for temperature.",
            "pos": "noun",
            "sent1": "The weather forecast predicted a high of 80 degrees Fahrenheit.",
            "sent2": "She turned up the thermostat to increase the room temperature by a few degrees.",
            "sent3": "The penguin felt like a superstar in the 0-degree weather, wearing its tuxedo proudly.",
            "sent4": "The heat in the desert was so intense, it felt like a thousand degrees.",
            "sent5": "The ice cream started melting quickly in the 90-degree heat."
        },
        {
            "definition": "A stage or step in a process.",
            "pos": "noun",
            "sent1": "After completing his bachelor's, he moved on to the next degree of pursuing a master's.",
            "sent2": "The project was still in the planning degree when unexpected challenges arose.",
            "sent3": "Her excitement reached a new degree when she found out she got the job.",
            "sent4": "The friendship between them deepened to a significant degree over the years.",
            "sent5": "The chef's skills improved to a remarkable degree after attending culinary school."
        },
        {
            "definition": "A level or amount of something.",
            "pos": "noun",
            "sent1": "The company aimed to increase the degree of customer satisfaction through better service.",
            "sent2": "The success of the event depended on a high degree of coordination among the team members.",
            "sent3": "His love for chocolate reached an alarming degree, causing him to eat it every day.",
            "sent4": "The noise outside rose to such a degree that it became impossible to concentrate.",
            "sent5": "The beauty of the landscape was breathtaking to a remarkable degree."
        },
        {
            "definition": "An academic title conferred by a college or university.",
            "pos": "noun",
            "sent1": "After years of hard work, she finally received her doctoral degree in psychology.",
            "sent2": "He proudly displayed his bachelor's degree on the wall of his office.",
            "sent3": "The professor's expertise was evident in the way he spoke about his field of study with a high degree of knowledge.",
            "sent4": "She pursued a master's degree in literature to deepen her understanding of classic works.",
            "sent5": "The value of her education was not just in the degree itself but in the knowledge gained along the way."
        }
    ]
}