{
    "term": "dehumanized",
    "meanings": [
        {
            "definition": "To deprive of human qualities or attributes.",
            "pos": "verb",
            "sent1": "The cruel experiment dehumanized the poor animals.",
            "sent2": "The soldiers dehumanized the prisoners by treating them with cruelty.",
            "sent3": "The movie portrayed a comical scene where aliens dehumanized humans by mistaking them for pets.",
            "sent4": "The oppressive regime's propaganda dehumanized its opponents, painting them as monsters.",
            "sent5": "The artist's powerful painting vividly depicted the dehumanized figures in a war-torn landscape."
        },
        {
            "definition": "To treat someone as if they are not human.",
            "pos": "verb",
            "sent1": "The dictator's regime dehumanized its citizens, suppressing their rights.",
            "sent2": "It is wrong to dehumanize others based on their beliefs or background.",
            "sent3": "In the comedy show, the characters dehumanized each other in a playful banter.",
            "sent4": "The divisive rhetoric in politics can dehumanize entire groups of people.",
            "sent5": "The novel's powerful message highlighted the dangers of dehumanizing individuals for personal gain."
        },
        {
            "definition": "To make someone feel less than human.",
            "pos": "verb",
            "sent1": "The harsh words dehumanized the victim, leaving them feeling worthless.",
            "sent2": "Bullying can dehumanize its targets, causing emotional harm.",
            "sent3": "The cartoon depicted a funny scenario where a robot accidentally dehumanized its creator.",
            "sent4": "The media's portrayal of certain groups can dehumanize them in the eyes of the public.",
            "sent5": "The haunting images in the documentary showed the dehumanized conditions of the workers in the factory."
        }
    ]
}