{
    "term": "dehumanize",
    "meanings": [
        {
            "definition": "To deprive of human qualities or attributes",
            "pos": "verb",
            "sent1": "The cruel experiment aimed to dehumanize the subjects by stripping away their emotions.",
            "sent2": "The dictator's oppressive regime sought to dehumanize its citizens through constant surveillance.",
            "sent3": "The robot's attempt to dehumanize itself by mimicking human behavior ended up being quite comical.",
            "sent4": "The harsh conditions in the factory seemed to dehumanize the workers, turning them into mere machines.",
            "sent5": "The eerie silence in the abandoned town seemed to dehumanize the once vibrant community."
        },
        {
            "definition": "To treat someone as if they are not human",
            "pos": "verb",
            "sent1": "The cruel captors would dehumanize their prisoners by subjecting them to inhumane conditions.",
            "sent2": "It is unacceptable to dehumanize others based on their race, religion, or beliefs.",
            "sent3": "The aliens' attempt to dehumanize the earthlings by imitating their behavior was quite amusing.",
            "sent4": "The media's portrayal of celebrities often serves to dehumanize them, reducing them to mere objects of entertainment.",
            "sent5": "The eerie fog seemed to dehumanize the familiar landscape, creating an otherworldly atmosphere."
        },
        {
            "definition": "To make someone feel less human",
            "pos": "verb",
            "sent1": "The constant criticism from her peers seemed to dehumanize her, making her doubt her worth.",
            "sent2": "Bullying can dehumanize its victims, causing them to question their own humanity.",
            "sent3": "The comedian's exaggerated impersonation of the president was meant to dehumanize him, but it just seemed silly.",
            "sent4": "The harsh words of the teacher seemed to dehumanize the students, crushing their spirits.",
            "sent5": "The eerie music in the horror movie seemed to dehumanize the characters, adding to the suspense."
        }
    ]
}