{
    "term": "deictic",
    "meanings": [
        {
            "definition": "Relating to or denoting a word or expression whose meaning is dependent on the context in which it is used.",
            "pos": "adjective",
            "sent1": "The deictic word 'this' changes its meaning based on what it refers to.",
            "sent2": "In the story, the deictic term 'that' helped the reader understand the location.",
            "sent3": "The deictic phrase 'over there' got lost and ended up pointing at a squirrel instead of the tree.",
            "sent4": "Her deictic gestures were like arrows, guiding everyone's attention to the hidden treasure.",
            "sent5": "The deictic nature of 'now' made the concept of time feel like a slippery fish, hard to grasp."
        },
        {
            "definition": "Acting as a pointing device.",
            "pos": "adjective",
            "sent1": "The deictic arrow on the map showed the direction of the treasure.",
            "sent2": "The deictic symbol on the screen helped navigate through the menu.",
            "sent3": "The deictic mouse cursor seemed to have a mind of its own, leading the user astray.",
            "sent4": "His deictic hand gestures were so precise, it was like he had a built-in GPS.",
            "sent5": "The deictic function of the remote control made changing channels as easy as a flick of the wrist."
        },
        {
            "definition": "Indicating or pointing to something.",
            "pos": "adjective",
            "sent1": "The deictic gestures of the magician directed the audience's attention to the hat.",
            "sent2": "The deictic signs on the road guided the travelers to the nearest town.",
            "sent3": "The deictic compass needle seemed confused, spinning in all directions.",
            "sent4": "Her deictic eyes locked onto the hidden clue, revealing the secret passage.",
            "sent5": "The deictic nature of the lighthouse beam pointed ships safely to shore."
        }
    ]
}