{
    "term": "deification",
    "meanings": [
        {
            "definition": "The act of making a god of someone or something.",
            "pos": "noun",
            "sent1": "The deification of the ancient ruler led to the construction of grand temples in his honor.",
            "sent2": "In some cultures, deification of nature is a common practice.",
            "sent3": "The deification of a pet cat may seem silly to some, but to its owner, it's a sign of deep love.",
            "sent4": "The deification of celebrities in modern society can sometimes overshadow their actual talents.",
            "sent5": "The deification of the mountain by the local tribe made it a sacred place for generations."
        },
        {
            "definition": "The state of being treated like a god.",
            "pos": "noun",
            "sent1": "After his heroic act, the soldier was met with deification by the grateful townspeople.",
            "sent2": "The deification of the king by his subjects was evident in the lavish ceremonies held in his honor.",
            "sent3": "The deification of the boss by his employees sometimes led to humorous attempts to please him.",
            "sent4": "The deification of the star athlete by fans reached new heights after his championship win.",
            "sent5": "The deification of the wise elder in the village brought a sense of peace and unity among the residents."
        },
        {
            "definition": "The belief in or worship of someone or something as a god.",
            "pos": "noun",
            "sent1": "The deification of the ancient statue by the villagers was a result of their strong faith.",
            "sent2": "In some cultures, the deification of ancestors is a common spiritual practice.",
            "sent3": "The deification of a famous historical figure in the novel added an interesting twist to the plot.",
            "sent4": "The deification of the mysterious creature in the legend captured the imagination of the entire town.",
            "sent5": "The deification of the sacred tree by the indigenous tribe was a symbol of their deep connection to nature."
        }
    ]
}