{
    "term": "deinstitutionalized",
    "meanings": [
        {
            "definition": "To release (someone) from an institution, especially a mental health facility.",
            "pos": "verb",
            "sent1": "The hospital deinstitutionalized the patient after they showed signs of improvement.",
            "sent2": "She deinstitutionalized her friend from the psychiatric ward after their treatment was complete.",
            "sent3": "The doctor deinstitutionalized the teddy bear from the toy hospital, declaring it fully recovered.",
            "sent4": "After years of confinement, the bird was deinstitutionalized from its cage and set free to soar.",
            "sent5": "The magician deinstitutionalized the rabbit from the hat, surprising the audience with its disappearance."
        },
        {
            "definition": "To remove from an institution or organization.",
            "pos": "verb",
            "sent1": "The company deinstitutionalized the employee due to budget cuts.",
            "sent2": "He deinstitutionalized himself from the toxic workplace by resigning.",
            "sent3": "The chef deinstitutionalized the burnt dish from the menu, avoiding customer complaints.",
            "sent4": "The rescue team deinstitutionalized the trapped hiker from the mountain, bringing them to safety.",
            "sent5": "The teacher deinstitutionalized the disruptive student from the classroom, restoring peace for the others."
        },
        {
            "definition": "The process of moving individuals with disabilities out of large institutions and into community-based settings.",
            "pos": "noun",
            "sent1": "The deinstitutionalized of disabled individuals aims to provide better care and integration.",
            "sent2": "She studied the deinstitutionalized of patients to understand the impact on their well-being.",
            "sent3": "The deinstitutionalized of the elderly residents led to a more vibrant and social community.",
            "sent4": "The deinstitutionalized of children with special needs allowed for personalized support and growth.",
            "sent5": "The deinstitutionalized of the group home residents brought a sense of independence and belonging."
        }
    ]
}