{
    "term": "delaminate",
    "meanings": [
        {
            "definition": "To split into layers",
            "pos": "verb",
            "sent1": "The old book started to delaminate, with its pages coming apart.",
            "sent2": "When the glue dried out, the layers of the plywood began to delaminate.",
            "sent3": "As the cake cooled, it seemed to delaminate into fluffy layers, making it look like a delicious science experiment.",
            "sent4": "The ice on the windshield delaminated in the sun, revealing the intricate patterns underneath.",
            "sent5": "The artist used a special technique to delaminate the paint layers, creating a unique texture on the canvas."
        },
        {
            "definition": "To separate into thin layers",
            "pos": "verb",
            "sent1": "The rock delaminated easily, revealing its beautiful layers of colors.",
            "sent2": "The pastry chef carefully delaminated the dough to create a flaky crust.",
            "sent3": "The magician's trick involved delaminating a deck of cards, leaving the audience amazed.",
            "sent4": "The onion delaminated as the chef sliced it, making it easier to separate the thin layers for cooking.",
            "sent5": "The old wallpaper began to delaminate, showing the multiple layers of design underneath."
        },
        {
            "definition": "To peel apart",
            "pos": "verb",
            "sent1": "The sticker on the fruit delaminated easily, leaving no residue behind.",
            "sent2": "She carefully delaminated the tape from the paper without tearing it.",
            "sent3": "The old paint on the wall started to delaminate, creating a peeling effect that looked like modern art.",
            "sent4": "The skin of the orange delaminated as he peeled it, releasing a burst of citrus scent.",
            "sent5": "The layers of the onion delaminated as she peeled it, revealing its fresh, crisp texture."
        }
    ]
}