{
    "term": "delegacies",
    "meanings": [
        {
            "definition": "The act of delegating tasks or responsibilities to others.",
            "pos": "noun",
            "sent1": "She showed great delegacies by assigning different jobs to her team members.",
            "sent2": "The manager's delegacies made the project run smoothly.",
            "sent3": "The delegacies of choosing who gets to be the line leader in class were highly contested.",
            "sent4": "In the game of chess, each piece has its own delegacies on the board.",
            "sent5": "The delegacies of the queen bee in the hive ensure the colony's survival."
        },
        {
            "definition": "An individual or group of individuals who have been delegated authority or responsibilities.",
            "pos": "noun",
            "sent1": "The delegacies in the company were trusted to make important decisions.",
            "sent2": "The delegacies met to discuss the upcoming changes in the organization.",
            "sent3": "The delegacies at the meeting had a heated debate over the budget allocation.",
            "sent4": "As the delegacies of the team, they had to ensure everyone was on the same page.",
            "sent5": "The delegacies of the student council were responsible for planning the school event."
        },
        {
            "definition": "The authority or power given to someone to act on behalf of another.",
            "pos": "noun",
            "sent1": "The lawyer had the delegacies to represent the client in court.",
            "sent2": "The delegacies granted to the ambassador allowed for diplomatic negotiations.",
            "sent3": "The delegacies given to the babysitter included making sure the children were in bed on time.",
            "sent4": "With great delegacies comes great responsibility to make decisions for others.",
            "sent5": "The delegacies bestowed upon the knight by the king were a mark of trust and honor."
        }
    ]
}