{
    "term": "delinquencies",
    "meanings": [
        {
            "definition": "Minor crimes, especially committed by young people.",
            "pos": "noun",
            "sent1": "The police officer explained that the delinquencies in the neighborhood were mostly related to vandalism.",
            "sent2": "The judge specialized in cases involving delinquencies of teenagers.",
            "sent3": "The school principal found the delinquencies of the students quite concerning.",
            "sent4": "The rise in delinquencies among the youth was like a storm brewing in the community.",
            "sent5": "The newspaper headline screamed about the delinquencies plaguing the city streets."
        },
        {
            "definition": "Failure to fulfill a duty or obligation.",
            "pos": "noun",
            "sent1": "Her delinquencies in completing her homework led to a drop in her grades.",
            "sent2": "The company faced financial losses due to delinquencies in meeting their deadlines.",
            "sent3": "His delinquencies in taking out the trash always caused arguments in the household.",
            "sent4": "The consequences of his delinquencies at work were severe, leading to his dismissal.",
            "sent5": "The delinquencies in following safety protocols resulted in a workplace accident."
        },
        {
            "definition": "The state of being overdue in payment.",
            "pos": "noun",
            "sent1": "The delinquencies in rent payment led to the landlord issuing a warning.",
            "sent2": "The company faced financial difficulties due to delinquencies in settling their bills.",
            "sent3": "Her delinquencies in paying the electricity bill resulted in a temporary power cut.",
            "sent4": "The delinquencies in loan repayment caused a negative impact on his credit score.",
            "sent5": "The delinquencies in credit card payments accumulated hefty late fees."
        }
    ]
}