{
    "term": "deliriums",
    "meanings": [
        {
            "definition": "A state of mental confusion or excitement",
            "pos": "noun",
            "sent1": "During the storm, the loud noises outside caused deliriums in the scared dog.",
            "sent2": "The children's laughter filled the room with deliriums of joy.",
            "sent3": "The unexpected snow day brought deliriums of happiness to the students.",
            "sent4": "Her deliriums of excitement were like fireworks in her mind.",
            "sent5": "The deliriums of the party lingered in his memory long after it ended."
        },
        {
            "definition": "A temporary state of mental disturbance characterized by confusion and hallucinations",
            "pos": "noun",
            "sent1": "After the surgery, the patient experienced deliriums and saw strange things in the hospital room.",
            "sent2": "The fever caused deliriums, making her believe she was in a magical land.",
            "sent3": "In his deliriums, he thought the cat was talking to him in a human voice.",
            "sent4": "The deliriums of the haunted house made her see ghosts around every corner.",
            "sent5": "The deliriums of the nightmare lingered even after she woke up in a cold sweat."
        },
        {
            "definition": "A frenzied mental state characterized by confusion and disordered speech",
            "pos": "noun",
            "sent1": "During the debate, his deliriums led to a jumble of words that made no sense.",
            "sent2": "The stress of the exam caused deliriums, making it hard for him to express his thoughts clearly.",
            "sent3": "In her deliriums, she started speaking in a made-up language that no one could understand.",
            "sent4": "The deliriums of the argument turned their conversation into a chaotic mess.",
            "sent5": "His deliriums of frustration were evident in the way he stumbled over his words."
        }
    ]
}