{
    "term": "delocalized",
    "meanings": [
        {
            "definition": "Spread out over a wide area",
            "pos": "adjective",
            "sent1": "The stars in the night sky looked delocalized, twinkling in every direction.",
            "sent2": "The city's lights created a delocalized glow that could be seen from miles away.",
            "sent3": "The spilled glitter on the floor seemed to have a delocalized party of its own.",
            "sent4": "Her laughter echoed through the room, creating a delocalized sense of joy.",
            "sent5": "The colorful balloons floated in a delocalized pattern, adding a festive touch to the event."
        },
        {
            "definition": "Not confined to a particular location",
            "pos": "adjective",
            "sent1": "The idea of love is delocalized, it can be felt anywhere in the world.",
            "sent2": "Technology has made communication delocalized, allowing us to connect globally.",
            "sent3": "The scent of freshly baked cookies delocalized throughout the house, tempting everyone.",
            "sent4": "His music had a delocalized appeal, resonating with listeners from different cultures.",
            "sent5": "The concept of freedom is delocalized, transcending borders and boundaries."
        },
        {
            "definition": "Dispersed or distributed widely",
            "pos": "adjective",
            "sent1": "The seeds from the dandelion were delocalized by the wind, spreading across the field.",
            "sent2": "The rumors about the new movie were delocalized, reaching every corner of the town.",
            "sent3": "The children's laughter was delocalized in the playground, creating a joyful atmosphere.",
            "sent4": "The scent of fresh flowers delocalized through the garden, perfuming the air.",
            "sent5": "The news of the upcoming sale was delocalized, attracting shoppers from neighboring towns."
        }
    ]
}