{
    "term": "demonetize",
    "meanings": [
        {
            "definition": "To stop using something as currency.",
            "pos": "verb",
            "sent1": "The small island decided to demonetize their old coins and use seashells instead.",
            "sent2": "The government chose to demonetize the old paper money to introduce a new digital currency.",
            "sent3": "The piggy bank started a protest when the kids tried to demonetize their favorite coin.",
            "sent4": "Her decision to demonetize her collection of rare stamps shocked the philately community.",
            "sent5": "The wizard's spell seemed to demonetize the gold coins, turning them into leaves."
        },
        {
            "definition": "To remove the monetary value from something.",
            "pos": "verb",
            "sent1": "The company had to demonetize the damaged products before selling them at a discount.",
            "sent2": "The artist decided to demonetize her artwork by giving it away for free.",
            "sent3": "The mischievous leprechaun tried to demonetize the chocolate coins by painting them silver.",
            "sent4": "The economic crisis seemed to demonetize the entire stock market overnight.",
            "sent5": "The magical potion had the power to demonetize any precious gemstone into a common pebble."
        },
        {
            "definition": "To render something no longer valid as legal tender.",
            "pos": "verb",
            "sent1": "The counterfeit bills were so well-made that they could easily demonetize the real currency.",
            "sent2": "The ancient law sought to demonetize certain coins to prevent counterfeiting.",
            "sent3": "The prankster's plan to demonetize the vending machine tokens backfired when they got stuck inside.",
            "sent4": "The unexpected announcement to demonetize the old banknotes caused chaos in the market.",
            "sent5": "The mysterious artifact had the power to demonetize any currency placed near it."
        }
    ]
}