{
    "term": "demoniacal",
    "meanings": [
        {
            "definition": "Of, relating to, or characteristic of a demon.",
            "pos": "adjective",
            "sent1": "The haunted house had a demoniacal presence that scared everyone away.",
            "sent2": "The movie portrayed the villain with a demoniacal laugh and sinister grin.",
            "sent3": "The cat's demoniacal stare at the mouse made the little creature freeze in fear.",
            "sent4": "The storm outside had a demoniacal fury, shaking the windows violently.",
            "sent5": "The demoniacal shadows in the forest seemed to move on their own, creating an eerie atmosphere."
        },
        {
            "definition": "Possessed or influenced by a demon.",
            "pos": "adjective",
            "sent1": "The girl's demoniacal behavior during the ritual frightened the others.",
            "sent2": "The possessed man spoke in a demoniacal voice that sent shivers down their spines.",
            "sent3": "The dog's demoniacal barking at the mirror confused everyone in the room.",
            "sent4": "The demoniacal whispers in his mind urged him to do unspeakable things.",
            "sent5": "The painting seemed to have a demoniacal energy, as if it was watching you wherever you stood."
        },
        {
            "definition": "Resembling or characteristic of a demon in appearance or behavior.",
            "pos": "adjective",
            "sent1": "The actor's demoniacal makeup transformed him into a terrifying creature.",
            "sent2": "The haunted house had a demoniacal atmosphere, with eerie sounds echoing through the halls.",
            "sent3": "The cake's demoniacal appearance with red frosting and black candles made it perfect for Halloween.",
            "sent4": "The demoniacal grin on the child's face as he played pranks made his mischief clear.",
            "sent5": "The old tree had a demoniacal twist to its branches, giving it a sinister silhouette against the moonlight."
        }
    ]
}