{
    "term": "demoi",
    "meanings": [
        {
            "definition": "A group of people living in a particular area.",
            "pos": "noun",
            "sent1": "The demoi gathered at the park for a community event.",
            "sent2": "The demoi in the neighborhood organized a clean-up day.",
            "sent3": "The demoi decided to have a potluck to get to know each other better.",
            "sent4": "The demoi of students cheered together at the school assembly.",
            "sent5": "The demoi of fans filled the stadium with excitement."
        },
        {
            "definition": "To show or explain how something works.",
            "pos": "verb",
            "sent1": "Can you demoi how to use this new software?",
            "sent2": "She will demoi the proper technique for painting the walls.",
            "sent3": "He demoi'd the recipe for the class in a fun and engaging way.",
            "sent4": "The mechanic demoi'd the engine's inner workings to the curious customer.",
            "sent5": "The teacher demoi'd the science experiment step by step."
        },
        {
            "definition": "A short recording of a song used to promote it.",
            "pos": "noun",
            "sent1": "The radio station played the demoi of the new single.",
            "sent2": "The band sent out demoi CDs to record labels.",
            "sent3": "She listened to the demoi of the song before deciding to buy it.",
            "sent4": "The demoi of the track gave listeners a taste of the upcoming album.",
            "sent5": "The demoi showcased the artist's vocal range and style."
        },
        {
            "definition": "A demonstration or protest.",
            "pos": "noun",
            "sent1": "The demoi outside City Hall demanded change.",
            "sent2": "The peaceful demoi marched through the streets with banners.",
            "sent3": "The demoi against pollution drew attention to environmental issues.",
            "sent4": "The demoi at the courthouse called for justice.",
            "sent5": "The demoi was a powerful display of unity and determination."
        }
    ]
}