{
    "term": "democratic",
    "meanings": [
        {
            "definition": "Relating to or supporting democracy.",
            "pos": "adjective",
            "sent1": "The group made a democratic decision by voting on the new rules.",
            "sent2": "In a democratic society, everyone has the right to express their opinions.",
            "sent3": "It was a democratic race to see who could eat the most hot dogs in one minute.",
            "sent4": "Her leadership style was like a democratic orchestra conductor, ensuring every instrument had its moment.",
            "sent5": "The classroom was a democratic space where students could choose their own projects."
        },
        {
            "definition": "Characterized by or advocating equal rights and opportunities for all citizens.",
            "pos": "adjective",
            "sent1": "The company's policies were truly democratic, ensuring fair treatment for all employees.",
            "sent2": "A democratic society values the importance of equal opportunities for everyone.",
            "sent3": "The playground game was so democratic that even the youngest children could participate.",
            "sent4": "Her smile was like a beacon of democratic warmth, welcoming everyone equally.",
            "sent5": "The garden was a democratic paradise, with every flower receiving equal sunlight."
        },
        {
            "definition": "Involving or based on the principles of democracy.",
            "pos": "adjective",
            "sent1": "The student council election was a democratic process, allowing every student to vote.",
            "sent2": "A democratic government listens to the voices of its citizens before making decisions.",
            "sent3": "The family dinner decision was made in a democratic fashion, with each member having a vote.",
            "sent4": "Her artwork was a democratic masterpiece, incorporating the ideas of everyone in the class.",
            "sent5": "The town hall meeting was a democratic forum for discussing important community issues."
        },
        {
            "definition": "Open to or controlled by the people as a whole.",
            "pos": "adjective",
            "sent1": "The town hall was a democratic space where residents could voice their concerns.",
            "sent2": "A democratic system ensures that power remains in the hands of the people.",
            "sent3": "The potluck dinner was a democratic feast, with everyone contributing a dish.",
            "sent4": "Her smile lit up the room in a democratic glow, spreading warmth to all.",
            "sent5": "The decision-making process was democratic, with input from all team members."
        }
    ]
}