{
    "term": "denial",
    "meanings": [
        {
            "definition": "The action of declaring something to be untrue.",
            "pos": "noun",
            "sent1": "Her denial of the accusations was strong and unwavering.",
            "sent2": "His denial of the crime only made the situation worse.",
            "sent3": "In a fit of denial, she insisted the sky was green and the grass was blue.",
            "sent4": "The denial of reality was like trying to hold back a tidal wave with a broom.",
            "sent5": "The denial of facts was as clear as a cloudless sky."
        },
        {
            "definition": "A refusal to admit the truth or reality of something.",
            "pos": "noun",
            "sent1": "Their denial of the problem led to further complications.",
            "sent2": "The patient's denial of their illness delayed proper treatment.",
            "sent3": "His denial of the obvious situation was like pretending a lion was a kitten.",
            "sent4": "The denial of the looming danger was akin to ignoring a storm warning.",
            "sent5": "The denial of the truth was as futile as trying to stop a river with a bucket."
        },
        {
            "definition": "A statement that something is not true.",
            "pos": "noun",
            "sent1": "The denial in his words was evident to all who listened.",
            "sent2": "Her denial of involvement in the incident was met with skepticism.",
            "sent3": "The denial of the facts sounded as convincing as claiming the moon was made of cheese.",
            "sent4": "The denial of reality in his speech was like painting a blue sky black.",
            "sent5": "The denial of the statement was as clear as a mirror reflecting the truth."
        },
        {
            "definition": "The action of refusing to give or grant something.",
            "pos": "noun",
            "sent1": "The denial of permission left them feeling frustrated.",
            "sent2": "His denial of the request was met with disappointment.",
            "sent3": "The denial of entry to the club felt like being locked out of a party.",
            "sent4": "The denial of access was like hitting a dead end on a road trip.",
            "sent5": "The denial of the opportunity was as crushing as a door slamming shut."
        }
    ]
}