{
    "term": "denomination",
    "meanings": [
        {
            "definition": "A religious group or sect",
            "pos": "noun",
            "sent1": "Our family belongs to the same denomination and attends church together every Sunday.",
            "sent2": "The denomination of Buddhism focuses on meditation and mindfulness.",
            "sent3": "I heard a joke about a denomination of penguins that only wear tuxedos to church.",
            "sent4": "In the denomination of sports fans, soccer enthusiasts are known for their passionate support.",
            "sent5": "The denomination of artists who specialize in watercolor paintings gathered for a workshop."
        },
        {
            "definition": "A unit of value in a system of currency",
            "pos": "noun",
            "sent1": "I need to exchange my currency for a smaller denomination to make the purchase.",
            "sent2": "The vending machine only accepts coins in the denomination of quarters.",
            "sent3": "It was a strange sight to see someone pay for a car in the denomination of pennies.",
            "sent4": "She found an old coin of a rare denomination in her grandfather's collection.",
            "sent5": "The store clerk counted the bills in the denomination of fives before closing for the day."
        },
        {
            "definition": "A category or class of things with shared characteristics",
            "pos": "noun",
            "sent1": "The bookstore has a denomination of books dedicated to mystery novels.",
            "sent2": "In the animal kingdom, the denomination of mammals includes humans, dogs, and cats.",
            "sent3": "The denomination of fruits at the market was so diverse, it was hard to choose just one.",
            "sent4": "She sorted her stamp collection into the denomination of countries they were from.",
            "sent5": "The denomination of vehicles parked outside ranged from bicycles to luxury cars."
        }
    ]
}