{
    "term": "deodars",
    "meanings": [
        {
            "definition": "Deodars: a type of cedar tree native to the Himalayas.",
            "pos": "noun",
            "sent1": "The deodars in the Himalayas provide shade and beauty to the landscape.",
            "sent2": "People admire the deodars for their majestic presence in the mountains.",
            "sent3": "The deodars in the forest whispered secrets to each other in the gentle breeze.",
            "sent4": "The deodars stood tall like guardians of the mountains, watching over the valley below.",
            "sent5": "The scent of deodars filled the air, creating a peaceful atmosphere."
        },
        {
            "definition": "Deodars: the wood of the deodar tree, used for construction and furniture.",
            "pos": "noun",
            "sent1": "The carpenter crafted a beautiful table from the deodars he had sourced.",
            "sent2": "The deodars' wood is known for its durability and elegant grain.",
            "sent3": "The mischievous squirrel built its nest high up in the deodars' branches.",
            "sent4": "The deodars' wood, strong and reliable, supported the weight of the entire house.",
            "sent5": "The aroma of freshly cut deodars filled the workshop, inspiring the workers."
        },
        {
            "definition": "Deodars: a group of deodar trees in a forest.",
            "pos": "noun",
            "sent1": "The hikers paused to admire the beauty of the deodars standing together in the forest.",
            "sent2": "The deodars' branches intertwined, creating a natural canopy above the forest floor.",
            "sent3": "The deodars in the forest seemed to be engaged in a silent conversation with each other.",
            "sent4": "The deodars' shadows danced playfully on the forest floor as the sun set.",
            "sent5": "The forest echoed with the rustling of leaves from the deodars, creating a soothing melody."
        }
    ]
}