{
    "term": "deponents",
    "meanings": [
        {
            "definition": "A person who testifies or gives evidence under oath.",
            "pos": "noun",
            "sent1": "During the trial, the deponents shared their experiences with the court.",
            "sent2": "The deponents were asked to swear to tell the truth before giving their testimony.",
            "sent3": "The deponents' testimonies were so similar, it seemed like they had rehearsed together.",
            "sent4": "In the courtroom, the deponents' words carried the weight of truth and justice.",
            "sent5": "The deponents' statements were like puzzle pieces that fit perfectly together."
        },
        {
            "definition": "A person who makes a statement or declaration.",
            "pos": "noun",
            "sent1": "The deponents signed the document to confirm their agreement.",
            "sent2": "As deponents, they were required to provide written statements of their actions.",
            "sent3": "The deponents' declarations were clear and concise, leaving no room for doubt.",
            "sent4": "Their words as deponents were like signatures on a binding contract.",
            "sent5": "The deponents' statements echoed in the room, leaving a lasting impression on everyone present."
        },
        {
            "definition": "A person who is called to give evidence in a legal proceeding.",
            "pos": "noun",
            "sent1": "The deponents were summoned to the court to testify about the incident.",
            "sent2": "As deponents, they had to recount the events exactly as they remembered.",
            "sent3": "The deponents' presence in the courtroom added a sense of gravity to the proceedings.",
            "sent4": "Their role as deponents was crucial in determining the outcome of the case.",
            "sent5": "The deponents' testimonies painted a vivid picture of what had transpired on that fateful day."
        }
    ]
}