{
    "term": "deprecating",
    "meanings": [
        {
            "definition": "Belittling or expressing disapproval",
            "pos": "adjective",
            "sent1": "She made a deprecating remark about his outfit.",
            "sent2": "Her deprecating tone made him feel small.",
            "sent3": "The deprecating comments at the meeting were unnecessary.",
            "sent4": "His deprecating attitude towards her work was demoralizing.",
            "sent5": "The deprecating look she gave him spoke volumes."
        },
        {
            "definition": "Disparaging or depreciating",
            "pos": "adjective",
            "sent1": "His deprecating comments about the project were unhelpful.",
            "sent2": "The deprecating remarks lowered the team's morale.",
            "sent3": "Despite his deprecating words, she remained confident.",
            "sent4": "The deprecating review of the movie was overly harsh.",
            "sent5": "The deprecating tone in his voice was unmistakable."
        },
        {
            "definition": "To belittle or express disapproval of",
            "pos": "verb",
            "sent1": "She tends to deprecate others to make herself feel superior.",
            "sent2": "He constantly deprecates his own achievements.",
            "sent3": "The comedian's deprecating humor had the audience in stitches.",
            "sent4": "It's not right to deprecate someone just because they are different.",
            "sent5": "His habit of deprecating everything around him was tiresome."
        },
        {
            "definition": "To disparage or depreciate",
            "pos": "verb",
            "sent1": "They always deprecate each other's efforts instead of supporting.",
            "sent2": "The critics deprecate the artist's work without understanding it.",
            "sent3": "He tried to deprecate her success, but she remained unfazed.",
            "sent4": "It's easy to deprecate others when you don't see their hard work.",
            "sent5": "The teacher never deprecates any student's attempt to learn."
        }
    ]
}