{
    "term": "derelicts",
    "meanings": [
        {
            "definition": "A person abandoned by society or their family",
            "pos": "noun",
            "sent1": "The kind-hearted woman always helped the derelicts she met on the street.",
            "sent2": "The city shelter provided a warm meal for the derelicts who had nowhere else to go.",
            "sent3": "The derelicts in the park were surprised when a magician suddenly appeared and offered them free tickets to his show.",
            "sent4": "The derelicts of society are like forgotten puzzle pieces, waiting to be found and valued.",
            "sent5": "The image of the derelicts huddled around the fire pit will forever stay in my memory."
        },
        {
            "definition": "A ship abandoned at sea",
            "pos": "noun",
            "sent1": "The old pirate tale spoke of a haunted ship filled with derelicts doomed to sail the seas forever.",
            "sent2": "The sailors spotted a derelict drifting aimlessly in the distance, its sails torn and tattered.",
            "sent3": "The crew joked that the derelict ship was actually a secret base for sea monsters.",
            "sent4": "The derelict ship stood as a ghostly reminder of the dangers that lurked in the open waters.",
            "sent5": "The sight of the derelict ship disappearing into the mist sent shivers down their spines."
        },
        {
            "definition": "Neglected or abandoned property",
            "pos": "noun",
            "sent1": "The neighborhood was filled with derelict buildings that once thrived with life.",
            "sent2": "The derelict factory stood as a silent witness to the town's industrial past.",
            "sent3": "Local kids often played hide-and-seek in the derelict mansion, imagining it was haunted.",
            "sent4": "The derelict property was a stark reminder of the economic downturn the town had faced.",
            "sent5": "The overgrown garden of the derelict house whispered tales of its former glory."
        }
    ]
}