{
    "term": "derealization",
    "meanings": [
        {
            "definition": "The feeling that one's surroundings are not real.",
            "pos": "noun",
            "sent1": "During the movie, she experienced derealization and felt like she was in a dream.",
            "sent2": "His derealization made it hard for him to focus on his work.",
            "sent3": "The derealization she felt at the amusement park made the roller coaster even more thrilling.",
            "sent4": "The fog enveloped the city, creating a sense of derealization in the bustling streets.",
            "sent5": "The derealization during the storm made the lightning seem like a surreal painting."
        },
        {
            "definition": "The act of perceiving the external world as unreal or distorted.",
            "pos": "noun",
            "sent1": "His derealization caused him to question the authenticity of everything around him.",
            "sent2": "The derealization he experienced after the accident left him feeling disconnected from reality.",
            "sent3": "The derealization during the magic show made him doubt his own eyes.",
            "sent4": "The derealization of the cityscape at night gave it an otherworldly appearance.",
            "sent5": "The derealization during the eclipse made the sky look like a painting come to life."
        },
        {
            "definition": "A state in which one feels detached from their surroundings.",
            "pos": "noun",
            "sent1": "Her derealization made her feel like she was watching the world through a foggy window.",
            "sent2": "The derealization he experienced in the crowded room made him feel isolated.",
            "sent3": "The derealization during the play made her feel like she was in a different dimension.",
            "sent4": "The derealization of the forest at dusk gave it an eerie, detached feeling.",
            "sent5": "The derealization during the concert made the music sound like it was coming from far away."
        }
    ]
}