{
    "term": "dermestids",
    "meanings": [
        {
            "definition": "Dermestids: a type of beetle known for feeding on dry animal or plant material",
            "pos": "noun",
            "sent1": "The dermestids were found in the old books, eating away at the pages.",
            "sent2": "I saw dermestids crawling on the dead leaves in the garden.",
            "sent3": "The dermestids threw a party on the dusty shelf, munching on the forgotten snacks.",
            "sent4": "The dermestids worked tirelessly, cleaning up the decaying wood like tiny janitors.",
            "sent5": "The dermestids scurried around the attic, leaving a trail of destruction behind them."
        },
        {
            "definition": "Dermestids: the larvae of these beetles, often used in taxidermy to clean bones",
            "pos": "noun",
            "sent1": "The taxidermist carefully placed the dermestids on the skeleton to remove any remaining flesh.",
            "sent2": "The dermestids wriggled around the bones, cleaning them thoroughly.",
            "sent3": "The dermestids threw a bone-cleaning party, leaving the skeleton spotless.",
            "sent4": "The dermestids were bone-cleaning artists, leaving behind perfectly polished bones.",
            "sent5": "The dermestids devoured the flesh, leaving only clean, white bones behind."
        },
        {
            "definition": "Dermestids: a common pest in homes and museums, known for damaging stored food and textiles",
            "pos": "noun",
            "sent1": "The dermestids invaded the pantry, ruining all the stored grains.",
            "sent2": "The museum staff had to deal with dermestids infesting the historical textiles.",
            "sent3": "The dermestids had a feast on the woolen sweaters, turning them into Swiss cheese.",
            "sent4": "The dermestids were like tiny wrecking balls, destroying everything in their path.",
            "sent5": "The dermestids left a trail of destruction in the museum, munching on everything in sight."
        }
    ]
}