{
    "term": "derogating",
    "meanings": [
        {
            "definition": "To detract from the worth or value of something.",
            "pos": "verb",
            "sent1": "She was constantly derogating her own achievements, never acknowledging her hard work.",
            "sent2": "The critic's review was filled with derogating remarks about the movie, causing many to avoid watching it.",
            "sent3": "The comedian joked about derogating his own cooking skills, claiming his burnt toast was a gourmet dish.",
            "sent4": "The dark clouds derogating the beauty of the sunset, casting a shadow over the colorful sky.",
            "sent5": "The graffiti on the historic building was a clear act of derogating its cultural significance."
        },
        {
            "definition": "To belittle or disparage someone or something.",
            "pos": "verb",
            "sent1": "He would often derogate his classmates in front of others, making them feel small and insignificant.",
            "sent2": "The bully's constant derogating of his peers led to a toxic environment in the school.",
            "sent3": "The children's playful banter turned into a game of derogating each other's favorite superheroes.",
            "sent4": "Her harsh words were like arrows, derogating his self-esteem with each piercing comment.",
            "sent5": "The online trolls took pleasure in derogating the author's work, spreading negativity without cause."
        },
        {
            "definition": "To diminish the reputation or standing of someone or something.",
            "pos": "verb",
            "sent1": "The scandal had a lasting impact, derogating the company's image in the eyes of the public.",
            "sent2": "The false rumors were aimed at derogating the politician's credibility before the election.",
            "sent3": "The gossip magazine was notorious for derogating celebrities, often twisting stories for sensationalism.",
            "sent4": "The graffiti on the historic building was a clear act of derogating its cultural significance.",
            "sent5": "The online reviews were derogating the restaurant's reputation, deterring potential customers from dining there."
        }
    ]
}