{
    "term": "descendible",
    "meanings": [
        {
            "definition": "Capable of being passed down from one generation to the next.",
            "pos": "adjective",
            "sent1": "The family heirloom was descendible, meaning it could be passed on to future generations.",
            "sent2": "Inheritance is a descendible trait that can be received from ancestors.",
            "sent3": "The magical powers of the ancient amulet were descendible, causing humorous mishaps in the family.",
            "sent4": "The wisdom of the elders was descendible, flowing through the generations like a river of knowledge.",
            "sent5": "The legacy of bravery was descendible, shining brightly in the hearts of each descendant."
        },
        {
            "definition": "Able to be inherited or received from ancestors.",
            "pos": "adjective",
            "sent1": "The ancient artifact was descendible, waiting to be inherited by the next rightful owner.",
            "sent2": "Traits like courage and kindness are descendible qualities that pass through family lines.",
            "sent3": "The family's quirky sense of humor was descendible, leading to amusing situations at gatherings.",
            "sent4": "The artistic talent seemed descendible, as if creativity flowed through their bloodlines.",
            "sent5": "The love for music was descendible, echoing through the generations like a beautiful melody."
        },
        {
            "definition": "Capable of being transmitted or handed down.",
            "pos": "adjective",
            "sent1": "The ancient knowledge was descendible, ready to be transmitted to the next generation of scholars.",
            "sent2": "Traditions are descendible customs that are passed down from parents to children.",
            "sent3": "The family recipe for apple pie was descendible, leading to delicious and memorable gatherings.",
            "sent4": "The spirit of generosity was descendible, spreading like wildfire through acts of kindness.",
            "sent5": "The passion for storytelling was descendible, captivating listeners with each tale told."
        }
    ]
}