{
    "term": "desire",
    "meanings": [
        {
            "definition": "A strong feeling of wanting to have something or wishing for something to happen.",
            "pos": "noun",
            "sent1": "Her desire for ice cream was so strong that she couldn't stop thinking about it.",
            "sent2": "His desire for a new toy was evident in his eyes as he looked longingly at the store display.",
            "sent3": "She joked that her desire for a million dollars was so intense, she could almost taste the money.",
            "sent4": "His desire for success burned within him like a fierce flame, driving him to work harder every day.",
            "sent5": "The desire for knowledge consumed her, leading her to read every book she could get her hands on."
        },
        {
            "definition": "To wish for or long for; crave.",
            "pos": "verb",
            "sent1": "I desire a peaceful night's sleep after a long day at work.",
            "sent2": "She desires to travel the world and experience different cultures.",
            "sent3": "He jokingly said he desired a mountain of chocolate to satisfy his sweet tooth.",
            "sent4": "Her heart desired freedom like a bird yearning to soar through the open sky.",
            "sent5": "The young artist desired to create a masterpiece that would leave a lasting impact on the world."
        },
        {
            "definition": "To express a wish for; request.",
            "pos": "verb",
            "sent1": "She desires a raise at work to help support her family.",
            "sent2": "He desires that his friends join him for a fun day at the park.",
            "sent3": "The child desired a puppy for his birthday, hoping his parents would grant his wish.",
            "sent4": "Her eyes desired understanding as she silently pleaded for someone to listen.",
            "sent5": "The old man desired peace in his final days, surrounded by loved ones and tranquility."
        }
    ]
}