{
    "term": "desolatingly",
    "meanings": [
        {
            "definition": "In a manner that causes devastation or ruin.",
            "pos": "adverb",
            "sent1": "The tornado swept through the town desolatingly, leaving nothing but destruction behind.",
            "sent2": "The earthquake desolatingly shook the entire city, crumbling buildings to the ground.",
            "sent3": "The clumsy magician desolatingly turned the birthday cake into a pile of ashes with one wrong spell.",
            "sent4": "The news of the failed mission hit him desolatingly, shattering his hopes and dreams.",
            "sent5": "The forest fire spread desolatingly, consuming everything in its path with relentless fury."
        },
        {
            "definition": "In a way that leaves something empty or barren.",
            "pos": "adverb",
            "sent1": "The drought desolatingly dried up the once lush fields, turning them into a barren wasteland.",
            "sent2": "The war desolatingly stripped the village of its resources, leaving it empty and desolate.",
            "sent3": "The clumsy gardener desolatingly pruned the rose bushes, leaving them bare and lifeless.",
            "sent4": "The abandoned house stood desolatingly on the hill, its windows boarded up and its garden overgrown.",
            "sent5": "The winter frost desolatingly killed off all the crops, leaving the farmers with nothing to harvest."
        },
        {
            "definition": "In a manner that brings great sadness or loneliness.",
            "pos": "adverb",
            "sent1": "She looked out the window desolatingly, missing her friends who had moved away.",
            "sent2": "The old man sat desolatingly on the park bench, reminiscing about his lost love.",
            "sent3": "The puppy howled desolatingly when left alone in the house for the first time.",
            "sent4": "The child stared desolatingly at the empty swing set, longing for someone to play with.",
            "sent5": "The singer's voice echoed desolatingly in the empty concert hall, haunting the listeners with its melancholy tone."
        }
    ]
}