{
    "term": "despair",
    "meanings": [
        {
            "definition": "The complete loss or absence of hope.",
            "pos": "noun",
            "sent1": "Her face showed despair when she realized she lost her favorite toy.",
            "sent2": "The man's eyes were filled with despair as he searched for his missing dog.",
            "sent3": "Despite his despair, the clown managed to make the children laugh with his silly antics.",
            "sent4": "The dark clouds of despair loomed over her like a heavy blanket, suffocating any glimmer of hope.",
            "sent5": "The sound of despair in her voice echoed through the empty room, leaving a haunting silence behind."
        },
        {
            "definition": "To lose or be without hope.",
            "pos": "verb",
            "sent1": "She began to despair when her car wouldn't start in the middle of the storm.",
            "sent2": "The weary traveler despaired of ever finding his way out of the dense forest.",
            "sent3": "As the cake burned in the oven, she couldn't help but despair over her baking skills.",
            "sent4": "The sailor despaired as the stormy seas threatened to swallow his small boat whole.",
            "sent5": "His heart despaired at the thought of never seeing his family again after the shipwreck."
        },
        {
            "definition": "A state of hopelessness or discouragement.",
            "pos": "noun",
            "sent1": "The student felt despair after failing the important exam.",
            "sent2": "In the depths of despair, she found solace in the beauty of a blooming flower.",
            "sent3": "The cat's despair at being stuck in a tree was comically evident in its meowing.",
            "sent4": "The weight of despair pressed down on his shoulders, making it hard to even stand up straight.",
            "sent5": "The colors of the painting captured the essence of despair, evoking strong emotions in the viewers."
        }
    ]
}