{
    "term": "destructions",
    "meanings": [
        {
            "definition": "The action or process of causing so much damage to something that it no longer exists or cannot be repaired.",
            "pos": "noun",
            "sent1": "The earthquake brought great destructions to the city, leaving buildings in ruins.",
            "sent2": "The war resulted in widespread destructions of homes and infrastructure.",
            "sent3": "The comedy movie showed exaggerated destructions of a house for comedic effect.",
            "sent4": "The storm unleashed its fury, causing destructions akin to a powerful force of nature.",
            "sent5": "The destructions caused by the fire were so severe that they left a lasting impact on the community."
        },
        {
            "definition": "The state of being destroyed; ruin.",
            "pos": "noun",
            "sent1": "After the battle, the once beautiful castle lay in complete destructions.",
            "sent2": "The abandoned town was a haunting reminder of the past destructions it faced.",
            "sent3": "The children's game of building block towers only to knock them down brought giggles and destructions.",
            "sent4": "The old shipwreck stood as a symbol of the destructions of time and nature.",
            "sent5": "The artist captured the essence of destructions in his painting of a demolished cityscape."
        },
        {
            "definition": "The act or process of destroying something.",
            "pos": "noun",
            "sent1": "The demolition crew carried out the destructions of the old building with precision.",
            "sent2": "The destructions caused by the vandals were a senseless act of violence.",
            "sent3": "The chef's recipe called for the destructions of the vegetables by chopping them finely.",
            "sent4": "The destructions of the evidence pointed to a deliberate cover-up.",
            "sent5": "The controlled destructions of the bridge were necessary for the construction of a new one."
        }
    ]
}