{
    "term": "determinednesses",
    "meanings": [
        {
            "definition": "The quality of being resolute or firm in purpose.",
            "pos": "noun",
            "sent1": "Her determinednesses to finish the race inspired others to push themselves.",
            "sent2": "His determinednesses to succeed in his career led him to work hard every day.",
            "sent3": "The determinednesses of the squirrel to reach the bird feeder was both impressive and amusing.",
            "sent4": "The determinednesses of the waves crashing against the shore showed the relentless power of nature.",
            "sent5": "The determinednesses of the ant carrying a leaf many times its size was a true display of strength."
        },
        {
            "definition": "The state of being decided or settled.",
            "pos": "noun",
            "sent1": "The determinednesses of the matter left no room for further discussion.",
            "sent2": "After much debate, the determinednesses of the issue finally brought closure.",
            "sent3": "The determinednesses of the cat to claim the sunny spot on the couch was comical.",
            "sent4": "The determinednesses of the sun to rise each day is a constant in our lives.",
            "sent5": "The determinednesses of the clock ticking away the seconds reminds us of the passing time."
        },
        {
            "definition": "The act of making a firm decision or resolution.",
            "pos": "noun",
            "sent1": "Her determinednesses in choosing a college showed her commitment to her education.",
            "sent2": "The determinednesses with which he made his career choice impressed his peers.",
            "sent3": "The determinednesses of the child to eat only candy for dinner was met with a firm 'no'.",
            "sent4": "The determinednesses of the tree to grow tall and strong symbolized resilience.",
            "sent5": "The determinednesses of the detective to solve the case led to the capture of the criminal."
        }
    ]
}