{
    "term": "determination",
    "meanings": [
        {
            "definition": "The act of coming to a decision or of fixing or settling a purpose.",
            "pos": "noun",
            "sent1": "Her determination to finish her homework before dinner was strong.",
            "sent2": "His determination to learn how to ride a bike paid off in the end.",
            "sent3": "With great determination, she tackled the challenging puzzle and completed it.",
            "sent4": "His determination was a shining light guiding him through the darkest times.",
            "sent5": "The determination in her eyes showed her unwavering commitment to the task."
        },
        {
            "definition": "The quality of being resolute; firmness of purpose.",
            "pos": "noun",
            "sent1": "His determination to succeed in the competition was admirable.",
            "sent2": "She faced the difficult situation with determination and courage.",
            "sent3": "The squirrel's determination to reach the bird feeder was comical to watch.",
            "sent4": "Her determination was a rock-solid foundation for her ambitious goals.",
            "sent5": "The determination in his voice left no doubt about his unwavering resolve."
        },
        {
            "definition": "The process of establishing something exactly, typically by calculation or research.",
            "pos": "noun",
            "sent1": "The determination of the exact weight of the object required precise measurements.",
            "sent2": "The determination of the true value of the antique vase took hours of research.",
            "sent3": "The determination of the number of jellybeans in the jar became a fun guessing game.",
            "sent4": "Her determination in finding the right answer was like a compass pointing north.",
            "sent5": "The determination of the final score in the game was crucial for determining the winner."
        }
    ]
}