{
    "term": "detractively",
    "meanings": [
        {
            "definition": "In a way that detracts or takes away from something.",
            "pos": "adverb",
            "sent1": "She spoke detractively about his achievements, making them seem less impressive.",
            "sent2": "The competitor's actions detractively affected the overall outcome of the race.",
            "sent3": "He detractively pointed out all the flaws in her presentation, but she still received praise.",
            "sent4": "The dark clouds detractively covered the beauty of the sunset, casting a shadow over the horizon.",
            "sent5": "The graffiti detractively defaced the historic building, ruining its charm."
        },
        {
            "definition": "With the intention of causing harm or damage.",
            "pos": "adverb",
            "sent1": "The hacker acted detractively by spreading a virus through the company's network.",
            "sent2": "The villain's plan was to act detractively towards the hero's reputation.",
            "sent3": "The mischievous cat detractively knocked over the vase, shattering it into pieces.",
            "sent4": "The storm moved detractively towards the coast, threatening to cause destruction.",
            "sent5": "The spy worked detractively to sabotage the enemy's communication channels."
        },
        {
            "definition": "In a manner that diminishes the value or importance of something.",
            "pos": "adverb",
            "sent1": "His constant complaints detractively affected the team's morale.",
            "sent2": "The negative review detractively impacted the restaurant's reputation.",
            "sent3": "The comedian detractively joked about the president, causing laughter in the audience.",
            "sent4": "The weeds detractively overgrew the once beautiful garden, hiding its true beauty.",
            "sent5": "The cheap materials used detractively lowered the quality of the product."
        }
    ]
}