{
    "term": "deva",
    "meanings": [
        {
            "definition": "A god or deity in Hinduism.",
            "pos": "noun",
            "sent1": "In Hinduism, people worship the deva for their divine powers.",
            "sent2": "The deva is believed to have created the universe according to Hindu scriptures.",
            "sent3": "The deva decided to take a day off from granting wishes and relax in the heavenly realm.",
            "sent4": "The deva's presence in the temple was so powerful, it felt like a divine light shining upon all.",
            "sent5": "The deva's image was carved intricately on the temple walls, symbolizing its importance in the religion."
        },
        {
            "definition": "A celestial being or angel in Buddhism.",
            "pos": "noun",
            "sent1": "Buddhists believe that the deva watches over them and guides their spiritual journey.",
            "sent2": "The deva appeared in the monk's dream, delivering a message of peace and enlightenment.",
            "sent3": "The mischievous deva played a prank on the meditating monk by tickling his nose.",
            "sent4": "The deva's voice echoed through the mountains, bringing a sense of tranquility to all who heard it.",
            "sent5": "The deva's wings shimmered in the moonlight, casting a gentle glow on the peaceful monastery."
        },
        {
            "definition": "A supernatural being or spirit in various Indian religions.",
            "pos": "noun",
            "sent1": "Legends speak of a powerful deva who protected the village from evil spirits.",
            "sent2": "During the festival, offerings are made to honor the deva and seek its blessings.",
            "sent3": "The mischievous deva hid the villagers' belongings just to see them search frantically.",
            "sent4": "The deva's presence in the forest was felt by all, filling them with a sense of awe and wonder.",
            "sent5": "The deva's laughter echoed through the night, bringing joy to all who heard its melodic sound."
        }
    ]
}