{
    "term": "devastative",
    "meanings": [
        {
            "definition": "Causing great damage or destruction.",
            "pos": "adjective",
            "sent1": "The hurricane was devastative, destroying homes and uprooting trees.",
            "sent2": "The earthquake had a devastative impact on the city, leaving buildings in ruins.",
            "sent3": "The toddler's tantrum was devastative, scattering toys all over the room.",
            "sent4": "The wildfire's devastative force swept through the forest, leaving a trail of destruction.",
            "sent5": "The war's devastative aftermath left the town in shambles, with families displaced and infrastructure in ruins."
        },
        {
            "definition": "Capable of causing devastation.",
            "pos": "adjective",
            "sent1": "The powerful explosives were devastative, capable of leveling entire buildings.",
            "sent2": "The invasive species proved to be devastative to the local ecosystem.",
            "sent3": "The chef's new recipe was so devastative that it caused a culinary revolution.",
            "sent4": "The hacker's devastative skills could bring down entire networks with a single click.",
            "sent5": "The storm clouds gathered ominously, hinting at the devastative potential of the impending weather."
        },
        {
            "definition": "Characterized by devastation.",
            "pos": "adjective",
            "sent1": "The war-torn country was devastative, with ruins as far as the eye could see.",
            "sent2": "The abandoned town had a devastative aura, with empty streets and crumbling buildings.",
            "sent3": "The comedy of errors led to a devastative series of mishaps, much to the audience's amusement.",
            "sent4": "The artist's brushstrokes created a devastative landscape, capturing the raw beauty of destruction.",
            "sent5": "The novel's final chapters were a devastative climax, tying up all loose ends in a dramatic fashion."
        }
    ]
}