{
    "term": "devil",
    "meanings": [
        {
            "definition": "An evil spirit or being, often associated with Hell and temptation.",
            "pos": "noun",
            "sent1": "The little girl was scared of the devil in her nightmare.",
            "sent2": "The villagers believed the devil lurked in the dark forest.",
            "sent3": "When the cat knocked over the vase, the mischievous devil in her laughed.",
            "sent4": "His addiction to gambling was like making a deal with the devil.",
            "sent5": "The devil whispered sinful thoughts into his mind."
        },
        {
            "definition": "A wicked or malevolent person.",
            "pos": "noun",
            "sent1": "The criminal was known as the neighborhood devil.",
            "sent2": "The devil in human form plotted to steal the crown jewels.",
            "sent3": "The mischievous devil of a brother hid her favorite toy as a prank.",
            "sent4": "Her boss was a real devil, always making her work late.",
            "sent5": "The devil's smile sent shivers down her spine."
        },
        {
            "definition": "A mischievous or playful person.",
            "pos": "noun",
            "sent1": "The little boy was a little devil, always pulling pranks.",
            "sent2": "The devil of a friend convinced her to skip class and go on an adventure.",
            "sent3": "The mischievous devil of a puppy chewed up her favorite shoes.",
            "sent4": "Her laughter was like music, a playful devil dancing in the air.",
            "sent5": "The mischievous devil winked before disappearing into the crowd."
        },
        {
            "definition": "Used as an intensifier to express anger or frustration.",
            "pos": "interjection",
            "sent1": "Oh, devil! I forgot my keys inside the house again.",
            "sent2": "Devil take this traffic! I'm going to be late for the meeting.",
            "sent3": "Well, devil! Looks like I burned the dinner once more.",
            "sent4": "The devil with this broken phone! It never works when I need it.",
            "sent5": "Devil! Why does it always rain on the day of my picnic?"
        }
    ]
}