{
    "term": "deviatory",
    "meanings": [
        {
            "definition": "Tending to deviate or depart from a usual or accepted course",
            "pos": "adjective",
            "sent1": "Her deviatory behavior often led her to explore new paths in the forest.",
            "sent2": "The deviatory route took us through the scenic countryside instead of the busy highway.",
            "sent3": "The cat's deviatory antics made everyone laugh as it chased its tail in circles.",
            "sent4": "His deviatory thinking opened up a world of possibilities beyond the norm.",
            "sent5": "The deviatory sunset painted the sky with vibrant colors, mesmerizing all who watched."
        },
        {
            "definition": "Serving to deviate or turn aside",
            "pos": "adjective",
            "sent1": "The deviatory sign pointed us towards the hidden waterfall off the main trail.",
            "sent2": "His deviatory actions diverted attention away from the main issue at hand.",
            "sent3": "The deviatory distraction of the squirrel caused the dog to lose track of the ball.",
            "sent4": "The deviatory roadblock forced us to find an alternate route to our destination.",
            "sent5": "Her deviatory explanation led us on a wild goose chase, away from the truth."
        },
        {
            "definition": "Characterized by deviation or departure",
            "pos": "adjective",
            "sent1": "The deviatory nature of the project allowed for creative thinking outside the box.",
            "sent2": "His deviatory speech veered off topic, captivating the audience with unexpected tales.",
            "sent3": "The deviatory plot twist in the movie caught everyone off guard, leaving them in awe.",
            "sent4": "The deviatory decision to change course brought about new opportunities for growth.",
            "sent5": "The deviatory behavior of the comet as it streaked across the sky left a lasting impression on all who witnessed it."
        }
    ]
}