{
    "term": "devoices",
    "meanings": [
        {
            "definition": "To deprive of voice or speech.",
            "pos": "verb",
            "sent1": "The cruel witch cast a spell to devoices the young girl, leaving her unable to speak.",
            "sent2": "The judge decided to devoices the defendant, silencing him in the courtroom.",
            "sent3": "The mischievous parrot devoices the entire neighborhood with its constant mimicry.",
            "sent4": "The eerie silence of the abandoned house devoices any sounds that dare to enter.",
            "sent5": "The heavy fog seemed to devoices all the usual sounds of the bustling city, creating an otherworldly atmosphere."
        },
        {
            "definition": "To remove or withdraw a voice or vote.",
            "pos": "verb",
            "sent1": "The strict teacher threatened to devoices the students who disrupted the class.",
            "sent2": "During the meeting, they decided to devoices the member who had conflicting opinions.",
            "sent3": "The mischievous raccoon managed to devoices the other animals in the forest council meeting.",
            "sent4": "The sudden storm seemed to devoices the voices of the protesters, drowning out their chants.",
            "sent5": "The power outage devoices the electronic voting system, causing chaos in the election process."
        },
        {
            "definition": "To alter the pitch or quality of a sound.",
            "pos": "verb",
            "sent1": "The musician used a pedal to devoices the guitar's tone, creating a unique sound.",
            "sent2": "The sound engineer had to devoices the microphone settings to reduce feedback.",
            "sent3": "The playful kitten seemed to devoices the usual meow into a high-pitched squeak.",
            "sent4": "As the sun set, the colors of the sky devoices into a beautiful array of pastels.",
            "sent5": "The magician's wand seemed to devoices the music into a haunting melody, captivating the audience."
        }
    ]
}