{
    "term": "devouter",
    "meanings": [
        {
            "definition": "More devoted or religious",
            "pos": "adjective",
            "sent1": "She is the devouter of the two sisters when it comes to attending church regularly.",
            "sent2": "The priest was known to be devouter than anyone in the village, always seen praying at the church.",
            "sent3": "The devouter nun in the convent was caught sneaking extra cookies from the kitchen.",
            "sent4": "His devotion to his faith was like a bright flame, burning devouter with each passing day.",
            "sent5": "The old man's wrinkled hands clasped the rosary beads, his eyes closed in a devouter prayer."
        },
        {
            "definition": "More earnest or sincere in feeling",
            "pos": "adjective",
            "sent1": "Her devouter apology touched the hearts of everyone present at the meeting.",
            "sent2": "The devouter expression on his face showed how much he truly cared about the cause.",
            "sent3": "The devouter look in his eyes made it hard to believe he was just acting in the play.",
            "sent4": "His devouter tone of voice resonated with honesty and genuine emotion.",
            "sent5": "The devouter smile on her face revealed the depth of her gratitude."
        },
        {
            "definition": "More dedicated or committed to a cause",
            "pos": "adjective",
            "sent1": "She was the devouter volunteer, always the first to arrive and the last to leave.",
            "sent2": "The devouter members of the team worked tirelessly to achieve their goal.",
            "sent3": "The devouter student in the class never missed a single assignment deadline.",
            "sent4": "His devouter attitude towards his job earned him the respect of his colleagues.",
            "sent5": "The devouter activists marched through the streets, chanting for change."
        }
    ]
}