{
    "term": "devolves",
    "meanings": [
        {
            "definition": "Transfer or delegate (power or responsibility) to a lower level, especially from central government to local or regional administration.",
            "pos": "verb",
            "sent1": "The mayor devolves some of his duties to the city council to help manage the town.",
            "sent2": "It is common for national governments to devolve certain powers to state governments.",
            "sent3": "The superhero devolves his crime-fighting responsibilities to his trusty sidekick.",
            "sent4": "As the CEO retired, he devolved his leadership role to his capable successor.",
            "sent5": "The teacher devolves the task of leading the class discussion to a student each week."
        },
        {
            "definition": "Pass on (property or rights) to a successor.",
            "pos": "verb",
            "sent1": "Before his passing, the grandfather devolves his antique watch to his grandson.",
            "sent2": "In his will, he devolves his vast estate to his only daughter.",
            "sent3": "The pirate captain jokingly devolves his treasure map to the parrot.",
            "sent4": "The retiring professor devolves his research projects to his eager young colleague.",
            "sent5": "The retiring king devolves his crown to his eldest son, the prince."
        },
        {
            "definition": "Deteriorate or degenerate.",
            "pos": "verb",
            "sent1": "Over time, the old building devolves into a state of disrepair.",
            "sent2": "If left unattended, the garden will slowly devolve into a wild tangle of weeds.",
            "sent3": "The once grand mansion devolves into a haunted house in the spooky Halloween story.",
            "sent4": "Without proper maintenance, the machinery will devolve into a useless pile of metal.",
            "sent5": "Neglecting regular exercise can cause your health to devolve over time."
        }
    ]
}