{
    "term": "dexie",
    "meanings": [
        {
            "definition": "A person who is addicted to dextroamphetamine or other stimulant drugs.",
            "pos": "noun",
            "sent1": "The dexie struggled with their addiction to stimulant drugs.",
            "sent2": "The doctor helped the dexie overcome their addiction to stimulants.",
            "sent3": "The dexie joked that they were powered by energy drinks, like a real-life superhero.",
            "sent4": "Her energy was like that of a dexie, always on the go and full of vigor.",
            "sent5": "The dexie's constant need for stimulants was like a never-ending race against fatigue."
        },
        {
            "definition": "A type of amphetamine-based medication used to treat attention deficit hyperactivity disorder (ADHD).",
            "pos": "noun",
            "sent1": "The doctor prescribed a dexie to help manage the child's ADHD.",
            "sent2": "She took her daily dexie to help her focus in school.",
            "sent3": "The classroom was filled with dexies, each helping students concentrate better.",
            "sent4": "The dexie was like a magic pill, bringing clarity and focus to those who needed it.",
            "sent5": "Taking a dexie was like turning on a light switch in her brain, suddenly everything became clear."
        },
        {
            "definition": "A brand name for a type of digital audio player.",
            "pos": "noun",
            "sent1": "He listened to his favorite songs on his dexie while jogging.",
            "sent2": "The dexie was small and portable, perfect for music on the go.",
            "sent3": "She accidentally dropped her dexie in the pool, now it's a waterproof music player!",
            "sent4": "The dexie was like a tiny orchestra in his pocket, playing music wherever he went.",
            "sent5": "The sound quality of the dexie was so clear, it felt like the music was right next to him."
        }
    ]
}