{
    "term": "dextroamphetamines",
    "meanings": [
        {
            "definition": "A type of stimulant medication used to treat attention deficit hyperactivity disorder (ADHD) and narcolepsy.",
            "pos": "noun",
            "sent1": "The doctor prescribed dextroamphetamines to help the child focus in school.",
            "sent2": "Many students with ADHD find relief through dextroamphetamines.",
            "sent3": "The dextroamphetamines turned the sleepy student into a focused superhero during exams.",
            "sent4": "Her study session was like a rocket launch after taking dextroamphetamines.",
            "sent5": "The effects of dextroamphetamines were like turning on a bright light in a dim room."
        },
        {
            "definition": "The generic name for drugs such as Adderall and Dexedrine.",
            "pos": "noun",
            "sent1": "Some people refer to Adderall and Dexedrine as dextroamphetamines.",
            "sent2": "The pharmacist explained that Adderall falls under the category of dextroamphetamines.",
            "sent3": "The party was buzzing with energy, fueled by dextroamphetamines in the form of Adderall.",
            "sent4": "His brain felt like a race car on the track after taking dextroamphetamines like Dexedrine.",
            "sent5": "The label on the bottle warned of the powerful effects of dextroamphetamines like Adderall."
        },
        {
            "definition": "A substance that increases alertness and concentration.",
            "pos": "noun",
            "sent1": "Athletes sometimes misuse dextroamphetamines to enhance their performance.",
            "sent2": "The night shift workers relied on dextroamphetamines to stay awake and focused.",
            "sent3": "The cat chasing a laser pointer was like a person on dextroamphetamines chasing productivity.",
            "sent4": "Her mind felt like a clear blue sky after taking dextroamphetamines for the first time.",
            "sent5": "The effects of dextroamphetamines were like a strong cup of coffee, but with a longer-lasting kick."
        }
    ]
}