{
    "term": "dhikrs",
    "meanings": [
        {
            "definition": "The act of remembering or mentioning Allah.",
            "pos": "noun",
            "sent1": "During their daily dhikrs, the family would gather to pray and reflect on Allah's teachings.",
            "sent2": "Muslims engage in dhikrs to strengthen their connection with Allah through remembrance and prayer.",
            "sent3": "As the children played, their laughter filled the room with a sense of dhikrs, reminding everyone of the joy in Allah's presence.",
            "sent4": "The sound of the waves crashing against the shore was like a soothing dhikrs, a constant reminder of Allah's power and grace.",
            "sent5": "The old man's wrinkled hands moved gracefully as he performed his dhikrs, each movement a testament to his devotion to Allah."
        },
        {
            "definition": "A form of prayer or devotion in Islam involving the repetition of phrases or prayers.",
            "pos": "noun",
            "sent1": "The mosque echoed with the melodious dhikrs of the worshippers, creating a peaceful atmosphere of devotion.",
            "sent2": "During Ramadan, Muslims often engage in extra dhikrs to seek spiritual closeness to Allah through prayer.",
            "sent3": "The rhythmic chanting of the dhikrs filled the air, creating a serene ambiance of prayer and reflection.",
            "sent4": "Her voice rose in a crescendo of dhikrs, each word a heartfelt prayer for peace and guidance.",
            "sent5": "The room was filled with the sweet scent of incense, enhancing the atmosphere of dhikrs and spiritual connection."
        },
        {
            "definition": "Plural form of dhikr, a type of Islamic prayer or meditation.",
            "pos": "noun",
            "sent1": "The shelves were lined with books on various dhikrs, each offering a unique perspective on Islamic meditation.",
            "sent2": "In the quiet of the night, the soft murmur of the dhikrs filled the room, bringing a sense of calm and peace.",
            "sent3": "The children giggled as they tried to mimic the adults' solemn dhikrs, turning the prayer into a playful game.",
            "sent4": "The garden was a sanctuary of dhikrs, with each flower and tree whispering a prayer of gratitude to Allah.",
            "sent5": "The calligraphy on the wall depicted intricate dhikrs, a visual representation of the beauty and depth of Islamic meditation."
        }
    ]
}