{
    "term": "diabolizes",
    "meanings": [
        {
            "definition": "To turn into a devil or evil spirit.",
            "pos": "verb",
            "sent1": "The wicked witch diabolizes the innocent villagers in the fairy tale.",
            "sent2": "The curse slowly diabolizes the once kind prince into a malevolent being.",
            "sent3": "The mischievous cat diabolizes the peaceful garden by knocking over all the flower pots.",
            "sent4": "The darkness of the night diabolizes the familiar streets into a sinister maze.",
            "sent5": "The haunting melody diabolizes the atmosphere, sending shivers down everyone's spines."
        },
        {
            "definition": "To act as a devil or evil spirit.",
            "pos": "verb",
            "sent1": "The villain diabolizes the hero's every move, making it hard for them to succeed.",
            "sent2": "The possessed doll diabolizes the household, causing chaos wherever it goes.",
            "sent3": "The mischievous imp diabolizes the birthday party by playing pranks on all the guests.",
            "sent4": "The storm's fury diabolizes the calm sea, creating massive waves and destruction.",
            "sent5": "The dark thoughts diabolize his mind, leading him down a path of negativity and despair."
        },
        {
            "definition": "To represent or depict as evil or devilish.",
            "pos": "verb",
            "sent1": "The artist diabolizes the antagonist in the painting, capturing their sinister essence.",
            "sent2": "The media often diabolizes certain groups, portraying them as villains in the public eye.",
            "sent3": "The mischievous child diabolizes the family dog in their imaginative stories.",
            "sent4": "The shadows in the room diabolize the ordinary objects, turning them into eerie shapes.",
            "sent5": "The author's words diabolize the character, making them the embodiment of pure evil in the story."
        }
    ]
}