{
    "term": "diablery",
    "meanings": [
        {
            "definition": "The action or practice of witchcraft or sorcery.",
            "pos": "noun",
            "sent1": "The village was filled with tales of diablery, with witches casting spells in the dark.",
            "sent2": "The book described ancient rituals of diablery performed by mysterious figures.",
            "sent3": "The children giggled as they pretended to engage in diablery by waving sticks like wands.",
            "sent4": "Her performance on stage was like diablery, casting a spell on the audience with her words.",
            "sent5": "The forest at night seemed to hold secrets of diablery, with shadows dancing eerily."
        },
        {
            "definition": "Mischievous or wicked behavior.",
            "pos": "noun",
            "sent1": "His eyes sparkled with diablery as he played a prank on his friend.",
            "sent2": "The cat's playful diablery often resulted in overturned flower pots and spilled milk.",
            "sent3": "The mischievous puppy's diablery included stealing socks and hiding them under the bed.",
            "sent4": "Her smile held a hint of diablery, making others wonder what mischief she was planning.",
            "sent5": "The children's laughter echoed through the house, filled with the joy of innocent diablery."
        },
        {
            "definition": "The use of trickery or deception.",
            "pos": "noun",
            "sent1": "The con artist's diablery fooled many into giving him their money.",
            "sent2": "The magician's performance was filled with diablery, leaving the audience in awe.",
            "sent3": "The detective unraveled the criminal's diablery, exposing the truth behind the facade.",
            "sent4": "Her smile held a touch of diablery, hinting at a hidden agenda beneath her friendly demeanor.",
            "sent5": "The mirror reflected her eyes, revealing a glint of diablery as she plotted her next move."
        }
    ]
}