{
    "term": "diabolism",
    "meanings": [
        {
            "definition": "The belief in or worship of devils or demons.",
            "pos": "noun",
            "sent1": "Some people in ancient times were accused of diabolism for their beliefs in evil spirits.",
            "sent2": "The village was known for its history of diabolism, with tales of dark rituals and sacrifices.",
            "sent3": "At the costume party, Sarah's diabolism-themed outfit was a hit among her friends.",
            "sent4": "The diabolism in the movie was so convincing that it gave me chills.",
            "sent5": "The old book was filled with detailed descriptions of diabolism, making it a fascinating read."
        },
        {
            "definition": "The practice of witchcraft or sorcery.",
            "pos": "noun",
            "sent1": "In some cultures, diabolism is seen as a way to harness supernatural powers.",
            "sent2": "Legends speak of witches and wizards who delved into the dark arts of diabolism.",
            "sent3": "The children giggled as they pretended to cast spells and practice diabolism in the backyard.",
            "sent4": "Her potion-making skills were so advanced, it was like she had mastered the art of diabolism.",
            "sent5": "The forest was rumored to be a place where diabolism thrived under the moonlight."
        },
        {
            "definition": "The quality of being devilish or wicked.",
            "pos": "noun",
            "sent1": "His mischievous grin hinted at a touch of diabolism in his personality.",
            "sent2": "The villain's eyes gleamed with a hint of diabolism as he plotted his next evil deed.",
            "sent3": "The cat's playful antics had a touch of diabolism, making it both endearing and mischievous.",
            "sent4": "The stormy sky mirrored the diabolism in his heart as he sought revenge.",
            "sent5": "The painting captured the essence of diabolism with its dark colors and sinister figures."
        }
    ]
}