{
    "term": "diabolists",
    "meanings": [
        {
            "definition": "A person who practices diabolism or devil worship.",
            "pos": "noun",
            "sent1": "The town was shocked to discover a group of diabolists performing rituals in the abandoned church.",
            "sent2": "The diabolists gathered at midnight to summon dark forces from the underworld.",
            "sent3": "The diabolists tried to cast a spell on their teacher, but it backfired and turned him into a frog!",
            "sent4": "The forest was rumored to be haunted by the spirits of ancient diabolists, their presence felt in every shadow.",
            "sent5": "The old book contained forbidden knowledge passed down through generations of diabolists."
        },
        {
            "definition": "Belonging to or characteristic of diabolists.",
            "pos": "adjective",
            "sent1": "The eerie symbols carved into the tree were a sign of diabolists marking their territory.",
            "sent2": "The dark cloak worn by the figure in the painting gave off a diabolists vibe.",
            "sent3": "The cat's mischievous behavior made it seem like a diabolists pet plotting world domination.",
            "sent4": "The abandoned mansion had an atmosphere that felt diabolists, as if evil deeds had been committed within its walls.",
            "sent5": "The mysterious potion emitted a diabolists aura, warning all who approached to stay away."
        },
        {
            "definition": "Involving or relating to diabolists.",
            "pos": "adjective",
            "sent1": "The ancient tome contained secrets of diabolists practices passed down through generations.",
            "sent2": "The town's dark history was filled with tales of diabolists and their sinister deeds.",
            "sent3": "The Halloween decorations gave the party a diabolists touch, with fake cobwebs and eerie music.",
            "sent4": "The stormy night had an atmosphere that felt diabolists, as if the spirits of the damned were watching.",
            "sent5": "The mysterious stranger had a gaze that seemed diabolists, sending shivers down the spine of all who met him."
        }
    ]
}