{
    "term": "diabolize",
    "meanings": [
        {
            "definition": "To portray or represent as diabolic or evil.",
            "pos": "verb",
            "sent1": "In the movie, the villain tried to diabolize the hero by spreading lies about him.",
            "sent2": "The tabloids often diabolize celebrities to sell more copies.",
            "sent3": "The gossip columnist loved to diabolize the local baker, claiming he used cursed ingredients.",
            "sent4": "Her angry words seemed to diabolize the air around her, making everyone uncomfortable.",
            "sent5": "The artist's dark paintings diabolized the beauty of nature, creating a haunting effect."
        },
        {
            "definition": "To speak evil of; slander; defame.",
            "pos": "verb",
            "sent1": "Some people enjoy diabolizing others to make themselves feel superior.",
            "sent2": "It is not right to diabolize someone just because they have a different opinion.",
            "sent3": "The jealous neighbor would often diabolize the old lady who lived next door.",
            "sent4": "Her words seemed to diabolize his reputation, turning friends against him.",
            "sent5": "The politician's opponents tried to diabolize his character with false accusations."
        },
        {
            "definition": "To act as a devil; play the devil.",
            "pos": "verb",
            "sent1": "During the play, the actor had to diabolize the character of the devil with convincing evil laughter.",
            "sent2": "The children loved to diabolize during Halloween, pretending to be spooky creatures.",
            "sent3": "The mischievous kitten seemed to diabolize the household, causing chaos wherever it went.",
            "sent4": "His mischievous grin made him look like he was ready to diabolize the whole party.",
            "sent5": "The comedian's performance made him diabolize as a playful devil, entertaining the audience."
        }
    ]
}