{
    "term": "diablerie",
    "meanings": [
        {
            "definition": "Sorcery or black magic",
            "pos": "noun",
            "sent1": "The villagers whispered about the diablerie practiced by the old witch.",
            "sent2": "Legends speak of ancient sorcerers using diablerie to control the elements.",
            "sent3": "The children giggled, pretending to cast spells of diablerie on each other.",
            "sent4": "Her eyes held a mysterious glint, as if she possessed the power of diablerie.",
            "sent5": "In the dark forest, the shadows seemed to dance with diablerie, creating an eerie atmosphere."
        },
        {
            "definition": "Mischievous or devilish behavior",
            "pos": "noun",
            "sent1": "The cat's playful diablerie often resulted in overturned vases and scattered papers.",
            "sent2": "Despite his innocent appearance, his eyes twinkled with hints of mischievous diablerie.",
            "sent3": "The puppy's diablerie included stealing socks and hiding them under the bed.",
            "sent4": "Her brother's diablerie knew no bounds, always finding new ways to prank their parents.",
            "sent5": "The mischievous imp in the story was known for his clever diablerie that caused chaos in the kingdom."
        },
        {
            "definition": "A representation of the devil, as in art or literature.",
            "pos": "noun",
            "sent1": "The painting depicted a menacing diablerie with horns and a tail.",
            "sent2": "In medieval manuscripts, artists often included diablerie to symbolize evil.",
            "sent3": "The cartoon character's costume for Halloween was complete with a diablerie mask.",
            "sent4": "The author's vivid description brought to life the diablerie lurking in the shadows.",
            "sent5": "The sculpture in the museum captured the essence of diablerie with its twisted features and sinister grin."
        }
    ]
}