{
    "term": "diapirs",
    "meanings": [
        {
            "definition": "A mass of rock that has moved upward through overlying rock layers",
            "pos": "noun",
            "sent1": "The geologists studied the diapirs that had pushed through the layers of rock.",
            "sent2": "The diapirs in the earth's crust can create unique geological formations.",
            "sent3": "The diapirs seemed to be playing a game of 'rock, paper, scissors' with the layers above.",
            "sent4": "The diapirs rose like mighty mountains from the depths of the earth.",
            "sent5": "The sudden appearance of the diapirs startled the researchers, revealing the earth's hidden movements."
        },
        {
            "definition": "The process of diapirism, in which rock moves upward through overlying layers",
            "pos": "noun",
            "sent1": "Diapirism is a natural phenomenon where rock slowly rises through layers above.",
            "sent2": "The study of diapirism helps us understand the earth's dynamic processes.",
            "sent3": "The diapirism of the rocks seemed like a slow-motion dance in the earth's crust.",
            "sent4": "The concept of diapirism can be compared to a gentle push from below.",
            "sent5": "The diapirism of the rocks was a reminder of the earth's constant changes and movements."
        },
        {
            "definition": "To diapir: the act of forming or moving as a diapir",
            "pos": "verb",
            "sent1": "The rocks diapirred slowly, reshaping the landscape over time.",
            "sent2": "We observed the rocks diapiring upwards, changing the layers above.",
            "sent3": "The rocks seemed to diapir with a sense of purpose, defying gravity.",
            "sent4": "The earth's movements diapirred the rocks like a gentle breath of change.",
            "sent5": "The process of diapiring rocks can create fascinating geological features."
        }
    ]
}