{
    "term": "dibbukim",
    "meanings": [
        {
            "definition": "Dibbukim: plural form of dibbuk",
            "pos": "noun",
            "sent1": "The village was haunted by dibbukim, spirits that roamed the streets at night.",
            "sent2": "The dibbukim were said to be trapped souls seeking refuge in the living.",
            "sent3": "The mischievous dibbukim played pranks on unsuspecting villagers, causing chaos.",
            "sent4": "The dibbukim were like shadows, lingering in the corners of the old synagogue.",
            "sent5": "The legend of the dibbukim spread fear throughout the countryside."
        },
        {
            "definition": "Dibbukim: a malevolent spirit in Jewish folklore",
            "pos": "noun",
            "sent1": "The old house was said to be haunted by dibbukim, causing fear among the townspeople.",
            "sent2": "According to legend, the dibbukim would possess those who dared to enter the abandoned cemetery.",
            "sent3": "The mischievous dibbukim would hide objects just to watch people search frantically for them.",
            "sent4": "The presence of the dibbukim was felt as a chill in the air, sending shivers down the spine.",
            "sent5": "The malevolent dibbukim whispered dark secrets in the dead of night."
        },
        {
            "definition": "Dibbukim: possessing spirits in Jewish mysticism",
            "pos": "noun",
            "sent1": "The rabbi performed a ritual to banish the dibbukim from the tormented soul.",
            "sent2": "The presence of the dibbukim was felt as a heavy weight on the afflicted person's chest.",
            "sent3": "The mischievous dibbukim would make the furniture move on its own, causing confusion.",
            "sent4": "The dibbukim were like invisible chains, binding the soul to the earthly realm.",
            "sent5": "The mysterious dibbukim whispered ancient incantations in the ears of the possessed."
        }
    ]
}