{
    "term": "dicking",
    "meanings": [
        {
            "definition": "To treat someone unfairly or harshly.",
            "pos": "verb",
            "sent1": "He was dicking his friend by not sharing the toys.",
            "sent2": "The boss was dicking the employees by making them work overtime without pay.",
            "sent3": "The teacher was dicking the students by giving pop quizzes every day.",
            "sent4": "The referee was dicking the visiting team with biased calls.",
            "sent5": "The bully was dicking the younger kids by taking their lunch money every day."
        },
        {
            "definition": "To engage in sexual activity with someone.",
            "pos": "verb",
            "sent1": "They were dicking in the bedroom all night.",
            "sent2": "The couple was dicking in the park, unaware of the onlookers.",
            "sent3": "The movie characters were dicking in every scene, making it awkward to watch.",
            "sent4": "The teenagers were dicking behind the school, thinking they were being sneaky.",
            "sent5": "The animals were dicking in the zoo, much to the amusement of the visitors."
        },
        {
            "definition": "To waste time or fool around.",
            "pos": "verb",
            "sent1": "Stop dicking around and finish your homework.",
            "sent2": "They were dicking around instead of studying for the test.",
            "sent3": "The siblings were dicking around in the backyard, playing tag.",
            "sent4": "The friends were dicking around at the mall, trying on silly hats.",
            "sent5": "The employees were dicking around at work, pretending to be busy."
        },
        {
            "definition": "A slang term for the male genitalia.",
            "pos": "noun",
            "sent1": "He got hit in the dicking during the soccer game.",
            "sent2": "The comedian made a joke about the dicking in his stand-up routine.",
            "sent3": "The kids giggled when they heard the word dicking in class.",
            "sent4": "The doctor asked the patient if he had any issues with his dicking.",
            "sent5": "The artist drew a funny cartoon character with a big dicking."
        }
    ]
}