{
    "term": "dickey",
    "meanings": [
        {
            "definition": "A detachable shirt front.",
            "pos": "noun",
            "sent1": "He wore a dickey to make his shirt look fancier.",
            "sent2": "The dickey added a touch of elegance to his outfit.",
            "sent3": "The dickey flew off in the wind, making him chase after it comically.",
            "sent4": "Her dickey was like a shield, hiding the coffee stain on her real shirt.",
            "sent5": "The dickey, a fake shirt front, fooled everyone at the party."
        },
        {
            "definition": "A small bird.",
            "pos": "noun",
            "sent1": "The dickey chirped cheerfully in the tree.",
            "sent2": "I spotted a colorful dickey hopping around the garden.",
            "sent3": "The dickey stole a crumb from the picnic, causing laughter among the children.",
            "sent4": "Her singing voice was as sweet as a dickey's melody.",
            "sent5": "The dickey's feathers shimmered in the sunlight, a tiny marvel of nature."
        },
        {
            "definition": "A horse-drawn carriage.",
            "pos": "noun",
            "sent1": "The dickey rattled as the carriage moved along the cobblestone street.",
            "sent2": "They took a romantic ride in the dickey through the countryside.",
            "sent3": "The dickey carriage driver tipped his hat to passersby with a grin.",
            "sent4": "The dickey carried them swiftly, like a magic carpet through the city.",
            "sent5": "The dickey's wheels spun gracefully, carrying them to their destination."
        },
        {
            "definition": "A false shirt front.",
            "pos": "noun",
            "sent1": "His dickey was so well-made that no one could tell it wasn't part of his shirt.",
            "sent2": "She chuckled as she saw his dickey slipping down, revealing his real shirt.",
            "sent3": "The dickey fooled the tailor, who thought it was part of the shirt.",
            "sent4": "The dickey was like a secret weapon, hiding any spills or stains on his shirt.",
            "sent5": "The dickey, a clever disguise, made him look more put-together than he really was."
        }
    ]
}