{
    "term": "diclinous",
    "meanings": [
        {
            "definition": "Having staminate and pistillate flowers on separate plants.",
            "pos": "adjective",
            "sent1": "The diclinous plants in the garden have either male or female flowers, not both.",
            "sent2": "Diclinous species ensure cross-pollination by having distinct male and female plants.",
            "sent3": "The diclinous garden was like a divided community, with male and female plants living separately.",
            "sent4": "In the world of diclinous plants, each gender has its own space and purpose.",
            "sent5": "The concept of diclinous plants is like nature's way of promoting diversity and specialization."
        },
        {
            "definition": "Having male and female reproductive organs on separate individuals.",
            "pos": "adjective",
            "sent1": "Diclinous organisms require both male and female individuals for reproduction.",
            "sent2": "The diclinous species exhibit distinct genders, each with specific reproductive roles.",
            "sent3": "It's fascinating how diclinous creatures need a partner of the opposite sex to reproduce.",
            "sent4": "The idea of diclinous beings highlights the importance of cooperation between genders.",
            "sent5": "The survival of diclinous organisms depends on the collaboration between male and female individuals."
        },
        {
            "definition": "Having unisexual flowers.",
            "pos": "adjective",
            "sent1": "Diclinous plants produce flowers that are either male or female.",
            "sent2": "The diclinous blooms of this plant are either male or female, not both.",
            "sent3": "It's amusing how diclinous flowers seem to have their own gender preferences.",
            "sent4": "The diclinous flowers stand out like tiny symbols of gender diversity in nature.",
            "sent5": "The beauty of diclinous flowers lies in their unique and separate male and female blossoms."
        }
    ]
}