{
    "term": "dicliny",
    "meanings": [
        {
            "definition": "The condition of having separate male and female reproductive organs on different individuals.",
            "pos": "noun",
            "sent1": "Dicliny is when one plant has male flowers and another has female flowers.",
            "sent2": "In nature, dicliny ensures cross-pollination between different individuals.",
            "sent3": "At the garden party, dicliny caused confusion as the male flowers danced with each other and the female flowers chatted in a corner.",
            "sent4": "Dicliny in the plant kingdom is like having a neighborhood where only certain houses have mailboxes.",
            "sent5": "The concept of dicliny can be visualized as a dance where partners are chosen from separate groups."
        },
        {
            "definition": "The state of being unisexual.",
            "pos": "noun",
            "sent1": "Dicliny means an organism has either male or female reproductive organs, not both.",
            "sent2": "Some plants exhibit dicliny, meaning they are either male or female.",
            "sent3": "The dicliny of the flowers made it impossible for them to reproduce without outside help.",
            "sent4": "In a world of dicliny, each individual plays a specific role in reproduction.",
            "sent5": "The simplicity of dicliny makes it easier to understand the reproductive process."
        },
        {
            "definition": "The separation of male and female reproductive organs on different plants.",
            "pos": "noun",
            "sent1": "Dicliny ensures that pollen from one plant reaches the female flowers of another plant.",
            "sent2": "Plants with dicliny rely on external agents for pollination to occur.",
            "sent3": "The dicliny of the garden caused the bees to work extra hard to pollinate the flowers.",
            "sent4": "Dicliny is like a long-distance relationship between plants, with pollen as the messenger.",
            "sent5": "The beauty of dicliny lies in the intricate dance of nature's reproductive cycle."
        }
    ]
}