{
    "term": "dictations",
    "meanings": [
        {
            "definition": "The act of speaking words for someone else to write down.",
            "pos": "noun",
            "sent1": "During the dictations, the teacher read the story out loud for the students to write.",
            "sent2": "The secretary took dictations from the boss to type up important documents.",
            "sent3": "In a funny twist, the parrot started giving dictations to the owner, pretending to be the boss.",
            "sent4": "Her gestures were like dictations to the audience, guiding them through the dance.",
            "sent5": "The dictator's dictations were so strict, they left no room for interpretation."
        },
        {
            "definition": "The act of giving orders or commands.",
            "pos": "noun",
            "sent1": "The general's dictations were followed without question by the soldiers.",
            "sent2": "The manager's dictations were clear and precise, ensuring everyone knew what to do.",
            "sent3": "The cat seemed to think it was in charge, giving dictations to the other pets in the house.",
            "sent4": "The wind's dictations rustled the leaves, creating a symphony of nature.",
            "sent5": "The dictator's dictations were so strict, they left no room for interpretation."
        },
        {
            "definition": "The act of saying or reading something aloud for someone else to write down.",
            "pos": "noun",
            "sent1": "The student's dictations were transcribed by the scribe during the lecture.",
            "sent2": "The author's dictations were recorded by the assistant to ensure accuracy in the manuscript.",
            "sent3": "The parrot amused everyone by giving dictations in the voice of the teacher.",
            "sent4": "The thunder's dictations echoed through the valley, making it hard to concentrate.",
            "sent5": "The dictator's dictations were so strict, they left no room for interpretation."
        }
    ]
}