{
    "term": "die",
    "meanings": [
        {
            "definition": "To stop living",
            "pos": "verb",
            "sent1": "My pet fish will die if I forget to feed it.",
            "sent2": "People die when their bodies stop working.",
            "sent3": "I told my plant not to die on me, but it did anyway.",
            "sent4": "The fire's flames slowly die out as the wood turns to ash.",
            "sent5": "The old man's wish was to die peacefully in his sleep."
        },
        {
            "definition": "A small cube with numbers or symbols on each side, used in games of chance",
            "pos": "noun",
            "sent1": "Roll the die and see what number comes up.",
            "sent2": "In board games, players often use a die to determine their moves.",
            "sent3": "The colorful die bounced off the table and onto the floor.",
            "sent4": "The outcome of the game depended on the roll of the die.",
            "sent5": "The casino dealer handed out the die for the next round of the game."
        },
        {
            "definition": "A tool used for shaping or cutting material",
            "pos": "noun",
            "sent1": "The carpenter used a die to create precise cuts in the wood.",
            "sent2": "A metal die is essential for making consistent shapes in manufacturing.",
            "sent3": "The sculptor's favorite die was perfect for sculpting intricate details.",
            "sent4": "The tailor selected the appropriate die to cut the fabric for the dress.",
            "sent5": "The jeweler carefully chose a die to shape the silver into a beautiful pendant."
        },
        {
            "definition": "To become less intense or fade away",
            "pos": "verb",
            "sent1": "The music will slowly die down as the party comes to an end.",
            "sent2": "After the storm, the wind will die away, and the sky will clear.",
            "sent3": "The laughter from the comedy show began to die off as the audience left.",
            "sent4": "Her excitement started to die out as she realized the truth.",
            "sent5": "The colors of the sunset will die out, leaving behind a dark sky."
        }
    ]
}