{
    "term": "diffract",
    "meanings": [
        {
            "definition": "To cause a beam of light to spread out into a spectrum of colors.",
            "pos": "verb",
            "sent1": "When you shine a light through a prism, it can diffract into a rainbow.",
            "sent2": "The sunlight diffracted beautifully through the crystal, creating a colorful display.",
            "sent3": "The mischievous fairy used a crystal to diffract the sunlight and paint rainbows on the walls.",
            "sent4": "Her laughter diffracted through the room, filling it with joy and light.",
            "sent5": "The magician's wand seemed to diffract the light, casting a magical glow around him."
        },
        {
            "definition": "To alter the direction of a wave of light, sound, or other energy as it passes around an obstacle or through an opening.",
            "pos": "verb",
            "sent1": "The sound waves diffracted around the corner, reaching our ears unexpectedly.",
            "sent2": "The flashlight's beam diffracted when it hit the mirror, illuminating the room from a different angle.",
            "sent3": "The mischievous cat tried to diffract the laser pointer beam, chasing it around the room.",
            "sent4": "Her words seemed to diffract through the tension, bringing a sense of calm to the situation.",
            "sent5": "The music diffracted through the hall, filling every corner with its melody."
        },
        {
            "definition": "To undergo diffraction.",
            "pos": "verb",
            "sent1": "The light appeared to diffract as it passed through the narrow slit.",
            "sent2": "The sound seemed to diffract as it traveled through the tunnel, creating an echo effect.",
            "sent3": "The cat's meow seemed to diffract in the empty room, making it sound like there were many cats.",
            "sent4": "Her thoughts seemed to diffract in her mind, leading to new creative ideas.",
            "sent5": "The emotions in the room seemed to diffract, creating a complex atmosphere."
        }
    ]
}