{
    "term": "diffracting",
    "meanings": [
        {
            "definition": "To cause a beam of light to change direction when it encounters an obstacle or passes through a narrow opening.",
            "pos": "verb",
            "sent1": "The prism was diffracting the sunlight into beautiful colors.",
            "sent2": "The glass marble diffracting the sunlight made a rainbow on the wall.",
            "sent3": "The mischievous cat enjoyed diffracting the laser pointer all around the room.",
            "sent4": "Her smile diffracted the gloomy atmosphere in the room, bringing warmth to everyone.",
            "sent5": "The magician's wand seemed to be diffracting the light, creating a mesmerizing illusion."
        },
        {
            "definition": "To undergo diffraction.",
            "pos": "verb",
            "sent1": "The light diffracting through the crystal created a dazzling effect.",
            "sent2": "The sound waves diffracting around the corner were muffled.",
            "sent3": "The little bird seemed to be diffracting through the dense foliage.",
            "sent4": "Her voice diffracted in the vast hall, echoing softly.",
            "sent5": "The car's headlights diffracted in the fog, creating a halo effect."
        },
        {
            "definition": "The process by which a beam of light is spread out as a result of passing through a narrow opening or encountering an obstacle.",
            "pos": "noun",
            "sent1": "The photographer captured the beautiful diffracting of light through the keyhole.",
            "sent2": "The scientist explained the concept of diffracting using a simple experiment.",
            "sent3": "The children were amazed by the diffracting of light through the prism.",
            "sent4": "The city skyline was a stunning display of diffracting as the sun set behind the buildings.",
            "sent5": "The artist used diffracting as inspiration for her latest painting, creating a unique play of colors."
        }
    ]
}