{
    "term": "dig",
    "meanings": [
        {
            "definition": "To break up, turn over, or remove earth, sand, etc., with a tool or machine",
            "pos": "verb",
            "sent1": "I dig in the garden to plant flowers.",
            "sent2": "The farmer used a shovel to dig a hole for the tree.",
            "sent3": "The dog tried to dig up buried treasure in the backyard.",
            "sent4": "Her words seemed to dig deep into his heart.",
            "sent5": "The excavator's bucket could dig through the toughest soil."
        },
        {
            "definition": "To like, enjoy, or appreciate something",
            "pos": "verb",
            "sent1": "I dig listening to music while I work.",
            "sent2": "She really digs the new painting in the art gallery.",
            "sent3": "Kids always dig the idea of having ice cream for dinner.",
            "sent4": "His friends dig his sense of humor at parties.",
            "sent5": "I dig the feeling of sunshine on my face during a picnic."
        },
        {
            "definition": "To search for information or facts about someone or something",
            "pos": "verb",
            "sent1": "I dig online to find reviews before buying a product.",
            "sent2": "Detectives dig for clues to solve mysteries.",
            "sent3": "The students dig through books to prepare for the exam.",
            "sent4": "Journalists dig deep to uncover the truth behind the story.",
            "sent5": "Archaeologists dig carefully to unearth ancient artifacts."
        },
        {
            "definition": "To push or poke something into a place or position",
            "pos": "verb",
            "sent1": "She used a stick to dig a hole in the sand.",
            "sent2": "The child tried to dig his toy car into the soft clay.",
            "sent3": "He tried to dig the key into the lock but it was stuck.",
            "sent4": "The squirrel tried to dig the acorn into the ground for safekeeping.",
            "sent5": "The worker used a hammer to dig the nail into the wood."
        }
    ]
}