{
    "term": "digging",
    "meanings": [
        {
            "definition": "To break up, turn over, or remove earth, sand, etc., as with a shovel, spade, bulldozer, or claw; make an excavation.",
            "pos": "verb",
            "sent1": "She enjoys digging in the garden to plant flowers.",
            "sent2": "The construction workers were digging a hole for the new building's foundation.",
            "sent3": "The dog started digging in the sand at the beach, looking for buried treasure.",
            "sent4": "Her curiosity was like a shovel, constantly digging for answers.",
            "sent5": "The archaeologist's passion for digging up ancient artifacts was unmatched."
        },
        {
            "definition": "To make one's way or work by or as by removing or turning over material.",
            "pos": "verb",
            "sent1": "The mole was digging tunnels underground to find food.",
            "sent2": "The chef was digging through the pantry to find the right ingredients for the recipe.",
            "sent3": "The squirrel was digging through the pile of nuts to find its favorite one.",
            "sent4": "Her determination was like a shovel, digging through obstacles to reach her goal.",
            "sent5": "The detective was digging through old files to solve the mystery."
        },
        {
            "definition": "To discover or bring to light by search or effort.",
            "pos": "verb",
            "sent1": "She was digging through the old boxes in the attic and found a hidden treasure map.",
            "sent2": "The journalist was digging for information to uncover the truth behind the scandal.",
            "sent3": "The kids were digging through the pile of toys to find their favorite ones.",
            "sent4": "Her persistence was like a shovel, digging through layers of deception to reveal the truth.",
            "sent5": "The explorer was digging through the dense jungle to find the lost city."
        }
    ]
}