{
    "term": "dikes",
    "meanings": [
        {
            "definition": "A long wall or embankment built to prevent flooding.",
            "pos": "noun",
            "sent1": "The dikes along the river protected the town from getting flooded.",
            "sent2": "The farmers built dikes to stop the water from overflowing onto their fields.",
            "sent3": "The mischievous ducks played on the dikes, pretending to be kings of the land.",
            "sent4": "Her determination was like a sturdy dike, holding back the flood of doubts in her mind.",
            "sent5": "The dikes stood tall and strong, like guardians against the raging waters."
        },
        {
            "definition": "A ditch or trench used for drainage.",
            "pos": "noun",
            "sent1": "The workers dug deep dikes to channel the rainwater away from the road.",
            "sent2": "After the heavy rain, the dikes helped prevent the fields from turning into swamps.",
            "sent3": "The mischievous kids raced paper boats in the dikes, causing a mini traffic jam.",
            "sent4": "Her mind was like a network of interconnected dikes, guiding thoughts in the right direction.",
            "sent5": "The dikes snaked through the landscape, silently carrying away excess water."
        },
        {
            "definition": "A barrier constructed to hold back water.",
            "pos": "noun",
            "sent1": "The beavers diligently built dikes using branches and mud to create their own pond.",
            "sent2": "The ancient civilization's dikes were a marvel of engineering, protecting their city from floods.",
            "sent3": "The playful otters used the dikes as slides, much to the amusement of onlookers.",
            "sent4": "Her smile was a dike against the flood of tears threatening to overflow.",
            "sent5": "The dikes glistened in the sunlight, a shimmering line of defense against the water's advance."
        }
    ]
}