{
    "term": "dimensionally",
    "meanings": [
        {
            "definition": "In terms of dimensions or measurements.",
            "pos": "adverb",
            "sent1": "She measured the box dimensionally to ensure it would fit in the closet.",
            "sent2": "The architect designed the building dimensionally to meet the city's regulations.",
            "sent3": "The tailor comically measured the pants dimensionally, ending up with a pair too short.",
            "sent4": "Her understanding of the project grew dimensionally as she studied the blueprints.",
            "sent5": "The scientist explained the concept dimensionally, using diagrams to illustrate."
        },
        {
            "definition": "In relation to the size or extent of something.",
            "pos": "adverb",
            "sent1": "The cake was dimensionally larger than the cupcakes on the dessert table.",
            "sent2": "The garden was dimensionally small, but it was beautifully landscaped.",
            "sent3": "The puppy comically tried to eat the dimensionally large bone, struggling to hold it.",
            "sent4": "Her excitement grew dimensionally as she approached the surprise gift.",
            "sent5": "The mountain appeared dimensionally vast against the horizon."
        },
        {
            "definition": "With regard to the spatial or physical aspects of something.",
            "pos": "adverb",
            "sent1": "The furniture was arranged dimensionally to maximize space in the room.",
            "sent2": "The artist painted the scene dimensionally, capturing every detail.",
            "sent3": "The children comically tried to stack the blocks dimensionally, creating a lopsided tower.",
            "sent4": "His perception of the world expanded dimensionally after traveling to different countries.",
            "sent5": "The map displayed the city dimensionally, showing streets and landmarks clearly."
        }
    ]
}