{
    "term": "dimorphic",
    "meanings": [
        {
            "definition": "Occurring in or representing two distinct forms",
            "pos": "adjective",
            "sent1": "The butterfly displayed dimorphic wings, with one set being bright and colorful while the other set was dull and plain.",
            "sent2": "Certain flowers are dimorphic, having both tall and short varieties.",
            "sent3": "It was quite amusing to see the dimorphic clouds in the sky, some fluffy and white while others dark and ominous.",
            "sent4": "The city skyline looked dimorphic at sunset, with one side bathed in golden light and the other in shadow.",
            "sent5": "The artist painted a dimorphic landscape, showing a lush green forest on one side and a barren desert on the other."
        },
        {
            "definition": "Having two different forms or phases",
            "pos": "adjective",
            "sent1": "The plant's dimorphic leaves surprised the botanist, as one type was broad and the other narrow.",
            "sent2": "The insect went through a dimorphic transformation, changing from a caterpillar to a butterfly.",
            "sent3": "The dimorphic cake had two layers, one chocolate and the other vanilla, creating a delightful contrast.",
            "sent4": "Her dimorphic personality made her both outgoing in public and shy in private.",
            "sent5": "The gemstone had a dimorphic appearance, shimmering blue in daylight and glowing green under UV light."
        },
        {
            "definition": "Exhibiting sexual dimorphism",
            "pos": "adjective",
            "sent1": "The dimorphic species had males with bright feathers and females with dull colors.",
            "sent2": "In some bird species, dimorphic plumage helps distinguish between males and females.",
            "sent3": "The dimorphic penguins caused confusion among tourists, who couldn't tell the males from the females.",
            "sent4": "The dimorphic fish swam gracefully in the aquarium, the males vibrant and the females more subdued.",
            "sent5": "The dimorphic insects fascinated scientists with their distinct physical differences between genders."
        }
    ]
}