{
    "term": "dioptre",
    "meanings": [
        {
            "definition": "A unit of measurement of the refractive power of a lens.",
            "pos": "noun",
            "sent1": "The optician measured the dioptre of the lens to ensure it was suitable for the patient.",
            "sent2": "The glasses had a dioptre value of -2.5, helping the person see clearly.",
            "sent3": "The mischievous child pretended to use the dioptre of the lens as a magnifying glass.",
            "sent4": "Her insight into the problem was like a sharp dioptre, focusing on the core issue.",
            "sent5": "The dioptre of the lens acted like a magic wand, transforming the blurry world into clarity."
        },
        {
            "definition": "A unit of measurement of the refractive power of the eye.",
            "pos": "noun",
            "sent1": "The doctor checked the dioptre of the eye to determine the need for glasses.",
            "sent2": "His dioptre measurement showed that he had nearsightedness.",
            "sent3": "The detective had a keen dioptre for spotting small details in the crime scene.",
            "sent4": "Her vision was like a powerful dioptre, seeing through any deception.",
            "sent5": "The dioptre of his eye was like a compass, guiding him through the visual world."
        },
        {
            "definition": "A unit of measurement of the refractive power of a prism.",
            "pos": "noun",
            "sent1": "The scientist calculated the dioptre of the prism to understand its light-bending properties.",
            "sent2": "The dioptre of the prism determined how light would be refracted.",
            "sent3": "The magician used the prism's dioptre to create a dazzling light show.",
            "sent4": "The dioptre of the prism was like a secret code, unlocking the mysteries of light.",
            "sent5": "The rainbow appeared as if painted by the dioptre of the prism, spreading colors across the sky."
        }
    ]
}