{
    "term": "diphtherias",
    "meanings": [
        {
            "definition": "An acute bacterial infection affecting the throat and upper respiratory tract.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with diphtherias after examining their throat.",
            "sent2": "Many children were vaccinated to prevent diphtherias in the community.",
            "sent3": "The diphtherias outbreak led to the school implementing strict hygiene measures.",
            "sent4": "The spread of rumors in the small town was like diphtherias, infecting everyone with fear.",
            "sent5": "The severity of diphtherias can be reduced with timely medical intervention."
        },
        {
            "definition": "A disease caused by the bacterium Corynebacterium diphtheriae.",
            "pos": "noun",
            "sent1": "The hospital reported a rise in cases of diphtherias caused by the bacterium.",
            "sent2": "Historically, diphtherias were a major concern before the development of vaccines.",
            "sent3": "The party theme was so contagious, it spread like diphtherias among the guests.",
            "sent4": "The impact of the economic crisis was like diphtherias, affecting every aspect of society.",
            "sent5": "Learning about the history of diphtherias can help prevent future outbreaks."
        },
        {
            "definition": "The presence of a thick gray membrane in the throat.",
            "pos": "noun",
            "sent1": "The doctor identified the characteristic diphtherias membrane during the examination.",
            "sent2": "The treatment for diphtherias involves removing the membrane to improve breathing.",
            "sent3": "The magician's trick involved pulling a fake diphtherias membrane from his sleeve.",
            "sent4": "The fog hung over the city like a diphtherias membrane, obscuring the view.",
            "sent5": "The image of the diphtherias membrane stuck in her mind, haunting her dreams."
        }
    ]
}