{
    "term": "directly",
    "meanings": [
        {
            "definition": "In a straight line or course without deviation",
            "pos": "adverb",
            "sent1": "She walked directly to the store without stopping.",
            "sent2": "The road leads directly to the beach.",
            "sent3": "The cat chased the laser pointer directly into the wall.",
            "sent4": "Her gaze shot directly through his heart.",
            "sent5": "The arrow flew directly towards the target, hitting bullseye."
        },
        {
            "definition": "Immediately or without delay",
            "pos": "adverb",
            "sent1": "He responded directly to the question without hesitation.",
            "sent2": "The message was sent directly after the meeting.",
            "sent3": "The ice cream melted directly under the hot sun.",
            "sent4": "Her words hit him directly in the heart.",
            "sent5": "The alarm went off directly as the thief entered the house."
        },
        {
            "definition": "In a straightforward manner",
            "pos": "adverb",
            "sent1": "She explained the process directly, making it easy to understand.",
            "sent2": "He always speaks directly and honestly.",
            "sent3": "The robot followed the instructions directly, without any confusion.",
            "sent4": "Her eyes met his directly, showing determination.",
            "sent5": "The teacher explained the concept directly, using simple examples."
        },
        {
            "definition": "Without the involvement of an intermediary",
            "pos": "adverb",
            "sent1": "The two parties communicated directly without a mediator.",
            "sent2": "She paid the seller directly, avoiding any middlemen.",
            "sent3": "The message was passed directly from one person to another.",
            "sent4": "He dealt with the issue directly, without seeking help.",
            "sent5": "The instructions were given directly by the manager, ensuring clarity."
        }
    ]
}