{
    "term": "dirge",
    "meanings": [
        {
            "definition": "A funeral song or lament",
            "pos": "noun",
            "sent1": "At the funeral, the choir sang a dirge that brought tears to everyone's eyes.",
            "sent2": "The dirge played by the orchestra set a somber tone for the memorial service.",
            "sent3": "The dirge echoed through the empty church, filling the air with sorrowful notes.",
            "sent4": "As the dirge played, it felt like the music was carrying the departed's soul to the heavens.",
            "sent5": "The haunting melody of the dirge lingered in the hearts of all who attended the funeral."
        },
        {
            "definition": "A mournful or melancholy musical composition",
            "pos": "noun",
            "sent1": "Listening to the dirge on the radio, she couldn't help but feel a sense of sadness wash over her.",
            "sent2": "The composer poured his heart into creating a beautiful dirge that touched the audience deeply.",
            "sent3": "Despite the dirge's melancholy tune, it strangely brought a sense of peace to those who listened.",
            "sent4": "The dirge's mournful notes seemed to express the composer's grief in a way words never could.",
            "sent5": "The haunting beauty of the dirge lingered in the air long after the music had stopped."
        },
        {
            "definition": "A slow, mournful movement in music",
            "pos": "noun",
            "sent1": "The dirge in the symphony evoked a sense of deep sorrow among the listeners.",
            "sent2": "The cellist played the dirge with such emotion that it moved the audience to tears.",
            "sent3": "Despite its slow pace, the dirge had a captivating quality that held the audience spellbound.",
            "sent4": "The dirge's mournful melody seemed to carry the weight of the world in its notes.",
            "sent5": "The dirge's slow tempo created a solemn atmosphere that enveloped the concert hall."
        }
    ]
}