{
    "term": "dirges",
    "meanings": [
        {
            "definition": "A funeral song or lament",
            "pos": "noun",
            "sent1": "During the funeral, the choir sang dirges that brought tears to everyone's eyes.",
            "sent2": "The dirges played at the memorial service captured the somber mood perfectly.",
            "sent3": "The dirges at the funeral were so sad that even the flowers seemed to weep.",
            "sent4": "The dirges echoed through the church, filling the air with sorrow and remembrance.",
            "sent5": "The haunting dirges lingered in the hearts of all who attended the service."
        },
        {
            "definition": "A mournful or melancholy musical composition",
            "pos": "noun",
            "sent1": "The musician composed beautiful dirges that touched the listeners' souls.",
            "sent2": "Listening to the dirges on the radio always made her feel a sense of longing.",
            "sent3": "The dirges played by the orchestra seemed to paint a picture of sadness in the air.",
            "sent4": "The dirges filled the room with a sense of melancholy that was hard to shake off.",
            "sent5": "The haunting melody of the dirges stayed with her long after the music had ended."
        },
        {
            "definition": "A slow, solemn, and mournful piece of music",
            "pos": "noun",
            "sent1": "The dirges played by the pianist evoked a sense of deep sorrow in the audience.",
            "sent2": "The dirges performed by the band created a solemn atmosphere in the hall.",
            "sent3": "As the dirges played softly in the background, a feeling of reverence filled the room.",
            "sent4": "The dirges floated through the air, wrapping everyone in a cloak of mournful melody.",
            "sent5": "The slow tempo of the dirges seemed to match the heavy hearts of those in attendance."
        },
        {
            "definition": "A song or hymn of grief or lamentation",
            "pos": "noun",
            "sent1": "The choir's dirges expressed the deep sorrow felt by the community.",
            "sent2": "Her voice trembled as she sang the dirges at the memorial service.",
            "sent3": "The dirges sung by the children's choir brought a sense of unity in grief.",
            "sent4": "The haunting dirges filled the church with a sense of collective mourning.",
            "sent5": "The dirges carried the weight of centuries of lament in their sorrowful notes."
        }
    ]
}