{
    "term": "dirige",
    "meanings": [
        {
            "definition": "To guide or direct",
            "pos": "verb",
            "sent1": "She dirige the lost travelers towards the right path.",
            "sent2": "The teacher dirige the students during the school trip.",
            "sent3": "The GPS device dirige the driver to take a wrong turn.",
            "sent4": "His intuition dirige him to make the correct decision.",
            "sent5": "The lighthouse dirige ships safely through the stormy seas."
        },
        {
            "definition": "A funeral hymn or lament",
            "pos": "noun",
            "sent1": "The dirige played softly in the background of the funeral.",
            "sent2": "The choir sang a beautiful dirige at the memorial service.",
            "sent3": "The haunting melody of the dirige brought tears to everyone's eyes.",
            "sent4": "The dirige echoed through the church, honoring the departed soul.",
            "sent5": "The dirige set a somber tone for the funeral procession."
        },
        {
            "definition": "A command to guide or direct",
            "pos": "noun",
            "sent1": "The captain's dirige was clear and decisive.",
            "sent2": "Following the dirige of the coach, the team won the game.",
            "sent3": "The boss's dirige left no room for confusion among the employees.",
            "sent4": "The dirige from headquarters was to proceed with caution.",
            "sent5": "The dirige from the conductor signaled the start of the performance."
        },
        {
            "definition": "A type of prayer or chant",
            "pos": "noun",
            "sent1": "The monks began their evening dirige in the monastery.",
            "sent2": "The dirige echoed through the cathedral, filling the air with reverence.",
            "sent3": "The dirige sung by the choir brought a sense of peace to the congregation.",
            "sent4": "The dirige chanted by the priest soothed the grieving hearts.",
            "sent5": "The dirige whispered by the wind carried blessings to all who listened."
        }
    ]
}