{
    "term": "dirty",
    "meanings": [
        {
            "definition": "Soiled or unclean",
            "pos": "adjective",
            "sent1": "The boy's hands were dirty after playing in the mud.",
            "sent2": "She washed her dirty clothes in the laundry machine.",
            "sent3": "The dog's dirty paws left muddy prints all over the floor.",
            "sent4": "The dirty water in the pond reflected the cloudy sky above.",
            "sent5": "The dirty dishes in the sink attracted flies and ants."
        },
        {
            "definition": "Contaminated or impure",
            "pos": "adjective",
            "sent1": "The dirty water from the factory polluted the river.",
            "sent2": "He refused to drink the dirty water from the rusty tap.",
            "sent3": "The dirty air in the city made her sneeze constantly.",
            "sent4": "The dirty thoughts in his mind clouded his judgment.",
            "sent5": "The dirty oil spill harmed the marine life in the ocean."
        },
        {
            "definition": "Dishonest or unethical",
            "pos": "adjective",
            "sent1": "The politician was involved in a dirty scandal.",
            "sent2": "She didn't trust his dirty tactics in the business deal.",
            "sent3": "The dirty lies he told eventually caught up with him.",
            "sent4": "The dirty tricks he played on his friends backfired.",
            "sent5": "The dirty schemes of the con artist were finally exposed."
        },
        {
            "definition": "To make unclean or impure",
            "pos": "verb",
            "sent1": "Please don't dirty the clean floor with your muddy shoes.",
            "sent2": "He accidentally dirtied his shirt while working in the garden.",
            "sent3": "She tried not to dirty her hands while painting the walls.",
            "sent4": "The rain dirtied the freshly washed car parked outside.",
            "sent5": "He didn't want to dirty the crystal vase with fingerprints."
        }
    ]
}