{
    "term": "dis",
    "meanings": [
        {
            "definition": "To show disrespect or contempt for someone or something.",
            "pos": "verb",
            "sent1": "She disrespected her teacher by talking back in class.",
            "sent2": "He always disrespects his elders by interrupting them.",
            "sent3": "The student tried to dis the principal, but ended up in detention.",
            "sent4": "His constant disapproval of others only reflects his own insecurities.",
            "sent5": "The way she disrespects authority figures is truly appalling."
        },
        {
            "definition": "To criticize or belittle someone or something.",
            "pos": "verb",
            "sent1": "He dislikes being disapproved of by his peers.",
            "sent2": "She tends to dis everything her sister does.",
            "sent3": "The comedian likes to dis his own jokes before telling them.",
            "sent4": "His habit of discrediting others' achievements is not admirable.",
            "sent5": "The coach's constant belittling of the players is demoralizing."
        },
        {
            "definition": "To behave in a disrespectful or contemptuous manner.",
            "pos": "verb",
            "sent1": "The child was punished for his disrespectful behavior towards the teacher.",
            "sent2": "She always behaves disrespectfully towards her classmates.",
            "sent3": "His tendency to dis authority figures often gets him into trouble.",
            "sent4": "The way he disrespects others is a reflection of his own character.",
            "sent5": "Her contemptuous attitude towards her colleagues is unacceptable."
        },
        {
            "definition": "A negative prefix indicating the opposite or absence of something.",
            "pos": "noun",
            "sent1": "The word 'dislike' uses 'dis' as a negative prefix.",
            "sent2": "In 'disagree,' 'dis' indicates a difference in opinion.",
            "sent3": "The 'dis' in 'disbelief' suggests a lack of faith.",
            "sent4": "The 'dis' in 'disadvantage' points to an unfavorable situation.",
            "sent5": "Using 'dis' before 'honest' creates the word 'dishonest.'"
        }
    ]
}