{
    "term": "disaccharide",
    "meanings": [
        {
            "definition": "A sugar composed of two monosaccharides.",
            "pos": "noun",
            "sent1": "I learned that a disaccharide is a sweet substance made from two simple sugars.",
            "sent2": "My favorite disaccharide is sucrose, which is found in sugar cane and sugar beets.",
            "sent3": "Why did the disaccharide break up with the monosaccharide? They just couldn't bond anymore!",
            "sent4": "The disaccharide acted like a bridge between the two monosaccharides, connecting them together.",
            "sent5": "The disaccharide looked like a tiny sugar duo, dancing happily in the solution."
        },
        {
            "definition": "A type of carbohydrate consisting of two sugar molecules linked together.",
            "pos": "noun",
            "sent1": "The disaccharide in my energy bar provides a quick source of fuel for my workout.",
            "sent2": "When I eat bread, my body breaks down the disaccharide into simpler sugars for energy.",
            "sent3": "Why did the disaccharide bring a friend to the party? To have a sweet duo on the dance floor!",
            "sent4": "The disaccharide acted like a tiny sugar chain, holding the two sugar molecules together.",
            "sent5": "The disaccharide was like a sugary handshake between the two sugar molecules."
        },
        {
            "definition": "A double sugar molecule.",
            "pos": "noun",
            "sent1": "The disaccharide molecule is made up of two sugar units bonded together.",
            "sent2": "In my biology class, we studied the structure of a disaccharide under the microscope.",
            "sent3": "Why did the disaccharide go to school? To get a double degree in sweetness!",
            "sent4": "The disaccharide was like a tiny sugar pair, always sticking together.",
            "sent5": "The disaccharide molecule looked like a sweet couple, inseparable in the solution."
        }
    ]
}