{
    "term": "discriminative",
    "meanings": [
        {
            "definition": "Showing or indicating careful judgment or discernment",
            "pos": "adjective",
            "sent1": "Her discriminative taste in art always led her to the most beautiful paintings.",
            "sent2": "The discriminative teacher could easily identify the students who needed extra help.",
            "sent3": "The cat made a discriminative choice by selecting the comfiest spot on the couch.",
            "sent4": "His discriminative eye for detail allowed him to spot the hidden message in the painting.",
            "sent5": "The discriminative chef could distinguish the subtlest flavors in every dish."
        },
        {
            "definition": "Able to recognize or make distinctions",
            "pos": "adjective",
            "sent1": "The discriminative child could tell identical twins apart effortlessly.",
            "sent2": "Being discriminative in taste, she could easily identify the different types of chocolate.",
            "sent3": "The robot's discriminative sensors helped it avoid obstacles with precision.",
            "sent4": "His discriminative memory allowed him to recall every detail of the crime scene.",
            "sent5": "The bird's discriminative vision enabled it to spot the smallest insects from afar."
        },
        {
            "definition": "Involving or based on discrimination",
            "pos": "adjective",
            "sent1": "The discriminative hiring process ensured only the most qualified candidates were selected.",
            "sent2": "The discriminative policy aimed to promote equality and fairness in the workplace.",
            "sent3": "The discriminative pricing strategy attracted customers looking for high-quality products.",
            "sent4": "Her discriminative approach to problem-solving considered all perspectives before making a decision.",
            "sent5": "The discriminative law protected individuals from unfair treatment based on their background."
        }
    ]
}