{
    "term": "disclaiming",
    "meanings": [
        {
            "definition": "Refusing to acknowledge or accept responsibility for something.",
            "pos": "adjective",
            "sent1": "The disclaiming statement made it clear that they were not responsible for the mistake.",
            "sent2": "She had a disclaiming attitude towards the situation, avoiding any blame.",
            "sent3": "His disclaiming behavior was like a shield against any accusations.",
            "sent4": "The disclaiming nature of the company's response left many questions unanswered.",
            "sent5": "The disclaiming tone in his voice revealed his reluctance to take ownership."
        },
        {
            "definition": "Denying any connection or involvement with something.",
            "pos": "adjective",
            "sent1": "The disclaiming individual insisted they had no part in the incident.",
            "sent2": "Her disclaiming remarks suggested she wanted to stay out of the conflict.",
            "sent3": "The cat's disclaiming look seemed to say, 'I didn't knock over the vase!'",
            "sent4": "The disclaiming stance of the suspect raised suspicions among the investigators.",
            "sent5": "His disclaiming behavior only added to the mystery surrounding the case."
        },
        {
            "definition": "Renouncing or giving up a claim or right to something.",
            "pos": "verb",
            "sent1": "He was disclaiming his inheritance in favor of pursuing his passion.",
            "sent2": "The company was disclaiming any profits from the controversial project.",
            "sent3": "She jokingly said she was disclaiming her title as 'Queen of Procrastination.'",
            "sent4": "By disclaiming his role in the decision, he distanced himself from the consequences.",
            "sent5": "The politician was disclaiming any association with the scandal to protect his reputation."
        }
    ]
}