{
    "term": "discharge",
    "meanings": [
        {
            "definition": "Release from a duty or obligation.",
            "pos": "noun",
            "sent1": "After completing his service, he received his discharge.",
            "sent2": "The soldier was granted a discharge from the army.",
            "sent3": "The discharge from jury duty was a relief for him.",
            "sent4": "Her discharge from the contract was a weight off her shoulders.",
            "sent5": "The discharge from his responsibilities felt liberating."
        },
        {
            "definition": "Emit or release (a substance).",
            "pos": "verb",
            "sent1": "The factory discharge polluted the river.",
            "sent2": "The volcano discharge ash and lava.",
            "sent3": "The discharge of bubbles from the soda was fascinating to watch.",
            "sent4": "The gun discharge echoed through the valley.",
            "sent5": "The discharge of fireworks lit up the night sky."
        },
        {
            "definition": "Fire a gun or missile.",
            "pos": "verb",
            "sent1": "He learned how to discharge a rifle at the shooting range.",
            "sent2": "The soldier had to discharge his weapon in combat.",
            "sent3": "The pirate captain ordered his crew to discharge their cannons.",
            "sent4": "The police officer had to discharge his firearm to stop the criminal.",
            "sent5": "The hunter carefully discharged his shotgun."
        },
        {
            "definition": "Allow (a liquid, gas, or other substance) to flow out from where it has been confined.",
            "pos": "verb",
            "sent1": "The plumber had to discharge the water from the clogged pipe.",
            "sent2": "The dam had to discharge excess water to prevent flooding.",
            "sent3": "The soda can discharge its contents when shaken.",
            "sent4": "The doctor had to discharge the pus from the wound.",
            "sent5": "The air conditioner discharge cool air into the room."
        }
    ]
}