{
    "term": "discourteousness",
    "meanings": [
        {
            "definition": "The quality of being rude or impolite.",
            "pos": "noun",
            "sent1": "Her discourteousness towards the waiter upset everyone at the table.",
            "sent2": "His discourteousness was evident when he interrupted the speaker repeatedly.",
            "sent3": "The discourteousness of the character in the movie provided comic relief in an otherwise serious plot.",
            "sent4": "The discourteousness of the storm was evident in the way it knocked down trees and power lines.",
            "sent5": "The discourteousness of the driver cutting off others on the road was unforgettable.",
            "sent6": "Despite her discourteousness, she managed to make a good impression on her boss.",
            "sent7": "The discourteousness of the customer was evident in the way he spoke to the cashier.",
            "sent8": "The discourteousness of the dog barking loudly disturbed the neighbors.",
            "sent9": "His discourteousness towards his classmates made him unpopular in school.",
            "sent10": "The discourteousness of the storm left a trail of destruction in its wake."
        },
        {
            "definition": "An act or behavior that lacks manners or consideration for others.",
            "pos": "noun",
            "sent1": "The discourteousness of talking loudly in a library can disturb others studying.",
            "sent2": "She showed her discourteousness by not saying thank you when someone held the door for her.",
            "sent3": "The discourteousness of cutting in line at the grocery store caused a commotion.",
            "sent4": "His discourteousness in not RSVPing to the invitation was disappointing.",
            "sent5": "The discourteousness of leaving trash behind at the park is unacceptable.",
            "sent6": "Despite his discourteousness, he managed to make a good impression on his colleagues.",
            "sent7": "The discourteousness of arriving late to the meeting was disrespectful.",
            "sent8": "The discourteousness of not acknowledging a gift received is impolite.",
            "sent9": "Her discourteousness towards the elderly lady shocked those around her.",
            "sent10": "The discourteousness of ignoring someone's message is inconsiderate."
        }
    ]
}