{
    "term": "disciplinary",
    "meanings": [
        {
            "definition": "relating to the enforcement of discipline",
            "pos": "adjective",
            "sent1": "The teacher's disciplinary actions helped maintain order in the classroom.",
            "sent2": "The school has a strict disciplinary policy for students who break the rules.",
            "sent3": "The disciplinary approach of the coach turned the team into a well-oiled machine.",
            "sent4": "Her disciplinary tone was like a firm hand guiding everyone in the right direction.",
            "sent5": "The disciplinary measures taken by the principal were fair but firm."
        },
        {
            "definition": "relating to the punishment of wrongdoing",
            "pos": "adjective",
            "sent1": "The judge imposed a disciplinary penalty on the defendant for their actions.",
            "sent2": "The disciplinary action taken against the employee was a warning to others.",
            "sent3": "The disciplinary consequences made the student think twice before misbehaving again.",
            "sent4": "The disciplinary consequences were like a wake-up call for the team to improve.",
            "sent5": "The disciplinary measures were necessary to maintain order and fairness."
        },
        {
            "definition": "relating to the training or control of behavior",
            "pos": "adjective",
            "sent1": "The disciplinary program helped the dog learn good behavior.",
            "sent2": "The disciplinary techniques used by the trainer were effective in shaping behavior.",
            "sent3": "The disciplinary training session turned into a fun learning experience for the participants.",
            "sent4": "Her disciplinary guidance was like a compass directing them towards better behavior.",
            "sent5": "The disciplinary approach focused on positive reinforcement for good behavior."
        }
    ]
}