{
    "term": "discreditably",
    "meanings": [
        {
            "definition": "In a way that causes loss of reputation or trust.",
            "pos": "adverb",
            "sent1": "He spoke discreditably about his colleagues, causing others to doubt their honesty.",
            "sent2": "The politician acted discreditably, leading to a decrease in public support.",
            "sent3": "The comedian joked discreditably about his own reputation, making the audience laugh.",
            "sent4": "Her actions at the party were discreditably loud, drawing attention for the wrong reasons.",
            "sent5": "The student's behavior in class was so discreditably disruptive that the teacher had to intervene."
        },
        {
            "definition": "In a manner that brings shame or disgrace.",
            "pos": "adverb",
            "sent1": "She behaved discreditably at the event, causing embarrassment to her family.",
            "sent2": "The criminal acted discreditably, bringing dishonor to his name.",
            "sent3": "The cat walked discreditably across the table, knocking over the vase.",
            "sent4": "The storm hit the town discreditably, leaving destruction in its wake.",
            "sent5": "The student's behavior was so discreditably rude that the teacher had to address it immediately."
        },
        {
            "definition": "In a manner that undermines credibility or reliability.",
            "pos": "adverb",
            "sent1": "The false information was spread discreditably, leading to confusion among the listeners.",
            "sent2": "The unreliable source reported discreditably, casting doubt on the accuracy of the news.",
            "sent3": "The robot malfunctioned discreditably during the demonstration, amusing the audience.",
            "sent4": "The old bridge stood discreditably, barely holding up under the weight of the cars.",
            "sent5": "The witness's testimony was discreditably inconsistent, making it hard for the jury to believe."
        }
    ]
}