{
    "term": "discomfiture",
    "meanings": [
        {
            "definition": "The state of being embarrassed or confused.",
            "pos": "noun",
            "sent1": "Her discomfiture was evident when she tripped in front of everyone.",
            "sent2": "The discomfiture on his face showed that he had forgotten his lines.",
            "sent3": "His discomfiture at the party was clear when he spilled his drink on the host.",
            "sent4": "The discomfiture of the student was like a bright spotlight on stage, impossible to ignore.",
            "sent5": "The discomfiture she felt was like a heavy weight on her shoulders, dragging her down."
        },
        {
            "definition": "A feeling of unease or discomfort.",
            "pos": "noun",
            "sent1": "The sudden silence in the room created a sense of discomfiture among the guests.",
            "sent2": "His discomfiture grew as he realized he was lost in the unfamiliar neighborhood.",
            "sent3": "The discomfiture of wearing mismatched socks made her laugh at herself.",
            "sent4": "The discomfiture in the air was palpable, making everyone shift in their seats.",
            "sent5": "The discomfiture of being alone in the dark forest sent shivers down her spine."
        },
        {
            "definition": "To make someone feel uneasy or embarrassed.",
            "pos": "verb",
            "sent1": "She tried to discomfiture her opponent with unexpected questions during the debate.",
            "sent2": "The magician's tricks were meant to discomfiture the audience and keep them guessing.",
            "sent3": "His attempt to discomfiture his sister by hiding her favorite toy backfired when she found it.",
            "sent4": "The teacher's stern gaze seemed to discomfiture the students into silence.",
            "sent5": "The unexpected prank was designed to discomfiture him, but he took it in good humor."
        }
    ]
}