{
    "term": "discourage",
    "meanings": [
        {
            "definition": "To cause someone to lose confidence or enthusiasm.",
            "pos": "verb",
            "sent1": "His harsh criticism can discourage students from trying new things.",
            "sent2": "The coach didn't want to discourage the team, so he offered words of encouragement.",
            "sent3": "She joked that her cooking skills might discourage even the bravest of taste testers.",
            "sent4": "The storm clouds looming overhead seemed to discourage any hope of a sunny day.",
            "sent5": "The teacher's kind words were like a shield against anything that could discourage her students."
        },
        {
            "definition": "To try to prevent or prevent someone from doing something.",
            "pos": "verb",
            "sent1": "The warning signs are there to discourage people from entering the dangerous area.",
            "sent2": "The locked gate is meant to discourage trespassers from entering the property.",
            "sent3": "The loud alarm was set up to discourage anyone from trying to steal the precious jewels.",
            "sent4": "The high fence around the garden discouraged rabbits from munching on the vegetables.",
            "sent5": "The fierce guard dog was a clear sign to discourage any unwanted visitors."
        },
        {
            "definition": "To advise against something.",
            "pos": "verb",
            "sent1": "I would discourage you from taking that risky shortcut through the forest.",
            "sent2": "The doctor will discourage you from eating too much sugar for the sake of your health.",
            "sent3": "Her friend's comical face was enough to discourage her from wearing that outrageous outfit.",
            "sent4": "The wise old owl's hoot seemed to discourage the young birds from straying too far from the nest.",
            "sent5": "The caution tape was there to discourage anyone from entering the construction zone."
        }
    ]
}