{
    "term": "discharging",
    "meanings": [
        {
            "definition": "To release or let go of something",
            "pos": "verb",
            "sent1": "The firefighter was discharging water onto the burning building.",
            "sent2": "She was discharging her responsibilities diligently.",
            "sent3": "The magician was discharging colorful confetti from his sleeves.",
            "sent4": "The dam was discharging water at an alarming rate.",
            "sent5": "The pressure cooker was discharging steam noisily."
        },
        {
            "definition": "To perform the duties of a job or responsibility",
            "pos": "verb",
            "sent1": "He was discharging his duties as a teacher with dedication.",
            "sent2": "The nurse was discharging her patients after their treatments.",
            "sent3": "The robot was discharging its tasks efficiently.",
            "sent4": "The soldier was discharging his duty to protect the country.",
            "sent5": "The CEO was discharging her responsibilities with authority."
        },
        {
            "definition": "To fire a weapon",
            "pos": "verb",
            "sent1": "The soldier was discharging his rifle during training.",
            "sent2": "The police officer was discharging his firearm to stop the criminal.",
            "sent3": "The cowboy was discharging his revolver in the air for fun.",
            "sent4": "The hunter was discharging his shotgun to scare away the birds.",
            "sent5": "The security guard was discharging his taser to subdue the intruder."
        },
        {
            "definition": "To release a liquid or gas",
            "pos": "verb",
            "sent1": "The factory was discharging pollutants into the river.",
            "sent2": "The volcano was discharging lava and ash during the eruption.",
            "sent3": "The soda can was discharging fizzy bubbles when opened.",
            "sent4": "The exhaust pipe was discharging smoke into the air.",
            "sent5": "The air conditioner was discharging cool air into the room."
        },
        {
            "definition": "To unload cargo or passengers",
            "pos": "verb",
            "sent1": "The port workers were discharging crates from the ship.",
            "sent2": "The flight attendant was discharging passengers from the plane.",
            "sent3": "The truck driver was discharging goods at the warehouse.",
            "sent4": "The bus driver was discharging commuters at the station.",
            "sent5": "The forklift operator was discharging pallets from the truck."
        }
    ]
}