{
    "term": "discriminators",
    "meanings": [
        {
            "definition": "A person or thing that discriminates between different things or people.",
            "pos": "noun",
            "sent1": "The teacher used discriminators to choose the best student for the award.",
            "sent2": "The security guard's job is to be a discriminator and only allow authorized personnel inside.",
            "sent3": "The cat acted as a discriminator, only letting the friendly visitors pet her.",
            "sent4": "The wise owl was a discriminator of truth, always able to see through lies.",
            "sent5": "The superhero's superpower was to be a discriminator of good and evil, always knowing the right path to take."
        },
        {
            "definition": "A device or component that distinguishes between signals or data.",
            "pos": "noun",
            "sent1": "The radar system has discriminators to filter out unwanted signals.",
            "sent2": "The barcode scanner acts as a discriminator to read product information.",
            "sent3": "The robot's discriminator malfunctioned, causing it to mix up all the data.",
            "sent4": "The metal detector at the airport is a discriminator, ensuring no prohibited items pass through.",
            "sent5": "The computer's discriminator was top-notch, accurately sorting through the vast amount of information."
        },
        {
            "definition": "A gene or protein that determines a specific trait or characteristic.",
            "pos": "noun",
            "sent1": "The geneticist studied the discriminators responsible for eye color.",
            "sent2": "The DNA test revealed the presence of specific discriminators linked to the disease.",
            "sent3": "The mutant gene acted as a discriminator, giving the superhero special powers.",
            "sent4": "The protein's role as a discriminator was crucial in identifying the genetic disorder.",
            "sent5": "The plant's DNA contained discriminators that made it resistant to pests."
        }
    ]
}