{
    "term": "discipline",
    "meanings": [
        {
            "definition": "Training to ensure proper behavior or control",
            "pos": "noun",
            "sent1": "The coach emphasized the importance of discipline in sports.",
            "sent2": "Parents use discipline to teach their children right from wrong.",
            "sent3": "The classroom had a pet hamster to teach the students discipline in caring for a living creature.",
            "sent4": "In the garden of self-improvement, discipline is the water that helps the flowers of success bloom.",
            "sent5": "The military's strict discipline molded the recruits into efficient soldiers."
        },
        {
            "definition": "Punishment to correct disobedience",
            "pos": "noun",
            "sent1": "The teacher gave detention as a form of discipline for talking in class.",
            "sent2": "Discipline is necessary to maintain order in a classroom.",
            "sent3": "The mischievous puppy learned discipline after being scolded for chewing on shoes.",
            "sent4": "The discipline of time-out helped the child understand the consequences of their actions.",
            "sent5": "The strict discipline of the law kept the citizens in line."
        },
        {
            "definition": "A field of study or area of expertise",
            "pos": "noun",
            "sent1": "Psychology is a discipline that explores the human mind.",
            "sent2": "In college, students can choose a discipline to specialize in.",
            "sent3": "The discipline of astronomy studies the stars and planets.",
            "sent4": "The discipline of history helps us understand the past.",
            "sent5": "The discipline of mathematics involves solving complex problems."
        },
        {
            "definition": "Self-control and determination",
            "pos": "noun",
            "sent1": "With discipline, you can achieve your goals.",
            "sent2": "Discipline is key to resisting temptations.",
            "sent3": "She showed great discipline by sticking to her diet and exercise routine.",
            "sent4": "The discipline of a marathon runner is admirable.",
            "sent5": "Discipline is like a muscle that grows stronger with use."
        }
    ]
}