{
    "term": "disembarking",
    "meanings": [
        {
            "definition": "To leave a ship, aircraft, or other vehicle.",
            "pos": "verb",
            "sent1": "After the long journey, the passengers were disembarking from the cruise ship.",
            "sent2": "The travelers were disembarking the plane as soon as it landed.",
            "sent3": "The penguins were disembarking from their iceberg 'cruise ship' onto the icy shore.",
            "sent4": "As the final notes of the symphony played, the audience began disembarking from the emotional rollercoaster.",
            "sent5": "The image of the astronauts disembarking from the spaceship was etched in his memory."
        },
        {
            "definition": "To go ashore from a ship.",
            "pos": "verb",
            "sent1": "The sailors were disembarking onto the sandy beach for some rest.",
            "sent2": "Tourists were disembarking the ferry to explore the beautiful island.",
            "sent3": "The pirates were disembarking from their ship, ready to bury their 'treasure'.",
            "sent4": "She felt like disembarking from the daily routine and sailing into the unknown.",
            "sent5": "The children's faces lit up as they imagined disembarking onto a magical island full of adventures."
        },
        {
            "definition": "To remove or unload passengers or cargo from a vehicle.",
            "pos": "verb",
            "sent1": "The workers were disembarking the boxes from the delivery truck.",
            "sent2": "Passengers were disembarking their luggage from the train.",
            "sent3": "The squirrels were disembarking the acorns from the tree, preparing for winter.",
            "sent4": "She felt like disembarking the heavy burden of expectations from her shoulders.",
            "sent5": "The image of the ants disembarking the food crumbs from the picnic blanket was a lesson in teamwork."
        }
    ]
}