{
    "term": "disembarkations",
    "meanings": [
        {
            "definition": "The act of getting off a ship or aircraft.",
            "pos": "noun",
            "sent1": "The disembarkations from the cruise ship were smooth and organized.",
            "sent2": "Passengers waited patiently for the disembarkations at the airport.",
            "sent3": "The penguins decided to have a race during the disembarkations from the boat.",
            "sent4": "As the sun set, the disembarkations from the plane resembled a flock of birds scattering.",
            "sent5": "The loudspeaker announcement made the disembarkations feel urgent and important."
        },
        {
            "definition": "The process of unloading passengers or cargo from a vehicle.",
            "pos": "noun",
            "sent1": "The disembarkations of the luggage took longer than expected.",
            "sent2": "The crew efficiently handled the disembarkations of the goods from the truck.",
            "sent3": "During the disembarkations of the boxes, one accidentally fell into the river.",
            "sent4": "The disembarkations of the supplies onto the dock were met with cheers from the workers.",
            "sent5": "The sound of the forklift signaled the start of the disembarkations of the equipment."
        },
        {
            "definition": "The act of leaving a mode of transportation.",
            "pos": "noun",
            "sent1": "The disembarkations from the train station were chaotic during rush hour.",
            "sent2": "Passengers were reminded to check their belongings before the disembarkations from the bus.",
            "sent3": "The clown entertained the children during the disembarkations from the circus train.",
            "sent4": "The sudden stop signaled the unexpected disembarkations from the rollercoaster.",
            "sent5": "The captain announced the disembarkations from the ship with a loud horn blast."
        }
    ]
}