{
    "term": "diseconomy",
    "meanings": [
        {
            "definition": "A situation in which inefficiency leads to increased costs.",
            "pos": "noun",
            "sent1": "The company faced a diseconomy when their outdated machinery caused production delays.",
            "sent2": "The government's overspending resulted in a diseconomy for the taxpayers.",
            "sent3": "It was a diseconomy to buy a new car when the old one only needed a minor repair.",
            "sent4": "The diseconomy of time wasted on unnecessary meetings became apparent to the team.",
            "sent5": "The student's procrastination created a diseconomy of effort as the deadline approached."
        },
        {
            "definition": "The opposite of economy; wastefulness.",
            "pos": "noun",
            "sent1": "The extravagant party was a perfect example of diseconomy in action.",
            "sent2": "Her shopping habits reflected a pattern of diseconomy rather than saving for the future.",
            "sent3": "The family's constant dining out was a fun but costly diseconomy.",
            "sent4": "The garden's overgrown state was a visual representation of diseconomy in neglect.",
            "sent5": "The overflowing trash cans showed a clear sign of household diseconomy."
        },
        {
            "definition": "A lack of efficiency in the use of resources.",
            "pos": "noun",
            "sent1": "The factory's disorganization led to a severe diseconomy in raw material usage.",
            "sent2": "The city's traffic congestion was a prime example of diseconomy in urban planning.",
            "sent3": "The picnic's poor planning resulted in a comical diseconomy of food supplies.",
            "sent4": "The student's messy desk was a small-scale example of diseconomy in daily life.",
            "sent5": "The constant rework on the project caused a significant diseconomy in time management."
        }
    ]
}