{
    "term": "disgustful",
    "meanings": [
        {
            "definition": "Causing a feeling of revulsion or strong disapproval.",
            "pos": "adjective",
            "sent1": "The rotten food in the fridge was so disgustful that I had to throw it away immediately.",
            "sent2": "The garbage left on the street was disgustful and needed to be cleaned up.",
            "sent3": "The way he slurped his soup was disgustful, but it made everyone laugh.",
            "sent4": "The sight of the abandoned house was so disgustful, it seemed to emit an aura of decay.",
            "sent5": "The smell of the overflowing trash can was disgustful, lingering in the air for hours."
        },
        {
            "definition": "Full of disgust or revulsion.",
            "pos": "adjective",
            "sent1": "Her expression turned disgustful when she saw the mess in the room.",
            "sent2": "The movie was so disgustful that many people walked out of the theater.",
            "sent3": "The cat's reaction to the new food was disgustful, as it refused to even sniff it.",
            "sent4": "The pond was disgustful, covered in a thick layer of green algae.",
            "sent5": "The taste of the spoiled milk was disgustful, making me gag instantly."
        },
        {
            "definition": "Evoking a strong feeling of dislike or aversion.",
            "pos": "adjective",
            "sent1": "The dark alley had a disgustful aura that made people avoid it at all costs.",
            "sent2": "The politician's actions were so disgustful that even their supporters turned away.",
            "sent3": "The idea of eating bugs may seem disgustful, but in some cultures, it's a delicacy.",
            "sent4": "The old, tattered doll had a disgustful appearance, sending shivers down my spine.",
            "sent5": "The sound of nails on a chalkboard is universally disgustful, causing discomfort to many."
        }
    ]
}