{
    "term": "dish",
    "meanings": [
        {
            "definition": "A shallow, flat container for serving food.",
            "pos": "noun",
            "sent1": "She placed the pasta in a colorful dish.",
            "sent2": "The waiter brought out a dish of steaming soup.",
            "sent3": "The cat knocked over the dish, spilling its contents everywhere.",
            "sent4": "Her smile was a dish of sunshine on a rainy day.",
            "sent5": "The dish gleamed under the bright kitchen lights."
        },
        {
            "definition": "A particular variety or preparation of food.",
            "pos": "noun",
            "sent1": "The restaurant's specialty dish was a spicy curry.",
            "sent2": "I love trying new dishes when I travel.",
            "sent3": "The dish of cookies disappeared in minutes at the party.",
            "sent4": "His storytelling was a delicious dish for the ears.",
            "sent5": "The dish of sushi was beautifully presented on the plate."
        },
        {
            "definition": "To serve food in a dish.",
            "pos": "verb",
            "sent1": "She will dish out the soup into bowls for everyone.",
            "sent2": "The chef dished the pasta onto the plates with precision.",
            "sent3": "He dished out compliments as easily as he dished out food.",
            "sent4": "The speaker dished out wisdom to the eager audience.",
            "sent5": "The mother dished out love along with the warm meal."
        },
        {
            "definition": "To gossip or spread rumors.",
            "pos": "verb",
            "sent1": "The group of friends liked to dish about their classmates.",
            "sent2": "She dished the latest news to anyone who would listen.",
            "sent3": "The neighbors would often dish over the fence about each other.",
            "sent4": "The tabloids dished out scandalous stories about celebrities.",
            "sent5": "The internet is a place where people can dish anonymously."
        }
    ]
}