{
    "term": "dished",
    "meanings": [
        {
            "definition": "A shallow, flat-bottomed container for serving food.",
            "pos": "noun",
            "sent1": "The waiter carried the dished filled with soup to the table.",
            "sent2": "The kitchen had many clean dished ready for the dinner rush.",
            "sent3": "The cat tried to balance on the dished left on the counter.",
            "sent4": "The sunlight reflected off the dished stacked in the cupboard.",
            "sent5": "The child dropped the dished, causing a loud clatter."
        },
        {
            "definition": "To have a particular shape or quality, especially a concave or hollow one.",
            "pos": "verb",
            "sent1": "The bowl dished inward at the center.",
            "sent2": "The road dished slightly, causing rainwater to collect in the middle.",
            "sent3": "The artist dished the clay into a beautiful vase.",
            "sent4": "Her eyes dished with surprise when she saw the surprise party.",
            "sent5": "The valley dished between the mountains, creating a natural bowl shape."
        },
        {
            "definition": "To serve food on dishes.",
            "pos": "verb",
            "sent1": "The chef dished out generous portions of pasta.",
            "sent2": "She dished the salad onto the plates for the guests.",
            "sent3": "The siblings playfully dished out ice cream for dessert.",
            "sent4": "The cafeteria worker dished the hot soup carefully to avoid spills.",
            "sent5": "He dished the stew onto the dished, making sure each one had enough meat."
        },
        {
            "definition": "To gossip or spread rumors.",
            "pos": "verb",
            "sent1": "The neighbors dished about the new family moving in next door.",
            "sent2": "She dished out juicy details about the celebrity scandal.",
            "sent3": "The group of friends dished over coffee about the latest drama at school.",
            "sent4": "The tabloid magazine dished on the latest Hollywood gossip.",
            "sent5": "The office workers dished during their lunch break, sharing office rumors."
        }
    ]
}