{
    "term": "dishing",
    "meanings": [
        {
            "definition": "Present participle of dish: to serve food on dishes",
            "pos": "verb",
            "sent1": "She was dishing out the pasta onto the plates.",
            "sent2": "The chef was dishing up the delicious soup for the customers.",
            "sent3": "While dishing out the salad, she accidentally dropped a tomato.",
            "sent4": "He was dishing out compliments to everyone at the party.",
            "sent5": "The cafeteria worker was dishing out mashed potatoes with a smile."
        },
        {
            "definition": "Present participle of dish: to gossip or talk about someone in a negative way",
            "pos": "verb",
            "sent1": "They were dishing about their classmate's new haircut.",
            "sent2": "The group of friends was dishing on the latest celebrity scandal.",
            "sent3": "She was dishing out the juicy details about the office drama.",
            "sent4": "The tabloids were dishing out rumors about the famous actress.",
            "sent5": "The neighbors were dishing on the new family that moved in next door."
        },
        {
            "definition": "Present participle of dish: to shape or mold something like a dish",
            "pos": "verb",
            "sent1": "The potter was dishing the clay into a beautiful bowl shape.",
            "sent2": "She was dishing the dough into individual pie pans.",
            "sent3": "He was dishing out the sand to create a dish-like sculpture.",
            "sent4": "The artist was dishing the metal into a unique dish design.",
            "sent5": "The chef was dishing the chocolate into decorative dessert molds."
        },
        {
            "definition": "Present participle of dish: to scoop or serve food onto a plate",
            "pos": "verb",
            "sent1": "The server was dishing the steaming curry onto the plates.",
            "sent2": "She was dishing the ice cream into bowls for the kids.",
            "sent3": "He was dishing out the hot soup carefully to avoid spills.",
            "sent4": "The caterer was dishing the appetizers onto small plates.",
            "sent5": "The cook was dishing the stir-fry onto the waiting plates."
        }
    ]
}