{
    "term": "dishpans",
    "meanings": [
        {
            "definition": "A large, shallow container used for washing dishes.",
            "pos": "noun",
            "sent1": "My mom filled the dishpans with soapy water to clean the dinner plates.",
            "sent2": "The restaurant kitchen had many stainless steel dishpans for washing dishes.",
            "sent3": "When the cat jumped into the dishpans, it made a soapy mess!",
            "sent4": "Her mind was a whirlwind of thoughts, swirling like dirty water in a dishpan.",
            "sent5": "The sunlight glinted off the clean dishpans, making them sparkle like diamonds."
        },
        {
            "definition": "A container for holding dirty dishes.",
            "pos": "noun",
            "sent1": "The busboy stacked the dirty dishes in the dishpans to take them to the kitchen.",
            "sent2": "The dishpans were overflowing with dirty plates and silverware after the big party.",
            "sent3": "The mischievous toddler tried to hide his toys in the dishpans filled with dirty dishes.",
            "sent4": "Her room was a mess, with clothes and books scattered like dirty dishes in a dishpan.",
            "sent5": "The smell of leftover food lingered in the dishpans, reminding her to wash them soon."
        },
        {
            "definition": "A pan used for washing dishes.",
            "pos": "noun",
            "sent1": "She scrubbed the burnt pot with a scouring pad before placing it in the dishpans.",
            "sent2": "The dishpans were filled with warm water and bubbles for washing the breakfast dishes.",
            "sent3": "The chef accidentally mistook the dishpan for a regular pan and used it to cook soup!",
            "sent4": "Her laughter bubbled up like the suds in the dishpan as she washed the dishes.",
            "sent5": "The clatter of dishes being washed echoed in the kitchen as she scrubbed them in the dishpans."
        }
    ]
}