{
    "term": "disinterested",
    "meanings": [
        {
            "definition": "Not influenced by personal interest or selfish motives.",
            "pos": "adjective",
            "sent1": "The judge remained disinterested throughout the trial, ensuring fairness.",
            "sent2": "It is important for a referee to be disinterested in order to make fair decisions.",
            "sent3": "The disinterested cat watched the mice play, not caring about catching them.",
            "sent4": "Her disinterested gaze seemed to see right through the deceptive sales pitch.",
            "sent5": "The disinterested scientist observed the experiment with a neutral perspective."
        },
        {
            "definition": "Unbiased or impartial.",
            "pos": "adjective",
            "sent1": "The disinterested party planner made decisions based solely on what was best for the event.",
            "sent2": "A disinterested mediator can help resolve conflicts fairly.",
            "sent3": "The disinterested weather forecaster predicted rain for the picnic, much to everyone's disappointment.",
            "sent4": "His disinterested opinion on the matter helped the team reach a fair compromise.",
            "sent5": "The disinterested judge listened to both sides of the argument without favoring either."
        },
        {
            "definition": "Having no stake or involvement in a particular matter.",
            "pos": "adjective",
            "sent1": "As a disinterested bystander, she observed the commotion without getting involved.",
            "sent2": "The disinterested volunteer simply wanted to help without seeking recognition.",
            "sent3": "The disinterested traveler wandered through the bustling market, unaffected by the vendors' calls.",
            "sent4": "The disinterested driver patiently waited for the traffic to clear, unconcerned about being late.",
            "sent5": "The disinterested student listened to the debate without taking sides."
        }
    ]
}