{
    "term": "disinterestedness",
    "meanings": [
        {
            "definition": "Lack of bias or prejudice",
            "pos": "noun",
            "sent1": "Her disinterestedness in the matter allowed for a fair decision to be made.",
            "sent2": "The judge's disinterestedness ensured a just outcome for all involved.",
            "sent3": "His disinterestedness in the game was so strong that he didn't even cheer for his own team.",
            "sent4": "The disinterestedness of the referee was like a beacon of fairness on the field.",
            "sent5": "The disinterestedness of the jury was crucial in delivering a verdict based solely on evidence."
        },
        {
            "definition": "Unbiased or impartial behavior",
            "pos": "noun",
            "sent1": "The journalist's disinterestedness in reporting the facts was commendable.",
            "sent2": "The professor's disinterestedness in grading allowed for objective evaluation of student work.",
            "sent3": "Her disinterestedness in the debate made her a trustworthy moderator.",
            "sent4": "The disinterestedness of the mediator helped both parties reach a fair agreement.",
            "sent5": "The disinterestedness of the committee members ensured a transparent decision-making process."
        },
        {
            "definition": "Not influenced by personal interest or gain",
            "pos": "adjective",
            "sent1": "His disinterestedness approach to negotiations earned him a reputation for integrity.",
            "sent2": "The lawyer's disinterestedness advice was valued for its objectivity.",
            "sent3": "The cat's disinterestedness gaze at the toy mouse puzzled the playful kitten.",
            "sent4": "The disinterestedness attitude of the philanthropist inspired others to give selflessly.",
            "sent5": "The disinterestedness nature of the volunteer was a refreshing change in a world driven by self-interest."
        }
    ]
}