{
    "term": "disinherited",
    "meanings": [
        {
            "definition": "Deprived of inheritance or succession rights.",
            "pos": "adjective",
            "sent1": "The poor orphan felt sad being disinherited from his family's wealth.",
            "sent2": "The siblings were upset when they found out they were disinherited from their grandfather's will.",
            "sent3": "The cat looked at the empty food bowl as if it had been disinherited of its treats.",
            "sent4": "The abandoned house seemed to be disinherited by time, with vines creeping up its walls.",
            "sent5": "The wilted flower appeared to be disinherited of sunlight, drooping in the shade."
        },
        {
            "definition": "Excluded from receiving an inheritance.",
            "pos": "adjective",
            "sent1": "The distant relative felt left out and disinherited from the family fortune.",
            "sent2": "The youngest son was disinherited and left with nothing but memories of his ancestors.",
            "sent3": "The forgotten toy in the attic seemed to be disinherited from playtime.",
            "sent4": "The old book on the shelf looked dusty and disinherited, untouched for years.",
            "sent5": "The abandoned building stood alone, disinherited from the bustling city life."
        },
        {
            "definition": "To cut off from inheritance or succession.",
            "pos": "verb",
            "sent1": "The king decided to disinherited his rebellious son from the throne.",
            "sent2": "The lawyer explained how the will disinherited the greedy nephew from the family fortune.",
            "sent3": "The mischievous squirrel seemed to disinherited the birds from their feeder.",
            "sent4": "The storm threatened to disinherited the fragile bridge from the mainland.",
            "sent5": "The strict teacher's rules seemed to disinherited any fun from the classroom."
        }
    ]
}