{
    "term": "disinvestment",
    "meanings": [
        {
            "definition": "The action of selling off investments or assets.",
            "pos": "noun",
            "sent1": "The disinvestment of stocks led to a decrease in the company's ownership.",
            "sent2": "The disinvestment of the property was necessary to cover the debts.",
            "sent3": "After the disinvestment, the company had more cash but fewer assets.",
            "sent4": "The disinvestment of the antique collection left the museum empty but financially stable.",
            "sent5": "His disinvestment strategy proved risky but profitable in the long run."
        },
        {
            "definition": "The act of withdrawing financial support or resources.",
            "pos": "noun",
            "sent1": "The disinvestment of funds from the project caused delays in its completion.",
            "sent2": "The disinvestment in the charity resulted in a decrease in aid to those in need.",
            "sent3": "Her disinvestment from the business venture surprised her partners.",
            "sent4": "The sudden disinvestment of resources left the team struggling to meet their goals.",
            "sent5": "The disinvestment in education had long-term negative effects on the community."
        },
        {
            "definition": "The process of reducing or eliminating investment in a particular sector or company.",
            "pos": "noun",
            "sent1": "The disinvestment in technology companies was a strategic move by the investor.",
            "sent2": "The disinvestment in the failing industry saved the company from bankruptcy.",
            "sent3": "The disinvestment in the outdated technology was necessary for progress.",
            "sent4": "The disinvestment in the company was a tough decision but proved beneficial.",
            "sent5": "The gradual disinvestment in the project signaled a shift in priorities."
        }
    ]
}