{
    "term": "dispensers",
    "meanings": [
        {
            "definition": "A person or thing that dispenses something, such as a machine that dispenses drinks.",
            "pos": "noun",
            "sent1": "The vending machine at school is a dispenser of snacks.",
            "sent2": "The water dispenser in the office provides cool water for everyone.",
            "sent3": "The candy dispenser seemed to have a mind of its own, giving out treats at random times.",
            "sent4": "Her smile was like a dispenser of happiness, spreading joy wherever she went.",
            "sent5": "The dispenser hummed softly as it released the colorful gumballs."
        },
        {
            "definition": "A container or device that dispenses a specific substance or product, such as a soap dispenser.",
            "pos": "noun",
            "sent1": "The hand sanitizer dispenser near the entrance helps keep germs away.",
            "sent2": "The automatic soap dispenser in the bathroom makes washing hands easy.",
            "sent3": "The ketchup dispenser at the diner always seems to squirt too much at once.",
            "sent4": "His words were like a dispenser of wisdom, guiding others with his advice.",
            "sent5": "The sunscreen dispenser at the beach ensures everyone stays protected from the sun."
        },
        {
            "definition": "A person who distributes or administers something, such as a dispenser of justice.",
            "pos": "noun",
            "sent1": "The librarian is a dispenser of knowledge, helping students find books.",
            "sent2": "The nurse is a dispenser of care, making sure patients are comfortable.",
            "sent3": "The judge, a dispenser of justice, always made fair decisions in court.",
            "sent4": "Her laughter was like a dispenser of joy, brightening up the room.",
            "sent5": "The teacher acted as a dispenser of encouragement, motivating her students to do their best."
        }
    ]
}