{
    "term": "displode",
    "meanings": [
        {
            "definition": "To burst or explode violently.",
            "pos": "verb",
            "sent1": "The firework seemed to displode in the night sky.",
            "sent2": "The balloon disploded with a loud bang.",
            "sent3": "The overly full water balloon decided to displode all over the backyard.",
            "sent4": "Her anger was like a volcano ready to displode at any moment.",
            "sent5": "The pressure inside the bottle was building up, ready to displode at any second."
        },
        {
            "definition": "To shatter or break into pieces.",
            "pos": "verb",
            "sent1": "The glass vase disploded into shards when it fell off the table.",
            "sent2": "The fragile mirror disploded into tiny fragments when it hit the floor.",
            "sent3": "The clumsy cat managed to displode the delicate vase with a single swipe of its paw.",
            "sent4": "His heart disploded into a million pieces when she said goodbye.",
            "sent5": "The impact of the hammer caused the rock to displode into pieces."
        },
        {
            "definition": "To cause to burst or explode.",
            "pos": "verb",
            "sent1": "The scientist accidentally disploded the chemicals by mixing them in the wrong order.",
            "sent2": "The loud noise disploded the silence of the night.",
            "sent3": "The unexpected joke disploded laughter among the audience.",
            "sent4": "His words had the power to displode her confidence in an instant.",
            "sent5": "The sudden burst of music disploded the calm atmosphere of the room."
        },
        {
            "definition": "To undergo a violent bursting or explosion.",
            "pos": "verb",
            "sent1": "The old building disploded in a cloud of dust during the demolition.",
            "sent2": "The pressure inside the container caused it to displode unexpectedly.",
            "sent3": "The balloon animals disploded in a comical way during the children's party.",
            "sent4": "The news of the scandal disploded in the media, causing chaos.",
            "sent5": "The volcano disploded with such force that it could be heard for miles around."
        }
    ]
}