{
    "term": "dispensary",
    "meanings": [
        {
            "definition": "A place where medicine or medical treatment is dispensed.",
            "pos": "noun",
            "sent1": "The dispensary at the hospital provided patients with their necessary medications.",
            "sent2": "I went to the dispensary to pick up my prescription for antibiotics.",
            "sent3": "The dispensary was so busy that the pharmacist started doing cartwheels to keep things interesting.",
            "sent4": "Her smile was a dispensary of comfort, easing the pain of those around her.",
            "sent5": "The dispensary gleamed with rows of neatly organized pill bottles, like a colorful candy store for health."
        },
        {
            "definition": "A store where prescription medications are sold.",
            "pos": "noun",
            "sent1": "My mom works at the local dispensary, helping people find the right medications.",
            "sent2": "The dispensary on the corner always has a long line of customers waiting for their prescriptions.",
            "sent3": "The dispensary cat became the unofficial mascot, greeting customers with a purr.",
            "sent4": "In her eyes, the dispensary held the key to healing, a treasure trove of remedies.",
            "sent5": "The neon sign outside the dispensary flickered, beckoning those in need of relief."
        },
        {
            "definition": "A facility where cannabis products are sold legally.",
            "pos": "noun",
            "sent1": "The dispensary down the street offers a variety of cannabis products for medical use.",
            "sent2": "Many people visit the dispensary to purchase CBD oil for its therapeutic benefits.",
            "sent3": "The dispensary's security guard was a former pro wrestler, ensuring a safe shopping experience.",
            "sent4": "The dispensary was a garden of green, where pain and stress wilted away.",
            "sent5": "Entering the dispensary felt like stepping into a fragrant oasis of relaxation and relief."
        }
    ]
}