{
    "term": "disqualification",
    "meanings": [
        {
            "definition": "The act of disqualifying or the state of being disqualified.",
            "pos": "noun",
            "sent1": "Her disqualification from the race was a disappointment for her team.",
            "sent2": "The judge's disqualification of the player was fair and necessary.",
            "sent3": "The disqualification of the cat from the mouse-catching contest left everyone surprised.",
            "sent4": "His disqualification from the talent show felt like a sudden storm on a sunny day.",
            "sent5": "The disqualification of the student was like a red flag warning others to follow the rules."
        },
        {
            "definition": "The action of declaring someone ineligible for something.",
            "pos": "noun",
            "sent1": "The disqualification of the contestant shocked the audience.",
            "sent2": "The disqualification of the candidate was due to a breach of the rules.",
            "sent3": "The disqualification of the dog from the treat-eating contest was met with laughter.",
            "sent4": "Her disqualification from the team felt like being left out in the cold.",
            "sent5": "The disqualification of the driver was a clear signal of the consequences of reckless behavior."
        },
        {
            "definition": "The process of ruling someone out of a competition or event.",
            "pos": "noun",
            "sent1": "The disqualification of the athlete changed the course of the game.",
            "sent2": "The disqualification of the team was a result of their misconduct.",
            "sent3": "The disqualification of the robot from the dance-off was unexpected and amusing.",
            "sent4": "His disqualification from the chess tournament felt like losing a key piece on the board.",
            "sent5": "The disqualification of the singer was a dramatic twist in the competition."
        }
    ]
}