{
    "term": "dissipated",
    "meanings": [
        {
            "definition": "To scatter in various directions",
            "pos": "verb",
            "sent1": "The wind dissipated the leaves across the yard.",
            "sent2": "She watched as the smoke dissipated into the air.",
            "sent3": "The magician's trick was to make the cards dissipated into thin air.",
            "sent4": "His anger dissipated like mist in the morning sun.",
            "sent5": "The crowd dissipated after the concert ended."
        },
        {
            "definition": "To indulge in excessive pleasure or luxury",
            "pos": "verb",
            "sent1": "He dissipated his wealth on extravagant vacations.",
            "sent2": "She would often dissipated her time in fancy restaurants.",
            "sent3": "The cat dissipated in the sun all day long.",
            "sent4": "Her worries dissipated as she relaxed in the spa.",
            "sent5": "The children dissipated in laughter at the amusement park."
        },
        {
            "definition": "Wasted or squandered",
            "pos": "adjective",
            "sent1": "The dissipated money left him in financial trouble.",
            "sent2": "She regretted her dissipated opportunities in the past.",
            "sent3": "The dissipated food in the fridge had to be thrown away.",
            "sent4": "His dissipated efforts resulted in failure.",
            "sent5": "The dissipated time could have been used more productively."
        },
        {
            "definition": "Dispersed or scattered in various directions",
            "pos": "adjective",
            "sent1": "The dissipated clouds allowed the sun to shine through.",
            "sent2": "The dissipated crowd slowly left the stadium.",
            "sent3": "The dissipated confetti covered the ground after the celebration.",
            "sent4": "Her dissipated thoughts made it hard to focus.",
            "sent5": "The dissipated scent of flowers filled the garden."
        }
    ]
}