{
    "term": "distraught",
    "meanings": [
        {
            "definition": "Deeply upset and agitated.",
            "pos": "adjective",
            "sent1": "The distraught child cried inconsolably after losing his favorite toy.",
            "sent2": "She looked distraught when she realized she had missed her flight.",
            "sent3": "The distraught puppy couldn't find its favorite chew toy and started barking at socks instead.",
            "sent4": "His distraught mind was a stormy sea of emotions, crashing against the shores of reason.",
            "sent5": "The image of the distraught woman clutching her chest will forever be etched in my memory."
        },
        {
            "definition": "Showing great distress or worry.",
            "pos": "adjective",
            "sent1": "The teacher's distraught expression revealed her concern for the struggling student.",
            "sent2": "The family was distraught when they heard about the accident.",
            "sent3": "The distraught squirrel frantically searched for its buried acorn, forgetting where it had hidden it.",
            "sent4": "The distraught sky mirrored the turmoil in her heart, dark clouds looming over the horizon.",
            "sent5": "His distraught voice trembled with fear as he recounted the harrowing experience."
        },
        {
            "definition": "Extremely troubled or confused.",
            "pos": "adjective",
            "sent1": "The distraught man wandered the streets aimlessly, unable to remember where he lived.",
            "sent2": "She felt distraught trying to solve the complex puzzle with missing pieces.",
            "sent3": "The distraught chicken ran around in circles, unsure of which way to go to escape the fox.",
            "sent4": "In the midst of chaos, her distraught thoughts were like tangled threads, impossible to unravel.",
            "sent5": "The distraught maze seemed to mock him, its twists and turns leading nowhere but to frustration."
        }
    ]
}