{
    "term": "distempered",
    "meanings": [
        {
            "definition": "Disturbed or disordered in mind or body.",
            "pos": "adjective",
            "sent1": "The distempered cat wandered aimlessly around the yard, showing signs of confusion.",
            "sent2": "The doctor diagnosed the patient with a distempered mind, recommending rest and relaxation.",
            "sent3": "The distempered squirrel kept forgetting where it buried its nuts, causing chaos in the garden.",
            "sent4": "Her distempered thoughts were like a storm raging inside her head, making it hard to focus.",
            "sent5": "The image of the distempered painting, with its colors all mixed up, stayed in his mind for days."
        },
        {
            "definition": "To disturb the temper or disposition of; to derange; to ruffle.",
            "pos": "verb",
            "sent1": "The noisy neighbors distempered her peaceful evening with their loud music.",
            "sent2": "His constant complaints about the weather distempered everyone's mood at the picnic.",
            "sent3": "The mischievous puppy distempered the calm household by chewing on everyone's shoes.",
            "sent4": "The unexpected news distempered her plans for the weekend, leaving her feeling unsettled.",
            "sent5": "The arrival of the unexpected guests distempered the carefully laid out party arrangements."
        },
        {
            "definition": "To deprive of temper or moderation; to disturb; to ruffle.",
            "pos": "verb",
            "sent1": "The strong winds distempered the calm surface of the lake, creating waves.",
            "sent2": "His harsh words distempered the peaceful atmosphere of the room, causing tension.",
            "sent3": "The mischievous child distempered the orderly classroom by rearranging all the desks.",
            "sent4": "The sudden change in plans distempered her carefully organized schedule, leaving her flustered.",
            "sent5": "The unexpected turn of events distempered the usually smooth flow of the project, causing delays."
        }
    ]
}