{
    "term": "distort",
    "meanings": [
        {
            "definition": "Pull or twist out of shape",
            "pos": "verb",
            "sent1": "She tried to distort the rubber band by stretching it too far.",
            "sent2": "The artist accidentally distorted the clay sculpture while shaping it.",
            "sent3": "The mischievous puppy managed to distort the perfectly round ball into a lopsided shape.",
            "sent4": "The strong wind began to distort the shape of the flag, making it ripple and twist.",
            "sent5": "The heat caused the plastic ruler to distort, bending it out of its original form."
        },
        {
            "definition": "Give a misleading or false account or impression of",
            "pos": "verb",
            "sent1": "The tabloid newspaper often tries to distort the truth to sell more copies.",
            "sent2": "It is unethical to distort facts in order to win an argument.",
            "sent3": "The magician's mirror distorted his reflection, making him appear shorter than he actually was.",
            "sent4": "The funhouse mirrors distorted the image of the visitors, making them look funny and exaggerated.",
            "sent5": "The old photograph had faded and distorted over time, making it hard to recognize the people in it."
        },
        {
            "definition": "Alter the form of (an electrical signal or sound wave) by increasing some frequencies more than others.",
            "pos": "verb",
            "sent1": "The radio receiver can distort the sound if the frequencies are not balanced correctly.",
            "sent2": "Be careful not to distort the audio signal when adjusting the volume on the amplifier.",
            "sent3": "The faulty speaker began to distort the music, making it sound scratchy and unclear.",
            "sent4": "The old record player would sometimes distort the vinyl records, creating a unique sound effect.",
            "sent5": "The microphone started to distort the singer's voice when the volume was turned up too high."
        }
    ]
}