{
    "term": "distancing",
    "meanings": [
        {
            "definition": "The act of creating space between oneself and others.",
            "pos": "noun",
            "sent1": "During the pandemic, social distancing became a common practice to prevent the spread of germs.",
            "sent2": "She felt uncomfortable with the lack of distancing between the tables at the restaurant.",
            "sent3": "The cat practiced social distancing from the playful puppy.",
            "sent4": "The distancing between the two rival teams was palpable on the field.",
            "sent5": "The distancing between the siblings grew as they argued over the last piece of cake."
        },
        {
            "definition": "The process of becoming detached or disconnected from something.",
            "pos": "noun",
            "sent1": "After the breakup, she needed some emotional distancing from her ex-boyfriend.",
            "sent2": "The distancing from social media helped him focus on his studies.",
            "sent3": "The distancing from technology made him appreciate nature more.",
            "sent4": "The distancing from negative influences improved her mental health.",
            "sent5": "The distancing from toxic relationships allowed her to thrive independently."
        },
        {
            "definition": "The act of maintaining a physical or emotional distance.",
            "pos": "noun",
            "sent1": "Professional therapists often emphasize the importance of emotional distancing in certain situations.",
            "sent2": "The emotional distancing between the characters added depth to the storyline.",
            "sent3": "The physical distancing between the actors on stage created a sense of mystery.",
            "sent4": "The emotional distancing between friends was evident in their strained conversations.",
            "sent5": "The physical distancing during the argument highlighted the tension between them."
        }
    ]
}