{
    "term": "distress",
    "meanings": [
        {
            "definition": "Extreme anxiety, sorrow, or pain",
            "pos": "noun",
            "sent1": "The little girl was in distress when she lost her favorite toy.",
            "sent2": "The soldier felt distress after witnessing the horrors of war.",
            "sent3": "The distressed puppy couldn't find its bone, causing a comical scene.",
            "sent4": "Her heart was a storm of distress, raging with sorrow and pain.",
            "sent5": "The distress in her eyes was palpable, reflecting her inner turmoil."
        },
        {
            "definition": "Physical suffering or discomfort",
            "pos": "noun",
            "sent1": "His distress from the injury was evident in his pained expression.",
            "sent2": "The hiker experienced distress in his legs after the long trek.",
            "sent3": "The distressed chair creaked under the weight of the heavy man, adding to his discomfort.",
            "sent4": "The old building showed signs of distress, with cracks and peeling paint.",
            "sent5": "The distress in her voice revealed the physical pain she was enduring."
        },
        {
            "definition": "A state of danger or desperate need",
            "pos": "noun",
            "sent1": "The ship was in distress as it battled the stormy seas.",
            "sent2": "The distress of the stranded hikers grew as night fell in the wilderness.",
            "sent3": "The distressed call for help echoed through the canyon, signaling their urgent need.",
            "sent4": "The town came together in times of distress, supporting each other in times of need.",
            "sent5": "The distress signal sent out by the lost hikers was finally spotted by the rescue team."
        },
        {
            "definition": "To cause someone to feel extreme anxiety or sorrow",
            "pos": "verb",
            "sent1": "The news of the accident distressed her deeply.",
            "sent2": "His harsh words distressed his friend, causing hurt feelings.",
            "sent3": "The prank to distress her with a fake spider backfired when she laughed instead.",
            "sent4": "The thought of losing her distressed him to the core.",
            "sent5": "The movie's tragic ending distressed the audience, leaving them in tears."
        },
        {
            "definition": "To suffer from extreme anxiety or sorrow",
            "pos": "verb",
            "sent1": "She distressed over the upcoming exam, fearing failure.",
            "sent2": "He distressed silently, not wanting to burden others with his worries.",
            "sent3": "The cat distressed when it couldn't find its favorite toy, meowing in confusion.",
            "sent4": "The tree distressed in the harsh winter, its branches heavy with snow.",
            "sent5": "The child distressed at the thought of being separated from their parents, tears streaming down their face."
        }
    ]
}