{
    "term": "distresses",
    "meanings": [
        {
            "definition": "Extreme anxiety, sorrow, or pain",
            "pos": "noun",
            "sent1": "The news of her failing health brought great distresses to the family.",
            "sent2": "She couldn't hide her distresses when she received the heartbreaking letter.",
            "sent3": "The puppy's distresses over losing its favorite toy were quite evident.",
            "sent4": "The storm's fury caused distresses to the fragile roof of the old house.",
            "sent5": "The soldier's face showed the distresses of war etched in every line."
        },
        {
            "definition": "Physical or mental suffering",
            "pos": "noun",
            "sent1": "His constant distresses from the injury made it hard for him to sleep.",
            "sent2": "The patient's distresses were evident in the way he winced with every movement.",
            "sent3": "The comedian's act was a humorous take on the distresses of daily life.",
            "sent4": "The mountain climber's distresses were like weights dragging him down.",
            "sent5": "The character in the book faced distresses that tested his resilience."
        },
        {
            "definition": "Financial hardship or difficulty",
            "pos": "noun",
            "sent1": "The family's distresses were compounded by unexpected medical bills.",
            "sent2": "The company faced severe distresses due to the economic downturn.",
            "sent3": "The cartoon character's financial distresses led to comical mishaps.",
            "sent4": "The business owner navigated through distresses with determination.",
            "sent5": "The community came together to support each other during financial distresses."
        },
        {
            "definition": "To cause someone to feel anxious, sorrowful, or in pain",
            "pos": "verb",
            "sent1": "The constant noise from the construction site distresses the residents.",
            "sent2": "She didn't want to distress her friend by sharing the bad news.",
            "sent3": "The mischievous kitten distresses the older cat with its playful antics.",
            "sent4": "The dark clouds distress the farmer as he worries about his crops.",
            "sent5": "The teacher didn't want to distress the students with too much homework."
        },
        {
            "definition": "To seize someone's property in order to force payment of a debt",
            "pos": "verb",
            "sent1": "The creditor may distress the debtor's assets if the debt is not repaid.",
            "sent2": "The landlord cannot distress the tenant's belongings without proper legal notice.",
            "sent3": "The bank had to distress the property to recover the outstanding loan amount.",
            "sent4": "The court allowed the lender to distress the property as per the agreement.",
            "sent5": "The collector had to distress the antique furniture to settle the debt."
        }
    ]
}