{
    "term": "dive",
    "meanings": [
        {
            "definition": "Plunge headfirst into water.",
            "pos": "verb",
            "sent1": "I love to dive into the pool on hot days.",
            "sent2": "She watched the diver gracefully dive off the diving board.",
            "sent3": "The little boy pretended to dive into a pool of imaginary jelly.",
            "sent4": "Her courage made her dive into the unknown challenges ahead.",
            "sent5": "The dolphin's dive was so smooth and elegant."
        },
        {
            "definition": "Swim underwater using a breathing apparatus.",
            "pos": "verb",
            "sent1": "We can dive and explore the colorful coral reefs.",
            "sent2": "The scuba divers planned to dive near the shipwreck.",
            "sent3": "The fish wanted to learn how to dive with scuba gear.",
            "sent4": "In her dream, she could dive to the depths of the ocean effortlessly.",
            "sent5": "The underwater photographer captured a stunning dive."
        },
        {
            "definition": "Jump or fall quickly downward.",
            "pos": "verb",
            "sent1": "The skydiver was ready to dive from the plane.",
            "sent2": "The bird decided to dive down to catch its prey.",
            "sent3": "The squirrel made a daring dive from the tree to the ground.",
            "sent4": "The price of the stock took a sudden dive in the market.",
            "sent5": "The roller coaster's dive was thrilling and fast."
        },
        {
            "definition": "A cheap or disreputable bar or nightclub.",
            "pos": "noun",
            "sent1": "Let's grab a quick drink at the local dive.",
            "sent2": "The detective found a clue in the dimly lit dive bar.",
            "sent3": "The dive was surprisingly lively for a weekday night.",
            "sent4": "The old dive had a mysterious charm that attracted regulars.",
            "sent5": "The dive's neon sign flickered in the night, inviting passersby."
        }
    ]
}