{
    "term": "division",
    "meanings": [
        {
            "definition": "The act or process of dividing or separating into parts",
            "pos": "noun",
            "sent1": "The teacher explained the division of the class into groups.",
            "sent2": "The division of the cake into slices was done carefully.",
            "sent3": "The division of chores among siblings led to a fair distribution.",
            "sent4": "The division of labor in the factory ensured efficiency.",
            "sent5": "The division of the puzzle pieces made it easier to solve."
        },
        {
            "definition": "A separate part or section",
            "pos": "noun",
            "sent1": "The toy store had a special division for board games.",
            "sent2": "The book is divided into chapters, each division telling a different story.",
            "sent3": "The division of the store into sections made shopping convenient.",
            "sent4": "The division of the garden into plots allowed for different plants to thrive.",
            "sent5": "The division of the city into neighborhoods created a sense of community."
        },
        {
            "definition": "The process of finding how many times one number is contained in another",
            "pos": "noun",
            "sent1": "In math class, we learned long division to solve problems.",
            "sent2": "The division of 12 by 3 equals 4.",
            "sent3": "The division of candies among friends was a fun math game.",
            "sent4": "The division of apples into equal groups helped us share fairly.",
            "sent5": "The division of the pizza into slices made it easy to split."
        },
        {
            "definition": "A disagreement or conflict between groups or individuals",
            "pos": "noun",
            "sent1": "The division between the two friends was caused by a misunderstanding.",
            "sent2": "The political division in the country led to heated debates.",
            "sent3": "The division over which movie to watch resulted in a compromise.",
            "sent4": "The division between the two teams intensified during the game.",
            "sent5": "The division between the siblings was resolved through communication."
        }
    ]
}