{
    "term": "divides",
    "meanings": [
        {
            "definition": "Separate or be separated into parts",
            "pos": "verb",
            "sent1": "The river divides the forest into two sections.",
            "sent2": "The knife easily divides the cake into slices.",
            "sent3": "The magician's trick was to make the scarf divides into two pieces.",
            "sent4": "The invisible line divides the playground into two territories.",
            "sent5": "The earthquake divides the road, making it impassable."
        },
        {
            "definition": "Cause to separate into parts",
            "pos": "verb",
            "sent1": "She divides the puzzle pieces to make it easier to solve.",
            "sent2": "The teacher divides the class into groups for a project.",
            "sent3": "The wind divides the sand into small dunes.",
            "sent4": "The chef skillfully divides the dough into equal portions.",
            "sent5": "The explosion divides the rock into fragments."
        },
        {
            "definition": "Act as a barrier between two things",
            "pos": "verb",
            "sent1": "The wall divides the garden from the street.",
            "sent2": "The mountain range divides the two countries.",
            "sent3": "The thick fog divides the field from view.",
            "sent4": "The language barrier divides them from understanding each other.",
            "sent5": "The fence divides the backyard from the front yard."
        },
        {
            "definition": "Disagree or cause disagreement between people or groups",
            "pos": "verb",
            "sent1": "Their conflicting opinions on the matter divides the team.",
            "sent2": "The controversial topic divides the community.",
            "sent3": "The silly argument divides the friends for a moment.",
            "sent4": "The political issue divides the nation into opposing sides.",
            "sent5": "The misunderstanding divides the family temporarily."
        }
    ]
}