{
    "term": "divide",
    "meanings": [
        {
            "definition": "Separate or split into parts",
            "pos": "verb",
            "sent1": "I will divide the cake into equal slices for everyone.",
            "sent2": "Can you divide the candies between the two of us?",
            "sent3": "The magician tried to divide the rabbit into two, but it didn't work.",
            "sent4": "The river seemed to divide the forest in half, creating a natural barrier.",
            "sent5": "She used a knife to carefully divide the paper along the dotted line."
        },
        {
            "definition": "Cause to be separate or different",
            "pos": "verb",
            "sent1": "His actions will divide the group into two opposing sides.",
            "sent2": "The decision to move to a new city will divide our family.",
            "sent3": "The silly argument over ice cream flavors will divide us forever.",
            "sent4": "The unexpected news seemed to divide their once strong bond.",
            "sent5": "The new rule will divide the students into those who agree and those who don't."
        },
        {
            "definition": "Mark off or separate into sections",
            "pos": "verb",
            "sent1": "Please divide the page into three equal parts for the activity.",
            "sent2": "The teacher will divide the class into groups for the project.",
            "sent3": "He tried to divide the map into neat sections, but it ended up messy.",
            "sent4": "The garden was divided into colorful sections of flowers and vegetables.",
            "sent5": "The city was divided into districts for better management."
        },
        {
            "definition": "Be a dividing line or boundary",
            "pos": "verb",
            "sent1": "The tall fence will divide our backyard from the neighbor's.",
            "sent2": "The river serves to divide the two counties in this region.",
            "sent3": "The old stone wall seemed to divide the haunted house from the rest of the town.",
            "sent4": "The mountain range acts as a natural barrier to divide the two countries.",
            "sent5": "The road seemed to divide the forest into two distinct ecosystems."
        }
    ]
}