{
    "term": "divis",
    "meanings": [
        {
            "definition": "To separate or split into parts",
            "pos": "verb",
            "sent1": "She decided to divis the cake into smaller slices for everyone to enjoy.",
            "sent2": "The teacher asked the students to divis into groups for the group project.",
            "sent3": "The magician used a special wand to divis the scarf into two pieces, surprising the audience.",
            "sent4": "The storm threatened to divis the peaceful town, causing chaos and destruction.",
            "sent5": "The chef's skillful hands were able to divis the ingredients perfectly, creating a delicious dish."
        },
        {
            "definition": "A divisive person or thing",
            "pos": "noun",
            "sent1": "The politician was known to be a divis in the community, often causing disagreements among the residents.",
            "sent2": "The controversial decision became a major divis among the members of the committee.",
            "sent3": "The new movie proved to be a divis, with some viewers loving it and others strongly disliking it.",
            "sent4": "Her presence at the party acted as a divis, with some guests enjoying her company while others avoided her.",
            "sent5": "The issue of taxes was a significant divis in the debate, leading to heated arguments among the participants."
        },
        {
            "definition": "A unit of currency in Bosnia and Herzegovina",
            "pos": "noun",
            "sent1": "He exchanged his euros for divis before traveling to Bosnia and Herzegovina.",
            "sent2": "The souvenir shop accepted both euros and divis as payment for the local crafts.",
            "sent3": "The tourist was surprised by the colorful design of the divis used in the market.",
            "sent4": "The value of the divis fluctuated in the international market, affecting the country's economy.",
            "sent5": "The street vendor happily counted the divis he earned from selling handmade goods to tourists."
        }
    ]
}