{
    "term": "djinny",
    "meanings": [
        {
            "definition": "A supernatural being in Islamic mythology, typically capable of granting wishes.",
            "pos": "noun",
            "sent1": "The djinny appeared in a puff of smoke, ready to grant the young girl's wish.",
            "sent2": "Legends speak of a djinny who lived in an ancient lamp and granted three wishes.",
            "sent3": "The mischievous djinny granted the wish for a million dollars, but in pennies!",
            "sent4": "Her kindness was like a djinny, granting wishes to all who crossed her path.",
            "sent5": "The djinny's magic was so powerful, it could make dreams come true with a mere whisper."
        },
        {
            "definition": "A type of bottle or vessel used for holding liquids, especially in the Middle East.",
            "pos": "noun",
            "sent1": "The waiter brought a beautiful djinny filled with aromatic tea to the table.",
            "sent2": "In the market, vendors displayed colorful djinnies filled with spices and oils.",
            "sent3": "The djinny toppled over, spilling its contents of fragrant rose water everywhere.",
            "sent4": "Her laughter bubbled out of her like liquid from a djinny, infectious and joyful.",
            "sent5": "The djinny's curves and patterns were as intricate as the flavors it held within."
        },
        {
            "definition": "A type of fabric or clothing material, often made from silk or cotton.",
            "pos": "noun",
            "sent1": "She wore a flowing dress made of the finest djinny, shimmering in the sunlight.",
            "sent2": "The tailor specialized in creating garments from delicate djinny for the royal family.",
            "sent3": "The mischievous kitten tangled itself in the soft djinny, leaving a trail of threads behind.",
            "sent4": "Her words wrapped around him like a comforting djinny, soft and reassuring.",
            "sent5": "The djinny felt like a second skin, light and airy against the summer breeze."
        }
    ]
}