{
    "term": "doating",
    "meanings": [
        {
            "definition": "To show excessive fondness or love for someone or something.",
            "pos": "verb",
            "sent1": "She was doating on her new puppy, giving it endless cuddles and kisses.",
            "sent2": "The grandmother was doating on her grandchildren, spoiling them with treats and toys.",
            "sent3": "The cat was doating on its reflection in the mirror, thinking it found a new friend.",
            "sent4": "His doating love for her was like a warm blanket on a cold night, comforting and unwavering.",
            "sent5": "The doating mother hen watched over her chicks with a vigilant eye, always ready to protect them."
        },
        {
            "definition": "To be excessively fond or affectionate.",
            "pos": "verb",
            "sent1": "The little girl was doating on her favorite doll, carrying it everywhere she went.",
            "sent2": "He was doating on his vintage car, spending hours polishing it to perfection.",
            "sent3": "The dog was doating on its squeaky toy, refusing to let anyone else play with it.",
            "sent4": "Her doating affection for him was like a beacon of light in his darkest days, guiding him home.",
            "sent5": "The doating fan collected every piece of memorabilia related to her favorite band, creating a shrine of love."
        },
        {
            "definition": "To be foolishly or excessively fond.",
            "pos": "verb",
            "sent1": "She was doating on the idea of becoming a famous singer, despite never having sung before.",
            "sent2": "He was doating on the notion of winning the lottery, spending all his money on tickets.",
            "sent3": "The cat was doating on the laser pointer, chasing the elusive red dot for hours on end.",
            "sent4": "Their doating obsession with social media was like a black hole, sucking up all their time and attention.",
            "sent5": "The doating child believed in the magic of the tooth fairy, leaving extravagant gifts under the pillow every night."
        }
    ]
}