{
    "term": "dobie",
    "meanings": [
        {
            "definition": "A type of adobe brick made of clay and straw.",
            "pos": "noun",
            "sent1": "The house was built using dobies for the walls.",
            "sent2": "The dobies were stacked neatly to create a sturdy structure.",
            "sent3": "The dobies in the wall looked like giant building blocks.",
            "sent4": "The dobies held together tightly, forming a solid barrier.",
            "sent5": "The sun warmed the dobies, making the house cozy."
        },
        {
            "definition": "A person's nickname or surname.",
            "pos": "noun",
            "sent1": "His friends called him Dobie because of his last name.",
            "sent2": "Dobie was a common nickname for people with the last name Dobson.",
            "sent3": "Hey, Dobie, can you pass the salt over here?",
            "sent4": "She affectionately referred to her brother as Dobie Bear.",
            "sent5": "The teacher always remembered Dobie's name because it was unique."
        },
        {
            "definition": "To clean or polish a surface, especially a car.",
            "pos": "verb",
            "sent1": "He decided to dobied his car to make it shine for the weekend.",
            "sent2": "She carefully dobied the windows to remove any streaks.",
            "sent3": "After he dobied the car, it looked brand new.",
            "sent4": "The car sparkled after she dobied it for hours.",
            "sent5": "Dobieing the car was hard work, but the result was worth it."
        },
        {
            "definition": "A type of fabric made from wool or cotton.",
            "pos": "noun",
            "sent1": "She sewed a beautiful dress using dobies as the main fabric.",
            "sent2": "The dobies were soft to the touch and perfect for winter clothes.",
            "sent3": "The dobies in the quilt added a cozy feel to the room.",
            "sent4": "The dobies in the blanket kept her warm on chilly nights.",
            "sent5": "The dobies in the scarf were dyed in vibrant colors."
        }
    ]
}