{
    "term": "docking",
    "meanings": [
        {
            "definition": "To bring a ship into a dock for repairs or loading/unloading.",
            "pos": "verb",
            "sent1": "The captain skillfully guided the ship for docking at the harbor.",
            "sent2": "The workers will be docking the cargo ship at the port tomorrow.",
            "sent3": "The sailors joked that the ship was so good at docking, it could park itself.",
            "sent4": "The ship's docking maneuver was as precise as a surgeon's scalpel.",
            "sent5": "The docking process was like fitting puzzle pieces together perfectly."
        },
        {
            "definition": "To connect or join two objects together.",
            "pos": "verb",
            "sent1": "I will be docking the two pieces of wood to build a birdhouse.",
            "sent2": "The astronaut will be docking the spacecraft with the space station.",
            "sent3": "The magnets seemed to enjoy docking together, forming a strong bond.",
            "sent4": "Her words and actions docked perfectly, creating a seamless presentation.",
            "sent5": "The idea of docking the two ideas seemed impossible until she found a way."
        },
        {
            "definition": "The act of cutting off the tail of an animal.",
            "pos": "noun",
            "sent1": "The vet performed the docking on the puppy's tail to prevent future injuries.",
            "sent2": "The farmer learned the proper technique for docking sheep tails.",
            "sent3": "The children giggled at the idea of a tail docking party for the animals.",
            "sent4": "In the story, the evil witch's punishment was a magical docking of her tail.",
            "sent5": "The docking of the tail was a common practice among certain dog breeds."
        },
        {
            "definition": "A device used to connect electronic devices.",
            "pos": "noun",
            "sent1": "The new docking station made it easy to charge multiple devices at once.",
            "sent2": "She plugged her phone into the docking station to sync her music.",
            "sent3": "The tech-savvy teenager proudly showed off his latest docking invention.",
            "sent4": "The docking device revolutionized the way people connected their gadgets.",
            "sent5": "The docking system seamlessly integrated all her devices for easy access."
        }
    ]
}