{
    "term": "doctorship",
    "meanings": [
        {
            "definition": "The position or status of being a doctor.",
            "pos": "noun",
            "sent1": "Her doctorship was evident as she confidently walked through the hospital halls.",
            "sent2": "In the hospital, the doctorship of the head physician was respected by all.",
            "sent3": "The doctorship of the young medical student was put to the test during her first surgery.",
            "sent4": "His doctorship shone through as he calmly handled the emergency room chaos.",
            "sent5": "The doctorship of the experienced surgeon saved many lives during the crisis."
        },
        {
            "definition": "The skill or knowledge of a doctor.",
            "pos": "noun",
            "sent1": "His doctorship in diagnosing rare diseases was unmatched in the medical community.",
            "sent2": "The doctorship of the pediatrician was evident in her gentle care for children.",
            "sent3": "The doctorship of the new intern was put to the test during a complex surgery.",
            "sent4": "Her doctorship in treating elderly patients with care and respect was truly admirable.",
            "sent5": "The doctorship of the neurosurgeon was crucial in saving the patient's life."
        },
        {
            "definition": "The act of practicing medicine as a doctor.",
            "pos": "noun",
            "sent1": "After years of study, she finally began her doctorship at the local clinic.",
            "sent2": "His doctorship involved long hours at the hospital, caring for those in need.",
            "sent3": "The doctorship of the medical team was put to the test during the flu outbreak.",
            "sent4": "Her doctorship in the emergency room was a testament to her dedication to helping others.",
            "sent5": "The doctorship of the paramedics was crucial in providing immediate care to the accident victims."
        }
    ]
}