{
    "term": "doctrinaires",
    "meanings": [
        {
            "definition": "A person who seeks to impose a doctrine without regard to practical considerations.",
            "pos": "noun",
            "sent1": "The doctrinaires in the meeting insisted on following the rules exactly.",
            "sent2": "The group of doctrinaires refused to consider any alternative ideas.",
            "sent3": "The doctrinaires at the debate were so focused on their beliefs that they forgot to listen to others.",
            "sent4": "She was a doctrinaire when it came to organizing events, sticking strictly to the plan.",
            "sent5": "The image of the doctrinaires standing firm in their beliefs is hard to forget."
        },
        {
            "definition": "Adhering strictly to a particular doctrine or set of principles.",
            "pos": "adjective",
            "sent1": "His doctrinaires approach to teaching left little room for creativity.",
            "sent2": "The company had a doctrinaires policy of always wearing formal attire.",
            "sent3": "It was amusing to see how doctrinaires he was about his morning routine.",
            "sent4": "Her doctrinaires stance on the issue made compromise impossible.",
            "sent5": "The doctrinaires nature of the rules made them difficult to change."
        },
        {
            "definition": "Characterized by inflexible adherence to a doctrine or theory.",
            "pos": "adjective",
            "sent1": "The doctrinaires professor never accepted any alternative viewpoints.",
            "sent2": "She had a doctrinaires belief in the power of positive thinking.",
            "sent3": "It was funny how doctrinaires he was about always eating his sandwich at noon.",
            "sent4": "The team's doctrinaires approach to problem-solving limited their creativity.",
            "sent5": "The doctrinaires nature of the policy stifled innovation in the company."
        }
    ]
}