{
    "term": "doen",
    "meanings": [
        {
            "definition": "To perform or execute",
            "pos": "verb",
            "sent1": "I will doen a magic trick for you.",
            "sent2": "She likes to doen her dance routine every morning.",
            "sent3": "The robot tried to doen a backflip but fell over.",
            "sent4": "He can doen a perfect imitation of a bird chirping.",
            "sent5": "Let's watch the juggler doen his amazing tricks."
        },
        {
            "definition": "To bring about or accomplish",
            "pos": "verb",
            "sent1": "We need to doen our plan to save the environment.",
            "sent2": "The team worked hard to doen their goal of winning the championship.",
            "sent3": "The chef will doen a delicious meal for the guests.",
            "sent4": "Her smile can doen a sense of happiness in the room.",
            "sent5": "Let's all work together to doen positive change in the community."
        },
        {
            "definition": "To put on or wear",
            "pos": "verb",
            "sent1": "She will doen her favorite dress to the party.",
            "sent2": "He likes to doen his superhero costume on Halloween.",
            "sent3": "The cat tried to doen a tiny hat but it kept falling off.",
            "sent4": "The actor will doen a disguise to sneak into the party.",
            "sent5": "Let's all doen our best outfits for the fashion show."
        },
        {
            "definition": "To finish or complete",
            "pos": "verb",
            "sent1": "I need to doen my homework before bedtime.",
            "sent2": "The artist will doen the final touches on the painting.",
            "sent3": "The baker will doen baking the cake in time for the party.",
            "sent4": "The puzzle pieces will doen the picture when assembled.",
            "sent5": "Let's all work together to doen the project before the deadline."
        }
    ]
}