{
    "term": "dog",
    "meanings": [
        {
            "definition": "A domesticated carnivorous mammal (Canis familiaris) related to the foxes and wolves and raised in a wide variety of breeds for hunting, herding, pulling loads, guarding, and companionship.",
            "pos": "noun",
            "sent1": "My neighbor has a friendly dog that loves to play fetch.",
            "sent2": "The dog barked loudly when the mailman arrived.",
            "sent3": "The dog chased its tail in circles, making everyone laugh.",
            "sent4": "Her determination to succeed was like a dog chasing a squirrel.",
            "sent5": "The dog's wagging tail showed its excitement to see its owner."
        },
        {
            "definition": "A male animal of the dog family.",
            "pos": "noun",
            "sent1": "The father dog protected his puppies from harm.",
            "sent2": "The dog's howl echoed through the forest at night.",
            "sent3": "The big dog tried to act tough but was actually scared of thunder.",
            "sent4": "He was loyal to his friends, like a faithful dog to its pack.",
            "sent5": "The dog's fur was thick and warm, perfect for the cold winter."
        },
        {
            "definition": "A despicable man or youth.",
            "pos": "noun",
            "sent1": "The bully was known as the neighborhood dog for his mean behavior.",
            "sent2": "The dog of a person can sometimes reflect their character.",
            "sent3": "He tried to steal from the elderly lady, proving he was a real dog.",
            "sent4": "His betrayal felt like being bitten by a sly dog.",
            "sent5": "The dog's actions left a bad impression on everyone around."
        },
        {
            "definition": "To follow persistently.",
            "pos": "verb",
            "sent1": "The detective would dog the suspect's every move.",
            "sent2": "The paparazzi would dog the celebrity wherever she went.",
            "sent3": "The annoying salesman would dog me until I bought something.",
            "sent4": "His guilt would dog him for the rest of his life.",
            "sent5": "The memories of the past would dog her dreams at night."
        }
    ]
}