{
    "term": "doggers",
    "meanings": [
        {
            "definition": "A person who engages in casual sexual encounters in public places.",
            "pos": "noun",
            "sent1": "The park was known for attracting doggers looking for excitement.",
            "sent2": "The police warned about the presence of doggers in the area.",
            "sent3": "The doggers accidentally interrupted a picnic with their activities.",
            "sent4": "The news reported a crackdown on doggers in the city.",
            "sent5": "The neighborhood watch kept an eye out for suspicious doggers."
        },
        {
            "definition": "A type of heavy-duty boot.",
            "pos": "noun",
            "sent1": "The hiker wore sturdy doggers to trek through the rough terrain.",
            "sent2": "The construction worker's doggers protected his feet from injury.",
            "sent3": "The fashion designer created stylish doggers for the winter collection.",
            "sent4": "The soldier's doggers left deep imprints in the mud.",
            "sent5": "The store displayed a variety of durable doggers for sale."
        },
        {
            "definition": "A type of fishing hook.",
            "pos": "noun",
            "sent1": "The fisherman carefully baited the doggers before casting his line.",
            "sent2": "The angler's favorite doggers never failed to catch big fish.",
            "sent3": "The old sailor told tales of giant fish caught on magical doggers.",
            "sent4": "The rusty doggers gleamed in the sunlight, ready for action.",
            "sent5": "The fishing competition required participants to use specific doggers."
        },
        {
            "definition": "A type of crane used in construction.",
            "pos": "noun",
            "sent1": "The construction site employed a massive doggers for lifting heavy materials.",
            "sent2": "The engineer operated the doggers with precision and skill.",
            "sent3": "The clumsy operator accidentally dropped the load from the doggers.",
            "sent4": "The new model of doggers promised increased efficiency on the site.",
            "sent5": "The workers marveled at the strength of the advanced doggers."
        },
        {
            "definition": "A type of rock formation.",
            "pos": "noun",
            "sent1": "The hikers admired the unique doggers along the mountain trail.",
            "sent2": "The geologist studied the composition of the ancient doggers.",
            "sent3": "The artist painted a beautiful landscape featuring towering doggers.",
            "sent4": "The erosion over time shaped the majestic doggers into fascinating shapes.",
            "sent5": "The tourists took photos of the breathtaking doggers against the sunset."
        }
    ]
}