{
    "term": "doit",
    "meanings": [
        {
            "definition": "A small Dutch coin",
            "pos": "noun",
            "sent1": "I found a doit on the street.",
            "sent2": "The doit was used in the olden days for small purchases.",
            "sent3": "The kids pretended to trade doits for candies.",
            "sent4": "The doit gleamed in the sunlight like a tiny treasure.",
            "sent5": "The collector's doit collection was impressive."
        },
        {
            "definition": "A trivial sum of money",
            "pos": "noun",
            "sent1": "He owed me a doit for the bet we made.",
            "sent2": "She didn't care about a single doit missing from her wallet.",
            "sent3": "I wouldn't do it for a doit!",
            "sent4": "The value of friendship cannot be measured in doits.",
            "sent5": "Every doit counts when saving up for a treat."
        },
        {
            "definition": "To perform or execute",
            "pos": "verb",
            "sent1": "Please doit carefully to avoid mistakes.",
            "sent2": "He will doit the magic trick at the party.",
            "sent3": "She can doit a perfect cartwheel every time.",
            "sent4": "Let's all doit our best in the upcoming competition.",
            "sent5": "The dancers will doit their routine flawlessly."
        },
        {
            "definition": "To put into action",
            "pos": "verb",
            "sent1": "We need to doit the plan before it's too late.",
            "sent2": "The chef will doit the recipe step by step.",
            "sent3": "I'll doit the surprise party for her birthday.",
            "sent4": "It's time to doit the changes we've been discussing.",
            "sent5": "She will proudly doit her new skills in the presentation."
        },
        {
            "definition": "To cheat or swindle",
            "pos": "verb",
            "sent1": "He tried to doit me out of my share of the prize.",
            "sent2": "The scammer attempted to doit unsuspecting victims.",
            "sent3": "She thought she could doit her way to easy money.",
            "sent4": "Beware of those who try to doit you in business deals.",
            "sent5": "The con artist knew how to doit people with false promises."
        }
    ]
}