{
    "term": "dollies",
    "meanings": [
        {
            "definition": "A small model of a human figure used as a child's toy.",
            "pos": "noun",
            "sent1": "My sister loves playing with her dollies every day.",
            "sent2": "Children often enjoy dressing up their dollies in different outfits.",
            "sent3": "The dollies had a tea party in the playroom, with tiny cups and saucers.",
            "sent4": "Her collection of dollies brought life to her room, like a miniature family.",
            "sent5": "The little girl carefully arranged her dollies on the shelf, each with a unique expression."
        },
        {
            "definition": "A small platform on wheels used for moving heavy objects.",
            "pos": "noun",
            "sent1": "The movers used dollies to transport the heavy furniture across the room.",
            "sent2": "In the warehouse, workers rely on dollies to move boxes efficiently.",
            "sent3": "The dolly raced down the hallway with a stack of boxes, almost like a speedy turtle.",
            "sent4": "The dolly became the hero of the warehouse, carrying loads effortlessly.",
            "sent5": "With the help of dollies, moving heavy items became a much easier task."
        },
        {
            "definition": "A small piece of cloth or padding placed under a dish or object to protect a surface.",
            "pos": "noun",
            "sent1": "She placed dollies under the delicate china plates to prevent scratches on the table.",
            "sent2": "The antique vase was carefully placed on a dolly to avoid damaging the wooden floor.",
            "sent3": "The dolly under the flower pot felt proud to support such a beautiful plant.",
            "sent4": "The dolly under the statue was like a shield, protecting the floor from any harm.",
            "sent5": "The dolly under the heavy bookcase ensured the floor remained unharmed."
        }
    ]
}