{
    "term": "dolly",
    "meanings": [
        {
            "definition": "A child's doll.",
            "pos": "noun",
            "sent1": "Sally loved playing with her dolly every day.",
            "sent2": "The little girl carried her dolly everywhere she went.",
            "sent3": "The dolly had a tiny dress that matched Sally's.",
            "sent4": "The dolly's eyes seemed to follow Sally around the room.",
            "sent5": "Sally's dolly had a sweet smile that never faded."
        },
        {
            "definition": "A small platform on wheels used for moving heavy objects.",
            "pos": "noun",
            "sent1": "The movers used a dolly to transport the heavy boxes.",
            "sent2": "They loaded the furniture onto the dolly to move it easily.",
            "sent3": "The dolly rolled smoothly under the weight of the sofa.",
            "sent4": "Using the dolly made moving the boxes feel like a breeze.",
            "sent5": "The dolly's wheels glided effortlessly across the floor."
        },
        {
            "definition": "A piece of equipment used in film production to move the camera smoothly.",
            "pos": "noun",
            "sent1": "The film crew set up the dolly for the tracking shot.",
            "sent2": "The dolly operator moved the camera smoothly along the track.",
            "sent3": "The dolly squeaked a little as it carried the camera.",
            "sent4": "The dolly's movement added a cinematic touch to the scene.",
            "sent5": "The dolly's precision ensured a perfect shot every time."
        },
        {
            "definition": "A small cylindrical object used in knitting to wind yarn.",
            "pos": "noun",
            "sent1": "She placed the dolly on the table to wind the yarn neatly.",
            "sent2": "The dolly helped her keep the yarn organized while knitting.",
            "sent3": "The dolly spun smoothly as she wound the colorful yarn.",
            "sent4": "Using the dolly made knitting much more efficient.",
            "sent5": "The dolly's design made it easy to wind the yarn without tangles."
        }
    ]
}