{
    "term": "domains",
    "meanings": [
        {
            "definition": "An area of territory owned or controlled by a particular ruler or government.",
            "pos": "noun",
            "sent1": "The king's domains stretched far and wide, encompassing many villages.",
            "sent2": "She explored the vast domains of the forest, discovering hidden treasures.",
            "sent3": "The squirrel declared the tree as its domain, ruling over all the acorns.",
            "sent4": "In the realm of imagination, the writer's domain knows no bounds.",
            "sent5": "The domain of the desert was harsh and unforgiving, yet beautiful in its own way."
        },
        {
            "definition": "A field of activity, interest, or knowledge.",
            "pos": "noun",
            "sent1": "Science fiction is a domain that captivates many readers with its futuristic worlds.",
            "sent2": "The artist's domain is filled with colors, shapes, and endless creativity.",
            "sent3": "In the realm of baking, the kitchen becomes the domain of delicious treats.",
            "sent4": "Her domain of expertise lies in the intricate world of computer programming.",
            "sent5": "The domain of music is vast, with genres to suit every taste and mood."
        },
        {
            "definition": "A distinct subset of the Internet with addresses sharing a common suffix.",
            "pos": "noun",
            "sent1": "The website was hosted on a domain ending in .com, indicating its commercial nature.",
            "sent2": "Users can register their own domain names to create personalized websites.",
            "sent3": "The cat claimed the domain of funny cat videos as its own territory on the internet.",
            "sent4": "In the vast online domain, information flows freely across various websites.",
            "sent5": "The domain of social media connects people from different corners of the world."
        }
    ]
}