{
    "term": "domestically",
    "meanings": [
        {
            "definition": "In a way that relates to the home or family.",
            "pos": "adverb",
            "sent1": "She cooked dinner domestically, using family recipes passed down for generations.",
            "sent2": "The children played domestically in the backyard, building a fort out of blankets.",
            "sent3": "The cat decided to help domestically by rearranging the pillows on the couch.",
            "sent4": "The cozy atmosphere of the living room welcomed her domestically after a long day at work.",
            "sent5": "The smell of freshly baked cookies filled the house domestically, creating a warm and inviting feeling."
        },
        {
            "definition": "Within one's own country.",
            "pos": "adverb",
            "sent1": "He preferred to travel domestically, exploring the beauty of his own country.",
            "sent2": "The company focused on selling their products domestically before expanding internationally.",
            "sent3": "The idea of a road trip domestically seemed more appealing than flying abroad.",
            "sent4": "She felt a sense of pride when representing her country domestically at the international conference.",
            "sent5": "The local cuisine showcased domestically was a hit among tourists visiting the region."
        },
        {
            "definition": "In a tame or domesticated manner.",
            "pos": "adverb",
            "sent1": "The dog behaved domestically, wagging its tail and following commands obediently.",
            "sent2": "The horse was trained to ride domestically, making it safe for children to enjoy.",
            "sent3": "The squirrel surprisingly approached the picnic table domestically, looking for scraps of food.",
            "sent4": "The once wild rabbit now lived domestically in a cozy hutch in the backyard.",
            "sent5": "The parrot mimicked human speech domestically, entertaining everyone with its antics."
        }
    ]
}