{
    "term": "domestics",
    "meanings": [
        {
            "definition": "Of or relating to the running of a household.",
            "pos": "adjective",
            "sent1": "She preferred to focus on domestics matters rather than outside concerns.",
            "sent2": "The family spent the weekend doing domestics chores like cleaning and organizing.",
            "sent3": "The cat thought it was in charge of domestics duties and tried to help with laundry.",
            "sent4": "Her mind was a whirlwind of domestics responsibilities, each demanding attention.",
            "sent5": "The smell of fresh bread baking filled the house, a comforting scent of domestics warmth."
        },
        {
            "definition": "Household tasks or duties.",
            "pos": "noun",
            "sent1": "She divided the domestics among the family members to share the workload.",
            "sent2": "Every Saturday, they tackled the domestics together to keep the house tidy.",
            "sent3": "The robot vacuum was a great help with the domestics, making cleaning easier.",
            "sent4": "The domestics seemed never-ending, but they brought a sense of accomplishment when completed.",
            "sent5": "The domestics list included laundry, dishes, and sweeping, all essential for a clean home."
        },
        {
            "definition": "A person employed to manage household tasks.",
            "pos": "noun",
            "sent1": "The wealthy family hired a skilled domestics to take care of their estate.",
            "sent2": "The domestics was efficient in handling all the household responsibilities.",
            "sent3": "The mischievous child tried to imitate the domestics by pretending to clean with a toy broom.",
            "sent4": "The domestics' dedication to their work was evident in the impeccable condition of the house.",
            "sent5": "The domestics greeted the family every morning with a smile, ready to assist with any task."
        }
    ]
}