{
    "term": "dominations",
    "meanings": [
        {
            "definition": "Control or power over others",
            "pos": "noun",
            "sent1": "The king's dominations extended throughout the land.",
            "sent2": "She asserted her dominations in the classroom by setting clear rules.",
            "sent3": "The cat's domination over the mice was comically challenged by a clever mouse.",
            "sent4": "Her domination in the game of chess was unmatched, like a queen on the board.",
            "sent5": "The lion's roar echoed through the jungle, a symbol of its domination."
        },
        {
            "definition": "The act of dominating or ruling",
            "pos": "noun",
            "sent1": "His dominations were evident in every decision he made.",
            "sent2": "The team's domination in the match was clear from the start.",
            "sent3": "The toddler's attempt at domination over the family pet was met with giggles.",
            "sent4": "The storm's domination of the sky was a sight to behold.",
            "sent5": "The teacher's domination of the classroom brought order and learning."
        },
        {
            "definition": "A country or territory under the control of another country",
            "pos": "noun",
            "sent1": "The small island was under the domination of a larger nation.",
            "sent2": "The history books detailed the domination of one empire over another.",
            "sent3": "The ants' domination of the picnic area was a constant battle for the visitors.",
            "sent4": "The shadow of domination loomed over the conquered land.",
            "sent5": "The map showed the domination of one kingdom over its neighbors."
        },
        {
            "definition": "The highest order of angels in Christian theology",
            "pos": "noun",
            "sent1": "According to the Bible, dominations are powerful celestial beings.",
            "sent2": "The painting depicted the dominations surrounding the throne of God.",
            "sent3": "The children's play featured a humorous portrayal of dominations in heaven.",
            "sent4": "The choir sang as if guided by the voices of dominations.",
            "sent5": "In the story, the protagonist sought guidance from the dominations above."
        }
    ]
}