{
    "term": "domically",
    "meanings": [
        {
            "definition": "relating to or characteristic of a home or household",
            "pos": "adjective",
            "sent1": "The cozy, domically atmosphere of the living room made everyone feel at ease.",
            "sent2": "She preferred a domically decorated bedroom with warm colors and soft textures.",
            "sent3": "The domically dressed cat seemed to think the entire house belonged to her.",
            "sent4": "The domically scented candles filled the room with a comforting aroma.",
            "sent5": "The domically arranged furniture created a welcoming environment for guests."
        },
        {
            "definition": "in a domestic manner or style",
            "pos": "adverb",
            "sent1": "She cleaned the house domically, paying attention to every detail.",
            "sent2": "The family celebrated the holidays domically, with homemade decorations and meals.",
            "sent3": "He sang domically in the shower, pretending to be a famous rock star.",
            "sent4": "The chef cooked domically, using traditional recipes passed down through generations.",
            "sent5": "The children played domically in the backyard, enjoying simple games and laughter."
        },
        {
            "definition": "pertaining to one's own or a particular country",
            "pos": "adjective",
            "sent1": "The domically produced goods were known for their high quality and craftsmanship.",
            "sent2": "She proudly displayed the domically made artwork in her gallery.",
            "sent3": "The domically grown fruits and vegetables were a hit at the local market.",
            "sent4": "The domically sourced materials supported local businesses and artisans.",
            "sent5": "The domically designed flag represented the unity and pride of the nation."
        },
        {
            "definition": "of or relating to the internal affairs of a country",
            "pos": "adjective",
            "sent1": "The domically elected officials worked together to address important issues.",
            "sent2": "The newspaper reported on domically political developments and policies.",
            "sent3": "The domically debated laws sparked conversations among citizens.",
            "sent4": "The domically focused documentary shed light on social issues within the country.",
            "sent5": "The domically organized protests aimed to bring about positive change in society."
        }
    ]
}