{
    "term": "don",
    "meanings": [
        {
            "definition": "To put on (clothing)",
            "pos": "verb",
            "sent1": "I don my jacket before going outside.",
            "sent2": "She dons her hat to protect herself from the sun.",
            "sent3": "Why don't you don your superhero cape and save the day?",
            "sent4": "The sky dons a beautiful sunset every evening.",
            "sent5": "Donning warm gloves in winter keeps my hands cozy."
        },
        {
            "definition": "A respected leader or expert in a particular field",
            "pos": "noun",
            "sent1": "The professor is a don in the field of physics.",
            "sent2": "The don of the village is highly respected by all.",
            "sent3": "The don of the chess club always wins against everyone.",
            "sent4": "She is the don of the baking world, known for her delicious cakes.",
            "sent5": "The don of the orchestra conducts with great skill and passion."
        },
        {
            "definition": "To give or put on (an article of clothing)",
            "pos": "verb",
            "sent1": "Don the scarf to stay warm in the chilly weather.",
            "sent2": "He dons his favorite tie for important meetings.",
            "sent3": "Don't forget to don your party hat for the celebration!",
            "sent4": "The tree dons its colorful leaves in the fall.",
            "sent5": "Donning a smile can brighten someone's day."
        },
        {
            "definition": "A Spanish title prefixed to a man's given name",
            "pos": "noun",
            "sent1": "Don Miguel is a well-known artist in the community.",
            "sent2": "The title 'Don' is a mark of respect in Spanish culture.",
            "sent3": "Don Juan always greets everyone with a warm smile.",
            "sent4": "She jokingly called him 'Don Diego' after watching a Spanish show.",
            "sent5": "The character in the story was referred to as 'Don Pedro' throughout."
        }
    ]
}