{
    "term": "donjons",
    "meanings": [
        {
            "definition": "A large, dark, and gloomy tower, typically part of a medieval castle.",
            "pos": "noun",
            "sent1": "The donjons loomed over the castle walls, casting shadows on the courtyard.",
            "sent2": "The knights gathered in the donjons to discuss their battle strategies.",
            "sent3": "The donjons were so spooky that even the bravest knight hesitated to enter.",
            "sent4": "Her mind felt like a maze of donjons, each thought a dark and winding path.",
            "sent5": "The donjons stood tall like giants, guarding the secrets of the ancient castle."
        },
        {
            "definition": "The main tower or innermost keep of a castle.",
            "pos": "noun",
            "sent1": "The king resided in the grand donjons, overseeing his kingdom from above.",
            "sent2": "Visitors marveled at the intricate architecture of the donjons during the castle tour.",
            "sent3": "The donjons were so tall that the royal banners fluttered high above the rest of the castle.",
            "sent4": "His ambition soared like a kite caught in the updraft of the donjons.",
            "sent5": "The donjons stood as a symbol of power and majesty, visible for miles around."
        },
        {
            "definition": "A dungeon or underground prison.",
            "pos": "noun",
            "sent1": "The thief was thrown into the dark donjons, locked away from the world above.",
            "sent2": "The donjons were damp and cold, echoing with the sounds of distant footsteps.",
            "sent3": "The donjons were so cramped that even a mouse would find it hard to squeeze through.",
            "sent4": "Her heart felt trapped in the donjons of despair, yearning for a glimmer of hope.",
            "sent5": "The donjons whispered tales of forgotten prisoners, their ghosts lingering in the shadows."
        }
    ]
}