{
    "term": "dores",
    "meanings": [
        {
            "definition": "A female deer",
            "pos": "noun",
            "sent1": "The dores gracefully roamed through the forest.",
            "sent2": "I saw a group of dores in the meadow.",
            "sent3": "The dores decided to have a picnic in the woods.",
            "sent4": "The dores moved like elegant dancers in the clearing.",
            "sent5": "The dores' gentle eyes captured my attention."
        },
        {
            "definition": "The plural of 'dore', meaning a small bird",
            "pos": "noun",
            "sent1": "The dores chirped happily in the trees.",
            "sent2": "I spotted a flock of dores flying overhead.",
            "sent3": "The dores held a singing competition in the garden.",
            "sent4": "The dores darted through the sky like colorful arrows.",
            "sent5": "The dores' songs filled the air with joy.",
            "sent6": "In the morning, the dores sang a beautiful melody.",
            "sent7": "Do you hear the dores chirping outside?",
            "sent8": "The dores built a nest in the old oak tree.",
            "sent9": "The dores' feathers shimmered in the sunlight."
        },
        {
            "definition": "The third person singular present of 'dore', meaning to sleep",
            "pos": "noun",
            "sent1": "She dores peacefully in her cozy bed.",
            "sent2": "He always dores for eight hours every night.",
            "sent3": "The cat dores lazily in the warm sunbeam.",
            "sent4": "The baby dores soundly in the crib.",
            "sent5": "The tired traveler finally dores after a long journey."
        },
        {
            "definition": "The third person singular present of 'dore', meaning to cause harm or injury",
            "pos": "noun",
            "sent1": "The villain dores mischief wherever he goes.",
            "sent2": "The storm dores damage to the fragile crops.",
            "sent3": "The mischievous elf dores pranks on unsuspecting villagers.",
            "sent4": "Gossip can dores harm to relationships.",
            "sent5": "The careless mistake dores unintended consequences."
        }
    ]
}