{
    "term": "dormy",
    "meanings": [
        {
            "definition": "Ready for sleep",
            "pos": "adjective",
            "sent1": "After a long day of playing outside, the children were feeling dormy and ready for bed.",
            "sent2": "She yawned, feeling dormy as she snuggled under her cozy blanket.",
            "sent3": "The cat looked dormy as it curled up on the soft pillow for a nap.",
            "sent4": "The dimly lit room had a dormy atmosphere, perfect for a peaceful night's rest.",
            "sent5": "The warm milk made her feel pleasantly dormy, easing her into a deep slumber."
        },
        {
            "definition": "A golf term meaning a ball that is on the green but far from the hole",
            "pos": "noun",
            "sent1": "The golfer's ball landed as a dormy on the green, requiring a precise putt to reach the hole.",
            "sent2": "His frustration grew as he faced yet another dormy situation on the golf course.",
            "sent3": "The ball seemed to mock him, sitting dormy on the green just out of reach.",
            "sent4": "The dormy ball taunted him, daring him to make the perfect shot to save par.",
            "sent5": "The dormy ball lay like a challenge, testing his skill and patience on the course."
        },
        {
            "definition": "A type of room in a dormitory",
            "pos": "noun",
            "sent1": "She decorated her dormy with fairy lights and photos to make it feel cozy and personal.",
            "sent2": "The students gathered in the common dormy to study together before the exam.",
            "sent3": "The dormy was filled with laughter and chatter as friends shared stories late into the night.",
            "sent4": "The dormy buzzed with activity as students prepared for the upcoming event.",
            "sent5": "The cozy dormy became a sanctuary for the students, a place to relax and unwind after classes."
        }
    ]
}