{
    "term": "doses",
    "meanings": [
        {
            "definition": "A quantity of medicine or drug taken at one time",
            "pos": "noun",
            "sent1": "She took two doses of her cough syrup before bed.",
            "sent2": "The doctor prescribed three doses of antibiotics for the infection.",
            "sent3": "The cat accidentally knocked over the bottle of doses, creating a colorful mess.",
            "sent4": "Laughter can be the best doses of medicine for a bad day.",
            "sent5": "The bitter taste of the doses lingered in her mouth long after swallowing."
        },
        {
            "definition": "A small amount of something",
            "pos": "noun",
            "sent1": "He added a few extra doses of sugar to his coffee.",
            "sent2": "A little doses of kindness can go a long way in making someone's day better.",
            "sent3": "The tiny doses of rain were not enough to water the thirsty plants.",
            "sent4": "Her words were like doses of poison, slowly poisoning their friendship.",
            "sent5": "The doses of sunlight filtering through the leaves created a beautiful pattern on the ground."
        },
        {
            "definition": "To administer a dose of medicine",
            "pos": "verb",
            "sent1": "The nurse doses out the medication to each patient carefully.",
            "sent2": "It is important to doses the correct amount of pain relief to avoid side effects.",
            "sent3": "The mischievous puppy tried to doses out the treats to himself from the jar.",
            "sent4": "She doses out advice to her friends like a wise mentor.",
            "sent5": "The coach doses out encouragement to the team before every game."
        },
        {
            "definition": "To treat with a dose of medicine",
            "pos": "verb",
            "sent1": "The doctor doses her patient with antibiotics to fight the infection.",
            "sent2": "She doses her plants with fertilizer to help them grow strong and healthy.",
            "sent3": "The chef doses the dish with a hint of spice to enhance the flavor.",
            "sent4": "His words were like a soothing balm, doses to heal her wounded heart.",
            "sent5": "The teacher doses her students with knowledge, preparing them for the future."
        }
    ]
}