{
    "term": "dotage",
    "meanings": [
        {
            "definition": "The period of life in which a person is old and weak.",
            "pos": "noun",
            "sent1": "In his dotage, Grandpa enjoyed sitting in the sun and watching the birds.",
            "sent2": "She cared for her mother in her dotage, making sure she was comfortable and happy.",
            "sent3": "During his dotage, Mr. Jenkins would often forget where he put his glasses, leading to comical searches around the house.",
            "sent4": "The once vibrant garden had fallen into dotage, with wilting flowers and overgrown weeds taking over.",
            "sent5": "The image of the elderly couple holding hands in their dotage stayed with me, a symbol of enduring love."
        },
        {
            "definition": "Foolish affection or weak-mindedness.",
            "pos": "noun",
            "sent1": "Her dotage for her pet cat led her to buy it expensive toys and gourmet food.",
            "sent2": "He was known for his dotage towards his grandchildren, always indulging their every whim.",
            "sent3": "The millionaire's dotage for his vintage car collection bordered on obsession, much to the amusement of his friends.",
            "sent4": "The politician's dotage for his own voice made him believe every word he said was pure gold.",
            "sent5": "The teacher's dotage for her students was evident in the extra time she spent helping them succeed."
        },
        {
            "definition": "To be in a state of decline or deterioration.",
            "pos": "verb",
            "sent1": "The old building had begun to dotage, its walls crumbling and paint peeling.",
            "sent2": "As the years passed, the once bustling town started to dotage, businesses closing one by one.",
            "sent3": "The neglected garden began to dotage, with weeds taking over and flowers wilting in the sun.",
            "sent4": "His health started to dotage as he neglected his diet and exercise routine.",
            "sent5": "The company's profits continued to dotage, leading to layoffs and financial struggles."
        }
    ]
}