{
    "term": "dote",
    "meanings": [
        {
            "definition": "To show excessive fondness or love for someone",
            "pos": "verb",
            "sent1": "She would dote on her little puppy, giving it treats and cuddles all day.",
            "sent2": "Parents often dote on their children, showering them with affection and praise.",
            "sent3": "The old man would dote on his antique collection, polishing each piece with care.",
            "sent4": "Her eyes would dote on the beautiful sunset, capturing every color and hue.",
            "sent5": "The grandmother would dote on her grandchildren, cherishing every moment spent with them."
        },
        {
            "definition": "To be foolishly or excessively fond of someone",
            "pos": "verb",
            "sent1": "He would dote on his favorite sports team, even when they lost every game.",
            "sent2": "Teenagers often dote on celebrities, following their every move on social media.",
            "sent3": "The cat would dote on the laser pointer, chasing it around the room for hours.",
            "sent4": "Her heart would dote on the memories of her first love, unable to forget the past.",
            "sent5": "The child would dote on their new toy, refusing to let it out of sight."
        },
        {
            "definition": "An act of showing excessive love or fondness for someone",
            "pos": "noun",
            "sent1": "Her constant dote on her pet rabbit was evident in the way she pampered it with treats.",
            "sent2": "The public display of dote towards the famous actor was overwhelming, with fans screaming for autographs.",
            "sent3": "The little girl's dote on her doll was so strong that she carried it everywhere she went.",
            "sent4": "The dote of the elderly couple towards each other was heartwarming, as they held hands and smiled.",
            "sent5": "The dote of the chef towards his signature dish was clear in the meticulous way he prepared it."
        }
    ]
}