{
    "term": "doublehanded",
    "meanings": [
        {
            "definition": "Using both hands",
            "pos": "adverb",
            "sent1": "She carried the heavy box doublehanded.",
            "sent2": "He played the piano doublehanded, hitting the keys with both hands.",
            "sent3": "The chef comically juggled the eggs doublehanded, trying not to drop any.",
            "sent4": "The mechanic fixed the engine doublehanded, swiftly repairing the broken parts.",
            "sent5": "The painter painted the wall doublehanded, ensuring an even coat of color."
        },
        {
            "definition": "Involving two people working together",
            "pos": "adjective",
            "sent1": "The doublehanded effort of the team led to a successful project completion.",
            "sent2": "The doublehanded approach to the task ensured efficiency and collaboration.",
            "sent3": "The doublehanded team celebrated their victory with a high-five.",
            "sent4": "The doublehanded partnership proved to be a winning strategy in the competition.",
            "sent5": "The doublehanded teamwork resulted in a well-executed performance."
        },
        {
            "definition": "Having two handles or handgrips",
            "pos": "adjective",
            "sent1": "The doublehanded sword was wielded by the skilled warrior.",
            "sent2": "She carried the doublehanded bag comfortably on her shoulders.",
            "sent3": "The doublehanded cup made it easier to pour the hot tea.",
            "sent4": "The doublehanded tools allowed for a stronger grip during construction.",
            "sent5": "The doublehanded briefcase had compartments for organized storage."
        },
        {
            "definition": "Done with deceit or trickery",
            "pos": "adjective",
            "sent1": "His doublehanded scheme was uncovered by the vigilant detective.",
            "sent2": "The doublehanded plan to cheat was foiled by honest players.",
            "sent3": "The doublehanded trickster thought he could outsmart everyone.",
            "sent4": "Her doublehanded tactics in the negotiation were seen through by the experienced lawyer.",
            "sent5": "The doublehanded plot to deceive was exposed by careful observation."
        }
    ]
}