{
    "term": "doubling",
    "meanings": [
        {
            "definition": "To make or become twice as much or as many",
            "pos": "verb",
            "sent1": "She is doubling the number of cookies she bakes for the party.",
            "sent2": "The farmer is doubling his crop yield by using new fertilizers.",
            "sent3": "The magician amazed the audience by doubling the number of rabbits in his hat.",
            "sent4": "Her kindness is like doubling the warmth of the sun on a cold day.",
            "sent5": "The teacher's smile is like doubling the brightness of a rainbow after a storm."
        },
        {
            "definition": "To increase or grow rapidly",
            "pos": "verb",
            "sent1": "The company is doubling its profits this year.",
            "sent2": "The flowers are doubling in size after the recent rainfall.",
            "sent3": "The rumors about the new movie are doubling faster than a speeding train.",
            "sent4": "His laughter is like doubling the joy in the room.",
            "sent5": "The excitement in the air is like doubling the energy of a lightning bolt."
        },
        {
            "definition": "To fold or bend back on itself",
            "pos": "verb",
            "sent1": "She is doubling the paper to create a paper airplane.",
            "sent2": "The chef is doubling the dough to make a perfect pastry.",
            "sent3": "The cat enjoys doubling its tail around its body when napping.",
            "sent4": "The river is like doubling back on itself in a graceful curve.",
            "sent5": "The road seemed to be doubling on itself as it twisted through the mountains."
        },
        {
            "definition": "To play two roles in a theatrical production",
            "pos": "verb",
            "sent1": "He will be doubling as both the hero and the villain in the play.",
            "sent2": "The actress is doubling as the princess and the fairy godmother.",
            "sent3": "The comedian enjoys doubling as the host and the main act in the show.",
            "sent4": "Her talent is like doubling the entertainment value of the performance.",
            "sent5": "The actor's versatility is like doubling the magic of the theater."
        }
    ]
}