{
    "term": "dourines",
    "meanings": [
        {
            "definition": "A contagious disease affecting horses, characterized by swelling and inflammation of the testicles.",
            "pos": "noun",
            "sent1": "The vet diagnosed the horse with dourines after noticing the swollen testicles.",
            "sent2": "Farmers take precautions to prevent the spread of dourines among their horses.",
            "sent3": "The horse joked with the other animals, saying he caught dourines from a contaminated carrot.",
            "sent4": "The ranch was in chaos, the dourines spreading like wildfire among the stallions.",
            "sent5": "The image of the horse with dourines stuck in the minds of the stable workers."
        },
        {
            "definition": "A disease of cattle, causing inflammation of the testicles.",
            "pos": "noun",
            "sent1": "The farmer isolated the bull with dourines to prevent the other cattle from getting sick.",
            "sent2": "The veterinarian treated the cow with dourines promptly to ease its discomfort.",
            "sent3": "The cows teased the bull with dourines, calling him 'Mr. Swollen' in good humor.",
            "sent4": "The farm was in turmoil, the dourines outbreak affecting the entire herd.",
            "sent5": "The sight of the bull with dourines lingered in the minds of the farmhands."
        },
        {
            "definition": "A disease of sheep, causing inflammation of the testicles.",
            "pos": "noun",
            "sent1": "The shepherd recognized the symptoms of dourines in the ram and separated him from the flock.",
            "sent2": "The flock was vaccinated to prevent the spread of dourines among the sheep.",
            "sent3": "The sheep giggled at the ram with dourines, joking that he must have eaten a spicy weed.",
            "sent4": "The pasture was in disarray, the dourines outbreak causing concern among the ewes.",
            "sent5": "The vision of the ram with dourines etched itself in the memories of the shepherds."
        }
    ]
}