{
    "term": "douses",
    "meanings": [
        {
            "definition": "To pour a liquid over; drench",
            "pos": "verb",
            "sent1": "She douses the flowers with water every morning.",
            "sent2": "The chef douses the salad with dressing before serving.",
            "sent3": "The playful puppy douses itself in mud and then runs around the house.",
            "sent4": "The sudden rain douses the city streets, turning them into glistening pathways.",
            "sent5": "The firefighter quickly douses the flames with water to save the building."
        },
        {
            "definition": "To extinguish a fire by throwing water or other liquid on it",
            "pos": "verb",
            "sent1": "He douses the campfire before going to bed to ensure safety.",
            "sent2": "The firefighter douses the burning house with water to put out the flames.",
            "sent3": "The mischievous child douses the candle with water, thinking it's a fun game.",
            "sent4": "The heavy rain douses the forest fire, bringing relief to the firefighters.",
            "sent5": "The quick-thinking neighbor douses the small kitchen fire with a fire extinguisher."
        },
        {
            "definition": "To plunge into water or other liquid",
            "pos": "verb",
            "sent1": "The kids douses themselves in the pool on a hot summer day.",
            "sent2": "The diver douses into the deep blue ocean, exploring the underwater world.",
            "sent3": "The clumsy pirate accidentally douses into the sea while trying to board the ship.",
            "sent4": "The rainstorm douses the hikers, making them feel refreshed and rejuvenated.",
            "sent5": "The brave knight douses into the moat to rescue the princess from the tower."
        },
        {
            "definition": "To wet thoroughly; drench",
            "pos": "verb",
            "sent1": "The sudden downpour douses everyone waiting at the bus stop.",
            "sent2": "The gardener douses the plants with a hose to keep them hydrated.",
            "sent3": "The mischievous toddler douses the cat with water during playtime.",
            "sent4": "The storm douses the entire town, causing flooding in the streets.",
            "sent5": "The explorer gets doused by a waterfall while hiking through the jungle."
        }
    ]
}