{
    "term": "doven",
    "meanings": [
        {
            "definition": "past tense of dive",
            "pos": "verb",
            "sent1": "Yesterday, I doven into the pool and had so much fun!",
            "sent2": "She doven into the lake to retrieve her lost necklace.",
            "sent3": "The cat doven into the pile of leaves, thinking it was a hiding spot.",
            "sent4": "His courage doven to new depths as he faced his fears head-on.",
            "sent5": "The fearless diver doven gracefully into the crystal-clear water."
        },
        {
            "definition": "plural of dove",
            "pos": "noun",
            "sent1": "In the sky, I saw a flock of doven flying together.",
            "sent2": "The doven perched on the tree branches, cooing softly.",
            "sent3": "The doven family nested in the tall oak tree in the backyard.",
            "sent4": "The doven symbolized peace and freedom in many cultures.",
            "sent5": "The beautiful doven pair built a cozy nest for their eggs."
        },
        {
            "definition": "to plunge into water headfirst",
            "pos": "verb",
            "sent1": "The adventurous boy doven off the diving board with a splash.",
            "sent2": "She nervously doven into the pool for the first time.",
            "sent3": "The mischievous puppy doven into the puddle, making a mess.",
            "sent4": "The cliff diver doven fearlessly into the deep blue ocean.",
            "sent5": "The synchronized swimmers doven in perfect harmony during the performance."
        },
        {
            "definition": "a type of bird, typically white and gray in color",
            "pos": "noun",
            "sent1": "The doven gracefully landed on the branch outside my window.",
            "sent2": "I spotted a doven perched on the rooftop of the old barn.",
            "sent3": "The doven pair built a nest in the eaves of the house.",
            "sent4": "The doven's gentle cooing filled the peaceful morning air.",
            "sent5": "The doven's wings shimmered in the sunlight as it took flight."
        }
    ]
}