{
    "term": "downgrading",
    "meanings": [
        {
            "definition": "To lower in importance or value.",
            "pos": "verb",
            "sent1": "She was downgrading her old phone to give to her younger sister.",
            "sent2": "The company decided to start downgrading their prices to attract more customers.",
            "sent3": "The magician joked that he was downgrading his disappearing act to make things more interesting.",
            "sent4": "The teacher felt like she was downgrading her lesson plan by simplifying it for the students.",
            "sent5": "The chef was downgrading the recipe by using cheaper ingredients, but it still tasted delicious."
        },
        {
            "definition": "The act of reducing the quality or status of something.",
            "pos": "noun",
            "sent1": "The downgrading of the hotel's services led to many negative reviews.",
            "sent2": "After the downgrading of the software, many users experienced glitches and errors.",
            "sent3": "The downgrading of the superhero's powers made for a hilarious comic book storyline.",
            "sent4": "The downgrading of the movie's special effects disappointed many viewers.",
            "sent5": "The downgrading of the restaurant's menu left customers searching for new dining options."
        },
        {
            "definition": "To assign a lower rank or rating to something.",
            "pos": "verb",
            "sent1": "The professor was downgrading the students' essays based on grammar mistakes.",
            "sent2": "The judge decided to start downgrading the contestant's performances due to lack of effort.",
            "sent3": "The coach was downgrading the team's overall performance to motivate them to work harder.",
            "sent4": "The manager was downgrading the employee's performance reviews after repeated tardiness.",
            "sent5": "The critic was downgrading the movie's rating, much to the disappointment of the filmmakers."
        }
    ]
}