{
    "term": "downed",
    "meanings": [
        {
            "definition": "Knocked to the ground or floor.",
            "pos": "verb",
            "sent1": "The strong wind downed the tree in the storm.",
            "sent2": "She accidentally downed her glass of water in one gulp.",
            "sent3": "The clumsy cat downed the vase, creating a mess.",
            "sent4": "The boxer downed his opponent with a powerful punch.",
            "sent5": "The earthquake downed buildings, causing chaos in the city."
        },
        {
            "definition": "Consumed quickly or eagerly.",
            "pos": "adjective",
            "sent1": "The hungry child downed the sandwich in seconds.",
            "sent2": "He is known for his downed enthusiasm when it comes to desserts.",
            "sent3": "The downed puppy eagerly finished its food in no time.",
            "sent4": "She downed the book in one sitting, unable to put it down.",
            "sent5": "The downed popcorn disappeared quickly during the movie."
        },
        {
            "definition": "Shot down or destroyed, especially in reference to aircraft.",
            "pos": "verb",
            "sent1": "The enemy downed the plane with a missile.",
            "sent2": "The hunter downed the bird with a precise shot.",
            "sent3": "The downed drone crashed into the lake, creating a splash.",
            "sent4": "The storm downed power lines, causing a blackout.",
            "sent5": "The downed helicopter spiraled to the ground in flames."
        },
        {
            "definition": "Depressed or feeling low in spirits.",
            "pos": "adjective",
            "sent1": "After the loss, she felt downed and sad.",
            "sent2": "He appeared downed and disheartened after the rejection.",
            "sent3": "The downed mood lifted when friends came over to cheer her up.",
            "sent4": "The downed atmosphere in the room changed when music started playing.",
            "sent5": "The downed spirit found solace in the beauty of nature."
        }
    ]
}