{
    "term": "doziness",
    "meanings": [
        {
            "definition": "The state of being drowsy or sleepy.",
            "pos": "noun",
            "sent1": "After a long day of playing outside, the child's doziness was evident as he struggled to keep his eyes open.",
            "sent2": "The doziness that comes after a big meal made him want to take a nap.",
            "sent3": "His doziness during the boring lecture almost caused him to fall off his chair.",
            "sent4": "The doziness of the old library filled the room with a sense of calm and tranquility.",
            "sent5": "The doziness of the cat curled up in the sunbeam was a picture of pure contentment."
        },
        {
            "definition": "A feeling of laziness or sluggishness.",
            "pos": "noun",
            "sent1": "The doziness that overcame him on a rainy day made it hard to get out of bed.",
            "sent2": "Her doziness on a Sunday morning often led to a slow start to the day.",
            "sent3": "The doziness of the sloth hanging from the tree was almost comical to watch.",
            "sent4": "The doziness of the computer on a hot day made it frustratingly slow to work.",
            "sent5": "The doziness of the turtle as it moved along the path was a reminder to take things slow."
        },
        {
            "definition": "A tendency to doze off or fall asleep easily.",
            "pos": "noun",
            "sent1": "His doziness in the cozy armchair often resulted in him nodding off during movies.",
            "sent2": "The doziness that came over her after reading a book in bed made her drift off to sleep.",
            "sent3": "The doziness of the baby in the rocking cradle was a sight that brought smiles to everyone's faces.",
            "sent4": "The doziness of the campers around the crackling fire signaled the end of a long day of hiking.",
            "sent5": "The doziness of the train's rhythmic motion lulled passengers into a peaceful slumber."
        }
    ]
}