{
    "term": "doziest",
    "meanings": [
        {
            "definition": "Experiencing or characterized by drowsiness or sleepiness.",
            "pos": "adjective",
            "sent1": "After a long day of playing outside, the puppy looked doziest as it curled up for a nap.",
            "sent2": "The cat looked doziest in the warm sun, lazily stretching out on the windowsill.",
            "sent3": "The doziest sloth in the jungle was known for falling asleep mid-climb.",
            "sent4": "The doziest clouds drifted lazily across the sky, casting shadows on the fields below.",
            "sent5": "The doziest feeling crept over her as she listened to the gentle rain outside."
        },
        {
            "definition": "Lacking alertness or awareness; sluggish.",
            "pos": "adjective",
            "sent1": "The doziest turtle in the pond moved slowly, barely making ripples in the water.",
            "sent2": "On Monday mornings, he always felt doziest and struggled to focus on his work.",
            "sent3": "The doziest snail in the garden was often left behind by its faster friends.",
            "sent4": "The doziest sloth in the tree barely noticed the passing birds and monkeys.",
            "sent5": "Her doziest movements in the morning were like a slow-motion dance routine."
        },
        {
            "definition": "In a state of laziness or lethargy.",
            "pos": "adjective",
            "sent1": "The doziest cat in the house lounged on the couch all day, barely moving.",
            "sent2": "After a big meal, he always felt doziest and just wanted to lie down and rest.",
            "sent3": "The doziest bear in the forest was known for taking long naps in the sun.",
            "sent4": "The doziest river meandered lazily through the valley, reflecting the blue sky above.",
            "sent5": "In the heat of the afternoon, the doziest feeling settled over the town, making everyone yawn."
        }
    ]
}