{
    "term": "drafting",
    "meanings": [
        {
            "definition": "The process of drawing up plans or sketches.",
            "pos": "noun",
            "sent1": "In drafting class, we learned how to create detailed floor plans.",
            "sent2": "The architect spent hours drafting the blueprints for the new building.",
            "sent3": "During the drafting session, the students' sketches turned out to be quite imaginative.",
            "sent4": "Her drafting skills were so precise that her plans came to life on paper.",
            "sent5": "The drafting process requires patience and attention to detail."
        },
        {
            "definition": "The act of selecting or recruiting individuals for military service.",
            "pos": "noun",
            "sent1": "Drafting soldiers into the army was a common practice during wartime.",
            "sent2": "The general oversaw the drafting of new recruits into the military.",
            "sent3": "The drafting officer had a tough job convincing young men to join the army.",
            "sent4": "The drafting process ensured that the military had enough personnel for the mission.",
            "sent5": "Drafting for the army was a responsibility that required careful consideration."
        },
        {
            "definition": "The act of writing a document or piece of legislation.",
            "pos": "noun",
            "sent1": "The lawyer was busy drafting a legal contract for her client.",
            "sent2": "Drafting a bill that would benefit the community required collaboration.",
            "sent3": "The drafting of the new law sparked a heated debate among lawmakers.",
            "sent4": "She excelled in drafting persuasive arguments for her case.",
            "sent5": "The drafting of important documents demands precision and clarity."
        },
        {
            "definition": "The act of pulling or hauling something.",
            "pos": "noun",
            "sent1": "The drafting of heavy cargo required a strong team of workers.",
            "sent2": "Drafting the supplies across the rough terrain was a challenging task.",
            "sent3": "The drafting of the heavy load caused the cart to creak under the weight.",
            "sent4": "She struggled with the drafting of the stubborn horse that refused to move.",
            "sent5": "The drafting of the massive stone block took immense effort from the workers."
        }
    ]
}