{
    "term": "draft",
    "meanings": [
        {
            "definition": "A preliminary version of a written work",
            "pos": "noun",
            "sent1": "I need to make some changes to the draft of my essay before submitting it.",
            "sent2": "The author worked on the draft of his novel for months before finalizing it.",
            "sent3": "The draft of the story was so rough, it made me laugh at how much work it needed.",
            "sent4": "Her first draft was like a rough sketch, waiting to be filled with color and detail.",
            "sent5": "The draft of the play was so vivid, it felt like the characters were alive on the page."
        },
        {
            "definition": "A current of air in a confined space",
            "pos": "noun",
            "sent1": "A draft from the window made the papers on the desk flutter.",
            "sent2": "The room felt chilly due to the draft coming in through the cracks.",
            "sent3": "The draft in the room was like a mischievous breeze playing with the curtains.",
            "sent4": "The draft in the attic whispered secrets as it moved through the old space.",
            "sent5": "The sudden draft in the room felt like a ghost passing by, sending shivers down my spine."
        },
        {
            "definition": "A system for selecting individuals for military service",
            "pos": "noun",
            "sent1": "The draft during wartime required young men to join the military.",
            "sent2": "Many families were affected by the draft during times of conflict.",
            "sent3": "The draft for military service seemed like a game of chance with serious consequences.",
            "sent4": "The draft for soldiers was like a call to duty that could not be ignored.",
            "sent5": "The draft for the army was a reminder of the sacrifices made for the country."
        },
        {
            "definition": "To draw up a document or plan",
            "pos": "verb",
            "sent1": "I will draft a proposal for the new project by the end of the week.",
            "sent2": "She drafted a detailed outline before starting to write the report.",
            "sent3": "He decided to draft a plan that was so detailed, it surprised everyone.",
            "sent4": "Drafting the agreement felt like creating a roadmap for future collaboration.",
            "sent5": "She drafted the map with such precision that every detail was clear and easy to follow."
        },
        {
            "definition": "To pull or haul something, especially a vehicle",
            "pos": "verb",
            "sent1": "The horses were used to draft the heavy wagon up the hill.",
            "sent2": "He had to draft the boat closer to the shore to unload the cargo.",
            "sent3": "Drafting the cart through the muddy road was a challenging task.",
            "sent4": "She had to draft the sled across the snow-covered field with great effort.",
            "sent5": "The workers had to draft the equipment to the construction site before starting the project."
        }
    ]
}