{
    "term": "dragoon",
    "meanings": [
        {
            "definition": "To coerce or force into doing something",
            "pos": "verb",
            "sent1": "The teacher tried to dragoon the students into completing their homework on time.",
            "sent2": "The bully tried to dragoon the younger kids into giving him their lunch money.",
            "sent3": "The coach jokingly threatened to dragoon the players into running extra laps if they didn't listen.",
            "sent4": "The strict manager would dragoon his employees into working overtime without proper compensation.",
            "sent5": "The drill sergeant's intense stare seemed to dragoon the recruits into following his every command."
        },
        {
            "definition": "A member of a European military unit specializing in mounted infantry",
            "pos": "noun",
            "sent1": "The dragoon rode swiftly on horseback, ready for battle.",
            "sent2": "The dragoon's uniform was adorned with medals and badges of honor.",
            "sent3": "The young boy dressed up as a dragoon for Halloween, complete with a toy sword.",
            "sent4": "The dragoon's presence on the battlefield was both intimidating and strategic.",
            "sent5": "The dragoon's horse galloped gracefully as they patrolled the borders of the kingdom."
        },
        {
            "definition": "A type of firearm used by cavalry troops",
            "pos": "noun",
            "sent1": "The cavalry unit carried dragoons to defend themselves in battle.",
            "sent2": "The soldiers cleaned and maintained their dragoons before the upcoming mission.",
            "sent3": "The old dragoon displayed in the museum showcased the evolution of military weaponry.",
            "sent4": "The sound of the dragoon being fired echoed through the valley during the training exercise.",
            "sent5": "The shiny dragoon gleamed in the sunlight as it was handed over to the cavalry captain."
        }
    ]
}