{
    "term": "drag",
    "meanings": [
        {
            "definition": "Pulling something along the ground.",
            "pos": "verb",
            "sent1": "I had to drag my heavy suitcase through the airport.",
            "sent2": "The worker had to drag the cart filled with boxes across the warehouse.",
            "sent3": "The puppy thought it was fun to drag its leash behind it like a tail.",
            "sent4": "Her tired feet felt like they had to drag through the thick mud of exhaustion.",
            "sent5": "The old man had to drag his tired body up the steep hill."
        },
        {
            "definition": "A slow, laborious movement.",
            "pos": "noun",
            "sent1": "The snail's drag across the sidewalk was barely noticeable.",
            "sent2": "The heavy load made the journey a drag for the hiker.",
            "sent3": "The sloth's idea of a race would be a drag for sure.",
            "sent4": "Time seemed to pass in a drag as they waited for the bus.",
            "sent5": "The slow drag of the hours made the school day feel endless."
        },
        {
            "definition": "A costume worn by a performer.",
            "pos": "noun",
            "sent1": "The actor put on his drag for the play.",
            "sent2": "The drag for the masquerade ball was elaborate and colorful.",
            "sent3": "The drag for the Halloween party was a hit with everyone.",
            "sent4": "Her drag for the dance recital sparkled under the stage lights.",
            "sent5": "The drag for the circus performance was designed to dazzle the audience."
        },
        {
            "definition": "Resistance to motion through a fluid.",
            "pos": "noun",
            "sent1": "The swimmer felt the drag of the water as she pushed through the pool.",
            "sent2": "The drag of the heavy fabric slowed down the swimmer's lap time.",
            "sent3": "The boat's speed was affected by the drag of the anchor in the water.",
            "sent4": "The drag of the wind against the sailboat made sailing more challenging.",
            "sent5": "The drag of the river current made it difficult for the kayaker to paddle upstream."
        },
        {
            "definition": "A type of car race.",
            "pos": "noun",
            "sent1": "The drag at the racetrack attracted many car enthusiasts.",
            "sent2": "The drag was a thrilling event with roaring engines and fast cars.",
            "sent3": "The drag brought together competitors from all over the country.",
            "sent4": "The drag showcased the speed and power of different vehicles.",
            "sent5": "The drag was a high-energy competition that kept the crowd on their feet."
        }
    ]
}