{
    "term": "dragooned",
    "meanings": [
        {
            "definition": "To force or coerce into doing something",
            "pos": "verb",
            "sent1": "The teacher dragooned the students into completing their homework on time.",
            "sent2": "The manager dragooned the employees into working overtime without proper compensation.",
            "sent3": "The coach dragooned the team into doing extra drills by promising a pizza party afterward.",
            "sent4": "The strict rules dragooned everyone into following the same routine every day.",
            "sent5": "The loud noise dragooned the sleepy cat into waking up abruptly."
        },
        {
            "definition": "To compel by threats or intimidation",
            "pos": "verb",
            "sent1": "The bully dragooned the smaller kids into giving him their lunch money.",
            "sent2": "The dictator dragooned the citizens into supporting his oppressive regime through fear tactics.",
            "sent3": "The persistent salesman dragooned the hesitant customer into making a purchase with his aggressive pitch.",
            "sent4": "The dark clouds dragooned the picnic attendees into seeking shelter from the impending storm.",
            "sent5": "The eerie silence dragooned the curious child into exploring the mysterious attic."
        },
        {
            "definition": "To press or urge into service or action",
            "pos": "verb",
            "sent1": "The captain dragooned the crew into preparing the ship for the long voyage ahead.",
            "sent2": "The chef dragooned the kitchen staff into creating a special menu for the grand opening.",
            "sent3": "The enthusiastic leader dragooned the team into participating in the charity event for a good cause.",
            "sent4": "The urgent message dragooned everyone into taking immediate action to prevent a disaster.",
            "sent5": "The exciting news dragooned the sleepy town into organizing a festive celebration."
        }
    ]
}