{
    "term": "dragooning",
    "meanings": [
        {
            "definition": "To force or coerce into doing something",
            "pos": "verb",
            "sent1": "The teacher was dragooning the students into completing their assignments on time.",
            "sent2": "The dictator was known for dragooning his citizens into obeying his every command.",
            "sent3": "The coach was dragooning the team to practice harder, but they ended up having fun in the process.",
            "sent4": "The strict supervisor was dragooning the employees, making the workplace feel like a military camp.",
            "sent5": "The relentless rain was dragooning the hikers to seek shelter, drenching them completely."
        },
        {
            "definition": "To compel by threats or intimidation",
            "pos": "verb",
            "sent1": "The bully was dragooning the smaller kids into giving him their lunch money.",
            "sent2": "The gang leader dragooned new members into joining through fear tactics.",
            "sent3": "The mischievous cat was dragooning the dog by pretending to be a fierce lion.",
            "sent4": "The storm clouds were dragooning the beachgoers to pack up and leave before the downpour.",
            "sent5": "The strict teacher was dragooning the students into silence with a stern glare."
        },
        {
            "definition": "To subject to harsh treatment or discipline",
            "pos": "verb",
            "sent1": "The drill sergeant was dragooning the recruits through grueling training exercises.",
            "sent2": "The strict parent dragooned their child into following a strict curfew.",
            "sent3": "The misbehaving puppy was dragooned into obedience training classes.",
            "sent4": "The harsh winter weather was dragooning the garden plants, causing them to wither.",
            "sent5": "The relentless waves were dragooning the sandcastle, slowly eroding its structure."
        }
    ]
}