{
    "term": "drain",
    "meanings": [
        {
            "definition": "To remove liquid from a container or area",
            "pos": "verb",
            "sent1": "I need to drain the water from the sink.",
            "sent2": "After washing the dishes, I always drain the water out.",
            "sent3": "Trying to drink all the water in the pool would certainly drain me!",
            "sent4": "Her constant complaints drain my patience like a leaky faucet.",
            "sent5": "The drain in the bathtub was clogged with hair and soap scum."
        },
        {
            "definition": "A pipe or channel used to carry off liquid",
            "pos": "noun",
            "sent1": "The rainwater flowed swiftly through the drain.",
            "sent2": "The plumber fixed the clogged drain in the kitchen sink.",
            "sent3": "The drain gurgled happily as it carried away the excess water.",
            "sent4": "The drain acted like a loyal servant, never failing to carry off the rainwater.",
            "sent5": "The drain was blocked by fallen leaves, causing a small flood in the yard."
        },
        {
            "definition": "To exhaust physical or mental energy",
            "pos": "verb",
            "sent1": "The long hike really drained me.",
            "sent2": "Studying for hours can drain your mental energy.",
            "sent3": "Playing video games all night will drain your energy levels.",
            "sent4": "The intense workout drained all my strength.",
            "sent5": "The challenging puzzle drained my brainpower."
        },
        {
            "definition": "A decrease in resources or energy",
            "pos": "noun",
            "sent1": "The constant demands at work led to a drain on my energy.",
            "sent2": "There was a noticeable drain in the company's finances.",
            "sent3": "The leak in the roof caused a drain on our savings.",
            "sent4": "The ongoing drought resulted in a drain on the water supply.",
            "sent5": "The drain on natural resources is a growing concern for environmentalists."
        },
        {
            "definition": "To cause someone to feel tired or demoralized",
            "pos": "verb",
            "sent1": "The never-ending meetings really drain me.",
            "sent2": "Constant criticism can drain a person's spirit.",
            "sent3": "Her negative comments always manage to drain my enthusiasm.",
            "sent4": "The difficult project drained him of all motivation.",
            "sent5": "The toxic work environment can drain employees of their passion."
        }
    ]
}