{
    "term": "draining",
    "meanings": [
        {
            "definition": "Causing liquid to flow out of something",
            "pos": "adjective",
            "sent1": "The overflowing sink was a draining sight.",
            "sent2": "The leaking bottle was a draining problem.",
            "sent3": "The faucet seemed to be in a draining mood today.",
            "sent4": "Her eyes were like draining rivers of tears.",
            "sent5": "The rain poured down in a draining cascade from the roof."
        },
        {
            "definition": "Physically exhausting",
            "pos": "adjective",
            "sent1": "The long hike was draining for the tired hiker.",
            "sent2": "The intense workout was draining but rewarding.",
            "sent3": "Carrying all those books felt draining, but she managed.",
            "sent4": "The draining heat made everyone seek shade.",
            "sent5": "The draining marathon left him breathless at the finish line."
        },
        {
            "definition": "Removing water or other liquid from an area",
            "pos": "verb",
            "sent1": "He was draining the flooded basement with a pump.",
            "sent2": "She used a sponge to start draining the spilled milk.",
            "sent3": "The magician's trick involved draining a glass of water into thin air.",
            "sent4": "The chef was draining excess oil from the fried food.",
            "sent5": "The plumber arrived to drain the clogged pipes in the kitchen sink."
        },
        {
            "definition": "Depleting resources or energy",
            "pos": "adjective",
            "sent1": "The constant demands were draining on her patience.",
            "sent2": "The draining project left them feeling exhausted.",
            "sent3": "The draining game of charades lasted for hours.",
            "sent4": "The draining conversation drained all his enthusiasm.",
            "sent5": "The draining workload made her feel overwhelmed."
        }
    ]
}