{
    "term": "draughted",
    "meanings": [
        {
            "definition": "To draw or pull something along the ground",
            "pos": "verb",
            "sent1": "The farmer draughted the heavy cart across the field.",
            "sent2": "She draughted the suitcase behind her as she walked to the bus stop.",
            "sent3": "The dog draughted the toy car with its teeth, pretending to drive.",
            "sent4": "The wind draughted the fallen leaves along the pavement.",
            "sent5": "The child draughted the stick in the sand, creating patterns."
        },
        {
            "definition": "To make a preliminary sketch or plan",
            "pos": "verb",
            "sent1": "The architect draughted the initial design of the new building.",
            "sent2": "She draughted a rough outline before starting the detailed drawing.",
            "sent3": "The student draughted a silly doodle on the corner of the page.",
            "sent4": "The artist draughted the concept for the mural on the wall.",
            "sent5": "He draughted a map of the treasure hunt for the party."
        },
        {
            "definition": "To select or enlist someone for military service",
            "pos": "verb",
            "sent1": "The army draughted new recruits for training.",
            "sent2": "During the war, many young men were draughted into the military.",
            "sent3": "The general jokingly draughted his cat as a soldier in the pretend army.",
            "sent4": "The commander draughted the best soldiers for the special mission.",
            "sent5": "She felt nervous when she was draughted into the army."
        },
        {
            "definition": "To transfer or move livestock to another location",
            "pos": "verb",
            "sent1": "The rancher draughted the cattle to the new grazing field.",
            "sent2": "They draughted the sheep to the lower pasture for better grazing.",
            "sent3": "The farmer draughted the chickens to the coop before the storm.",
            "sent4": "The shepherd draughted the goats to the mountain for fresh grass.",
            "sent5": "He draughted the horses to the stable for the night."
        }
    ]
}