{
    "term": "draught",
    "meanings": [
        {
            "definition": "A current of cool air in a room or other confined space.",
            "pos": "noun",
            "sent1": "The open window let in a refreshing draught.",
            "sent2": "She felt a draught coming from under the door.",
            "sent3": "The mischievous cat chased the draught around the house.",
            "sent4": "The draught of wind carried the scent of flowers through the room.",
            "sent5": "The sudden draught made the candles flicker and dance."
        },
        {
            "definition": "The act of pulling a load, especially by a vehicle.",
            "pos": "noun",
            "sent1": "The horses strained against the draught of the heavy wagon.",
            "sent2": "The draught of the sled made it glide smoothly over the snow.",
            "sent3": "The children took turns pretending to be the draught for their toy car.",
            "sent4": "The draught of the tractor effortlessly moved the logs across the field.",
            "sent5": "The draught of the truck pulled the trailer up the steep hill."
        },
        {
            "definition": "A single act of drinking or inhaling.",
            "pos": "noun",
            "sent1": "He took a deep draught of water after the long run.",
            "sent2": "The weary traveler enjoyed a refreshing draught from the well.",
            "sent3": "The comedian pretended to take a comically exaggerated draught from the tiny cup.",
            "sent4": "Her laughter was like a draught of joy in the room.",
            "sent5": "The aroma of freshly baked bread was a delicious draught for her senses."
        },
        {
            "definition": "A preliminary sketch of a plan or drawing.",
            "pos": "noun",
            "sent1": "The architect quickly sketched a draught of the building layout.",
            "sent2": "She presented the draught of her painting to the art class for feedback.",
            "sent3": "The child proudly showed his colorful draught to his parents.",
            "sent4": "The draught of the design captured the essence of simplicity and elegance.",
            "sent5": "The artist's first draught of the portrait was rough but showed great potential."
        }
    ]
}