{
    "term": "drawnwork",
    "meanings": [
        {
            "definition": "Drawnwork: a type of embroidery in which threads are drawn out of the fabric to create a design",
            "pos": "noun",
            "sent1": "The intricate drawnwork on the tablecloth showcased delicate patterns.",
            "sent2": "She learned how to do drawnwork by carefully pulling threads to form beautiful designs.",
            "sent3": "The drawnwork on the pillow looked like a spider had spun a web on it.",
            "sent4": "Her drawnwork was so detailed, it seemed as if the fabric itself was whispering secrets.",
            "sent5": "The drawnwork on the dress shimmered in the sunlight, capturing everyone's attention."
        },
        {
            "definition": "Drawnwork: the act of creating decorative patterns on fabric by removing threads",
            "pos": "noun",
            "sent1": "Her drawnwork involved patiently pulling out threads to form intricate designs.",
            "sent2": "The drawnwork on the scarf added a touch of elegance to the outfit.",
            "sent3": "During the drawnwork process, she accidentally unraveled more threads than intended.",
            "sent4": "The drawnwork on the tapestry created a sense of depth and texture.",
            "sent5": "The drawnwork on the curtains gave the room a cozy and inviting feel."
        },
        {
            "definition": "Drawnwork: fabric that has been embellished with drawn threads",
            "pos": "noun",
            "sent1": "The drawnwork on the handkerchief made it a cherished keepsake.",
            "sent2": "She admired the intricate drawnwork on the vintage tablecloth.",
            "sent3": "The drawnwork on the quilt added a unique touch to the overall design.",
            "sent4": "The drawnwork on the shawl gave it a delicate and ethereal appearance.",
            "sent5": "The drawnwork on the pillowcase transformed it into a work of art."
        }
    ]
}