{
    "term": "draw",
    "meanings": [
        {
            "definition": "To produce a picture or diagram by making lines and marks on paper.",
            "pos": "verb",
            "sent1": "I will draw a flower on the paper.",
            "sent2": "She likes to draw animals in her sketchbook.",
            "sent3": "The little girl tried to draw a smiley face but it looked like a potato.",
            "sent4": "Her words were like a paintbrush, drawing a vivid picture in my mind.",
            "sent5": "The artist's hand moved swiftly to draw a beautiful landscape."
        },
        {
            "definition": "To pull or drag something in a particular direction.",
            "pos": "verb",
            "sent1": "Please draw the curtains closed.",
            "sent2": "He had to draw the heavy box across the room.",
            "sent3": "The magnet seemed to draw the metal objects towards it magically.",
            "sent4": "The strong wind seemed to draw the leaves off the trees.",
            "sent5": "The tractor struggled to draw the plow through the tough soil."
        },
        {
            "definition": "To attract or pull towards oneself.",
            "pos": "verb",
            "sent1": "The smell of freshly baked cookies will draw people to the kitchen.",
            "sent2": "Her charisma always seems to draw a crowd around her.",
            "sent3": "The mysterious treasure map seemed to draw the adventurers into the unknown.",
            "sent4": "His infectious laughter could draw a smile from even the grumpiest person.",
            "sent5": "The bright neon sign outside the store drew customers in like moths to a flame."
        },
        {
            "definition": "To bring out a weapon for use.",
            "pos": "verb",
            "sent1": "The knight had to draw his sword to defend the castle.",
            "sent2": "The cowboy was quick to draw his gun in the showdown.",
            "sent3": "In the movie, the hero would always dramatically draw his weapon at the last moment.",
            "sent4": "The detective slowly drew his gun as he entered the dark alley.",
            "sent5": "The samurai's swift draw of the katana was unmatched in the battlefield."
        },
        {
            "definition": "To finish a game or competition with neither side winning.",
            "pos": "verb",
            "sent1": "The chess match ended in a draw after a long battle.",
            "sent2": "The soccer game resulted in a draw with both teams scoring equally.",
            "sent3": "The siblings decided to draw in their game of tic-tac-toe.",
            "sent4": "The debate ended in a draw as both speakers presented strong arguments.",
            "sent5": "The final round of the tournament ended in a draw, surprising everyone."
        }
    ]
}