{
    "term": "drawnworks",
    "meanings": [
        {
            "definition": "Drawnworks: a type of embroidery or lace made by drawing out threads from the fabric and working over the remaining threads",
            "pos": "noun",
            "sent1": "She learned how to create beautiful drawnworks in her embroidery class.",
            "sent2": "The drawnworks on the tablecloth added an elegant touch to the dining table.",
            "sent3": "The drawnworks on the pillow looked like tiny spiderwebs, making it a unique piece.",
            "sent4": "Her drawnworks were like delicate whispers woven into the fabric of her creations.",
            "sent5": "The intricate drawnworks seemed to dance across the cloth, mesmerizing all who beheld them."
        },
        {
            "definition": "Drawnworks: the act of creating drawnworks",
            "pos": "noun",
            "sent1": "Her passion for drawnworks led her to spend hours perfecting her craft.",
            "sent2": "The drawnworks required patience and precision to achieve the desired effect.",
            "sent3": "She joked that her drawnworks obsession was taking over her life, one thread at a time.",
            "sent4": "In her hands, the drawnworks became a symphony of artistry and skill.",
            "sent5": "The room was filled with the rhythmic sound of her needle as she worked on her drawnworks."
        },
        {
            "definition": "Drawnworks: the result of drawnworks, such as a piece of lace or embroidery",
            "pos": "noun",
            "sent1": "The drawnworks she displayed at the exhibition were met with admiration and awe.",
            "sent2": "Each drawnworks piece told a story of dedication and creativity.",
            "sent3": "Her cat seemed fascinated by the drawnworks, trying to paw at the delicate threads.",
            "sent4": "The drawnworks glowed in the sunlight, showcasing the intricate patterns and designs.",
            "sent5": "The drawnworks she created were a testament to her skill and passion for the art."
        }
    ]
}