{
    "term": "draws",
    "meanings": [
        {
            "definition": "To produce a picture or diagram by making lines and marks on paper.",
            "pos": "verb",
            "sent1": "She draws a big sun in the corner of her drawing.",
            "sent2": "He draws a beautiful landscape with mountains and a river.",
            "sent3": "The little girl draws a funny face with big, round eyes.",
            "sent4": "His art draws a vivid picture of nature's beauty.",
            "sent5": "The artist draws with such skill that it looks almost real."
        },
        {
            "definition": "To pull or drag something in a particular direction.",
            "pos": "verb",
            "sent1": "He draws the heavy box across the room.",
            "sent2": "She draws the curtains to let in more light.",
            "sent3": "The magnet draws the metal paperclips towards it.",
            "sent4": "The strong wind draws the leaves off the trees.",
            "sent5": "The tractor draws the plow through the field with ease."
        },
        {
            "definition": "To attract or pull towards oneself.",
            "pos": "verb",
            "sent1": "The sweet smell of cookies draws her into the kitchen.",
            "sent2": "His charisma draws people to him wherever he goes.",
            "sent3": "The colorful display draws the attention of passersby.",
            "sent4": "Her infectious laughter draws everyone closer to her.",
            "sent5": "The bright neon sign draws customers into the store."
        },
        {
            "definition": "To select randomly or by chance.",
            "pos": "verb",
            "sent1": "She draws a card from the deck and reveals the queen of hearts.",
            "sent2": "He draws a number from the hat during the raffle.",
            "sent3": "The lottery machine draws the winning numbers every week.",
            "sent4": "The teacher draws names to pick the student who will present first.",
            "sent5": "The game show host draws a lucky winner from the audience."
        },
        {
            "definition": "To finish a competition with an equal score.",
            "pos": "verb",
            "sent1": "The chess match draws after both players run out of moves.",
            "sent2": "The soccer game draws with a score of 2-2.",
            "sent3": "The quiz competition draws as both teams answer all questions correctly.",
            "sent4": "The tennis tournament draws as the final set reaches a tiebreaker.",
            "sent5": "The basketball game draws in the last few seconds with a tied score."
        }
    ]
}