{
    "term": "drawn",
    "meanings": [
        {
            "definition": "To produce a picture or diagram by making lines and marks on paper.",
            "pos": "verb",
            "sent1": "She drawn a beautiful landscape during art class.",
            "sent2": "The artist drawn a portrait of his friend.",
            "sent3": "The child drawn a stick figure that made everyone laugh.",
            "sent4": "Her words drawn a vivid image in my mind.",
            "sent5": "The illustrator drawn a magical world with her pencils."
        },
        {
            "definition": "To pull or drag something in a particular direction.",
            "pos": "verb",
            "sent1": "He drawn the heavy box across the room.",
            "sent2": "The horse drawn the carriage down the street.",
            "sent3": "The magnet drawn the metal paperclips towards it.",
            "sent4": "The strong wind drawn the leaves off the trees.",
            "sent5": "The current drawn the boat downstream with great force."
        },
        {
            "definition": "To bring out a response or reaction from someone.",
            "pos": "verb",
            "sent1": "Her speech drawn a standing ovation from the audience.",
            "sent2": "The comedian drawn laughter from the crowd with his jokes.",
            "sent3": "The sad movie drawn tears from many viewers.",
            "sent4": "His actions drawn anger from his friends.",
            "sent5": "The surprise party drawn a shocked expression from her face."
        },
        {
            "definition": "Showing signs of tiredness or fatigue.",
            "pos": "adjective",
            "sent1": "After the long hike, she felt drawn and ready for a nap.",
            "sent2": "The drawn expression on his face indicated a need for rest.",
            "sent3": "The drawn look in her eyes revealed a lack of sleep.",
            "sent4": "His drawn appearance showed the effects of a busy week.",
            "sent5": "The drawn features on his face hinted at a tiring day."
        }
    ]
}