{
    "term": "dreadnought",
    "meanings": [
        {
            "definition": "A type of battleship introduced in the early 20th century, heavily armored and armed with large-caliber guns.",
            "pos": "noun",
            "sent1": "The dreadnought sailed majestically across the ocean.",
            "sent2": "The navy deployed a powerful dreadnought to protect the coast.",
            "sent3": "The dreadnought ship looked like a floating fortress.",
            "sent4": "In the battle, the dreadnought stood like an invincible giant.",
            "sent5": "The dreadnought's cannons roared, shaking the sea.",
            "sent6": "With its massive guns, the dreadnought struck fear into enemy hearts."
        },
        {
            "definition": "A fearless person or warrior.",
            "pos": "noun",
            "sent1": "The young knight was known as a dreadnought on the battlefield.",
            "sent2": "She faced the dragon with the courage of a dreadnought.",
            "sent3": "The dreadnought warrior never backed down from a challenge.",
            "sent4": "His spirit was as unyielding as a dreadnought in the face of danger.",
            "sent5": "The dreadnought's bravery inspired the entire army.",
            "sent6": "In tales of old, the hero was always portrayed as a dreadnought."
        },
        {
            "definition": "A heavy overcoat worn in the 19th century.",
            "pos": "noun",
            "sent1": "The traveler bundled up in his warm dreadnought.",
            "sent2": "She wore a stylish dreadnought to keep out the cold.",
            "sent3": "The dreadnought was so heavy, it felt like carrying a small bear.",
            "sent4": "In the snowstorm, the dreadnought was a shield against the wind.",
            "sent5": "The old photograph showed men in long dreadnoughts braving the winter.",
            "sent6": "The dreadnought's thick fabric kept out the chill during the carriage ride."
        }
    ]
}