{
    "term": "dress",
    "meanings": [
        {
            "definition": "Clothing worn for a particular occasion or purpose.",
            "pos": "noun",
            "sent1": "She wore a beautiful dress to the party.",
            "sent2": "The bridesmaids picked out matching dresses for the wedding.",
            "sent3": "The dress she wore to the beach was covered in sand by the end of the day.",
            "sent4": "The forest was like a dress of greenery, wrapping the trees in its embrace.",
            "sent5": "The dress she wore on stage sparkled under the bright lights."
        },
        {
            "definition": "To put on clothes.",
            "pos": "verb",
            "sent1": "He will dress warmly before going outside in the snow.",
            "sent2": "In the morning, she dresses quickly for school.",
            "sent3": "The cat tried to dress itself in a tiny hat, looking quite silly.",
            "sent4": "The sky began to dress itself in shades of pink as the sun set.",
            "sent5": "She always dresses in her favorite colors to feel confident."
        },
        {
            "definition": "To prepare food for cooking.",
            "pos": "verb",
            "sent1": "She will dress the salad with a light vinaigrette.",
            "sent2": "The chef taught the students how to dress a salad properly.",
            "sent3": "He tried to dress the cake with too much frosting, making it too sweet.",
            "sent4": "The chef's hands moved quickly to dress the plate with artistic flair.",
            "sent5": "The aroma of herbs filled the kitchen as she dressed the roast with seasoning."
        },
        {
            "definition": "To decorate or adorn.",
            "pos": "verb",
            "sent1": "They will dress the Christmas tree with colorful ornaments.",
            "sent2": "The room was dressed in streamers and balloons for the party.",
            "sent3": "She tried to dress the cake with edible flowers for a unique touch.",
            "sent4": "The garden was dressed in a blanket of snow, creating a winter wonderland.",
            "sent5": "The artist carefully dressed the canvas with vibrant strokes of paint."
        },
        {
            "definition": "To groom or style hair.",
            "pos": "verb",
            "sent1": "She will dress her hair in a fancy updo for the event.",
            "sent2": "He dresses his hair with gel to keep it in place.",
            "sent3": "The little girl tried to dress her doll's hair but ended up in a tangle.",
            "sent4": "The wind dressed the trees' branches in a wild, tousled look.",
            "sent5": "The hairstylist carefully dressed the bride's hair in elegant curls."
        }
    ]
}