{
    "term": "dresser",
    "meanings": [
        {
            "definition": "A piece of furniture with drawers and shelves for storing clothes and other items.",
            "pos": "noun",
            "sent1": "My dresser is filled with neatly folded clothes.",
            "sent2": "She opened the dresser to pick out a fresh pair of socks.",
            "sent3": "The dresser in the bedroom was so full, it looked like it might burst.",
            "sent4": "Her dresser was a treasure trove of memories, each item holding a story.",
            "sent5": "The dresser stood proudly in the corner, a symbol of organization and tidiness."
        },
        {
            "definition": "A person who dresses in a specified way, especially professionally.",
            "pos": "noun",
            "sent1": "The fashion dresser at the magazine always had the trendiest outfits.",
            "sent2": "The dresser for the theater production ensured all actors were in costume.",
            "sent3": "The dresser for the fashion show had a keen eye for style and detail.",
            "sent4": "She was a dresser for the stars, making sure they looked perfect for the red carpet.",
            "sent5": "The dresser's impeccable taste made everyone admire their fashion sense."
        },
        {
            "definition": "A person who assists a surgeon during operations by handing instruments and other supplies.",
            "pos": "noun",
            "sent1": "The surgical dresser handed the scalpel to the surgeon with precision.",
            "sent2": "The dresser in the operating room ensured all tools were ready for the procedure.",
            "sent3": "The dresser joked that they were the real 'handyman' in the surgery.",
            "sent4": "The dresser's swift movements were like a well-choreographed dance in the OR.",
            "sent5": "The dresser's role was crucial in the operation, like a silent guardian aiding the surgeon."
        }
    ]
}