{
    "term": "drifters",
    "meanings": [
        {
            "definition": "A person who moves aimlessly from place to place without a fixed home or job.",
            "pos": "noun",
            "sent1": "The group of drifters wandered the streets with no destination in mind.",
            "sent2": "The city park is a common spot for drifters to gather and share stories.",
            "sent3": "The drifters accidentally ended up in a fancy restaurant, looking lost but intrigued.",
            "sent4": "In the sea of life, we are all drifters, searching for our true path.",
            "sent5": "The image of the lone drifter under the starry sky stayed with me for days."
        },
        {
            "definition": "A floating object or piece of debris carried along by currents in a body of water.",
            "pos": "noun",
            "sent1": "The river was filled with drifters, carried gently downstream by the current.",
            "sent2": "The ocean waves pushed the drifters closer to the shore with each passing minute.",
            "sent3": "The ducks used the drifters as tiny islands, resting in the middle of the pond.",
            "sent4": "The drifters bobbed up and down, dancing to the rhythm of the water.",
            "sent5": "The sunlight reflected off the drifters, creating a mesmerizing sparkle on the water's surface."
        },
        {
            "definition": "A motor vehicle that is out of control and moving sideways.",
            "pos": "noun",
            "sent1": "The driver struggled to regain control of the drifter as it skidded across the road.",
            "sent2": "The mechanic fixed the issue causing the drifter to veer off course unexpectedly.",
            "sent3": "The drifter decided to take a detour through the field, much to the surprise of the passengers.",
            "sent4": "The drifter slid gracefully around the corner, leaving a trail of dust behind.",
            "sent5": "The loud screech of the drifter's tires echoed through the empty streets at night."
        }
    ]
}