{
    "term": "drills",
    "meanings": [
        {
            "definition": "A tool with a rotating cutting tip for making holes in hard materials.",
            "pos": "noun",
            "sent1": "My dad used a drill to make a hole in the wall.",
            "sent2": "The construction worker brought his drill to work every day.",
            "sent3": "The drill whirred loudly as it bored into the wood.",
            "sent4": "The dentist's drill sounded like a tiny jackhammer.",
            "sent5": "The drill's sharp tip easily pierced through the metal."
        },
        {
            "definition": "A training exercise or practice for improving a skill.",
            "pos": "noun",
            "sent1": "The basketball team did shooting drills to improve their accuracy.",
            "sent2": "She practiced her piano drills every day to get better.",
            "sent3": "The spelling drill was so repetitive, it put me to sleep.",
            "sent4": "The math drill felt like a mental workout.",
            "sent5": "The dance drill helped the students perfect their routine."
        },
        {
            "definition": "To bore or pierce with a drill.",
            "pos": "verb",
            "sent1": "He carefully drills holes in the wall to hang pictures.",
            "sent2": "The miner drills into the rock to find precious gems.",
            "sent3": "She drills the straw into the juice box with precision.",
            "sent4": "The dentist drills into the tooth to remove the decay.",
            "sent5": "The carpenter drills the screws into the wood to secure the frame."
        },
        {
            "definition": "To practice or train in a skill through repetition.",
            "pos": "verb",
            "sent1": "She drills her lines for the play every night.",
            "sent2": "The athletes drill their moves to perfection before the competition.",
            "sent3": "He drills the dance routine over and over until it's flawless.",
            "sent4": "The chef drills the recipe until it's second nature.",
            "sent5": "The students drill the vocabulary words until they can spell them in their sleep."
        }
    ]
}