{
    "term": "drive",
    "meanings": [
        {
            "definition": "To operate a vehicle",
            "pos": "verb",
            "sent1": "I can drive the car to the store.",
            "sent2": "She learned to drive when she was sixteen.",
            "sent3": "The cat tried to drive the toy car.",
            "sent4": "His passion for cars drives him to learn more about engines.",
            "sent5": "The children pretended to drive a spaceship to the moon."
        },
        {
            "definition": "A strong natural or instinctive desire or impulse",
            "pos": "noun",
            "sent1": "His drive to succeed is admirable.",
            "sent2": "The hunger drive in animals is powerful.",
            "sent3": "The drive to eat cake is strong after dinner.",
            "sent4": "Her drive for perfection pushes her to work hard.",
            "sent5": "The drive to explore new places is exciting."
        },
        {
            "definition": "A trip or journey in a vehicle",
            "pos": "noun",
            "sent1": "We went on a long drive to the beach.",
            "sent2": "The scenic drive through the mountains was breathtaking.",
            "sent3": "The drive to the airport was smooth and quick.",
            "sent4": "The drive to the countryside was a refreshing escape.",
            "sent5": "The family enjoyed a leisurely drive in the countryside."
        },
        {
            "definition": "To force or compel someone to do something",
            "pos": "verb",
            "sent1": "The coach will drive the team to practice harder.",
            "sent2": "Peer pressure can drive individuals to make poor choices.",
            "sent3": "The teacher will drive the students to complete their homework.",
            "sent4": "His determination will drive him to achieve his goals.",
            "sent5": "The motivation to succeed will drive her to work diligently."
        },
        {
            "definition": "A determined and energetic effort",
            "pos": "noun",
            "sent1": "Her drive to finish the project was impressive.",
            "sent2": "The team showed great drive in winning the championship.",
            "sent3": "The drive to clean the house was suddenly gone.",
            "sent4": "His drive to help others is truly inspiring.",
            "sent5": "The drive to excel in academics led to her success."
        }
    ]
}