{
    "term": "droil",
    "meanings": [
        {
            "definition": "To work hard and steadily",
            "pos": "verb",
            "sent1": "She would droil in the garden all day, planting seeds and pulling weeds.",
            "sent2": "The ants droil tirelessly to gather food for their colony.",
            "sent3": "The little squirrel decided to droil like a grown-up squirrel, trying to lift acorns twice its size.",
            "sent4": "The determined marathon runner continued to droil towards the finish line, despite the pouring rain.",
            "sent5": "The old steam engine seemed to droil up the steep hill, puffing and chugging along."
        },
        {
            "definition": "A dull, hardworking person",
            "pos": "noun",
            "sent1": "He was known as the office droil, always focused on his tasks without any excitement.",
            "sent2": "The droil in the library shelves books quietly, organizing them with precision.",
            "sent3": "The sleepy cat lazily watched the droil mouse scurrying around the room.",
            "sent4": "She felt like a droil in the bustling city, surrounded by energetic people rushing past.",
            "sent5": "The droil worker diligently completed each task, never seeking recognition for his efforts."
        },
        {
            "definition": "To move or act slowly and laboriously",
            "pos": "verb",
            "sent1": "The heavy box droiled across the floor as she struggled to push it into place.",
            "sent2": "The tired hiker began to droil up the steep mountain path, taking slow and steady steps.",
            "sent3": "The sleepy bear started to droil towards the river, craving a refreshing drink.",
            "sent4": "The old car seemed to droil along the bumpy road, its engine wheezing with effort.",
            "sent5": "The snail continued to droil along the garden path, leaving a shiny trail behind."
        }
    ]
}