{
    "term": "drones",
    "meanings": [
        {
            "definition": "A low continuous humming sound",
            "pos": "noun",
            "sent1": "The drones of the bees filled the garden with a peaceful hum.",
            "sent2": "The constant drones of the machines in the factory could be heard from afar.",
            "sent3": "The drones of the distant cars sounded like a lullaby to the tired traveler.",
            "sent4": "The drones of the wind through the trees created a soothing melody in the forest.",
            "sent5": "The drones of the cicadas in the summer evening added to the tranquility of the park."
        },
        {
            "definition": "A male bee in a colony of social bees, which does no work and serves only to fertilize the queen",
            "pos": "noun",
            "sent1": "The drones in the beehive were lounging around while the worker bees buzzed busily.",
            "sent2": "The drones in the hive were essential for the queen bee's reproduction.",
            "sent3": "The drones joked about their easy life in the hive, knowing their important role.",
            "sent4": "The drones' only duty was to mate with the queen, a task they took seriously.",
            "sent5": "The drones' presence ensured the continuation of the bee colony's lineage."
        },
        {
            "definition": "A remote-controlled pilotless aircraft or missile",
            "pos": "noun",
            "sent1": "The military used drones for surveillance missions in enemy territory.",
            "sent2": "The drones flew silently over the battlefield, capturing crucial information.",
            "sent3": "The kids played with a toy drone, pretending it was on a secret spy mission.",
            "sent4": "The drone's camera provided a bird's eye view of the landscape below.",
            "sent5": "The drone's precision in targeting made it a valuable asset in the military operations."
        }
    ]
}