{
    "term": "droner",
    "meanings": [
        {
            "definition": "One who speaks in a monotonous tone.",
            "pos": "noun",
            "sent1": "The droner in class made it hard to stay awake.",
            "sent2": "The meeting droner put everyone to sleep with his speech.",
            "sent3": "The droner at the party made even the music sound boring.",
            "sent4": "Her voice was a droner, like a never-ending rain shower.",
            "sent5": "The teacher's droner was like a lullaby, slowly lulling the students into a trance."
        },
        {
            "definition": "A device that flies without a pilot.",
            "pos": "noun",
            "sent1": "The military used a droner for surveillance missions.",
            "sent2": "The droner hovered silently in the sky, capturing breathtaking aerial views.",
            "sent3": "The kids were amazed by the tiny droner flying around the park.",
            "sent4": "The droner's flight was as graceful as a bird soaring in the sky.",
            "sent5": "The droner's camera captured stunning images from above, like a bird's eye view."
        },
        {
            "definition": "To speak in a monotonous tone.",
            "pos": "verb",
            "sent1": "He would droner on and on about his favorite topic.",
            "sent2": "She dronered through the presentation, causing some to doze off.",
            "sent3": "The comedian decided to droner his jokes for a change, but it didn't go well.",
            "sent4": "Her voice dronered like a broken record stuck on repeat.",
            "sent5": "The politician's speech dronered through the hall, putting the audience in a trance."
        },
        {
            "definition": "To fly without a pilot.",
            "pos": "verb",
            "sent1": "The drone dronered over the fields, capturing stunning footage.",
            "sent2": "They watched as the droner soared high above the mountains.",
            "sent3": "The toy droner decided to droner around the room on its own.",
            "sent4": "The droner glided through the air like a silent ghost.",
            "sent5": "The droner's flight path dronered gracefully through the clear blue sky."
        }
    ]
}