{
    "term": "dropshots",
    "meanings": [
        {
            "definition": "A shot in tennis made by dropping the ball just over the net.",
            "pos": "noun",
            "sent1": "During the game, she surprised her opponent with a series of well-executed dropshots.",
            "sent2": "The player's dropshots were so precise that they often caught the opponent off guard.",
            "sent3": "The tennis match turned into a dropshot showdown, with both players trying to outdo each other.",
            "sent4": "Her dropshots floated over the net like delicate feathers, impossible to return.",
            "sent5": "The coach emphasized the importance of practicing dropshots to improve overall gameplay."
        },
        {
            "definition": "A photograph taken from above.",
            "pos": "noun",
            "sent1": "The aerial dropshot of the city captured all the buildings and streets from above.",
            "sent2": "The photographer's specialty was capturing stunning dropshots of landscapes from a bird's eye view.",
            "sent3": "The dropshot of the beach looked like a colorful mosaic from up high.",
            "sent4": "The dropshot of the forest revealed a mesmerizing pattern of trees and shadows.",
            "sent5": "The artist's collection featured unique dropshots of various landmarks taken from above."
        },
        {
            "definition": "A type of cocktail made by dropping a shot of alcohol into a glass of another beverage.",
            "pos": "noun",
            "sent1": "At the party, they served delicious dropshots that combined different flavors in each glass.",
            "sent2": "The bartender's specialty was creating visually appealing dropshots that delighted customers.",
            "sent3": "The group of friends enjoyed experimenting with new dropshot recipes during their gatherings.",
            "sent4": "The colorful layers in the dropshot created a mesmerizing effect as they mixed together.",
            "sent5": "The menu featured a variety of creative dropshots that added a fun twist to traditional cocktails."
        }
    ]
}