{
    "term": "dropsies",
    "meanings": [
        {
            "definition": "A condition characterized by the accumulation of fluid in the tissues, causing swelling.",
            "pos": "noun",
            "sent1": "She had dropsies in her ankles, making it hard for her to walk.",
            "sent2": "The doctor diagnosed him with dropsies after noticing the swelling in his legs.",
            "sent3": "The dropsies in her cheeks made her look like a chipmunk storing nuts.",
            "sent4": "The dropsies in the sponge soaked up all the spilled water in no time.",
            "sent5": "The dropsies in the flower petals made them heavy and droopy."
        },
        {
            "definition": "A disease in fish characterized by the accumulation of fluid in the body cavity.",
            "pos": "noun",
            "sent1": "The goldfish in the tank showed signs of dropsies, floating near the surface.",
            "sent2": "The dropsies in the koi pond caused concern among the fish enthusiasts.",
            "sent3": "The dropsies in the fish made them look like they had swallowed tiny water balloons.",
            "sent4": "The dropsies in the fish tank created a shimmering effect as they moved.",
            "sent5": "The dropsies in the fish's scales made them appear swollen and shiny."
        },
        {
            "definition": "A game in which players try to catch falling objects.",
            "pos": "noun",
            "sent1": "The children played dropsies in the park, laughing as they tried to catch the falling leaves.",
            "sent2": "Dropsies is a fun game to play at parties, testing your reflexes and coordination.",
            "sent3": "During the dropsies game, Sarah accidentally caught a falling acorn in her pocket.",
            "sent4": "Playing dropsies felt like trying to catch raindrops in a storm.",
            "sent5": "The dropsies game became more challenging as the objects fell faster and faster."
        }
    ]
}