{
    "term": "drop",
    "meanings": [
        {
            "definition": "To fall or let fall in drops.",
            "pos": "verb",
            "sent1": "I watched the raindrops drop from the sky.",
            "sent2": "Please drop the coin into the piggy bank.",
            "sent3": "The leaky faucet decided to drop a surprise visit in the middle of the night.",
            "sent4": "Her heart seemed to drop when she heard the bad news.",
            "sent5": "The tears drop silently down her cheeks."
        },
        {
            "definition": "A small quantity of liquid that falls or is produced in a more or less spherical mass; a liquid globule.",
            "pos": "noun",
            "sent1": "The raindrop landed softly on the window.",
            "sent2": "She added a drop of vanilla extract to the batter.",
            "sent3": "The mischievous toddler thought the water drop was a tiny bouncing ball.",
            "sent4": "The drop of honey on the spoon glistened in the sunlight.",
            "sent5": "The drop of dew on the leaf sparkled like a tiny diamond."
        },
        {
            "definition": "To let fall in drops or small portions.",
            "pos": "verb",
            "sent1": "She carefully dropped the paint onto the canvas.",
            "sent2": "The chef will drop the sauce onto the dish just before serving.",
            "sent3": "The mischievous student decided to drop hints about the surprise party.",
            "sent4": "His voice seemed to drop with each word he spoke.",
            "sent5": "The sun began to drop below the horizon, painting the sky in hues of orange and pink."
        },
        {
            "definition": "To fall in globules or small portions, as water or other liquid.",
            "pos": "verb",
            "sent1": "The raindrops drop gently on the roof.",
            "sent2": "The ice cream started to drop from the cone in the heat.",
            "sent3": "The water drop seemed to dance as it fell from the leaf.",
            "sent4": "The stars drop from the sky like shimmering diamonds.",
            "sent5": "The paint drop splattered on the floor, creating a colorful mess."
        },
        {
            "definition": "To fall vertically; have an abrupt descent.",
            "pos": "verb",
            "sent1": "The elevator will drop to the ground floor.",
            "sent2": "The roller coaster will drop suddenly after reaching the top.",
            "sent3": "The temperature seemed to drop rapidly as the storm approached.",
            "sent4": "Her stomach felt like it would drop as the plane descended.",
            "sent5": "The rock climber felt a rush of adrenaline as he prepared to drop down the cliff."
        }
    ]
}