{
    "term": "dropper",
    "meanings": [
        {
            "definition": "A person or thing that drops.",
            "pos": "noun",
            "sent1": "The dropper carefully placed the vase on the shelf.",
            "sent2": "The rain dropper fell from the sky, refreshing the dry earth.",
            "sent3": "The mischievous cat acted like a dropper, knocking things off the table.",
            "sent4": "Her heart felt heavy, like a dropper releasing its burden.",
            "sent5": "The dropper in the clock ticked steadily, marking the passage of time."
        },
        {
            "definition": "A small tube with a rubber bulb at one end used to dispense liquid in drops.",
            "pos": "noun",
            "sent1": "The medicine dropper helped the nurse give the patient the right dosage.",
            "sent2": "She used the dropper to add flavor to her baking recipe.",
            "sent3": "The chef pretended the dropper was a tiny trumpet, playing a tune with drops of sauce.",
            "sent4": "The dropper was like a magician, turning water into sparkling drops of color.",
            "sent5": "The dropper in the science lab was precise, releasing one drop at a time."
        },
        {
            "definition": "A device for dropping bombs.",
            "pos": "noun",
            "sent1": "The military pilot operated the dropper to release the bombs on target.",
            "sent2": "The enemy's aircraft carried a powerful bomb dropper.",
            "sent3": "The cartoon character mistakenly used the bomb dropper to water the garden.",
            "sent4": "The dropper in the movie exploded with a deafening roar, scattering destruction.",
            "sent5": "The bomb dropper in the war documentary was a fearsome sight, unleashing devastation."
        },
        {
            "definition": "A person who quits or withdraws from a competition.",
            "pos": "noun",
            "sent1": "The chess player was a sore loser, always being a dropper when losing.",
            "sent2": "She felt like a dropper, leaving the race halfway through.",
            "sent3": "The dropper in the game surprised everyone by suddenly quitting when winning.",
            "sent4": "His decision to be a dropper in the championship disappointed his team.",
            "sent5": "The dropper in the debate competition left the stage without a word, causing a stir."
        }
    ]
}