{
    "term": "drops",
    "meanings": [
        {
            "definition": "Fall in small quantities of liquid.",
            "pos": "verb",
            "sent1": "The rain drops gently on the roof.",
            "sent2": "She drops the coin into the fountain for good luck.",
            "sent3": "The leaky faucet drops all night, keeping me awake.",
            "sent4": "Her smile drops like a raindrop falling from a leaf.",
            "sent5": "The drops of dew sparkle in the morning sunlight."
        },
        {
            "definition": "A small round or pear-shaped portion of liquid.",
            "pos": "noun",
            "sent1": "The doctor prescribed eye drops for her infection.",
            "sent2": "He enjoys the sweet drops of honey on his toast.",
            "sent3": "The drops of paint on the canvas create a beautiful pattern.",
            "sent4": "The drops of rain on the window look like tears.",
            "sent5": "The drops of water on the leaves glisten in the sun."
        },
        {
            "definition": "A small quantity of a liquid.",
            "pos": "noun",
            "sent1": "She added a few drops of vanilla extract to the batter.",
            "sent2": "The drops of lemon juice enhance the flavor of the dish.",
            "sent3": "The drops of oil in the pan sizzle as she cooks.",
            "sent4": "The drops of sweat on his forehead show his hard work.",
            "sent5": "The drops of rain create puddles on the sidewalk."
        },
        {
            "definition": "To let fall in drops.",
            "pos": "verb",
            "sent1": "He carefully drops the medicine into the spoon.",
            "sent2": "She drops the petals one by one into the water.",
            "sent3": "The chef drops the batter onto the hot griddle.",
            "sent4": "The artist drops paint onto the canvas to create a masterpiece.",
            "sent5": "She drops her keys into her purse before leaving."
        }
    ]
}