{
    "term": "dropped",
    "meanings": [
        {
            "definition": "To fall or let fall in a downward direction.",
            "pos": "verb",
            "sent1": "The apple dropped from the tree.",
            "sent2": "I accidentally dropped my pencil on the floor.",
            "sent3": "The raindrop dropped from the cloud with a tiny splash.",
            "sent4": "Her heart dropped when she heard the bad news.",
            "sent5": "The temperature dropped suddenly, making everyone shiver."
        },
        {
            "definition": "To decrease or diminish in amount or value.",
            "pos": "verb",
            "sent1": "The price of the toy dropped after the sale.",
            "sent2": "His energy level dropped as the day went on.",
            "sent3": "The excitement in the room dropped when the lights went out.",
            "sent4": "Her smile dropped when she realized she forgot her homework.",
            "sent5": "The number of attendees dropped significantly at the event."
        },
        {
            "definition": "To deliver or release something.",
            "pos": "verb",
            "sent1": "The postman dropped the package at the doorstep.",
            "sent2": "She dropped the letter into the mailbox.",
            "sent3": "The magician dropped the curtain to reveal a surprise.",
            "sent4": "He dropped the bombshell news during the meeting.",
            "sent5": "The singer dropped her new album on streaming platforms."
        },
        {
            "definition": "To stop or discontinue something.",
            "pos": "verb",
            "sent1": "She dropped her gym membership due to lack of time.",
            "sent2": "The company decided to drop the project halfway through.",
            "sent3": "He dropped the idea of going on a vacation this summer.",
            "sent4": "The teacher dropped the assignment deadline for the students.",
            "sent5": "They dropped the plan to renovate the house after considering the costs."
        },
        {
            "definition": "To lose or shed something.",
            "pos": "verb",
            "sent1": "The cat dropped its fur during shedding season.",
            "sent2": "He dropped a few pounds after starting a new diet.",
            "sent3": "She dropped her inhibitions and danced freely at the party.",
            "sent4": "The tree dropped its leaves in the autumn breeze.",
            "sent5": "He dropped his old habits to embrace a healthier lifestyle."
        }
    ]
}