{
    "term": "druxy",
    "meanings": [
        {
            "definition": "Covered with a layer of decayed wood or fungus",
            "pos": "adjective",
            "sent1": "The old tree stump in the forest was druxy, with moss and rot covering its surface.",
            "sent2": "The abandoned cabin had a druxy roof, showing signs of decay and mold.",
            "sent3": "The druxy log looked like a tiny forest of its own, with mushrooms growing on its surface.",
            "sent4": "The druxy fence post crumbled like a cookie left out in the rain.",
            "sent5": "The druxy smell of damp wood and fungus filled the air in the abandoned shed."
        },
        {
            "definition": "Affected with dry rot",
            "pos": "adjective",
            "sent1": "The druxy floorboards creaked underfoot, showing their weakened state.",
            "sent2": "The druxy ship hull needed urgent repairs to fix the dry rot eating away at it.",
            "sent3": "The druxy wooden chair groaned as if it had caught a case of the rot.",
            "sent4": "The druxy beams of the old barn sagged like a tired back under the weight of dry rot.",
            "sent5": "The druxy door frame crumbled at the slightest touch, revealing the extent of the dry rot within."
        },
        {
            "definition": "Containing dry rot",
            "pos": "adjective",
            "sent1": "The druxy attic smelled musty and damp, a sign of the dry rot within the walls.",
            "sent2": "The druxy beams of the house were a clear indication of the dry rot infesting the structure.",
            "sent3": "The druxy floor felt spongy underfoot, a result of the dry rot eating away at the wood.",
            "sent4": "The druxy window frames crumbled like sandcastles, revealing the hidden dry rot within.",
            "sent5": "The druxy smell of decay permeated the room, a telltale sign of the dry rot lurking within the walls."
        }
    ]
}