{
    "term": "dry",
    "meanings": [
        {
            "definition": "Free from moisture or liquid",
            "pos": "adjective",
            "sent1": "The desert air felt very dry on my skin.",
            "sent2": "After hanging the clothes out to dry, they were completely dry.",
            "sent3": "The comedian's dry humor always made me chuckle.",
            "sent4": "Her dry wit cut through the tension in the room like a sharp knife.",
            "sent5": "The dry sand under my feet crunched with each step."
        },
        {
            "definition": "Lacking interest or excitement",
            "pos": "adjective",
            "sent1": "The lecture was so dry that many students fell asleep.",
            "sent2": "The movie was dry, and I found myself checking my phone often.",
            "sent3": "The party was so dry that even the music sounded bored.",
            "sent4": "Her storytelling was as dry as a bone, lacking any spark.",
            "sent5": "The book's plot was so dry that I struggled to finish it."
        },
        {
            "definition": "Humorously sarcastic or witty",
            "pos": "adjective",
            "sent1": "His dry remarks always made us laugh.",
            "sent2": "She had a dry sense of humor that caught many off guard.",
            "sent3": "The dry comment about the weather had everyone chuckling.",
            "sent4": "His dry wit was like a hidden gem in the conversation.",
            "sent5": "The dry joke he cracked left us in stitches."
        },
        {
            "definition": "Thirsty or in need of liquid",
            "pos": "adjective",
            "sent1": "After the long hike, I felt dry and in need of water.",
            "sent2": "The dry plants in the garden were begging for a drink.",
            "sent3": "The dry throat made it hard for him to speak.",
            "sent4": "Her dry lips were a clear sign of dehydration.",
            "sent5": "The dry mouth sensation was unbearable in the heat."
        },
        {
            "definition": "Not producing a liquid or moisture",
            "pos": "adjective",
            "sent1": "The dry sponge absorbed all the spilled water.",
            "sent2": "The dry well had been empty for months.",
            "sent3": "The dry towel quickly soaked up the spilled milk.",
            "sent4": "The dry soil cracked under the scorching sun.",
            "sent5": "The dry cloth wiped away the dust effortlessly."
        }
    ]
}