{
    "term": "duallies",
    "meanings": [
        {
            "definition": "A pair of wheels on the rear axle of a motor vehicle, especially a truck, that are equipped with dual tires on each side.",
            "pos": "noun",
            "sent1": "The truck had duallies on the back, making it easier to carry heavy loads.",
            "sent2": "The duallies on the truck provided extra stability when driving on rough roads.",
            "sent3": "The duallies on the truck were so big, they looked like giant donuts rolling down the street.",
            "sent4": "The duallies on the truck were like a reliable team, always working together to keep the vehicle steady.",
            "sent5": "The shiny duallies gleamed in the sunlight, a symbol of the truck's strength and durability."
        },
        {
            "definition": "A type of shoe with two sets of eyelets for laces.",
            "pos": "noun",
            "sent1": "She tied the laces of her duallies tightly before going for a run.",
            "sent2": "The duallies she wore were comfortable and provided good support for her feet.",
            "sent3": "His duallies were so bright and colorful, they looked like a pair of rainbows on his feet.",
            "sent4": "The duallies hugged her feet snugly, like a gentle embrace with every step she took.",
            "sent5": "The duallies were her favorite shoes, always ready for any adventure she embarked on."
        },
        {
            "definition": "A type of firearm that can fire two shots in quick succession without needing to be reloaded.",
            "pos": "noun",
            "sent1": "The duallies were popular among sharpshooters for their rapid firing capability.",
            "sent2": "He aimed the duallies at the target and fired two shots in quick succession.",
            "sent3": "The duallies were so efficient, they could hit two targets with just one pull of the trigger.",
            "sent4": "The duallies were like a double punch, striking the bullseye with precision and speed.",
            "sent5": "The sound of the duallies firing echoed through the shooting range, a testament to their power and accuracy."
        }
    ]
}