{
    "term": "dubiousnesses",
    "meanings": [
        {
            "definition": "The state or quality of being doubtful or uncertain.",
            "pos": "noun",
            "sent1": "The dubiousnesses of his story made me question its truthfulness.",
            "sent2": "Her expression showed a clear sense of dubiousnesses about the plan.",
            "sent3": "The cat's dubiousnesses about the new toy was evident in its cautious approach.",
            "sent4": "The dark clouds cast a shadow of dubiousnesses over the picnic plans.",
            "sent5": "The teacher's dubiousnesses towards the excuse was palpable in her raised eyebrow."
        },
        {
            "definition": "A feeling of uncertainty or skepticism.",
            "pos": "noun",
            "sent1": "There was a sense of dubiousnesses in the air as they awaited the test results.",
            "sent2": "His raised eyebrow expressed his dubiousnesses towards the new proposal.",
            "sent3": "The comedian's joke was met with dubiousnesses from the audience, unsure if it was funny or not.",
            "sent4": "The detective's dubiousnesses towards the suspect's alibi led to further investigation.",
            "sent5": "The student's dubiousnesses about the assignment deadline grew as the clock ticked closer."
        },
        {
            "definition": "The condition of being questionable or suspicious.",
            "pos": "noun",
            "sent1": "The dubiousnesses surrounding the mysterious package raised concerns among the neighbors.",
            "sent2": "The politician's actions were met with widespread dubiousnesses from the public.",
            "sent3": "The magician's disappearing act left an air of dubiousnesses among the audience.",
            "sent4": "The old house had an aura of dubiousnesses, making it a popular spot for ghost stories.",
            "sent5": "The dubiousnesses of the deal made him hesitant to sign the contract."
        }
    ]
}