{
    "term": "duck",
    "meanings": [
        {
            "definition": "A waterbird with a broad blunt bill, short legs, webbed feet, and a waddling gait.",
            "pos": "noun",
            "sent1": "The duck swam gracefully in the pond.",
            "sent2": "I saw a duck at the park today.",
            "sent3": "Why did the duck bring a ruler to the pond? To measure the depth!",
            "sent4": "She moved through the crowd like a duck through water.",
            "sent5": "The duck's quack echoed across the lake."
        },
        {
            "definition": "To lower the head or body quickly to avoid a blow or missile.",
            "pos": "verb",
            "sent1": "He had to duck to dodge the flying ball.",
            "sent2": "Remember to duck if something comes flying towards you.",
            "sent3": "Why did the chicken refuse to play hide-and-seek with the duck? It was tired of ducking all the time!",
            "sent4": "She had to duck under the tree branches to pass through.",
            "sent5": "The ninja had to duck swiftly to avoid the enemy's attack."
        },
        {
            "definition": "To plunge under water momentarily.",
            "pos": "verb",
            "sent1": "The duck ducked under the surface of the pond.",
            "sent2": "I watched the duck duck under the water effortlessly.",
            "sent3": "Why did the duck challenge the fish to a diving contest? It wanted to show off its ducking skills!",
            "sent4": "She ducked under the wave just in time.",
            "sent5": "The swimmer had to duck under the floating log in the river."
        },
        {
            "definition": "A quick lowering of the head or body.",
            "pos": "noun",
            "sent1": "With a quick duck, he avoided the branch.",
            "sent2": "Her duck saved her from hitting the door frame.",
            "sent3": "Why did the duck wear a helmet? To protect its head during all the quick ducks!",
            "sent4": "The sudden duck surprised everyone in the room.",
            "sent5": "The duck of the child made the teacher smile."
        }
    ]
}