{
    "term": "dulcimores",
    "meanings": [
        {
            "definition": "A musical instrument with strings, typically played by plucking.",
            "pos": "noun",
            "sent1": "The dulcimores had delicate strings that produced beautiful sounds when plucked.",
            "sent2": "She learned to play the dulcimores at a young age and became quite skilled.",
            "sent3": "During the concert, the dulcimores suddenly started playing on their own, surprising everyone.",
            "sent4": "The dulcimores' strings danced like whispers in the wind, creating a melody that enchanted all who listened.",
            "sent5": "The dulcimores' music echoed through the forest, filling the air with a sense of tranquility."
        },
        {
            "definition": "The act of playing music on a dulcimore.",
            "pos": "noun",
            "sent1": "Her dulcimores playing was so soothing that it calmed everyone in the room.",
            "sent2": "The dulcimores playing at the festival attracted a large crowd of music lovers.",
            "sent3": "He tried to impress his friends by pretending to be a master of dulcimores playing.",
            "sent4": "The dulcimores playing floated through the room like a gentle breeze, touching the hearts of all who listened.",
            "sent5": "The dulcimores playing filled the hall with a sense of joy and harmony."
        },
        {
            "definition": "A person who plays the dulcimore.",
            "pos": "noun",
            "sent1": "The talented dulcimores player performed a mesmerizing solo at the concert.",
            "sent2": "She became a renowned dulcimores player after years of practice and dedication.",
            "sent3": "The mischievous dulcimores player added a playful twist to the traditional music.",
            "sent4": "His fingers moved on the dulcimores like a painter's brush on a canvas, creating a masterpiece of melodies.",
            "sent5": "The dulcimores player's passion for music shone brightly in every note played."
        }
    ]
}