{
    "term": "dulias",
    "meanings": [
        {
            "definition": "A type of veneration or worship given to saints in the Roman Catholic Church.",
            "pos": "noun",
            "sent1": "The community showed great dulias towards the patron saint of the village.",
            "sent2": "During the ceremony, the priest led the congregation in dulias for the beloved saint.",
            "sent3": "The children giggled as they pretended to offer dulias to their favorite action figure.",
            "sent4": "Her dulias for the historical figure was so deep, it felt like a spiritual connection.",
            "sent5": "The dulias for the saint was so intense, it filled the church with a sense of peace."
        },
        {
            "definition": "The act of showing reverence or honor to a saint.",
            "pos": "noun",
            "sent1": "Every year, the town holds a festival to express their dulias for the local saint.",
            "sent2": "The dulias shown by the pilgrims at the shrine was truly heartwarming.",
            "sent3": "The dulias given to the saint was so grand, it felt like a royal ceremony.",
            "sent4": "Her dulias for the saint was like a beacon of light in the darkness of doubt.",
            "sent5": "The dulias expressed by the crowd was a beautiful display of faith and respect."
        },
        {
            "definition": "The state of being a servant or slave.",
            "pos": "noun",
            "sent1": "In the ancient kingdom, the dulias of the servants was evident in their loyalty.",
            "sent2": "The dulias of the slaves was a reminder of the harsh realities of the past.",
            "sent3": "The dulias of the butler to the master was comically exaggerated in the play.",
            "sent4": "Her dulias to her demanding boss made her feel trapped in a cycle of servitude.",
            "sent5": "The dulias of the characters in the story painted a vivid picture of social hierarchy."
        }
    ]
}