{
    "term": "dumb",
    "meanings": [
        {
            "definition": "Lacking the power of speech",
            "pos": "adjective",
            "sent1": "The puppy was born dumb and couldn't bark like the others.",
            "sent2": "The mute boy communicated through gestures since he was dumb.",
            "sent3": "It was dumb of me to forget my lines during the play.",
            "sent4": "The silence in the library was so thick, it felt dumb.",
            "sent5": "The dumb mime entertained the crowd with his silent act."
        },
        {
            "definition": "Stupid or unintelligent",
            "pos": "adjective",
            "sent1": "The decision to jump off the roof was really dumb.",
            "sent2": "She felt dumb after failing the easy math test.",
            "sent3": "It was dumb to try and fit a square peg into a round hole.",
            "sent4": "The plan to rob a bank without a getaway car was dumb.",
            "sent5": "His dumb mistake cost the team the game."
        },
        {
            "definition": "Unable to speak",
            "pos": "adjective",
            "sent1": "The sore throat left her feeling dumb for days.",
            "sent2": "He was dumb with fear when the intruder entered the room.",
            "sent3": "Being dumb during the meeting made her miss important information.",
            "sent4": "The dumb child's voice was lost in the noisy crowd.",
            "sent5": "The dumb singer lost her voice before the concert."
        },
        {
            "definition": "Temporarily unable to speak due to strong emotion",
            "pos": "adjective",
            "sent1": "She was so overwhelmed with joy that she was left dumb.",
            "sent2": "The surprise left him dumbstruck and unable to speak.",
            "sent3": "His proposal rendered her dumb with happiness.",
            "sent4": "The news of her promotion left her dumb for a moment.",
            "sent5": "The heartfelt speech left the audience dumb in admiration."
        }
    ]
}