{
    "term": "dumping",
    "meanings": [
        {
            "definition": "To drop or let fall in a mass; to unload",
            "pos": "verb",
            "sent1": "She was dumping the toys into the box.",
            "sent2": "The workers were dumping the sand from the truck.",
            "sent3": "The kids were dumping the water on each other for fun.",
            "sent4": "The rain was dumping down on the roof all night.",
            "sent5": "He was dumping the ingredients into the mixing bowl with a loud clatter."
        },
        {
            "definition": "To get rid of or discard as unwanted or burdensome",
            "pos": "verb",
            "sent1": "He was dumping his old clothes to make space in the closet.",
            "sent2": "She was dumping the broken toys in the trash.",
            "sent3": "The cat was dumping its toys all over the house.",
            "sent4": "After the breakup, she felt like dumping all his gifts.",
            "sent5": "They were dumping the useless papers into the shredder."
        },
        {
            "definition": "A place where garbage is left; a landfill",
            "pos": "noun",
            "sent1": "The city built a new dumping for all the trash.",
            "sent2": "The dumping was overflowing with plastic bottles.",
            "sent3": "The raccoons were having a party at the dumping.",
            "sent4": "The dumping smelled terrible in the summer heat.",
            "sent5": "The birds were circling above the dumping looking for food."
        },
        {
            "definition": "The act of selling goods in another country at a price lower than in the domestic market",
            "pos": "noun",
            "sent1": "The company was accused of dumping their products in foreign markets.",
            "sent2": "Dumping can harm local businesses in the importing country.",
            "sent3": "The idea of dumping goods at low prices seemed strange to him.",
            "sent4": "The practice of dumping goods can lead to trade disputes.",
            "sent5": "Dumping goods at low prices can create unfair competition in the market."
        }
    ]
}