{
    "term": "dumper",
    "meanings": [
        {
            "definition": "A person or thing that dumps.",
            "pos": "noun",
            "sent1": "The dumper emptied the trash into the bin.",
            "sent2": "The construction site had a big dumper for moving soil.",
            "sent3": "The dumper at the park made the kids giggle as it dropped sand for the sandbox.",
            "sent4": "Her words were like a dumper, unloading all her frustrations at once.",
            "sent5": "The dumper in the storybook was a magical creature that could make anything disappear."
        },
        {
            "definition": "A vehicle or machine used for dumping.",
            "pos": "noun",
            "sent1": "The dumper truck carried rocks to the construction site.",
            "sent2": "The farmer used the dumper to unload hay for the animals.",
            "sent3": "The dumper beeped loudly as it backed up, warning everyone to move out of the way.",
            "sent4": "The dumper roared to life, ready to clear the debris from the road.",
            "sent5": "The dumper's hydraulic system lifted the heavy load effortlessly."
        },
        {
            "definition": "A container for dumping waste.",
            "pos": "noun",
            "sent1": "The park had separate dumpers for recycling and regular trash.",
            "sent2": "The industrial dumper was overflowing with discarded materials.",
            "sent3": "The dumper by the curb was full of old furniture waiting for pickup.",
            "sent4": "The dumper's lid was closed tightly to prevent any odors from escaping.",
            "sent5": "The dumper's wheels made it easy to move around the waste disposal area."
        },
        {
            "definition": "A person who ends a romantic relationship abruptly.",
            "pos": "noun",
            "sent1": "She was heartbroken when he turned out to be a dumper.",
            "sent2": "The dumper didn't even give her a chance to explain.",
            "sent3": "The dumper's breakup text was so short, it was almost comical.",
            "sent4": "Being a dumper in a relationship is never a kind choice.",
            "sent5": "The dumper's actions left a trail of broken hearts behind."
        }
    ]
}