{
    "term": "dunkers",
    "meanings": [
        {
            "definition": "A person who dunks food into liquid before eating.",
            "pos": "noun",
            "sent1": "The dunkers at the party enjoyed dipping their cookies in milk.",
            "sent2": "My little sister is a fan of dunkers, especially when it comes to her donuts and coffee.",
            "sent3": "The dunkers at the picnic were having a 'dunking' contest with their snacks.",
            "sent4": "She was the queen of dunkers, always finding the perfect balance between soggy and crunchy.",
            "sent5": "The group of friends were known as the dunkers because they loved to dip everything in chocolate fondue."
        },
        {
            "definition": "A type of religious group that practices baptism by immersion.",
            "pos": "noun",
            "sent1": "The dunkers in the community gathered at the river for their traditional baptism ceremony.",
            "sent2": "The history class discussed the beliefs and practices of the dunkers in early America.",
            "sent3": "The dunkers' church choir sang beautifully during the Sunday service.",
            "sent4": "She felt a sense of peace and renewal after joining the dunkers in their river baptism.",
            "sent5": "The dunkers' white robes symbolized purity and rebirth during the ceremony."
        },
        {
            "definition": "A type of basketball player known for their ability to dunk the ball.",
            "pos": "noun",
            "sent1": "The young basketball player aspired to be one of the best dunkers in the league.",
            "sent2": "Fans cheered loudly as the dunkers showcased their skills during the game.",
            "sent3": "The coach praised the team's dunkers for their impressive slam dunks.",
            "sent4": "He soared through the air like a true dunker, making the crowd go wild.",
            "sent5": "The dunker's powerful slam dunk sealed the victory for their team."
        }
    ]
}