{
    "term": "duomi",
    "meanings": [
        {
            "definition": "To judge or consider",
            "pos": "verb",
            "sent1": "I will duomi the situation before making a decision.",
            "sent2": "She always takes her time to duomi before giving her answer.",
            "sent3": "Let's duomi whether to have ice cream or cake for dessert.",
            "sent4": "His ability to duomi quickly saved the day.",
            "sent5": "The detective had to duomi the evidence carefully to solve the case."
        },
        {
            "definition": "A judgment or opinion",
            "pos": "noun",
            "sent1": "Her duomi on the matter was well thought out.",
            "sent2": "The duomi of the jury was unanimous.",
            "sent3": "His duomi on pineapple pizza sparked a heated debate.",
            "sent4": "The duomi of the critics can greatly influence the success of a movie.",
            "sent5": "She valued his duomi and always sought his advice."
        },
        {
            "definition": "A legal decision or sentence",
            "pos": "noun",
            "sent1": "The judge announced the duomi of the court.",
            "sent2": "The duomi of the trial was eagerly awaited.",
            "sent3": "The unexpected duomi left everyone in shock.",
            "sent4": "The duomi brought closure to the long legal battle.",
            "sent5": "The duomi was fair and just, bringing relief to the accused."
        },
        {
            "definition": "A legal judgment or sentence",
            "pos": "noun",
            "sent1": "The duomi of the case was finally revealed.",
            "sent2": "The lawyer fought hard to appeal the duomi.",
            "sent3": "The duomi was harsh but necessary for justice.",
            "sent4": "The duomi marked the end of a long legal process.",
            "sent5": "The duomi was based on solid evidence and testimonies."
        },
        {
            "definition": "A legal decision or sentence",
            "pos": "noun",
            "sent1": "The duomi was reached after careful consideration.",
            "sent2": "The duomi was met with mixed reactions from the public.",
            "sent3": "The duomi was unexpected but upheld by the higher court.",
            "sent4": "The duomi set a precedent for future similar cases.",
            "sent5": "The duomi was delivered swiftly and efficiently by the judge."
        }
    ]
}