{
    "term": "duplex",
    "meanings": [
        {
            "definition": "A house divided into two separate residences.",
            "pos": "noun",
            "sent1": "The duplex next door has a red door.",
            "sent2": "My friend lives in a cozy duplex with his family.",
            "sent3": "I accidentally walked into the wrong duplex and met my neighbor's cat.",
            "sent4": "The duplex stood tall, like a giant puzzle split in half.",
            "sent5": "The duplex looked like two small houses joined together."
        },
        {
            "definition": "A double-stranded molecule, such as DNA.",
            "pos": "noun",
            "sent1": "Scientists study the structure of the duplex to understand genetics.",
            "sent2": "DNA is made up of a complex duplex structure.",
            "sent3": "The DNA duplex decided to throw a party for its base pairs.",
            "sent4": "The duplex of genetic information held the secrets of life.",
            "sent5": "Under the microscope, the DNA duplex resembled a twisted ladder."
        },
        {
            "definition": "A type of printing press that can print on both sides of the paper.",
            "pos": "noun",
            "sent1": "The printing company invested in a new duplex for efficiency.",
            "sent2": "The duplex at the office saved time by printing on both sides.",
            "sent3": "The duplex printer joked about being two-faced in the office.",
            "sent4": "The duplex machine hummed as it printed on both sides effortlessly.",
            "sent5": "The duplex press revolutionized the printing industry with its dual capabilities."
        },
        {
            "definition": "A type of apartment with rooms on two floors.",
            "pos": "noun",
            "sent1": "The duplex apartment had a staircase leading to the upper level.",
            "sent2": "She loved the spaciousness of her duplex in the city.",
            "sent3": "The duplex residents had a race up and down the stairs for fun.",
            "sent4": "Living in a duplex felt like having a mini house on two levels.",
            "sent5": "The duplex layout provided a unique living experience with its two floors."
        }
    ]
}