{
    "term": "duplexing",
    "meanings": [
        {
            "definition": "The process of printing on both sides of a sheet of paper.",
            "pos": "noun",
            "sent1": "I learned about duplexing in school when we printed our essays on both sides of the paper.",
            "sent2": "The printer at the office has a duplexing feature that saves paper by printing on both sides.",
            "sent3": "The printer was so good at duplexing that it could probably print a book on a single sheet!",
            "sent4": "Her mind worked like a duplexing printer, processing information on both sides simultaneously.",
            "sent5": "The art of duplexing made the document look professional and eco-friendly."
        },
        {
            "definition": "The ability of a communication system to transmit and receive signals simultaneously.",
            "pos": "noun",
            "sent1": "The new phone model boasts advanced duplexing technology for crystal-clear calls.",
            "sent2": "Duplexing in telecommunications allows for seamless two-way communication.",
            "sent3": "The duplexing feature on the walkie-talkies made the kids feel like secret agents.",
            "sent4": "Their relationship was like a duplexing connection, always in sync and responsive.",
            "sent5": "The duplexing function ensured that both parties could talk and listen at the same time."
        },
        {
            "definition": "A building containing two separate living units.",
            "pos": "noun",
            "sent1": "The duplexing next door is painted in a lovely shade of blue.",
            "sent2": "Living in a duplexing property provides the convenience of close neighbors.",
            "sent3": "The duplexing residents often shared a backyard barbecue for fun.",
            "sent4": "Their friendship was like a duplexing house, connected yet with separate spaces.",
            "sent5": "The duplexing layout of the building allowed for privacy while still being close to family."
        }
    ]
}