{
    "term": "duro",
    "meanings": [
        {
            "definition": "Hard",
            "pos": "adjective",
            "sent1": "The rock was duro and couldn't be broken easily.",
            "sent2": "The table was made of a duro material that didn't scratch easily.",
            "sent3": "The teacher's duro stare made the students pay attention.",
            "sent4": "His duro determination to succeed led him to overcome all obstacles.",
            "sent5": "The duro ground felt like solid concrete beneath their feet."
        },
        {
            "definition": "Tough",
            "pos": "adjective",
            "sent1": "The leather jacket was duro and protected him from the cold wind.",
            "sent2": "The athlete showed his duro spirit by finishing the race despite the injury.",
            "sent3": "The old truck had a duro time starting in the cold weather.",
            "sent4": "She had a duro exterior but was kind-hearted on the inside.",
            "sent5": "The duro fabric of the bag could withstand heavy loads without tearing."
        },
        {
            "definition": "Harsh",
            "pos": "adjective",
            "sent1": "The judge's duro punishment left no room for leniency.",
            "sent2": "The winter in the northern regions can be very duro with heavy snowfall.",
            "sent3": "The duro sunlight made her squint as she walked outside.",
            "sent4": "His duro words hurt her feelings deeply.",
            "sent5": "The teacher's duro criticism motivated the students to improve their work."
        },
        {
            "definition": "Lasting a long time",
            "pos": "adjective",
            "sent1": "The duro friendship between them had lasted since childhood.",
            "sent2": "The duro impact of the war was felt for generations to come.",
            "sent3": "The duro rainstorm lasted for hours, flooding the streets.",
            "sent4": "The duro memories of that day stayed with her forever.",
            "sent5": "The duro tradition had been passed down through many generations."
        },
        {
            "definition": "A unit of currency in Portugal and Brazil",
            "pos": "noun",
            "sent1": "He exchanged his euros for duros before traveling to Portugal.",
            "sent2": "The market only accepted payment in duros for the goods.",
            "sent3": "She saved up enough duros to buy a new bicycle.",
            "sent4": "The value of the duro fluctuated in the international market.",
            "sent5": "The shopkeeper counted the duros carefully before giving change."
        }
    ]
}