{
    "term": "dush",
    "meanings": [
        {
            "definition": "To clean by scrubbing or wiping.",
            "pos": "verb",
            "sent1": "I dush the dishes after dinner every night.",
            "sent2": "She dushes the windows to make them sparkle.",
            "sent3": "The cat tried to dush its face with its paw, making a mess.",
            "sent4": "The waves dushed the shore, washing away footprints in the sand.",
            "sent5": "Mom taught me how to dush the floor properly."
        },
        {
            "definition": "A quick shower.",
            "pos": "noun",
            "sent1": "After the game, he took a refreshing dush to cool off.",
            "sent2": "She loves taking a dush in the morning to wake up.",
            "sent3": "The unexpected rain turned into a dush, catching everyone off guard.",
            "sent4": "The dush of petals from the tree was like a gentle rain of flowers.",
            "sent5": "I enjoy a warm dush after a long day at work."
        },
        {
            "definition": "A sudden rush or gush of water.",
            "pos": "noun",
            "sent1": "The dam broke, causing a powerful dush downstream.",
            "sent2": "The waterfall created a beautiful dush of water over the rocks.",
            "sent3": "The burst pipe led to a dush flooding the basement.",
            "sent4": "The dush from the fire hydrant sprayed high into the air.",
            "sent5": "The storm brought a dush of rain that flooded the streets."
        },
        {
            "definition": "A foolish or stupid person.",
            "pos": "noun",
            "sent1": "Don't listen to him; he's a real dush sometimes.",
            "sent2": "She felt like a dush after forgetting her keys for the third time.",
            "sent3": "The dush at the party kept telling bad jokes to everyone.",
            "sent4": "He acted like a complete dush during the meeting, embarrassing himself.",
            "sent5": "Being a dush won't get you far in life; you need to be smarter."
        }
    ]
}