{
    "term": "dwarfing",
    "meanings": [
        {
            "definition": "To cause to appear small or insignificant in comparison.",
            "pos": "verb",
            "sent1": "The tall tree next to the house was dwarfing the small bush.",
            "sent2": "The giant skyscraper was dwarfing the surrounding buildings.",
            "sent3": "The tiny toy car was dwarfing the massive toy truck.",
            "sent4": "The bright sun dwarfing the dim stars in the night sky.",
            "sent5": "The huge mountain dwarfing the tiny village below.",
            "sent6": "In the garden, the large sunflower was dwarfing the delicate daisies.",
            "sent7": "The massive ship was dwarfing the small boats in the harbor."
        },
        {
            "definition": "To make smaller or stunted in growth.",
            "pos": "verb",
            "sent1": "The lack of sunlight was dwarfing the plant's growth.",
            "sent2": "The harsh winter weather was dwarfing the trees in the forest.",
            "sent3": "The constant pruning was dwarfing the bushes in the garden.",
            "sent4": "The limited nutrients were dwarfing the flowers in the field.",
            "sent5": "The dry soil was dwarfing the crops in the farm.",
            "sent6": "The heavy snow was dwarfing the grass in the meadow.",
            "sent7": "The strong winds were dwarfing the plants in the backyard."
        },
        {
            "definition": "To overshadow or make seem less important.",
            "pos": "verb",
            "sent1": "The main actor's performance was dwarfing the supporting cast.",
            "sent2": "The grand finale was dwarfing the rest of the show.",
            "sent3": "The impressive fireworks display was dwarfing the other attractions.",
            "sent4": "The stunning artwork was dwarfing the other pieces in the gallery.",
            "sent5": "The powerful speech was dwarfing the previous presentations.",
            "sent6": "The loud music was dwarfing the background noise.",
            "sent7": "The bright spotlight was dwarfing the dim stage lighting."
        }
    ]
}