{
    "term": "dyne",
    "meanings": [
        {
            "definition": "The unit of force in the centimeter-gram-second system, equal to the force that produces an acceleration of one centimeter per second per second on a mass of one gram.",
            "pos": "noun",
            "sent1": "She measured the force in dyne using a special scale.",
            "sent2": "Scientists use dyne to calculate small forces accurately.",
            "sent3": "The tiny ant pushed with a dyne of strength to move the sugar cube.",
            "sent4": "His determination was a dyne that propelled him forward against all odds.",
            "sent5": "The dyne of his punch was so powerful, it knocked the wind out of his opponent."
        },
        {
            "definition": "A unit of force, especially in the centimeter-gram-second system, equal to the force that produces an acceleration of one centimeter per second per second on a mass of one gram.",
            "pos": "noun",
            "sent1": "The machine measured the force in dyne accurately.",
            "sent2": "In physics, dyne is a crucial unit for small force calculations.",
            "sent3": "The cat pounced on the toy with the force of a single dyne.",
            "sent4": "Her words carried a dyne of emotion that touched everyone in the room.",
            "sent5": "The dyne of his voice resonated through the auditorium, capturing everyone's attention."
        },
        {
            "definition": "A unit of force in the centimeter-gram-second system, equal to the force that produces an acceleration of one centimeter per second per second on a mass of one gram.",
            "pos": "noun",
            "sent1": "The textbook explained the concept of dyne clearly.",
            "sent2": "Dyne is commonly used in physics experiments for accurate measurements.",
            "sent3": "The squirrel gathered nuts with a dyne of determination.",
            "sent4": "Her smile had a dyne that brightened up the entire room.",
            "sent5": "The dyne of his presence was felt by everyone as soon as he entered the room."
        }
    ]
}