{
    "term": "dyspnoeas",
    "meanings": [
        {
            "definition": "Difficulty in breathing",
            "pos": "noun",
            "sent1": "After running, he experienced dyspnoeas and had to sit down to catch his breath.",
            "sent2": "The doctor diagnosed the patient with dyspnoeas due to a lung infection.",
            "sent3": "The puppy's attempt to blow bubbles in the water resulted in adorable dyspnoeas.",
            "sent4": "The mountain climber felt the altitude causing dyspnoeas as he reached the summit.",
            "sent5": "The intense workout left her gasping for air, experiencing dyspnoeas like never before."
        },
        {
            "definition": "Shortness of breath",
            "pos": "noun",
            "sent1": "She felt dyspnoeas after climbing just a few flights of stairs.",
            "sent2": "The elderly man's dyspnoeas prompted his family to take him to the hospital.",
            "sent3": "The comedian joked about his dyspnoeas during a stand-up routine, making the audience laugh.",
            "sent4": "The excitement of the race caused dyspnoeas in the young athletes as they sprinted towards the finish line.",
            "sent5": "The panic attack left her with sudden dyspnoeas, making it hard to calm down."
        },
        {
            "definition": "Labored or difficult breathing",
            "pos": "noun",
            "sent1": "The hiker's dyspnoeas were evident as he struggled to climb the steep trail.",
            "sent2": "The patient's dyspnoeas improved with the help of breathing exercises.",
            "sent3": "The cat's playful antics resulted in dyspnoeas as it chased a laser pointer around the room.",
            "sent4": "The singer's emotional performance was accompanied by dyspnoeas, adding intensity to the song.",
            "sent5": "The firefighter faced dyspnoeas while battling the smoke-filled building, but continued to rescue those inside."
        }
    ]
}