{
    "term": "earnest",
    "meanings": [
        {
            "definition": "Resulting from or showing sincere and intense conviction",
            "pos": "adjective",
            "sent1": "She spoke in an earnest tone, showing how much she truly believed in her cause.",
            "sent2": "He gave an earnest apology for his mistake, truly meaning every word he said.",
            "sent3": "The puppy's earnest attempt to catch its tail was both adorable and determined.",
            "sent4": "Her earnest dedication to her studies shone brightly, like a beacon of determination.",
            "sent5": "The firefighter's earnest bravery in the face of danger inspired everyone around him."
        },
        {
            "definition": "Serious in intention, purpose, or effort",
            "pos": "adjective",
            "sent1": "The team approached the game with an earnest desire to win, giving their all on the field.",
            "sent2": "She had an earnest expression on her face, showing how determined she was to succeed.",
            "sent3": "The child's earnest attempt to lift the heavy box was both cute and determined.",
            "sent4": "His earnest commitment to his fitness routine was like a rock-solid foundation for his health.",
            "sent5": "The student's earnest focus during the exam was evident in the way she carefully answered each question."
        },
        {
            "definition": "A sum of money paid in advance as a security deposit",
            "pos": "noun",
            "sent1": "He put down an earnest to secure the apartment, showing his commitment to renting it.",
            "sent2": "The landlord requested an earnest along with the rental application as a security measure.",
            "sent3": "The earnest was returned to the tenant upon the successful completion of the lease.",
            "sent4": "She handed over the earnest to the real estate agent as a sign of her serious interest in the property.",
            "sent5": "The earnest was a small price to pay for the peace of mind it provided in securing the rental."
        }
    ]
}