{
    "term": "earthing",
    "meanings": [
        {
            "definition": "The act of connecting a conductive object to the ground to prevent electric shock.",
            "pos": "noun",
            "sent1": "During the storm, the earthing of the house's electrical system kept everyone safe.",
            "sent2": "The proper earthing of the metal fence ensured no one would get hurt by touching it.",
            "sent3": "The earthing of the toaster prevented any shocking surprises during breakfast.",
            "sent4": "His understanding of earthing was like a protective shield against electrical dangers.",
            "sent5": "The importance of earthing became clear when the lightning struck nearby."
        },
        {
            "definition": "The process of covering a surface with soil or grass.",
            "pos": "noun",
            "sent1": "The earthing of the garden with fresh soil made the plants grow beautifully.",
            "sent2": "After the construction, the earthing of the yard with grass made it look more inviting.",
            "sent3": "The earthing of the playground with soft soil made it a fun place for kids to play.",
            "sent4": "The earthing of the field with green grass was a sight to behold.",
            "sent5": "The earthing of the park with lush vegetation attracted many visitors."
        },
        {
            "definition": "The act of establishing a connection with the earth's natural electric charge.",
            "pos": "noun",
            "sent1": "The scientist's experiment involved the earthing of the device to measure the earth's electric charge.",
            "sent2": "The earthing of the equipment allowed for a direct connection to the earth's electric energy.",
            "sent3": "The earthing of the device made it feel like it was plugged into nature itself.",
            "sent4": "Her meditation practice felt like earthing her mind to the earth's energy.",
            "sent5": "The earthing of the experiment brought surprising results about the earth's electric field."
        }
    ]
}