{
    "term": "earthier",
    "meanings": [
        {
            "definition": "Resembling or characteristic of earth in color, taste, or smell.",
            "pos": "adjective",
            "sent1": "The earthier tones of the painting gave it a natural and rustic feel.",
            "sent2": "Her earthier cooking style focused on using fresh herbs and simple ingredients.",
            "sent3": "He joked that his earthier socks were so dirty, they could plant a garden.",
            "sent4": "The earthier scent of the forest enveloped her like a cozy blanket.",
            "sent5": "The earthier hues of the landscape painting made it feel like stepping into nature."
        },
        {
            "definition": "Having a close connection to nature or the earth.",
            "pos": "adjective",
            "sent1": "The earthier lifestyle of the villagers involved farming and living off the land.",
            "sent2": "She felt earthier when walking barefoot on the grass, connecting with the earth.",
            "sent3": "The earthier bond between the siblings was evident in their shared love for hiking.",
            "sent4": "Her earthier spirit was reflected in her passion for gardening and outdoor activities.",
            "sent5": "The earthier traditions of the tribe emphasized harmony with the natural world."
        },
        {
            "definition": "Showing a lack of refinement or sophistication.",
            "pos": "adjective",
            "sent1": "His earthier manners sometimes surprised the elegant guests at the party.",
            "sent2": "The earthier decor of the cabin contrasted with the modern design of the city apartment.",
            "sent3": "She found his earthier jokes amusing, even if they were a bit crude.",
            "sent4": "The earthier language used by the comedian resonated with the down-to-earth audience.",
            "sent5": "The earthier style of the pottery workshop embraced imperfections and natural textures."
        }
    ]
}