{
    "term": "earthmovers",
    "meanings": [
        {
            "definition": "A person or thing that moves earth or excavates land.",
            "pos": "noun",
            "sent1": "The earthmovers in the construction crew used shovels to dig the foundation.",
            "sent2": "The earthmovers arrived early in the morning to start clearing the land for the new building.",
            "sent3": "The little boy pretended to be an earthmover, moving piles of sand in the sandbox.",
            "sent4": "Her determination was like that of an earthmover, tirelessly working to achieve her goals.",
            "sent5": "The earthmovers, with their powerful machines, transformed the landscape in just a few days."
        },
        {
            "definition": "A type of heavy machinery used for digging and moving large quantities of earth.",
            "pos": "noun",
            "sent1": "The construction site was filled with loud earthmovers digging up the ground.",
            "sent2": "The earthmovers were lined up, ready to start the excavation process.",
            "sent3": "The earthmovers seemed to dance as they moved back and forth, scooping up dirt.",
            "sent4": "The earthmovers roared to life, their metal arms reaching out to reshape the terrain.",
            "sent5": "The earthmovers rumbled through the field, leaving a trail of freshly turned soil behind them."
        },
        {
            "definition": "A group of workers or machines that clear land or construct roads.",
            "pos": "noun",
            "sent1": "The earthmovers worked tirelessly to clear the debris after the storm.",
            "sent2": "The road construction project employed a team of skilled earthmovers.",
            "sent3": "The earthmovers chugged along, paving the way for the new highway.",
            "sent4": "The earthmovers moved in unison, creating a path through the dense forest.",
            "sent5": "The earthmovers operated like a well-oiled machine, efficiently completing the task ahead of schedule."
        }
    ]
}