{
    "term": "earthbound",
    "meanings": [
        {
            "definition": "Restricted to or confined to the earth; not able to fly or move freely in the air.",
            "pos": "adjective",
            "sent1": "The bird was earthbound, unable to soar high in the sky like its friends.",
            "sent2": "The airplane was designed for earthbound travel, not for space exploration.",
            "sent3": "The superhero's powers were earthbound, limiting him to fighting crime on the ground.",
            "sent4": "Her dreams were earthbound, never reaching the heights of her aspirations.",
            "sent5": "The astronaut felt earthbound after returning from his mission to space."
        },
        {
            "definition": "Lacking in imagination or creativity; mundane or ordinary.",
            "pos": "adjective",
            "sent1": "His artwork was earthbound, lacking the vibrant colors and creativity of his peers.",
            "sent2": "The story was earthbound, following a predictable plot with no surprises.",
            "sent3": "The magician's tricks were earthbound, failing to impress the audience.",
            "sent4": "Her ideas were earthbound, never venturing into innovative or imaginative territory.",
            "sent5": "The music was earthbound, lacking the creativity that makes a song memorable."
        },
        {
            "definition": "Tied to or focused on practical matters; not concerned with spiritual or abstract ideas.",
            "pos": "adjective",
            "sent1": "His mind was earthbound, always focused on practical solutions rather than philosophical questions.",
            "sent2": "The company's approach was earthbound, prioritizing profit over ethical considerations.",
            "sent3": "Her advice was earthbound, always practical but lacking in deeper meaning.",
            "sent4": "Their discussions were earthbound, revolving around everyday concerns rather than existential questions.",
            "sent5": "The book was earthbound, offering practical tips for everyday life without delving into deeper spiritual matters."
        }
    ]
}