{
    "term": "easter",
    "meanings": [
        {
            "definition": "A Christian festival celebrating the resurrection of Jesus Christ.",
            "pos": "noun",
            "sent1": "During Easter, many people attend church services to celebrate Jesus' resurrection.",
            "sent2": "My family always has a big meal together on Easter Sunday.",
            "sent3": "On Easter, the bunny hopped into the church service, causing a giggle among the attendees.",
            "sent4": "The spirit of Easter filled the air, bringing hope and renewal to all.",
            "sent5": "The colorful Easter eggs symbolize new life and joy."
        },
        {
            "definition": "The period of time around this festival, typically including Good Friday and Easter Sunday.",
            "pos": "noun",
            "sent1": "We spend the whole Easter weekend with our relatives, enjoying each other's company.",
            "sent2": "Easter is a time for reflection and gratitude for many people.",
            "sent3": "During Easter, the kids played egg hunt games in the garden, laughing and having fun.",
            "sent4": "The atmosphere during Easter felt peaceful and serene, like a calm before a storm.",
            "sent5": "The anticipation of Easter builds up as the days draw closer to the festival."
        },
        {
            "definition": "A movable feast observed in the Western Christian Church on the first Sunday after the full moon that occurs on or after the vernal equinox.",
            "pos": "noun",
            "sent1": "The date of Easter changes each year based on the lunar calendar.",
            "sent2": "Easter is a significant event in the Christian calendar, marking the end of Lent.",
            "sent3": "The Easter feast was so delicious that even the church mice couldn't resist sneaking a bite.",
            "sent4": "The timing of Easter is like a dance between the moon and the sun, creating a celestial celebration.",
            "sent5": "The church bells rang joyfully, announcing the arrival of Easter Sunday."
        }
    ]
}