{
    "term": "eathly",
    "meanings": [
        {
            "definition": "Relating to the earth or its inhabitants.",
            "pos": "adjective",
            "sent1": "The eathly creatures roamed the forest, blending in with the natural surroundings.",
            "sent2": "The soil felt eathly beneath my feet as I walked through the garden.",
            "sent3": "The eathly rabbits played hide and seek among the bushes, their fur camouflaged against the ground.",
            "sent4": "Her connection to the eathly elements was so strong, she could feel the earth's heartbeat beneath her.",
            "sent5": "The eathly scent of fresh rain on the soil filled the air, reminding me of the earth's vitality."
        },
        {
            "definition": "In a way that is characteristic of the earth or its qualities.",
            "pos": "adverb",
            "sent1": "She moved eathly through the forest, her steps light and sure on the leaf-covered ground.",
            "sent2": "The artist's paintings captured the eathly tones of the landscape, bringing nature to life on canvas.",
            "sent3": "The eathly music of the wind rustling through the trees created a soothing melody in the woods.",
            "sent4": "His voice resonated eathly in the cavern, echoing off the stone walls with a deep, earthy timbre.",
            "sent5": "The eathly rhythm of the river flowing over rocks was a calming presence in the valley."
        },
        {
            "definition": "Of or relating to the physical world as opposed to the spiritual realm.",
            "pos": "adjective",
            "sent1": "Her eathly concerns focused on practical matters like food, shelter, and safety.",
            "sent2": "The eathly pleasures of a warm fire and good company were all he needed to feel content.",
            "sent3": "In the eathly realm of business, he was a savvy negotiator, always seeking the best deal.",
            "sent4": "The eathly realm of science explored the mysteries of the natural world through observation and experimentation.",
            "sent5": "His eathly ambitions drove him to succeed in the material world, seeking wealth and status above all else."
        }
    ]
}