{
    "term": "eclipsises",
    "meanings": [
        {
            "definition": "To obscure the light from or to (another celestial body)",
            "pos": "verb",
            "sent1": "During a solar eclipse, the moon eclipsises the sun, creating a shadow on Earth.",
            "sent2": "The clouds moving in front of the sun sometimes eclipsises its brightness.",
            "sent3": "The mischievous cloud decided to play hide-and-seek and eclipsised the sun at the worst possible moment.",
            "sent4": "Her radiant smile eclipsises any darkness in the room, bringing joy to everyone.",
            "sent5": "The giant mountain looming over the town eclipsises the tiny houses below, casting a long shadow."
        },
        {
            "definition": "To surpass or outshine",
            "pos": "verb",
            "sent1": "Her kindness always eclipsises her sister's grumpiness, making her the favorite among friends.",
            "sent2": "The new restaurant quickly eclipsises the old one in popularity due to its delicious food.",
            "sent3": "The little flower tried to grow taller to eclipse the big tree next to it, but it was just too small.",
            "sent4": "His talent for storytelling eclipsises all others, captivating audiences with every word.",
            "sent5": "The bright star in the sky seems to eclipse all the others, shining the brightest of them all."
        },
        {
            "definition": "A partial or complete obscuring of one celestial body by another",
            "pos": "noun",
            "sent1": "The lunar eclipse is a beautiful sight where the moon experiences an eclipsis by the Earth's shadow.",
            "sent2": "A solar eclipsis occurs when the moon passes between the sun and the Earth, casting a shadow on the planet.",
            "sent3": "During the eclipse party, everyone wore special glasses to watch the eclipsis of the sun by the moon.",
            "sent4": "The eclipsis of the moon by the Earth's shadow creates a stunning visual display in the night sky.",
            "sent5": "The astronomers gathered to observe the rare eclipsis of Jupiter by one of its moons, documenting the event for research."
        }
    ]
}