{
    "term": "eclipser",
    "meanings": [
        {
            "definition": "A person or thing that eclipses or surpasses others in importance or fame.",
            "pos": "noun",
            "sent1": "In the world of music, the singer was an eclipser, shining brighter than all others.",
            "sent2": "The movie star became an eclipser, outshining all her co-stars with her talent.",
            "sent3": "The eclipser of the school talent show was a surprise guest appearance by a famous actor.",
            "sent4": "Her kindness was an eclipser, casting a shadow over the selfishness of others.",
            "sent5": "The new invention was an eclipser, stealing the spotlight from all previous gadgets."
        },
        {
            "definition": "To obscure or block the light of something by coming between it and a source of light.",
            "pos": "verb",
            "sent1": "The tall building eclipsered the sun, casting a shadow over the park.",
            "sent2": "The tree eclipsered the streetlight, making the road dark and difficult to see.",
            "sent3": "The umbrella eclipsered the view, causing frustration for the spectators.",
            "sent4": "The mountain eclipsered the sunrise, delaying the start of the day.",
            "sent5": "The cloud eclipsered the moon, hiding its glow from the night sky."
        },
        {
            "definition": "To surpass or outshine someone or something.",
            "pos": "verb",
            "sent1": "Her intelligence eclipsered her classmates, making her the top student in the school.",
            "sent2": "The new model of the car eclipsered the previous version, attracting more buyers.",
            "sent3": "The bright smile eclipsered the gloomy mood in the room, bringing joy to everyone.",
            "sent4": "His performance eclipsered all others, earning him the lead role in the play.",
            "sent5": "The vibrant colors of the painting eclipsered the dullness of the room, adding life to the space."
        }
    ]
}