{
    "term": "eclipsis",
    "meanings": [
        {
            "definition": "The partial or complete obscuring of one celestial body by another.",
            "pos": "noun",
            "sent1": "During the eclipse, the moon's eclipsis by the Earth creates a stunning sight.",
            "sent2": "A solar eclipsis occurs when the moon passes between the sun and the Earth.",
            "sent3": "The eclipsis of the sun by the moon made stargazers cheer in amazement.",
            "sent4": "The eclipsis of the moon by the Earth is like a cosmic dance in the night sky.",
            "sent5": "Witnessing the eclipsis of the sun by the moon is a rare and awe-inspiring event."
        },
        {
            "definition": "The omission or suppression of a sound or syllable in speech.",
            "pos": "noun",
            "sent1": "In some languages, eclipsis of certain letters changes the pronunciation.",
            "sent2": "The singer's accent caused an eclipsis of the final syllable in the song.",
            "sent3": "The comedian's joke had an eclipsis that left the audience puzzled.",
            "sent4": "Her laughter caused an eclipsis of the punchline, making the joke even funnier.",
            "sent5": "The teacher's eclipsis of the word confused the students, leading to laughter in the class."
        },
        {
            "definition": "The gradual disappearance or fading away of a disease or symptom.",
            "pos": "noun",
            "sent1": "With proper treatment, the eclipsis of the illness was observed over time.",
            "sent2": "The doctor noted the eclipsis of the patient's fever as a positive sign.",
            "sent3": "The eclipsis of the virus brought relief to the entire community.",
            "sent4": "The eclipsis of the symptoms marked the beginning of the patient's recovery.",
            "sent5": "The gradual eclipsis of the disease gave hope to the patient and their family."
        }
    ]
}