{
    "term": "ecocatastrophes",
    "meanings": [
        {
            "definition": "A sudden and widespread disaster relating to the environment.",
            "pos": "noun",
            "sent1": "The ecocatastrophes caused by the oil spill devastated the local wildlife.",
            "sent2": "Scientists are studying the effects of ecocatastrophes on marine ecosystems.",
            "sent3": "The ecocatastrophes in the movie were so exaggerated, they made everyone laugh.",
            "sent4": "The looming threat of ecocatastrophes hangs over our planet like a dark cloud.",
            "sent5": "The vivid images of ecocatastrophes in documentaries leave a lasting impact on viewers."
        },
        {
            "definition": "The occurrence of a catastrophic event that impacts the ecosystem.",
            "pos": "noun",
            "sent1": "The ecocatastrophes like hurricanes can have long-lasting effects on nature.",
            "sent2": "Communities must come together to recover from ecocatastrophes like wildfires.",
            "sent3": "In the cartoon, the ecocatastrophes were portrayed in a funny and unrealistic way.",
            "sent4": "The ecocatastrophes of deforestation are slowly destroying our planet's lungs.",
            "sent5": "The news report highlighted the severity of recent ecocatastrophes around the world."
        },
        {
            "definition": "The result of a major environmental catastrophe.",
            "pos": "noun",
            "sent1": "The ecocatastrophes caused by pollution are a wake-up call for humanity.",
            "sent2": "Governments need to take action to prevent future ecocatastrophes.",
            "sent3": "The comedy show joked about the ecocatastrophes in a light-hearted manner.",
            "sent4": "The looming threat of ecocatastrophes hangs over our planet like a dark cloud.",
            "sent5": "The vivid images of ecocatastrophes in documentaries leave a lasting impact on viewers."
        }
    ]
}