{
    "term": "economy",
    "meanings": [
        {
            "definition": "The system of production, distribution, and consumption of goods and services.",
            "pos": "noun",
            "sent1": "In our town, the local economy relies heavily on farming and tourism.",
            "sent2": "The global economy can be affected by political decisions made by different countries.",
            "sent3": "I heard a joke that the economy went on strike, but it couldn't make ends meet.",
            "sent4": "Her mind was an economy of words, always choosing the most precise ones to convey her thoughts.",
            "sent5": "The economy of the small island nation was like a delicate ecosystem, easily disrupted by external factors."
        },
        {
            "definition": "The careful management of resources.",
            "pos": "noun",
            "sent1": "His economy of time allowed him to accomplish many tasks efficiently.",
            "sent2": "Conserving water is an important part of maintaining a sustainable economy.",
            "sent3": "She practiced an economy of movement, making sure every action had a purpose.",
            "sent4": "The artist's painting displayed an economy of color, using only a few shades to create a powerful impact.",
            "sent5": "The captain's economy of supplies ensured they could survive the long journey ahead."
        },
        {
            "definition": "The efficiency or frugality in the use of resources.",
            "pos": "noun",
            "sent1": "The company's economy in production processes led to increased profits.",
            "sent2": "Her grandmother's economy in the kitchen meant nothing went to waste.",
            "sent3": "He showed an economy of words in his speech, getting his point across clearly and concisely.",
            "sent4": "The athlete's economy of movement allowed her to glide effortlessly across the ice.",
            "sent5": "The writer's economy of description left room for the reader's imagination to fill in the details."
        }
    ]
}