{
    "term": "ecorche",
    "meanings": [
        {
            "definition": "A figure or model of a human body with the skin removed to show the musculature.",
            "pos": "noun",
            "sent1": "The anatomy class used an ecorche to study the muscles of the human body.",
            "sent2": "The artist created an ecorche to accurately depict the human musculature in the sculpture.",
            "sent3": "During the art exhibit, the ecorche suddenly started flexing its muscles, surprising everyone.",
            "sent4": "Her detailed ecorche sculpture revealed the inner strength and beauty beneath the skin.",
            "sent5": "The ecorche model made the intricate network of muscles easy to understand and remember."
        },
        {
            "definition": "A painting or sculpture of a human figure with the skin removed to show the muscles.",
            "pos": "noun",
            "sent1": "The museum displayed an impressive ecorche of a human body showcasing the muscles.",
            "sent2": "The art student meticulously crafted an ecorche to practice capturing muscle structure.",
            "sent3": "In the art class, the ecorche painting seemed to come to life, flexing its muscles on the canvas.",
            "sent4": "The ecorche sculpture stood out, revealing the intricate details of the human musculature.",
            "sent5": "The ecorche artwork made the complexity of human muscles visually striking and memorable."
        },
        {
            "definition": "A person who is flayed or skinned alive.",
            "pos": "noun",
            "sent1": "In the horror movie, the villain was portrayed as a cruel ecorche who skinned his victims alive.",
            "sent2": "The ancient legend spoke of an ecorche who haunted the village, seeking revenge on those who wronged him.",
            "sent3": "The Halloween costume of the ecorche scared everyone at the party, with its realistic skinless appearance.",
            "sent4": "The ecorche in the story symbolized the ultimate punishment, being stripped of one's skin and identity.",
            "sent5": "The concept of an ecorche served as a chilling reminder of the consequences of cruelty and inhumanity."
        }
    ]
}