{
    "term": "ecumenical",
    "meanings": [
        {
            "definition": "Promoting or relating to unity among different Christian churches or denominations.",
            "pos": "adjective",
            "sent1": "The ecumenical gathering brought together members of various Christian denominations.",
            "sent2": "The ecumenical council aimed to foster cooperation among different Christian churches.",
            "sent3": "At the ecumenical picnic, everyone shared food and stories from their churches.",
            "sent4": "Her ecumenical spirit was like a bridge connecting different Christian communities.",
            "sent5": "The ecumenical movement strives to create harmony among diverse Christian groups."
        },
        {
            "definition": "Representing a worldwide Christian church.",
            "pos": "adjective",
            "sent1": "The ecumenical leader spoke on behalf of the global Christian community.",
            "sent2": "The ecumenical symbol on the flag represented the unity of all Christians worldwide.",
            "sent3": "In the ecumenical art exhibition, artists showcased pieces inspired by Christianity around the world.",
            "sent4": "His ecumenical vision painted a picture of a united Christian church spanning continents.",
            "sent5": "The ecumenical anthem echoed across nations, symbolizing the bond among Christians worldwide."
        },
        {
            "definition": "Showing a willingness to work with people from different religious backgrounds.",
            "pos": "adjective",
            "sent1": "Her ecumenical approach to interfaith dialogue opened doors for collaboration with diverse religious groups.",
            "sent2": "The ecumenical project aimed to build bridges between individuals of varying religious beliefs.",
            "sent3": "The ecumenical bake sale brought together volunteers from different faith traditions to support a common cause.",
            "sent4": "His ecumenical mindset was a key factor in fostering understanding among people of different religions.",
            "sent5": "The ecumenical workshop provided a platform for individuals to learn from each other's diverse spiritual practices."
        }
    ]
}