{
    "term": "egoist",
    "meanings": [
        {
            "definition": "A person who is excessively self-centered and believes in their own importance.",
            "pos": "noun",
            "sent1": "The egoist only cared about themselves and never considered others.",
            "sent2": "She was known as an egoist because she always put her needs above everyone else's.",
            "sent3": "The egoist thought the world revolved around them, quite literally!",
            "sent4": "His egoist nature created a bubble around him, isolating him from genuine connections.",
            "sent5": "The egoist's self-importance was as vast as the ocean, drowning out any other voices."
        },
        {
            "definition": "Someone who is selfish and only thinks of their own interests.",
            "pos": "noun",
            "sent1": "Being an egoist, he never shared his toys with others.",
            "sent2": "The egoist refused to help anyone unless it benefited them directly.",
            "sent3": "The egoist's selfishness knew no bounds, even when it came to sharing snacks.",
            "sent4": "Her egoist tendencies made her a lone wolf in a world of teamwork.",
            "sent5": "The egoist's self-centeredness cast a shadow on any chance of collaboration."
        },
        {
            "definition": "The belief that self-interest is the motivating force of all conscious action.",
            "pos": "noun",
            "sent1": "The egoist's philosophy centered around the idea that self-interest drives all decisions.",
            "sent2": "In his egoist mindset, he believed that everyone acted out of personal gain.",
            "sent3": "The egoist's theory that self-interest rules all seemed both intriguing and flawed.",
            "sent4": "Her egoist belief painted a picture of a world driven by individual desires.",
            "sent5": "The egoist's conviction in self-interest as the core of human behavior was unwavering."
        }
    ]
}