{
    "term": "egomaniacal",
    "meanings": [
        {
            "definition": "Excessively self-centered or self-absorbed",
            "pos": "adjective",
            "sent1": "Her egomaniacal behavior made it difficult for others to get a word in during the conversation.",
            "sent2": "He was so egomaniacal that he only cared about his own achievements and never acknowledged others.",
            "sent3": "The egomaniacal cat insisted on sitting in the middle of the table, claiming it as her throne.",
            "sent4": "His egomaniacal attitude towered over the room like a dark cloud, casting a shadow on everyone's mood.",
            "sent5": "The egomaniacal boss demanded constant praise and attention, making the workplace a challenging environment."
        },
        {
            "definition": "Characterized by an excessive preoccupation with oneself",
            "pos": "adjective",
            "sent1": "The egomaniacal student only talked about themselves and never showed interest in others.",
            "sent2": "She had an egomaniacal obsession with her appearance, spending hours in front of the mirror.",
            "sent3": "In a comical twist, the egomaniacal squirrel believed all the acorns in the park belonged to him.",
            "sent4": "Her egomaniacal focus on her social media presence turned her into a virtual celebrity in her own mind.",
            "sent5": "The egomaniacal actor refused to share the spotlight, always wanting to be the center of attention."
        },
        {
            "definition": "Having an inflated sense of self-importance",
            "pos": "adjective",
            "sent1": "His egomaniacal belief that he was always right led to many arguments with his friends.",
            "sent2": "The egomaniacal politician thought the entire success of the campaign was solely due to his efforts.",
            "sent3": "The egomaniacal sun thought the planets revolved around it, not realizing its place in the solar system.",
            "sent4": "Her egomaniacal view of herself as a queen made her treat everyone around her as mere subjects.",
            "sent5": "The egomaniacal artist considered their work to be above critique, dismissing any feedback as irrelevant."
        }
    ]
}