{
    "term": "egotistic",
    "meanings": [
        {
            "definition": "Pertaining to or characterized by egotism.",
            "pos": "adjective",
            "sent1": "His egotistic behavior made it difficult for others to work with him.",
            "sent2": "She always talks about herself, showing her egotistic nature.",
            "sent3": "In a funny twist, his egotistic tendencies led him to believe he was the best at everything.",
            "sent4": "Her egotistic attitude towered over the room, making everyone uncomfortable.",
            "sent5": "The egotistic cat believed the whole world revolved around her, demanding attention at all times."
        },
        {
            "definition": "Having an exaggerated sense of self-importance.",
            "pos": "adjective",
            "sent1": "The egotistic actor refused to rehearse with the rest of the cast.",
            "sent2": "He always brags about his achievements, displaying his egotistic personality.",
            "sent3": "Despite his lack of talent, he had an egotistic belief in his own greatness.",
            "sent4": "Her egotistic ego was as large as a hot air balloon, floating above everyone else.",
            "sent5": "The egotistic king demanded constant praise and admiration from his subjects."
        },
        {
            "definition": "Self-centered or selfish in behavior.",
            "pos": "adjective",
            "sent1": "Her egotistic actions showed she only cared about herself.",
            "sent2": "He never considers others' feelings, always acting in an egotistic manner.",
            "sent3": "In a surprising turn of events, his egotistic behavior backfired, leaving him alone.",
            "sent4": "The egotistic child refused to share his toys with anyone, claiming everything as his own.",
            "sent5": "The egotistic boss only thought about his own success, disregarding the hard work of his employees."
        }
    ]
}