{
    "term": "eidetic",
    "meanings": [
        {
            "definition": "Of or relating to extraordinarily detailed and vivid recall of visual images.",
            "pos": "adjective",
            "sent1": "Her eidetic memory allowed her to remember every detail of the painting.",
            "sent2": "The artist had an eidetic memory, easily recalling the colors and shapes of his childhood home.",
            "sent3": "The eidetic details of the movie scene made her burst into laughter.",
            "sent4": "His eidetic memory was like a high-definition camera capturing every moment.",
            "sent5": "The eidetic description of the sunset painted a clear picture in her mind."
        },
        {
            "definition": "A person with the ability to recall visual images with exceptional clarity.",
            "pos": "noun",
            "sent1": "The eidetic could remember the smallest details of the landscape.",
            "sent2": "She was known as the eidetic in the family for her remarkable memory.",
            "sent3": "The eidetic at the party amazed everyone with his accurate recollection of events.",
            "sent4": "Being an eidetic was like having a built-in camera in his mind.",
            "sent5": "The eidetic's memory was like a photo album filled with vibrant pictures."
        },
        {
            "definition": "A mental image or memory that is exceptionally vivid and detailed.",
            "pos": "noun",
            "sent1": "The eidetic of the crime scene helped the detective solve the case.",
            "sent2": "His mind held an eidetic of the mountain view he saw on his vacation.",
            "sent3": "The eidetic of the funny cat video made her smile every time she thought about it.",
            "sent4": "The eidetic of her childhood home was like a treasure chest of memories.",
            "sent5": "The eidetic of the starry night sky stayed with her long after the camping trip."
        }
    ]
}