{
    "term": "eight",
    "meanings": [
        {
            "definition": "The number 8.",
            "pos": "noun",
            "sent1": "I have eight fingers and two thumbs.",
            "sent2": "The octopus has eight tentacles.",
            "sent3": "I asked for eight cookies, but the baker gave me eighty by mistake!",
            "sent4": "Her dress was covered in eight different shades of blue.",
            "sent5": "The clock struck eight times, signaling the end of the day."
        },
        {
            "definition": "A group or set of eight.",
            "pos": "noun",
            "sent1": "There were eight students in the group project.",
            "sent2": "The octet performed a beautiful harmony.",
            "sent3": "The eight puppies ran around the yard in circles.",
            "sent4": "The eight keys on the piano created a melodious tune.",
            "sent5": "The eight crayons in the box were all different colors."
        },
        {
            "definition": "An eight-sided figure.",
            "pos": "noun",
            "sent1": "The stop sign is shaped like an octagon with eight sides.",
            "sent2": "The spider's web formed an intricate octagon with eight equal sides.",
            "sent3": "The cake was decorated with an octagon made of eight candles.",
            "sent4": "The garden had a fountain in the center shaped like an octagon with eight edges.",
            "sent5": "The building had a unique design with an octagon window made of eight glass panels."
        },
        {
            "definition": "To divide into eight equal parts.",
            "pos": "verb",
            "sent1": "She decided to eight the pizza so everyone could have a fair share.",
            "sent2": "The chef will eight the cake to serve it to all the guests.",
            "sent3": "He tried to eight the sandwich, but it ended up in unequal portions.",
            "sent4": "The farmer needed to eight the field for planting different crops.",
            "sent5": "The teacher asked the students to eight the paper into equal sections for drawing."
        }
    ]
}