{
    "term": "eightballs",
    "meanings": [
        {
            "definition": "A small, round object used in the game of pool.",
            "pos": "noun",
            "sent1": "During the game, he aimed carefully and sunk the eightballs into the corner pocket.",
            "sent2": "The pool player lined up the cue ball to hit the eightballs and win the game.",
            "sent3": "Trying to play pool blindfolded, he mistook the eightballs for marbles.",
            "sent4": "The eightballs on the table resembled planets orbiting the sun-like cue ball.",
            "sent5": "The shiny eightballs clicked together as they were racked up for the next game."
        },
        {
            "definition": "A quantity of illegal drugs, typically cocaine or heroin, weighing one-eighth of an ounce.",
            "pos": "noun",
            "sent1": "The police confiscated a bag of eightballs during the drug bust.",
            "sent2": "Dealers often sell eightballs to users looking for a quick high.",
            "sent3": "In the movie, the detective went undercover to bust a ring of eightballs dealers.",
            "sent4": "The eightballs in the evidence room represented countless ruined lives.",
            "sent5": "She refused to touch the eightballs, knowing the danger they posed."
        },
        {
            "definition": "A situation in which a person is in a difficult or challenging position.",
            "pos": "noun",
            "sent1": "After missing the deadline, he found himself in a real eightballs at work.",
            "sent2": "She felt like she was in eightballs when her car broke down in the middle of nowhere.",
            "sent3": "Trying to juggle work, school, and family put him in a real eightballs.",
            "sent4": "The unexpected storm left them in eightballs without shelter.",
            "sent5": "Being lost in the maze of unfamiliar streets was like being in eightballs for her."
        }
    ]
}