{
    "term": "ejaculating",
    "meanings": [
        {
            "definition": "To eject or discharge suddenly and forcefully.",
            "pos": "verb",
            "sent1": "He was so excited that he couldn't help ejaculating his joy through a loud shout.",
            "sent2": "The volcano erupted, ejaculating hot lava into the air.",
            "sent3": "The pressure in the soda bottle built up so much that it started ejaculating soda everywhere.",
            "sent4": "The burst pipe was ejaculating water with great force, flooding the basement.",
            "sent5": "The burst of confetti from the cannon was like ejaculating a rainbow into the sky."
        },
        {
            "definition": "To utter suddenly and briefly.",
            "pos": "verb",
            "sent1": "Startled by the noise, she ended up ejaculating a scream before realizing it was just a car backfiring.",
            "sent2": "During the meeting, he kept ejaculating short comments that added to the discussion.",
            "sent3": "The comedian had a habit of ejaculating one-liners that always made the audience laugh.",
            "sent4": "In the heat of the argument, she couldn't help ejaculating a sharp retort.",
            "sent5": "The teacher would often ejaculate important reminders to the students during class."
        },
        {
            "definition": "To expel semen from the body.",
            "pos": "verb",
            "sent1": "The male seahorse is unique as it is the one ejaculating the eggs into the female's pouch.",
            "sent2": "The doctor explained the process of ejaculating sperm during the reproductive cycle.",
            "sent3": "The biology class discussed the various methods of ejaculating semen for fertilization.",
            "sent4": "The researcher studied the effects of different foods on ejaculating sperm count.",
            "sent5": "The fertility clinic provided guidance on techniques for ejaculating semen samples for analysis."
        }
    ]
}