{
    "term": "ejection",
    "meanings": [
        {
            "definition": "The act of forcing someone to leave a place.",
            "pos": "noun",
            "sent1": "The teacher's ejection of the disruptive student from the classroom was necessary for the other students to learn.",
            "sent2": "The bouncer's ejection of the troublemaker from the club prevented a fight.",
            "sent3": "The ejection of the noisy raccoon from the attic turned into a comical chase around the house.",
            "sent4": "His ejection from the team felt like being pushed out of a moving car, sudden and unexpected.",
            "sent5": "The ejection of the faulty cartridge from the printer was accompanied by a loud clunk."
        },
        {
            "definition": "The act of throwing something out forcefully.",
            "pos": "noun",
            "sent1": "The ejection of the ball from the pitcher's hand was swift and accurate.",
            "sent2": "The ejection of the trash into the dumpster was met with a satisfying thud.",
            "sent3": "The ejection of the old furniture from the house made room for the new couch.",
            "sent4": "The ejection of the pilot from the plane was a last resort in case of emergency.",
            "sent5": "The ejection of the basketball from the hoop signaled a successful shot."
        },
        {
            "definition": "The process of being removed from a position or role.",
            "pos": "noun",
            "sent1": "Her ejection from the board of directors was a shock to everyone.",
            "sent2": "The ejection of the CEO led to a restructuring of the company.",
            "sent3": "The ejection of the actor from the movie set caused delays in filming.",
            "sent4": "His ejection from the captaincy left a void in the team's leadership.",
            "sent5": "The ejection of the mayor from office was met with mixed reactions from the public."
        }
    ]
}