{
    "term": "el",
    "meanings": [
        {
            "definition": "Elevated",
            "pos": "adjective",
            "sent1": "The bird built its nest on an el branch.",
            "sent2": "The el mountain provided a stunning view of the valley.",
            "sent3": "The el cake towered over the other desserts.",
            "sent4": "Her spirits were el after receiving the good news.",
            "sent5": "The el tower cast a long shadow in the setting sun."
        },
        {
            "definition": "Elevated railway",
            "pos": "noun",
            "sent1": "The el carried passengers swiftly through the city.",
            "sent2": "The el rumbled overhead, transporting commuters.",
            "sent3": "The el tracks snaked through the urban landscape.",
            "sent4": "The sound of the el echoed in the quiet night.",
            "sent5": "The el provided a bird's eye view of the city below."
        },
        {
            "definition": "Elevated train",
            "pos": "noun",
            "sent1": "The el sped past the bustling streets below.",
            "sent2": "The el conductor announced the next stop.",
            "sent3": "The el passengers enjoyed the scenic ride.",
            "sent4": "The rhythmic clatter of the el was soothing.",
            "sent5": "The el journeyed above the traffic congestion."
        },
        {
            "definition": "Elevated road",
            "pos": "noun",
            "sent1": "The el curved gracefully over the river.",
            "sent2": "The el provided a shortcut through the hills.",
            "sent3": "The el bridge spanned the wide gorge.",
            "sent4": "The el offered a smooth ride for drivers.",
            "sent5": "The el wound its way through the lush forest."
        },
        {
            "definition": "Elevated platform",
            "pos": "noun",
            "sent1": "The el was crowded with waiting passengers.",
            "sent2": "The el platform offered a clear view of the tracks.",
            "sent3": "The el platform was a hive of activity.",
            "sent4": "The train arrived at the el platform with a hiss of brakes.",
            "sent5": "The el platform was bathed in the glow of the evening sun."
        }
    ]
}