{
    "term": "elastic",
    "meanings": [
        {
            "definition": "Able to return to its original shape or size after being stretched or compressed.",
            "pos": "adjective",
            "sent1": "The rubber band was very elastic, stretching easily and then bouncing back to its original form.",
            "sent2": "The elastic waistband on my pants allowed for a comfortable fit and then snapped back into place.",
            "sent3": "The elastic slingshot flung the pebble with great force, surprising everyone around.",
            "sent4": "Her elastic mind could quickly adapt to new ideas, always bouncing back from challenges.",
            "sent5": "The elastic trampoline surface provided a fun and bouncy experience for the children."
        },
        {
            "definition": "A material or fabric that stretches easily and then returns to its original shape.",
            "pos": "noun",
            "sent1": "She sewed an elastic into the waistband of the skirt to allow for movement and flexibility.",
            "sent2": "The swimwear was made of a special elastic that ensured a snug fit while swimming.",
            "sent3": "The magician pulled an endless string of colorful handkerchiefs from his elastic sleeve.",
            "sent4": "The elastic of time seemed to stretch and contract as they waited for the train.",
            "sent5": "The elastic in the socks kept them from slipping down during the long hike."
        },
        {
            "definition": "A band of rubber or similar material used to hold things together or to keep something in place.",
            "pos": "noun",
            "sent1": "She tied the package with an elastic to keep the papers secure during transit.",
            "sent2": "The elastic around the broccoli bunch kept the vegetables fresh in the refrigerator.",
            "sent3": "The elastic on his wrist snapped playfully as he flicked it at his friend.",
            "sent4": "The elastic of friendship held them together through thick and thin.",
            "sent5": "The elastic on the mask looped comfortably around his ears, ensuring a snug fit."
        }
    ]
}