{
    "term": "elasticity",
    "meanings": [
        {
            "definition": "The ability of an object or material to resume its original shape after being stretched or compressed.",
            "pos": "noun",
            "sent1": "The rubber band's elasticity allowed it to stretch and then return to its original size.",
            "sent2": "The fabric's elasticity made it easy to pull on and take off without losing its shape.",
            "sent3": "The balloon's elasticity was put to the test when it was blown up to its limit.",
            "sent4": "The trampoline's elasticity was like a spring, bouncing anyone who jumped on it.",
            "sent5": "The slingshot's elasticity was so strong that it launched the stone far into the distance."
        },
        {
            "definition": "The quality of being flexible and adaptable.",
            "pos": "noun",
            "sent1": "Her mind's elasticity allowed her to quickly adjust to new situations.",
            "sent2": "The team's success was due to their collective elasticity in handling unexpected challenges.",
            "sent3": "The comedian's jokes showed the elasticity of his humor, appealing to all audiences.",
            "sent4": "The dancer's movements had an elasticity that mesmerized the audience.",
            "sent5": "The company's growth was a result of its financial elasticity in changing markets."
        },
        {
            "definition": "The property of a substance that allows it to return to its original size and shape after being deformed.",
            "pos": "noun",
            "sent1": "The sponge's elasticity made it easy to squeeze and then watch it expand back.",
            "sent2": "The memory foam's elasticity ensured a comfortable sleep by adjusting to the body's shape.",
            "sent3": "The clay's elasticity surprised the sculptor as it bounced back to its original form.",
            "sent4": "The rubber ball's elasticity was so strong that it bounced higher than expected.",
            "sent5": "The spring's elasticity was crucial in absorbing shocks and returning to its original position."
        }
    ]
}