{
    "term": "elective",
    "meanings": [
        {
            "definition": "Chosen by election; appointed or selected by vote.",
            "pos": "adjective",
            "sent1": "The student council held an elective meeting to decide on the new class president.",
            "sent2": "The elective committee was responsible for choosing the best candidate for the position.",
            "sent3": "It was an elective process to determine the winner of the school talent show.",
            "sent4": "The elective nature of the decision-making made everyone feel included.",
            "sent5": "The elective system ensured fairness in the selection of the team captain."
        },
        {
            "definition": "Pertaining to the power of choosing; selecting.",
            "pos": "adjective",
            "sent1": "Her elective ability to make decisions quickly impressed her colleagues.",
            "sent2": "The manager's elective skills in problem-solving were highly valued in the company.",
            "sent3": "His elective knack for picking the right investments saved the company from losses.",
            "sent4": "The team leader's elective approach to delegating tasks improved efficiency.",
            "sent5": "The professor's elective guidance helped the students excel in their projects."
        },
        {
            "definition": "An optional course or subject in a school or college curriculum.",
            "pos": "noun",
            "sent1": "I decided to take an elective in art history to broaden my knowledge.",
            "sent2": "The school offers a variety of electives such as music, drama, and computer science.",
            "sent3": "Choosing an elective in astronomy opened up a whole new world of learning for me.",
            "sent4": "The elective on environmental studies sparked my interest in conservation efforts.",
            "sent5": "The elective course on photography allowed me to explore my creative side."
        }
    ]
}