{
    "term": "electricity",
    "meanings": [
        {
            "definition": "A form of energy resulting from the existence of charged particles (such as electrons or protons), either statically as an accumulation of charge or dynamically as a current.",
            "pos": "noun",
            "sent1": "Electricity powers our lights and appliances.",
            "sent2": "The electricity in the wires allows us to use our devices.",
            "sent3": "When the electricity went out, we had to tell stories by candlelight.",
            "sent4": "Her smile lit up the room like electricity.",
            "sent5": "The crackling electricity in the air before a storm is electrifying.",
            "sent6": "After the storm, the electricity came back on, and we cheered.",
            "sent7": "The electricity bill was higher than expected this month.",
            "sent8": "The electricity surged through the circuit, powering the machine.",
            "sent9": "The electricity outage caused a lot of inconvenience for the neighborhood.",
            "sent10": "The electricity hummed softly in the background as we worked."
        },
        {
            "definition": "A physical phenomenon associated with stationary or moving electrons and protons.",
            "pos": "noun",
            "sent1": "The scientist studied the behavior of electricity in the experiment.",
            "sent2": "Electricity can be harnessed to perform various tasks.",
            "sent3": "The electricity seemed to dance along the wires, almost alive.",
            "sent4": "The excitement in the room was like a surge of electricity.",
            "sent5": "The electricity in the atmosphere created a beautiful light show in the sky.",
            "sent6": "As the storm approached, the electricity in the air became palpable.",
            "sent7": "The electricity in the battery slowly drained away.",
            "sent8": "The electricity in the circuit was carefully controlled by the engineer.",
            "sent9": "The sudden burst of electricity caused the lights to flicker.",
            "sent10": "The electricity flowed smoothly through the conductive material."
        }
    ]
}