{
    "term": "electrotonus",
    "meanings": [
        {
            "definition": "The state of a nerve or muscle in response to an electric current.",
            "pos": "noun",
            "sent1": "The electrotonus of the nerve changed when the electric current passed through.",
            "sent2": "Doctors study the electrotonus of muscles to understand their response to electricity.",
            "sent3": "The nerve's electrotonus was like a dance party with the electric current as the DJ.",
            "sent4": "Her muscles' electrotonus was a symphony of responses to the electric current.",
            "sent5": "The vivid image of electrotonus made it easier to grasp the concept."
        },
        {
            "definition": "The process of electrical conduction in nerve fibers.",
            "pos": "noun",
            "sent1": "Understanding electrotonus helps in studying how nerve fibers conduct electricity.",
            "sent2": "The electrotonus of nerve fibers is crucial for proper communication in the body.",
            "sent3": "The nerve fibers' electrotonus was like a relay race passing on the electric signal.",
            "sent4": "The electrotonus of nerve fibers resembled a busy highway with electrical signals as cars.",
            "sent5": "Visualizing the electrotonus of nerve fibers made it easier to remember."
        },
        {
            "definition": "The alteration in excitability of a nerve or muscle due to an electric current.",
            "pos": "noun",
            "sent1": "The electrotonus caused a change in the nerve's excitability when the current flowed.",
            "sent2": "Doctors observed the electrotonus to see how the nerve's excitability was affected.",
            "sent3": "The nerve's excitability went on a rollercoaster ride with the electrotonus.",
            "sent4": "Her muscle's excitability was a rollercoaster of responses to the electrotonus.",
            "sent5": "The vivid description of electrotonus made the concept more memorable."
        }
    ]
}