{
    "term": "electroencephalographs",
    "meanings": [
        {
            "definition": "A device used to record electrical activity in the brain.",
            "pos": "noun",
            "sent1": "The hospital used electroencephalographs to monitor the patient's brain waves.",
            "sent2": "Doctors rely on electroencephalographs to detect any abnormal brain activity.",
            "sent3": "The scientist accidentally spilled coffee on the electroencephalographs, causing a temporary malfunction.",
            "sent4": "Her mind was an intricate web of thoughts, each strand captured by the electroencephalographs.",
            "sent5": "The eerie hum of the electroencephalographs filled the room, capturing every brain signal."
        },
        {
            "definition": "The process of using a machine to measure brain waves.",
            "pos": "noun",
            "sent1": "The technician carefully adjusted the electroencephalographs to begin the brain wave measurement.",
            "sent2": "During the experiment, the researchers observed the changes in brain activity through the electroencephalographs.",
            "sent3": "The mischievous cat knocked over the electroencephalographs, causing a brief disruption in the brain wave readings.",
            "sent4": "Her thoughts danced like colorful ribbons, each one traced by the electroencephalographs.",
            "sent5": "The electroencephalographs painted a vivid picture of the brain's electrical patterns."
        },
        {
            "definition": "The study of brain activity through the use of specialized equipment.",
            "pos": "noun",
            "sent1": "Neuroscientists rely on electroencephalographs to delve into the mysteries of brain activity.",
            "sent2": "The university offers courses in electroencephalographs to train future researchers.",
            "sent3": "The comedian joked that his brain activity would confuse even the most advanced electroencephalographs.",
            "sent4": "Her thoughts were a symphony of chaos, deciphered only by the skilled use of electroencephalographs.",
            "sent5": "The electroencephalographs revealed the intricate dance of neurons in her brain."
        }
    ]
}