{
    "term": "electrotonuses",
    "meanings": [
        {
            "definition": "The process of transmitting electrical signals along nerve fibers.",
            "pos": "noun",
            "sent1": "During the experiment, the scientist observed the electrotonuses in the nerve fibers.",
            "sent2": "The electrotonuses in the nerve fibers allow for communication between different parts of the body.",
            "sent3": "The electrotonuses in the nerve fibers were so efficient that the message reached the brain in a blink.",
            "sent4": "Her thoughts traveled along the electrotonuses of her nerves like lightning bolts.",
            "sent5": "The electrotonuses in the nerve fibers were like tiny messengers carrying important information."
        },
        {
            "definition": "The ability of a nerve fiber to conduct electrical impulses.",
            "pos": "noun",
            "sent1": "The doctor explained how the damaged nerve lost its electrotonuses, affecting sensation.",
            "sent2": "Without proper electrotonuses, the nerve fiber cannot transmit signals effectively.",
            "sent3": "The nerve's electrotonuses seemed to take a break, causing a temporary loss of feeling.",
            "sent4": "His nerves regained their electrotonuses slowly after the injury healed.",
            "sent5": "The electrotonuses of the nerve fiber were like tiny wires carrying messages to the brain."
        },
        {
            "definition": "The state of being able to transmit electrical signals.",
            "pos": "noun",
            "sent1": "The patient's condition improved as the electrotonuses in the nerves became stronger.",
            "sent2": "The electrotonuses of the nerve allowed for quick communication between the brain and muscles.",
            "sent3": "The nerve's electrotonuses were so reliable that they never failed to deliver the message.",
            "sent4": "Her body's electrotonuses were like a well-organized network, ensuring smooth signal transmission.",
            "sent5": "The electrotonuses in the nerve fibers were like a symphony of electricity, playing harmoniously."
        }
    ]
}