{
    "term": "electrocutes",
    "meanings": [
        {
            "definition": "To kill by electric shock.",
            "pos": "verb",
            "sent1": "Be careful not to touch the exposed wires, or you might electrocute yourself.",
            "sent2": "The electrician warned that the faulty wiring could electrocute anyone who touched it.",
            "sent3": "The mischievous cat thought it could electrocute the fish by dropping the toaster in the fishbowl.",
            "sent4": "The sudden surge of power seemed to electrocute the entire system, causing a blackout.",
            "sent5": "The scientist demonstrated how electricity can electrocute a pickle to show its power."
        },
        {
            "definition": "To execute by electricity.",
            "pos": "verb",
            "sent1": "In some places, they still electrocute criminals as a form of punishment.",
            "sent2": "The judge sentenced the convict to be electrocuted for his crimes.",
            "sent3": "The robot malfunctioned and started to electrocute all the appliances in the house.",
            "sent4": "The lightning seemed to electrocute the sky, lighting it up with a bright flash.",
            "sent5": "The mad scientist's invention could electrocute anything it touched with a single zap."
        },
        {
            "definition": "To injure or kill someone by electric shock.",
            "pos": "verb",
            "sent1": "The faulty wiring in the old house could electrocute anyone who tried to fix it.",
            "sent2": "The warning sign reminded people not to touch the fence, as it could electrocute them.",
            "sent3": "The clumsy robot kept accidentally electrocuting itself every time it tried to plug in.",
            "sent4": "The power surge threatened to electrocute anyone who came near the exposed socket.",
            "sent5": "The superhero's nemesis had a weapon that could electrocute with just a touch."
        }
    ]
}