{
    "term": "electrolysis",
    "meanings": [
        {
            "definition": "The process of using an electric current to drive a non-spontaneous chemical reaction.",
            "pos": "noun",
            "sent1": "During electrolysis, the electric current helps in chemical reactions.",
            "sent2": "Scientists use electrolysis in laboratories to study chemical changes.",
            "sent3": "The classroom erupted in laughter when the teacher joked about electrolysis making chemicals dance.",
            "sent4": "Her determination was like electrolysis, slowly breaking down the barriers in her way.",
            "sent5": "The electrolysis experiment made the colors of the chemicals vividly change before our eyes."
        },
        {
            "definition": "The decomposition of a substance by an electric current.",
            "pos": "noun",
            "sent1": "The electrolysis of water breaks it down into hydrogen and oxygen.",
            "sent2": "In chemistry class, we witnessed the electrolysis of salt into its components.",
            "sent3": "The magician's trick involved electrolysis turning a solid object into a liquid.",
            "sent4": "The electrolysis of the metal revealed its hidden properties.",
            "sent5": "The electrolysis process transformed the substance into its basic elements."
        },
        {
            "definition": "The removal of hair or other unwanted growth from the body using an electric current.",
            "pos": "noun",
            "sent1": "She underwent electrolysis to get rid of unwanted hair on her legs.",
            "sent2": "Many people opt for electrolysis to achieve smooth skin.",
            "sent3": "The comedy skit humorously portrayed electrolysis as a superhero fighting unwanted hair.",
            "sent4": "Her confidence soared after electrolysis helped her feel more comfortable in her skin.",
            "sent5": "The salon offered electrolysis services for those looking for a permanent hair removal solution."
        }
    ]
}