{
    "term": "electrophoresis",
    "meanings": [
        {
            "definition": "The movement of charged particles in a fluid or gel under the influence of an electric field.",
            "pos": "noun",
            "sent1": "During electrophoresis, the charged particles move in the gel.",
            "sent2": "Scientists use electrophoresis to study how particles move in an electric field.",
            "sent3": "The dance party was like electrophoresis, with people moving in response to the music.",
            "sent4": "Her emotions seemed to undergo electrophoresis, shifting and separating under stress.",
            "sent5": "The classroom demonstration made electrophoresis look like a colorful, dynamic dance."
        },
        {
            "definition": "A technique used in laboratories to separate molecules based on their size and charge.",
            "pos": "noun",
            "sent1": "In the lab, electrophoresis helps scientists separate molecules effectively.",
            "sent2": "Researchers rely on electrophoresis to analyze different molecules in experiments.",
            "sent3": "The chef's cooking method was like electrophoresis, separating ingredients for a perfect dish.",
            "sent4": "The team's strategy was an electrophoresis of ideas, sorting through options to find the best one.",
            "sent5": "The artist used colors in an electrophoresis-like manner, layering them to create a beautiful painting."
        },
        {
            "definition": "The process of separating proteins or nucleic acids based on their electrical charge and size.",
            "pos": "noun",
            "sent1": "Electrophoresis is crucial for separating proteins in biological research.",
            "sent2": "Biologists use electrophoresis to understand how proteins differ in size and charge.",
            "sent3": "The family reunion felt like electrophoresis, with relatives separating into different groups.",
            "sent4": "The city's growth resembled electrophoresis, with neighborhoods developing based on different factors.",
            "sent5": "The puzzle pieces fit together like proteins in electrophoresis, forming a clear picture."
        }
    ]
}