{
    "term": "electrophoretic",
    "meanings": [
        {
            "definition": "Relating to or involving electrophoresis.",
            "pos": "adjective",
            "sent1": "The scientist conducted an electrophoretic experiment to separate the molecules.",
            "sent2": "The electrophoretic process helped identify the different components of the mixture.",
            "sent3": "The electrophoretic gel danced as the molecules moved through it.",
            "sent4": "Her thoughts raced like an electrophoretic process, sorting through ideas quickly.",
            "sent5": "The electrophoretic technique painted a clear picture of the molecular structure."
        },
        {
            "definition": "Of or relating to the movement of charged particles in an electric field.",
            "pos": "adjective",
            "sent1": "The electrophoretic motion of the particles was fascinating to observe.",
            "sent2": "An electrophoretic field was used to guide the charged particles in the experiment.",
            "sent3": "The electrophoretic particles seemed to dance in response to the electric field.",
            "sent4": "Her excitement was like an electrophoretic charge, spreading quickly through the room.",
            "sent5": "The electrophoretic behavior of the particles was like a choreographed dance in the electric field."
        },
        {
            "definition": "Used in or produced by electrophoresis.",
            "pos": "adjective",
            "sent1": "The electrophoretic equipment was essential for the laboratory experiment.",
            "sent2": "An electrophoretic device was used to analyze the DNA samples.",
            "sent3": "The electrophoretic machine hummed softly as it separated the molecules.",
            "sent4": "Her voice carried an electrophoretic tone, resonating with clarity.",
            "sent5": "The electrophoretic tool efficiently separated the different components of the solution."
        }
    ]
}