{
    "term": "electrofishing",
    "meanings": [
        {
            "definition": "A method of fishing that uses electricity to stun fish for easy capture.",
            "pos": "noun",
            "sent1": "During electrofishing, the electric shock stuns the fish in the water.",
            "sent2": "The researchers conducted electrofishing to study the fish population in the river.",
            "sent3": "The fish were so surprised by the electrofishing that they started a synchronized dance.",
            "sent4": "The sudden jolt of electricity in electrofishing is like a wake-up call for the fish.",
            "sent5": "The bright flash of light during electrofishing made the river look magical."
        },
        {
            "definition": "The act of using electricity to catch fish.",
            "pos": "noun",
            "sent1": "His favorite fishing technique is electrofishing because it's efficient.",
            "sent2": "The fishermen employed electrofishing to catch a large number of fish quickly.",
            "sent3": "The fisherman's electrofishing rod was powered by a battery pack.",
            "sent4": "Using electricity for fishing felt like a futuristic concept in electrofishing.",
            "sent5": "The sound of the electric current in electrofishing was oddly soothing."
        },
        {
            "definition": "The process of stunning fish with an electric current for scientific research or population control.",
            "pos": "noun",
            "sent1": "Scientists use electrofishing to study the behavior of fish in different environments.",
            "sent2": "The government implemented electrofishing to manage the fish population in the lake.",
            "sent3": "The fish's reaction to electrofishing was like a scene from a comedy movie.",
            "sent4": "The precision of the electric shock in electrofishing amazed the researchers.",
            "sent5": "The effectiveness of electrofishing in collecting data was unparalleled."
        }
    ]
}