{
    "term": "electrodynamometer",
    "meanings": [
        {
            "definition": "An instrument for measuring electrical power.",
            "pos": "noun",
            "sent1": "The electrodynamometer displayed the amount of electricity used in the house.",
            "sent2": "The technician used the electrodynamometer to check the power consumption of the appliance.",
            "sent3": "The electrodynamometer joked that it could tell how much energy the TV was using just by looking at it.",
            "sent4": "The electrodynamometer was like a detective, uncovering the secrets of electrical power.",
            "sent5": "With a loud beep, the electrodynamometer revealed the true wattage of the light bulb."
        },
        {
            "definition": "A device that uses electromagnetic principles to measure mechanical force.",
            "pos": "noun",
            "sent1": "The electrodynamometer helped the engineers determine the strength of the machine's movement.",
            "sent2": "Mechanics rely on the electrodynamometer to assess the force exerted by the engine.",
            "sent3": "The electrodynamometer chuckled as it measured the power of a tiny ant pushing a crumb.",
            "sent4": "In the workshop, the electrodynamometer was a silent observer of the forces at play.",
            "sent5": "The electrodynamometer hummed softly as it gauged the strength of the wind turbine."
        },
        {
            "definition": "A tool that determines the power output of an electrical circuit.",
            "pos": "noun",
            "sent1": "The electrodynamometer indicated the amount of energy flowing through the wires.",
            "sent2": "Electricians use the electrodynamometer to evaluate the efficiency of the circuit.",
            "sent3": "The electrodynamometer playfully compared the circuit's power to that of a superhero.",
            "sent4": "Like a wizard's wand, the electrodynamometer revealed the magic of electricity.",
            "sent5": "The electrodynamometer's needle danced as it measured the electrical output of the generator."
        }
    ]
}