{
    "term": "electrophilic",
    "meanings": [
        {
            "definition": "Attracting electrons",
            "pos": "adjective",
            "sent1": "The electrophilic atom eagerly pulls in electrons to complete its outer shell.",
            "sent2": "In chemistry, electrophilic molecules seek out electrons to form bonds.",
            "sent3": "The electrophilic compound was like a magnet for electrons, always wanting more.",
            "sent4": "Her personality was so electrophilic, drawing people to her like a powerful force.",
            "sent5": "The electrophilic nature of the substance made it highly reactive in the presence of other elements."
        },
        {
            "definition": "Having an affinity for electrons",
            "pos": "adjective",
            "sent1": "The electrophilic species showed a strong attraction towards electrons in the experiment.",
            "sent2": "Certain molecules are naturally electrophilic due to their electron-loving nature.",
            "sent3": "The electrophilic compound seemed to have a sweet tooth for electrons, always craving more.",
            "sent4": "His eyes had an electrophilic quality, always drawn to the sparkle of electronic devices.",
            "sent5": "The electrophilic behavior of the element made it stand out in the chemical reaction."
        },
        {
            "definition": "Capable of accepting an electron pair",
            "pos": "adjective",
            "sent1": "The electrophilic compound readily accepted the incoming electron pair.",
            "sent2": "An electrophilic atom can bond with another by accepting an electron pair.",
            "sent3": "The electrophilic molecule was like a gracious host, welcoming the electron pair with open arms.",
            "sent4": "Her mind was an electrophilic receptor, absorbing new ideas like a sponge.",
            "sent5": "The electrophilic nature of the substance allowed it to form stable compounds with ease."
        }
    ]
}