{
    "term": "electromyographic",
    "meanings": [
        {
            "definition": "Relating to the recording of electrical activity in muscles.",
            "pos": "adjective",
            "sent1": "The electromyographic device helped monitor muscle activity during the experiment.",
            "sent2": "Doctors used an electromyographic machine to study muscle responses.",
            "sent3": "The electromyographic tool seemed to have a mind of its own, buzzing with data.",
            "sent4": "Her eyes were like electromyographic sensors, detecting every muscle twitch.",
            "sent5": "The electromyographic readings painted a clear picture of muscle health."
        },
        {
            "definition": "A test that measures the electrical activity in muscles.",
            "pos": "noun",
            "sent1": "During the electromyographic, the patient's muscle reactions were closely observed.",
            "sent2": "The electromyographic revealed abnormal muscle patterns in the athlete.",
            "sent3": "The electromyographic test made the muscles feel like celebrities under scrutiny.",
            "sent4": "His words were an electromyographic test, revealing the truth behind his actions.",
            "sent5": "The electromyographic results were like a musical score, showing the rhythm of muscle activity."
        },
        {
            "definition": "The study of muscle function using electrical signals.",
            "pos": "noun",
            "sent1": "Electromyographic research has led to advancements in understanding muscle behavior.",
            "sent2": "Scientists rely on electromyographic studies to explore muscle responses.",
            "sent3": "The electromyographic study felt like unraveling a mystery hidden within muscles.",
            "sent4": "Her mind worked like an electromyographic machine, decoding the signals of muscle movement.",
            "sent5": "The electromyographic investigation illuminated the intricate dance of muscle contractions."
        }
    ]
}