{
    "term": "electrolyzes",
    "meanings": [
        {
            "definition": "To decompose a compound by passing an electric current through it.",
            "pos": "verb",
            "sent1": "The science experiment showed how electricity electrolyzes water into hydrogen and oxygen.",
            "sent2": "The battery electrolyzes the salt solution, creating chlorine gas.",
            "sent3": "The mischievous student tried to electrolyze his pencil by connecting it to a power source.",
            "sent4": "The lightning storm seemed to electrolyze the dark clouds, revealing a clear sky.",
            "sent5": "The electric current electrolyzes the metal, causing it to break down into its basic elements."
        },
        {
            "definition": "To undergo a chemical change by the action of an electric current.",
            "pos": "verb",
            "sent1": "The metal wire electrolyzes when exposed to the electrical circuit.",
            "sent2": "The solution electrolyzes when the battery is connected, producing bubbles.",
            "sent3": "The cake batter seemed to electrolyze in the oven, turning into a delicious dessert.",
            "sent4": "The plant's leaves appeared to electrolyze under the intense sunlight, changing color.",
            "sent5": "The chemical reaction electrolyzes the liquid, creating a new substance."
        },
        {
            "definition": "To separate a substance into its components by electrolysis.",
            "pos": "verb",
            "sent1": "The process electrolyzes the saltwater, extracting pure salt from it.",
            "sent2": "The machine electrolyzes the metal alloy, separating it into different elements.",
            "sent3": "The magician claimed he could electrolyze a coin into its individual atoms.",
            "sent4": "The factory uses a large tank to electrolyze the raw material into usable components.",
            "sent5": "The scientist's experiment successfully electrolyzes the compound, revealing its basic parts."
        }
    ]
}