{
    "term": "electronegative",
    "meanings": [
        {
            "definition": "Tending to attract electrons",
            "pos": "adjective",
            "sent1": "The electronegative atom easily pulls in electrons from other atoms.",
            "sent2": "Water is a common example of a molecule with electronegative properties.",
            "sent3": "The electronegative element was like a magnet for electrons, always wanting more.",
            "sent4": "Her personality was electronegative, drawing people towards her with a mysterious charm.",
            "sent5": "The electronegative nature of the chemical made it highly reactive in the experiment."
        },
        {
            "definition": "Having a strong affinity for electrons",
            "pos": "adjective",
            "sent1": "The electronegative substance eagerly bonded with available electrons.",
            "sent2": "Metals are not typically electronegative compared to nonmetals.",
            "sent3": "The electronegative compound was like a greedy child, always wanting more electrons to play with.",
            "sent4": "His eyes had an electronegative gaze that seemed to draw you in with intensity.",
            "sent5": "The electronegative nature of the element made it a key player in chemical reactions."
        },
        {
            "definition": "Showing an ability to attract electrons",
            "pos": "adjective",
            "sent1": "The electronegative behavior of the element was evident in its electron-pulling power.",
            "sent2": "In a covalent bond, the more electronegative atom attracts the shared electrons more strongly.",
            "sent3": "The electronegative atom was like a skilled fisherman, reeling in electrons effortlessly.",
            "sent4": "Her words had an electronegative effect, capturing everyone's attention in the room.",
            "sent5": "The electronegative tendencies of the compound made it a valuable component in the reaction."
        }
    ]
}