{
    "term": "electroencephalograph",
    "meanings": [
        {
            "definition": "A device used to record electrical activity in the brain.",
            "pos": "noun",
            "sent1": "The hospital used an electroencephalograph to monitor the patient's brain waves.",
            "sent2": "The scientist analyzed the data from the electroencephalograph to understand brain activity.",
            "sent3": "During the experiment, the mischievous monkey tried to play with the electroencephalograph wires.",
            "sent4": "Her mind was like an electroencephalograph, capturing every thought with precision.",
            "sent5": "The electroencephalograph hummed softly as it recorded the brain's electrical signals."
        },
        {
            "definition": "The process of using a machine to measure brain waves.",
            "pos": "noun",
            "sent1": "Doctors rely on the electroencephalograph to detect abnormalities in brain waves.",
            "sent2": "The technician adjusted the settings on the electroencephalograph before starting the test.",
            "sent3": "The students found it amusing to watch the electroencephalograph display their brain activity.",
            "sent4": "Her thoughts flowed like the lines on an electroencephalograph, revealing her inner workings.",
            "sent5": "The electroencephalograph beeped rhythmically as it captured the brain's electrical impulses."
        },
        {
            "definition": "The study of brain activity through the use of specialized equipment.",
            "pos": "noun",
            "sent1": "Neuroscientists use the electroencephalograph to explore brain functions.",
            "sent2": "The research team conducted experiments with the electroencephalograph to advance their studies.",
            "sent3": "The comedian joked that he could read minds with an electroencephalograph and a magic wand.",
            "sent4": "Her brain was an open book, each page deciphered by the electroencephalograph.",
            "sent5": "The electroencephalograph illuminated the brain's secrets with its intricate patterns."
        }
    ]
}