{
    "term": "eleemosynary",
    "meanings": [
        {
            "definition": "Relating to or dependent on charity.",
            "pos": "adjective",
            "sent1": "The eleemosynary organization provided free meals to the homeless.",
            "sent2": "Her eleemosynary actions towards the less fortunate warmed everyone's hearts.",
            "sent3": "The eleemosynary fundraiser was a success, raising enough money to help many in need.",
            "sent4": "Her smile was as eleemosynary as her generous spirit, spreading joy wherever she went.",
            "sent5": "The eleemosynary nature of the community shone brightly during times of crisis."
        },
        {
            "definition": "Given as an act of charity.",
            "pos": "adjective",
            "sent1": "The eleemosynary gifts brought smiles to the faces of the children in the orphanage.",
            "sent2": "She received an eleemosynary donation that helped her start her own business.",
            "sent3": "The eleemosynary gesture of sharing her lunch with a classmate made them fast friends.",
            "sent4": "His eleemosynary spirit was evident in the way he always put others' needs before his own.",
            "sent5": "The eleemosynary act of kindness created a ripple effect of goodwill in the community."
        },
        {
            "definition": "Supported by charitable donations.",
            "pos": "adjective",
            "sent1": "The eleemosynary foundation was able to continue its work thanks to generous donors.",
            "sent2": "The eleemosynary event raised funds to support local schools in need.",
            "sent3": "The eleemosynary project flourished with the help of kind-hearted contributors.",
            "sent4": "Her eleemosynary efforts were recognized and appreciated by those who believed in her cause.",
            "sent5": "The eleemosynary initiative thrived due to the unwavering support of the community."
        }
    ]
}