{
    "term": "eliminators",
    "meanings": [
        {
            "definition": "A person or thing that eliminates or removes something.",
            "pos": "noun",
            "sent1": "The janitor is one of the school's key eliminators of trash.",
            "sent2": "The exterminator used powerful chemicals as eliminators to get rid of the pests.",
            "sent3": "The vacuum cleaner, the ultimate eliminator of dust bunnies, had a mind of its own.",
            "sent4": "Her determination was an eliminator of doubts, clearing the path to success.",
            "sent5": "The superhero's laser eyes were the ultimate eliminators of evil in the city."
        },
        {
            "definition": "A substance or device used to eliminate or destroy something.",
            "pos": "noun",
            "sent1": "The bleach was a strong eliminator of germs on the kitchen counter.",
            "sent2": "The pesticide spray acted as an eliminator for the pesky ants invading the house.",
            "sent3": "The robot vacuum, a futuristic eliminator of dirt, whizzed around the room.",
            "sent4": "The storm was a powerful eliminator of the old, dead branches in the forest.",
            "sent5": "The fire was a swift eliminator of the dry leaves on the ground."
        },
        {
            "definition": "A team or player that eliminates another team or player from a competition.",
            "pos": "noun",
            "sent1": "The basketball team's star player was the key eliminator in the final game.",
            "sent2": "The soccer team's goalie acted as the last line of defense, a crucial eliminator.",
            "sent3": "The chess player, a strategic eliminator of opponents' pieces, won the tournament.",
            "sent4": "The ninja, a silent eliminator in the shadows, swiftly defeated his enemies.",
            "sent5": "The detective was an expert eliminator of false leads, getting closer to the truth."
        }
    ]
}