{
    "term": "eluant",
    "meanings": [
        {
            "definition": "A substance used in chromatography to carry the analyte through the stationary phase.",
            "pos": "noun",
            "sent1": "The eluant helped move the analyte smoothly through the stationary phase.",
            "sent2": "Scientists carefully selected the eluant to carry the analyte in the experiment.",
            "sent3": "The eluant decided to take the analyte on a leisurely stroll through the stationary phase.",
            "sent4": "Like a gentle river, the eluant carried the analyte through the chromatography process.",
            "sent5": "The eluant acted as a reliable guide, escorting the analyte through the stationary phase."
        },
        {
            "definition": "The mobile phase in chromatography that carries the analyte.",
            "pos": "noun",
            "sent1": "In chromatography, the eluant swiftly carries the analyte through the mobile phase.",
            "sent2": "The eluant's role is crucial as it transports the analyte during the experiment.",
            "sent3": "The eluant cheerfully escorted the analyte through the mobile phase.",
            "sent4": "Like a busy highway, the eluant efficiently moves the analyte along.",
            "sent5": "The eluant acts as a reliable carrier, ensuring the analyte reaches its destination."
        },
        {
            "definition": "The solvent used to elute a compound from a column in chromatography.",
            "pos": "noun",
            "sent1": "The eluant effectively separated the compound from the column in chromatography.",
            "sent2": "Researchers carefully chose the eluant to extract the compound from the column.",
            "sent3": "The mischievous eluant played hide-and-seek with the compound in the column.",
            "sent4": "Like a skilled detective, the eluant uncovered the compound hidden in the column.",
            "sent5": "The eluant acted as a key to unlock the compound from the column in chromatography."
        }
    ]
}