{
    "term": "elutriations",
    "meanings": [
        {
            "definition": "The process of separating particles by size using a liquid medium.",
            "pos": "noun",
            "sent1": "During the elutriations, the small particles were separated from the larger ones.",
            "sent2": "Scientists use elutriations to sort different-sized particles in a mixture.",
            "sent3": "The elutriations in the lab were so precise that even the tiniest particles were caught!",
            "sent4": "Her meticulous elutriations of the sand revealed hidden treasures within.",
            "sent5": "The elutriations resembled a dance of particles swirling in the liquid medium."
        },
        {
            "definition": "The act of purifying or refining a substance through washing or separation.",
            "pos": "noun",
            "sent1": "The elutriations of the impurities left the substance pure and clean.",
            "sent2": "The elutriations removed the unwanted elements from the mixture.",
            "sent3": "After the elutriations, the substance sparkled like a diamond in the sun.",
            "sent4": "His careful elutriations transformed the substance into a masterpiece.",
            "sent5": "The elutriations were like a gentle shower cleansing the substance of impurities."
        },
        {
            "definition": "The result of a process that separates particles by size.",
            "pos": "noun",
            "sent1": "The elutriations at the end of the experiment showed clear separation of particles.",
            "sent2": "The elutriations indicated successful particle size differentiation.",
            "sent3": "The elutriations outcome was a rainbow of particles sorted by size.",
            "sent4": "The elutriations were like a colorful mosaic of particles in the liquid medium.",
            "sent5": "The elutriations result was a beautiful display of particle sizes."
        }
    ]
}