{
    "term": "emasculate",
    "meanings": [
        {
            "definition": "Deprive of strength or vigor",
            "pos": "verb",
            "sent1": "The illness seemed to emasculate him, leaving him tired and weak.",
            "sent2": "The lack of sleep can emasculate a person's ability to focus.",
            "sent3": "After a long day of work, the computer's constant crashes seemed to emasculate his patience.",
            "sent4": "The relentless heat of the desert sun emasculated the once lush green plants.",
            "sent5": "The villain's evil plan was to emasculate the hero's power, leaving him helpless."
        },
        {
            "definition": "Make weaker or less effective",
            "pos": "verb",
            "sent1": "The new regulations could emasculate the company's ability to innovate.",
            "sent2": "Lack of proper maintenance can emasculate the performance of a car.",
            "sent3": "The magician's failed trick only served to emasculate his reputation as a master illusionist.",
            "sent4": "The constant interruptions emasculated the flow of the speaker's presentation.",
            "sent5": "The harsh criticism seemed to emasculate her confidence in her artistic abilities."
        },
        {
            "definition": "Remove the masculinity or male characteristics from",
            "pos": "verb",
            "sent1": "The costume party theme was to emasculate the men by dressing them in frilly dresses.",
            "sent2": "The evil sorcerer's curse was to emasculate the prince, turning him into a frog.",
            "sent3": "The barber's mistake seemed to emasculate the man's traditionally masculine haircut.",
            "sent4": "The strict rules of the school seemed to emasculate any sense of individuality among the students.",
            "sent5": "The toxic masculinity in the locker room conversation only served to emasculate those who didn't conform."
        }
    ]
}