{
    "term": "emasculated",
    "meanings": [
        {
            "definition": "Deprived of strength or vigor",
            "pos": "adjective",
            "sent1": "The tired old lion felt emasculated as he struggled to keep up with the younger ones.",
            "sent2": "After the long illness, he felt emasculated and unable to perform his usual tasks.",
            "sent3": "The superhero's powers were temporarily emasculated by a mischievous villain's spell.",
            "sent4": "The once mighty fortress now stood emasculated, its walls crumbling and defenses weakened.",
            "sent5": "The storm's fury left the landscape emasculated, with trees uprooted and buildings destroyed."
        },
        {
            "definition": "Castrated",
            "pos": "adjective",
            "sent1": "The farmer's emasculated bull was no longer able to sire calves.",
            "sent2": "In ancient times, some eunuchs were emasculated to serve in royal courts.",
            "sent3": "The magician's trick involved making a coin disappear, leaving the audience feeling emasculated.",
            "sent4": "The defeated warrior was forced to kneel, feeling emasculated in front of his enemies.",
            "sent5": "The emasculated rooster strutted around the farm, unaware of his loss of virility."
        },
        {
            "definition": "Weakened or diminished in power or effectiveness",
            "pos": "adjective",
            "sent1": "The emasculated political party struggled to gain support from the voters.",
            "sent2": "The once influential company now appeared emasculated in the competitive market.",
            "sent3": "The team's star player's injury left them feeling emasculated on the field.",
            "sent4": "The dictator's oppressive regime was slowly being emasculated by the people's uprising.",
            "sent5": "The lack of funding emasculated the research project, hindering its progress."
        }
    ]
}