{
    "term": "embankments",
    "meanings": [
        {
            "definition": "A wall or bank of earth or stone built to prevent a river flooding",
            "pos": "noun",
            "sent1": "The embankments along the river kept the water from overflowing.",
            "sent2": "The town built sturdy embankments to protect against floods.",
            "sent3": "The playful ducks waddled along the embankments, pretending to be kings of the hill.",
            "sent4": "Her determination was like the embankments, strong and unyielding.",
            "sent5": "The image of the embankments towering over the river stuck in his mind like a stubborn memory."
        },
        {
            "definition": "A raised bank or wall of earth or stone built to carry a road or railroad",
            "pos": "noun",
            "sent1": "The train tracks ran smoothly along the embankments, providing a scenic route.",
            "sent2": "The road curved gracefully around the embankments, offering a picturesque view.",
            "sent3": "The children raced up and down the embankments, pretending they were climbing a mountain.",
            "sent4": "Her determination to succeed was as solid as the embankments supporting the railway.",
            "sent5": "The embankments guided the path of the road like a gentle hand leading the way."
        },
        {
            "definition": "A bank or mound of earth raised to support a roadway or railroad track",
            "pos": "noun",
            "sent1": "The workers piled up the embankments to provide a stable foundation for the track.",
            "sent2": "The embankments were carefully constructed to ensure the safety of the road above.",
            "sent3": "The embankments seemed to whisper secrets to each other as the train passed by.",
            "sent4": "Her determination to finish the project was as solid as the embankments beneath her feet.",
            "sent5": "The embankments cradled the road like a protective embrace, guiding travelers on their journey."
        }
    ]
}