{
    "term": "embattled",
    "meanings": [
        {
            "definition": "Engaged in or prepared for battle.",
            "pos": "adjective",
            "sent1": "The embattled soldiers stood ready for the enemy's attack.",
            "sent2": "The embattled army marched bravely towards the battlefield.",
            "sent3": "The embattled knights argued over who would lead the charge.",
            "sent4": "The embattled gladiators fought fiercely in the arena.",
            "sent5": "The embattled fortress was a symbol of strength and resilience."
        },
        {
            "definition": "Surrounded or besieged by enemies.",
            "pos": "adjective",
            "sent1": "The embattled city walls were under constant siege.",
            "sent2": "The embattled village was surrounded by hostile forces.",
            "sent3": "The embattled town struggled to fend off the invaders.",
            "sent4": "The embattled kingdom faced threats from all sides.",
            "sent5": "The embattled castle was a target for enemy attacks."
        },
        {
            "definition": "Having a defensive or combative attitude.",
            "pos": "adjective",
            "sent1": "The embattled general refused to surrender to the enemy.",
            "sent2": "The embattled boxer entered the ring with determination.",
            "sent3": "The embattled student defended their position in the debate.",
            "sent4": "The embattled team fought back against their opponents.",
            "sent5": "The embattled warrior never backed down from a challenge."
        },
        {
            "definition": "Marked by conflict or controversy.",
            "pos": "adjective",
            "sent1": "The embattled company faced criticism from the public.",
            "sent2": "The embattled politician struggled to gain support.",
            "sent3": "The embattled family tried to resolve their differences.",
            "sent4": "The embattled community debated the proposed changes.",
            "sent5": "The embattled organization was in the midst of a heated dispute."
        }
    ]
}