{
    "term": "embassages",
    "meanings": [
        {
            "definition": "The act of sending a diplomatic representative to a foreign country.",
            "pos": "noun",
            "sent1": "The embassages were crucial in maintaining peaceful relations between the two nations.",
            "sent2": "The embassages from our country always carry important documents.",
            "sent3": "The embassages were so busy, they accidentally sent a diplomat to the wrong country!",
            "sent4": "The embassages acted as bridges between the two nations, fostering understanding.",
            "sent5": "The embassages were like messengers of peace, traveling far and wide."
        },
        {
            "definition": "A message or communication sent by a diplomatic representative.",
            "pos": "noun",
            "sent1": "The embassages contained important news from the foreign country.",
            "sent2": "Receiving embassages from other nations helps us stay informed.",
            "sent3": "The embassages were full of surprises, like a diplomatic treasure hunt.",
            "sent4": "The embassages carried words that held the power to shape international relations.",
            "sent5": "The embassages were like whispers of diplomacy, crossing borders discreetly."
        },
        {
            "definition": "The building or office where a diplomatic representative works.",
            "pos": "noun",
            "sent1": "The embassages were beautifully decorated with art from the representative's country.",
            "sent2": "Visiting the embassages always felt like stepping onto foreign soil.",
            "sent3": "The embassages were so grand, they could easily be mistaken for a palace!",
            "sent4": "The embassages stood as symbols of unity and cooperation between nations.",
            "sent5": "The embassages were like cultural hubs, showcasing the best of each country."
        }
    ]
}