{
    "term": "embalmments",
    "meanings": [
        {
            "definition": "The act of preserving a dead body by treating it with chemicals.",
            "pos": "noun",
            "sent1": "The embalmments were done carefully to keep the body from decaying.",
            "sent2": "The funeral home specializes in performing embalmments for grieving families.",
            "sent3": "During the embalmments, the mortician accidentally spilled some chemicals, creating a funny smell.",
            "sent4": "The embalmments transformed the body into a peaceful, preserved figure for the viewing.",
            "sent5": "The embalmments were so well done that the deceased looked as if they were merely sleeping."
        },
        {
            "definition": "The process of preparing a deceased person for burial.",
            "pos": "noun",
            "sent1": "After the embalmments were completed, the body was ready for the funeral service.",
            "sent2": "Families often rely on professionals to handle the embalmments of their loved ones.",
            "sent3": "The embalmments took longer than expected, causing a delay in the burial ceremony.",
            "sent4": "The meticulous embalmments turned the deceased into a peaceful, resting figure.",
            "sent5": "The embalmments were a crucial step in ensuring the deceased's dignified farewell."
        },
        {
            "definition": "The practice of mummifying a body to prevent decay.",
            "pos": "noun",
            "sent1": "Ancient civilizations used embalmments to preserve bodies for centuries.",
            "sent2": "The museum displayed the tools used for ancient embalmments of mummies.",
            "sent3": "The embalmments of the pharaohs were believed to protect them in the afterlife.",
            "sent4": "The intricate embalmments of the mummy revealed the skill of the embalmers.",
            "sent5": "The embalmments of the mummy were a testament to the ancient art of preservation."
        }
    ]
}