{
    "term": "embargoed",
    "meanings": [
        {
            "definition": "An official ban on trade or other commercial activity with a particular country.",
            "pos": "noun",
            "sent1": "The embargoed goods were not allowed to be traded with the foreign country.",
            "sent2": "The embargoed items were held back from being sold to the overseas market.",
            "sent3": "The embargoed products decided to have a party in the warehouse instead of going abroad.",
            "sent4": "The embargoed trade was like a locked door, preventing any exchange with the outside world.",
            "sent5": "The embargoed goods sat silently, forbidden from crossing borders."
        },
        {
            "definition": "To impose an official ban on trade or other commercial activity with a particular country.",
            "pos": "verb",
            "sent1": "The government embargoed all transactions with the neighboring nation.",
            "sent2": "They embargoed the shipment of goods to comply with the trade restrictions.",
            "sent3": "The company embargoed the sales, causing confusion among the customers.",
            "sent4": "She embargoed the trade routes, cutting off all communication with the outside world.",
            "sent5": "The authorities embargoed the imports, halting the flow of goods into the country."
        },
        {
            "definition": "To officially ban the publication of something.",
            "pos": "verb",
            "sent1": "The government embargoed the controversial book from being printed.",
            "sent2": "The publisher embargoed the release of the magazine due to sensitive content.",
            "sent3": "The author embargoed their own work, keeping it hidden from the public eye.",
            "sent4": "The editor embargoed the article, preventing it from reaching the readers.",
            "sent5": "The committee embargoed the report, keeping its contents confidential."
        }
    ]
}