{
    "term": "embolectomies",
    "meanings": [
        {
            "definition": "The surgical removal of an embolus or blood clot from a blood vessel.",
            "pos": "noun",
            "sent1": "During the embolectomies, the doctors carefully extracted the blood clot from the patient's artery.",
            "sent2": "The hospital specializes in performing embolectomies to save patients from dangerous blockages.",
            "sent3": "The embolectomies were like a rescue mission for the clogged blood vessel.",
            "sent4": "Her skilled hands worked swiftly, like a surgeon performing delicate embolectomies.",
            "sent5": "The image of the tiny forceps used in embolectomies stayed in his mind long after the procedure."
        },
        {
            "definition": "The act of performing embolectomies.",
            "pos": "noun",
            "sent1": "The team's success in the embolectomies boosted their confidence in handling such procedures.",
            "sent2": "She trained tirelessly to perfect her technique for the challenging embolectomies.",
            "sent3": "The embolectomies became a routine task for the experienced medical staff.",
            "sent4": "The precision required for successful embolectomies was evident in every movement.",
            "sent5": "His dedication to mastering embolectomies was truly admirable."
        },
        {
            "definition": "The plural form of embolectomy.",
            "pos": "noun",
            "sent1": "The records showed a significant increase in embolectomies performed last year.",
            "sent2": "Doctors discussed the various techniques used in embolectomies during the conference.",
            "sent3": "The embolectomies listed on the schedule kept the surgical team busy all week.",
            "sent4": "The success rate of the hospital's embolectomies was a topic of admiration among medical professionals.",
            "sent5": "The importance of timely embolectomies was emphasized in the medical training program."
        }
    ]
}