{
    "term": "emissary",
    "meanings": [
        {
            "definition": "A person sent on a special mission, usually as a diplomatic representative.",
            "pos": "noun",
            "sent1": "The emissary delivered the important message to the foreign ambassador.",
            "sent2": "The king's emissary traveled to the neighboring kingdom to discuss peace.",
            "sent3": "The emissary accidentally spilled ink on the treaty document, causing a comical misunderstanding.",
            "sent4": "She moved through the crowded room like an emissary of light, bringing hope to all she encountered.",
            "sent5": "The emissary's arrival was marked by a grand procession, capturing the attention of the entire city."
        },
        {
            "definition": "An agent sent on a secret mission, especially as a spy.",
            "pos": "noun",
            "sent1": "The cunning emissary gathered intelligence without raising suspicion.",
            "sent2": "The enemy's emissary infiltrated the fortress under the cover of darkness.",
            "sent3": "The emissary disguised as a servant eavesdropped on the confidential conversation.",
            "sent4": "She operated in the shadows like an emissary of shadows, unseen and unheard.",
            "sent5": "The emissary's stealthy movements were like whispers in the night, shrouded in mystery."
        },
        {
            "definition": "A representative or messenger.",
            "pos": "noun",
            "sent1": "The company's emissary negotiated the terms of the contract with skill.",
            "sent2": "The tribal chief sent an emissary to deliver the peace offering.",
            "sent3": "The emissary carried the urgent message through the storm, determined to reach the recipient.",
            "sent4": "His words were like an emissary of truth, cutting through the lies and deception.",
            "sent5": "The emissary's presence in the council chamber brought a sense of unity and purpose to the attendees."
        }
    ]
}