{
    "term": "emitting",
    "meanings": [
        {
            "definition": "To send forth or discharge",
            "pos": "verb",
            "sent1": "The sun was emitting warmth on the chilly morning.",
            "sent2": "The flower was emitting a pleasant fragrance.",
            "sent3": "The toaster started emitting a funny noise, making everyone laugh.",
            "sent4": "The volcano was emitting clouds of ash into the sky.",
            "sent5": "The radio tower was emitting signals far into the distance."
        },
        {
            "definition": "To give off or release",
            "pos": "verb",
            "sent1": "The campfire was emitting a cozy glow in the dark forest.",
            "sent2": "The factory was emitting smoke into the air.",
            "sent3": "The old car kept emitting strange sounds, like a musical instrument.",
            "sent4": "The glowing fireflies were emitting light in the garden.",
            "sent5": "The bakery was emitting the delicious smell of freshly baked bread."
        },
        {
            "definition": "To produce and discharge",
            "pos": "verb",
            "sent1": "The machine was emitting sparks during the repair.",
            "sent2": "The engine was emitting a loud roar as the plane took off.",
            "sent3": "The magician's wand was emitting sparks of different colors.",
            "sent4": "The fireworks were emitting bright colors in the night sky.",
            "sent5": "The speaker was emitting sound waves that filled the room."
        },
        {
            "definition": "To throw or cast out",
            "pos": "verb",
            "sent1": "The angry cat was emitting hisses at the approaching dog.",
            "sent2": "The volcano was emitting molten lava down its slopes.",
            "sent3": "The broken pipe was emitting water all over the kitchen floor.",
            "sent4": "The machine was emitting sparks, causing a small fire.",
            "sent5": "The storm was emitting lightning across the dark sky."
        }
    ]
}