{
    "term": "emotionalists",
    "meanings": [
        {
            "definition": "A person who is prone to expressing their emotions openly.",
            "pos": "noun",
            "sent1": "Some emotionalists find it easy to share their feelings with others.",
            "sent2": "The emotionalists in the room were not afraid to show their happiness.",
            "sent3": "The emotionalists at the party made everyone feel welcome with their warm smiles.",
            "sent4": "Her art resonated with emotionalists, capturing raw emotions on canvas.",
            "sent5": "The emotionalists' tears flowed freely during the touching movie scene."
        },
        {
            "definition": "A group of individuals who prioritize emotions in their decision-making.",
            "pos": "noun",
            "sent1": "The emotionalists in the team always consider how others feel before making choices.",
            "sent2": "As emotionalists, they often base their decisions on how they feel about a situation.",
            "sent3": "The emotionalists' choice to have a picnic in the rain raised a few eyebrows.",
            "sent4": "Their company was known as the emotionalists of the industry, leading with their hearts.",
            "sent5": "The emotionalists' decision to cancel the event last minute surprised many."
        },
        {
            "definition": "The belief or practice of valuing emotions over logic.",
            "pos": "noun",
            "sent1": "Some people argue that emotionalists prioritize feelings over facts.",
            "sent2": "In a debate, the emotionalists often rely on their emotions rather than logical arguments.",
            "sent3": "The boardroom discussion turned into chaos when the emotionalists clashed with the logicians.",
            "sent4": "Her poetry reflected the battle between emotionalists and rationalists in society.",
            "sent5": "The emotionalists' manifesto called for a world led by empathy and understanding."
        }
    ]
}