{
    "term": "emotionalism",
    "meanings": [
        {
            "definition": "Excessive emphasis on or indulgence in emotions.",
            "pos": "noun",
            "sent1": "Her constant emotionalism made it difficult for her to make rational decisions.",
            "sent2": "The politician's speech was full of emotionalism, appealing to the audience's feelings rather than their logic.",
            "sent3": "The movie's emotionalism was so over-the-top that it became comical.",
            "sent4": "His emotionalism was like a storm, overwhelming everyone around him.",
            "sent5": "The painting captured the essence of emotionalism, with vibrant colors and bold strokes."
        },
        {
            "definition": "The tendency to rely on or appeal to emotions rather than reason.",
            "pos": "noun",
            "sent1": "Her constant emotionalism made it difficult for her to make rational decisions.",
            "sent2": "The politician's speech was full of emotionalism, appealing to the audience's feelings rather than their logic.",
            "sent3": "The movie's emotionalism was so over-the-top that it became comical.",
            "sent4": "His emotionalism was like a storm, overwhelming everyone around him.",
            "sent5": "The painting captured the essence of emotionalism, with vibrant colors and bold strokes."
        },
        {
            "definition": "The expression or portrayal of emotions in a dramatic or exaggerated manner.",
            "pos": "noun",
            "sent1": "The actor's emotionalism on stage moved the audience to tears.",
            "sent2": "Her writing was criticized for its excessive emotionalism, lacking subtlety and nuance.",
            "sent3": "The comedian's emotionalism in his jokes added an unexpected layer of depth to his performance.",
            "sent4": "The painting's emotionalism was like a symphony of colors, each hue representing a different feeling.",
            "sent5": "The singer's emotionalism on stage was palpable, reaching every corner of the concert hall."
        }
    ]
}