{
    "term": "enchoric",
    "meanings": [
        {
            "definition": "Of or relating to a chorus or choir.",
            "pos": "adjective",
            "sent1": "The enchoric voices of the choir filled the hall with harmonious melodies.",
            "sent2": "The enchoric performance by the choir captivated the audience with its unity.",
            "sent3": "The enchoric choir members wore matching outfits, creating a visually appealing sight.",
            "sent4": "The enchoric harmony of the choir was like a symphony of unity and togetherness.",
            "sent5": "The enchoric singing of the choir echoed through the church, leaving a lasting impression on all who listened."
        },
        {
            "definition": "Pertaining to a type of poetry or drama performed by a chorus.",
            "pos": "adjective",
            "sent1": "The enchoric verses of the play were beautifully recited by the chorus.",
            "sent2": "The enchoric elements in the poetry added depth and emotion to the performance.",
            "sent3": "The enchoric drama unfolded on stage, captivating the audience with its poetic charm.",
            "sent4": "The enchoric poetry danced off the pages, enchanting all who heard it.",
            "sent5": "The enchoric performance of the play by the chorus brought the ancient words to life in a mesmerizing way."
        },
        {
            "definition": "Involving or characteristic of a group singing or chanting together.",
            "pos": "adjective",
            "sent1": "The enchoric singing at the campfire brought everyone together in a joyous melody.",
            "sent2": "The enchoric chanting of the fans created a powerful sense of unity in the stadium.",
            "sent3": "The enchoric group singing competition was filled with laughter and camaraderie.",
            "sent4": "The enchoric voices of the children blended harmoniously in the school choir.",
            "sent5": "The enchoric chanting of the monks resonated through the monastery, creating a peaceful atmosphere."
        }
    ]
}