{
    "term": "encompassing",
    "meanings": [
        {
            "definition": "Surrounding or covering completely.",
            "pos": "adjective",
            "sent1": "The vast forest had an encompassing canopy that blocked out most of the sunlight.",
            "sent2": "The cozy blanket provided an encompassing warmth on the chilly evening.",
            "sent3": "The puppy tried to hide under the encompassing shadow of the table during the game of hide-and-seek.",
            "sent4": "Her encompassing love for her family was like a warm embrace that never faded.",
            "sent5": "The encompassing fog made it difficult to see more than a few feet ahead."
        },
        {
            "definition": "Including or containing everything.",
            "pos": "adjective",
            "sent1": "The library's encompassing collection of books catered to readers of all ages.",
            "sent2": "The comprehensive report provided an encompassing overview of the project's progress.",
            "sent3": "The magician's hat seemed to have an encompassing capacity to produce endless surprises.",
            "sent4": "Her encompassing knowledge of the subject impressed even the most seasoned professors.",
            "sent5": "The map displayed an encompassing view of the entire city, from the bustling downtown to the quiet suburbs."
        },
        {
            "definition": "To enclose or encircle.",
            "pos": "verb",
            "sent1": "The garden wall encompassed the entire backyard, creating a sense of privacy.",
            "sent2": "The protective barrier encompassed the fragile flower bed, shielding it from strong winds.",
            "sent3": "The detective's investigation seemed to encompass every possible suspect in the small town.",
            "sent4": "His arms reached out to encompass her in a warm hug after being apart for so long.",
            "sent5": "The artist's masterpiece seemed to encompass the essence of nature's beauty in every stroke."
        }
    ]
}