{
    "term": "endarchy",
    "meanings": [
        {
            "definition": "A system of government in which power is concentrated in a central authority.",
            "pos": "noun",
            "sent1": "In the endarchy, all decisions are made by the central authority.",
            "sent2": "The endarchy ensures that the central authority has control over all aspects of governance.",
            "sent3": "The endarchy's central authority decided to host a pizza party for all citizens.",
            "sent4": "Under the endarchy, the central authority's power is like a bright beacon guiding the nation.",
            "sent5": "The endarchy's central authority is like the sun, providing light and direction to the people."
        },
        {
            "definition": "The state of being ruled by a central authority.",
            "pos": "noun",
            "sent1": "Living in endarchy means following the rules set by the central authority.",
            "sent2": "Endarchy can sometimes lead to efficient decision-making by the central authority.",
            "sent3": "The endarchy's central authority declared a national pajama day.",
            "sent4": "Endarchy's rule by the central authority is akin to a parent guiding their children.",
            "sent5": "The endarchy's central authority governs with a firm but fair hand."
        },
        {
            "definition": "The centralization of power within a government or organization.",
            "pos": "noun",
            "sent1": "Endarchy involves the concentration of power within a single entity.",
            "sent2": "The endarchy's centralization of power can lead to effective decision-making.",
            "sent3": "The endarchy's central authority decided to paint all buildings pink.",
            "sent4": "The endarchy's centralization of power is like a strong magnet pulling all control to one place.",
            "sent5": "Endarchy's centralization of power is the cornerstone of its governance structure."
        }
    ]
}