{
    "term": "endowment",
    "meanings": [
        {
            "definition": "A natural ability or quality",
            "pos": "noun",
            "sent1": "Her artistic endowment allowed her to create beautiful paintings effortlessly.",
            "sent2": "His musical endowment was evident from a young age, as he could play any instrument by ear.",
            "sent3": "Despite his lack of formal training, his endowment for storytelling captivated audiences.",
            "sent4": "Her endowment for empathy made her the perfect counselor, always understanding others' feelings.",
            "sent5": "The endowment of courage she possessed helped her face challenges with determination."
        },
        {
            "definition": "The act of providing a source of income or support for an organization",
            "pos": "noun",
            "sent1": "The generous endowment from the philanthropist ensured the museum's financial stability.",
            "sent2": "The university received a significant endowment from a successful alumnus to fund scholarships.",
            "sent3": "The unexpected endowment from an anonymous donor saved the struggling charity.",
            "sent4": "The endowment for the arts allowed the theater to continue its productions without financial worries.",
            "sent5": "The endowment provided by the government helped the research institute expand its facilities."
        },
        {
            "definition": "The action of giving money or property to a person or institution for a specific purpose",
            "pos": "noun",
            "sent1": "The billionaire's endowment to the hospital enabled the construction of a new wing.",
            "sent2": "The endowment from the estate was used to establish a scholarship fund for underprivileged students.",
            "sent3": "The endowment for the animal shelter came as a surprise and greatly benefited the furry residents.",
            "sent4": "Her endowment to the library was a gesture of gratitude for the knowledge it provided her.",
            "sent5": "The endowment for cancer research was a personal mission for him to contribute to finding a cure."
        }
    ]
}