{
    "term": "endured",
    "meanings": [
        {
            "definition": "Suffered patiently",
            "pos": "adverb",
            "sent1": "She endured the long wait at the doctor's office without complaining.",
            "sent2": "The soldier endured the harsh conditions during training.",
            "sent3": "The cat endured the bath with a look of pure betrayal.",
            "sent4": "His endurance in the face of adversity was like a rock in a stormy sea.",
            "sent5": "The marathon runner's endurance was tested as she crossed the finish line."
        },
        {
            "definition": "Lasted",
            "pos": "verb",
            "sent1": "The battery endured for hours before needing to be recharged.",
            "sent2": "Their friendship endured through thick and thin.",
            "sent3": "The old car endured one last road trip before finally breaking down.",
            "sent4": "The ancient ruins endured for centuries, a testament to the past.",
            "sent5": "The memory of her smile endured in his heart long after she was gone."
        },
        {
            "definition": "Tolerated",
            "pos": "verb",
            "sent1": "He endured his annoying coworker's constant chatter every day.",
            "sent2": "The teacher could not endure the disruptive behavior in class.",
            "sent3": "The cat endured the presence of the new puppy with a mix of curiosity and annoyance.",
            "sent4": "She could no longer endure the pain and decided to seek help.",
            "sent5": "The old tree endured the children's climbing and swinging with silent patience."
        },
        {
            "definition": "Underwent without giving way",
            "pos": "adverb",
            "sent1": "The bridge endured the weight of the heavy trucks passing over it.",
            "sent2": "The rope endured the strain of the heavy load without breaking.",
            "sent3": "The old house endured the storm without losing a single shingle.",
            "sent4": "His resolve endured the doubts and criticisms of others.",
            "sent5": "The friendship endured the test of time, growing stronger with each challenge."
        }
    ]
}