{
    "term": "enervators",
    "meanings": [
        {
            "definition": "a person or thing that weakens or drains energy",
            "pos": "noun",
            "sent1": "The constant negativity around her acted as enervators, making her feel tired and unmotivated.",
            "sent2": "The enervators in the office were the toxic work environment and lack of support from colleagues.",
            "sent3": "The enervators at the party were the boring conversations and dull music.",
            "sent4": "The stress of the upcoming exams felt like invisible enervators slowly sapping his energy.",
            "sent5": "The negative news on TV served as enervators, draining the viewers' enthusiasm for the day."
        },
        {
            "definition": "causing weakness or fatigue",
            "pos": "adjective",
            "sent1": "After the long hike, her enervators legs could barely carry her back to the campsite.",
            "sent2": "The enervators workout left him exhausted and sore the next day.",
            "sent3": "The enervators heat of the sun made everyone seek shade and cool drinks.",
            "sent4": "The enervators medicine made her feel even more tired than before.",
            "sent5": "The enervators journey through the dense forest left them drained and weary."
        },
        {
            "definition": "to weaken or drain energy or strength",
            "pos": "verb",
            "sent1": "The constant stress of work enervators her, leaving her feeling depleted at the end of each day.",
            "sent2": "The lack of sleep enervators his ability to focus during important meetings.",
            "sent3": "He tried to enervators his opponent by constantly interrupting and undermining their arguments.",
            "sent4": "The relentless demands of the project enervators the team, causing delays and mistakes.",
            "sent5": "The negative comments enervators her confidence, making her doubt her abilities."
        }
    ]
}