{
    "term": "enervator",
    "meanings": [
        {
            "definition": "A person or thing that enervates or weakens.",
            "pos": "noun",
            "sent1": "The constant negativity from her friend acted as an enervator, draining her energy.",
            "sent2": "The villain in the story was portrayed as an enervator of hope and happiness.",
            "sent3": "The lazy cat was jokingly referred to as an enervator of productivity in the house.",
            "sent4": "The toxic relationship was an enervator, slowly sapping away his strength.",
            "sent5": "The dark cloud hanging over the town was like an enervator, casting a shadow on everyone's spirits."
        },
        {
            "definition": "A device or machine that drains energy or vitality.",
            "pos": "noun",
            "sent1": "The old air conditioner was like an enervator, barely cooling the room.",
            "sent2": "The enervator in the gym was broken, leaving the athletes exhausted after their workout.",
            "sent3": "The malfunctioning enervator in the office caused more yawns than work.",
            "sent4": "The haunted house was described as an enervator, sucking the life out of anyone who entered.",
            "sent5": "The faulty enervator in the car drained the battery faster than usual."
        },
        {
            "definition": "A substance or treatment that causes fatigue or debilitation.",
            "pos": "noun",
            "sent1": "The bitter medicine tasted like an enervator, making the child feel even more tired.",
            "sent2": "The enervator used in the experiment left the plants wilted and weak.",
            "sent3": "The magical potion was jokingly called an enervator, as it made people fall asleep instantly.",
            "sent4": "The cursed artifact was an enervator, bringing exhaustion to anyone who touched it.",
            "sent5": "The mysterious powder acted as an enervator, draining the strength of those who inhaled it."
        }
    ]
}