{
    "term": "engagement",
    "meanings": [
        {
            "definition": "The act of engaging or being engaged",
            "pos": "noun",
            "sent1": "Her engagement in the project showed her dedication.",
            "sent2": "The team's engagement in the task led to successful results.",
            "sent3": "His engagement in the game was so intense, he forgot about everything else.",
            "sent4": "The engagement of the audience was evident by their enthusiastic applause.",
            "sent5": "The teacher's engagement with the students made the class enjoyable and interactive."
        },
        {
            "definition": "A formal agreement to get married",
            "pos": "noun",
            "sent1": "Their engagement was announced with joy and excitement.",
            "sent2": "The couple celebrated their engagement with a party.",
            "sent3": "The engagement ring sparkled brightly on her finger.",
            "sent4": "The engagement ceremony was filled with love and happiness.",
            "sent5": "Their engagement symbolized their commitment to each other."
        },
        {
            "definition": "A meeting or appointment",
            "pos": "noun",
            "sent1": "The engagement with the client was scheduled for next week.",
            "sent2": "She had an important engagement at the office in the morning.",
            "sent3": "His engagement with the doctor was brief but informative.",
            "sent4": "The engagement with the team members was productive and collaborative.",
            "sent5": "The engagement with the new supplier was successful and promising."
        },
        {
            "definition": "Emotional involvement or commitment",
            "pos": "noun",
            "sent1": "Her engagement with the cause was heartfelt and genuine.",
            "sent2": "The speaker's engagement with the audience was inspiring.",
            "sent3": "His engagement with the book brought tears to his eyes.",
            "sent4": "The couple's engagement with each other was evident in their actions.",
            "sent5": "The artist's engagement with the painting was evident in every brushstroke."
        },
        {
            "definition": "Military combat or conflict",
            "pos": "noun",
            "sent1": "The engagement with the enemy forces was intense and strategic.",
            "sent2": "The soldiers prepared for the upcoming engagement.",
            "sent3": "His engagement with the enemy was swift and decisive.",
            "sent4": "The military engagement lasted for hours before a ceasefire was called.",
            "sent5": "The engagement with the opposing army required careful planning and coordination."
        }
    ]
}