{
    "term": "engage",
    "meanings": [
        {
            "definition": "To participate or become involved in",
            "pos": "verb",
            "sent1": "I will engage in the school play next week.",
            "sent2": "She likes to engage in group activities during recess.",
            "sent3": "The cat tried to engage in the game of hide and seek.",
            "sent4": "His mind started to engage in solving the puzzle.",
            "sent5": "The children engage in building sandcastles at the beach."
        },
        {
            "definition": "To attract or hold the attention of",
            "pos": "verb",
            "sent1": "The colorful illustrations in the book engage young readers.",
            "sent2": "The magician's tricks never fail to engage the audience.",
            "sent3": "The movie engaged the viewers with its unexpected plot twists.",
            "sent4": "The new video game can engage players for hours.",
            "sent5": "The catchy tune of the song engages listeners instantly."
        },
        {
            "definition": "To enter into battle or combat",
            "pos": "verb",
            "sent1": "The soldiers will engage the enemy at dawn.",
            "sent2": "The knights prepared to engage in a fierce jousting match.",
            "sent3": "The superheroes engaged in an epic battle to save the city.",
            "sent4": "The rival gangs decided to engage in a turf war.",
            "sent5": "The samurai warriors engaged in a duel of honor."
        },
        {
            "definition": "To arrange to employ or hire someone",
            "pos": "verb",
            "sent1": "The company will engage a new marketing manager next month.",
            "sent2": "She decided to engage a personal trainer to help with her fitness goals.",
            "sent3": "The restaurant will engage additional staff for the busy season.",
            "sent4": "The school board plans to engage a new principal for the upcoming academic year.",
            "sent5": "The business owner needs to engage skilled workers for the project."
        }
    ]
}