{
    "term": "engaged",
    "meanings": [
        {
            "definition": "Busy or occupied",
            "pos": "adjective",
            "sent1": "She was engaged in her work all day.",
            "sent2": "The students were engaged in a group project.",
            "sent3": "The busy squirrel was engaged in gathering nuts for the winter.",
            "sent4": "The bustling city streets were engaged with people rushing to work.",
            "sent5": "The factory was engaged in producing new toys for the holiday season."
        },
        {
            "definition": "Committed to a task or activity",
            "pos": "adjective",
            "sent1": "He is engaged in completing his homework before dinner.",
            "sent2": "The team was engaged in training for the upcoming match.",
            "sent3": "The determined athlete was engaged in breaking his own record.",
            "sent4": "The dedicated volunteers were engaged in helping the community.",
            "sent5": "The focused artist was engaged in perfecting her painting skills."
        },
        {
            "definition": "Involved in a romantic relationship",
            "pos": "adjective",
            "sent1": "They looked deeply engaged in each other's eyes.",
            "sent2": "The couple seemed engaged in a heartfelt conversation.",
            "sent3": "The lovebirds were engaged in planning their future together.",
            "sent4": "The romantic movie had the audience engaged in tears and laughter.",
            "sent5": "The young couple was engaged in a sweet embrace under the stars."
        },
        {
            "definition": "Attracting and holding attention",
            "pos": "adjective",
            "sent1": "The magician's tricks kept the audience engaged throughout the show.",
            "sent2": "The colorful artwork in the gallery was engaging and kept visitors interested.",
            "sent3": "The lively music engaged the crowd in a joyful dance.",
            "sent4": "The captivating story had readers engaged from the first page.",
            "sent5": "The charismatic speaker engaged the audience with his inspiring words."
        },
        {
            "definition": "Involved in conflict or battle",
            "pos": "adjective",
            "sent1": "The two armies were engaged in a fierce battle on the battlefield.",
            "sent2": "The rival gangs were engaged in a heated confrontation.",
            "sent3": "The superheroes were engaged in an epic fight against the villains.",
            "sent4": "The warring nations were engaged in negotiations to achieve peace.",
            "sent5": "The knights were engaged in a duel to prove their valor."
        }
    ]
}