{
    "term": "engine",
    "meanings": [
        {
            "definition": "A machine with moving parts that converts power into motion.",
            "pos": "noun",
            "sent1": "The engine of the car made a loud noise.",
            "sent2": "The train's engine pulled the carriages along the tracks.",
            "sent3": "The engine in the boat seemed to have a mind of its own, spluttering and coughing.",
            "sent4": "Her determination was the engine that drove her to success.",
            "sent5": "The engine roared to life, propelling the plane into the sky."
        },
        {
            "definition": "A locomotive or other vehicle powered by an engine.",
            "pos": "noun",
            "sent1": "The steam engine chugged along the tracks.",
            "sent2": "The ship's engine hummed as it sailed across the ocean.",
            "sent3": "The engine on the old train had a habit of whistling at unexpected times.",
            "sent4": "His passion was the engine that drove him to explore new places.",
            "sent5": "The engine's rhythmic beat echoed through the valley."
        },
        {
            "definition": "A person who designs, builds, or maintains engines.",
            "pos": "noun",
            "sent1": "The engine expert knew exactly how to fix the problem.",
            "sent2": "The skilled engine mechanic repaired the broken parts.",
            "sent3": "The engine specialist could hear a car approaching from miles away.",
            "sent4": "She was the engine behind the innovative engine designs.",
            "sent5": "The engine guru was sought after for their knowledge and expertise."
        },
        {
            "definition": "A machine or device that is used to produce a particular result.",
            "pos": "noun",
            "sent1": "The printing engine churned out copies of the document.",
            "sent2": "The engine of creativity sparked new ideas in the team.",
            "sent3": "The engine for generating ideas seemed to be stuck in neutral that day.",
            "sent4": "His words were the engine that drove change in the organization.",
            "sent5": "The engine of innovation never seemed to run out of fuel."
        }
    ]
}