{
    "term": "engrossment",
    "meanings": [
        {
            "definition": "The act of occupying completely or absorbing one's attention.",
            "pos": "noun",
            "sent1": "Her engrossment in the book was so intense that she lost track of time.",
            "sent2": "His engrossment in the movie was evident from the way he didn't notice anyone entering the room.",
            "sent3": "The cat's engrossment in chasing a laser pointer provided endless entertainment for the family.",
            "sent4": "The engrossment of the audience in the magician's performance was like a spell that couldn't be broken.",
            "sent5": "The engrossment of the students in the science experiment was palpable as they eagerly awaited the results."
        },
        {
            "definition": "The state of being fully involved or immersed in something.",
            "pos": "noun",
            "sent1": "His engrossment in the video game was so deep that he didn't hear his mom calling him for dinner.",
            "sent2": "The engrossment of the children in building sandcastles on the beach was a joy to watch.",
            "sent3": "The puppy's engrossment in chasing its tail was both amusing and adorable.",
            "sent4": "The engrossment of the hikers in the breathtaking view from the mountaintop was like being in a dream.",
            "sent5": "The engrossment of the artist in painting the masterpiece was evident in every brushstroke."
        },
        {
            "definition": "A legal document or instrument that is written in a formal and elaborate manner.",
            "pos": "noun",
            "sent1": "The engrossment of the contract was signed by both parties, finalizing the deal.",
            "sent2": "The lawyer presented the engrossment of the will to the family with solemnity.",
            "sent3": "The engrossment of the deed to the property was framed and displayed in the office.",
            "sent4": "The engrossment of the constitution was a symbol of the nation's unity and values.",
            "sent5": "The engrossment of the diploma was a proud moment for the graduate, marking years of hard work."
        }
    ]
}