{
    "term": "enlightened",
    "meanings": [
        {
            "definition": "Having knowledge or understanding",
            "pos": "adjective",
            "sent1": "The teacher's explanation left the students feeling enlightened about the topic.",
            "sent2": "She felt enlightened after reading the informative book.",
            "sent3": "The cat looked at the puzzle with an enlightened expression, as if it understood the solution.",
            "sent4": "The sunrise painted the sky in an enlightened glow, bringing clarity to the morning.",
            "sent5": "The wise old owl's eyes shone with an enlightened wisdom that captivated the forest creatures."
        },
        {
            "definition": "Free from ignorance or prejudice",
            "pos": "adjective",
            "sent1": "After learning about different cultures, she became more enlightened and accepting.",
            "sent2": "The community worked together to create an enlightened environment for all.",
            "sent3": "The dog's behavior towards the new puppy was surprisingly enlightened, showing no signs of jealousy.",
            "sent4": "Her mind was an enlightened canvas, free from the dark shadows of bias.",
            "sent5": "The garden bloomed with an enlightened beauty, embracing diversity in every flower."
        },
        {
            "definition": "To give spiritual insight or knowledge",
            "pos": "verb",
            "sent1": "The guru enlightened his followers with profound teachings on inner peace.",
            "sent2": "The ancient scrolls were said to hold secrets that could enlighten any seeker.",
            "sent3": "The comedian's joke about meditation unexpectedly enlightened the audience on the benefits of mindfulness.",
            "sent4": "Her words were like a beacon, enlightening all who listened with newfound understanding.",
            "sent5": "The stars above seemed to dance, enlightening the night with their celestial wisdom."
        }
    ]
}