{
    "term": "entailment",
    "meanings": [
        {
            "definition": "The act of entailing or the state of being entailed.",
            "pos": "noun",
            "sent1": "The entailment of the contract required both parties to fulfill their obligations.",
            "sent2": "In her will, the entailment of the estate was passed down to her children.",
            "sent3": "The mix-up at the bakery resulted in a comical entailment of receiving double the ordered pastries.",
            "sent4": "The entailment of neglecting regular maintenance is a sudden breakdown of the machinery.",
            "sent5": "The entailment of skipping breakfast is feeling hungry and tired by mid-morning."
        },
        {
            "definition": "Something that is entailed, such as a property or inheritance.",
            "pos": "noun",
            "sent1": "The valuable antique was a significant entailment in the family's possessions.",
            "sent2": "The entailment of the house was disputed among the siblings after their parents passed away.",
            "sent3": "Finding a hidden treasure chest in the attic was an unexpected entailment during the house renovation.",
            "sent4": "The entailment of the rare painting added a touch of elegance to the art collection.",
            "sent5": "The entailment of the family heirloom brought back cherished memories of generations past."
        },
        {
            "definition": "A logical consequence or implication.",
            "pos": "noun",
            "sent1": "The entailment of missing the train was being late for the important meeting.",
            "sent2": "The entailment of studying hard is achieving good grades in school.",
            "sent3": "The entailment of forgetting your umbrella is getting caught in the rain.",
            "sent4": "The entailment of investing wisely is securing a stable financial future.",
            "sent5": "The entailment of practicing regularly is improving your skills over time."
        }
    ]
}