{
    "term": "enthrone",
    "meanings": [
        {
            "definition": "To install (a monarch) on a throne.",
            "pos": "verb",
            "sent1": "The king's subjects gathered to enthrone him on the grand throne.",
            "sent2": "The ceremony to enthrone the new queen was filled with pomp and tradition.",
            "sent3": "The royal cat tried to enthrone itself on the throne, much to the amusement of the courtiers.",
            "sent4": "In the game of chess, the queen piece can enthrone itself as the most powerful on the board.",
            "sent5": "The act of enthroneing a ruler symbolizes their authority and power over the kingdom."
        },
        {
            "definition": "To invest with sovereign power.",
            "pos": "verb",
            "sent1": "The ancient ritual was meant to enthrone the tribal chief as the leader of the community.",
            "sent2": "The constitution enthroneed the president with the authority to make important decisions.",
            "sent3": "The magical amulet was believed to enthrone its wearer with mystical powers beyond imagination.",
            "sent4": "The legendary sword was said to enthrone its wielder as the rightful ruler of the land.",
            "sent5": "The crown symbolizes the responsibility enthroneed upon the monarch to rule with wisdom and fairness."
        },
        {
            "definition": "To place on a throne.",
            "pos": "verb",
            "sent1": "The loyal subjects helped enthrone the young prince on the throne after his father's passing.",
            "sent2": "The sculptor carefully enthroneed the statue of the goddess in the temple.",
            "sent3": "The mischievous court jester tried to enthrone a duck on the throne as a prank.",
            "sent4": "The ancient prophecy foretold a hero who would enthrone the lost queen back on her rightful seat.",
            "sent5": "The throne room was adorned with jewels to enthrone the ruler in a setting of grandeur and opulence."
        }
    ]
}