{
    "term": "entrench",
    "meanings": [
        {
            "definition": "Establish (an attitude, habit, or belief) so firmly that change is very difficult or unlikely.",
            "pos": "verb",
            "sent1": "She managed to entrench the idea of kindness in her students' minds.",
            "sent2": "It is important to entrench good manners in children from a young age.",
            "sent3": "The cat seemed to entrench the habit of napping in the sun every afternoon.",
            "sent4": "The song's catchy tune entrenches itself in your head and refuses to leave.",
            "sent5": "The memory of her laughter entrenches itself in my heart, never to be forgotten."
        },
        {
            "definition": "Establish (a person or their authority) in a position of great strength or security.",
            "pos": "verb",
            "sent1": "The king sought to entrench his power by building strong alliances.",
            "sent2": "The new manager worked hard to entrench herself as a respected leader in the company.",
            "sent3": "The magician tried to entrench his authority over the rabbits in his hat.",
            "sent4": "The general's strategic moves entrench him as a formidable leader on the battlefield.",
            "sent5": "The CEO's innovative ideas entrench the company's position in the market."
        },
        {
            "definition": "To place within a trench, or in a strong defensive position.",
            "pos": "verb",
            "sent1": "The soldiers were ordered to entrench themselves along the border.",
            "sent2": "During the war, it was crucial to entrench the troops in secure locations.",
            "sent3": "The squirrels decided to entrench their acorn stash in a hidden spot.",
            "sent4": "The castle was entrenching itself against any potential invaders.",
            "sent5": "The fort was entrenching its defenses to withstand the upcoming siege."
        }
    ]
}