{
    "term": "entry",
    "meanings": [
        {
            "definition": "The act of entering",
            "pos": "noun",
            "sent1": "Her entry into the room was graceful.",
            "sent2": "Please make your entry through the main door.",
            "sent3": "His entry onto the dance floor was like a swan gliding on water.",
            "sent4": "The entry of sunlight through the window brightened up the whole room.",
            "sent5": "The entry of the new student brought a wave of excitement to the class."
        },
        {
            "definition": "A passage or doorway for entering",
            "pos": "noun",
            "sent1": "The narrow entry to the cave made it feel mysterious.",
            "sent2": "The grand entry of the palace was adorned with intricate carvings.",
            "sent3": "The cat's entry through the pet door startled the dog.",
            "sent4": "The entry to success is often through hard work and dedication.",
            "sent5": "The entry to the secret garden was hidden behind a wall of ivy."
        },
        {
            "definition": "A record or item in a list or database",
            "pos": "noun",
            "sent1": "His entry in the attendance sheet was marked with a red pen.",
            "sent2": "The entry for the competition must be submitted before the deadline.",
            "sent3": "The entry of the wrong data caused confusion in the report.",
            "sent4": "Her entry in the guestbook was filled with compliments and well wishes.",
            "sent5": "The entry of the new product in the catalog boosted sales."
        },
        {
            "definition": "A person or team participating in a competition",
            "pos": "noun",
            "sent1": "The team's entry in the tournament surprised everyone with their skill.",
            "sent2": "His entry in the race was met with cheers from the crowd.",
            "sent3": "The cat's entry in the pet show won the hearts of the judges.",
            "sent4": "Her entry in the baking contest impressed the judges with her creativity.",
            "sent5": "The entry of the underdog team in the championship game led to an unexpected victory."
        }
    ]
}