{
    "term": "epicenism",
    "meanings": [
        {
            "definition": "The state of being epicene or of having characteristics of both sexes.",
            "pos": "noun",
            "sent1": "In the play, the character's epicenism was evident through their mannerisms and appearance.",
            "sent2": "The fashion designer aimed to create clothing that embraced epicenism, appealing to all genders.",
            "sent3": "At the costume party, his epicenism costume confused everyone, leading to many laughs.",
            "sent4": "Her writing style had an epicenism about it, blending masculine and feminine tones seamlessly.",
            "sent5": "The artist's sculpture symbolized epicenism, showcasing a perfect balance of male and female features."
        },
        {
            "definition": "The quality of being suitable for either sex.",
            "pos": "noun",
            "sent1": "The epicenism of the perfume made it a popular choice for both men and women.",
            "sent2": "The new unisex clothing line was praised for its epicenism, catering to a diverse range of customers.",
            "sent3": "The epicenism of the hairstyle allowed it to be worn by anyone, regardless of gender.",
            "sent4": "The restaurant's decor had an epicenism that made it welcoming to all patrons.",
            "sent5": "The marketing campaign emphasized the epicenism of the product, highlighting its universal appeal."
        },
        {
            "definition": "A gender-neutral or non-binary identity.",
            "pos": "noun",
            "sent1": "Their epicenism allowed them to express their identity authentically.",
            "sent2": "The school's policy on uniforms embraced epicenism, respecting students of all gender identities.",
            "sent3": "The epicenism of the new employee surprised their colleagues, who had never met someone like them before.",
            "sent4": "The artist's music celebrated epicenism, promoting inclusivity and diversity.",
            "sent5": "The community center provided a safe space for those exploring epicenism and non-binary identities."
        }
    ]
}