{
    "term": "epigonisms",
    "meanings": [
        {
            "definition": "Epigonisms: the practice of imitating or copying the style or ideas of a more established writer or artist.",
            "pos": "noun",
            "sent1": "Her epigonisms in painting were evident in the way she mimicked the brush strokes of famous artists.",
            "sent2": "The novel was criticized for its lack of originality, filled with epigonisms of classic literature.",
            "sent3": "John's epigonisms in poetry made him the subject of many jokes among his friends.",
            "sent4": "The film director's epigonisms of Hitchcock's suspenseful style added a thrilling touch to the movie.",
            "sent5": "The art exhibition was a sea of epigonisms, with each piece resembling a famous masterpiece."
        },
        {
            "definition": "Epigonisms: a work of literature, art, or music that is derivative or unoriginal.",
            "pos": "noun",
            "sent1": "The painting was dismissed as an epigonism of a famous artist's style.",
            "sent2": "The song's lyrics were criticized for being mere epigonisms of popular hits.",
            "sent3": "The play was a hilarious parody filled with intentional epigonisms of famous playwrights.",
            "sent4": "The sculpture stood out in the gallery for its bold rejection of traditional epigonisms.",
            "sent5": "The museum displayed a collection of epigonisms, showcasing the evolution of artistic imitation."
        },
        {
            "definition": "Epigonisms: a person who imitates or copies the work of a more established writer or artist.",
            "pos": "noun",
            "sent1": "She was known in the art community as an epigonism, always replicating famous paintings.",
            "sent2": "The young writer was labeled an epigonism for constantly emulating the style of a renowned novelist.",
            "sent3": "The comedian's performance was a clever satire on epigonisms in the entertainment industry.",
            "sent4": "He saw himself not as an epigonism but as a tribute to the literary giants who inspired him.",
            "sent5": "The art school welcomed all epigonisms, encouraging students to learn from established masters."
        }
    ]
}