{
    "term": "epiphany",
    "meanings": [
        {
            "definition": "A sudden realization or understanding.",
            "pos": "noun",
            "sent1": "After hours of confusion, she had an epiphany and finally understood the math problem.",
            "sent2": "His epiphany about the importance of kindness changed his perspective on life.",
            "sent3": "During the boring lecture, he had an epiphany about a funny joke he heard earlier.",
            "sent4": "The epiphany hit her like a bolt of lightning, illuminating the solution to her problem.",
            "sent5": "The epiphany was like a light bulb turning on in his mind, making everything clear."
        },
        {
            "definition": "A moment of sudden revelation or insight.",
            "pos": "noun",
            "sent1": "The artist had an epiphany and suddenly knew how to finish his painting.",
            "sent2": "Her epiphany about the plot twist in the movie came right before the climax.",
            "sent3": "In the middle of the night, he had an epiphany about a new invention.",
            "sent4": "The epiphany struck him like a thunderbolt, revealing the solution to his problem.",
            "sent5": "The epiphany felt like a burst of fireworks in her mind, bringing clarity to the situation."
        },
        {
            "definition": "A Christian festival celebrating the manifestation of the divine nature of Jesus to the Gentiles as represented by the Magi.",
            "pos": "noun",
            "sent1": "The church choir sang beautifully during the Epiphany service.",
            "sent2": "On Epiphany, the congregation gathered to commemorate the visit of the Magi.",
            "sent3": "During the Epiphany play, the children dressed up as the three wise men.",
            "sent4": "The Epiphany celebration included a reenactment of the Magi's journey.",
            "sent5": "The Epiphany feast was a joyous occasion for the community to come together."
        }
    ]
}