{
    "term": "epistomes",
    "meanings": [
        {
            "definition": "A structure resembling a mouth on the surface of certain invertebrates.",
            "pos": "noun",
            "sent1": "The epistomes of the tiny sea creatures helped them catch food.",
            "sent2": "Scientists study the epistomes of different invertebrates to understand their feeding habits.",
            "sent3": "The curious child thought the epistomes on the bugs looked like tiny doors.",
            "sent4": "The epistomes of the jellyfish opened and closed like miniature trapdoors.",
            "sent5": "In the dark cave, the glowing epistomes of the creatures looked eerie and fascinating."
        },
        {
            "definition": "A lid or covering over the mouth of a gastropod mollusk.",
            "pos": "noun",
            "sent1": "The snail's epistomes protected its delicate mouth from harm.",
            "sent2": "The biologist carefully observed the epistomes of the snails in the lab.",
            "sent3": "The chef joked that the snail's epistomes were like tiny hats for their mouths.",
            "sent4": "As the snail moved, its epistomes fluttered like miniature umbrellas.",
            "sent5": "The shiny epistomes of the snails glistened in the sunlight, resembling small shields."
        },
        {
            "definition": "A valve-like structure in certain bryozoans.",
            "pos": "noun",
            "sent1": "The bryozoan's epistomes regulated the flow of water into its body.",
            "sent2": "Researchers discovered unique patterns on the epistomes of bryozoans in the ocean.",
            "sent3": "The playful otter tried to use the bryozoan's epistomes as tiny doors to enter its home.",
            "sent4": "The epistomes of the bryozoans acted like gates, controlling the movement of nutrients.",
            "sent5": "Under the microscope, the intricate design of the bryozoan's epistomes was mesmerizing."
        }
    ]
}