{
    "term": "equipped",
    "meanings": [
        {
            "definition": "Provide with the necessary items for a particular purpose.",
            "pos": "verb",
            "sent1": "The mechanic equipped his toolbox with all the tools he needed for the job.",
            "sent2": "She always makes sure to equip herself with knowledge before starting a new project.",
            "sent3": "The chef equipped his kitchen with the finest ingredients, ready to create culinary masterpieces.",
            "sent4": "The explorer equipped his backpack with essentials, like a compass and a flashlight, for the journey ahead.",
            "sent5": "The team equipped the campsite with tents, sleeping bags, and cooking utensils for the overnight stay."
        },
        {
            "definition": "Furnished with necessary tools or supplies.",
            "pos": "adjective",
            "sent1": "The carpenter's workshop was equipped with various saws and hammers.",
            "sent2": "The hiker was well-equipped with a map, water bottle, and hiking boots.",
            "sent3": "The detective felt equipped with clues to solve the mystery.",
            "sent4": "The student felt equipped with knowledge after studying for the exam.",
            "sent5": "The kitchen was equipped with pots, pans, and utensils for cooking meals."
        },
        {
            "definition": "Prepared mentally or physically for a particular task or situation.",
            "pos": "adjective",
            "sent1": "The athlete felt equipped with determination to win the race.",
            "sent2": "She was equipped with confidence to give a presentation in front of a large audience.",
            "sent3": "The superhero felt equipped with superpowers to save the city from danger.",
            "sent4": "The firefighter felt equipped with bravery to enter the burning building.",
            "sent5": "The student felt equipped with focus to ace the exam."
        }
    ]
}