{
    "term": "erect",
    "meanings": [
        {
            "definition": "Upright in position or posture",
            "pos": "adjective",
            "sent1": "The flag was erect on top of the pole.",
            "sent2": "She stood erect with her shoulders back.",
            "sent3": "The toy soldier always stays erect, never slouching.",
            "sent4": "His erect stance showed confidence and pride.",
            "sent5": "The tree stood tall and erect in the forest."
        },
        {
            "definition": "To construct or build",
            "pos": "verb",
            "sent1": "The workers will erect a new building downtown.",
            "sent2": "They plan to erect a fence around the garden.",
            "sent3": "It took them hours to erect the tent due to strong winds.",
            "sent4": "The team will erect a strong defense against their opponents.",
            "sent5": "The company will erect a statue in the park to honor the founder."
        },
        {
            "definition": "To set up or establish",
            "pos": "verb",
            "sent1": "They will erect a new rule for safety in the workplace.",
            "sent2": "The government plans to erect a new law to protect the environment.",
            "sent3": "The students will erect a club for astronomy enthusiasts.",
            "sent4": "She will erect a successful business in the city.",
            "sent5": "The team will erect a plan for the upcoming project."
        },
        {
            "definition": "To cause to become rigid or firm",
            "pos": "verb",
            "sent1": "The cold weather can erect the hairs on your arms.",
            "sent2": "The fear of heights can erect a person's spine.",
            "sent3": "The unexpected news can erect goosebumps on your skin.",
            "sent4": "The loud noise can erect a cat's fur in fear.",
            "sent5": "The thrilling movie can erect excitement in the audience."
        }
    ]
}