{
    "term": "ergonovines",
    "meanings": [
        {
            "definition": "A type of ergot alkaloid used in medicine to induce contractions in the uterus.",
            "pos": "noun",
            "sent1": "The doctor prescribed ergonovines to help with labor pains.",
            "sent2": "After giving birth, the nurse administered ergonovines to prevent excessive bleeding.",
            "sent3": "The hospital staff joked that the stork must have brought a truckload of ergonovines for all the new moms.",
            "sent4": "Her determination to succeed was like a powerful dose of ergonovines, pushing her through any obstacles.",
            "sent5": "The image of ergonovines working like tiny construction workers inside the body stuck in her mind."
        },
        {
            "definition": "The plural form of ergonovine, a medication used to treat postpartum bleeding.",
            "pos": "noun",
            "sent1": "The pharmacy stocked up on ergonovines to meet the demand from new mothers.",
            "sent2": "Doctors often recommend ergonovines for women experiencing postpartum hemorrhage.",
            "sent3": "The nurse playfully juggled the bottles of ergonovines, pretending they were magic potions.",
            "sent4": "The effect of the medication was like a wave of ergonovines, stopping the bleeding in its tracks.",
            "sent5": "The thought of ergonovines acting as tiny superheroes in the body made her smile."
        },
        {
            "definition": "The act of administering ergonovines to a patient.",
            "pos": "noun",
            "sent1": "Her expertise in ergonovines administration made her a valuable member of the medical team.",
            "sent2": "The hospital protocol required proper training for ergonovines administration.",
            "sent3": "The clumsy intern accidentally spilled the ergonovines during the administration process.",
            "sent4": "The precision required in ergonovines administration was akin to a delicate dance.",
            "sent5": "The sound of ergonovines being administered echoed through the quiet hospital room."
        }
    ]
}