{
    "term": "ergotisms",
    "meanings": [
        {
            "definition": "The presence of ergot in grains, causing poisoning in humans and animals.",
            "pos": "noun",
            "sent1": "The ergotisms in the wheat led to illness in the villagers.",
            "sent2": "Farmers were concerned about the ergotisms affecting their livestock.",
            "sent3": "The baker mistakenly used flour with ergotisms, resulting in a comical mix-up at the bakery.",
            "sent4": "The spread of ergotisms through the crops was like a silent poison creeping into the food chain.",
            "sent5": "The dangers of ergotisms in grains were highlighted in the health seminar."
        },
        {
            "definition": "The condition of being affected by ergot poisoning.",
            "pos": "noun",
            "sent1": "After consuming contaminated bread, the town experienced a wave of ergotisms.",
            "sent2": "The doctor diagnosed the patient with ergotisms after recognizing the symptoms.",
            "sent3": "Despite feeling unwell, the farmer couldn't help but chuckle at his own ergotisms.",
            "sent4": "The town's sudden outbreak of ergotisms was a wake-up call for food safety measures.",
            "sent5": "The severity of ergotisms in the region prompted urgent action from health authorities."
        },
        {
            "definition": "The symptoms or effects of ergot poisoning.",
            "pos": "noun",
            "sent1": "The hospital treated several cases of ergotisms with care and expertise.",
            "sent2": "Ergotisms can manifest differently in individuals depending on exposure levels.",
            "sent3": "Despite the discomfort, the child found humor in the peculiar symptoms of ergotisms.",
            "sent4": "The community's struggle with ergotisms was a stark reminder of the importance of food safety.",
            "sent5": "The vivid descriptions of ergotisms in historical texts painted a grim picture of the past."
        }
    ]
}