{
    "term": "eros",
    "meanings": [
        {
            "definition": "The Greek god of love and sexual desire.",
            "pos": "noun",
            "sent1": "In Greek mythology, Eros is often depicted as a mischievous winged god.",
            "sent2": "Many ancient stories revolve around the adventures of Eros and his arrows of love.",
            "sent3": "During the festival, children dressed up as Eros and spread joy and love.",
            "sent4": "Her eyes sparkled with an Eros-like charm that captivated everyone around her.",
            "sent5": "The painting captured the essence of Eros, with vibrant colors symbolizing love and desire."
        },
        {
            "definition": "Intense emotional attachment or attraction.",
            "pos": "noun",
            "sent1": "Their relationship was filled with an eros that bound them together through thick and thin.",
            "sent2": "The movie portrayed a beautiful story of eros between the two main characters.",
            "sent3": "Despite their arguments, there was an undeniable eros that kept them connected.",
            "sent4": "The music resonated with an eros that touched the hearts of everyone in the audience.",
            "sent5": "The sunset painted the sky with hues of eros, evoking feelings of warmth and closeness."
        },
        {
            "definition": "The sum of life-preserving instincts that are manifested as impulses to gratify basic needs, as sublimated impulses, and as impulses to protect and preserve the body and mind.",
            "pos": "noun",
            "sent1": "Eros drives us to seek food when we are hungry and rest when we are tired.",
            "sent2": "The survival instinct is a crucial aspect of eros that ensures our well-being.",
            "sent3": "In a moment of danger, eros compels us to act swiftly to protect ourselves.",
            "sent4": "The eros for self-preservation is deeply ingrained in our subconscious.",
            "sent5": "The primal eros within us guides our actions to maintain our health and safety."
        }
    ]
}