{
    "term": "errhine",
    "meanings": [
        {
            "definition": "Causing sneezing",
            "pos": "adjective",
            "sent1": "The strong perfume was errhine, making everyone in the room sneeze.",
            "sent2": "The errhine pollen triggered my allergies, causing me to sneeze uncontrollably.",
            "sent3": "The errhine powder was so potent that even the statues in the garden seemed to sneeze.",
            "sent4": "The comedian's jokes were like errhine triggers, causing the audience to burst into sneezes of laughter.",
            "sent5": "The chef's spicy dish had an errhine effect, making diners sneeze with delight."
        },
        {
            "definition": "A substance that causes sneezing",
            "pos": "noun",
            "sent1": "She carried an errhine in her pocket to use as a prank on her friends.",
            "sent2": "The errhine was so strong that it cleared out the entire classroom with sneezes.",
            "sent3": "The mischievous child sprinkled errhine on the teacher's chair, causing a sneezing frenzy.",
            "sent4": "The magician's errhine powder made the audience sneeze in amazement as it disappeared into thin air.",
            "sent5": "The ancient Egyptians believed that errhines had magical properties, capable of warding off evil spirits with sneezes."
        },
        {
            "definition": "To use a substance to cause sneezing",
            "pos": "verb",
            "sent1": "He would errhine the flowers in the garden to keep pests away.",
            "sent2": "The prankster decided to errhine his roommate's pillow with pepper, leading to a sneezing fit.",
            "sent3": "The chef accidentally errhined the soup with too much pepper, causing the entire restaurant to sneeze.",
            "sent4": "The evil sorcerer would errhine his enemies with enchanted powders, making them sneeze uncontrollably.",
            "sent5": "The old tradition of errhining the entrance of a new home was believed to bring good luck and ward off evil spirits with sneezes."
        }
    ]
}