{
    "term": "erstwhile",
    "meanings": [
        {
            "definition": "Formerly",
            "pos": "adverb",
            "sent1": "She erstwhile worked as a teacher before becoming a nurse.",
            "sent2": "He was erstwhile a student at the university.",
            "sent3": "The cat, erstwhile a stray, now enjoys a life of luxury with its new family.",
            "sent4": "The castle, erstwhile a symbol of power, now stands in ruins.",
            "sent5": "The town, erstwhile bustling with activity, now seemed deserted."
        },
        {
            "definition": "Previous",
            "pos": "adjective",
            "sent1": "Her erstwhile boss was known for being strict.",
            "sent2": "The team's erstwhile captain retired last season.",
            "sent3": "The erstwhile owner of the house left behind a hidden treasure.",
            "sent4": "The erstwhile champion was dethroned in a surprising turn of events.",
            "sent5": "The erstwhile record holder was surpassed by a new athlete."
        },
        {
            "definition": "Former",
            "pos": "adjective",
            "sent1": "The erstwhile president gave a speech at the event.",
            "sent2": "The erstwhile owner of the store passed it down to his son.",
            "sent3": "The erstwhile singer now leads a quiet life away from the spotlight.",
            "sent4": "The erstwhile best friend betrayed her trust.",
            "sent5": "The erstwhile favorite restaurant closed down due to financial difficulties."
        },
        {
            "definition": "Once",
            "pos": "adverb",
            "sent1": "I erstwhile visited that city when I was a child.",
            "sent2": "The garden was erstwhile a beautiful sight to behold.",
            "sent3": "The toy, erstwhile cherished, now lay forgotten in the attic.",
            "sent4": "The river, erstwhile calm, began to flood after heavy rains.",
            "sent5": "The clock, erstwhile ticking, suddenly stopped working."
        }
    ]
}