{
    "term": "escaped",
    "meanings": [
        {
            "definition": "To get away; to break free",
            "pos": "verb",
            "sent1": "The rabbit escaped from the cage by digging a hole under the fence.",
            "sent2": "The prisoner escaped from the jail by climbing over the wall.",
            "sent3": "The mischievous cat escaped from the house and was found napping in the neighbor's garden.",
            "sent4": "Her laughter escaped like a flock of birds, filling the room with joy.",
            "sent5": "The butterfly's vibrant colors escaped into the air as it fluttered away."
        },
        {
            "definition": "To avoid capture or punishment",
            "pos": "verb",
            "sent1": "The clever fox escaped the hunter's trap by outsmarting him.",
            "sent2": "The thief narrowly escaped the police by blending into the crowd.",
            "sent3": "The student escaped detention by pretending to be sick.",
            "sent4": "His guilt escaped detection for years until the truth finally came out.",
            "sent5": "The secret agent skillfully escaped capture by disappearing into the shadows."
        },
        {
            "definition": "To leak or seep out",
            "pos": "verb",
            "sent1": "Water escaped through the crack in the dam, causing a small flood.",
            "sent2": "The aroma of freshly baked cookies escaped from the kitchen and filled the house.",
            "sent3": "The news of the surprise party accidentally escaped during lunch, spoiling the surprise.",
            "sent4": "Time seemed to escape through his fingers like sand, slipping away too quickly.",
            "sent5": "The scent of wildflowers escaped from the meadow, carried by the gentle breeze."
        },
        {
            "definition": "To be omitted or overlooked",
            "pos": "verb",
            "sent1": "Her name was accidentally escaped from the guest list for the party.",
            "sent2": "The error in the report escaped the editor's attention until it was too late.",
            "sent3": "The missing ingredient escaped her notice, resulting in a failed recipe.",
            "sent4": "The subtle hint in his words escaped her understanding, leaving her puzzled.",
            "sent5": "The small detail escaped his memory, causing confusion during the presentation."
        }
    ]
}