{
    "term": "escape",
    "meanings": [
        {
            "definition": "To break free from confinement or control.",
            "pos": "verb",
            "sent1": "The prisoner tried to escape through the window.",
            "sent2": "The cat managed to escape from the room.",
            "sent3": "The mischievous squirrel found a way to escape the bird feeder.",
            "sent4": "Her laughter was an escape from the seriousness of the meeting.",
            "sent5": "The butterfly's colorful wings made its escape from the net even more beautiful."
        },
        {
            "definition": "A means of breaking free from confinement or control.",
            "pos": "noun",
            "sent1": "The key was his escape from the locked room.",
            "sent2": "The tunnel served as their escape from the prison.",
            "sent3": "The secret passage was a clever escape from the castle.",
            "sent4": "Music became her escape from the stress of daily life.",
            "sent5": "The hot air balloon provided a thrilling escape from the ground."
        },
        {
            "definition": "To avoid or evade something unpleasant.",
            "pos": "verb",
            "sent1": "She tried to escape the rain by running under a tree.",
            "sent2": "The mouse managed to escape the cat's claws.",
            "sent3": "The student tried to escape doing his homework by pretending to be sick.",
            "sent4": "His mind would often escape to happier memories during tough times.",
            "sent5": "The scent of fresh flowers helped her escape the smell of the garbage truck."
        },
        {
            "definition": "A way of avoiding or evading something unpleasant.",
            "pos": "noun",
            "sent1": "Reading was her escape from the stress of work.",
            "sent2": "Taking long walks in nature was his escape from city life.",
            "sent3": "The comedy show provided a much-needed escape from reality.",
            "sent4": "The painting served as an escape from the monotony of everyday routines.",
            "sent5": "The beach was a perfect escape from the hustle and bustle of the city."
        }
    ]
}