{
    "term": "escheats",
    "meanings": [
        {
            "definition": "Reversion of property to the state when the owner dies without heirs.",
            "pos": "noun",
            "sent1": "When the old man passed away with no family, the house escheats to the government.",
            "sent2": "In history class, we learned about escheats and how they occur when someone has no heirs.",
            "sent3": "The story of the lonely king who left behind a kingdom that escheated to the kingdom next door was quite a tale.",
            "sent4": "The abandoned mansion stood as a silent reminder of the escheat that took place after the last heir vanished.",
            "sent5": "The concept of escheats can be confusing, but it basically means the state gets the property if no one else can inherit it."
        },
        {
            "definition": "To revert to the state as an escheat.",
            "pos": "verb",
            "sent1": "If the owner doesn't have any heirs, the property escheats to the government.",
            "sent2": "When a person passes away without leaving a will, their estate escheats according to the law.",
            "sent3": "The old car, forgotten in the garage, seemed to escheat to nature as vines started growing around it.",
            "sent4": "Time seemed to escheat the memories of the town's founding, leaving only faint traces of the past.",
            "sent5": "The abandoned building slowly escheated into disrepair, becoming a shadow of its former self."
        },
        {
            "definition": "The right of the state to take possession of property when the owner dies without heirs.",
            "pos": "noun",
            "sent1": "The law grants the government the escheats to unclaimed property in certain situations.",
            "sent2": "Escheats ensure that assets do not remain in limbo when there are no rightful heirs.",
            "sent3": "The comedy sketch about the state's right to escheat property had the audience in stitches.",
            "sent4": "In the game of Monopoly, players can experience the power of escheats when landing on unclaimed properties.",
            "sent5": "The concept of escheats serves as a safety net to prevent property from being ownerless and unused."
        }
    ]
}