{
    "term": "escheating",
    "meanings": [
        {
            "definition": "To revert to the state as property that has no owner.",
            "pos": "verb",
            "sent1": "When someone passes away without leaving a will, their belongings may escheat to the government.",
            "sent2": "The abandoned house escheated to the city after years of neglect.",
            "sent3": "The lost toy escheated to the youngest sibling, much to their delight.",
            "sent4": "The forgotten treasure chest escheated to the sea, lost forever in its depths.",
            "sent5": "The unclaimed funds escheated to the state treasury, waiting to be claimed by rightful owners."
        },
        {
            "definition": "The process by which property reverts to the state due to lack of heirs.",
            "pos": "noun",
            "sent1": "Escheating occurs when there are no relatives to inherit the estate.",
            "sent2": "The lawyer explained the concept of escheating to the confused family members.",
            "sent3": "The comedy movie had a hilarious scene about escheating a haunted mansion to the ghosts.",
            "sent4": "In the game of Monopoly, landing on an unowned property is like escheating it into your possession.",
            "sent5": "The history book detailed the various cases of escheating throughout the centuries."
        },
        {
            "definition": "The act of taking possession of property that has escheated.",
            "pos": "noun",
            "sent1": "The official document confirmed the escheating of the abandoned land.",
            "sent2": "After the legal process, the city completed the escheating of the unclaimed assets.",
            "sent3": "The children played a game pretending to escheat the lost toys in the park.",
            "sent4": "The entrepreneur saw an opportunity in escheating neglected properties for redevelopment.",
            "sent5": "The museum curator oversaw the escheating of valuable artifacts left behind by unknown donors."
        }
    ]
}