{
    "term": "escheat",
    "meanings": [
        {
            "definition": "To revert to the state, especially property reverting to the state when there are no legal heirs.",
            "pos": "verb",
            "sent1": "When someone dies without any family, their belongings escheat to the government.",
            "sent2": "In some cases, unclaimed assets escheat to the state.",
            "sent3": "The lonely old man joked that if he didn't find a friend soon, his cat would escheat his house.",
            "sent4": "The abandoned house seemed to escheat back to nature, with vines reclaiming the walls.",
            "sent5": "The concept of property escheating to the state was explained in the history class with a simple example."
        },
        {
            "definition": "The reversion of property to the state when there are no legal heirs.",
            "pos": "noun",
            "sent1": "Escheat occurs when there are no rightful heirs to inherit the property.",
            "sent2": "The law dictates the process of escheat for unclaimed estates.",
            "sent3": "The comedy movie had a plot twist where a character unexpectedly received an escheat of a grand estate.",
            "sent4": "The concept of escheat was like a safety net for the state to prevent property from being ownerless forever.",
            "sent5": "The history book explained the significance of escheat in simple terms for the students to understand."
        },
        {
            "definition": "To take property by escheat.",
            "pos": "verb",
            "sent1": "The government may escheat the land if the owner fails to pay taxes for many years.",
            "sent2": "Legal procedures are followed when authorities escheat property for public use.",
            "sent3": "The mischievous kids joked that they would escheat their friend's toy if he didn't share.",
            "sent4": "The company decided to escheat the abandoned warehouse for redevelopment purposes.",
            "sent5": "The concept of escheating property was illustrated in the real estate seminar with practical examples."
        }
    ]
}