{
    "term": "escort",
    "meanings": [
        {
            "definition": "A person or group of people accompanying another for protection, guidance, or courtesy.",
            "pos": "noun",
            "sent1": "The kind escort walked the elderly lady safely across the busy street.",
            "sent2": "The security guard acted as an escort for the VIP guest at the event.",
            "sent3": "The little girl pretended her teddy bear was her escort on the adventure.",
            "sent4": "The stars in the night sky served as a twinkling escort for the moon.",
            "sent5": "The loyal dog was the perfect escort for the blind man, guiding him with care."
        },
        {
            "definition": "To accompany someone as a gesture of courtesy or for protection.",
            "pos": "verb",
            "sent1": "She offered to escort her friend home after the movie to ensure she got there safely.",
            "sent2": "The bodyguard will escort the celebrity through the crowd to shield them from fans.",
            "sent3": "The cat decided to escort the mouse out of the house, showing unexpected kindness.",
            "sent4": "The wind will escort the fallen leaves across the yard in a graceful dance.",
            "sent5": "The knight vowed to escort the princess through the dangerous forest, protecting her from harm."
        },
        {
            "definition": "A person hired to accompany someone socially.",
            "pos": "noun",
            "sent1": "The wealthy businessman always had a stylish escort by his side at events.",
            "sent2": "The actress arrived at the premiere with her escort, turning heads with their elegance.",
            "sent3": "The penguin strutted around the zoo with a fish escort, feeling quite important.",
            "sent4": "The sun made a grand entrance with its radiant escort of colorful clouds.",
            "sent5": "The queen made a regal appearance with her royal escort, impressing all who saw her."
        }
    ]
}