{
    "term": "esparto",
    "meanings": [
        {
            "definition": "A tough, wiry Mediterranean grass used for making ropes and baskets.",
            "pos": "noun",
            "sent1": "The villagers crafted sturdy baskets from esparto to carry their harvest.",
            "sent2": "The sailor relied on esparto ropes to secure the sails during the storm.",
            "sent3": "The mischievous goat got tangled in the esparto basket and hopped around comically.",
            "sent4": "Her determination was as strong as esparto, never bending under pressure.",
            "sent5": "The image of the sun setting over the field of golden esparto grass was unforgettable."
        },
        {
            "definition": "A type of paper made from esparto grass.",
            "pos": "noun",
            "sent1": "The ancient scroll was written on esparto paper, preserving the wisdom of the past.",
            "sent2": "The artist sketched intricate designs on esparto paper, showcasing their talent.",
            "sent3": "The mischievous squirrel used esparto paper to create a tiny hat and amused the onlookers.",
            "sent4": "Her words were as delicate as esparto paper, easily torn by criticism.",
            "sent5": "The texture of esparto paper felt like a gentle breeze against her fingertips."
        },
        {
            "definition": "A plant of the grass family native to southern Europe and northern Africa.",
            "pos": "noun",
            "sent1": "In the botanical garden, the esparto plant stood tall among its companions.",
            "sent2": "The farmer admired the resilience of the esparto plant thriving in the arid soil.",
            "sent3": "The mischievous rabbit nibbled on the esparto plant and hopped away playfully.",
            "sent4": "Her roots were as deep as the esparto plant, firmly anchored in her heritage.",
            "sent5": "The fragrance of the esparto plant filled the air, a reminder of home."
        }
    ]
}