{
    "term": "estating",
    "meanings": [
        {
            "definition": "Present participle of the verb 'estate': to establish or settle something, typically property or assets, in a legal document.",
            "pos": "verb",
            "sent1": "She is estating her inheritance in the will.",
            "sent2": "The lawyer is estating the terms of the contract.",
            "sent3": "By estating her wishes clearly, she avoided confusion.",
            "sent4": "Estating the boundaries of the land was like drawing a map.",
            "sent5": "He was estating his ownership with confidence."
        },
        {
            "definition": "Present participle of the verb 'estate': to make a formal declaration or statement.",
            "pos": "verb",
            "sent1": "They are estating their intentions at the meeting.",
            "sent2": "The president is estating the new policy.",
            "sent3": "Estating their loyalty, they raised their hands.",
            "sent4": "Estating the rules clearly is important for everyone to understand.",
            "sent5": "She was estating her opinion with conviction."
        },
        {
            "definition": "Present participle of the verb 'estate': to estimate or calculate the value of something.",
            "pos": "verb",
            "sent1": "The appraiser is estating the value of the house.",
            "sent2": "Estating the cost of repairs is crucial before buying the car.",
            "sent3": "Estating the price of the antique vase was challenging.",
            "sent4": "Estating the worth of the painting required expertise.",
            "sent5": "She was estating the value of the jewelry with precision."
        },
        {
            "definition": "Present participle of the verb 'estate': to convey or transfer property to someone through a will or legal document.",
            "pos": "verb",
            "sent1": "They are estating the family heirlooms to their children.",
            "sent2": "Estating the house to her niece was a thoughtful gesture.",
            "sent3": "Estating the land to the community brought joy to many.",
            "sent4": "Estating the assets to the beneficiaries was a complex process.",
            "sent5": "She was estating the ownership rights to her sister."
        }
    ]
}