{
    "term": "estrual",
    "meanings": [
        {
            "definition": "relating to or characteristic of estrus",
            "pos": "adjective",
            "sent1": "The cat's behavior became more estrual as she entered her mating season.",
            "sent2": "During the estrual phase, female animals show signs of readiness to mate.",
            "sent3": "The zookeeper joked that the lioness was feeling estrual and looking for a partner.",
            "sent4": "The forest was filled with an estrual energy, signaling the start of the mating season.",
            "sent5": "The scent in the air was unmistakably estrual, drawing in potential mates from afar."
        },
        {
            "definition": "of or relating to the period of sexual receptivity in female mammals",
            "pos": "adjective",
            "sent1": "The estrual period is crucial for successful mating in female mammals.",
            "sent2": "Female dogs exhibit estrual behavior when they are ready to breed.",
            "sent3": "The farm animals seemed to synchronize their estrual cycles, much to the farmer's surprise.",
            "sent4": "The wildlife documentary captured the intense competition during the estrual phase.",
            "sent5": "The researchers observed the hormonal changes that accompany the estrual period in primates."
        },
        {
            "definition": "pertaining to the state of being in heat",
            "pos": "adjective",
            "sent1": "The vet explained the signs of an estrual cat to the pet owner.",
            "sent2": "The mare's estrual behavior indicated she was ready for breeding.",
            "sent3": "The comedy movie portrayed a hilarious mix-up during an estrual dog show.",
            "sent4": "The city park was filled with an estrual atmosphere during the spring season.",
            "sent5": "The zoo visitors could sense the animals' estrual state through their interactions."
        }
    ]
}