{
    "term": "ethnocentricity",
    "meanings": [
        {
            "definition": "The belief in the inherent superiority of one's own ethnic group.",
            "pos": "noun",
            "sent1": "Her ethnocentricity made her think her culture was the best.",
            "sent2": "His ethnocentricity prevented him from appreciating other traditions.",
            "sent3": "The comedy skit humorously portrayed the character's extreme ethnocentricity.",
            "sent4": "His ethnocentricity acted like blinders, limiting his view of the diverse world.",
            "sent5": "The professor's ethnocentricity was so strong, it colored all his interactions."
        },
        {
            "definition": "The tendency to view the world through the lens of one's own cultural background.",
            "pos": "noun",
            "sent1": "Growing up in a small town, his ethnocentricity shaped his perspective.",
            "sent2": "Her ethnocentricity influenced how she interpreted foreign customs.",
            "sent3": "The movie character's ethnocentricity led to some hilarious misunderstandings.",
            "sent4": "His ethnocentricity was like wearing cultural glasses that tinted everything he saw.",
            "sent5": "The book vividly described the protagonist's ethnocentricity and its consequences."
        },
        {
            "definition": "The practice of judging other cultures based on the standards of one's own culture.",
            "pos": "noun",
            "sent1": "Their ethnocentricity made them believe their way of life was the only correct one.",
            "sent2": "The company's ethnocentricity affected their approach to global markets.",
            "sent3": "The sitcom highlighted the characters' comical ethnocentricity when traveling abroad.",
            "sent4": "Her ethnocentricity was a heavy anchor that prevented her from embracing diversity.",
            "sent5": "The painting symbolically represented the artist's ethnocentricity through its narrow focus."
        }
    ]
}