{
    "term": "ethos",
    "meanings": [
        {
            "definition": "The characteristic spirit of a culture, era, or community as manifested in its beliefs and aspirations.",
            "pos": "noun",
            "sent1": "The school's ethos promotes kindness and respect among students.",
            "sent2": "The ethos of the company values honesty and integrity in all dealings.",
            "sent3": "The ethos of the soccer team is to always support each other, even after a loss.",
            "sent4": "In the world of fashion, the ethos of creativity and innovation drives designers to push boundaries.",
            "sent5": "The ethos of the neighborhood watch program is to ensure safety for all residents."
        },
        {
            "definition": "The guiding beliefs or ideals that characterize a community, nation, or ideology.",
            "pos": "noun",
            "sent1": "The political party's ethos centers around equality and justice for all.",
            "sent2": "The ethos of the environmental movement is to protect the planet for future generations.",
            "sent3": "The ethos of the book club is to read diverse genres and discuss openly.",
            "sent4": "In sports, the ethos of fair play and sportsmanship is crucial for a healthy competition.",
            "sent5": "The ethos of the charity organization is to provide aid to those in need without discrimination."
        },
        {
            "definition": "The distinguishing character, sentiment, moral nature, or guiding beliefs of a person, group, or institution.",
            "pos": "noun",
            "sent1": "The ethos of the leader inspired trust and loyalty among the team.",
            "sent2": "The ethos of the family emphasized the importance of honesty and compassion.",
            "sent3": "The ethos of the superhero was to always protect the innocent from harm.",
            "sent4": "In literature, the ethos of the protagonist shapes the entire story's narrative.",
            "sent5": "The ethos of the school principal set a positive example for students and staff alike."
        }
    ]
}