{
    "term": "etiolates",
    "meanings": [
        {
            "definition": "To make pale or sickly",
            "pos": "verb",
            "sent1": "The lack of sunlight etiolates the plant's leaves, making them pale.",
            "sent2": "Her illness etiolates her complexion, giving her a sickly appearance.",
            "sent3": "The vampire's diet of only white foods etiolates his skin to match his pale aesthetic.",
            "sent4": "The constant stress etiolates her spirit, leaving her feeling drained and weak.",
            "sent5": "The ghostly figure in the painting etiolates the once vibrant colors, creating an eerie effect."
        },
        {
            "definition": "To become weak or feeble",
            "pos": "verb",
            "sent1": "As the disease progresses, his muscles etiolate, causing him to struggle with simple tasks.",
            "sent2": "With age, the old bridge's structure etiolates, making it unsafe for use.",
            "sent3": "The superhero's powers etiolate under the influence of the villain's energy-draining device.",
            "sent4": "The once strong empire begins to etiolate as corruption seeps into its core.",
            "sent5": "The athlete's stamina etiolates after weeks of inactivity, affecting his performance in the race."
        },
        {
            "definition": "To cause to appear thin or weak",
            "pos": "verb",
            "sent1": "The harsh lighting etiolates the model's figure, making her look frail on the runway.",
            "sent2": "The artist's brush strokes etiolate the tree in the painting, giving it a delicate appearance.",
            "sent3": "The magician's spell accidentally etiolates the rabbit, making it appear thinner than before.",
            "sent4": "The designer's choice of fabric etiolates the dress, creating a wispy and delicate look.",
            "sent5": "The sculptor's chisel etiolates the marble, shaping it into a fragile and slender form."
        }
    ]
}