{
    "term": "etiolating",
    "meanings": [
        {
            "definition": "To make pale or sickly",
            "pos": "verb",
            "sent1": "The lack of sunlight was etiolating the plant, making its leaves pale.",
            "sent2": "The illness was etiolating her complexion, giving her a sickly appearance.",
            "sent3": "The vampire joked that he was etiolating from lack of blood, causing everyone to chuckle.",
            "sent4": "The long winter was etiolating the landscape, draining it of color and vitality.",
            "sent5": "The harsh winter winds were etiolating the once vibrant flowers, turning them pale and fragile."
        },
        {
            "definition": "To become weak or feeble",
            "pos": "verb",
            "sent1": "As he grew older, his muscles were etiolating, making it harder for him to lift heavy objects.",
            "sent2": "The lack of exercise was etiolating her strength, leaving her feeling feeble.",
            "sent3": "The superhero's powers were etiolating under the influence of the villain's energy-draining device.",
            "sent4": "The once mighty empire was etiolating, losing its power and influence in the region.",
            "sent5": "The constant stress was etiolating her mental resilience, making her feel increasingly fragile."
        },
        {
            "definition": "To cause to become pale and weak",
            "pos": "verb",
            "sent1": "The harsh winter weather was etiolating the livestock, making them pale and feeble.",
            "sent2": "The toxic fumes from the factory were etiolating the surrounding plants, weakening them.",
            "sent3": "The evil sorcerer's curse was etiolating the kingdom, draining it of color and strength.",
            "sent4": "The relentless heatwave was etiolating the crops, leaving them pale and wilted.",
            "sent5": "The emotional turmoil was etiolating their relationship, making it pale and fragile."
        }
    ]
}