{
    "term": "evacuating",
    "meanings": [
        {
            "definition": "Remove (someone) from a place of danger to a safe place.",
            "pos": "verb",
            "sent1": "During the storm, the firefighters were evacuating families from their flooded homes.",
            "sent2": "The school practiced evacuating the students to the designated meeting point in case of a fire.",
            "sent3": "The cat was not happy about evacuating the cozy cardboard box during the move.",
            "sent4": "Her words had a way of evacuating all doubts from his mind, leaving only certainty.",
            "sent5": "The emergency alarm blared, signaling the need for evacuating the building immediately."
        },
        {
            "definition": "Remove air, water, or other contents from (a container or space).",
            "pos": "verb",
            "sent1": "The mechanic was evacuating the old oil from the car's engine to replace it with fresh oil.",
            "sent2": "The scuba diver needed to evacuate the water from his mask to see clearly underwater.",
            "sent3": "The vacuum cleaner was evacuating dust from the carpet with ease.",
            "sent4": "His laughter seemed to evacuate all tension from the room, filling it with joy.",
            "sent5": "The plumber was evacuating the clogged drain to allow water to flow freely again."
        },
        {
            "definition": "Leave or cause the occupants to leave (a place) out of danger.",
            "pos": "verb",
            "sent1": "The police officer was evacuating the area due to a gas leak, ensuring everyone's safety.",
            "sent2": "The wildfire was spreading quickly, forcing the residents to evacuate their homes.",
            "sent3": "The magician's trick involved evacuating the audience from their seats in amazement.",
            "sent4": "Her smile had a way of evacuating all worries from his mind, bringing peace.",
            "sent5": "The teacher was evacuating the classroom after the earthquake drill for practice."
        }
    ]
}