{
    "term": "evacuator",
    "meanings": [
        {
            "definition": "A person or thing that evacuates or removes something.",
            "pos": "noun",
            "sent1": "The brave evacuator helped everyone leave the burning building safely.",
            "sent2": "The machine acted as an evacuator, clearing the debris from the construction site.",
            "sent3": "The little robot evacuator beeped happily as it cleared the toys from the room.",
            "sent4": "Her laughter was like an evacuator, removing the tension from the room.",
            "sent5": "The evacuator's efficiency made the process quick and smooth."
        },
        {
            "definition": "A device used to remove waste or fluids from the body.",
            "pos": "noun",
            "sent1": "The nurse used the evacuator to drain the excess fluid from the patient's lungs.",
            "sent2": "The dentist's evacuator sucked out the water during the teeth cleaning.",
            "sent3": "The tiny evacuator hummed as it cleared the clogged drain in the sink.",
            "sent4": "Her words were like an evacuator, draining the joy from the room.",
            "sent5": "The evacuator's gentle suction made the procedure comfortable for the patient."
        },
        {
            "definition": "A person responsible for overseeing the evacuation of a building or area.",
            "pos": "noun",
            "sent1": "The school's evacuator guided the students to the designated meeting point during the fire drill.",
            "sent2": "The event coordinator acted as the evacuator, ensuring everyone left the venue safely.",
            "sent3": "The friendly evacuator joked with the crowd as he directed them to the exits.",
            "sent4": "Her presence was like an evacuator, calmly leading everyone to safety.",
            "sent5": "The evacuator's clear instructions made the evacuation organized and efficient."
        }
    ]
}