{
    "term": "evasions",
    "meanings": [
        {
            "definition": "The act of avoiding something, especially by deceit or cleverness.",
            "pos": "noun",
            "sent1": "Her constant evasions of the truth made it hard to trust her.",
            "sent2": "The politician's evasions during the interview raised suspicions.",
            "sent3": "The cat's playful evasion of the laser pointer amused everyone in the room.",
            "sent4": "His evasions were like a skilled magician's sleight of hand, deflecting attention effortlessly.",
            "sent5": "The student's evasions of responsibility were as slippery as a fish in a stream."
        },
        {
            "definition": "A statement or action that avoids addressing a question directly.",
            "pos": "noun",
            "sent1": "The suspect's evasions only made the detective more determined to uncover the truth.",
            "sent2": "Her evasions in response to the tough questions were frustrating for the interviewer.",
            "sent3": "The comedian's witty evasion of the awkward topic had the audience in stitches.",
            "sent4": "His evasions of the difficult inquiry were like a skilled dancer gracefully sidestepping a misstep.",
            "sent5": "The child's evasions of bedtime were as creative as a master storyteller's tales."
        },
        {
            "definition": "The act of escaping or eluding something.",
            "pos": "noun",
            "sent1": "The prisoner's daring evasion of the guards shocked everyone in the prison.",
            "sent2": "The spy's successful evasion of capture was the talk of the intelligence community.",
            "sent3": "The squirrel's nimble evasion of the dog left the canine in confusion.",
            "sent4": "Her evasion of the falling branch was like a graceful dancer avoiding a misstep.",
            "sent5": "The athlete's evasion of the opponent's tackle was as swift as a gazelle fleeing a predator."
        }
    ]
}