{
    "term": "evasional",
    "meanings": [
        {
            "definition": "Tending to avoid or escape from a situation or responsibility.",
            "pos": "adjective",
            "sent1": "She showed an evasional attitude towards her chores, always finding excuses to delay them.",
            "sent2": "His evasional behavior in class made it clear he was trying to avoid answering questions.",
            "sent3": "The cat's evasional tactics to dodge the bath time were both clever and amusing.",
            "sent4": "Her evasional skills were like a magician's sleight of hand, deflecting attention effortlessly.",
            "sent5": "The squirrel's evasional leaps from branch to branch were a sight to behold, avoiding capture at every turn."
        },
        {
            "definition": "Characterized by a tendency to evade or avoid confrontation.",
            "pos": "adjective",
            "sent1": "The evasional student always found a way to slip out of difficult conversations.",
            "sent2": "The politician's evasional responses during the debate raised suspicions among the audience.",
            "sent3": "The evasional cat avoided the staring contest with a quick nap, much to everyone's amusement.",
            "sent4": "Her evasional nature was like a ghost, disappearing whenever a conflict arose.",
            "sent5": "The evasional tactics of the spy were so smooth, it was like watching a master of disguise in action."
        },
        {
            "definition": "An act or instance of avoiding or escaping from something.",
            "pos": "noun",
            "sent1": "Her evasional of the meeting was noticed by her colleagues, who wondered where she had gone.",
            "sent2": "The criminal's evasional from the police was short-lived as they caught up with him quickly.",
            "sent3": "The squirrel's evasional from the bird feeder was a comical sight, leaving seeds scattered everywhere.",
            "sent4": "The evasional of responsibility by the employee led to a serious discussion with the manager.",
            "sent5": "The evasional of the deer through the dense forest was a graceful display of agility and speed."
        }
    ]
}