{
    "term": "evicted",
    "meanings": [
        {
            "definition": "To force someone to leave a place, typically their home, by legal means.",
            "pos": "verb",
            "sent1": "The landlord evicted the tenant for not paying rent.",
            "sent2": "The family was evicted from their apartment for violating the lease agreement.",
            "sent3": "The comedy show featured a skit about a ghost being evicted from a haunted house.",
            "sent4": "The storm clouds evicted the sun from the sky, casting a dark shadow over the town.",
            "sent5": "The judge's gavel echoed in the courtroom as he declared the defendant evicted from the property."
        },
        {
            "definition": "To expel or remove someone from a property or premises.",
            "pos": "verb",
            "sent1": "The security guard evicted the troublemaker from the mall.",
            "sent2": "The bouncer evicted the unruly patron from the club.",
            "sent3": "The mischievous squirrel was evicted from the bird feeder for stealing seeds.",
            "sent4": "The strong winds evicted the fallen leaves from the yard, swirling them into the air.",
            "sent5": "The principal had to evict the students from the gym after hours."
        },
        {
            "definition": "To kick someone out of a place, usually due to non-payment of rent.",
            "pos": "verb",
            "sent1": "The landlord had to evict the tenant for not paying rent for several months.",
            "sent2": "The property manager evicted the residents who failed to meet their financial obligations.",
            "sent3": "The mischievous cat was evicted from the kitchen for trying to steal food from the counter.",
            "sent4": "The loud noise evicted the peace and quiet from the neighborhood, disrupting everyone's evening.",
            "sent5": "The unpaid bills eventually led to the bank evicting the homeowners from their property."
        }
    ]
}