{
    "term": "evictions",
    "meanings": [
        {
            "definition": "The action of expelling someone from a property.",
            "pos": "noun",
            "sent1": "The evictions in the neighborhood caused many families to find new homes.",
            "sent2": "The landlord had to go through the process of evictions due to non-payment of rent.",
            "sent3": "When the mischievous raccoons refused to leave the attic, the homeowner jokingly called it 'raccoon evictions'.",
            "sent4": "The eviction of the old furniture made the room feel more spacious and bright.",
            "sent5": "The threat of evictions loomed over the tenants, making them anxious about their living situation."
        },
        {
            "definition": "The process of legally removing a tenant from a rental property.",
            "pos": "noun",
            "sent1": "After multiple warnings, the landlord had to start the evictions process.",
            "sent2": "Evictions can be a lengthy and complicated procedure for landlords and tenants alike.",
            "sent3": "The comedy show featured a skit about a humorous mix-up during an eviction process.",
            "sent4": "The eviction process felt like a never-ending maze of paperwork and court dates.",
            "sent5": "The eviction process finally concluded with the tenant moving out peacefully."
        },
        {
            "definition": "The act of forcing someone to leave a place.",
            "pos": "noun",
            "sent1": "The sudden evictions from the park surprised the visitors.",
            "sent2": "Evictions can sometimes lead to disputes between landlords and tenants.",
            "sent3": "During the game of hide-and-seek, the kids playfully called the act of finding each other 'evictions'.",
            "sent4": "The evictions of negative thoughts from her mind helped her feel more at peace.",
            "sent5": "The eviction of the intruder from the house was a relief for the frightened family."
        }
    ]
}