{
    "term": "evoked",
    "meanings": [
        {
            "definition": "To bring or recall to the conscious mind",
            "pos": "verb",
            "sent1": "The smell of fresh bread evoked memories of baking with grandma.",
            "sent2": "The sound of the ocean always evoked a sense of calm in her mind.",
            "sent3": "The funny movie evoked uncontrollable laughter from the audience.",
            "sent4": "The painting evoked a sense of nostalgia for the artist's childhood.",
            "sent5": "The old song evoked strong emotions in everyone who listened."
        },
        {
            "definition": "To elicit or draw forth",
            "pos": "verb",
            "sent1": "His speech evoked cheers and applause from the crowd.",
            "sent2": "The magician's trick evoked gasps of amazement from the audience.",
            "sent3": "The unexpected plot twist evoked shock from the readers.",
            "sent4": "The heartfelt apology evoked forgiveness from his friends.",
            "sent5": "The beautiful sunset evoked admiration from all who saw it."
        },
        {
            "definition": "To summon or call forth",
            "pos": "verb",
            "sent1": "The wizard evoked a powerful spell to protect the kingdom.",
            "sent2": "The ritual evoked ancient spirits to guide the tribe.",
            "sent3": "The haunted house evoked fear in all who dared to enter.",
            "sent4": "The sacred chant evoked a sense of peace and tranquility.",
            "sent5": "The national anthem evoked pride in the hearts of the citizens."
        },
        {
            "definition": "To evoke emotions or memories",
            "pos": "verb",
            "sent1": "The movie evoked tears from the audience with its emotional ending.",
            "sent2": "The photograph evoked happy memories of a family vacation.",
            "sent3": "The unexpected gift evoked gratitude and joy in her heart.",
            "sent4": "The touching story evoked empathy for the characters' struggles.",
            "sent5": "The smell of fresh flowers evoked a sense of peace and happiness."
        }
    ]
}