{
    "term": "exact",
    "meanings": [
        {
            "definition": "Accurate or precise in every detail",
            "pos": "adjective",
            "sent1": "She gave an exact answer to the math problem.",
            "sent2": "The tailor made sure the measurements were exact for the dress.",
            "sent3": "The chef's exact measurements of ingredients made the cake taste perfect.",
            "sent4": "His exact memory of the event amazed everyone.",
            "sent5": "The detective's exact observations solved the mystery."
        },
        {
            "definition": "To demand and obtain by force or authority",
            "pos": "verb",
            "sent1": "The robber tried to exact money from the bank.",
            "sent2": "The king wanted to exact tribute from the conquered lands.",
            "sent3": "The villain tried to exact revenge on the hero.",
            "sent4": "The dictator sought to exact obedience from the citizens.",
            "sent5": "The bully tried to exact lunch money from the younger kids."
        },
        {
            "definition": "To make something happen",
            "pos": "verb",
            "sent1": "The magician could exact a rabbit from his hat.",
            "sent2": "The coach hoped to exact a win from the team.",
            "sent3": "The wish was to exact a sunny day for the picnic.",
            "sent4": "The scientist tried to exact a cure for the disease.",
            "sent5": "The teacher wanted to exact enthusiasm from the students."
        },
        {
            "definition": "To demand and get something from someone",
            "pos": "verb",
            "sent1": "The landlord tried to exact rent from the tenant.",
            "sent2": "The boss wanted to exact hard work from the employees.",
            "sent3": "The child tried to exact a toy from the parent.",
            "sent4": "The beggar hoped to exact charity from the passersby.",
            "sent5": "The negotiator tried to exact a compromise from both parties."
        },
        {
            "definition": "To be certain about something",
            "pos": "verb",
            "sent1": "She wanted to exact the truth from the suspect.",
            "sent2": "The scientist needed to exact the results of the experiment.",
            "sent3": "The fortune teller tried to exact the future from the crystal ball.",
            "sent4": "The student hoped to exact the correct answer from the teacher.",
            "sent5": "The explorer needed to exact the location of the hidden treasure."
        }
    ]
}