{
    "term": "exaggeratedly",
    "meanings": [
        {
            "definition": "In an exaggerated manner",
            "pos": "adverb",
            "sent1": "She spoke exaggeratedly, making her story sound more exciting than it really was.",
            "sent2": "He always laughs exaggeratedly at jokes, even the ones that aren't that funny.",
            "sent3": "The little boy exaggeratedly pretended to be a superhero, wearing a cape made from a towel.",
            "sent4": "Her smile was so exaggeratedly bright that it lit up the entire room.",
            "sent5": "The actor exaggeratedly stumbled across the stage, pretending to be a clumsy waiter."
        },
        {
            "definition": "To overstate or overemphasize",
            "pos": "verb",
            "sent1": "She tends to exaggeratedly boast about her accomplishments to impress others.",
            "sent2": "Politicians often exaggeratedly promise things they cannot deliver to gain votes.",
            "sent3": "The chef exaggeratedly claimed his soup was the best in the world, but it was just average.",
            "sent4": "His excuses for being late were so exaggeratedly elaborate that no one believed him.",
            "sent5": "The author exaggeratedly described the storm as a raging beast, adding drama to the story."
        },
        {
            "definition": "To enlarge or increase beyond normal bounds",
            "pos": "verb",
            "sent1": "The artist exaggeratedly enlarged the eyes of the portrait to create a unique style.",
            "sent2": "The company exaggeratedly expanded its operations, opening multiple new branches in a year.",
            "sent3": "The baker exaggeratedly increased the size of the cupcakes, making them too big to fit in the box.",
            "sent4": "The rumor about the celebrity's secret wedding exaggeratedly grew into a full-blown scandal.",
            "sent5": "The garden gnome was exaggeratedly enlarged to be the centerpiece of the garden."
        }
    ]
}