{
    "term": "exalt",
    "meanings": [
        {
            "definition": "To raise in rank, power, or character.",
            "pos": "verb",
            "sent1": "The king decided to exalt his loyal servant to a higher position in the kingdom.",
            "sent2": "She always exalts her friends for their hard work and dedication.",
            "sent3": "The teacher jokingly threatened to exalt the class clown to the position of principal for a day.",
            "sent4": "The promotion to manager truly exalted her status within the company.",
            "sent5": "The victory in the championship game served to exalt the team's reputation in the league."
        },
        {
            "definition": "To praise highly.",
            "pos": "verb",
            "sent1": "The coach would often exalt his players for their exceptional performance on the field.",
            "sent2": "The poet's verses exalt the beauty of nature in a captivating way.",
            "sent3": "The children decided to exalt their pet goldfish as the greatest swimmer in the world.",
            "sent4": "Her heartfelt speech exalted the bravery of the firefighters who saved her home.",
            "sent5": "The artist's masterpiece exalts the emotion and passion of the human experience."
        },
        {
            "definition": "To elevate by praise or in estimation.",
            "pos": "verb",
            "sent1": "The community came together to exalt the local hero for his selfless acts of kindness.",
            "sent2": "His actions in the crisis truly exalted him in the eyes of his peers.",
            "sent3": "The cat seemed to exalt itself as the ruler of the household, demanding treats and attention.",
            "sent4": "Her exceptional talent exalted her above the rest of the competitors in the competition.",
            "sent5": "The heartfelt words of gratitude served to exalt the volunteers for their dedication to the cause."
        }
    ]
}