{
    "term": "exaltations",
    "meanings": [
        {
            "definition": "A feeling or state of extreme happiness or joy.",
            "pos": "noun",
            "sent1": "The children's faces were filled with exaltations as they opened their presents on Christmas morning.",
            "sent2": "The exaltations of the crowd could be heard throughout the stadium after the home team scored the winning goal.",
            "sent3": "The puppy's exaltations over getting a new toy were truly heartwarming.",
            "sent4": "Her exaltations upon receiving the award were like music to her ears.",
            "sent5": "The exaltations of reaching the mountain peak will forever be etched in his memory."
        },
        {
            "definition": "The action of praising or glorifying someone or something.",
            "pos": "noun",
            "sent1": "The exaltations of the fans echoed through the concert hall as the singer took the stage.",
            "sent2": "The exaltations of the teacher for her students' hard work were well-deserved.",
            "sent3": "The exaltations of the chef's cooking skills were heard from all the diners in the restaurant.",
            "sent4": "The exaltations of the artist's masterpiece could be seen in the glowing reviews.",
            "sent5": "The exaltations of the hero's bravery spread far and wide across the town."
        },
        {
            "definition": "A feeling of intense pride or elation.",
            "pos": "noun",
            "sent1": "His exaltations at winning the championship were evident in his wide smile.",
            "sent2": "The exaltations of the student upon receiving an A+ on the test were contagious.",
            "sent3": "The exaltations of the team after their victory could be heard from miles away.",
            "sent4": "Her exaltations at being promoted to manager were shared by all her colleagues.",
            "sent5": "The exaltations of the parents at their child's graduation were a mix of pride and joy."
        }
    ]
}