{
    "term": "examined",
    "meanings": [
        {
            "definition": "To inspect or scrutinize closely",
            "pos": "verb",
            "sent1": "She examined the tiny bug with a magnifying glass.",
            "sent2": "The detective examined the crime scene for clues.",
            "sent3": "The curious cat examined the new toy with great interest.",
            "sent4": "Her eyes examined every detail of the intricate painting.",
            "sent5": "He examined the map carefully before starting the journey."
        },
        {
            "definition": "To consider or study carefully",
            "pos": "verb",
            "sent1": "Before making a decision, she examined all the options.",
            "sent2": "The student examined the historical documents for his research paper.",
            "sent3": "The chef examined the recipe to ensure he had all the ingredients.",
            "sent4": "She examined the problem from different angles to find a solution.",
            "sent5": "He examined the contract thoroughly before signing it."
        },
        {
            "definition": "To test or evaluate",
            "pos": "verb",
            "sent1": "The scientist examined the new drug in the lab.",
            "sent2": "The teacher examined the students' understanding through a quiz.",
            "sent3": "The mechanic examined the car's engine to diagnose the issue.",
            "sent4": "She examined the soil to determine its fertility.",
            "sent5": "He examined the machine to see if it was working properly."
        },
        {
            "definition": "To question or interrogate closely",
            "pos": "verb",
            "sent1": "The police officer examined the suspect about his whereabouts.",
            "sent2": "The journalist examined the witness to get more information.",
            "sent3": "The teacher examined the student about the book's plot.",
            "sent4": "She examined the employee about his sudden absence.",
            "sent5": "He examined the witness to uncover the truth."
        }
    ]
}