{
    "term": "exception",
    "meanings": [
        {
            "definition": "a person or thing that is excluded from a general statement or rule",
            "pos": "noun",
            "sent1": "In the classroom, every student had to raise their hand to answer except for Sarah, who was the exception.",
            "sent2": "The rule was that all guests had to wear formal attire to the wedding, but the bride made an exception for her young nephew.",
            "sent3": "At the zoo, all animals were in their enclosures except for the mischievous monkey, who was the exception to the rule.",
            "sent4": "She stood out like an exception in a sea of conformity, her unique style catching everyone's eye.",
            "sent5": "The rare flower in the garden was an exception, its vibrant colors standing out among the greenery."
        },
        {
            "definition": "the action of excluding or not being included within a general statement or rule",
            "pos": "noun",
            "sent1": "The exception of Tom from the team was a surprise to everyone.",
            "sent2": "The exception of dessert from the menu left the customers disappointed.",
            "sent3": "The exception of the cat from the group of dogs led to some playful chasing around the yard.",
            "sent4": "The exception of the black sheep in the family made gatherings more interesting.",
            "sent5": "The exception of rain on a sunny day brought unexpected joy to the farmers."
        },
        {
            "definition": "a case to which a rule does not apply",
            "pos": "noun",
            "sent1": "The strange phenomenon was an exception to the usual weather patterns.",
            "sent2": "The unique circumstances of the case made it an exception in the legal system.",
            "sent3": "The cat's ability to swim was an exception to the belief that all cats dislike water.",
            "sent4": "Her resilience in the face of adversity was an exception to the norm.",
            "sent5": "The old tree's ability to bloom in winter was an exception that puzzled the botanists."
        }
    ]
}