{
    "term": "excitableness",
    "meanings": [
        {
            "definition": "Capable of being excited or stimulated.",
            "pos": "adjective",
            "sent1": "The puppy's excitableness was evident as it wagged its tail at the sight of a ball.",
            "sent2": "She showed her excitableness by jumping up and down when she heard the good news.",
            "sent3": "The excitableness of the squirrel made it chase its own shadow around the tree.",
            "sent4": "His excitableness was like a coiled spring, ready to burst with energy at any moment.",
            "sent5": "The excitableness of the children on the playground was contagious, spreading joy to all around."
        },
        {
            "definition": "Easily agitated or aroused.",
            "pos": "adjective",
            "sent1": "The excitableness cat leaped at the sudden movement, startled by the noise.",
            "sent2": "His excitableness showed when he blushed at the compliment.",
            "sent3": "The excitableness of the alarm clock made him jump out of bed every morning.",
            "sent4": "Her excitableness was like a firecracker, quick to ignite with the slightest spark.",
            "sent5": "The excitableness of the audience grew as the magician prepared for his final trick."
        },
        {
            "definition": "The quality of being easily excited or stimulated.",
            "pos": "noun",
            "sent1": "The excitableness of the child was evident in his constant giggles and laughter.",
            "sent2": "She couldn't contain her excitableness as she waited for the surprise party to begin.",
            "sent3": "The excitableness of the puppy made it chase its tail in circles.",
            "sent4": "The excitableness of the crowd was like a wave of energy pulsing through the stadium.",
            "sent5": "His excitableness was like a bright light, drawing others to share in his enthusiasm."
        }
    ]
}