{
    "term": "exciples",
    "meanings": [
        {
            "definition": "A person who is a follower or student of a particular teacher or philosophy.",
            "pos": "noun",
            "sent1": "As an exciples of his teachings, she always tried to live by the wise words of her mentor.",
            "sent2": "The exciples of the great philosopher gathered to discuss his profound ideas.",
            "sent3": "The exciples of the chef were so dedicated that they even dreamt of cooking delicious meals.",
            "sent4": "She embraced the exciples of kindness and compassion, spreading positivity wherever she went.",
            "sent5": "The exciples of hard work and perseverance led him to achieve his goals against all odds."
        },
        {
            "definition": "A model or example to be followed or imitated.",
            "pos": "noun",
            "sent1": "The successful entrepreneur became an exciples for many aspiring business owners.",
            "sent2": "Children often look up to superheroes as exciples of bravery and heroism.",
            "sent3": "The exciples of fashion set by the designer were quickly adopted by trendsetters.",
            "sent4": "His dedication to fitness served as an exciples for others striving for a healthy lifestyle.",
            "sent5": "The exciples of excellence in craftsmanship inspired a new generation of artisans."
        },
        {
            "definition": "A fundamental principle or belief.",
            "pos": "noun",
            "sent1": "Honesty and integrity were the exciples that guided his every decision.",
            "sent2": "The exciples of equality and justice formed the basis of their social movement.",
            "sent3": "The exciples of teamwork and collaboration were evident in their successful project.",
            "sent4": "She held fast to the exciples of loyalty and trust in all her relationships.",
            "sent5": "The exciples of perseverance and determination fueled his journey to success."
        }
    ]
}