{
    "term": "excitability",
    "meanings": [
        {
            "definition": "The quality of being easily stimulated or aroused.",
            "pos": "noun",
            "sent1": "Her excitability was evident when she jumped with joy at the news.",
            "sent2": "The puppy's excitability was clear as it wagged its tail enthusiastically.",
            "sent3": "His excitability during the game made everyone laugh as he cheered for both teams.",
            "sent4": "The excitability of the children on the playground was like a whirlwind of energy.",
            "sent5": "The excitability of the crowd grew as the concert started, filling the air with anticipation."
        },
        {
            "definition": "The ability to respond readily to stimuli.",
            "pos": "noun",
            "sent1": "The athlete's excitability allowed him to react quickly to the coach's signals.",
            "sent2": "The cat's excitability was evident as it pounced on the moving toy.",
            "sent3": "The excitability of the robot to commands made it a helpful assistant in the kitchen.",
            "sent4": "Her excitability in solving puzzles was like a superpower that amazed her friends.",
            "sent5": "The excitability of the plant to sunlight was crucial for its growth and health."
        },
        {
            "definition": "The state of being prone to excitement or agitation.",
            "pos": "noun",
            "sent1": "His excitability often led to spontaneous adventures with his friends.",
            "sent2": "The child's excitability before Christmas was contagious, spreading joy to everyone.",
            "sent3": "The excitability of the squirrel gathering nuts was a comical sight in the park.",
            "sent4": "The excitability of the waves crashing against the shore mirrored the stormy sky above.",
            "sent5": "The excitability of the puppy meeting new people was heartwarming and endearing."
        }
    ]
}