{
    "term": "exclusionary",
    "meanings": [
        {
            "definition": "Tending to exclude or characterized by exclusion",
            "pos": "adjective",
            "sent1": "The exclusionary policy kept many students out of the club.",
            "sent2": "Her exclusionary behavior made it difficult for others to join the conversation.",
            "sent3": "The exclusionary rule of no pets allowed meant even the class hamster couldn't come in.",
            "sent4": "The exclusionary nature of the VIP section made everyone outside feel like outsiders.",
            "sent5": "The exclusionary fence around the garden kept the rabbits from eating the vegetables."
        },
        {
            "definition": "Serving to exclude or bar certain individuals or groups",
            "pos": "adjective",
            "sent1": "The exclusionary test only allowed students with a passcode to enter.",
            "sent2": "The exclusionary criteria for the scholarship left many applicants disappointed.",
            "sent3": "The exclusionary dress code for the party required guests to wear a specific color.",
            "sent4": "The exclusionary barrier at the entrance prevented unauthorized personnel from entering.",
            "sent5": "The exclusionary sign on the door warned trespassers to stay out."
        },
        {
            "definition": "Showing a preference for excluding others",
            "pos": "adjective",
            "sent1": "His exclusionary attitude towards new team members created tension in the group.",
            "sent2": "The exclusionary clique only allowed certain students to sit at their lunch table.",
            "sent3": "The exclusionary cat refused to let any other pets near its favorite spot on the couch.",
            "sent4": "The exclusionary boss always picked the same employees for special projects.",
            "sent5": "The exclusionary club had strict rules that made it hard for new members to join."
        }
    ]
}