{
    "term": "excluded",
    "meanings": [
        {
            "definition": "Not included",
            "pos": "adjective",
            "sent1": "The excluded students felt sad.",
            "sent2": "The red crayon was excluded from the box.",
            "sent3": "The lonely teddy bear felt excluded from the tea party.",
            "sent4": "The forgotten toy in the attic was like an excluded memory.",
            "sent5": "The closed door symbolized the excluded opportunity."
        },
        {
            "definition": "Left out",
            "pos": "verb",
            "sent1": "She excluded him from the game.",
            "sent2": "The team decided to exclude him from the meeting.",
            "sent3": "The cat playfully excluded the dog from its territory.",
            "sent4": "The tree branches seemed to exclude the sunlight from reaching the ground.",
            "sent5": "The locked gate excluded anyone from entering the garden."
        },
        {
            "definition": "Rejected",
            "pos": "adjective",
            "sent1": "The excluded idea was not considered.",
            "sent2": "The excluded job applicant felt disappointed.",
            "sent3": "The cake looked sad being the excluded dessert on the menu.",
            "sent4": "The excluded painting in the gallery seemed to yearn for attention.",
            "sent5": "The excluded puppy at the shelter looked forlorn in the corner."
        },
        {
            "definition": "Omitted",
            "pos": "verb",
            "sent1": "He accidentally excluded an important detail from the report.",
            "sent2": "The recipe book excluded the secret ingredient.",
            "sent3": "The detective purposely excluded the suspect's alibi from the investigation.",
            "sent4": "The map excluded a crucial landmark, causing confusion.",
            "sent5": "The letter excluded a heartfelt goodbye at the end."
        },
        {
            "definition": "Barred",
            "pos": "adjective",
            "sent1": "The excluded entrance was guarded by security.",
            "sent2": "The excluded path was blocked by fallen trees.",
            "sent3": "The excluded area was marked with caution tape.",
            "sent4": "The excluded room had a 'Do Not Enter' sign on the door.",
            "sent5": "The excluded section of the library was off-limits to visitors."
        }
    ]
}