{
    "term": "excursion",
    "meanings": [
        {
            "definition": "A short journey or trip, especially for leisure or education.",
            "pos": "noun",
            "sent1": "During the school excursion, we visited the zoo to learn about different animals.",
            "sent2": "The family planned an exciting excursion to the beach for the weekend.",
            "sent3": "The excursion to the park turned into a fun adventure when we found a hidden trail.",
            "sent4": "Her imagination took an excursion to a magical land where anything was possible.",
            "sent5": "The excursion through the forest was filled with new discoveries around every corner."
        },
        {
            "definition": "A deviation from a regular course or procedure.",
            "pos": "noun",
            "sent1": "The unexpected excursion from the main road led us to a beautiful waterfall.",
            "sent2": "The slight excursion from the usual schedule made the day more interesting.",
            "sent3": "The excursion from the recipe by adding extra spices turned out to be a delicious mistake.",
            "sent4": "His mind took an excursion into deep thoughts about the meaning of life.",
            "sent5": "The sudden excursion in the conversation caught everyone by surprise."
        },
        {
            "definition": "A brief involvement or interest in a different activity or subject.",
            "pos": "noun",
            "sent1": "Her excursion into painting opened up a whole new world of creativity for her.",
            "sent2": "The short excursion into astronomy sparked his curiosity about the stars.",
            "sent3": "The excursion into baking cookies turned into a messy but fun experience.",
            "sent4": "His mind took a brief excursion into the realm of philosophy during the lecture.",
            "sent5": "The sudden excursion into gardening brought unexpected joy and satisfaction."
        }
    ]
}