{
    "term": "exfiltrate",
    "meanings": [
        {
            "definition": "To remove or withdraw (troops, data, etc.) from an area covertly.",
            "pos": "verb",
            "sent1": "The spy had to exfiltrate the secret documents without being noticed.",
            "sent2": "The special forces team needed to exfiltrate the injured soldier from enemy territory.",
            "sent3": "Trying to exfiltrate the cookies from the jar without Mom seeing became a fun challenge.",
            "sent4": "She managed to exfiltrate herself from the boring party by pretending to receive an urgent call.",
            "sent5": "The ninja's ability to exfiltrate silently made him a master of stealth."
        },
        {
            "definition": "To steal or smuggle out (information, documents, etc.).",
            "pos": "verb",
            "sent1": "The hacker attempted to exfiltrate sensitive data from the company's database.",
            "sent2": "Criminals often exfiltrate valuable artifacts from museums to sell on the black market.",
            "sent3": "The raccoon seemed to exfiltrate snacks from the picnic basket whenever no one was looking.",
            "sent4": "Her eyes seemed to exfiltrate all the beauty of the sunset and store it in her memory.",
            "sent5": "The thief's plan to exfiltrate the jewels was foiled by the vigilant security guard."
        },
        {
            "definition": "The act of exfiltrating.",
            "pos": "noun",
            "sent1": "The exfiltrate of the troops was executed smoothly under the cover of darkness.",
            "sent2": "Witnessing the exfiltrate of classified documents raised suspicions within the organization.",
            "sent3": "The cat's exfiltrate of the toy mouse from the room amused the children.",
            "sent4": "The exfiltrate of emotions from her heart left her feeling empty and numb.",
            "sent5": "The exfiltrate of students from the school during the fire drill was orderly and quick."
        }
    ]
}