{
    "term": "exhausts",
    "meanings": [
        {
            "definition": "To use up completely",
            "pos": "verb",
            "sent1": "After running for hours, the marathon runner exhausts all his energy.",
            "sent2": "The long hike through the mountains exhausts even the most experienced climbers.",
            "sent3": "Trying to carry all the groceries in one trip exhausts me every time!",
            "sent4": "Her endless questions exhaust my patience like a never-ending test.",
            "sent5": "The intense workout routine exhausts every muscle in my body."
        },
        {
            "definition": "To drain of strength or resources",
            "pos": "verb",
            "sent1": "The demanding job exhausts him mentally and physically every day.",
            "sent2": "The constant bickering between siblings exhausts their parents' patience.",
            "sent3": "The never-ending paperwork exhausts me more than a marathon would!",
            "sent4": "The intense heat exhausts the soil of its moisture, leaving it dry and cracked.",
            "sent5": "The challenging puzzle game exhausts my brainpower as I try to solve each level."
        },
        {
            "definition": "A system for removing waste gases from an engine",
            "pos": "noun",
            "sent1": "The car's exhausts help in reducing harmful emissions into the environment.",
            "sent2": "The mechanic checked the exhausts to ensure the engine was running smoothly.",
            "sent3": "The old car's exhausts made funny noises whenever it started.",
            "sent4": "The factory installed new exhausts to comply with environmental regulations.",
            "sent5": "The exhausts of the vehicle were inspected for any leaks or damages."
        },
        {
            "definition": "The fumes or gases expelled from an engine",
            "pos": "noun",
            "sent1": "The thick exhausts from the truck polluted the air in the city.",
            "sent2": "The motorcycle's exhausts emitted a loud noise as it sped down the road.",
            "sent3": "The boat's exhausts left a trail of smoke behind it on the calm water.",
            "sent4": "The airplane's exhausts created a mesmerizing pattern in the sky during the airshow.",
            "sent5": "The bus driver checked the exhausts for any signs of malfunction before starting the route."
        }
    ]
}