{
    "term": "exhibitionism",
    "meanings": [
        {
            "definition": "The tendency to display one's body or behavior for the purpose of attracting attention.",
            "pos": "noun",
            "sent1": "Her constant need for exhibitionism made her the center of attention at every party.",
            "sent2": "His exhibitionism was evident in the way he always wore flashy, attention-grabbing outfits.",
            "sent3": "The cat's exhibitionism was on full display as it paraded around proudly with its new toy mouse.",
            "sent4": "The city's skyline was a form of exhibitionism, showcasing its towering buildings to all who passed by.",
            "sent5": "The artist's exhibitionism shone through in every bold brushstroke of their vibrant paintings."
        },
        {
            "definition": "The act of showing off or seeking attention through extravagant behavior.",
            "pos": "noun",
            "sent1": "His exhibitionism at the party included telling exaggerated stories to impress everyone.",
            "sent2": "The celebrity's exhibitionism was evident in the way they always arrived in flashy sports cars.",
            "sent3": "The peacock's exhibitionism was quite amusing as it strutted around with its colorful feathers on full display.",
            "sent4": "The fireworks display was a form of exhibitionism, lighting up the night sky with its extravagant bursts of color.",
            "sent5": "The politician's exhibitionism during the debate was hard to miss, constantly interrupting others to draw attention to themselves."
        },
        {
            "definition": "A psychological disorder characterized by a compulsive need to expose one's genitals to others.",
            "pos": "noun",
            "sent1": "The therapist helped the patient understand the harmful effects of their exhibitionism.",
            "sent2": "The case study focused on the causes and treatments for exhibitionism in individuals.",
            "sent3": "The clown's exhibitionism took a strange turn when he started juggling bananas instead of balls.",
            "sent4": "The storm's exhibitionism was evident in the way it unleashed its fury with thunder and lightning.",
            "sent5": "The singer's exhibitionism on stage was unforgettable, as they danced provocatively in front of the audience."
        }
    ]
}