{
    "term": "exile",
    "meanings": [
        {
            "definition": "A person who is expelled from their native country and not allowed to return.",
            "pos": "noun",
            "sent1": "The exile longed for home.",
            "sent2": "The government refused to let the exile come back.",
            "sent3": "The exile joked about becoming a professional traveler.",
            "sent4": "The exile's heart ached for the familiar streets.",
            "sent5": "The exile's face lit up at the mention of their homeland."
        },
        {
            "definition": "The state of being barred from one's native country.",
            "pos": "noun",
            "sent1": "Living in exile was lonely.",
            "sent2": "The feeling of exile weighed heavily on her.",
            "sent3": "The exile pretended to be a secret agent stuck in a foreign land.",
            "sent4": "The exile's mind wandered back to the forbidden borders.",
            "sent5": "The exile's dreams were filled with distant shores and lost memories."
        },
        {
            "definition": "To expel someone from their native country.",
            "pos": "verb",
            "sent1": "The king decided to exile the traitor.",
            "sent2": "The government exiled the dissidents to a remote island.",
            "sent3": "The exile of the troublemakers brought peace to the kingdom.",
            "sent4": "The decision to exile him was swift and final.",
            "sent5": "The act of exile left a scar on the community."
        },
        {
            "definition": "To be separated from one's native country.",
            "pos": "verb",
            "sent1": "The war forced many families to exile.",
            "sent2": "She felt exiled from her own culture.",
            "sent3": "The exile from technology during the camping trip was refreshing.",
            "sent4": "His heart exiled him to a place of nostalgia.",
            "sent5": "The feeling of exile crept into her thoughts like a shadow."
        }
    ]
}