{
    "term": "exo",
    "meanings": [
        {
            "definition": "Outside",
            "pos": "adjective",
            "sent1": "The exo area of the house was perfect for stargazing.",
            "sent2": "She preferred the exo seating at the cafe for some fresh air.",
            "sent3": "The exo picnic spot was so far, they had to take a spaceship to reach it!",
            "sent4": "Her exo beauty shone brighter than the stars in the night sky.",
            "sent5": "The exo world beyond the city was filled with endless possibilities."
        },
        {
            "definition": "External",
            "pos": "adjective",
            "sent1": "The exo part of the building had a unique design.",
            "sent2": "He placed the exo hard drive on the desk for easy access.",
            "sent3": "The exo decorations on the cake made it look like a spaceship!",
            "sent4": "Her exo charm captivated everyone at the party.",
            "sent5": "The exo view from the window was breathtaking."
        },
        {
            "definition": "Former",
            "pos": "adjective",
            "sent1": "She was an exo member of the team before she moved away.",
            "sent2": "The exo owner of the shop was known for his generosity.",
            "sent3": "His exo hairstyle from the '90s made everyone laugh.",
            "sent4": "The exo champion of the tournament returned to support the new players.",
            "sent5": "The exo leader of the group left a lasting impact on everyone."
        },
        {
            "definition": "Originating from outside",
            "pos": "adjective",
            "sent1": "The exo plants brought from another planet thrived in the greenhouse.",
            "sent2": "The exo ingredients in the dish gave it a unique flavor.",
            "sent3": "The exo music from a distant galaxy filled the room with joy.",
            "sent4": "Her exo knowledge of alien languages impressed the scientists.",
            "sent5": "The exo technology discovered on the asteroid was groundbreaking."
        },
        {
            "definition": "Beyond",
            "pos": "adverb",
            "sent1": "She looked exo the horizon, hoping to catch a glimpse of the shooting star.",
            "sent2": "The spaceship soared exo the speed of light.",
            "sent3": "He ran exo the finish line with a big smile on his face.",
            "sent4": "Her dreams reached exo the stars, aiming for the impossible.",
            "sent5": "The possibilities were exo what they had imagined."
        }
    ]
}