{
    "term": "exotically",
    "meanings": [
        {
            "definition": "In a way that is foreign or unfamiliar.",
            "pos": "adverb",
            "sent1": "She dressed exotically for the costume party, wearing a colorful sari.",
            "sent2": "The spices in the dish tasted exotically different from what she was used to.",
            "sent3": "The cat looked exotically at the new robotic vacuum cleaner, unsure what to make of it.",
            "sent4": "The music played exotically in the background, transporting her to a faraway land.",
            "sent5": "The exotic dancer moved exotically across the stage, captivating the audience with her graceful movements."
        },
        {
            "definition": "In a way that is strikingly unusual or different.",
            "pos": "adverb",
            "sent1": "The tree was exotically shaped, with branches twisting in all directions.",
            "sent2": "The new art exhibit featured exotically painted sculptures that caught everyone's attention.",
            "sent3": "The idea of a penguin wearing sunglasses seemed exotically amusing to the children.",
            "sent4": "Her laughter echoed exotically in the empty hallway, making it sound eerie.",
            "sent5": "The exotic flowers bloomed exotically in the garden, adding a splash of color to the landscape."
        },
        {
            "definition": "In a way that is excitingly unique or intriguing.",
            "pos": "adverb",
            "sent1": "The magician performed exotically, using a mix of illusions and sleight of hand.",
            "sent2": "The novel was written exotically, blending fantasy elements with historical events.",
            "sent3": "The idea of a talking parrot teaching math seemed exotically amusing to the students.",
            "sent4": "Her eyes sparkled exotically in the dim light of the room, drawing him in.",
            "sent5": "The exotic fruits tasted exotically delicious, leaving a sweet aftertaste on her tongue."
        }
    ]
}