{
    "term": "exotica",
    "meanings": [
        {
            "definition": "Things that are exotic or foreign.",
            "pos": "noun",
            "sent1": "The store sold various exotica like colorful fabrics and unique spices.",
            "sent2": "She loved to explore the world and collect exotica from different countries.",
            "sent3": "At the party, the guests were fascinated by the exotica on display from faraway lands.",
            "sent4": "Her room was like a treasure trove filled with exotica that she had gathered during her travels.",
            "sent5": "The museum exhibit showcased a collection of exotica, each with its own intriguing story."
        },
        {
            "definition": "An exotic plant or animal.",
            "pos": "noun",
            "sent1": "The zoo had a special section dedicated to exotica like tropical birds and rare flowers.",
            "sent2": "During their jungle expedition, they encountered beautiful exotica they had never seen before.",
            "sent3": "The children were amazed by the exotica at the wildlife sanctuary, especially the colorful parrots.",
            "sent4": "In the dense forest, they marveled at the exotica that thrived in the lush environment.",
            "sent5": "The botanical garden was a paradise of exotica, with vibrant blooms and unique species."
        },
        {
            "definition": "The quality of being exotic or unusual.",
            "pos": "noun",
            "sent1": "The allure of the carnival was in its exotica, from the performers to the decorations.",
            "sent2": "Her style was a mix of classic elegance with a touch of exotica that set her apart.",
            "sent3": "The movie's plot had a hint of exotica, adding a mysterious and intriguing element.",
            "sent4": "In the art gallery, she was drawn to the paintings that captured the essence of exotica.",
            "sent5": "The novel's setting was filled with exotica, transporting the readers to a world of wonder."
        }
    ]
}