{
    "term": "expansible",
    "meanings": [
        {
            "definition": "Capable of being expanded or stretched.",
            "pos": "adjective",
            "sent1": "The rubber band was very expansible, able to stretch far without breaking.",
            "sent2": "The balloon was quite expansible, growing larger as more air was blown into it.",
            "sent3": "The yoga instructor joked that her students were as expansible as rubber bands after a good stretch.",
            "sent4": "Her mind was like an expansible universe, constantly growing and exploring new ideas.",
            "sent5": "The fabric was so expansible that it could fit people of various sizes comfortably."
        },
        {
            "definition": "Able to be enlarged or increased in size.",
            "pos": "adjective",
            "sent1": "The cake was made with an expansible recipe, allowing for extra layers to be added.",
            "sent2": "The backpack had an expansible compartment, perfect for storing extra items.",
            "sent3": "The garden gnome seemed to have an expansible hat, as it mysteriously grew bigger overnight.",
            "sent4": "Her heart felt as though it was an expansible balloon, growing with each moment spent with her loved ones.",
            "sent5": "The company offered an expansible storage option, allowing customers to increase their space as needed."
        },
        {
            "definition": "Having the ability to be extended or stretched out.",
            "pos": "adjective",
            "sent1": "The telescope had an expansible lens, allowing for clear views of distant stars.",
            "sent2": "The slinky toy was fun to play with due to its expansible nature, stretching and bouncing with ease.",
            "sent3": "The cat's tail appeared to be expansible, as it puffed up when startled.",
            "sent4": "Her patience was like an expansible rubber band, able to withstand many challenges before snapping.",
            "sent5": "The accordion was an expansible musical instrument, capable of producing a wide range of sounds."
        }
    ]
}