{
    "term": "expansile",
    "meanings": [
        {
            "definition": "Capable of expanding or stretching.",
            "pos": "adjective",
            "sent1": "The balloon was so expansile that it could be blown up to twice its original size.",
            "sent2": "The rubber band is expansile, allowing it to stretch to accommodate larger objects.",
            "sent3": "The cake batter was so expansile that it overflowed the baking pan, creating a delicious mess.",
            "sent4": "Her heart felt expansile with joy as she watched the sunset over the ocean.",
            "sent5": "The child's imagination was as expansile as the universe, full of endless possibilities."
        },
        {
            "definition": "Having the ability to grow or increase in size.",
            "pos": "adjective",
            "sent1": "Plants with expansile leaves can grow larger to absorb more sunlight.",
            "sent2": "The company's profits were expansile, showing steady growth over the years.",
            "sent3": "The balloon animal artist created an expansile giraffe that seemed to grow taller with each twist.",
            "sent4": "Her love for him was like an expansile garden, constantly blooming and flourishing.",
            "sent5": "The city's population was as expansile as a balloon being filled with air, steadily increasing each year."
        },
        {
            "definition": "Able to be extended or enlarged.",
            "pos": "adjective",
            "sent1": "The telescopic antenna on the radio was expansile, allowing for better reception.",
            "sent2": "The dining table was expansile, able to accommodate more guests when extended.",
            "sent3": "The cat's tail puffed up in an expansile manner when it saw a squirrel outside the window.",
            "sent4": "His knowledge was like an expansile library, with new books constantly being added to the shelves.",
            "sent5": "The artist's canvas was as expansile as the sky, ready to capture any idea or inspiration."
        }
    ]
}