{
    "term": "expiations",
    "meanings": [
        {
            "definition": "The act of making amends or reparation for guilt or wrongdoing.",
            "pos": "noun",
            "sent1": "Her expiations for breaking the vase included apologizing and buying a new one.",
            "sent2": "In some cultures, expiations are necessary to restore harmony after a mistake.",
            "sent3": "After spilling juice on the carpet, his expiations involved scrubbing it clean and promising to be more careful.",
            "sent4": "The expiations for his late arrival at the meeting were seen in his extra effort to catch up on missed information.",
            "sent5": "The teacher's expiations for losing the students' assignments were seen in her offering extra credit opportunities."
        },
        {
            "definition": "The process of atoning for sins or offenses.",
            "pos": "noun",
            "sent1": "Through expiations, individuals seek to cleanse themselves of past wrongdoings.",
            "sent2": "In many religions, expiations are a vital part of seeking forgiveness from a higher power.",
            "sent3": "His expiations for eating the last cookie involved promising to bake a new batch for everyone.",
            "sent4": "The community's expiations for their neglect of the environment were seen in their collective efforts to clean up the park.",
            "sent5": "The expiations for her hurtful words were evident in her sincere apologies and efforts to make things right."
        },
        {
            "definition": "The act of offering sacrifices or prayers to seek forgiveness.",
            "pos": "noun",
            "sent1": "During the ceremony, the priest led the expiations to ask for divine forgiveness.",
            "sent2": "In times of trouble, people turn to expiations to seek solace and redemption.",
            "sent3": "His expiations for forgetting their anniversary involved surprising her with a heartfelt gift.",
            "sent4": "The expiations of the villagers for a bountiful harvest included offerings of their first fruits.",
            "sent5": "The expiations for their family's safety during the storm were seen in their prayers and acts of kindness towards others."
        }
    ]
}