{
    "term": "expiring",
    "meanings": [
        {
            "definition": "To come to an end",
            "pos": "verb",
            "sent1": "The movie was expiring, and the credits started rolling.",
            "sent2": "The lease on the apartment is expiring next month.",
            "sent3": "The battery in my old watch is expiring faster than a speeding turtle.",
            "sent4": "As the sun set, the day was expiring into a peaceful night.",
            "sent5": "The candle flame flickered, expiring slowly into darkness."
        },
        {
            "definition": "To breathe one's last breath",
            "pos": "verb",
            "sent1": "The old man was expiring peacefully in his sleep.",
            "sent2": "The patient in the hospital room was expiring, surrounded by loved ones.",
            "sent3": "The balloon, expiring from too much air, popped with a loud bang.",
            "sent4": "The dying campfire was expiring, its embers glowing faintly.",
            "sent5": "The tired runner was expiring, gasping for air at the finish line."
        },
        {
            "definition": "To pass away",
            "pos": "verb",
            "sent1": "The elderly cat was expiring in its favorite sunny spot.",
            "sent2": "The legend of the hero expiring in battle spread throughout the land.",
            "sent3": "The expiring flower wilted gracefully in the vase.",
            "sent4": "The music faded, expiring into silence at the end of the concert.",
            "sent5": "The old book's pages were yellowed, expiring with age."
        },
        {
            "definition": "To finish or terminate",
            "pos": "verb",
            "sent1": "She was expiring her contract with the company after many years.",
            "sent2": "The chef was expiring the dish with a sprinkle of fresh herbs.",
            "sent3": "The student was expiring the exam with a sigh of relief.",
            "sent4": "The artist was expiring the painting with a final brushstroke.",
            "sent5": "The builder was expiring the project, satisfied with the result."
        },
        {
            "definition": "To reach the end of a period of time",
            "pos": "verb",
            "sent1": "The marathon runner was expiring the race after hours of running.",
            "sent2": "The teacher was expiring the school year, looking forward to summer break.",
            "sent3": "The expiring hourglass signaled the end of the game.",
            "sent4": "The traveler was expiring their journey, arriving at their destination.",
            "sent5": "The expiring calendar page turned, marking the start of a new month."
        }
    ]
}