{
    "term": "expiating",
    "meanings": [
        {
            "definition": "To make amends or reparation for (guilt or wrongdoing)",
            "pos": "verb",
            "sent1": "She was expiating her mistake by apologizing sincerely.",
            "sent2": "He expiated his guilt by volunteering at the local shelter.",
            "sent3": "The cat seemed to be expiating for knocking over the vase by bringing its owner a toy mouse.",
            "sent4": "Her efforts in expiating her past wrongs were like a cleansing rain washing away the dirt of her mistakes.",
            "sent5": "The image of her expiating her guilt by planting flowers in the garden stayed with him for days."
        },
        {
            "definition": "To atone for (sin or wrongdoing)",
            "pos": "verb",
            "sent1": "They were expiating their sins through acts of kindness towards others.",
            "sent2": "The criminal sought to expiate his crimes by turning himself in.",
            "sent3": "It was as if the mischievous puppy was expiating for chewing up the shoes by bringing them a slipper.",
            "sent4": "Her words were like a balm, expiating the hurt she had caused with her thoughtless actions.",
            "sent5": "The idea of expiating his sins by climbing the mountain and seeking forgiveness resonated deeply with him."
        },
        {
            "definition": "To cleanse or purify (oneself or others) from sin",
            "pos": "verb",
            "sent1": "The ritual was believed to be expiating the participants from their impurities.",
            "sent2": "She hoped that by expiating herself, she would find inner peace.",
            "sent3": "The rain seemed to be expiating the city from the dust and grime of the long dry spell.",
            "sent4": "His act of kindness was like a gentle breeze, expiating the negativity that surrounded them.",
            "sent5": "The image of the waterfall expiating the sins of the village was a powerful symbol of redemption."
        }
    ]
}