{
    "term": "exponent",
    "meanings": [
        {
            "definition": "A person who believes in and promotes the truth or benefits of an idea or theory.",
            "pos": "noun",
            "sent1": "As an exponent of renewable energy, she tirelessly advocates for solar power.",
            "sent2": "The scientist was a well-known exponent of the theory of evolution.",
            "sent3": "The exponent of healthy eating practices always brought kale chips to the office.",
            "sent4": "She was the exponent of positivity, spreading joy wherever she went.",
            "sent5": "The exponent of kindness touched many lives with her compassionate actions."
        },
        {
            "definition": "A number that indicates the power to which another number is raised.",
            "pos": "noun",
            "sent1": "In the equation, the exponent of 2 is crucial for solving the problem.",
            "sent2": "The exponent in math class today was about understanding powers and roots.",
            "sent3": "The mischievous student changed the exponent in the formula to confuse his classmates.",
            "sent4": "The exponent of 10 in the scientific notation made calculations easier.",
            "sent5": "Understanding the exponent of a number helps in simplifying complex calculations."
        },
        {
            "definition": "A symbol placed above and to the right of a number to show the power to which the number is raised.",
            "pos": "noun",
            "sent1": "The exponent in the math problem was a small number above the base.",
            "sent2": "When dealing with exponents, it's important to remember the order of operations.",
            "sent3": "The exponent on the whiteboard was written in colorful chalk to grab attention.",
            "sent4": "The exponent of 3 squared was clearly shown in the algebraic expression.",
            "sent5": "The exponent of 5^2 was neatly written next to the base number."
        }
    ]
}