{
    "term": "expostulations",
    "meanings": [
        {
            "definition": "The act of expressing strong disapproval or disagreement.",
            "pos": "noun",
            "sent1": "Her expostulations against the decision were heard by everyone in the room.",
            "sent2": "The crowd's expostulations grew louder as they disagreed with the new rule.",
            "sent3": "Despite her expostulations, the cat refused to eat the new brand of food.",
            "sent4": "His expostulations were like a storm of disapproval, shaking the foundation of the argument.",
            "sent5": "The teacher's expostulations left a lasting impact on the students' understanding of the topic."
        },
        {
            "definition": "A strong protest or objection.",
            "pos": "noun",
            "sent1": "The expostulations of the workers could be heard echoing through the factory.",
            "sent2": "She couldn't help but let out an expostulation when she heard the unfair news.",
            "sent3": "The expostulations of the toddler over having to eat vegetables were both amusing and persistent.",
            "sent4": "His expostulations were like a battle cry, rallying others to join his protest.",
            "sent5": "The expostulations of the fans could be felt vibrating through the stadium."
        },
        {
            "definition": "An earnest and kindly protest.",
            "pos": "noun",
            "sent1": "Grandma's expostulations about the noise were always gentle but firm.",
            "sent2": "The student's expostulations about the assignment were met with understanding by the teacher.",
            "sent3": "The puppy's expostulations for more playtime were met with a smile from its owner.",
            "sent4": "Her expostulations were like a warm hug, comforting those around her.",
            "sent5": "The expostulations of the child for a bedtime story were met with a loving response from the parent."
        }
    ]
}