{
    "term": "expository",
    "meanings": [
        {
            "definition": "Intended to explain or describe something",
            "pos": "adjective",
            "sent1": "The teacher's expository lesson helped the students understand the topic easily.",
            "sent2": "The book contained clear and expository information about the solar system.",
            "sent3": "The expository presentation was so detailed that it made the audience laugh at how much they learned.",
            "sent4": "Her expository writing shone like a beacon, guiding readers through complex ideas.",
            "sent5": "The expository diagrams in the science textbook made the concepts come alive for the students."
        },
        {
            "definition": "Of or relating to exposition",
            "pos": "adjective",
            "sent1": "The expository materials for the art exhibit were informative and engaging.",
            "sent2": "She appreciated the expository signs that explained the historical significance of the monument.",
            "sent3": "The expository banners at the fair were so colorful that they caught everyone's attention.",
            "sent4": "His expository speech painted a vivid picture of the artist's life and work.",
            "sent5": "The expository tour guide shared fascinating facts about the museum's artifacts."
        },
        {
            "definition": "Serving to expound, set forth, or explain",
            "pos": "adjective",
            "sent1": "The expository essay provided a detailed analysis of the novel's themes.",
            "sent2": "The professor's expository notes clarified the complex scientific concepts for the students.",
            "sent3": "The expository video used humor to explain the process, making it entertaining to watch.",
            "sent4": "Her expository gestures during the speech emphasized the key points effectively.",
            "sent5": "The expository infographic visually represented the data for better understanding."
        }
    ]
}