{
    "term": "expressionistic",
    "meanings": [
        {
            "definition": "Of or relating to expressionism.",
            "pos": "adjective",
            "sent1": "Her painting had an expressionistic style, using bold colors and exaggerated shapes.",
            "sent2": "The artist's expressionistic work conveyed deep emotions through abstract forms.",
            "sent3": "The expressionistic play of colors on the canvas seemed to dance in the sunlight.",
            "sent4": "His expressionistic dance performance captivated the audience with its raw emotion.",
            "sent5": "The expressionistic music filled the room with a sense of passion and intensity."
        },
        {
            "definition": "Characterized by a subjective and emotional interpretation of reality.",
            "pos": "adjective",
            "sent1": "The film director took an expressionistic approach, focusing on the characters' inner feelings.",
            "sent2": "Her expressionistic writing style resonated with readers who appreciated emotional depth.",
            "sent3": "The expressionistic portrayal of the storm in the movie made everyone laugh at its exaggeration.",
            "sent4": "His expressionistic storytelling painted a vivid picture of love and loss.",
            "sent5": "The expressionistic performance moved the audience to tears with its heartfelt sincerity."
        },
        {
            "definition": "A style of art, music, or literature that seeks to express emotions rather than represent external reality.",
            "pos": "noun",
            "sent1": "The museum featured an exhibition of expressionistic paintings from the early 20th century.",
            "sent2": "She was drawn to the expressionistic poetry that captured the essence of human experience.",
            "sent3": "The expressionistic novel took readers on a rollercoaster of emotions and adventures.",
            "sent4": "His music was an expressionistic journey through the depths of the human soul.",
            "sent5": "The expressionistic film left a lasting impact on viewers, stirring their emotions."
        }
    ]
}