{
    "term": "expressos",
    "meanings": [
        {
            "definition": "Expressos (noun): plural form of espresso, a strong black coffee made by forcing steam through ground coffee beans.",
            "pos": "noun",
            "sent1": "In the morning, I always enjoy two expressos to wake me up.",
            "sent2": "The cafe served delicious expressos to its customers.",
            "sent3": "The expressos were so strong that they made everyone's eyes widen in surprise.",
            "sent4": "The aroma of the fresh expressos filled the room, energizing everyone.",
            "sent5": "The barista carefully prepared the expressos, ensuring they were perfect."
        },
        {
            "definition": "Expressos (verb): third person singular present of express, to convey (a thought or feeling) in words or by gestures and conduct.",
            "pos": "verb",
            "sent1": "She expressos her gratitude by sending a thank-you card.",
            "sent2": "He expressos his love for music through his guitar playing.",
            "sent3": "The cat expressos its displeasure by knocking things off the table.",
            "sent4": "The artist expressos her emotions through vibrant colors on the canvas.",
            "sent5": "The teacher expressos her excitement for the new school year to her students."
        },
        {
            "definition": "Expressos (adjective): relating to or denoting a service that is fast, direct, and non-stop.",
            "pos": "adjective",
            "sent1": "The expressos train took passengers quickly to their destination.",
            "sent2": "The expressos delivery service guaranteed same-day shipping.",
            "sent3": "The expressos check-in at the airport saved us a lot of time.",
            "sent4": "The expressos response from customer service impressed the clients.",
            "sent5": "The expressos lane at the supermarket allowed for a speedy checkout."
        }
    ]
}