{
    "term": "expressionistically",
    "meanings": [
        {
            "definition": "In a manner that conveys emotion or feeling through artistic representation",
            "pos": "adverb",
            "sent1": "She painted expressionistically, capturing the raw emotions of the scene.",
            "sent2": "The artist sang expressionistically, pouring her heart into every note.",
            "sent3": "The clown danced expressionistically, making everyone laugh with his exaggerated movements.",
            "sent4": "The music flowed expressionistically, painting a vivid picture of love and loss.",
            "sent5": "The actor performed expressionistically, bringing the audience to tears with his heartfelt portrayal."
        },
        {
            "definition": "Using a style of art that emphasizes the artist's subjective interpretation of reality",
            "pos": "adjective",
            "sent1": "The gallery displayed an expressionistically painted landscape that seemed to come alive.",
            "sent2": "Her expressionistically decorated room reflected her unique perspective on design.",
            "sent3": "The movie set was designed expressionistically, creating a surreal atmosphere on screen.",
            "sent4": "The novel was written in an expressionistically descriptive style, immersing readers in the protagonist's world.",
            "sent5": "The sculpture was crafted expressionistically, capturing the artist's personal vision in every curve and line."
        },
        {
            "definition": "Characterized by the use of exaggerated or distorted elements to convey a particular mood or emotion",
            "pos": "adjective",
            "sent1": "The painting was expressionistically vibrant, with colors that seemed to leap off the canvas.",
            "sent2": "His expressionistically styled hair drew attention wherever he went.",
            "sent3": "The play was performed in an expressionistically comedic manner, leaving the audience in stitches.",
            "sent4": "The building was designed expressionistically, with twisted metal beams and unconventional shapes.",
            "sent5": "Her outfit was expressionistically bold, combining patterns and colors in a daring way."
        }
    ]
}