{
    "term": "expressionism",
    "meanings": [
        {
            "definition": "A style of art in which the artist seeks to express emotional experience rather than physical reality.",
            "pos": "noun",
            "sent1": "In her painting, the artist used expressionism to show how she felt after the storm.",
            "sent2": "The museum featured a collection of expressionism pieces that focused on emotions.",
            "sent3": "The cat's expressionism in knocking over the vase seemed to convey a sense of mischief.",
            "sent4": "The playwright's use of expressionism transformed the stage into a whirlwind of emotions.",
            "sent5": "The dancer's performance was a beautiful display of expressionism, capturing the audience's hearts."
        },
        {
            "definition": "The use of distortion and exaggeration in art to evoke emotional response.",
            "pos": "noun",
            "sent1": "The artist's expressionism in the portrait made the subject's eyes appear larger than life.",
            "sent2": "The painting's bold colors and expressionism created a sense of drama and intensity.",
            "sent3": "The cartoonist's playful expressionism in drawing animals with human features brought smiles to many faces.",
            "sent4": "The sculpture's exaggerated features added a touch of whimsical expressionism to the art exhibit.",
            "sent5": "The film director's use of expressionism in lighting and angles heightened the suspense of the scene."
        },
        {
            "definition": "A movement in the arts that emphasized subjective emotions and experiences over objective reality.",
            "pos": "noun",
            "sent1": "During the exhibition, visitors could sense the passion behind the expressionism of the artists.",
            "sent2": "The art students studied the history of expressionism and its impact on modern art.",
            "sent3": "The comedian's expressionism in storytelling turned mundane events into hilarious adventures.",
            "sent4": "The poet's words painted a picture of emotional expressionism that resonated with the audience.",
            "sent5": "The singer's voice carried the raw emotion of expressionism, moving listeners to tears."
        }
    ]
}