{
    "term": "exterminate",
    "meanings": [
        {
            "definition": "To destroy completely",
            "pos": "verb",
            "sent1": "The brave knight set out to exterminate the dragon terrorizing the village.",
            "sent2": "The pest control company was called to exterminate the termite infestation in the house.",
            "sent3": "The superhero's mission was to exterminate all evil from the city, starting with the supervillains.",
            "sent4": "The powerful storm seemed to exterminate everything in its path, leaving only destruction behind.",
            "sent5": "The virus spread rapidly, threatening to exterminate the entire population if not contained."
        },
        {
            "definition": "To get rid of by killing",
            "pos": "verb",
            "sent1": "The farmer had to exterminate the pests eating his crops to protect his harvest.",
            "sent2": "The government issued orders to exterminate the dangerous wild animals that were attacking livestock.",
            "sent3": "The detective had to exterminate all doubts by finding the true culprit of the crime.",
            "sent4": "The brave soldier knew he had to exterminate the enemy to protect his country.",
            "sent5": "The hunter aimed carefully to exterminate the target with a single shot."
        },
        {
            "definition": "To eliminate completely",
            "pos": "verb",
            "sent1": "The new technology promised to exterminate all errors in the system, making it flawless.",
            "sent2": "The strict diet plan aimed to exterminate unhealthy habits and promote better health.",
            "sent3": "The magician's trick seemed to exterminate the rabbit from the hat, leaving the audience amazed.",
            "sent4": "The intense heat threatened to exterminate all life in the desert, creating a barren wasteland.",
            "sent5": "The superhero's powers were strong enough to exterminate any threat to the city."
        }
    ]
}