{
    "term": "extermine",
    "meanings": [
        {
            "definition": "To destroy completely",
            "pos": "verb",
            "sent1": "The powerful storm threatened to extermine the small village.",
            "sent2": "The superhero's mission was to extermine all evil from the city.",
            "sent3": "The clumsy wizard accidentally used a spell to extermine his own garden.",
            "sent4": "The virus spread rapidly, threatening to extermine the entire population.",
            "sent5": "The wildfire's fierce flames seemed to extermine everything in their path."
        },
        {
            "definition": "To kill off",
            "pos": "verb",
            "sent1": "The pesticide was used to extermine the pesky insects in the kitchen.",
            "sent2": "The hunter aimed to extermine the invasive species from the forest.",
            "sent3": "The chef accidentally added too much spice, threatening to extermine the taste buds.",
            "sent4": "The detective's goal was to extermine any doubts about the suspect's alibi.",
            "sent5": "The cold winter weather seemed to extermine all hope of an early spring."
        },
        {
            "definition": "To get rid of by destroying",
            "pos": "verb",
            "sent1": "The company decided to extermine all outdated files to make room for new ones.",
            "sent2": "The demolition crew was hired to extermine the old building and make space for a new one.",
            "sent3": "The mischievous raccoons managed to extermine the entire supply of birdseed.",
            "sent4": "The floodwaters threatened to extermine the fragile bridge that connected the two towns.",
            "sent5": "The ruthless dictator sought to extermine any opposition to his rule."
        },
        {
            "definition": "To wipe out completely",
            "pos": "verb",
            "sent1": "The powerful earthquake could extermine the ancient ruins in seconds.",
            "sent2": "The deadly disease had the potential to extermine entire populations if left unchecked.",
            "sent3": "The mischievous children's plan to extermine the ant colony backfired.",
            "sent4": "The tornado's destructive force threatened to extermine the small town.",
            "sent5": "The invasive species had the potential to extermine the delicate ecosystem."
        }
    ]
}