{
    "term": "extortions",
    "meanings": [
        {
            "definition": "The act or practice of extorting money or other property by threat or force.",
            "pos": "noun",
            "sent1": "The gang's extortions of money from local businesses caused fear in the community.",
            "sent2": "The criminal was arrested for his involvement in multiple extortions across the city.",
            "sent3": "The movie villain's extortions for ransom were always thwarted by the brave hero.",
            "sent4": "The politician's extortions of bribes were like a dark cloud hanging over the city.",
            "sent5": "The newspaper headline exposed the shocking extortions of the corrupt official."
        },
        {
            "definition": "The illegal use of one's official position or powers to obtain property, funds, or patronage.",
            "pos": "noun",
            "sent1": "The mayor's extortions for kickbacks led to his downfall.",
            "sent2": "The investigation revealed a web of corruption involving high-level extortions.",
            "sent3": "The comedy show portrayed a hilarious scenario of a clumsy official attempting extortions.",
            "sent4": "The CEO's extortions for personal gain were a stain on the company's reputation.",
            "sent5": "The whistleblower exposed the shocking extent of the executive's extortions."
        },
        {
            "definition": "The act or practice of obtaining something by force, threats, or other unfair means.",
            "pos": "noun",
            "sent1": "The bully's extortions of lunch money from younger students were finally stopped.",
            "sent2": "The criminal organization was known for its ruthless extortions of businesses in the area.",
            "sent3": "The cat's playful extortions of treats from its owner always brought a smile.",
            "sent4": "The storm's extortions of power from the city left everyone in darkness.",
            "sent5": "The dictator's extortions of loyalty from his subjects were met with silent resentment."
        }
    ]
}