{
    "term": "extractions",
    "meanings": [
        {
            "definition": "The action of taking out something, especially by force or effort.",
            "pos": "noun",
            "sent1": "The dentist performed several extractions on the patient's decayed teeth.",
            "sent2": "The extractions of the damaged parts from the machine took a lot of time.",
            "sent3": "The extractions of cookies from the jar were so tempting that he couldn't resist.",
            "sent4": "Her extractions of wisdom from the ancient text revealed hidden meanings.",
            "sent5": "The extractions of weeds from the garden made it look neat and tidy."
        },
        {
            "definition": "The process of removing a tooth or teeth from the mouth.",
            "pos": "noun",
            "sent1": "After the extraction, the dentist gave specific care instructions to the patient.",
            "sent2": "The extraction of the wisdom tooth was necessary to prevent further pain.",
            "sent3": "The tooth fairy was delighted to collect the extraction left under the pillow.",
            "sent4": "The extraction of the decayed tooth felt like a relief to the patient.",
            "sent5": "The extraction of the tooth was quick and painless, thanks to modern dentistry."
        },
        {
            "definition": "The act of obtaining something from a substance by chemical or mechanical means.",
            "pos": "noun",
            "sent1": "The extraction of oil from olives is a crucial step in making olive oil.",
            "sent2": "Chemists use extraction techniques to separate different compounds from a mixture.",
            "sent3": "The extraction of flavors from herbs added a delightful taste to the dish.",
            "sent4": "The extraction of minerals from the earth is essential for various industries.",
            "sent5": "The extraction of information from the data required advanced analytical tools."
        }
    ]
}