{
    "term": "extravasation",
    "meanings": [
        {
            "definition": "The process of leaking out of a vessel into surrounding tissues.",
            "pos": "noun",
            "sent1": "After the injury, the extravasation of blood caused swelling in the area.",
            "sent2": "The doctor explained that extravasation of medication can lead to skin irritation.",
            "sent3": "The extravasation of juice from the watermelon made a sticky mess on the table.",
            "sent4": "Her emotions were like an extravasation of colors, spreading and mixing in her mind.",
            "sent5": "The extravasation of ink from the pen created a blot on the paper."
        },
        {
            "definition": "The act of forcing blood or other fluid out of a vessel and into surrounding tissues.",
            "pos": "noun",
            "sent1": "During the medical procedure, the nurse carefully monitored the extravasation of the dye.",
            "sent2": "The extravasation of fluid from the IV drip caused discomfort for the patient.",
            "sent3": "The chef's extravagant cooking style was like an extravasation of flavors on the plate.",
            "sent4": "The extravasation of thoughts from her mind onto paper was a therapeutic release.",
            "sent5": "The extravasation of light through the clouds created a beautiful sunset."
        },
        {
            "definition": "The escape of fluid from a blood vessel into surrounding tissue.",
            "pos": "noun",
            "sent1": "The doctor explained the risks of extravasation of chemotherapy drugs during treatment.",
            "sent2": "The extravasation of fluid from the wound indicated a need for immediate medical attention.",
            "sent3": "The extravasation of bubbles from the soda can made a fizzy mess on the floor.",
            "sent4": "Her laughter was like an extravasation of joy, spreading infectious happiness.",
            "sent5": "The extravasation of water from the hose created a puddle in the garden."
        }
    ]
}