{
    "term": "extravagances",
    "meanings": [
        {
            "definition": "Excessive or unnecessary spending or behavior",
            "pos": "noun",
            "sent1": "Her extravagances on designer clothes left her with little money for essentials.",
            "sent2": "The family's extravagances during the vacation led to a huge credit card bill.",
            "sent3": "Despite knowing her budget, she couldn't resist the extravagances of the fancy store.",
            "sent4": "His extravagances in buying the latest gadgets drained his savings like a leaky bucket.",
            "sent5": "The extravagances of the royal family were the talk of the town for weeks."
        },
        {
            "definition": "Overindulgence in luxury or pleasure",
            "pos": "noun",
            "sent1": "Their extravagances in fine dining and exotic vacations were the envy of their friends.",
            "sent2": "The millionaire's extravagances knew no bounds, from private jets to diamond-studded watches.",
            "sent3": "The cat's extravagances included lounging on silk cushions and dining on gourmet seafood.",
            "sent4": "Her extravagances in spa treatments and massages made her feel like a pampered queen.",
            "sent5": "The extravagances of the cruise ship made it feel like a floating palace of luxury."
        },
        {
            "definition": "Acts or habits of wastefulness or excess",
            "pos": "noun",
            "sent1": "His extravagances in leaving the lights on all night resulted in a high electricity bill.",
            "sent2": "The company's extravagances in unnecessary meetings wasted valuable time and resources.",
            "sent3": "The squirrel's extravagances in hoarding nuts led to a pantry overflowing with food.",
            "sent4": "Her extravagances in buying multiple versions of the same dress seemed unnecessary to her friends.",
            "sent5": "The extravagances of the party planner knew no bounds, from gold-plated cutlery to crystal chandeliers."
        }
    ]
}