{
    "term": "eyeblacks",
    "meanings": [
        {
            "definition": "A type of adhesive strip worn under the eyes, typically used to reduce glare from the sun.",
            "pos": "noun",
            "sent1": "During the game, the baseball player wore eyeblacks to protect his eyes from the bright sun.",
            "sent2": "She applied the eyeblacks before the match to shield her eyes from the sun's rays.",
            "sent3": "The soccer team looked fierce with their eyeblacks on, ready to take on the opponent.",
            "sent4": "The eyeblacks acted like a shield, guarding the player's eyes from the harsh sunlight.",
            "sent5": "The eyeblacks made the player look like a warrior, ready for battle on the field."
        },
        {
            "definition": "To apply eyeblacks to one's face before a sporting event.",
            "pos": "verb",
            "sent1": "Before the race, he carefully eyeblacks his face to prepare for the competition.",
            "sent2": "She always eyeblacks before playing soccer to boost her confidence.",
            "sent3": "The basketball player eyeblacks with precision, getting ready for the big game.",
            "sent4": "He eyeblacks like a pro, ensuring he is fully geared up for the match.",
            "sent5": "Eyeblacks before a game helps the athlete focus and feel ready to perform."
        },
        {
            "definition": "The act of wearing eyeblacks for a specific purpose, such as to show team spirit.",
            "pos": "noun",
            "sent1": "Wearing eyeblacks is a fun way to display team unity during games.",
            "sent2": "The fans cheered as the players showed off their team spirit with colorful eyeblacks.",
            "sent3": "The coach encouraged the team to wear eyeblacks as a symbol of their strong bond.",
            "sent4": "The eyeblacks added a touch of camaraderie to the team's overall look.",
            "sent5": "The team's morale lifted as they all sported matching eyeblacks for the championship."
        }
    ]
}