{
    "term": "eyedroppers",
    "meanings": [
        {
            "definition": "A small glass tube with a rubber bulb at one end used to transfer small amounts of liquid.",
            "pos": "noun",
            "sent1": "I used the eyedroppers to carefully add drops of food coloring to the cake batter.",
            "sent2": "The scientist used the eyedroppers to mix different chemicals in the lab.",
            "sent3": "The clown mistakenly used the eyedroppers to squirt water at the audience during the show.",
            "sent4": "Her words were like eyedroppers of poison, slowly infecting everyone around her.",
            "sent5": "The eyedroppers delicately released the medicine into the patient's eye."
        },
        {
            "definition": "A person who administers eye drops.",
            "pos": "noun",
            "sent1": "The eyedroppers gently helped the patient apply the eye drops.",
            "sent2": "The eyedroppers explained the proper way to use the eye drops to the elderly man.",
            "sent3": "The eyedroppers always had a steady hand when assisting with eye treatments.",
            "sent4": "She was like an eyedropper of comfort, soothing those in need with her kind words.",
            "sent5": "The eyedroppers carefully guided the eye drops into the child's eyes."
        },
        {
            "definition": "A tool used for precise measurement and dispensing of liquids.",
            "pos": "noun",
            "sent1": "The chemist relied on the eyedroppers to accurately measure the solutions.",
            "sent2": "The baker used the eyedroppers to add vanilla extract to the recipe.",
            "sent3": "The artist playfully pretended the eyedroppers were magic wands in her studio.",
            "sent4": "His words were like eyedroppers of wisdom, guiding his students to success.",
            "sent5": "The eyedroppers carefully poured the liquid into the tiny vial."
        }
    ]
}