{
    "term": "eyestrings",
    "meanings": [
        {
            "definition": "The strings that attach the eyeballs to the eye sockets.",
            "pos": "noun",
            "sent1": "When I learned about eyestrings, I imagined tiny ropes holding my eyes in place.",
            "sent2": "The doctor explained that the eyestrings are crucial for keeping the eyes in position.",
            "sent3": "I joked that if my eyestrings ever break, my eyes might roll away like marbles.",
            "sent4": "Her gaze was so intense, it felt like her eyestrings were pulling me closer.",
            "sent5": "The image of eyestrings connecting the eyes to the sockets stuck in my mind."
        },
        {
            "definition": "The muscles that control the movement of the eyeballs.",
            "pos": "noun",
            "sent1": "During the eye exam, the doctor checked the strength of my eyestrings.",
            "sent2": "The eyestrings work together to help the eyes look in different directions.",
            "sent3": "I playfully told my friend that I wish I could strengthen my eyestrings by blinking more.",
            "sent4": "Her eyestrings seemed to dance as she followed the moving object with her eyes.",
            "sent5": "The eyestrings flexed and relaxed as the eyes scanned the room."
        },
        {
            "definition": "The nerves that transmit visual information from the eyes to the brain.",
            "pos": "noun",
            "sent1": "The eyestrings send signals to the brain about what the eyes see.",
            "sent2": "Doctors study how the eyestrings communicate with the brain to understand vision.",
            "sent3": "I imagined tiny messengers running along the eyestrings to deliver information to the brain.",
            "sent4": "Her eyestrings seemed to vibrate with excitement as she saw something surprising.",
            "sent5": "The eyestrings acted as the messengers of sight, carrying images to the brain."
        }
    ]
}