{
    "term": "faced",
    "meanings": [
        {
            "definition": "Having a specified kind of face or number of faces.",
            "pos": "adjective",
            "sent1": "The doll had a cute faced appearance.",
            "sent2": "The cat had a fluffy faced look.",
            "sent3": "The clown faced mirror made everyone laugh.",
            "sent4": "The mountain faced wall stood tall and proud.",
            "sent5": "The puppy's faced expression melted hearts."
        },
        {
            "definition": "Having a face or facing in a specified direction.",
            "pos": "adjective",
            "sent1": "The house had a south faced entrance.",
            "sent2": "The tree had a sun faced side.",
            "sent3": "The clock faced the wrong way and confused everyone.",
            "sent4": "The building faced the ocean, enjoying the view.",
            "sent5": "The car's faced headlights illuminated the road ahead."
        },
        {
            "definition": "Having a face or facing in a specified way.",
            "pos": "adjective",
            "sent1": "The building had a beautifully faced facade.",
            "sent2": "The clock had a uniquely faced design.",
            "sent3": "The map faced upside down caused a mix-up.",
            "sent4": "The house faced east, welcoming the morning sun.",
            "sent5": "The mask's faced expression seemed to change with the light."
        },
        {
            "definition": "Having a face or facing in a specified position.",
            "pos": "adjective",
            "sent1": "The building had a street faced entrance.",
            "sent2": "The sign had a road faced direction.",
            "sent3": "The camera faced the wrong way during the photo.",
            "sent4": "The house faced the park, perfect for picnics.",
            "sent5": "The clock's faced hands moved steadily around."
        },
        {
            "definition": "Having a face or facing in a specified manner.",
            "pos": "adjective",
            "sent1": "The building had a grandly faced entrance.",
            "sent2": "The clock had a smoothly faced surface.",
            "sent3": "The mirror faced the wall, reflecting nothing.",
            "sent4": "The house faced outward, embracing the world.",
            "sent5": "The mask's faced features were intricately detailed."
        }
    ]
}