{
    "term": "fair",
    "meanings": [
        {
            "definition": "Free from bias or injustice; impartial",
            "pos": "adjective",
            "sent1": "The judge made a fair decision in the case.",
            "sent2": "It is important to be fair to everyone in a competition.",
            "sent3": "The fair outcome of the game surprised everyone.",
            "sent4": "Her fair judgment was like a beacon of light in the courtroom.",
            "sent5": "The fair treatment of all students by the teacher was commendable."
        },
        {
            "definition": "Of light complexion",
            "pos": "adjective",
            "sent1": "She had fair skin that burned easily in the sun.",
            "sent2": "People with fair hair often have light-colored eyes.",
            "sent3": "His fair complexion made him stand out in the crowd.",
            "sent4": "The fair skin of the baby was a stark contrast to her dark hair.",
            "sent5": "The fair complexion of the model was perfect for the summer photoshoot."
        },
        {
            "definition": "Attractive or pleasing in appearance",
            "pos": "adjective",
            "sent1": "The fair maiden captured everyone's attention at the ball.",
            "sent2": "The garden was filled with fair flowers of all colors.",
            "sent3": "Her fair dress shimmered in the sunlight.",
            "sent4": "The fair landscape looked like a painting come to life.",
            "sent5": "The fair decorations made the room feel magical."
        },
        {
            "definition": "In accordance with the rules or standards; legitimate",
            "pos": "adjective",
            "sent1": "His actions were fair and followed the guidelines.",
            "sent2": "It's important to play by the rules and be fair in a game.",
            "sent3": "The fair decision was accepted by all parties involved.",
            "sent4": "The fair process ensured transparency and honesty.",
            "sent5": "The fair competition brought out the best in all participants."
        },
        {
            "definition": "Reasonable or moderate in size, amount, or degree",
            "pos": "adjective",
            "sent1": "The price of the item was fair and affordable.",
            "sent2": "She asked for a fair share of the cake for herself.",
            "sent3": "The fair amount of work was manageable for the team.",
            "sent4": "The fair distance to walk was just enough for a morning stroll.",
            "sent5": "The fair level of difficulty made the puzzle enjoyable for all ages."
        }
    ]
}