{
    "term": "fakers",
    "meanings": [
        {
            "definition": "A person who pretends to be someone they are not.",
            "pos": "noun",
            "sent1": "The fakers at the party claimed to be famous celebrities.",
            "sent2": "She knew they were fakers because they couldn't answer simple questions about their supposed careers.",
            "sent3": "The fakers at the costume party were easily spotted when they couldn't dance like the real celebrities.",
            "sent4": "The fakers in the play were like shadows, pretending to be real people under the stage lights.",
            "sent5": "The fakers in the crowd stood out like sore thumbs, trying too hard to fit in with their fake smiles."
        },
        {
            "definition": "To pretend to be someone or something that one is not.",
            "pos": "verb",
            "sent1": "He would often fakers being a superhero when playing with his friends.",
            "sent2": "She decided to fakers being a doctor for Halloween and wore a white coat and stethoscope.",
            "sent3": "The cat tried to fakers being a lion by puffing up its fur and roaring at the birds.",
            "sent4": "The actor had to fakers being a villain on stage, but his kind smile gave him away.",
            "sent5": "The child loved to fakers being a chef in the kitchen, pretending to cook up delicious meals for her toys."
        },
        {
            "definition": "Something that is not genuine or authentic.",
            "pos": "noun",
            "sent1": "The antique dealer warned customers about the fakers in the market selling fake jewelry.",
            "sent2": "She could spot fakers a mile away, always checking the authenticity of the products she bought.",
            "sent3": "The fakers of the painting tried to pass it off as a famous artist's work, but the brush strokes gave it away.",
            "sent4": "The fakers of the designer bags were caught red-handed, selling counterfeit goods on the street corner.",
            "sent5": "The fakers of the rare coins were skilled at making them look real, fooling even experienced collectors."
        }
    ]
}