{
    "term": "fallen",
    "meanings": [
        {
            "definition": "Having dropped or descended from a higher to a lower level.",
            "pos": "adjective",
            "sent1": "The fallen leaves covered the ground in a colorful blanket.",
            "sent2": "The fallen snow made the roads slippery.",
            "sent3": "The squirrel looked down at the fallen acorn with disappointment.",
            "sent4": "Her fallen spirits lifted when she saw the rainbow after the storm.",
            "sent5": "The fallen petals of the cherry blossom tree created a beautiful scene."
        },
        {
            "definition": "Having succumbed to temptation or sin.",
            "pos": "adjective",
            "sent1": "The fallen angel regretted his choices.",
            "sent2": "She felt guilty for her fallen actions.",
            "sent3": "The fallen cookie tempted the children with its sweet aroma.",
            "sent4": "He saw himself as a fallen hero in the eyes of his friends.",
            "sent5": "The fallen apple symbolized the first sin in the story."
        },
        {
            "definition": "Having been defeated or overthrown.",
            "pos": "adjective",
            "sent1": "The fallen team accepted their loss with grace.",
            "sent2": "The fallen empire crumbled under its own weight.",
            "sent3": "The fallen chess piece signaled the end of the game.",
            "sent4": "She saw herself as a fallen warrior, but vowed to rise again.",
            "sent5": "The fallen king surrendered his crown to the conqueror."
        },
        {
            "definition": "Having decreased in value or status.",
            "pos": "adjective",
            "sent1": "The fallen stock prices worried the investors.",
            "sent2": "His fallen reputation made it hard to find a job.",
            "sent3": "The fallen cake was still delicious despite its appearance.",
            "sent4": "She felt like a fallen star in the eyes of her fans.",
            "sent5": "The fallen building stood as a reminder of better days."
        }
    ]
}