{
    "term": "fallaway",
    "meanings": [
        {
            "definition": "A type of basketball shot where the shooter leans back while releasing the ball.",
            "pos": "noun",
            "sent1": "During the game, he made a fallaway shot from the corner of the court.",
            "sent2": "The basketball player practiced his fallaway technique to improve his shooting skills.",
            "sent3": "The coach joked that his fallaway shot was so good, it looked like he was dodging imaginary defenders.",
            "sent4": "Her fallaway shot was like a graceful dance move on the court, mesmerizing the audience.",
            "sent5": "The fallaway shot soared through the air, perfectly arcing towards the hoop."
        },
        {
            "definition": "A type of dance move where the dancer leans back and falls away from their partner.",
            "pos": "noun",
            "sent1": "At the dance competition, she executed a flawless fallaway that impressed the judges.",
            "sent2": "During the tango, the couple performed a stunning fallaway that wowed the audience.",
            "sent3": "The dance instructor demonstrated the fallaway move with exaggerated flair, causing laughter in the class.",
            "sent4": "Her fallaway in the routine symbolized freedom and independence, adding depth to the performance.",
            "sent5": "The fallaway step added a touch of drama to the dance, creating a memorable moment on stage."
        },
        {
            "definition": "A type of architectural design where a building or structure appears to be falling away from the viewer.",
            "pos": "noun",
            "sent1": "The artist's painting depicted a fallaway building that seemed to defy gravity.",
            "sent2": "The architectural marvel featured a stunning fallaway design that captured everyone's attention.",
            "sent3": "The tourists marveled at the optical illusion created by the fallaway structure.",
            "sent4": "The fallaway building in the artwork symbolized the passage of time and impermanence.",
            "sent5": "The fallaway perspective of the building gave the impression of movement and dynamism in the static image."
        }
    ]
}