{
    "term": "falling",
    "meanings": [
        {
            "definition": "To descend from a higher to a lower place",
            "pos": "verb",
            "sent1": "The leaves are falling from the tree.",
            "sent2": "I saw a bird falling from the sky.",
            "sent3": "The cat is falling off the table again.",
            "sent4": "Her grades are falling like a rock.",
            "sent5": "The rain falling on the roof is soothing."
        },
        {
            "definition": "To come down freely by the force of gravity",
            "pos": "verb",
            "sent1": "The snow is falling gently outside.",
            "sent2": "I love watching the stars falling at night.",
            "sent3": "The price of the toy is falling like magic.",
            "sent4": "Her tears are falling like raindrops.",
            "sent5": "The waterfall falling down the cliff is majestic."
        },
        {
            "definition": "To decrease in value or amount",
            "pos": "verb",
            "sent1": "The temperature is falling rapidly.",
            "sent2": "The value of the house is falling due to the market.",
            "sent3": "His interest in the game is falling like a stone.",
            "sent4": "Her energy levels are falling as the day goes on.",
            "sent5": "The sun falling below the horizon marks the end of the day."
        },
        {
            "definition": "To move downward or drop from a higher to a lower level",
            "pos": "verb",
            "sent1": "The ball is falling down the stairs.",
            "sent2": "I can see the rain falling from the clouds.",
            "sent3": "The price of the product is falling like a leaf.",
            "sent4": "Her hair falling over her shoulders is beautiful.",
            "sent5": "The snow falling softly on the ground is peaceful."
        },
        {
            "definition": "To be captured or defeated",
            "pos": "verb",
            "sent1": "The enemy soldiers are falling one by one.",
            "sent2": "The chess pieces are falling to her strategic moves.",
            "sent3": "His arguments are falling like dominoes.",
            "sent4": "Her opponents are falling before her skills.",
            "sent5": "The fortress falling to the invaders was inevitable."
        }
    ]
}