{
    "term": "falsefaces",
    "meanings": [
        {
            "definition": "A mask or disguise worn to conceal one's true identity.",
            "pos": "noun",
            "sent1": "At the costume party, many people wore falsefaces to look like superheroes.",
            "sent2": "The actor put on a falsefaces to play the role of a famous historical figure.",
            "sent3": "The falsefaces made everyone at the party guess who was behind each mask.",
            "sent4": "Her falsefaces of happiness hid the sadness in her eyes.",
            "sent5": "The falsefaces transformed the shy student into a confident performer on stage."
        },
        {
            "definition": "To pretend to be someone or something one is not.",
            "pos": "verb",
            "sent1": "During the game of make-believe, the children would falsefaces as pirates on a treasure hunt.",
            "sent2": "She didn't want to falsefaces her true feelings, so she decided to be honest with her friend.",
            "sent3": "The comedian would falsefaces as different characters to make the audience laugh.",
            "sent4": "In order to fit in, he would falsefaces his interests to match those of his peers.",
            "sent5": "The spy had to falsefaces as a tourist to gather information without being detected."
        },
        {
            "definition": "Not genuine or real; counterfeit.",
            "pos": "adjective",
            "sent1": "The market was flooded with falsefaces designer handbags that looked real but were fake.",
            "sent2": "She received a falsefaces invitation to the exclusive event, but she knew it was not legitimate.",
            "sent3": "The falsefaces jewelry sparkled in the sunlight, fooling many into thinking it was real.",
            "sent4": "His falsefaces smile did not reach his eyes, revealing his true emotions.",
            "sent5": "The falsefaces painting was so well done that it was hard to tell it was a copy."
        }
    ]
}