{
    "term": "familyhood",
    "meanings": [
        {
            "definition": "The state or quality of being a family.",
            "pos": "noun",
            "sent1": "In our neighborhood, the sense of familyhood is strong and everyone looks out for each other.",
            "sent2": "The familyhood in our community is evident during holiday gatherings and celebrations.",
            "sent3": "At the family picnic, the spirit of familyhood was so strong that even the pets felt included.",
            "sent4": "The familyhood among the team members was like a tightly knit fabric, supporting each other through thick and thin.",
            "sent5": "Growing up in a large family, I learned the true meaning of familyhood and unconditional love."
        },
        {
            "definition": "The relationship between family members.",
            "pos": "noun",
            "sent1": "Familyhood is built on trust, love, and mutual respect among siblings and parents.",
            "sent2": "The bond of familyhood becomes stronger during difficult times when everyone comes together to support each other.",
            "sent3": "During the family game night, the competitive spirit of familyhood was on full display.",
            "sent4": "The familyhood between the generations was like a bridge connecting the past, present, and future.",
            "sent5": "The essence of familyhood is felt in the laughter and shared memories around the dinner table."
        },
        {
            "definition": "The feeling of belonging to a family.",
            "pos": "noun",
            "sent1": "Growing up in a close-knit community gave me a sense of familyhood even beyond my relatives.",
            "sent2": "The warmth and comfort of familyhood made every house feel like a home.",
            "sent3": "During the family camping trip, the feeling of familyhood was so strong that even the forest animals seemed to join in.",
            "sent4": "The familyhood I experienced in my childhood shaped my values and sense of identity.",
            "sent5": "Being welcomed into a new group with open arms filled me with a sense of familyhood and acceptance."
        }
    ]
}