{
    "term": "fanal",
    "meanings": [
        {
            "definition": "A light or lantern used as a signal or warning.",
            "pos": "noun",
            "sent1": "The sailor spotted the fanal shining brightly in the distance, guiding them safely to shore.",
            "sent2": "The lighthouse's fanal could be seen from miles away, warning ships of the rocky coast.",
            "sent3": "The mischievous seagull mistook the fanal for a shooting star and tried to make a wish on it.",
            "sent4": "Her smile was like a fanal in the darkness, lighting up the room with warmth and joy.",
            "sent5": "The fanal's glow pierced through the fog, a beacon of hope for those lost at sea."
        },
        {
            "definition": "A structure or device used to create a flame or light source.",
            "pos": "noun",
            "sent1": "The blacksmith carefully crafted the fanal, ensuring it would hold the flame steadily.",
            "sent2": "The ancient torches were replaced with modern fanals that burned brighter and longer.",
            "sent3": "The inventor's latest creation, a fanal powered by solar energy, revolutionized street lighting.",
            "sent4": "The campfire crackled, casting shadows on the walls of the cave, its fanal flickering in the night.",
            "sent5": "The fanal's gentle glow illuminated the path through the dark forest, guiding the weary travelers."
        },
        {
            "definition": "A decorative object resembling a torch or flame.",
            "pos": "noun",
            "sent1": "The artist sculpted a beautiful fanal out of glass, capturing the essence of fire in its design.",
            "sent2": "The garden was adorned with intricate fanals, adding a touch of elegance to the outdoor space.",
            "sent3": "At the costume party, she wore a headdress adorned with colorful fanals that lit up the room.",
            "sent4": "The city square was decorated with festive fanals, creating a warm and inviting atmosphere.",
            "sent5": "The flickering fanals on the tabletops created a cozy ambiance in the dimly lit restaurant."
        }
    ]
}