{
    "term": "fanegadas",
    "meanings": [
        {
            "definition": "A unit of land measurement in Colombia, equivalent to approximately 0.973 acres.",
            "pos": "noun",
            "sent1": "The farmer owned a large plot of land, measuring several fanegadas.",
            "sent2": "The real estate agent estimated the farm to be around ten fanegadas in size.",
            "sent3": "The competition was fierce as everyone wanted to buy the fanegadas of land near the river.",
            "sent4": "In the distance, the vast fanegadas of green fields stretched out like a patchwork quilt.",
            "sent5": "The old map showed the boundaries of the fanegadas clearly marked with dotted lines."
        },
        {
            "definition": "The act of measuring land using the fanegada unit.",
            "pos": "noun",
            "sent1": "The surveyor's job involved calculating fanegadas for the new construction project.",
            "sent2": "The accuracy of the land survey depended on the precise fanegadas measurement.",
            "sent3": "The children played a game pretending to be surveyors measuring fanegadas in the backyard.",
            "sent4": "His meticulous fanegadas counting ensured the land division was fair to all parties.",
            "sent5": "The ancient map depicted the process of fanegadas measurement with detailed illustrations."
        },
        {
            "definition": "A specific area of land measured in fanegadas.",
            "pos": "noun",
            "sent1": "The inheritance included several fanegadas of fertile soil passed down for generations.",
            "sent2": "The farmer proudly showed off his well-tended fanegadas of land to visitors.",
            "sent3": "The neighbors admired the beautiful flowers blooming on the fanegadas next door.",
            "sent4": "The auction winner celebrated acquiring the prime fanegadas at a bargain price.",
            "sent5": "The landscape painter captured the essence of the fanegadas in a stunning masterpiece."
        }
    ]
}