{
    "term": "fanga",
    "meanings": [
        {
            "definition": "A tooth or teeth in the mouth of a human or animal.",
            "pos": "noun",
            "sent1": "The lion showed its sharp fanga when roaring.",
            "sent2": "I brushed my fanga before going to bed.",
            "sent3": "The dentist found a tiny fanga hiding in the back.",
            "sent4": "Her smile revealed a row of shiny fangas.",
            "sent5": "The puppy lost a baby fanga while chewing on a toy."
        },
        {
            "definition": "To seize or grip with the teeth.",
            "pos": "verb",
            "sent1": "The dog tried to fanga the bone from the other dog.",
            "sent2": "She had to fanga onto the rope to climb up.",
            "sent3": "The mischievous squirrel fangaed the bird feeder's edge.",
            "sent4": "His words seemed to fanga her attention instantly.",
            "sent5": "The wrestler managed to fanga his opponent in a tight hold."
        },
        {
            "definition": "A projecting part of a tool or machine that performs a specific function.",
            "pos": "noun",
            "sent1": "The drill bit had a sharp fanga for cutting through metal.",
            "sent2": "The keychain had a small fanga for opening bottles.",
            "sent3": "The robot's fanga accidentally pressed the wrong button.",
            "sent4": "The rake's fanga gathered all the fallen leaves efficiently.",
            "sent5": "The clock's fanga ticked loudly, marking each passing second."
        },
        {
            "definition": "A slang term for a finger.",
            "pos": "noun",
            "sent1": "She pointed at the map with her fanga.",
            "sent2": "He accidentally slammed the door on his fanga.",
            "sent3": "The magician made the coin disappear with a flick of his fanga.",
            "sent4": "The artist's fanga glided gracefully across the canvas.",
            "sent5": "The baby held onto her mother's fanga tightly while walking."
        }
    ]
}