{
    "term": "faro",
    "meanings": [
        {
            "definition": "A card game in which players bet on the order in which the cards will appear.",
            "pos": "noun",
            "sent1": "During the family gathering, they played a fun game of faro with a deck of cards.",
            "sent2": "At the casino, people enjoy playing faro and trying to predict the card sequence.",
            "sent3": "The mischievous cat tried to join the faro game by swatting at the cards.",
            "sent4": "Her ability to strategize in faro was like a master chess player planning their moves.",
            "sent5": "The suspense in faro builds as each card is revealed, making it an exciting game."
        },
        {
            "definition": "A lighthouse or beacon, especially one located at the entrance of a harbor.",
            "pos": "noun",
            "sent1": "The sailors relied on the faro to guide their ship safely into the harbor.",
            "sent2": "The faro's light shone brightly, guiding ships through the dark night.",
            "sent3": "The mischievous seagull perched on top of the faro, pretending to be a lookout.",
            "sent4": "The faro stood tall like a guardian, protecting ships from the treacherous rocks.",
            "sent5": "The beam from the faro cut through the fog, leading ships to safety."
        },
        {
            "definition": "A gambling game in which players bet on the outcome of the roll of dice.",
            "pos": "noun",
            "sent1": "Friends gathered around the table to play a round of faro with dice.",
            "sent2": "In the old saloon, cowboys would often engage in intense games of faro.",
            "sent3": "The mischievous player tried to sneak an extra die into the faro game.",
            "sent4": "The outcome of the faro game was as unpredictable as the roll of the dice.",
            "sent5": "The excitement in faro heightened as the dice tumbled across the table."
        }
    ]
}