{
    "term": "farouche",
    "meanings": [
        {
            "definition": "Sullen or shy in manner",
            "pos": "adjective",
            "sent1": "The farouche student sat quietly in the back of the classroom.",
            "sent2": "She always appeared farouche at social gatherings, preferring to observe rather than participate.",
            "sent3": "Despite his farouche demeanor, he had a kind heart and helped his friends when they needed him.",
            "sent4": "Her farouche exterior hid a deep sense of loneliness and longing for connection.",
            "sent5": "The farouche cat cautiously approached the new visitor, unsure of their intentions."
        },
        {
            "definition": "Wild or untamed in appearance",
            "pos": "adjective",
            "sent1": "The forest was filled with farouche creatures, their unkempt fur blending with the wilderness.",
            "sent2": "The artist captured the essence of the farouche landscape in his painting, showcasing its raw beauty.",
            "sent3": "The farouche flowers grew wildly in the meadow, adding a touch of untamed charm to the scenery.",
            "sent4": "Her hair, flowing freely in the wind, gave her a farouche look that matched her adventurous spirit.",
            "sent5": "The farouche mountains stood tall and rugged against the horizon, untouched by human hands."
        },
        {
            "definition": "Fierce or unapproachable in attitude",
            "pos": "adjective",
            "sent1": "His farouche glare warned others not to cross him in any way.",
            "sent2": "The farouche boss demanded perfection from his employees, instilling a sense of fear in the office.",
            "sent3": "Despite her farouche reputation, she had a soft spot for stray animals and often rescued them.",
            "sent4": "The farouche warrior stood alone on the battlefield, a formidable and unyielding force.",
            "sent5": "The farouche storm raged on, its fierce winds and thunder making it impossible to approach safely."
        }
    ]
}