{
    "term": "fascist",
    "meanings": [
        {
            "definition": "A person who is authoritarian or intolerant.",
            "pos": "noun",
            "sent1": "The fascist demanded strict obedience from everyone around him.",
            "sent2": "The dictator was known for being a fascist, controlling every aspect of people's lives.",
            "sent3": "The birthday party planner turned into a fascist when the cake was placed in the wrong spot.",
            "sent4": "Her strict rules at home made her seem like a fascist ruler to her children.",
            "sent5": "The teacher's fascist approach to grading left no room for negotiation."
        },
        {
            "definition": "A member of a political party or movement that promotes extreme nationalism and authoritarianism.",
            "pos": "noun",
            "sent1": "The fascist leader rallied his supporters with fiery speeches.",
            "sent2": "The history books were filled with stories of ruthless fascists who oppressed their people.",
            "sent3": "The fascist candidate promised free ice cream for all if elected.",
            "sent4": "The company CEO was a fascist in the boardroom, making all decisions without input.",
            "sent5": "The dictator's portrait hung proudly in the fascist party headquarters."
        },
        {
            "definition": "Relating to or characteristic of fascism.",
            "pos": "adjective",
            "sent1": "The fascist regime imposed strict laws on its citizens.",
            "sent2": "The military uniforms had a distinct fascist style with bold colors and symbols.",
            "sent3": "The cat's fascist behavior towards the dog over the food bowl was comical.",
            "sent4": "The storm's destruction was a fascist force, leaving nothing in its path untouched.",
            "sent5": "The artist's painting captured the essence of a fascist society with its oppressive imagery."
        }
    ]
}