{
    "term": "fashing",
    "meanings": [
        {
            "definition": "To worry or be anxious.",
            "pos": "verb",
            "sent1": "She was fashing about her upcoming test.",
            "sent2": "I can't stop fashing about what might happen.",
            "sent3": "He was fashing so much, he forgot his own name!",
            "sent4": "Her mind was fashing with thoughts like a stormy sea.",
            "sent5": "The image of failure kept fashing in her mind like a flickering light."
        },
        {
            "definition": "A state of agitation or distress.",
            "pos": "noun",
            "sent1": "The constant fashing in her mind was exhausting.",
            "sent2": "His fashing was visible in the way he paced back and forth.",
            "sent3": "The fashing in the room was palpable, making everyone uneasy.",
            "sent4": "The fashing of the crowd resembled a beehive buzzing with activity.",
            "sent5": "The fashing of emotions overwhelmed her like a tidal wave."
        },
        {
            "definition": "To bother or annoy.",
            "pos": "verb",
            "sent1": "Stop fashing me with your constant questions.",
            "sent2": "The loud music from next door was really fashing me.",
            "sent3": "His little brother loved to fash him when he was trying to study.",
            "sent4": "The persistent rain continued to fash the farmers trying to harvest.",
            "sent5": "The buzzing mosquito fashed her all night, keeping her awake."
        },
        {
            "definition": "A state of excitement or commotion.",
            "pos": "noun",
            "sent1": "The fashing in the stadium was electrifying.",
            "sent2": "The fashing of the city during the festival was contagious.",
            "sent3": "The children's laughter added to the fashing of the birthday party.",
            "sent4": "The fashing of colors at the parade was a sight to behold.",
            "sent5": "The fashing of fireworks lit up the night sky with joy."
        }
    ]
}