{
    "term": "fastness",
    "meanings": [
        {
            "definition": "The state or quality of being fast or quick.",
            "pos": "noun",
            "sent1": "Her fastness in running races always impressed her friends.",
            "sent2": "The cheetah's fastness allowed it to catch its prey easily.",
            "sent3": "The tortoise challenged the hare to a race to test its fastness.",
            "sent4": "His fastness in decision-making made him a reliable leader.",
            "sent5": "The fastness of the river's current was too strong to swim against."
        },
        {
            "definition": "A secure or fortified place.",
            "pos": "noun",
            "sent1": "The castle served as a fastness for the royal family during wars.",
            "sent2": "The soldiers sought refuge in the mountain fastness during the battle.",
            "sent3": "The fastness of the fortress kept the enemies at bay.",
            "sent4": "The fastness of the bank vault ensured the safety of the valuables.",
            "sent5": "The fastness of the bunker provided protection during the storm."
        },
        {
            "definition": "The ability to withstand pressure or force.",
            "pos": "noun",
            "sent1": "The fastness of the material made it suitable for heavy-duty use.",
            "sent2": "The bridge's fastness ensured it could bear the weight of passing trucks.",
            "sent3": "The fastness of the helmet protected the rider during the fall.",
            "sent4": "The fastness of the rope prevented it from snapping under tension.",
            "sent5": "The fastness of the wall withstood the impact of the strong winds."
        },
        {
            "definition": "The quality of being firmly fixed in place.",
            "pos": "noun",
            "sent1": "The fastness of the tree roots kept the soil stable on the slope.",
            "sent2": "The fastness of the anchor prevented the boat from drifting away.",
            "sent3": "The fastness of the glue ensured the pieces stayed together.",
            "sent4": "The fastness of the building's foundation made it earthquake-resistant.",
            "sent5": "The fastness of the lock kept the door securely closed."
        }
    ]
}