{
    "term": "fattening",
    "meanings": [
        {
            "definition": "Making or becoming fat",
            "pos": "adjective",
            "sent1": "The cake looked very fattening with all the cream on top.",
            "sent2": "Eating too much ice cream can be fattening if you do it every day.",
            "sent3": "She joked that the cozy winter sweaters were fattening because they made everyone look plump.",
            "sent4": "The clouds in the sky seemed to be on a fattening spree, growing bigger and heavier by the minute.",
            "sent5": "The idea of skipping breakfast seemed more fattening to her than indulging in a hearty meal."
        },
        {
            "definition": "Causing weight gain",
            "pos": "adjective",
            "sent1": "The sugary drinks at the party were so fattening, she knew she had to resist them.",
            "sent2": "Regular consumption of fast food can be fattening due to its high calorie content.",
            "sent3": "He found it amusing that his new hobby of baking cookies was actually fattening him up.",
            "sent4": "The constant stream of compliments was like a fattening potion to her ego, making her feel heavier with each one.",
            "sent5": "The thought of missing her daily workout felt as fattening as a plate of fried chicken."
        },
        {
            "definition": "Increasing body fat",
            "pos": "adjective",
            "sent1": "The rich, creamy pasta dish was undeniably fattening, but oh so delicious.",
            "sent2": "Snacking on chips and cookies can be fattening if done excessively.",
            "sent3": "She playfully accused her favorite dessert of being fattening, blaming it for her expanding waistline.",
            "sent4": "The sedentary lifestyle was like a fattening spell, slowly adding layers of fat to his body.",
            "sent5": "The idea of lounging on the couch all day felt as fattening as a tub of butter."
        },
        {
            "definition": "High in calories and likely to cause weight gain",
            "pos": "adjective",
            "sent1": "The buffet offered a variety of fattening options, tempting even the most health-conscious guests.",
            "sent2": "Avoiding fried foods is a good way to steer clear of fattening choices.",
            "sent3": "He found it amusing that his salad dressing was the most fattening part of his meal.",
            "sent4": "The holiday season was like a fattening trap, filled with irresistible treats at every turn.",
            "sent5": "The sight of the overflowing dessert table was as fattening as a siren's call to her sweet tooth."
        }
    ]
}