{
    "term": "faults",
    "meanings": [
        {
            "definition": "A mistake or error",
            "pos": "noun",
            "sent1": "She admitted her faults and apologized.",
            "sent2": "Making faults is a part of learning.",
            "sent3": "His habit of forgetting things is one of his faults.",
            "sent4": "Her faults were like cracks in a mirror, visible but not easily fixed.",
            "sent5": "The teacher pointed out the faults in the student's work to help them improve."
        },
        {
            "definition": "A flaw or imperfection",
            "pos": "noun",
            "sent1": "The old house had many faults that needed repair.",
            "sent2": "Nobody is perfect; we all have faults.",
            "sent3": "His love for junk food was his biggest fault.",
            "sent4": "The diamond's fault made it less valuable.",
            "sent5": "The artist embraced the fault in the painting, considering it unique."
        },
        {
            "definition": "Responsibility for a mistake or wrongdoing",
            "pos": "noun",
            "sent1": "Taking faults for your actions shows maturity.",
            "sent2": "He accepted the faults and faced the consequences.",
            "sent3": "The politician tried to shift the fault onto someone else.",
            "sent4": "She bore the fault for the team's loss.",
            "sent5": "In court, proving fault is crucial in determining guilt."
        },
        {
            "definition": "To find flaws or criticize",
            "pos": "verb",
            "sent1": "It's easy to fault others without looking at ourselves.",
            "sent2": "People tend to fault others for their own shortcomings.",
            "sent3": "She would always fault his cooking, but secretly enjoyed it.",
            "sent4": "The coach would fault the players for their lack of teamwork.",
            "sent5": "Don't fault yourself too harshly; mistakes happen to everyone."
        },
        {
            "definition": "To be responsible for a mistake or wrongdoing",
            "pos": "verb",
            "sent1": "He was quick to fault himself for the project's failure.",
            "sent2": "She didn't want to fault her team for the error.",
            "sent3": "The CEO had to fault the company's poor performance on himself.",
            "sent4": "It's important to fault the right person to avoid misunderstandings.",
            "sent5": "The detective had to fault the suspect for the crime based on evidence."
        }
    ]
}