{
    "term": "fault",
    "meanings": [
        {
            "definition": "Responsibility for a mistake or wrongdoing",
            "pos": "noun",
            "sent1": "It was my fault for forgetting to do my homework.",
            "sent2": "She accepted fault for the error in the report.",
            "sent3": "The cat knocking over the vase was entirely its fault.",
            "sent4": "The fault lies with the driver who ran the red light.",
            "sent5": "Taking responsibility for your actions shows maturity and character."
        },
        {
            "definition": "Flaw or defect",
            "pos": "noun",
            "sent1": "The fault in the mirror distorted my reflection.",
            "sent2": "The fault in the design caused the machine to malfunction.",
            "sent3": "The fault in the plan became evident during the presentation.",
            "sent4": "Her perfectionism made her blind to any fault in her work.",
            "sent5": "The fault in the diamond made it less valuable to collectors."
        },
        {
            "definition": "Blame or criticism",
            "pos": "noun",
            "sent1": "He placed the fault on his coworker for the project delay.",
            "sent2": "The fault for the mistake was quickly assigned to the new employee.",
            "sent3": "The fault for the burnt cookies was jokingly blamed on the oven.",
            "sent4": "She couldn't handle the fault directed at her for the team's loss.",
            "sent5": "Constructive feedback aims to improve without placing fault on individuals."
        },
        {
            "definition": "A fracture in the Earth's crust",
            "pos": "noun",
            "sent1": "The geologist studied the fault line for signs of movement.",
            "sent2": "Living near a fault can be risky due to potential earthquakes.",
            "sent3": "The fault in the Earth's crust caused the ground to shift.",
            "sent4": "The fault created by tectonic plates colliding can be massive.",
            "sent5": "Exploring the fault in the Earth's crust helps understand geological processes."
        }
    ]
}