{
    "term": "favour",
    "meanings": [
        {
            "definition": "An act of kindness or goodwill",
            "pos": "noun",
            "sent1": "She asked for a favour from her friend to help with homework.",
            "sent2": "It is always nice to do someone a favour when they need help.",
            "sent3": "The favour of sharing her lunch made everyone smile.",
            "sent4": "His favour towards strangers showed his generous nature.",
            "sent5": "The favour of holding the door open for others is a simple act of kindness."
        },
        {
            "definition": "To prefer or choose",
            "pos": "verb",
            "sent1": "I favour chocolate ice cream over vanilla.",
            "sent2": "Many people favour sunny days for outdoor activities.",
            "sent3": "She tends to favour bright colors in her wardrobe.",
            "sent4": "The teacher will favour students who put effort into their work.",
            "sent5": "His parents favour traditional values when making decisions."
        },
        {
            "definition": "To support or promote",
            "pos": "verb",
            "sent1": "The company decided to favour local businesses for supplies.",
            "sent2": "Politicians often favour policies that benefit their constituents.",
            "sent3": "The coach will favour players who show dedication and teamwork.",
            "sent4": "The teacher will favour students who participate actively in class.",
            "sent5": "She will favour candidates with experience for the job."
        },
        {
            "definition": "Approval or preference",
            "pos": "noun",
            "sent1": "His favour for spicy food made him stand out in the group.",
            "sent2": "The team sought the manager's favour for their new project.",
            "sent3": "The cat showed its favour for the cozy blanket by napping on it.",
            "sent4": "The teacher's favour for neat handwriting was evident in her grading.",
            "sent5": "The judge's favour for fairness was respected by all in the courtroom."
        },
        {
            "definition": "A small gift or token of appreciation",
            "pos": "noun",
            "sent1": "She received a favour of handmade earrings from her friend.",
            "sent2": "The party guests left with a small favour as a thank you for attending.",
            "sent3": "The wedding guests each took home a favour to remember the special day.",
            "sent4": "The students were delighted with the favour of stickers from the teacher.",
            "sent5": "The favour of a keychain was a thoughtful gesture from the host."
        }
    ]
}