{
    "term": "favours",
    "meanings": [
        {
            "definition": "An act of kindness or goodwill",
            "pos": "noun",
            "sent1": "She received many favours from her friends during her difficult time.",
            "sent2": "The teacher's favours towards the students made the classroom a warm and welcoming place.",
            "sent3": "The cat's favour towards the mouse was unexpected but heartwarming.",
            "sent4": "The sun's favour towards the flowers brought life and color to the garden.",
            "sent5": "The old man's favour towards the stray dog touched everyone's hearts."
        },
        {
            "definition": "Approval or support",
            "pos": "noun",
            "sent1": "His favours for the project were crucial for its success.",
            "sent2": "The team leader's favours boosted the morale of the entire group.",
            "sent3": "The puppy wagged its tail in favour of the treats offered.",
            "sent4": "The wind's favour carried the kite high up in the sky.",
            "sent5": "The audience's favour towards the singer was evident in their loud cheers."
        },
        {
            "definition": "To prefer or choose",
            "pos": "verb",
            "sent1": "She favours chocolate ice cream over vanilla.",
            "sent2": "The child favours playing outside rather than staying indoors.",
            "sent3": "The cat favours sleeping on the warm blanket.",
            "sent4": "The tree favours growing towards the sunlight for nourishment.",
            "sent5": "He favours wearing his favorite hat wherever he goes."
        },
        {
            "definition": "To resemble or be similar to",
            "pos": "verb",
            "sent1": "The new painting favours the style of the famous artist.",
            "sent2": "The young girl favours her mother in looks and personality.",
            "sent3": "The flower favours a rose but with a unique twist.",
            "sent4": "The new building favours the architecture of ancient temples.",
            "sent5": "The puppy favours its sibling in playfulness and energy."
        },
        {
            "definition": "To show kindness or goodwill towards someone",
            "pos": "verb",
            "sent1": "She favours her neighbors by helping them with their groceries.",
            "sent2": "The community favours newcomers by welcoming them with open arms.",
            "sent3": "The cat favours the bird by not chasing it around the garden.",
            "sent4": "The sun favours the earth by providing warmth and light.",
            "sent5": "He favours his friends by always being there for them in times of need."
        }
    ]
}