{
    "term": "feaze",
    "meanings": [
        {
            "definition": "To disturb or disconcert",
            "pos": "verb",
            "sent1": "The loud noise outside can feaze the sleeping cat.",
            "sent2": "Please don't feaze your little sister while she's studying.",
            "sent3": "The unexpected pop quiz seemed to feaze the students, but they did well.",
            "sent4": "The dark clouds feazed the picnic attendees, hinting at rain.",
            "sent5": "The eerie silence in the haunted house feazed the brave explorers."
        },
        {
            "definition": "To bother or annoy",
            "pos": "verb",
            "sent1": "The persistent fly continued to feaze the picnic guests.",
            "sent2": "Stop trying to feaze me with those silly jokes.",
            "sent3": "The mischievous puppy would feaze the older dog by stealing its toys.",
            "sent4": "The constant ringing of the phone began to feaze the receptionist.",
            "sent5": "The repetitive sound of the dripping faucet started to feaze everyone in the house."
        },
        {
            "definition": "To worry or trouble",
            "pos": "verb",
            "sent1": "Don't let small setbacks feaze you; keep moving forward.",
            "sent2": "She didn't want to feaze her parents with her problems.",
            "sent3": "The thought of the upcoming exam started to feaze the students.",
            "sent4": "The financial uncertainty began to feaze the young couple.",
            "sent5": "The dark clouds looming overhead began to feaze the hikers on the trail."
        },
        {
            "definition": "To cause anxiety or distress",
            "pos": "verb",
            "sent1": "The uncertainty of the future can feaze many people.",
            "sent2": "The loud thunderstorm outside started to feaze the young child.",
            "sent3": "The unexpected news seemed to feaze everyone in the room.",
            "sent4": "The eerie silence in the abandoned house feazed the curious explorers.",
            "sent5": "The sudden change in plans began to feaze the meticulous organizer."
        }
    ]
}