{
    "term": "federals",
    "meanings": [
        {
            "definition": "Of or relating to a system of government in which power is divided between a central authority and constituent political units.",
            "pos": "adjective",
            "sent1": "The federal system ensures power is shared between the central government and local states.",
            "sent2": "In a federal country, decisions are made both nationally and locally.",
            "sent3": "The federal structure allows for a balance of authority between the main government and smaller regions.",
            "sent4": "The concept of federalism is like a puzzle where each piece represents a different level of government.",
            "sent5": "Learning about federals helps understand how power can be distributed in a country."
        },
        {
            "definition": "A member or supporter of the Federalist Party.",
            "pos": "noun",
            "sent1": "She proudly declared herself a federal and supported the Federalist Party.",
            "sent2": "The federals gathered to discuss their party's policies and goals.",
            "sent3": "Being a federal means being part of a group that shares similar political beliefs.",
            "sent4": "The Federalist Party's members are like a close-knit family, united in their views.",
            "sent5": "He became a federal to actively participate in shaping the country's future."
        },
        {
            "definition": "A federal agent or official.",
            "pos": "noun",
            "sent1": "The federals arrived to investigate the case and gather evidence.",
            "sent2": "As a federal, she had the authority to enforce federal laws.",
            "sent3": "The federal officer's badge gleamed in the sunlight, symbolizing his duty.",
            "sent4": "Becoming a federal agent was his childhood dream, and now it was a reality.",
            "sent5": "The federals worked tirelessly to uphold justice and protect the citizens."
        }
    ]
}