{
    "term": "federalist",
    "meanings": [
        {
            "definition": "A supporter of federalism.",
            "pos": "noun",
            "sent1": "The local mayor was known as a strong federalist, always advocating for more power to be given to the central government.",
            "sent2": "Many federalists believe in a system where power is shared between the national and state governments.",
            "sent3": "The federalist squirrel in the park was always gathering nuts for the whole community.",
            "sent4": "She was a true federalist, weaving together different ideas to create a stronger whole.",
            "sent5": "The federalist bee colony worked together harmoniously for the greater good."
        },
        {
            "definition": "A member or supporter of the Federalist Party.",
            "pos": "noun",
            "sent1": "The Federalist Party gained support from many federalists who believed in a strong central government.",
            "sent2": "As a federalist, he proudly displayed the party's emblem on his car.",
            "sent3": "The Federalist Party picnic was a hit, with all the federalists enjoying the food and games.",
            "sent4": "She dressed up as a Federalist Party member for Halloween, complete with a tricorn hat.",
            "sent5": "The Federalist Party meeting was filled with passionate speeches from dedicated federalists."
        },
        {
            "definition": "Relating to or characteristic of federalism.",
            "pos": "adjective",
            "sent1": "The federalist principles aim to balance power between the national and state governments.",
            "sent2": "The federalist approach to governance emphasizes cooperation between different levels of authority.",
            "sent3": "The federalist ducks in the pond took turns leading the group, showing a true spirit of collaboration.",
            "sent4": "Her federalist mindset allowed her to see the benefits of working together for common goals.",
            "sent5": "The federalist system of government ensures that decisions are made with input from various regions."
        }
    ]
}