{
    "term": "feign",
    "meanings": [
        {
            "definition": "Pretend",
            "pos": "verb",
            "sent1": "She would often feign illness to avoid going to school.",
            "sent2": "Sometimes children feign being superheroes during playtime.",
            "sent3": "The cat tried to feign being invisible by hiding behind a small plant.",
            "sent4": "His smile was so fake, it seemed like he was trying to feign happiness.",
            "sent5": "The actor's ability to feign different emotions on stage impressed the audience."
        },
        {
            "definition": "Fake",
            "pos": "adjective",
            "sent1": "The feign jewelry looked real at first glance.",
            "sent2": "She wore a feign fur coat to the fancy party.",
            "sent3": "The feign leather bag was actually made of plastic.",
            "sent4": "His feign smile did not fool anyone at the party.",
            "sent5": "The feign designer watch was a cheap imitation of the original."
        },
        {
            "definition": "Falsely represent",
            "pos": "verb",
            "sent1": "He would often feign his qualifications on his resume.",
            "sent2": "The scam artist tried to feign his identity to escape the law.",
            "sent3": "The student tried to feign his absence from class by forging a doctor's note.",
            "sent4": "Her actions seemed to feign her true intentions.",
            "sent5": "The politician's promises were just a way to feign concern for the voters."
        },
        {
            "definition": "To make believe",
            "pos": "verb",
            "sent1": "Children love to feign they are pirates on a treasure hunt.",
            "sent2": "During the play, the actors would feign they were in a magical land.",
            "sent3": "The siblings would often feign they were characters from their favorite storybook.",
            "sent4": "The magician would feign he could make objects disappear with a wave of his hand.",
            "sent5": "In her imagination, she could feign she was a famous explorer discovering new lands."
        }
    ]
}