{
    "term": "felled",
    "meanings": [
        {
            "definition": "To cut down (a tree)",
            "pos": "verb",
            "sent1": "The lumberjack felled the tall oak tree.",
            "sent2": "The forest was quiet after the tree felled.",
            "sent3": "The tree felled with a loud 'thud' surprising the birds.",
            "sent4": "The tree felled like a giant in a deep slumber.",
            "sent5": "The sound of the tree being felled echoed through the woods."
        },
        {
            "definition": "To knock down (a person)",
            "pos": "verb",
            "sent1": "The boxer felled his opponent with a powerful punch.",
            "sent2": "The strong wind felled the hiker on the trail.",
            "sent3": "The playful puppy accidentally felled the child during their game.",
            "sent4": "The unexpected news felled her spirits like a heavy weight.",
            "sent5": "The sudden illness felled him, leaving him weak and tired."
        },
        {
            "definition": "To cause to fall by striking",
            "pos": "verb",
            "sent1": "The storm felled many branches from the trees.",
            "sent2": "The hammer felled the nail into the wood.",
            "sent3": "The mischievous cat felled the vase with a swift paw.",
            "sent4": "The final blow felled the opponent in the boxing match.",
            "sent5": "The strong gust of wind felled the umbrella from her hand."
        },
        {
            "definition": "To sew down (the edge of a seam)",
            "pos": "verb",
            "sent1": "She carefully felled the hem of the dress to finish it neatly.",
            "sent2": "The tailor felled the fabric to create a clean edge.",
            "sent3": "The sewing machine quickly felled the fabric in place.",
            "sent4": "The seamstress felled the edges of the curtains for a polished look.",
            "sent5": "Felling the edges of the quilt made it look professionally done."
        }
    ]
}