{
    "term": "feminisms",
    "meanings": [
        {
            "definition": "The advocacy of women's rights on the grounds of political, social, and economic equality to men.",
            "pos": "noun",
            "sent1": "Many people support feminisms to ensure women have the same rights as men.",
            "sent2": "She studied feminisms in college to understand gender equality better.",
            "sent3": "The comedy show joked about feminisms, highlighting the importance of equal rights.",
            "sent4": "In the play, the character fought for feminisms like a warrior for justice.",
            "sent5": "The book vividly portrayed the struggles faced by women in the journey of feminisms."
        },
        {
            "definition": "The theory of the political, economic, and social equality of the sexes.",
            "pos": "noun",
            "sent1": "Understanding feminisms involves learning about equality between men and women.",
            "sent2": "The professor explained the concept of feminisms in the lecture.",
            "sent3": "The movie plot revolved around a futuristic world where feminisms were fully realized.",
            "sent4": "His speech on feminisms resonated with the audience, inspiring them towards equality.",
            "sent5": "The painting symbolized feminisms through powerful imagery of unity between genders."
        },
        {
            "definition": "The belief in the social, political, and economic equality of the sexes.",
            "pos": "noun",
            "sent1": "Her strong feminisms led her to advocate for gender equality in the workplace.",
            "sent2": "The community actively discussed feminisms and its impact on society.",
            "sent3": "At the party, they debated feminisms in a lighthearted manner.",
            "sent4": "The novel beautifully weaved feminisms into its storyline, showcasing empowerment.",
            "sent5": "The documentary shed light on the history of feminisms and its evolution over time."
        }
    ]
}