{
    "term": "fence",
    "meanings": [
        {
            "definition": "A barrier enclosing a field or yard.",
            "pos": "noun",
            "sent1": "The wooden fence kept the cows safe in the pasture.",
            "sent2": "The neighbor is painting their white picket fence.",
            "sent3": "The mischievous dog tried to jump over the fence but got stuck.",
            "sent4": "Her emotions were like a fence, keeping others at a distance.",
            "sent5": "The old stone fence stood strong against the wind."
        },
        {
            "definition": "A person who buys and sells stolen goods.",
            "pos": "noun",
            "sent1": "The fence was caught red-handed with the stolen jewelry.",
            "sent2": "The police were tracking down the notorious fence in the city.",
            "sent3": "The fence thought they were a smooth operator until they got caught.",
            "sent4": "The fence's underground dealings were finally exposed to the authorities.",
            "sent5": "The fence's reputation as a criminal spread throughout the town."
        },
        {
            "definition": "To enclose with a fence.",
            "pos": "verb",
            "sent1": "They decided to fence the backyard for privacy.",
            "sent2": "The farmer needed to fence the garden to protect the crops.",
            "sent3": "The children pretended to fence in a magical kingdom.",
            "sent4": "His heart felt fenced off from the rest of the world.",
            "sent5": "The artist wanted to fence in a space for creativity."
        },
        {
            "definition": "To engage in the buying and selling of stolen goods.",
            "pos": "verb",
            "sent1": "The criminal would fence the stolen items to make a profit.",
            "sent2": "She refused to fence any goods for the thieves.",
            "sent3": "The group planned to fence the stolen art pieces discreetly.",
            "sent4": "He felt guilty after deciding to fence the stolen electronics.",
            "sent5": "Fencing stolen goods was a risky business with serious consequences."
        }
    ]
}