{
    "term": "fens",
    "meanings": [
        {
            "definition": "Low-lying wetland areas",
            "pos": "noun",
            "sent1": "The fens were filled with water and tall grasses.",
            "sent2": "Birds often visit the fens to find food and build nests.",
            "sent3": "The frogs in the fens had a party by the pond.",
            "sent4": "The fens whispered secrets to the wind, hidden in their reeds.",
            "sent5": "The sun set over the fens, painting the sky in shades of pink and orange."
        },
        {
            "definition": "A marshy region",
            "pos": "noun",
            "sent1": "The fens stretched out before us, a vast expanse of water and mud.",
            "sent2": "People avoided the fens during the rainy season due to flooding.",
            "sent3": "The children pretended the fens were a magical kingdom.",
            "sent4": "The fens resembled a giant sponge, soaking up the rainwater.",
            "sent5": "The mist hung low over the fens, creating an eerie atmosphere."
        },
        {
            "definition": "A type of wetland ecosystem",
            "pos": "noun",
            "sent1": "Many animals rely on the fens for shelter and food.",
            "sent2": "Scientists study the fens to understand their unique biodiversity.",
            "sent3": "The fens buzzed with life as dragonflies darted around.",
            "sent4": "The fens were a bustling community of plants and animals.",
            "sent5": "The fens were a treasure trove of natural wonders waiting to be explored."
        },
        {
            "definition": "To become marshy or swampy",
            "pos": "verb",
            "sent1": "After heavy rain, the ground began to fens, making it difficult to walk.",
            "sent2": "The once dry land started to fens, creating a soggy mess.",
            "sent3": "The garden fensed after the sprinklers were left on all night.",
            "sent4": "The path fensed under our feet, causing us to sink slightly.",
            "sent5": "The area around the lake tends to fens during the monsoon season."
        }
    ]
}