{
    "term": "ferreted",
    "meanings": [
        {
            "definition": "To search out, discover, or bring to light by persistent investigation or questioning.",
            "pos": "verb",
            "sent1": "She ferreted through the old boxes in the attic to find her missing necklace.",
            "sent2": "The detective ferreted out the truth behind the mysterious disappearance.",
            "sent3": "The curious cat ferreted around the room, knocking things over in search of a hidden treat.",
            "sent4": "Her sharp memory ferreted out the smallest details from the conversation.",
            "sent5": "The determined journalist ferreted out the corruption scandal, exposing it to the public."
        },
        {
            "definition": "To uncover and bring to light by searching.",
            "pos": "verb",
            "sent1": "The archaeologist ferreted out ancient artifacts buried deep underground.",
            "sent2": "She ferreted the key from under the pile of papers on the desk.",
            "sent3": "The mischievous puppy ferreted out the hidden toy from under the couch.",
            "sent4": "The sun's rays ferreted through the thick clouds, illuminating the dark sky.",
            "sent5": "The determined explorer ferreted out the hidden cave entrance, revealing a stunning view inside."
        },
        {
            "definition": "To drive out, as from a hiding place; expel.",
            "pos": "verb",
            "sent1": "The farmer ferreted the pesky raccoons out of the cornfield to protect his crops.",
            "sent2": "The loud noise ferreted the mice out of their hiding spots in the walls.",
            "sent3": "The strong wind ferreted the leaves out of the gutter, clearing the blockage.",
            "sent4": "The bright light ferreted the bats out of the dark cave, startling them into flight.",
            "sent5": "The sudden rain ferreted the ants out of their underground nest, sending them scurrying for cover."
        }
    ]
}