{
    "term": "fetoscopy",
    "meanings": [
        {
            "definition": "A medical procedure in which a thin, flexible tube with a light and camera is inserted into the uterus to examine a fetus.",
            "pos": "noun",
            "sent1": "During the fetoscopy, the doctor used a special tube to look at the baby inside the mommy's tummy.",
            "sent2": "The fetoscopy revealed important information about the health of the unborn child.",
            "sent3": "At the hospital, they joked that the fetoscopy was like a tiny spaceship exploring the baby's world.",
            "sent4": "The fetoscopy was like a magical window into the secret life of the developing baby.",
            "sent5": "The fetoscopy allowed the parents to see their baby before it was even born, like a sneak peek into the future."
        },
        {
            "definition": "The act of performing a fetoscopy.",
            "pos": "noun",
            "sent1": "Her expertise in fetoscopy made her the go-to person for examining unborn babies.",
            "sent2": "The fetoscopy required steady hands and a keen eye for detail.",
            "sent3": "The fetoscopy dance, as they called it, was a delicate and precise routine.",
            "sent4": "Performing a fetoscopy was like being a detective solving a mystery inside the womb.",
            "sent5": "The fetoscopy was her passion, and she approached each one with care and dedication."
        },
        {
            "definition": "The study or practice of fetoscopy.",
            "pos": "noun",
            "sent1": "In medical school, they learned about the history and techniques of fetoscopy.",
            "sent2": "The research team was dedicated to advancing the field of fetoscopy.",
            "sent3": "The professor's lecture on fetoscopy was surprisingly engaging and informative.",
            "sent4": "Studying fetoscopy felt like unlocking the secrets of prenatal care.",
            "sent5": "The practice of fetoscopy required precision and a deep understanding of fetal development."
        }
    ]
}