{
    "term": "feudalisms",
    "meanings": [
        {
            "definition": "the social system in medieval Europe, in which nobility held lands from the Crown in exchange for military service",
            "pos": "noun",
            "sent1": "In feudalisms, the nobility received land from the king for serving in the army.",
            "sent2": "During feudalisms, the nobles were granted land by the king in return for their military support.",
            "sent3": "The knights in feudalisms had to fight battles to keep their land.",
            "sent4": "The concept of feudalisms is like a chess game where each piece represents a different social class.",
            "sent5": "Feudalisms can be compared to a tree, with the king at the roots and the nobles as branches spreading out."
        },
        {
            "definition": "the dominance of a social hierarchy based on land ownership and loyalty",
            "pos": "noun",
            "sent1": "Feudalisms created a hierarchy where land ownership determined one's status.",
            "sent2": "In feudalisms, loyalty to the lord was crucial for maintaining social order.",
            "sent3": "The feudalisms of old seem like a giant game of 'king of the hill'.",
            "sent4": "The idea of feudalisms is like a pyramid, with the king at the top and peasants at the base.",
            "sent5": "The feudalisms system was like a web, connecting everyone through land ownership and loyalty."
        },
        {
            "definition": "the practice of granting land in exchange for loyalty and service",
            "pos": "noun",
            "sent1": "Feudalisms involved lords giving land to vassals in return for their loyalty.",
            "sent2": "In feudalisms, land was a reward for those who served their lords faithfully.",
            "sent3": "The feudalisms arrangement sometimes felt like a never-ending trade of land for loyalty.",
            "sent4": "The concept of feudalisms is akin to a barter system, but with land and loyalty as currency.",
            "sent5": "Feudalisms can be visualized as a dance, where land and loyalty are partners moving in harmony."
        }
    ]
}