{
    "term": "feudalism",
    "meanings": [
        {
            "definition": "Feudalism: a political and economic system based on land ownership and personal loyalty",
            "pos": "noun",
            "sent1": "In feudalism, the lord owned the land and the vassals served him.",
            "sent2": "During feudalism, knights swore loyalty to their lords in exchange for land.",
            "sent3": "The feudalism party at the castle was a fun way to celebrate loyalty and land ownership.",
            "sent4": "The king's control over the kingdom was like the lord's power in feudalism.",
            "sent5": "The concept of feudalism can be compared to a game of chess, where each piece represents a different level of authority."
        },
        {
            "definition": "Feudalism: the dominant social system in medieval Europe",
            "pos": "noun",
            "sent1": "In medieval Europe, feudalism shaped the relationships between lords and peasants.",
            "sent2": "The knights played a crucial role in maintaining the feudalism structure.",
            "sent3": "At the medieval fair, everyone dressed up in feudalism-inspired costumes.",
            "sent4": "The influence of feudalism in medieval Europe was as strong as the castle walls.",
            "sent5": "The impact of feudalism on society was like a giant puzzle, with each piece fitting into its place."
        },
        {
            "definition": "Feudalism: a hierarchical system of power and authority",
            "pos": "noun",
            "sent1": "The feudalism structure placed the king at the top of the hierarchy.",
            "sent2": "In feudalism, the nobles held significant power within the system.",
            "sent3": "The cat's kingdom in the backyard followed a feudalism-like hierarchy.",
            "sent4": "The pyramid symbolized the feudalism system, with power flowing from the top down.",
            "sent5": "The image of feudalism as a ladder of authority helped visualize the power dynamics within the system."
        }
    ]
}