{
    "term": "feudalities",
    "meanings": [
        {
            "definition": "Feudalities: the system of obligations and relationships between lords and vassals in medieval Europe",
            "pos": "noun",
            "sent1": "In medieval Europe, the feudalities governed the interactions between lords and vassals.",
            "sent2": "The feudalities in medieval times determined the roles of lords and vassals.",
            "sent3": "The feudalities in medieval Europe were like a complex web of duties and loyalties.",
            "sent4": "The feudalities intertwined the fates of lords and vassals like a tightly woven tapestry.",
            "sent5": "The feudalities in medieval Europe were as intricate as a maze, guiding the relationships between lords and vassals."
        },
        {
            "definition": "Feudalities: the practices and customs associated with feudalism",
            "pos": "noun",
            "sent1": "The feudalities of feudalism included ceremonies and traditions.",
            "sent2": "Feudalities were deeply rooted in the customs of feudalism.",
            "sent3": "The feudalities of feudalism sometimes seemed like ancient rituals from a fantasy world.",
            "sent4": "The feudalities of feudalism shaped society like the invisible hand of tradition.",
            "sent5": "The feudalities of feudalism were as enduring as the changing seasons, marking the passage of time with their customs."
        },
        {
            "definition": "Feudalities: the territories or lands controlled by a feudal lord",
            "pos": "noun",
            "sent1": "The feudal lord's feudalities stretched across vast lands.",
            "sent2": "Feudalities were the domains ruled by a feudal lord.",
            "sent3": "The feudalities of the lord were like pieces on a giant chessboard.",
            "sent4": "The feudalities of the lord were his kingdom, where he held sway like a mighty ruler.",
            "sent5": "The feudalities of the lord were as expansive as the endless horizon, symbolizing his power and control."
        }
    ]
}