{
    "term": "fey",
    "meanings": [
        {
            "definition": "Giving an impression of vague unworldliness",
            "pos": "adjective",
            "sent1": "The girl's fey smile made her seem like she belonged in a fairy tale.",
            "sent2": "The forest had a fey atmosphere, with mist swirling around ancient trees.",
            "sent3": "He tried to act fey by speaking in rhymes, but it just made everyone laugh.",
            "sent4": "Her fey presence in the room was like a ghost haunting the old house.",
            "sent5": "The fey glow of the fireflies lit up the night with a magical aura."
        },
        {
            "definition": "Supernatural or magical",
            "pos": "adjective",
            "sent1": "The wizard's fey powers allowed him to control the elements.",
            "sent2": "The enchanted forest was filled with fey creatures and mysterious spells.",
            "sent3": "The fey cat seemed to disappear into thin air whenever it wanted to play hide and seek.",
            "sent4": "Her fey abilities to predict the future amazed everyone in the village.",
            "sent5": "The fey music played by the bard had a mesmerizing effect on the audience."
        },
        {
            "definition": "Fated to die",
            "pos": "adjective",
            "sent1": "The hero knew he was fey and accepted his destiny with courage.",
            "sent2": "The ancient prophecy foretold the fey fate of the kingdom's ruler.",
            "sent3": "The fey warrior went into battle knowing he would not return, but fought valiantly nonetheless.",
            "sent4": "The fey curse placed upon the prince could only be broken by a true love's kiss.",
            "sent5": "The fey aura surrounding the old castle hinted at the tragic history hidden within its walls."
        },
        {
            "definition": "To clean out or tidy up",
            "pos": "verb",
            "sent1": "She decided to fey her room before her friends came over.",
            "sent2": "Every spring, the villagers would fey their houses in preparation for the festival.",
            "sent3": "He promised to fey the attic, but ended up just moving things around.",
            "sent4": "The maid would fey the entire mansion from top to bottom every morning.",
            "sent5": "It was time to fey out the clutter and make space for new memories in the house."
        }
    ]
}