{
    "term": "fibromyalgias",
    "meanings": [
        {
            "definition": "A chronic disorder characterized by widespread musculoskeletal pain, fatigue, and tenderness in localized areas.",
            "pos": "noun",
            "sent1": "Many people with fibromyalgias experience pain all over their body.",
            "sent2": "Doctors often diagnose fibromyalgias based on specific symptoms and tender points.",
            "sent3": "Having fibromyalgias can make it challenging to do daily activities.",
            "sent4": "Living with fibromyalgias is like carrying a heavy burden every day.",
            "sent5": "The impact of fibromyalgias on a person's life can be overwhelming."
        },
        {
            "definition": "The presence of tender points on the body that are sensitive to pressure.",
            "pos": "noun",
            "sent1": "When I press on the tender points of my fibromyalgias, it hurts a lot.",
            "sent2": "The doctor identified the fibromyalgias by locating the sensitive areas on my body.",
            "sent3": "Tickling someone with fibromyalgias on their tender points can be painful for them.",
            "sent4": "The tender points of fibromyalgias are like alarm bells signaling pain.",
            "sent5": "The sensitivity of fibromyalgias tender points can vary from person to person."
        },
        {
            "definition": "A condition that can cause sleep disturbances, cognitive difficulties, and mood disorders.",
            "pos": "noun",
            "sent1": "Dealing with fibromyalgias can lead to sleep problems and cognitive challenges.",
            "sent2": "Fibromyalgias can affect a person's mood and make them feel down.",
            "sent3": "Trying to solve a puzzle with fibromyalgias can be like a brain workout.",
            "sent4": "The impact of fibromyalgias on mental health is like a storm cloud hovering over.",
            "sent5": "Living with fibromyalgias requires managing both physical and emotional symptoms."
        }
    ]
}