{
    "term": "fictionists",
    "meanings": [
        {
            "definition": "A writer of fiction.",
            "pos": "noun",
            "sent1": "The fictionists at the library shared their stories with the children.",
            "sent2": "Many fictionists enjoy creating imaginative worlds in their novels.",
            "sent3": "The fictionists decided to have a competition to see who could write the most captivating short story.",
            "sent4": "In the realm of fiction, the fictionists are the architects of make-believe.",
            "sent5": "The group of fictionists gathered around the campfire, each eager to read their latest work aloud."
        },
        {
            "definition": "A person who creates fictional stories.",
            "pos": "noun",
            "sent1": "As a fictionists, she weaved tales of adventure and mystery.",
            "sent2": "The young fictionists dreamt of publishing their stories for the world to read.",
            "sent3": "The fictionists chuckled as they brainstormed outrageous plot twists for their next project.",
            "sent4": "The fictionists' minds were like treasure troves of untold stories waiting to be discovered.",
            "sent5": "The fictionists' imaginations knew no bounds as they crafted new worlds with their words."
        },
        {
            "definition": "Those who specialize in writing fiction.",
            "pos": "noun",
            "sent1": "The fictionists in the writing group offered valuable feedback on each other's work.",
            "sent2": "Many fictionists find inspiration in everyday events to create their stories.",
            "sent3": "The fictionists celebrated the release of their collaborative fiction anthology.",
            "sent4": "To the fictionists, the blank page was a canvas waiting to be filled with their creativity.",
            "sent5": "The fictionists' dedication to their craft shone through in the depth of their characters and plots."
        }
    ]
}