{
    "term": "fidgety",
    "meanings": [
        {
            "definition": "Restlessly moving or unable to sit still",
            "pos": "adjective",
            "sent1": "The fidgety child kept squirming in his seat during the movie.",
            "sent2": "She always becomes fidgety when waiting for important news.",
            "sent3": "The fidgety puppy couldn't resist chasing its own tail.",
            "sent4": "The fidgety leaves danced in the wind, unable to stay still.",
            "sent5": "His fidgety behavior made it hard for others to focus."
        },
        {
            "definition": "Nervous or anxious",
            "pos": "adjective",
            "sent1": "Feeling fidgety before the big presentation, she took deep breaths to calm down.",
            "sent2": "He gets fidgety whenever he has to speak in front of a crowd.",
            "sent3": "The fidgety squirrel was worried about finding enough nuts for winter.",
            "sent4": "Her fidgety fingers tapped nervously on the table as she waited for the results.",
            "sent5": "The fidgety student chewed on the end of his pencil during the test."
        },
        {
            "definition": "Characterized by fidgeting or small movements",
            "pos": "adjective",
            "sent1": "The fidgety kitten played with a ball of yarn for hours.",
            "sent2": "The old clock made a fidgety ticking sound in the quiet room.",
            "sent3": "The fidgety wind chime jingled softly in the breeze.",
            "sent4": "The fidgety branches of the tree rustled in the gentle wind.",
            "sent5": "The fidgety gears of the machine clicked and turned in a mesmerizing rhythm."
        },
        {
            "definition": "Inclined to fidget or be restless",
            "pos": "adjective",
            "sent1": "She was always fidgety during long meetings, tapping her foot under the table.",
            "sent2": "The fidgety cat couldn't stay in one place for more than a minute.",
            "sent3": "The fidgety hamster ran in circles in its wheel all night.",
            "sent4": "His fidgety nature made him a perfect fit for the fast-paced job.",
            "sent5": "The fidgety wind toy spun wildly in the strong breeze."
        }
    ]
}