{
    "term": "fights",
    "meanings": [
        {
            "definition": "To engage in physical combat or struggle",
            "pos": "verb",
            "sent1": "He fights bravely in the ring.",
            "sent2": "She fights with her brother over toys.",
            "sent3": "The cat fights playfully with a ball of yarn.",
            "sent4": "The waves and the shore constantly fights for dominance.",
            "sent5": "The hero fights against the evil dragon to save the kingdom."
        },
        {
            "definition": "A physical confrontation between two or more individuals",
            "pos": "noun",
            "sent1": "The two boys had a fight after school.",
            "sent2": "The fight broke out at the bar last night.",
            "sent3": "The fight between the siblings ended with laughter.",
            "sent4": "The fight for the last cookie was intense.",
            "sent5": "The epic fight scene in the movie had everyone on the edge of their seats."
        },
        {
            "definition": "To contend or strive against something",
            "pos": "verb",
            "sent1": "She fights against injustice wherever she sees it.",
            "sent2": "The team fights hard to win every game.",
            "sent3": "The little engine fights to climb the steep hill.",
            "sent4": "The sun fights through the clouds to shine on the field.",
            "sent5": "He fights against his fear of heights to climb the mountain."
        },
        {
            "definition": "A battle or conflict between opposing forces",
            "pos": "noun",
            "sent1": "The fight between good and evil is a timeless theme.",
            "sent2": "The political fight for power continues in the capital.",
            "sent3": "The fight between the seasons creates beautiful changes.",
            "sent4": "The fight between the rival gangs escalated quickly.",
            "sent5": "The fight for freedom united the people in a common cause."
        }
    ]
}