{
    "term": "figwort",
    "meanings": [
        {
            "definition": "A plant of the genus Scrophularia, with tubular flowers.",
            "pos": "noun",
            "sent1": "The figwort in the garden has beautiful tubular flowers.",
            "sent2": "I saw a figwort growing by the stream with its unique tubular flowers.",
            "sent3": "The figwort decided to wear its tubular flowers as fancy hats for a garden party.",
            "sent4": "The figwort's tubular flowers were like tiny trumpets heralding the arrival of spring.",
            "sent5": "As I walked past the figwort, the tubular flowers seemed to whisper secrets to the breeze."
        },
        {
            "definition": "Any plant of the genus Scrophularia.",
            "pos": "noun",
            "sent1": "Is that a figwort over there, or just another plant of the Scrophularia genus?",
            "sent2": "The figwort is a type of plant that belongs to the Scrophularia genus.",
            "sent3": "The figwort and its Scrophularia cousins had a family reunion in the garden.",
            "sent4": "Among the sea of green, the figwort stood out like a Scrophularia superstar.",
            "sent5": "The figwort, like all plants of the Scrophularia genus, thrived in the wild meadow."
        },
        {
            "definition": "A plant of the genus Scrophularia, with small flowers in dense spikes.",
            "pos": "noun",
            "sent1": "The figwort with small flowers in dense spikes attracts many bees.",
            "sent2": "In the forest, the figwort with small flowers in dense spikes stood tall.",
            "sent3": "The figwort with small flowers in dense spikes played hide-and-seek with the butterflies.",
            "sent4": "The figwort's small flowers in dense spikes resembled a colorful fireworks display.",
            "sent5": "As the sun set, the figwort with small flowers in dense spikes painted the meadow in hues of purple and pink."
        }
    ]
}