{
    "term": "file",
    "meanings": [
        {
            "definition": "A folder or box for holding loose papers or documents.",
            "pos": "noun",
            "sent1": "I put the important papers in the file on my desk.",
            "sent2": "The file on the shelf contains all the receipts.",
            "sent3": "The mischievous cat knocked over the file, scattering papers everywhere.",
            "sent4": "Her mind was like a well-organized file, each memory neatly stored.",
            "sent5": "The file labeled 'recipes' was bursting with culinary ideas."
        },
        {
            "definition": "A collection of related data or information stored on a computer.",
            "pos": "noun",
            "sent1": "The computer technician accessed the file to retrieve the data.",
            "sent2": "Make sure to back up your important files regularly.",
            "sent3": "The file seemed to have a mind of its own, organizing itself magically.",
            "sent4": "In the digital world, a file is a treasure trove of knowledge waiting to be explored.",
            "sent5": "The file contained the secrets to unlocking the mystery."
        },
        {
            "definition": "To arrange papers or documents in order for future reference.",
            "pos": "verb",
            "sent1": "I need to file these papers before the meeting.",
            "sent2": "She filed the documents neatly in the cabinet.",
            "sent3": "As she filed the papers, she hummed a cheerful tune.",
            "sent4": "He filed away the memories of that day in a corner of his mind.",
            "sent5": "Filing the papers alphabetically made it easier to find them later."
        },
        {
            "definition": "To submit or present a formal document.",
            "pos": "verb",
            "sent1": "Please file your report with the supervisor by Friday.",
            "sent2": "The lawyer filed the legal brief in court.",
            "sent3": "She decided to file her complaint after careful consideration.",
            "sent4": "He filed his application with a sense of anticipation.",
            "sent5": "Filing the paperwork was the final step in the process."
        },
        {
            "definition": "To smooth or shape with a file.",
            "pos": "verb",
            "sent1": "He used a file to smooth the rough edges of the wood.",
            "sent2": "The jeweler filed the metal to create intricate designs.",
            "sent3": "Filing the metal required precision and patience.",
            "sent4": "She filed the sculpture with care, shaping it into a masterpiece.",
            "sent5": "The sound of the file against the metal was oddly satisfying."
        }
    ]
}