{
    "term": "filiation",
    "meanings": [
        {
            "definition": "The fact or state of being a child or offspring.",
            "pos": "noun",
            "sent1": "Her filiation to her parents was evident in her features.",
            "sent2": "The filiation between the mother and her newborn was heartwarming.",
            "sent3": "The filiation between the puppy and the kitten was quite amusing to watch.",
            "sent4": "The filiation between the teacher and her students was like that of a shepherd and her flock.",
            "sent5": "The filiation of the baby bird to its nest was a beautiful sight."
        },
        {
            "definition": "The relationship between a parent and child.",
            "pos": "noun",
            "sent1": "Their filiation was strong, filled with love and understanding.",
            "sent2": "The filiation between the king and his heir was crucial for the kingdom.",
            "sent3": "The filiation between the chef and his signature dish was quite amusing to observe.",
            "sent4": "The filiation between the tree and its roots is a bond that cannot be broken.",
            "sent5": "The filiation of the artist to his masterpiece was evident in every stroke."
        },
        {
            "definition": "The act of establishing a parental relationship through legal means.",
            "pos": "noun",
            "sent1": "The filiation process was completed smoothly, granting legal rights to the adoptive parents.",
            "sent2": "Legal filiation is essential for ensuring the rights and responsibilities of both parents and children.",
            "sent3": "The filiation paperwork was so complicated, it felt like solving a puzzle.",
            "sent4": "The filiation through adoption was a bridge that connected two families.",
            "sent5": "The filiation of the legal guardian to the child brought security and stability to their lives."
        }
    ]
}