{
    "term": "filial",
    "meanings": [
        {
            "definition": "Of or due from a son or daughter",
            "pos": "adjective",
            "sent1": "The filial love between the siblings was evident in their caring gestures towards each other.",
            "sent2": "The family celebrated the filial bond between the parents and their children.",
            "sent3": "The filial duty of taking out the trash fell on the youngest sibling, much to their dismay.",
            "sent4": "The filial connection between the twins was so strong, they could finish each other's sentences.",
            "sent5": "The filial responsibility of helping with household chores was ingrained in the children from a young age."
        },
        {
            "definition": "Relating to or characteristic of a son or daughter",
            "pos": "adjective",
            "sent1": "The filial resemblance between the father and his son was striking.",
            "sent2": "The family heirloom held great filial significance for the siblings.",
            "sent3": "The filial pride in their children's accomplishments shone through the parents' beaming smiles.",
            "sent4": "The filial bond between the siblings was as unbreakable as the strongest chain.",
            "sent5": "The filial connection between the cousins was evident in their shared laughter and inside jokes."
        },
        {
            "definition": "Showing respect and duty towards one's parents",
            "pos": "adjective",
            "sent1": "The filial care the daughter showed towards her aging parents was heartwarming.",
            "sent2": "The community admired the filial devotion of the son who visited his parents daily.",
            "sent3": "The filial responsibility of cooking dinner for the family fell on the eldest sibling that evening.",
            "sent4": "The filial love the children had for their parents was like a beacon guiding them through life's challenges.",
            "sent5": "The filial duty of accompanying their parents to doctor's appointments was a task the siblings shared without complaint."
        }
    ]
}