{
    "term": "fillet",
    "meanings": [
        {
            "definition": "A boneless cut or slice of meat or fish.",
            "pos": "noun",
            "sent1": "I ordered a fillet of fish for dinner.",
            "sent2": "The chef grilled a juicy beef fillet for the customer.",
            "sent3": "The cat tried to steal a fillet of salmon from the kitchen counter.",
            "sent4": "Her smile was like a perfectly cooked fillet, tender and satisfying.",
            "sent5": "The sun set behind the mountains, painting the sky with hues of pink and orange like a delicate fillet of fish."
        },
        {
            "definition": "A narrow strip of ribbon or similar material used for tying or binding things together.",
            "pos": "noun",
            "sent1": "She tied the gift box with a shiny fillet of ribbon.",
            "sent2": "The fillet of lace added a touch of elegance to the dress.",
            "sent3": "The mischievous puppy ran around with a fillet of ribbon in its mouth.",
            "sent4": "Her words acted as a fillet, binding the team together in unity.",
            "sent5": "The wind carried the fillet of kite string high into the sky, dancing with the clouds."
        },
        {
            "definition": "To remove bones from meat or fish.",
            "pos": "verb",
            "sent1": "The chef carefully filleted the salmon for the sushi.",
            "sent2": "She learned how to fillet a chicken breast in culinary school.",
            "sent3": "He filleted the fish with such precision that not a single bone remained.",
            "sent4": "The surgeon skillfully filleted the fish, removing the tumor completely.",
            "sent5": "With a swift motion, she filleted the apple, removing the core with ease."
        },
        {
            "definition": "To bind or decorate with a narrow strip of material.",
            "pos": "verb",
            "sent1": "She filleted the gift box with a red ribbon.",
            "sent2": "The artist filleted the painting with a gold border.",
            "sent3": "He filleted the book cover with a strip of colorful tape.",
            "sent4": "The garden was filleted with fairy lights, creating a magical atmosphere.",
            "sent5": "The room was filleted with streamers, ready for the birthday celebration."
        }
    ]
}