{
    "term": "fillips",
    "meanings": [
        {
            "definition": "A snap or light blow with the fingers.",
            "pos": "noun",
            "sent1": "She gave the paper a fillips to straighten it out.",
            "sent2": "He felt a fillips on his shoulder, turning to see who it was.",
            "sent3": "The cat playfully gave the toy a fillips with its paw.",
            "sent4": "The fillips of the wind against the window sounded like a gentle tap.",
            "sent5": "With a quick fillips, she flicked the bug away from her food."
        },
        {
            "definition": "A stimulus or encouragement.",
            "pos": "noun",
            "sent1": "The teacher's praise was a fillips for the student to work harder.",
            "sent2": "A small success can often provide the needed fillips to continue.",
            "sent3": "The unexpected bonus was a fillips for him to start saving money.",
            "sent4": "Her smile was like a fillips that motivated him to keep going.",
            "sent5": "The crowd's cheers acted as a fillips for the team to push forward."
        },
        {
            "definition": "To strike or tap lightly.",
            "pos": "verb",
            "sent1": "She would fillips the table to get everyone's attention.",
            "sent2": "He fillips the door twice before entering the room.",
            "sent3": "The drummer would fillips the cymbal to start the song.",
            "sent4": "The rain would fillips against the window, creating a soothing sound.",
            "sent5": "He would fillips the keys on the piano softly, creating a beautiful melody."
        },
        {
            "definition": "To stimulate or encourage.",
            "pos": "verb",
            "sent1": "The coach tried to fillips the team before the big game.",
            "sent2": "A good book can fillips a love for reading in children.",
            "sent3": "The smell of fresh coffee would always fillips her to start the day.",
            "sent4": "The inspiring speech fillipsed the audience to take action.",
            "sent5": "The colorful artwork fillipsed creativity in the students."
        }
    ]
}