{
    "term": "filters",
    "meanings": [
        {
            "definition": "A device or piece of equipment used to remove impurities or unwanted elements from a substance.",
            "pos": "noun",
            "sent1": "The coffee machine has special filters to keep the grounds out of the brewed coffee.",
            "sent2": "She used filters to clean the water before drinking it.",
            "sent3": "The filters in the fish tank decided to go on strike, leaving the water murky.",
            "sent4": "His mind acted like filters, blocking out negative thoughts and focusing on the positive.",
            "sent5": "The air filters in the car were so clogged that the engine struggled to run smoothly."
        },
        {
            "definition": "A feature or function in software or an app that allows users to limit or refine the results displayed.",
            "pos": "noun",
            "sent1": "The email app has useful filters to organize incoming messages.",
            "sent2": "She applied filters to the photos to make them look more vibrant.",
            "sent3": "The filters in the social media app decided to play a prank by hiding all the posts.",
            "sent4": "Her mind worked like filters, focusing only on the important information.",
            "sent5": "The search filters on the website made it easy to find exactly what she was looking for."
        },
        {
            "definition": "A porous material or device used to separate solids from liquids or gases.",
            "pos": "noun",
            "sent1": "The coffee filters in the machine prevented the grounds from getting into the cup.",
            "sent2": "He used filters to purify the air in the room.",
            "sent3": "The filters in the experiment decided to take a break, causing a mix-up in the results.",
            "sent4": "Her words acted as filters, letting only the truth pass through.",
            "sent5": "The oil filters in the car engine kept the oil clean and free of debris."
        }
    ]
}