{
    "term": "finals",
    "meanings": [
        {
            "definition": "The last game or match in a sports competition.",
            "pos": "noun",
            "sent1": "During the soccer finals, the two best teams compete for the championship.",
            "sent2": "I can't wait to watch the basketball finals this weekend.",
            "sent3": "The finals were so intense that even the referees were on the edge of their seats.",
            "sent4": "The finals felt like a battle between titans, each team fighting for victory.",
            "sent5": "The atmosphere during the finals was electric, with fans cheering loudly for their favorite team."
        },
        {
            "definition": "The last examination in a series, especially at the end of an academic term.",
            "pos": "noun",
            "sent1": "Studying for the finals can be stressful, but it's important to do your best.",
            "sent2": "I have three finals next week, so I need to start preparing early.",
            "sent3": "After the finals, students celebrated the end of the school year with a party.",
            "sent4": "The finals felt like a mental marathon, testing everything we learned throughout the semester.",
            "sent5": "Scoring well on the finals is crucial for my overall grade in the class."
        },
        {
            "definition": "The last round of a competition or tournament.",
            "pos": "noun",
            "sent1": "In the finals of the chess tournament, the two grandmasters faced off in a thrilling match.",
            "sent2": "The finals of the singing competition will determine the winner of the entire event.",
            "sent3": "During the finals, the audience held their breath, waiting to see who would emerge victorious.",
            "sent4": "The finals were like a showdown between the top contenders, each giving their all to win.",
            "sent5": "The tension in the room during the finals was palpable, with everyone on the edge of their seats."
        }
    ]
}