{
    "term": "finks",
    "meanings": [
        {
            "definition": "Informant or snitch",
            "pos": "noun",
            "sent1": "The finks told the police about the stolen cookies.",
            "sent2": "The teacher found out who the finks were in the class.",
            "sent3": "At the party, the finks revealed the surprise birthday gift.",
            "sent4": "She felt like a finks when she disclosed her friend's secret.",
            "sent5": "The finks in the group always knew everyone's business."
        },
        {
            "definition": "To inform on someone",
            "pos": "verb",
            "sent1": "He finks on his friends whenever he gets in trouble.",
            "sent2": "She promised not to finks on her classmates during the test.",
            "sent3": "The cat seemed to finks on the dog for knocking over the vase.",
            "sent4": "The spy decided to finks on his own agency for a better offer.",
            "sent5": "The child hesitated to finks on his sibling for eating the last cookie."
        },
        {
            "definition": "A person who betrays others",
            "pos": "noun",
            "sent1": "She felt like a finks when she turned against her best friend.",
            "sent2": "The finks in the group was no longer trusted by anyone.",
            "sent3": "The finks at work caused a lot of drama with their betrayal.",
            "sent4": "He was labeled a finks after revealing confidential information.",
            "sent5": "The finks regretted betraying their team for personal gain."
        },
        {
            "definition": "To betray or rat out someone",
            "pos": "verb",
            "sent1": "He decided to finks on his partner to save himself.",
            "sent2": "She couldn't believe her friend would finks on her like that.",
            "sent3": "The parrot seemed to finks on its owner by repeating their secrets.",
            "sent4": "The witness was afraid to finks on the dangerous criminal.",
            "sent5": "She felt guilty after choosing to finks on her colleague for a promotion."
        }
    ]
}