{
    "term": "fink",
    "meanings": [
        {
            "definition": "Informant",
            "pos": "noun",
            "sent1": "The fink told the teacher about the missing pencil.",
            "sent2": "Don't trust a fink who reveals secrets.",
            "sent3": "The little fink couldn't resist sharing the surprise party plans.",
            "sent4": "She felt like a fink under the watchful eyes of the detective.",
            "sent5": "The image of the fink whispering in the principal's ear stuck in her mind."
        },
        {
            "definition": "Betray",
            "pos": "verb",
            "sent1": "He decided to fink on his friends and reveal the truth.",
            "sent2": "It's not right to fink on someone who trusts you.",
            "sent3": "She felt guilty when she had to fink on her brother for breaking the vase.",
            "sent4": "The storm clouds seemed to fink on the sunny day, bringing unexpected rain.",
            "sent5": "The decision to fink on her team haunted her conscience."
        },
        {
            "definition": "Inform on someone",
            "pos": "verb",
            "sent1": "She had to fink on her classmates to avoid trouble.",
            "sent2": "It's never easy to fink on a friend, even when it's necessary.",
            "sent3": "The cat seemed to fink on the dog's plan to steal treats.",
            "sent4": "The stars in the sky seemed to fink on the moon's whereabouts.",
            "sent5": "The bird's chirping seemed to fink on the approaching storm."
        },
        {
            "definition": "A person who informs on others, especially to the authorities.",
            "pos": "noun",
            "sent1": "The fink in the group always reported misbehavior to the principal.",
            "sent2": "Nobody likes a fink who can't keep a secret.",
            "sent3": "The little fink in the class was known for telling on everyone.",
            "sent4": "The fink's reputation for snitching spread quickly among the students.",
            "sent5": "The fink's constant tattling made them unpopular among their peers."
        }
    ]
}