{
    "term": "fired",
    "meanings": [
        {
            "definition": "Dismiss from a job",
            "pos": "verb",
            "sent1": "He was fired from his job for being late too often.",
            "sent2": "The boss fired the employee for not following company policies.",
            "sent3": "After being fired, he decided to pursue his passion for painting.",
            "sent4": "Losing his job felt like being fired into the unknown.",
            "sent5": "The news of his firing spread like wildfire in the office."
        },
        {
            "definition": "Discharge a weapon",
            "pos": "verb",
            "sent1": "The soldier fired his gun during the training exercise.",
            "sent2": "The police officer fired a warning shot to stop the criminal.",
            "sent3": "The cowboy fired his revolver in the air to celebrate.",
            "sent4": "The sound of gunfire echoed as they fired into the distance.",
            "sent5": "The hunter fired a single shot, hitting the target accurately."
        },
        {
            "definition": "Cook in an oven",
            "pos": "verb",
            "sent1": "She fired up the oven to bake a delicious cake.",
            "sent2": "The chef fired the pizza in the wood-fired oven.",
            "sent3": "The aroma of freshly fired bread filled the kitchen.",
            "sent4": "The cookies were perfectly golden after being fired in the oven.",
            "sent5": "The baker fired the pastries until they were crispy and golden."
        },
        {
            "definition": "Cause to burn or ignite",
            "pos": "verb",
            "sent1": "He fired up the grill to cook some burgers.",
            "sent2": "The arsonist fired the building, causing chaos in the city.",
            "sent3": "The campers fired up the bonfire to roast marshmallows.",
            "sent4": "The dry leaves quickly fired up when exposed to the flame.",
            "sent5": "The fireworks display fired up the night sky with colors."
        }
    ]
}