{
    "term": "firemen",
    "meanings": [
        {
            "definition": "A person who extinguishes fires.",
            "pos": "noun",
            "sent1": "The brave firemen rushed into the burning building to save the people inside.",
            "sent2": "The firemen arrived quickly at the scene of the fire with their hoses ready.",
            "sent3": "The firemen joked that they were like real-life superheroes with their fire trucks and gear.",
            "sent4": "The firemen were the knights in shining armor, battling the fiery dragon of destruction.",
            "sent5": "The image of the firemen climbing the ladder to reach the flames was etched in her mind."
        },
        {
            "definition": "A member of a fire department.",
            "pos": "noun",
            "sent1": "Every fireman in the station was trained to respond to emergencies with speed and skill.",
            "sent2": "The firemen gathered for their daily briefing before heading out on their shifts.",
            "sent3": "The firemen held a barbecue to celebrate a successful year of keeping the community safe.",
            "sent4": "The firemen were the backbone of the town's safety, always ready to protect and serve.",
            "sent5": "The children waved excitedly as the firemen drove by in their bright red truck."
        },
        {
            "definition": "A firefighter.",
            "pos": "noun",
            "sent1": "The young boy dreamed of becoming a fireman and saving lives every day.",
            "sent2": "The fireman skillfully handled the hose to douse the flames and prevent further damage.",
            "sent3": "The fireman playfully slid down the pole at the station, much to the amusement of his colleagues.",
            "sent4": "The fireman's determination burned brighter than the flames he fought against.",
            "sent5": "The sound of the fireman's siren echoed through the neighborhood, signaling help was on the way."
        }
    ]
}