{
    "term": "firebrand",
    "meanings": [
        {
            "definition": "A person who is passionate and outspoken, often stirring up controversy or rebellion.",
            "pos": "noun",
            "sent1": "The firebrand at the rally inspired the crowd with their powerful speech.",
            "sent2": "The political firebrand always speaks their mind, no matter the consequences.",
            "sent3": "The firebrand decided to start a debate club at the retirement home for fun.",
            "sent4": "Her words were like a firebrand, igniting a spark of change in the community.",
            "sent5": "The firebrand's presence was like a blazing torch in the dark night of conformity."
        },
        {
            "definition": "A burning piece of wood or other material used for lighting fires.",
            "pos": "noun",
            "sent1": "The camper carefully placed the firebrand in the center of the fire pit.",
            "sent2": "The firebrand crackled and popped as it consumed the dry twigs around it.",
            "sent3": "The firebrand was so hot that it turned the marshmallow into a gooey mess in seconds.",
            "sent4": "The firebrand glowed brightly, casting a warm light on the faces of the campers.",
            "sent5": "The firebrand's flames danced gracefully, painting intricate patterns in the night sky."
        },
        {
            "definition": "A person who is very energetic or enthusiastic.",
            "pos": "noun",
            "sent1": "The young firebrand led the team to victory with their boundless energy.",
            "sent2": "She was a firebrand on the dance floor, moving with infectious enthusiasm.",
            "sent3": "The firebrand decided to organize a spontaneous dance party in the park.",
            "sent4": "His enthusiasm was a firebrand that ignited a passion for learning in his classmates.",
            "sent5": "The firebrand's energy was like a whirlwind, sweeping everyone up in its joyful gust."
        }
    ]
}