{
    "term": "firing",
    "meanings": [
        {
            "definition": "Discharging a gun or weapon.",
            "pos": "verb",
            "sent1": "He was firing at the target during practice.",
            "sent2": "The soldier was firing his rifle in the battlefield.",
            "sent3": "The cowboy kept firing at the cans but kept missing.",
            "sent4": "Her words were like firing bullets, hitting everyone in the room.",
            "sent5": "The fireworks were firing into the night sky, lighting up the darkness."
        },
        {
            "definition": "Terminating someone's employment.",
            "pos": "verb",
            "sent1": "The company was firing employees due to budget cuts.",
            "sent2": "She felt devastated when they told her they were firing her.",
            "sent3": "After the robot uprising, the humans joked about the robots firing them.",
            "sent4": "The boss felt like firing everyone after the disastrous presentation.",
            "sent5": "The manager was firing off emails left and right, letting people go."
        },
        {
            "definition": "Heating or baking in a kiln.",
            "pos": "noun",
            "sent1": "The pottery was in the firing process to harden the clay.",
            "sent2": "The ceramics were ready for firing in the kiln.",
            "sent3": "The artist accidentally left the sculpture in the firing too long.",
            "sent4": "The smell of the firing clay filled the studio.",
            "sent5": "The firing of the pottery created beautiful, glazed pieces."
        },
        {
            "definition": "Sending out a projectile or missile.",
            "pos": "verb",
            "sent1": "The tank was firing shells at the enemy positions.",
            "sent2": "The archer was firing arrows with precision at the target.",
            "sent3": "The kids were firing water balloons at each other in the backyard.",
            "sent4": "The spaceship was firing lasers at the approaching aliens.",
            "sent5": "The cannons were firing cannonballs into the sea during the reenactment."
        },
        {
            "definition": "Igniting or setting on fire.",
            "pos": "verb",
            "sent1": "She was firing up the grill to cook burgers for the barbecue.",
            "sent2": "The arsonist was firing buildings in the city.",
            "sent3": "The campers were firing up the bonfire to roast marshmallows.",
            "sent4": "The dragon was firing flames from its mouth, scorching the village.",
            "sent5": "The lightning was firing across the sky, illuminating the storm clouds."
        }
    ]
}