{
    "term": "fishing",
    "meanings": [
        {
            "definition": "The act of catching fish.",
            "pos": "noun",
            "sent1": "We went fishing at the lake and caught some big fish.",
            "sent2": "Fishing is a popular hobby for many people who enjoy being outdoors.",
            "sent3": "Tom tried fishing in the bathtub with a toy fishing rod.",
            "sent4": "Her eyes were fishing for answers in the sea of information.",
            "sent5": "The art of fishing requires patience and skill to be successful."
        },
        {
            "definition": "The activity of trying to catch fish.",
            "pos": "noun",
            "sent1": "Grandpa took us fishing by the river to teach us how to catch fish.",
            "sent2": "Fishing requires a good understanding of the behavior of different fish species.",
            "sent3": "The cat was fishing for compliments by showing off its new collar.",
            "sent4": "Her words were like fishing hooks, drawing in the attention of the audience.",
            "sent5": "The children's laughter filled the air as they went fishing for the first time."
        },
        {
            "definition": "The sport or business of catching fish.",
            "pos": "noun",
            "sent1": "Professional fishing tournaments attract skilled anglers from around the world.",
            "sent2": "Fishing can be both a relaxing pastime and a competitive sport.",
            "sent3": "The company's new fishing division aimed to revolutionize the fishing industry.",
            "sent4": "In the business world, networking is like fishing for opportunities.",
            "sent5": "The fishing industry plays a vital role in coastal economies."
        },
        {
            "definition": "The act of searching for something in a casual or desultory way.",
            "pos": "noun",
            "sent1": "She was fishing through her bag for the missing keys.",
            "sent2": "Fishing for compliments is not a genuine way to seek validation.",
            "sent3": "The detective was fishing for clues in the old mansion.",
            "sent4": "His mind was fishing for memories of the long-forgotten event.",
            "sent5": "The teacher was fishing for the right words to explain the complex concept."
        }
    ]
}