{
    "term": "fits",
    "meanings": [
        {
            "definition": "A sudden outburst of emotion or action",
            "pos": "noun",
            "sent1": "Her fits of laughter filled the room with joy.",
            "sent2": "The child's tantrum was a fit of anger.",
            "sent3": "During the comedy show, his fits of giggles were contagious.",
            "sent4": "The sudden fit of rage surprised everyone in the room.",
            "sent5": "His fit of excitement was palpable as he opened the gift."
        },
        {
            "definition": "To be of the right size or shape for something",
            "pos": "verb",
            "sent1": "The key fits perfectly into the lock.",
            "sent2": "The puzzle piece fits snugly in its place.",
            "sent3": "The new sofa fits nicely in the living room.",
            "sent4": "The missing piece finally fits into the puzzle of my life.",
            "sent5": "The shoe fits comfortably on my foot."
        },
        {
            "definition": "A seizure or convulsion",
            "pos": "noun",
            "sent1": "He experienced a fit during the night and was taken to the hospital.",
            "sent2": "The sudden fit caused concern among his friends.",
            "sent3": "The fit startled everyone at the party.",
            "sent4": "The fit passed quickly, leaving him exhausted.",
            "sent5": "The fit subsided as quickly as it had come."
        },
        {
            "definition": "To match or be suitable for something",
            "pos": "verb",
            "sent1": "The color of the curtains fits well with the room decor.",
            "sent2": "His skills fit the requirements of the job perfectly.",
            "sent3": "The new employee fits in seamlessly with the team.",
            "sent4": "The missing piece finally fits into the puzzle of my life.",
            "sent5": "The key fits into the keyhole effortlessly."
        }
    ]
}