{
    "term": "fitted",
    "meanings": [
        {
            "definition": "Made or shaped to fill a particular space or to cover a particular object",
            "pos": "adjective",
            "sent1": "The fitted sheet perfectly covered the mattress.",
            "sent2": "The jacket was fitted to her body, accentuating her figure.",
            "sent3": "The puzzle pieces fitted together like a perfect match.",
            "sent4": "The key fitted into the lock smoothly, opening the door.",
            "sent5": "The tailor's fitted dress was a work of art, hugging every curve flawlessly."
        },
        {
            "definition": "Being the proper size or shape for",
            "pos": "adjective",
            "sent1": "The fitted shoes were comfortable and snug on his feet.",
            "sent2": "The hat was fitted just right, not too loose or too tight.",
            "sent3": "The glove fitted his hand like it was custom-made for him.",
            "sent4": "The puzzle piece was fitted perfectly in its place.",
            "sent5": "The fitted cover kept the food fresh and protected from insects."
        },
        {
            "definition": "To put on or in",
            "pos": "verb",
            "sent1": "She fitted the key into the lock and turned it.",
            "sent2": "He fitted the pieces of the puzzle together to reveal the picture.",
            "sent3": "The mechanic fitted the new tire onto the car.",
            "sent4": "The tailor fitted the dress on the mannequin before final adjustments.",
            "sent5": "He fitted the last piece of the jigsaw puzzle with a sense of accomplishment."
        },
        {
            "definition": "To provide with what is needed",
            "pos": "verb",
            "sent1": "The kind neighbor fitted the family with blankets during the cold winter.",
            "sent2": "The chef fitted the kitchen with all the necessary tools for cooking.",
            "sent3": "The teacher fitted the students with knowledge and skills for success.",
            "sent4": "The doctor fitted the patient with a cast to support the broken arm.",
            "sent5": "The generous donor fitted the charity with funds to help those in need."
        }
    ]
}