{
    "term": "fix",
    "meanings": [
        {
            "definition": "Repair or mend",
            "pos": "verb",
            "sent1": "I will fix my broken toy with glue.",
            "sent2": "He needs to fix the leaky faucet in the kitchen.",
            "sent3": "Why did the bicycle refuse to fix itself?",
            "sent4": "Her smile could fix even the most broken hearts.",
            "sent5": "The handyman used his tools to fix the problem quickly."
        },
        {
            "definition": "To make firm or stable",
            "pos": "verb",
            "sent1": "Please fix the wobbly table leg with a shim.",
            "sent2": "The construction crew will fix the loose railing.",
            "sent3": "The jello tried to fix its wiggly ways.",
            "sent4": "Her determination to succeed could fix her resolve.",
            "sent5": "The strong foundation helped fix the building in place."
        },
        {
            "definition": "To decide or settle",
            "pos": "verb",
            "sent1": "Let's fix a time for our meeting tomorrow.",
            "sent2": "They need to fix the location for the party.",
            "sent3": "The coin flip will fix the winner of the game.",
            "sent4": "Her final decision could fix the course of events.",
            "sent5": "The judge will fix the dispute between the neighbors."
        },
        {
            "definition": "To prepare or arrange",
            "pos": "verb",
            "sent1": "She will fix a delicious meal for dinner.",
            "sent2": "He likes to fix his workspace before starting work.",
            "sent3": "The puzzle pieces tried to fix themselves into place.",
            "sent4": "Her careful planning could fix the success of the event.",
            "sent5": "The artist will fix the colors on the canvas before painting."
        },
        {
            "definition": "To fasten or attach",
            "pos": "verb",
            "sent1": "Please fix the loose screw on the chair.",
            "sent2": "He will fix the picture frame securely on the wall.",
            "sent3": "The magnet tried to fix itself to the fridge.",
            "sent4": "Her words could fix the attention of the audience.",
            "sent5": "The velcro will fix the two pieces together."
        }
    ]
}