{
    "term": "fixed",
    "meanings": [
        {
            "definition": "Fastened securely in place.",
            "pos": "adjective",
            "sent1": "The picture frame was fixed firmly on the wall.",
            "sent2": "The table was fixed in its position and couldn't be moved easily.",
            "sent3": "The squirrel fixed its gaze on the acorn, determined to get it.",
            "sent4": "Her eyes were fixed on the horizon, lost in thought.",
            "sent5": "The old bridge was fixed in its crumbling state, a relic of the past."
        },
        {
            "definition": "Not subject to change or fluctuation.",
            "pos": "adjective",
            "sent1": "The price of the item was fixed and wouldn't go up.",
            "sent2": "His decision was fixed, and he wouldn't change his mind.",
            "sent3": "The weather seemed fixed in its sunny disposition all week.",
            "sent4": "Her mood was fixed like a stone, unyielding to any influence.",
            "sent5": "The rule was fixed and clear, leaving no room for interpretation."
        },
        {
            "definition": "Repair or mend.",
            "pos": "verb",
            "sent1": "He fixed the broken chair with some glue.",
            "sent2": "She fixed the torn page in her notebook with tape.",
            "sent3": "The mechanic fixed the car's engine in no time.",
            "sent4": "They fixed the leaky faucet, stopping the constant drip.",
            "sent5": "The tailor fixed the ripped seam, making the dress good as new."
        },
        {
            "definition": "Settled or resolved.",
            "pos": "adjective",
            "sent1": "The matter was finally fixed after a long discussion.",
            "sent2": "The argument between them was fixed with a sincere apology.",
            "sent3": "The issue seemed fixed once they reached a compromise.",
            "sent4": "The tension in the room was fixed by a heartfelt reconciliation.",
            "sent5": "The misunderstanding was fixed, and they moved forward in harmony."
        },
        {
            "definition": "Intent or focused.",
            "pos": "adjective",
            "sent1": "She had a fixed determination to finish the project on time.",
            "sent2": "His fixed gaze on the target showed his concentration.",
            "sent3": "The cat had a fixed stare at the moving toy, ready to pounce.",
            "sent4": "His fixed attention on the book made him oblivious to the noise around him.",
            "sent5": "The athlete had a fixed goal in mind, pushing himself to achieve it."
        }
    ]
}