{
    "term": "flagellant",
    "meanings": [
        {
            "definition": "A person who practices self-flagellation as a form of religious discipline.",
            "pos": "noun",
            "sent1": "The flagellant walked barefoot, whipping himself as a religious practice.",
            "sent2": "The flagellant in the monastery believed in atoning for his sins through self-punishment.",
            "sent3": "The flagellant's dedication to self-flagellation was both admirable and concerning.",
            "sent4": "Her commitment to being a flagellant of her own faults was unwavering.",
            "sent5": "The image of the flagellant's self-inflicted pain stayed with him long after he left the church."
        },
        {
            "definition": "Relating to or characteristic of self-flagellation.",
            "pos": "adjective",
            "sent1": "The flagellant ritual was a solemn and private affair for the devout followers.",
            "sent2": "Her flagellant tendencies were a reflection of her deep sense of guilt.",
            "sent3": "The flagellant behavior of the penitent man puzzled those who did not understand his beliefs.",
            "sent4": "The flagellant nature of her thoughts led her down a path of constant self-criticism.",
            "sent5": "The flagellant mindset of the group was evident in their extreme acts of repentance."
        },
        {
            "definition": "A device used for flagellation.",
            "pos": "noun",
            "sent1": "The flagellant was made of leather strips attached to a handle for easy use.",
            "sent2": "The medieval flagellant was a common tool in the hands of those seeking penance.",
            "sent3": "The flagellant hung on the wall, a reminder of a darker time in history.",
            "sent4": "The flagellant's design allowed for precise strikes during self-punishment.",
            "sent5": "The sound of the flagellant hitting the skin echoed through the empty room."
        }
    ]
}