{
    "term": "flake",
    "meanings": [
        {
            "definition": "A small, flat, thin piece or layer.",
            "pos": "noun",
            "sent1": "She found a flake of paint on the floor.",
            "sent2": "The snowflake landed gently on her glove.",
            "sent3": "The flake of chocolate on his shirt made him look like a messy eater.",
            "sent4": "Her heart shattered like a delicate flake of glass.",
            "sent5": "The flake of gold shimmered in the sunlight."
        },
        {
            "definition": "A small piece broken off a larger piece.",
            "pos": "noun",
            "sent1": "He brushed off a flake of pastry from his shirt.",
            "sent2": "The flake of bark fell from the tree and landed on the ground.",
            "sent3": "The flake of cookie crumbled in her hand.",
            "sent4": "His confidence was just a flake of what it used to be.",
            "sent5": "The flake of paper floated down from the desk."
        },
        {
            "definition": "A person who is unreliable or inconsistent in behavior.",
            "pos": "noun",
            "sent1": "She knew he was a flake and couldn't be counted on.",
            "sent2": "The flake never showed up for the meeting.",
            "sent3": "The flake of a friend always had an excuse for canceling plans.",
            "sent4": "His reputation as a flake spread quickly among his peers.",
            "sent5": "Being labeled a flake hurt her feelings deeply."
        },
        {
            "definition": "To break or come off in small, thin pieces.",
            "pos": "verb",
            "sent1": "The old paint began to flake off the wall.",
            "sent2": "Her skin started to flake after spending too much time in the sun.",
            "sent3": "The pastry chef watched the crust flake perfectly in the oven.",
            "sent4": "His resolve began to flake away under the pressure.",
            "sent5": "The cliff face continued to flake away due to erosion."
        }
    ]
}