{
    "term": "flames",
    "meanings": [
        {
            "definition": "Burning gas or vapor, as from wood or coal, that is undergoing combustion",
            "pos": "noun",
            "sent1": "The flames danced in the fireplace, warming the room.",
            "sent2": "The firefighter bravely battled the flames to save the house.",
            "sent3": "The marshmallows turned into gooey treats over the flames of the campfire.",
            "sent4": "The flames of the candle flickered in the dark room, casting eerie shadows.",
            "sent5": "The flames roared as the bonfire crackled and popped."
        },
        {
            "definition": "Intense passion or emotion",
            "pos": "noun",
            "sent1": "Her eyes burned with flames of determination as she prepared for the race.",
            "sent2": "The flames of love kept them warm on cold winter nights.",
            "sent3": "His speech was filled with flames of excitement, making the audience cheer.",
            "sent4": "The flames of anger consumed him, leading to a heated argument.",
            "sent5": "The flames of joy spread through the crowd, creating a festive atmosphere."
        },
        {
            "definition": "Insulting or critical comments or messages on the internet",
            "pos": "noun",
            "sent1": "The online forum was filled with flames from anonymous users.",
            "sent2": "She received hurtful flames on social media, but chose to ignore them.",
            "sent3": "Instead of engaging in flames, he decided to spread positivity online.",
            "sent4": "The flames of cyberbullying can have a lasting impact on mental health.",
            "sent5": "The flames of negativity were extinguished by a wave of support from friends."
        },
        {
            "definition": "Bright, glowing, or flickering light and heat",
            "pos": "noun",
            "sent1": "The flames of the torch illuminated the dark cave.",
            "sent2": "The flames of the lantern guided them through the forest.",
            "sent3": "The flames of the bonfire cast a warm glow on their faces.",
            "sent4": "The flames of the fireplace created a cozy ambiance in the room.",
            "sent5": "The flames of the candles flickered gently, creating a peaceful atmosphere."
        },
        {
            "definition": "To burn with a flame",
            "pos": "verb",
            "sent1": "She carefully lit the match and watched it flames brightly.",
            "sent2": "The wildfire flames through the dry forest, causing devastation.",
            "sent3": "The chef expertly flames the dessert, creating a spectacular presentation.",
            "sent4": "The campers learned how to safely flames a marshmallow over the fire.",
            "sent5": "The dragon flames its enemies with a fiery breath."
        }
    ]
}