{
    "term": "flancards",
    "meanings": [
        {
            "definition": "A type of military equipment used to protect the sides of a horse or soldier.",
            "pos": "noun",
            "sent1": "The knight fastened the sturdy flancards to his horse before heading into battle.",
            "sent2": "The soldiers polished their flancards to a shine before the important mission.",
            "sent3": "The mischievous squirrel tried to wear the flancards as oversized earrings.",
            "sent4": "The flancards stood as silent guardians on the battlefield, shielding the warriors.",
            "sent5": "The clanking sound of the flancards echoed through the valley, a reminder of the impending conflict."
        },
        {
            "definition": "A decorative piece of armor worn on the sides of a horse.",
            "pos": "noun",
            "sent1": "The royal procession showcased majestic horses adorned with intricate flancards.",
            "sent2": "The knight's horse proudly displayed the ornate flancards during the tournament.",
            "sent3": "The mischievous stable cat tried to play with the shiny flancards, mistaking them for toys.",
            "sent4": "The flancards gleamed in the sunlight, adding a touch of elegance to the horse's appearance.",
            "sent5": "The delicate engravings on the flancards told stories of past victories and glory."
        },
        {
            "definition": "A type of shield used in battle.",
            "pos": "noun",
            "sent1": "The warriors raised their flancards in unison, forming a protective barrier.",
            "sent2": "The flancards bore the marks of countless battles, a testament to their durability.",
            "sent3": "The mischievous soldier pretended the flancard was a mirror, checking his reflection in the heat of battle.",
            "sent4": "The flancards locked together like puzzle pieces, creating an impenetrable defense.",
            "sent5": "The glint of steel from the flancards struck fear into the hearts of the enemy forces."
        }
    ]
}