{
    "term": "flannel",
    "meanings": [
        {
            "definition": "A soft woven fabric typically made of wool or cotton.",
            "pos": "noun",
            "sent1": "She wore a cozy flannel blanket on the chilly night.",
            "sent2": "The baby's pajamas were made of warm flannel material.",
            "sent3": "The cat snuggled up on the flannel bedsheet and purred contentedly.",
            "sent4": "The flannel clouds in the sky looked like soft pillows floating above.",
            "sent5": "The touch of flannel against her skin felt like a gentle hug."
        },
        {
            "definition": "A shirt made of flannel fabric.",
            "pos": "noun",
            "sent1": "He put on his favorite red flannel for the outdoor picnic.",
            "sent2": "In the winter, she always wears a flannel to stay warm.",
            "sent3": "The flannel shirt was so big on him, it looked like a dress!",
            "sent4": "Her flannel shirt was a shield against the cold wind outside.",
            "sent5": "The plaid flannel added a pop of color to his outfit."
        },
        {
            "definition": "To rub or clean with a piece of flannel.",
            "pos": "verb",
            "sent1": "She gently flanneled the delicate glass to make it sparkle.",
            "sent2": "He flanneled the dusty bookshelf until it gleamed.",
            "sent3": "The mischievous puppy grabbed the flannel and ran around the house.",
            "sent4": "She flanneled away the dirt, revealing the shiny surface underneath.",
            "sent5": "The old man flanneled his glasses to see clearly again."
        },
        {
            "definition": "To cover or wrap with flannel.",
            "pos": "verb",
            "sent1": "She flanneled the fragile vase to protect it during the move.",
            "sent2": "He flanneled the baby snugly before putting her to sleep.",
            "sent3": "The magician flanneled the rabbit, making it disappear in a puff of smoke.",
            "sent4": "The artist flanneled the canvas before starting to paint.",
            "sent5": "The mother flanneled her child in a warm embrace."
        }
    ]
}