{
    "term": "flaperons",
    "meanings": [
        {
            "definition": "A type of aircraft control surface that combines aspects of both flaps and ailerons.",
            "pos": "noun",
            "sent1": "The flaperons on the small plane moved up and down to control the altitude.",
            "sent2": "During the flight, the flaperons were used to adjust the plane's position.",
            "sent3": "The flaperons on the toy plane were so big that they made it look like a flying monster!",
            "sent4": "Her hands moved like flaperons as she tried to balance work and family life.",
            "sent5": "The colorful flaperons on the aircraft made it easy to spot in the sky."
        },
        {
            "definition": "The flaperons on the plane were damaged during the rough landing.",
            "pos": "noun",
            "sent1": "After the rough landing, the flaperons were bent and needed repair.",
            "sent2": "The mechanic inspected the flaperons carefully to assess the extent of the damage.",
            "sent3": "The flaperons looked like they had a wild party during the rough landing!",
            "sent4": "The flaperons hung limply, like broken wings, after the rough landing.",
            "sent5": "The damaged flaperons reminded everyone of the importance of a smooth landing."
        },
        {
            "definition": "The pilot adjusted the flaperons to help with the descent.",
            "pos": "noun",
            "sent1": "With a gentle touch, the pilot moved the flaperons to guide the plane down.",
            "sent2": "The descent was smooth thanks to the pilot's skillful use of the flaperons.",
            "sent3": "The flaperons whispered to each other as they helped the plane descend safely.",
            "sent4": "The flaperons danced gracefully in the air, aiding the plane's descent.",
            "sent5": "The pilot's hands expertly controlled the flaperons, ensuring a perfect landing."
        }
    ]
}