{
    "term": "flare",
    "meanings": [
        {
            "definition": "A sudden brief burst of bright flame or light.",
            "pos": "noun",
            "sent1": "The fireworks display ended with a colorful flare in the sky.",
            "sent2": "The flare of the match illuminated the dark room.",
            "sent3": "The chef's dramatic flare with the torch made everyone gasp.",
            "sent4": "Her laughter was like a flare, bright and infectious.",
            "sent5": "The flare of the lighthouse guided ships safely to shore."
        },
        {
            "definition": "A sudden burst of intense emotion or activity.",
            "pos": "noun",
            "sent1": "The sudden flare of anger in his eyes startled me.",
            "sent2": "The flare of excitement in the crowd was palpable.",
            "sent3": "Her flare of enthusiasm for the project was contagious.",
            "sent4": "The news of the victory caused a flare of celebration in the town.",
            "sent5": "The flare of panic spread quickly through the group."
        },
        {
            "definition": "To burn with a sudden intensity.",
            "pos": "verb",
            "sent1": "The dry leaves began to flare up when the match touched them.",
            "sent2": "The fire started to flare as more wood was added to it.",
            "sent3": "His attempt to cook dinner caused the kitchen to flare up in flames.",
            "sent4": "Emotions can flare up unexpectedly in heated arguments.",
            "sent5": "The candles began to flare brightly in the dark room."
        },
        {
            "definition": "To become wider at one end.",
            "pos": "verb",
            "sent1": "The pants flare out at the bottom, creating a bell-bottom style.",
            "sent2": "The skirt flares at the hips, giving it a flattering silhouette.",
            "sent3": "The tree's roots flare out at the base for stability.",
            "sent4": "The road flares out into a wide intersection ahead.",
            "sent5": "The trumpet's bell flares beautifully as the musician plays."
        }
    ]
}