{
    "term": "flaring",
    "meanings": [
        {
            "definition": "To burn with a sudden intensity",
            "pos": "verb",
            "sent1": "The campfire was flaring brightly in the dark night.",
            "sent2": "The candle was flaring up before it settled into a steady flame.",
            "sent3": "The marshmallows were roasting over the flaring fire, turning golden brown.",
            "sent4": "Her temper was like a flaring match, quick to ignite but short-lived.",
            "sent5": "The fireworks were flaring in the sky, painting it with vibrant colors."
        },
        {
            "definition": "A sudden burst of light or flame",
            "pos": "noun",
            "sent1": "The flaring torch illuminated the path ahead.",
            "sent2": "The explosion caused a bright flaring light that lit up the room.",
            "sent3": "The magician's trick involved a flaring burst of fire from his hat.",
            "sent4": "The flaring headlights of the car startled the deer in the forest.",
            "sent5": "The flaring sun dipped below the horizon, casting a warm glow over the land."
        },
        {
            "definition": "To become wider at one end",
            "pos": "verb",
            "sent1": "The vase flared at the top, creating a unique shape.",
            "sent2": "The trumpet's bell was flaring out, producing a bold sound.",
            "sent3": "The skirt was flaring as she twirled around on the dance floor.",
            "sent4": "The river flared into a wide pool before continuing its journey.",
            "sent5": "The tree roots were flaring out from the base, providing stability to the trunk."
        },
        {
            "definition": "A bright, unsteady light",
            "pos": "noun",
            "sent1": "The distant lighthouse sent out a flaring signal in the storm.",
            "sent2": "The lantern cast a flaring glow around the campsite.",
            "sent3": "The firefly's flaring light caught the attention of the curious child.",
            "sent4": "The flaring torches lined the path to guide the travelers through the night.",
            "sent5": "The flaring candle flickered in the draft, creating dancing shadows on the wall."
        }
    ]
}