{
    "term": "flares",
    "meanings": [
        {
            "definition": "A sudden brief burst of bright flame or light.",
            "pos": "noun",
            "sent1": "The fireworks display ended with colorful flares lighting up the night sky.",
            "sent2": "The rescue team used flares to signal for help in the dark.",
            "sent3": "The birthday cake flares were so bright, they almost outshone the candles.",
            "sent4": "Her excitement flares were evident in her eyes, sparkling like tiny flares.",
            "sent5": "The photographer captured the beauty of the flares against the dark backdrop."
        },
        {
            "definition": "A sudden burst of intense emotion.",
            "pos": "noun",
            "sent1": "His flares of anger were visible in the way his face turned red.",
            "sent2": "She felt flares of happiness when she saw her long-lost friend.",
            "sent3": "The flares of laughter erupted from the audience during the comedy show.",
            "sent4": "The flares of jealousy in her eyes were hard to miss.",
            "sent5": "The flares of excitement in the room were contagious, spreading joy to everyone."
        },
        {
            "definition": "To burn with a sudden burst of flame.",
            "pos": "verb",
            "sent1": "The bonfire flares up when more wood is added to it.",
            "sent2": "The candle flares briefly before settling into a steady flame.",
            "sent3": "The campfire flares unexpectedly, surprising everyone around.",
            "sent4": "The stove flares as the chef adds oil to the hot pan.",
            "sent5": "The fireplace flares brightly, warming up the entire room."
        },
        {
            "definition": "To become wider at one end.",
            "pos": "verb",
            "sent1": "The pants flares at the bottom, giving them a stylish look.",
            "sent2": "The trumpet flares out at the bell, creating a unique sound.",
            "sent3": "The skirt flares gracefully as she twirls around the dance floor.",
            "sent4": "The flower flares open in the morning sunlight, revealing its beauty.",
            "sent5": "The road flares out into a wide intersection, allowing for smooth traffic flow."
        }
    ]
}