{
    "term": "flareups",
    "meanings": [
        {
            "definition": "A sudden outburst or intensification of a disease or symptoms.",
            "pos": "noun",
            "sent1": "During the winter, my asthma often causes flareups, making it hard to breathe.",
            "sent2": "The doctor prescribed medication to help manage the flareups of my skin condition.",
            "sent3": "When my allergies act up, it's like my body is having a party with flareups as the guests!",
            "sent4": "Her anxiety felt like a series of flareups, each one more intense than the last.",
            "sent5": "The sudden flareups of pain in his back were a constant reminder of his injury."
        },
        {
            "definition": "A sudden burst of flame or light.",
            "pos": "noun",
            "sent1": "The fireworks display ended with a beautiful finale of colorful flareups in the sky.",
            "sent2": "The candle flickered and produced small flareups of light in the dark room.",
            "sent3": "The campfire crackled, sending flareups of warmth into the chilly night air.",
            "sent4": "The photographer captured the flareups of sunlight peeking through the trees.",
            "sent5": "The flareups of the bonfire illuminated the faces of the campers with a warm glow."
        },
        {
            "definition": "A sudden burst of anger or violence.",
            "pos": "noun",
            "sent1": "His temper tantrum included sudden flareups of anger that startled everyone around him.",
            "sent2": "The argument escalated quickly, with flareups of shouting and accusations.",
            "sent3": "The comedy skit exaggerated flareups of anger for comedic effect, making the audience laugh.",
            "sent4": "The protest turned violent with flareups of aggression from both sides.",
            "sent5": "The flareups of rage in his eyes warned others to stay away when he was upset."
        }
    ]
}