{
    "term": "flashes",
    "meanings": [
        {
            "definition": "To emit a sudden, brief burst of light",
            "pos": "verb",
            "sent1": "The camera flashes during the photo shoot.",
            "sent2": "The lighthouse flashes its light to guide ships.",
            "sent3": "The firefly flashes its light to impress its friends.",
            "sent4": "The lightning flashes across the dark sky.",
            "sent5": "The disco ball flashes colorful lights all around the room."
        },
        {
            "definition": "A sudden, brief display or burst of something",
            "pos": "noun",
            "sent1": "She saw flashes of lightning in the stormy sky.",
            "sent2": "The fireworks display had bright flashes of color.",
            "sent3": "The magician's trick involved a flash of light and smoke.",
            "sent4": "The sudden flash of inspiration led to a great idea.",
            "sent5": "The camera captured the quick flash of a shooting star."
        },
        {
            "definition": "To move or pass quickly",
            "pos": "verb",
            "sent1": "The car flashes by on the highway.",
            "sent2": "The cheetah flashes across the savanna in pursuit of prey.",
            "sent3": "The ninja flashes through the shadows unseen.",
            "sent4": "The shooting star flashes through the night sky.",
            "sent5": "The thought flashes through his mind like lightning."
        },
        {
            "definition": "A sudden, brief feeling or experience",
            "pos": "noun",
            "sent1": "She felt a flash of anger when he insulted her.",
            "sent2": "A flash of excitement crossed his face when he won the game.",
            "sent3": "The flash of fear in his eyes was quickly replaced by determination.",
            "sent4": "A flash of inspiration hit her, and she started writing.",
            "sent5": "The flash of joy in her heart was contagious to everyone around her."
        }
    ]
}