{
    "term": "flashover",
    "meanings": [
        {
            "definition": "A sudden, intense fire caused by the ignition of combustible material.",
            "pos": "noun",
            "sent1": "The firefighters quickly responded to the flashover in the building.",
            "sent2": "The flashover engulfed the entire room in flames within seconds.",
            "sent3": "The flashover startled the cat, making it jump up in surprise.",
            "sent4": "The flashover of emotions in the room was palpable, tensions rising high.",
            "sent5": "The flashover was so bright and hot, it left an unforgettable mark on everyone present."
        },
        {
            "definition": "The moment when an electrical current arcs between two conductors.",
            "pos": "noun",
            "sent1": "During the experiment, the scientist observed the flashover between the wires.",
            "sent2": "The flashover occurred when the circuit was overloaded with electricity.",
            "sent3": "The flashover between the wires created a small spark that surprised the onlookers.",
            "sent4": "The flashover of electricity was like a tiny lightning bolt in the lab.",
            "sent5": "The flashover of current was so sudden, it lit up the room for a split second."
        },
        {
            "definition": "The rapid spread of fire through a structure due to high temperatures and combustible materials.",
            "pos": "noun",
            "sent1": "The firefighters worked hard to contain the flashover in the building.",
            "sent2": "The flashover in the warehouse was fueled by the flammable materials stored inside.",
            "sent3": "The flashover through the house seemed almost eager to reach every corner.",
            "sent4": "The flashover of flames was like a wave crashing through the structure.",
            "sent5": "The flashover's speed and intensity were unmatched, leaving destruction in its wake."
        }
    ]
}