{
    "term": "flatliners",
    "meanings": [
        {
            "definition": "A person who has flatlined, or experienced a cessation of brain activity and heart function.",
            "pos": "noun",
            "sent1": "The doctors rushed to revive the flatliners in the emergency room.",
            "sent2": "The hospital staff worked tirelessly to save the flatliners.",
            "sent3": "The flatliners in the medical drama suddenly sat up and asked for a sandwich.",
            "sent4": "In the movie, the flatliners faced their fears in the afterlife.",
            "sent5": "The image of the flatliners on the monitor was a stark reminder of mortality."
        },
        {
            "definition": "The title of a 1990 science fiction psychological horror film directed by Joel Schumacher.",
            "pos": "noun",
            "sent1": "Have you seen the movie Flatliners directed by Joel Schumacher?",
            "sent2": "Flatliners is a classic horror film that keeps you on the edge of your seat.",
            "sent3": "The group of friends decided to watch Flatliners for their movie night.",
            "sent4": "The eerie soundtrack of Flatliners added to the suspense of the film.",
            "sent5": "The poster of Flatliners gave me chills with its haunting imagery."
        },
        {
            "definition": "A term used to describe a medical condition where a patient's heart rate and brain activity are at a standstill.",
            "pos": "noun",
            "sent1": "The doctors monitored the flatliners closely in the ICU.",
            "sent2": "Flatliners require immediate intervention to restart their heart and brain functions.",
            "sent3": "The flatliners in the hospital room made the nurses nervous with their stillness.",
            "sent4": "The flatliners' families prayed for their loved ones to come back from the brink.",
            "sent5": "The flatliners' condition was a medical mystery that puzzled the experts."
        }
    ]
}