{
    "term": "flatus",
    "meanings": [
        {
            "definition": "Gas in the digestive tract.",
            "pos": "noun",
            "sent1": "After eating beans, some people experience uncomfortable flatus.",
            "sent2": "The doctor explained that flatus is a normal bodily function.",
            "sent3": "The room was filled with flatus after the bean-eating contest.",
            "sent4": "The flatus of laughter erupted from the comedian's audience.",
            "sent5": "The smell of flatus lingered in the air, causing embarrassment."
        },
        {
            "definition": "The act of passing gas.",
            "pos": "noun",
            "sent1": "She couldn't control her flatus during the silent meditation session.",
            "sent2": "In some cultures, openly discussing flatus is considered impolite.",
            "sent3": "The orchestra conductor blamed the off-key note on a sudden flatus.",
            "sent4": "The flatus of relief was evident on his face after the stressful meeting.",
            "sent5": "The unexpected flatus disrupted the solemn atmosphere of the funeral.",
            "sent6": "Flatus can be a source of embarrassment in quiet settings.",
            "sent7": "The sound of flatus echoed through the empty hallway.",
            "sent8": "She stifled a giggle at the unexpected flatus sound.",
            "sent9": "The flatus odor was unmistakable in the crowded elevator.",
            "sent10": "Flatus noises can sometimes be mistaken for other sounds."
        },
        {
            "definition": "To expel gas from the digestive tract.",
            "pos": "verb",
            "sent1": "He tried to discreetly flatus during the important meeting.",
            "sent2": "The baby would often flatus loudly after feeding.",
            "sent3": "She jokingly threatened to flatus if he didn't stop tickling her.",
            "sent4": "The old car seemed to flatus smoke from its exhaust.",
            "sent5": "The volcano appeared to flatus ash and smoke into the sky."
        }
    ]
}