{
    "term": "fleches",
    "meanings": [
        {
            "definition": "Fleches: plural of fleche, a small pointed missile",
            "pos": "noun",
            "sent1": "The army launched fleches at the enemy during the battle.",
            "sent2": "The soldiers carried fleches in their quivers for protection.",
            "sent3": "The playful cat knocked over a vase, mistaking it for a fleche.",
            "sent4": "Her sharp words hit him like fleches, leaving wounds unseen.",
            "sent5": "The fleches whistled through the air, finding their target with precision."
        },
        {
            "definition": "Fleches: plural of fleche, a narrow strip of land or a narrow strip of water",
            "pos": "noun",
            "sent1": "The river split into two fleches, creating a beautiful island.",
            "sent2": "The hikers followed the fleches of land that led to the hidden waterfall.",
            "sent3": "The kids pretended the hallway was a dangerous fleche they had to cross.",
            "sent4": "The road resembled a fleche, stretching endlessly into the horizon.",
            "sent5": "The map showed the fleches of water winding through the forest."
        },
        {
            "definition": "Fleches: plural of fleche, a pointed architectural feature",
            "pos": "noun",
            "sent1": "The cathedral's spires and fleches reached towards the sky.",
            "sent2": "The old castle had intricate fleches decorating its walls.",
            "sent3": "The artist sketched a unique fleche on the corner of the building.",
            "sent4": "Her gaze was drawn to the fleche, standing out among the other details.",
            "sent5": "The sunlight illuminated the golden fleches of the ancient temple."
        },
        {
            "definition": "Fleches: plural of fleche, a type of arrow used in archery",
            "pos": "noun",
            "sent1": "The archer carefully selected a fleche from his quiver.",
            "sent2": "She practiced her aim by shooting fleches at the target.",
            "sent3": "The mischievous squirrel stole a fleche from the archery range.",
            "sent4": "His words were like sharp fleches, piercing through her defenses.",
            "sent5": "The competition required participants to craft their own fleches for the tournament."
        }
    ]
}