{
    "term": "fleeched",
    "meanings": [
        {
            "definition": "To obtain something by devious or dishonest means.",
            "pos": "verb",
            "sent1": "He fleeched his way into getting extra cookies by pretending to be hungry.",
            "sent2": "The thief fleeched the jewels from the museum under the cover of darkness.",
            "sent3": "The sly fox fleeched the chickens out of their coop with promises of a grand feast.",
            "sent4": "She fleeched her way into the exclusive club by sweet-talking the bouncer.",
            "sent5": "The con artist fleeched money from unsuspecting victims with his smooth words."
        },
        {
            "definition": "To coax or wheedle.",
            "pos": "verb",
            "sent1": "She fleeched her little brother into sharing his toys by offering him a candy.",
            "sent2": "The salesman fleeched the customer into buying the expensive vacuum cleaner.",
            "sent3": "The child tried to fleech the dog into giving up the ball by offering a treat.",
            "sent4": "He fleeched his way into getting a discount on the car by charming the salesperson.",
            "sent5": "The teacher fleeched the students into participating in the class activity with promises of a fun time."
        },
        {
            "definition": "To flatter or cajole in order to persuade.",
            "pos": "verb",
            "sent1": "She fleeched her boss by complimenting his tie to get a day off.",
            "sent2": "The politician fleeched the voters with promises of lower taxes.",
            "sent3": "The child tried to fleech his parents into letting him stay up late by saying they were the best parents ever.",
            "sent4": "He fleeched his way into getting the promotion by praising his colleague's work.",
            "sent5": "The student fleeched the teacher by praising her lectures to get an extension on the assignment."
        }
    ]
}