{
    "term": "fleeted",
    "meanings": [
        {
            "definition": "Move swiftly",
            "pos": "verb",
            "sent1": "The rabbit fleeted across the field to escape the fox.",
            "sent2": "The car fleeted down the highway, reaching top speed.",
            "sent3": "The cheetah fleeted past the other animals in the race, leaving them in awe.",
            "sent4": "Time fleeted by like a speeding train, never stopping for anyone.",
            "sent5": "The wind fleeted through the trees, rustling the leaves in its path."
        },
        {
            "definition": "Passed quickly",
            "pos": "adverb",
            "sent1": "The opportunity fleeted before she could seize it.",
            "sent2": "The days fleeted by as they enjoyed their vacation.",
            "sent3": "The chance to win fleeted like a shooting star in the night sky.",
            "sent4": "Her smile fleeted across her face when she saw the surprise.",
            "sent5": "The sun fleeted below the horizon, signaling the end of the day."
        },
        {
            "definition": "A group of ships or vehicles",
            "pos": "noun",
            "sent1": "The naval fleeted sailed majestically into the harbor.",
            "sent2": "The car fleeted lined up for the start of the race.",
            "sent3": "The fleeted of trucks stretched for miles on the highway.",
            "sent4": "The space fleeted prepared for its mission to explore the galaxy.",
            "sent5": "The fishing fleeted returned with a bountiful catch from the sea."
        },
        {
            "definition": "A group of people or animals",
            "pos": "noun",
            "sent1": "The fleeted of geese flew south for the winter.",
            "sent2": "The fleeted of children played happily in the park.",
            "sent3": "The fleeted of fans cheered loudly at the concert.",
            "sent4": "The fleeted of elephants marched together in a line.",
            "sent5": "The fleeted of ants worked tirelessly to build their nest."
        }
    ]
}