{
    "term": "flex",
    "meanings": [
        {
            "definition": "To bend or stretch (a part of the body) in order to show strength or suppleness.",
            "pos": "verb",
            "sent1": "She decided to flex her arms before the race to warm up.",
            "sent2": "He likes to flex his muscles at the gym to impress others.",
            "sent3": "The yoga instructor asked the class to flex their bodies like rubber bands.",
            "sent4": "The dancer seemed to flex every muscle in her body with grace and precision.",
            "sent5": "The athlete's ability to flex his muscles effortlessly amazed the crowd."
        },
        {
            "definition": "To exhibit one's power or influence.",
            "pos": "verb",
            "sent1": "The CEO likes to flex his authority in the office.",
            "sent2": "She always finds a way to flex her connections to get things done.",
            "sent3": "The superhero decided to flex his superpowers to save the day.",
            "sent4": "The politician tried to flex his influence to sway the decision in his favor.",
            "sent5": "The king would often flex his royal decree to assert his dominance."
        },
        {
            "definition": "To show off or boast.",
            "pos": "verb",
            "sent1": "He tends to flex about his achievements whenever he gets the chance.",
            "sent2": "She likes to flex her knowledge in front of her classmates.",
            "sent3": "The peacock continued to flex its colorful feathers to attract a mate.",
            "sent4": "The actor couldn't resist the urge to flex his acting skills during the audition.",
            "sent5": "The student would flex his academic prowess whenever a new topic was introduced."
        },
        {
            "definition": "To adjust or adapt to a situation.",
            "pos": "verb",
            "sent1": "She had to flex her schedule to accommodate the unexpected meeting.",
            "sent2": "He learned to flex his plans when things didn't go as expected.",
            "sent3": "The chef had to flex the recipe to work with the available ingredients.",
            "sent4": "The team had to flex their strategy to counter the opponent's unexpected move.",
            "sent5": "The teacher had to flex the lesson plan to address the students' different learning styles."
        },
        {
            "definition": "To contract (a muscle) in order to show off.",
            "pos": "verb",
            "sent1": "The bodybuilder would flex his biceps to display their size.",
            "sent2": "She would often flex her abs to demonstrate her fitness level.",
            "sent3": "The model would flex his muscles during the photoshoot to highlight his physique.",
            "sent4": "The wrestler would flex his muscles before entering the ring to intimidate his opponent.",
            "sent5": "The athlete would flex his muscles in victory after winning the championship."
        }
    ]
}