{
    "term": "flick",
    "meanings": [
        {
            "definition": "A quick, light movement",
            "pos": "noun",
            "sent1": "She gave the light switch a flick to turn off the lights.",
            "sent2": "The cat caught the bug with a quick flick of its paw.",
            "sent3": "With a flick of her wrist, she tossed the paper airplane into the air.",
            "sent4": "The dancer's flick of the wrist added grace to her performance.",
            "sent5": "The flick of the butterfly's wings created a gentle breeze."
        },
        {
            "definition": "To propel or remove with a quick movement",
            "pos": "verb",
            "sent1": "He used his finger to flick the crumb off the table.",
            "sent2": "She flicked the light switch on and the room brightened.",
            "sent3": "The chef expertly flicked the vegetables in the pan.",
            "sent4": "The magician flicked the coin into the air, dazzling the audience.",
            "sent5": "The soccer player flicked the ball past the goalie and scored a goal."
        },
        {
            "definition": "A quick, light blow or stroke",
            "pos": "noun",
            "sent1": "He felt a flick on his shoulder and turned to see who it was.",
            "sent2": "The boxer dodged the opponent's flick and counterattacked.",
            "sent3": "The playful flick on the nose made him giggle.",
            "sent4": "The flick of the paintbrush added detail to the artwork.",
            "sent5": "The flick of the tail showed the cat's annoyance."
        },
        {
            "definition": "To activate or turn on with a quick movement",
            "pos": "verb",
            "sent1": "She flicked the light switch and the room was illuminated.",
            "sent2": "He flicked the remote control to turn on the TV.",
            "sent3": "The child flicked the toy car to make it move forward.",
            "sent4": "With a flick of the wrist, he turned on the blender.",
            "sent5": "She flicked the ignition key and the engine roared to life."
        }
    ]
}