{
    "term": "flights",
    "meanings": [
        {
            "definition": "The act of flying through the air",
            "pos": "noun",
            "sent1": "Birds enjoy their flights in the sky.",
            "sent2": "The pilot announced that the flights were smooth.",
            "sent3": "During the flight, the clouds played hide and seek.",
            "sent4": "Her dreams took flights like colorful butterflies.",
            "sent5": "The flights of imagination can take us anywhere."
        },
        {
            "definition": "A series of stairs or steps between landings",
            "pos": "noun",
            "sent1": "The flights in the old house creaked with each step.",
            "sent2": "She counted the flights as she climbed to the top floor.",
            "sent3": "The cat's playful antics turned the flights into a playground.",
            "sent4": "The flights of stairs seemed never-ending in the tall tower.",
            "sent5": "The flights of stairs spiraled up like a twisted vine."
        },
        {
            "definition": "A journey made by air, especially in an airplane",
            "pos": "noun",
            "sent1": "Their family took flights to visit relatives overseas.",
            "sent2": "The long flights tired the passengers but excited them too.",
            "sent3": "The flights were delayed, causing frustration among travelers.",
            "sent4": "In her dream, the flights were filled with magical creatures.",
            "sent5": "The flights across the ocean felt like a grand adventure."
        },
        {
            "definition": "A set of steps between floors in a building",
            "pos": "noun",
            "sent1": "The flights in the office building were well-lit and clean.",
            "sent2": "She hurried up the flights to reach her meeting on time.",
            "sent3": "The flights in the old library whispered stories of the past.",
            "sent4": "The flights in the historic building were worn from years of use.",
            "sent5": "The flights in the museum led visitors to hidden treasures."
        }
    ]
}