{
    "term": "flints",
    "meanings": [
        {
            "definition": "Hard, gray rock used to create sparks when struck against steel",
            "pos": "noun",
            "sent1": "The flints in the fire starter produced bright sparks.",
            "sent2": "The caveman struck the flints together to make fire.",
            "sent3": "The flints decided to have a sparkly competition.",
            "sent4": "Her determination was as sharp as flints.",
            "sent5": "The flints glowed like tiny stars in the dark cave."
        },
        {
            "definition": "Pieces of flint used as tools or weapons by early humans",
            "pos": "noun",
            "sent1": "Archaeologists found ancient flints near the campsite.",
            "sent2": "Early humans crafted their tools from sharp flints.",
            "sent3": "The flints were tired of being mistaken for rocks.",
            "sent4": "His words were as cutting as flints in battle.",
            "sent5": "The flints were the key to survival for early humans."
        },
        {
            "definition": "A small piece of flint used in a flintlock firearm",
            "pos": "noun",
            "sent1": "The soldier carefully loaded the flints into his gun.",
            "sent2": "The flintlock pistol required fresh flints for each shot.",
            "sent3": "The flints in the gun had a heated argument.",
            "sent4": "His resolve was as unyielding as flints in battle.",
            "sent5": "The flints sparked the beginning of the duel."
        },
        {
            "definition": "A hard, sharp-edged mineral used for making tools and weapons",
            "pos": "noun",
            "sent1": "The flints were essential for crafting hunting tools.",
            "sent2": "Warriors relied on flints to fashion their weapons.",
            "sent3": "The flints were the envy of all the other minerals.",
            "sent4": "Her wit was as sharp as flints in a skilled craftsman's hands.",
            "sent5": "The flints gleamed in the sunlight, ready for battle."
        }
    ]
}