{
    "term": "flipper",
    "meanings": [
        {
            "definition": "A flat, broad limb adapted for swimming, such as that of seals or whales.",
            "pos": "noun",
            "sent1": "The seal used its flipper to glide gracefully through the water.",
            "sent2": "Whales use their flippers to steer and propel themselves in the ocean.",
            "sent3": "The playful seal clapped its flipper in excitement after catching a fish.",
            "sent4": "Her flipper of an arm effortlessly sliced through the water like a knife.",
            "sent5": "The flipper of the whale was as wide as a sail, catching the sunlight as it moved."
        },
        {
            "definition": "A small, flat rubber device worn on the feet for swimming.",
            "pos": "noun",
            "sent1": "I put on my flippers before jumping into the pool.",
            "sent2": "Swimmers often use flippers to move faster in the water.",
            "sent3": "The little girl giggled as she tried to walk in the flippers on land.",
            "sent4": "His flippers transformed his feet into powerful propellers in the pool.",
            "sent5": "The flippers made her feel like a mermaid, gliding effortlessly through the water."
        },
        {
            "definition": "A person who buys and sells property quickly for profit.",
            "pos": "noun",
            "sent1": "The flipper purchased the house, renovated it, and sold it for a higher price.",
            "sent2": "Real estate flippers often look for undervalued properties to invest in.",
            "sent3": "The flipper was known for turning run-down houses into beautiful homes.",
            "sent4": "She was a skilled flipper, always finding great deals in the market.",
            "sent5": "The flipper's success in the property market was unmatched, making quick profits."
        },
        {
            "definition": "A hinged cover for a pocketknife or other tool.",
            "pos": "noun",
            "sent1": "He opened the pocketknife and revealed the sharp blade under the flipper.",
            "sent2": "The flipper of the knife made it easy to access the blade quickly.",
            "sent3": "As he fidgeted with the flipper, the knife unexpectedly popped open.",
            "sent4": "The flipper on the tool was designed for smooth and swift deployment.",
            "sent5": "With a flick of the flipper, the knife was ready for use in an instant."
        }
    ]
}