{
    "term": "flips",
    "meanings": [
        {
            "definition": "To turn over or cause to turn over with a sudden sharp movement.",
            "pos": "verb",
            "sent1": "She flips the pancake in the pan.",
            "sent2": "He flips the light switch to turn off the lights.",
            "sent3": "The cat flips the toy mouse in the air playfully.",
            "sent4": "The wind flips the pages of the book as it blows through the window.",
            "sent5": "The gymnast flips gracefully on the balance beam."
        },
        {
            "definition": "A sudden reversal of direction, motion, or position.",
            "pos": "noun",
            "sent1": "The sudden flip of the coin decided the winner.",
            "sent2": "The dolphin's playful flip delighted the audience.",
            "sent3": "The unexpected flip in the weather caught everyone by surprise.",
            "sent4": "The market experienced a dramatic flip in trends overnight.",
            "sent5": "The acrobat's flawless flip amazed the spectators."
        },
        {
            "definition": "A somersault or acrobatic movement.",
            "pos": "noun",
            "sent1": "The gymnast performed a perfect flip during her routine.",
            "sent2": "The circus performer executed a series of flips in the air.",
            "sent3": "The clown's hilarious flip made the audience burst into laughter.",
            "sent4": "The dancer's graceful flip added elegance to the performance.",
            "sent5": "The acrobat's daring flip left the crowd in awe."
        },
        {
            "definition": "To change or exchange something.",
            "pos": "verb",
            "sent1": "She flips her phone to show me a picture.",
            "sent2": "He flips his old car for a newer model.",
            "sent3": "The student flips his pencil with his friend for a pen.",
            "sent4": "The chef flips the ingredients in the pan skillfully.",
            "sent5": "The real estate agent flips houses for a profit."
        },
        {
            "definition": "A quick, sharp movement.",
            "pos": "noun",
            "sent1": "The bird caught the insect with a quick flip of its beak.",
            "sent2": "The fish made a sudden flip in the water to escape the predator.",
            "sent3": "The cat's playful flip of its tail showed its excitement.",
            "sent4": "The gymnast's precise flip impressed the judges.",
            "sent5": "The sudden flip of the switch turned off the lights."
        }
    ]
}