{
    "term": "flip",
    "meanings": [
        {
            "definition": "To turn over quickly or lightly",
            "pos": "verb",
            "sent1": "I will flip the pancake in the pan.",
            "sent2": "She likes to flip through the pages of her favorite book.",
            "sent3": "The cat tried to flip the toy mouse but ended up chasing it instead.",
            "sent4": "His decision to flip the switch turned on the lights in the room.",
            "sent5": "The gymnast can flip effortlessly on the balance beam."
        },
        {
            "definition": "To toss or throw with a quick motion",
            "pos": "verb",
            "sent1": "He will flip the coin to decide who goes first.",
            "sent2": "The chef will flip the pizza dough in the air.",
            "sent3": "She tried to flip the ball to her friend but missed and hit the wall.",
            "sent4": "The magician will flip the cards in a mesmerizing way.",
            "sent5": "The athlete can flip the frisbee with precision."
        },
        {
            "definition": "To change suddenly or unexpectedly",
            "pos": "verb",
            "sent1": "The weather can flip from sunny to rainy in minutes.",
            "sent2": "Her mood can flip from happy to sad very quickly.",
            "sent3": "The plan to go to the park might flip to a movie night instead.",
            "sent4": "The market can flip directions in a matter of seconds.",
            "sent5": "The decision to flip the coin determined the winner."
        },
        {
            "definition": "A quick, sharp movement or sound",
            "pos": "noun",
            "sent1": "The light switch made a loud flip when turned on.",
            "sent2": "The gymnast's flip was so quick that it amazed the audience.",
            "sent3": "The sudden flip of the bird startled the cat.",
            "sent4": "The flip of the coin decided the fate of the game.",
            "sent5": "The flip of the paper caught everyone's attention."
        },
        {
            "definition": "A somersault or acrobatic movement",
            "pos": "noun",
            "sent1": "The circus performer executed a perfect flip on the trampoline.",
            "sent2": "The gymnast's flip in the air was graceful and precise.",
            "sent3": "The dog attempted a flip but ended up rolling on the grass.",
            "sent4": "The dolphin's flip out of the water was a sight to behold.",
            "sent5": "The acrobat's flip left the audience in awe."
        }
    ]
}