{
    "term": "flivver",
    "meanings": [
        {
            "definition": "A small, cheap, old car.",
            "pos": "noun",
            "sent1": "My grandpa used to drive a flivver to work every day.",
            "sent2": "The flivver sputtered and coughed as it struggled up the hill.",
            "sent3": "The kids in the neighborhood loved to play pretend in the old flivver parked in Mr. Johnson's yard.",
            "sent4": "The flivver chugged along like a tired old horse, barely making it to the finish line.",
            "sent5": "The rusty flivver looked like it had seen better days, but it still got us where we needed to go."
        },
        {
            "definition": "To move quickly or erratically.",
            "pos": "verb",
            "sent1": "The squirrel would flivver from tree to tree, gathering nuts for the winter.",
            "sent2": "The leaves flivvered in the wind, creating a beautiful dance of colors in the autumn air.",
            "sent3": "The butterfly seemed to flivver around the garden, never staying in one place for long.",
            "sent4": "Her heart flivvered with excitement as she waited for the results of the competition.",
            "sent5": "The fireflies flivvered in the night, lighting up the darkness with their magical glow."
        },
        {
            "definition": "A person or thing regarded as worthless or unreliable.",
            "pos": "noun",
            "sent1": "Don't listen to him, he's just a flivver who never keeps his promises.",
            "sent2": "The broken clock on the wall was nothing but a flivver, always showing the wrong time.",
            "sent3": "The old mop in the corner was a flivver, shedding more strands than it cleaned up.",
            "sent4": "The leaky faucet was a flivver, wasting water and driving up the utility bill.",
            "sent5": "The cheap umbrella turned out to be a flivver, flipping inside out at the first gust of wind."
        }
    ]
}