{
    "term": "flivvers",
    "meanings": [
        {
            "definition": "Flivvers (noun): a small, cheap, old car",
            "pos": "noun",
            "sent1": "My grandpa used to drive a flivvers to work every day.",
            "sent2": "The flivvers parked outside the house looked like they were from a different era.",
            "sent3": "The flivvers in the parking lot seemed to have a mind of their own, always finding a new spot to occupy.",
            "sent4": "The flivvers on the road moved in a synchronized dance, weaving in and out of traffic effortlessly.",
            "sent5": "The rusty flivvers in the junkyard whispered stories of their past adventures."
        },
        {
            "definition": "Flivvers (verb): to move quickly and erratically",
            "pos": "verb",
            "sent1": "The squirrel flivvers across the yard, darting between trees in search of acorns.",
            "sent2": "The excited puppy flivvers around the room, chasing its tail with glee.",
            "sent3": "The leaves flivvered in the wind, creating a mesmerizing dance of colors in the autumn air.",
            "sent4": "Her heart flivvered with anticipation as she waited for the results of the exam.",
            "sent5": "The fireflies flivvered in the night sky, lighting up the darkness with their magical glow."
        },
        {
            "definition": "Flivvers (adjective): describing something as cheap or unreliable",
            "pos": "adjective",
            "sent1": "The flivvers phone she bought online stopped working after just a week.",
            "sent2": "His flivvers watch always ran five minutes fast, making him late for appointments.",
            "sent3": "The flivvers umbrella she carried broke in the first gust of wind, leaving her drenched in the rain.",
            "sent4": "The flivvers toaster burned every slice of bread, no matter the setting.",
            "sent5": "The flivvers flashlight flickered on and off, casting eerie shadows in the dark hallway."
        }
    ]
}