{
    "term": "floats",
    "meanings": [
        {
            "definition": "Rests on the surface of a liquid without sinking.",
            "pos": "adjective",
            "sent1": "The colorful balloon is light and floats effortlessly in the sky.",
            "sent2": "The feather is so light that it floats on the water.",
            "sent3": "The bubblegum is so sticky that it floats in the air for a moment before falling.",
            "sent4": "Her dreamy smile gives her a floaty, happy aura.",
            "sent5": "The fluffy cloud looks like it floats in the vast blue sky."
        },
        {
            "definition": "Moves gently on the surface of a liquid.",
            "pos": "verb",
            "sent1": "The leaf floats downstream in the calm river.",
            "sent2": "The boat floats peacefully on the tranquil lake.",
            "sent3": "The rubber duck floats around the bathtub, making bath time fun.",
            "sent4": "Her thoughts float aimlessly like bubbles in her mind.",
            "sent5": "The paper boat floats gracefully on the small pond."
        },
        {
            "definition": "Suspended in a liquid or gas.",
            "pos": "adjective",
            "sent1": "The tiny particles are so light that they float in the air.",
            "sent2": "The oil forms a thin layer that floats on top of the water.",
            "sent3": "The dust motes float lazily in the sunbeam, creating a magical effect.",
            "sent4": "Her ethereal voice seems to float through the room.",
            "sent5": "The bubbles in the soda float to the surface, ready to pop."
        },
        {
            "definition": "A platform or structure that is buoyant and used for transportation or recreation.",
            "pos": "noun",
            "sent1": "The kids had a blast playing on the colorful float in the pool.",
            "sent2": "The parade featured a grand float decorated with flowers and ribbons.",
            "sent3": "The swans gracefully glide past the float during the lake festival.",
            "sent4": "The float in the parade was a whimsical representation of a fairy tale castle.",
            "sent5": "The float bobbed gently on the water, carrying the performers with pride."
        }
    ]
}