{
    "term": "float",
    "meanings": [
        {
            "definition": "To rest or remain on the surface of a liquid without sinking.",
            "pos": "verb",
            "sent1": "The leaf will float on the pond.",
            "sent2": "The boat can float on the calm lake.",
            "sent3": "The rubber duck likes to float in the bathtub.",
            "sent4": "Her dreams seemed to float away like bubbles in the wind.",
            "sent5": "The feather will float gently down to the ground."
        },
        {
            "definition": "A small object attached to a fishing line to indicate when a fish is biting.",
            "pos": "noun",
            "sent1": "The colorful float bobbed in the water.",
            "sent2": "The fisherman watched the float closely for any movement.",
            "sent3": "The float looked like a tiny toy boat on the surface.",
            "sent4": "The float danced on the ripples of the lake.",
            "sent5": "The float suddenly disappeared under the water's surface."
        },
        {
            "definition": "To move or hover gently in the air.",
            "pos": "verb",
            "sent1": "The kite will float high in the sky.",
            "sent2": "Balloons can float gracefully at a party.",
            "sent3": "The bubbles seemed to float magically in the air.",
            "sent4": "Her thoughts would float aimlessly like clouds.",
            "sent5": "The feather will float down from the tree branch."
        },
        {
            "definition": "A platform or structure that is buoyant and used for transportation on water.",
            "pos": "noun",
            "sent1": "The wooden float carried people across the river.",
            "sent2": "The dock was made of sturdy floats.",
            "sent3": "The float provided a stable surface for fishing.",
            "sent4": "The parade float was decorated with colorful flowers.",
            "sent5": "The float drifted gently along the calm river."
        },
        {
            "definition": "To be suspended in a liquid or gas.",
            "pos": "verb",
            "sent1": "The bubbles will float to the surface of the water.",
            "sent2": "The scent of fresh bread will float through the house.",
            "sent3": "The smell of cookies will float from the kitchen.",
            "sent4": "Her voice seemed to float in the quiet room.",
            "sent5": "The dust particles will float in the sunlight."
        }
    ]
}