{
    "term": "floorages",
    "meanings": [
        {
            "definition": "The total area of floors in a building.",
            "pos": "noun",
            "sent1": "The floorages of the house were measured to determine the size of the living space.",
            "sent2": "The architect calculated the floorages of each room to ensure enough flooring material was ordered.",
            "sent3": "As the floorages were being measured, the cat playfully chased the tape measure around.",
            "sent4": "The floorages of the office building stretched out like a vast ocean of carpet and tile.",
            "sent5": "The floorages of the gymnasium echoed with the sounds of sneakers squeaking and basketballs bouncing."
        },
        {
            "definition": "The act of covering a floor with material.",
            "pos": "noun",
            "sent1": "The floorages of the room were completed by the skilled workers in just one day.",
            "sent2": "She took pride in her floorages of the kitchen, carefully selecting the perfect tiles.",
            "sent3": "The floorages of the hallway were so beautifully done that visitors often stopped to admire them.",
            "sent4": "The floorages of the dance studio were like a canvas waiting for the dancers to paint their movements upon.",
            "sent5": "The floorages of the restaurant were so clean and shiny that customers felt like they were walking on glass."
        },
        {
            "definition": "The material used to cover a floor.",
            "pos": "noun",
            "sent1": "The store offered a wide variety of floorages, from hardwood to laminate.",
            "sent2": "She chose a luxurious carpet for the floorages of her bedroom.",
            "sent3": "The floorages of the playroom were covered in colorful foam tiles, creating a fun and safe space for children.",
            "sent4": "The floorages of the office were adorned with a plush rug that added a touch of elegance to the room.",
            "sent5": "The floorages of the classroom were lined with durable linoleum that could withstand the daily foot traffic."
        }
    ]
}