{
    "term": "flopping",
    "meanings": [
        {
            "definition": "To fall, sink, or collapse heavily and noisily.",
            "pos": "verb",
            "sent1": "The tired old tree was flopping in the wind.",
            "sent2": "The stack of books flopped onto the floor with a loud thud.",
            "sent3": "The floppy-eared puppy kept flopping over while trying to catch its tail.",
            "sent4": "The defeated boxer felt like he was flopping into a bottomless pit of despair.",
            "sent5": "The heavy rain made the branches of the tree flop around wildly."
        },
        {
            "definition": "To move or behave in a loose, slack, or ungainly manner.",
            "pos": "verb",
            "sent1": "The jellyfish was flopping gently in the water.",
            "sent2": "The old scarecrow flopped in the breeze, its arms swinging loosely.",
            "sent3": "The clown's oversized shoes made him look like he was flopping around comically.",
            "sent4": "The kite flopped in the sky, its tail trailing behind like a lazy stream.",
            "sent5": "The tired fish flopped lazily on the dock, trying to get back into the water."
        },
        {
            "definition": "To fail or be unsuccessful.",
            "pos": "verb",
            "sent1": "Despite his efforts, the plan flopped miserably.",
            "sent2": "The new restaurant flopped within a month of opening.",
            "sent3": "The magician's trick flopped when the rabbit refused to appear.",
            "sent4": "Her attempt to bake a cake from scratch flopped, leaving her with a burnt mess.",
            "sent5": "The comedian's joke flopped, leaving the audience in awkward silence."
        },
        {
            "definition": "To exaggerate or overact in a theatrical or dramatic manner.",
            "pos": "verb",
            "sent1": "The actor flopped dramatically onto the couch, pretending to faint.",
            "sent2": "She flopped onto the bed with a theatrical sigh, trying to get attention.",
            "sent3": "The child flopped onto the floor, pretending to be a dramatic movie star.",
            "sent4": "The singer flopped onto the stage, belting out a melodramatic ballad.",
            "sent5": "The mime flopped around the invisible box, exaggerating every movement."
        }
    ]
}