{
    "term": "flop",
    "meanings": [
        {
            "definition": "To fall or lie down heavily and noisily",
            "pos": "verb",
            "sent1": "The tired dog will flop onto the soft bed.",
            "sent2": "She watched the leaves flop to the ground in the autumn breeze.",
            "sent3": "After a long day, he decided to flop onto the couch and relax.",
            "sent4": "The exhausted runner's legs felt like they would flop beneath him.",
            "sent5": "The heavy book made her arms flop down as she tried to lift it."
        },
        {
            "definition": "A complete failure or collapse",
            "pos": "noun",
            "sent1": "The movie was a flop at the box office, receiving poor reviews.",
            "sent2": "The business investment turned out to be a flop, causing financial losses.",
            "sent3": "His attempt at a joke was a flop, leaving everyone silent.",
            "sent4": "The party was a flop with no one showing up to celebrate.",
            "sent5": "The new product launch was a flop, leading to disappointment among customers."
        },
        {
            "definition": "To move or hang loosely",
            "pos": "verb",
            "sent1": "The curtains flop in the breeze coming through the window.",
            "sent2": "Her hair would flop around as she danced energetically.",
            "sent3": "The floppy hat would flop over her eyes whenever the wind blew.",
            "sent4": "The fish would flop around in the boat before being released back into the water.",
            "sent5": "The loose sleeves of the shirt would flop as she raised her arms."
        },
        {
            "definition": "A sudden or heavy fall or drop",
            "pos": "noun",
            "sent1": "The flop of the rock into the pond created ripples on the surface.",
            "sent2": "The loud flop of the box hitting the floor startled the cat.",
            "sent3": "The unexpected flop of the market caused panic among investors.",
            "sent4": "The flop of the basketball through the hoop scored the winning point.",
            "sent5": "The flop of the rain on the roof made a soothing sound as she fell asleep."
        }
    ]
}