{
    "term": "floridly",
    "meanings": [
        {
            "definition": "In a flowery or elaborate manner",
            "pos": "adverb",
            "sent1": "She spoke floridly, using many fancy words to describe the simple story.",
            "sent2": "The author wrote floridly, adding unnecessary details to the plot.",
            "sent3": "The comedian joked floridly, making the audience laugh with his overly dramatic gestures.",
            "sent4": "Her speech flowed floridly, like a river of colorful words cascading through the room.",
            "sent5": "The artist painted floridly, creating a masterpiece of vibrant hues and intricate patterns."
        },
        {
            "definition": "Showing a red or flushed complexion",
            "pos": "adjective",
            "sent1": "After running, his face looked floridly red from the exertion.",
            "sent2": "The sunburn left her skin looking floridly flushed and uncomfortable.",
            "sent3": "The embarrassed student blushed floridly when called to the front of the class.",
            "sent4": "The tomato in the garden grew floridly red, ripe and ready to be picked.",
            "sent5": "The painting depicted a floridly flushed face, capturing the intensity of the emotion."
        },
        {
            "definition": "Excessively ornate or intricate in style",
            "pos": "adjective",
            "sent1": "The floridly decorated room overwhelmed visitors with its excessive embellishments.",
            "sent2": "Her writing style was floridly ornate, filled with unnecessary adjectives and descriptions.",
            "sent3": "The cake was decorated floridly, with intricate designs and elaborate frosting.",
            "sent4": "The garden was filled with floridly blooming flowers, each petal more detailed than the last.",
            "sent5": "The costume was floridly extravagant, covered in sequins and feathers from head to toe."
        }
    ]
}