{
    "term": "flor",
    "meanings": [
        {
            "definition": "A flowering plant",
            "pos": "noun",
            "sent1": "The flor in the garden bloomed beautifully.",
            "sent2": "I love to see colorful flors in the park.",
            "sent3": "The flor seemed to dance in the gentle breeze.",
            "sent4": "Her smile was like a blooming flor, bright and joyful.",
            "sent5": "The flor's petals glistened in the morning sun."
        },
        {
            "definition": "A fine powder",
            "pos": "noun",
            "sent1": "She sprinkled a bit of flor on the cake.",
            "sent2": "The baker sifted the white flor into the mixing bowl.",
            "sent3": "The magician's trick involved making flor disappear.",
            "sent4": "The flour looked like a cloud of white flor in the air.",
            "sent5": "The flor settled softly on the kitchen counter."
        },
        {
            "definition": "A wine aged under a layer of yeast",
            "pos": "noun",
            "sent1": "The sommelier recommended a glass of flor for the meal.",
            "sent2": "The flor had a unique taste due to the aging process.",
            "sent3": "The flor added a special flavor to the dish.",
            "sent4": "The aroma of the flor filled the room with a rich scent.",
            "sent5": "The flor's golden color hinted at its delicious taste."
        },
        {
            "definition": "A decorative design or pattern",
            "pos": "noun",
            "sent1": "The vase was adorned with a beautiful flor.",
            "sent2": "The curtains had a lovely flor embroidered on them.",
            "sent3": "The flor on the rug added a touch of elegance to the room.",
            "sent4": "Her dress was decorated with a delicate flor pattern.",
            "sent5": "The flor on the wallpaper brought life to the room."
        },
        {
            "definition": "The upper surface of a horizontal architectural member",
            "pos": "noun",
            "sent1": "The flor of the beam was intricately carved.",
            "sent2": "The flor of the archway was supported by sturdy columns.",
            "sent3": "The flor of the balcony overlooked the bustling street.",
            "sent4": "The flor of the ceiling was painted with intricate designs.",
            "sent5": "The flor of the doorframe was adorned with ornate carvings."
        }
    ]
}