{
    "term": "fluconazoles",
    "meanings": [
        {
            "definition": "Fluconazoles: a type of antifungal medication",
            "pos": "noun",
            "sent1": "The doctor prescribed fluconazoles to treat the fungal infection.",
            "sent2": "She bought fluconazoles from the pharmacy to cure her skin infection.",
            "sent3": "The fluconazoles danced their way into the body to fight off the pesky fungi.",
            "sent4": "The fluconazoles acted like tiny warriors battling against the invading fungi.",
            "sent5": "The bottle of fluconazoles glowed with the promise of healing from the fungal infection."
        },
        {
            "definition": "Fluconazoles: used to treat fungal infections in the body",
            "pos": "noun",
            "sent1": "After taking fluconazoles, the fungal infection started to clear up.",
            "sent2": "Doctors often recommend fluconazoles for treating internal fungal infections.",
            "sent3": "The fluconazoles threw a party in the body, kicking out the unwanted fungal guests.",
            "sent4": "Her bloodstream became a battleground where fluconazoles fought against the fungal invaders.",
            "sent5": "The fungal infection retreated in fear as the fluconazoles marched in to save the day."
        },
        {
            "definition": "Fluconazoles: can be taken orally or intravenously",
            "pos": "noun",
            "sent1": "The nurse administered fluconazoles intravenously to speed up the treatment.",
            "sent2": "Patients have the option to take fluconazoles orally or through an IV.",
            "sent3": "The fluconazoles in the IV bag whispered words of encouragement as they entered the body.",
            "sent4": "The oral fluconazoles were like tiny soldiers marching down the throat to battle the fungi.",
            "sent5": "The choice between oral and intravenous fluconazoles gave patients flexibility in their treatment options."
        }
    ]
}