{
    "term": "fluorescences",
    "meanings": [
        {
            "definition": "The emission of light by a substance that has absorbed light or other electromagnetic radiation.",
            "pos": "noun",
            "sent1": "The room was filled with colorful fluorescences from the glowing stars on the ceiling.",
            "sent2": "The scientist studied the fluorescences emitted by the glowing algae under the microscope.",
            "sent3": "The party decorations created a magical atmosphere with their fluorescences shining brightly.",
            "sent4": "Her smile lit up the room like a beautiful fluorescence in the darkness.",
            "sent5": "The fireflies danced in the night, their fluorescences creating a mesmerizing display."
        },
        {
            "definition": "The property of emitting light while exposed to light.",
            "pos": "noun",
            "sent1": "The special paint had the amazing property of fluorescences when placed under UV light.",
            "sent2": "The safety vest had fluorescences that made the wearer visible in the dark.",
            "sent3": "The glow-in-the-dark stickers had fluorescences that made them stand out in the night.",
            "sent4": "The cat's eyes had a mysterious fluorescence when caught in the beam of the flashlight.",
            "sent5": "The watch had a unique fluorescence that made it easy to read in the dark."
        },
        {
            "definition": "The process of producing light by the absorption of electromagnetic radiation.",
            "pos": "noun",
            "sent1": "The laboratory experiment demonstrated the process of fluorescences in action.",
            "sent2": "The artist used special pigments that exhibited fluorescences when exposed to UV light.",
            "sent3": "The superhero's suit had a secret power of fluorescences that activated in the presence of danger.",
            "sent4": "The city skyline at night had a surreal quality, as if painted with the fluorescences of dreams.",
            "sent5": "The forest at dusk seemed to come alive with the fluorescences of hidden creatures."
        }
    ]
}