{
    "term": "flushed",
    "meanings": [
        {
            "definition": "Having a red or rosy color in the face",
            "pos": "adjective",
            "sent1": "After running around outside, her cheeks were flushed from the sun.",
            "sent2": "The little girl's face flushed with joy when she saw her birthday cake.",
            "sent3": "The flushed cheeks of the baby made everyone smile.",
            "sent4": "The sunset painted the sky with flushed hues of pink and orange.",
            "sent5": "The rose bush had flushed blossoms in full bloom."
        },
        {
            "definition": "To clean out by a rapid flow of water",
            "pos": "verb",
            "sent1": "He flushed the dirt out of the pipe with a strong stream of water.",
            "sent2": "The plumber flushed the clogged drain to remove the blockage.",
            "sent3": "The toilet flushed away the paper with a loud gurgle.",
            "sent4": "The heavy rain flushed the debris down the street.",
            "sent5": "The river flushed out the rocks and pebbles along its path."
        },
        {
            "definition": "To be in abundance or plentiful",
            "pos": "verb",
            "sent1": "During harvest season, the fields were flushed with ripe fruits.",
            "sent2": "The market was flushed with fresh vegetables from the farm.",
            "sent3": "Her garden was flushed with colorful flowers in full bloom.",
            "sent4": "The buffet table was flushed with a variety of delicious dishes.",
            "sent5": "The forest was flushed with chirping birds and rustling leaves."
        },
        {
            "definition": "To become suddenly red in the face due to embarrassment or excitement",
            "pos": "verb",
            "sent1": "She flushed with embarrassment when she realized her mistake.",
            "sent2": "His face flushed with excitement as he opened the gift.",
            "sent3": "The comedian's joke made the audience flush with laughter.",
            "sent4": "The unexpected compliment made her heart flush with happiness.",
            "sent5": "The surprise announcement caused the room to flush with anticipation."
        }
    ]
}