{
    "term": "flushes",
    "meanings": [
        {
            "definition": "To cause to flow or flood",
            "pos": "verb",
            "sent1": "She flushes the toilet after using it.",
            "sent2": "The heavy rain flushes the streets with water.",
            "sent3": "The burst pipe flushes the basement with water, making it a swimming pool.",
            "sent4": "The waterfall flushes down the rocks with great force.",
            "sent5": "The dam opening suddenly flushes the valley with water, creating a flood."
        },
        {
            "definition": "To become red in the face from embarrassment or anger",
            "pos": "verb",
            "sent1": "He flushes with embarrassment when he realizes his mistake.",
            "sent2": "She flushes every time someone compliments her.",
            "sent3": "The little girl flushes when caught eating cookies before dinner.",
            "sent4": "His face flushes like a ripe tomato when he gets angry.",
            "sent5": "The shy boy flushes whenever he has to speak in front of the class."
        },
        {
            "definition": "A sudden rush of emotion or excitement",
            "pos": "noun",
            "sent1": "The unexpected win brought a flush of joy to her face.",
            "sent2": "A flush of excitement spread through the crowd as the band took the stage.",
            "sent3": "The surprise party caused a flush of happiness in the birthday girl.",
            "sent4": "A flush of fear washed over him as he heard a loud noise in the dark.",
            "sent5": "The news of the promotion brought a flush of pride to his cheeks."
        },
        {
            "definition": "To clean out by a rapid flow of water",
            "pos": "verb",
            "sent1": "She flushes the dirt out of the wound with water.",
            "sent2": "The plumber flushes the clogged pipe to clear it.",
            "sent3": "The heavy rain flushes the debris off the streets.",
            "sent4": "The strong current flushes the pollutants out of the river.",
            "sent5": "The irrigation system flushes the soil with water to remove salt buildup."
        }
    ]
}