{
    "term": "flush",
    "meanings": [
        {
            "definition": "To clean or rinse out by a sudden flow of water.",
            "pos": "verb",
            "sent1": "I need to flush the toilet after using it.",
            "sent2": "She likes to flush the sink with hot water to remove any dirt.",
            "sent3": "The plumber had to flush out the clogged drain with a strong jet of water.",
            "sent4": "After the heavy rain, the river flushed out all the debris from the bridge.",
            "sent5": "The heavy rain helped to flush away the dirt from the streets."
        },
        {
            "definition": "To be in abundance or plentiful.",
            "pos": "verb",
            "sent1": "During spring, the garden is flush with colorful flowers.",
            "sent2": "The market is flush with fresh fruits and vegetables in the summer.",
            "sent3": "The treasure hunters were excited to find a cave flush with gold coins.",
            "sent4": "The company became flush with cash after a successful product launch.",
            "sent5": "The forest was flush with wildlife during the mating season."
        },
        {
            "definition": "A sudden rush of emotion or feeling.",
            "pos": "noun",
            "sent1": "She felt a flush of excitement when she won the race.",
            "sent2": "A flush of embarrassment spread across his face when he realized his mistake.",
            "sent3": "The comedian's joke caused a flush of laughter among the audience.",
            "sent4": "A flush of anger overcame him when he heard the news.",
            "sent5": "The unexpected compliment brought a flush of happiness to her cheeks."
        },
        {
            "definition": "A hand in poker consisting of all cards of the same suit.",
            "pos": "noun",
            "sent1": "He won the round with a flush of hearts.",
            "sent2": "She was confident with her flush of diamonds in the poker game.",
            "sent3": "The player's lucky streak continued with a flush of spades.",
            "sent4": "His heart skipped a beat when he realized he had a flush in his hand.",
            "sent5": "The flush of clubs in his hand gave him a winning smile."
        }
    ]
}