{
    "term": "flutterboards",
    "meanings": [
        {
            "definition": "A flat board used in swimming lessons to help beginners float and kick.",
            "pos": "noun",
            "sent1": "During swim class, the instructor handed out flutterboards to the new students.",
            "sent2": "The children held onto their flutterboards tightly as they practiced kicking in the water.",
            "sent3": "The playful dolphin tried to balance a flutterboard on its nose for fun.",
            "sent4": "Her confidence soared as she held the flutterboard steady and glided through the water effortlessly.",
            "sent5": "The bright yellow flutterboard bobbed up and down in the pool, catching everyone's attention."
        },
        {
            "definition": "A type of swimming equipment used for water exercises.",
            "pos": "noun",
            "sent1": "The swim coach recommended using flutterboards to improve arm strength.",
            "sent2": "The athletes grabbed their flutterboards and headed to the deep end of the pool for training.",
            "sent3": "The synchronized swimmers incorporated flutterboards into their routine for added challenge.",
            "sent4": "The flutterboard became her trusted companion during her daily water workouts.",
            "sent5": "The pool was filled with colorful flutterboards as the swimmers practiced their drills."
        },
        {
            "definition": "A tool used in aquatic therapy for rehabilitation purposes.",
            "pos": "noun",
            "sent1": "The physical therapist introduced the patient to flutterboards to aid in recovery.",
            "sent2": "The elderly patients found comfort in using flutterboards during their water therapy sessions.",
            "sent3": "The mischievous otter tried to steal the flutterboard from the therapist's bag.",
            "sent4": "The flutterboard symbolized progress and hope for those undergoing aquatic rehabilitation.",
            "sent5": "The soothing water embraced her as she held onto the flutterboard, feeling supported and safe."
        }
    ]
}