{
    "term": "flysches",
    "meanings": [
        {
            "definition": "A type of sedimentary rock consisting of alternating layers of sandstone and shale.",
            "pos": "noun",
            "sent1": "The geologist found interesting flysches during the excavation.",
            "sent2": "The flysches in the quarry showed distinct layers of sandstone and shale.",
            "sent3": "The flysches in the rock formation looked like a delicious sandwich with layers of sandstone and shale.",
            "sent4": "The flysches resembled a colorful book with pages of sandstone and shale.",
            "sent5": "The flysches stood out in the landscape like a striped carpet of sandstone and shale."
        },
        {
            "definition": "Plural form of flysch, a type of sedimentary rock formation.",
            "pos": "noun",
            "sent1": "The museum displayed various flysches from different regions.",
            "sent2": "The flysches in the exhibit fascinated the visitors with their unique patterns.",
            "sent3": "The collection of flysches in the museum made the geologist's heart skip a beat.",
            "sent4": "The flysches in the display case sparkled like precious gems.",
            "sent5": "The flysches on the shelf looked like colorful puzzle pieces waiting to be put together."
        },
        {
            "definition": "The study or analysis of flysches in geology.",
            "pos": "noun",
            "sent1": "Her passion for flysches led her to pursue a career in geology.",
            "sent2": "The university offered a course specifically on the study of flysches.",
            "sent3": "The geologist's love for flysches was evident in every conversation she had.",
            "sent4": "The research team delved deep into the mysteries of flysches in their latest project.",
            "sent5": "The conference on flysches attracted experts from around the world to share their findings."
        }
    ]
}