{
    "term": "flywheels",
    "meanings": [
        {
            "definition": "A heavy wheel that stores rotational energy in a machine.",
            "pos": "noun",
            "sent1": "The flywheels in the engine help keep it running smoothly.",
            "sent2": "The mechanic inspected the flywheels to ensure they were functioning properly.",
            "sent3": "When the flywheels started spinning out of control, chaos ensued in the workshop.",
            "sent4": "Her mind worked like flywheels, storing energy for bursts of creativity.",
            "sent5": "The flywheels hummed with stored power, ready to be unleashed at any moment."
        },
        {
            "definition": "A rotating disk used as a momentum storage device in a vehicle.",
            "pos": "noun",
            "sent1": "The flywheels on the car helped maintain its speed on the highway.",
            "sent2": "The race car driver relied on the flywheels to navigate sharp turns.",
            "sent3": "The flywheels in the truck seemed to have a mind of their own, spinning faster than expected.",
            "sent4": "Time spun like flywheels, storing memories that could be revisited at any moment.",
            "sent5": "The flywheels of the bicycle whirred as the rider pedaled uphill."
        },
        {
            "definition": "A mechanical device that regulates the speed of an engine.",
            "pos": "noun",
            "sent1": "The flywheels in the motorbike ensured a steady pace during the race.",
            "sent2": "The engineer adjusted the flywheels to optimize the engine's performance.",
            "sent3": "The flywheels in the car seemed to have a playful spirit, speeding up and slowing down unexpectedly.",
            "sent4": "Her heart raced like flywheels, trying to keep up with the excitement of the moment.",
            "sent5": "The flywheels of the old tractor clicked into place, setting the engine in motion."
        }
    ]
}