{
    "term": "foams",
    "meanings": [
        {
            "definition": "A mass of small bubbles formed on or in liquid, typically by agitation or fermentation.",
            "pos": "noun",
            "sent1": "The foams on top of the hot chocolate looked so fluffy.",
            "sent2": "The foams from the ocean waves sparkled in the sunlight.",
            "sent3": "The foams in the bathtub made it seem like a bubbly party.",
            "sent4": "The foams on the cappuccino resembled a cloud floating on top.",
            "sent5": "The foams in the soda were so thick you could almost scoop them up."
        },
        {
            "definition": "A frothy mass of small bubbles formed on or in liquid.",
            "pos": "noun",
            "sent1": "The gentle stream was filled with foams that glistened in the sun.",
            "sent2": "The foams on the beer made it look extra refreshing.",
            "sent3": "The foams in the fountain danced playfully in the breeze.",
            "sent4": "The foams on the milkshake were like a sweet crown on top.",
            "sent5": "The foams on the bubble bath made it feel like a luxurious spa."
        },
        {
            "definition": "To produce or form foam.",
            "pos": "verb",
            "sent1": "She carefully foams the soap in her hands before washing.",
            "sent2": "The machine foams the detergent to clean the dishes effectively.",
            "sent3": "The chef foams the cream to create a delightful dessert topping.",
            "sent4": "The river foams as it rushes over the rocks downstream.",
            "sent5": "The shampoo foams up nicely, leaving the hair feeling clean and fresh."
        },
        {
            "definition": "To become covered with foam.",
            "pos": "verb",
            "sent1": "The glass slowly foams up as the beer is poured into it.",
            "sent2": "The ocean foams at the edges where the waves crash against the shore.",
            "sent3": "The dog's mouth foams as it eagerly waits for its treat.",
            "sent4": "The river foams over the rocks, creating a beautiful white cascade.",
            "sent5": "The washing machine foams up with soap as it begins the cleaning cycle."
        }
    ]
}