{
    "term": "fold",
    "meanings": [
        {
            "definition": "To bend or crease something",
            "pos": "verb",
            "sent1": "She carefully folded the paper in half.",
            "sent2": "He likes to fold his clothes neatly before putting them away.",
            "sent3": "The cat tried to fold itself into a tiny box, but it was too big.",
            "sent4": "The mountains seemed to fold into each other in the distance.",
            "sent5": "The old book had a worn fold on every page."
        },
        {
            "definition": "A crease or bend in something",
            "pos": "noun",
            "sent1": "There was a sharp fold in the middle of the map.",
            "sent2": "She ironed out the fold in the tablecloth.",
            "sent3": "The origami artist created a beautiful swan with a single fold.",
            "sent4": "The old letter had a nostalgic fold from being carried in a pocket.",
            "sent5": "The paper airplane had a perfect fold for maximum flight."
        },
        {
            "definition": "To bring together or intertwine",
            "pos": "verb",
            "sent1": "The baker had to fold the dough to mix the ingredients.",
            "sent2": "They decided to fold their businesses together for better efficiency.",
            "sent3": "The vines seemed to fold around each other in a natural dance.",
            "sent4": "Her fingers deftly folded the fabric to create intricate patterns.",
            "sent5": "The two rivers eventually fold into one mighty stream."
        },
        {
            "definition": "A group of people or animals",
            "pos": "noun",
            "sent1": "The shepherd counted the sheep in the fold before nightfall.",
            "sent2": "The fold of students gathered around the teacher for the lesson.",
            "sent3": "The fold of birds flew together in perfect harmony.",
            "sent4": "The fold of trees provided a cool shade on a hot day.",
            "sent5": "The fold of friends enjoyed a picnic in the park."
        },
        {
            "definition": "To include or incorporate something into a larger whole",
            "pos": "verb",
            "sent1": "She wanted to fold more vegetables into the salad for extra flavor.",
            "sent2": "The artist decided to fold elements of nature into her painting.",
            "sent3": "He tried to fold a joke into the serious conversation, but it fell flat.",
            "sent4": "The architect planned to fold sustainable features into the design of the building.",
            "sent5": "The chef knew how to fold spices into the dish for a burst of taste."
        }
    ]
}