{
    "term": "foldups",
    "meanings": [
        {
            "definition": "Foldups: a type of portable furniture that can be easily folded for storage or transport.",
            "pos": "noun",
            "sent1": "I bought some foldups for our picnic, so we can sit comfortably.",
            "sent2": "The foldups were perfect for the small apartment as they could be stored away when not in use.",
            "sent3": "The foldups decided to take a break and folded themselves up for a nap.",
            "sent4": "Her creativity was like a set of foldups, always ready to be unfolded into something new.",
            "sent5": "The bright red foldups stood out among the other furniture in the room."
        },
        {
            "definition": "Foldups: the act of folding something up.",
            "pos": "noun",
            "sent1": "His quick foldups of the paper airplane impressed the class.",
            "sent2": "She mastered the art of foldups, making origami animals with ease.",
            "sent3": "The magician's final trick involved a dramatic foldups of the giant cloth.",
            "sent4": "The chef's precise foldups of the pastry created a beautiful dessert presentation.",
            "sent5": "The sound of foldups echoed through the room as everyone prepared for departure."
        },
        {
            "definition": "Foldups: a type of exercise that involves folding the body in half.",
            "pos": "noun",
            "sent1": "She felt the burn in her abs after doing multiple foldups at the gym.",
            "sent2": "The yoga instructor demonstrated the proper form for foldups to the beginners.",
            "sent3": "The foldups competition at the gym was intense, with participants showing off their flexibility.",
            "sent4": "His dedication to daily foldups paid off as he noticed an improvement in his posture.",
            "sent5": "The rhythmic flow of foldups and stretches helped her relax after a long day."
        }
    ]
}