{
    "term": "foliate",
    "meanings": [
        {
            "definition": "To decorate with leaves or leaf-like motifs.",
            "pos": "verb",
            "sent1": "She decided to foliate the walls of her room with beautiful leaf patterns.",
            "sent2": "The artist used a stencil to foliate the border of the painting with intricate leaf designs.",
            "sent3": "The party planner chose to foliate the party invitations with playful leaf illustrations.",
            "sent4": "Her creativity knew no bounds as she managed to foliate even the smallest details of the room.",
            "sent5": "The garden was transformed into a magical wonderland as she began to foliate every corner with lush greenery."
        },
        {
            "definition": "Having leaves or leaf-like projections.",
            "pos": "adjective",
            "sent1": "The foliate tree provided a cool shade on hot summer days.",
            "sent2": "The ancient manuscript was adorned with intricate foliate patterns along the margins.",
            "sent3": "The foliate crown on the statue made it look regal and majestic.",
            "sent4": "The foliate design on the antique mirror added a touch of elegance to the room.",
            "sent5": "The foliate border on the dress gave it a natural and graceful appearance."
        },
        {
            "definition": "To put forth leaves.",
            "pos": "verb",
            "sent1": "In spring, the trees begin to foliate, covering the branches with fresh green leaves.",
            "sent2": "The plant seemed to foliate overnight, surprising the gardener with its rapid growth.",
            "sent3": "The gardeners eagerly awaited the moment when the bare branches would foliate once again.",
            "sent4": "As the season changed, the trees started to foliate, signaling the arrival of summer.",
            "sent5": "The barren landscape slowly transformed as the trees began to foliate, bringing life back to the surroundings."
        }
    ]
}