{
    "term": "follis",
    "meanings": [
        {
            "definition": "A bag made of leather or other material, typically carried by soldiers to hold their personal belongings.",
            "pos": "noun",
            "sent1": "The soldier carried his important items in a follis during the long march.",
            "sent2": "She packed her clothes neatly in the follis before heading out.",
            "sent3": "The follis looked like a trusty companion, always by the soldier's side.",
            "sent4": "The follis was a loyal companion, holding onto the soldier's belongings with care.",
            "sent5": "The worn-out follis told stories of battles and travels through its scars and patches."
        },
        {
            "definition": "A round object used in ancient Rome as a ball in games.",
            "pos": "noun",
            "sent1": "The children played with a colorful follis in the courtyard.",
            "sent2": "The follis bounced off the walls as the players tried to catch it.",
            "sent3": "The follis rolled away, making the children chase after it with laughter.",
            "sent4": "The follis flew through the air like a playful bird, bringing joy to all.",
            "sent5": "The shiny follis gleamed under the sun, inviting everyone to join the game."
        },
        {
            "definition": "A term used in botany to refer to a type of fruit with a thin membrane surrounding the seeds.",
            "pos": "noun",
            "sent1": "The botanist studied the unique structure of the follis in the lab.",
            "sent2": "The ripe follis burst open to reveal the tiny seeds inside.",
            "sent3": "The follis fruit seemed to be wearing a delicate veil around its seeds.",
            "sent4": "The follis fruit's membrane protected the seeds like a guardian shield.",
            "sent5": "The fragrant aroma of the follis fruit filled the room, enticing all who entered."
        }
    ]
}