{
    "term": "foolishness",
    "meanings": [
        {
            "definition": "Lack of good sense or judgment.",
            "pos": "noun",
            "sent1": "His foolishness in spending all his money on unnecessary things led to financial troubles.",
            "sent2": "She realized the foolishness of trying to fix the broken vase with tape.",
            "sent3": "The foolishness of wearing a winter coat in the summer made everyone laugh.",
            "sent4": "The ship captain's foolishness in ignoring the storm warnings led to disaster.",
            "sent5": "The teacher's patience was tested by the students' constant foolishness in class."
        },
        {
            "definition": "A foolish act or idea.",
            "pos": "noun",
            "sent1": "The prank they played on their friend was a moment of foolishness that they regretted later.",
            "sent2": "Jumping off the roof without checking for a safe landing spot was an example of sheer foolishness.",
            "sent3": "The foolishness of trying to fit a large box into a small car was evident to everyone watching.",
            "sent4": "His plan to become a millionaire overnight was dismissed as mere foolishness by his friends.",
            "sent5": "The foolishness of believing in magic beans was exposed when the plant failed to grow."
        },
        {
            "definition": "The state or quality of being foolish.",
            "pos": "noun",
            "sent1": "Her constant foolishness in making decisions without thinking things through worried her family.",
            "sent2": "The foolishness of his actions was evident in the disappointed looks of his friends.",
            "sent3": "The foolishness of wearing mismatched socks to an important meeting made everyone chuckle.",
            "sent4": "The politician's foolishness in making false promises was soon discovered by the public.",
            "sent5": "The foolishness of believing in superstitions was evident in her refusal to walk under ladders."
        }
    ]
}