{
    "term": "footstock",
    "meanings": [
        {
            "definition": "The part of a stocking that covers the foot.",
            "pos": "noun",
            "sent1": "She carefully darned the hole in the footstock of her favorite stocking.",
            "sent2": "The footstock of the sock was worn out from walking long distances.",
            "sent3": "As she pulled on the footstock, it got stuck on her toe, making her hop around comically.",
            "sent4": "The footstock of the stocking was like a cozy little house for her toes.",
            "sent5": "The soft fabric of the footstock hugged her foot snugly."
        },
        {
            "definition": "A stock or handle at the end of a gun or rifle that rests against the shoulder.",
            "pos": "noun",
            "sent1": "The soldier adjusted the footstock of his rifle before taking aim.",
            "sent2": "The footstock of the shotgun was made of sturdy wood.",
            "sent3": "He jokingly pretended the footstock of the rifle was a guitar, strumming it in the air.",
            "sent4": "The footstock of the gun felt like an extension of his arm, steady and reliable.",
            "sent5": "The weight of the footstock against his shoulder gave him a sense of control."
        },
        {
            "definition": "A wooden block used to support the foot of a person being executed by hanging.",
            "pos": "noun",
            "sent1": "The executioner placed the footstock beneath the criminal's feet.",
            "sent2": "The condemned man stood on the footstock, resigned to his fate.",
            "sent3": "The footstock wobbled under the weight of the prisoner, causing a moment of tension.",
            "sent4": "To the prisoner, the footstock symbolized the end of his journey on this earth.",
            "sent5": "The creaking of the footstock echoed through the silent square, sending shivers down the spectators' spines."
        }
    ]
}