{
    "term": "forbearances",
    "meanings": [
        {
            "definition": "Patient self-control; restraint and tolerance.",
            "pos": "noun",
            "sent1": "Her forbearances in dealing with difficult customers always impressed her boss.",
            "sent2": "The teacher showed great forbearances when the students were being noisy.",
            "sent3": "Despite the tempting offer, his forbearances kept him from losing his temper.",
            "sent4": "Her forbearances were like a shield, protecting her from unnecessary conflicts.",
            "sent5": "The monk's forbearances were a source of inspiration for all who knew him."
        },
        {
            "definition": "The action of refraining from exercising a legal right, especially enforcing the payment of a debt.",
            "pos": "noun",
            "sent1": "The company's forbearances in collecting debts helped maintain good customer relations.",
            "sent2": "The court acknowledged the creditor's forbearances in not immediately seizing the property.",
            "sent3": "The forbearances of the bank prevented unnecessary legal battles over the debt.",
            "sent4": "His forbearances in not pursuing legal action saved him time and stress.",
            "sent5": "The lawyer's forbearances were strategic, aiming for a peaceful resolution."
        },
        {
            "definition": "The act of refraining from something.",
            "pos": "noun",
            "sent1": "Her forbearances from eating sweets were evident in her improved health.",
            "sent2": "The doctor advised strict forbearances from strenuous activities after the surgery.",
            "sent3": "His forbearances from gossiping made him a trustworthy friend.",
            "sent4": "The athlete's forbearances from junk food contributed to his performance on the field.",
            "sent5": "The student's forbearances from distractions led to better focus on studies."
        }
    ]
}