{
    "term": "fordoes",
    "meanings": [
        {
            "definition": "To ruin or destroy",
            "pos": "verb",
            "sent1": "The storm fordoes the fragile sandcastle on the beach.",
            "sent2": "The fire fordoes the old wooden house in minutes.",
            "sent3": "The mischievous puppy fordoes the neat pile of laundry.",
            "sent4": "The virus fordoes the computer system, leaving it in chaos.",
            "sent5": "The flood fordoes the entire town, washing away homes and roads."
        },
        {
            "definition": "To exhaust or wear out",
            "pos": "verb",
            "sent1": "Running a marathon fordoes the runner's energy completely.",
            "sent2": "Studying for hours fordoes the student before the big exam.",
            "sent3": "The long hike fordoes the tired hiker, making them collapse at the end.",
            "sent4": "The constant overtime fordoes the employee, leaving them drained.",
            "sent5": "The intense workout fordoes the athlete, pushing them to their limits."
        },
        {
            "definition": "To undo or reverse",
            "pos": "verb",
            "sent1": "She quickly fordoes her mistake by erasing the wrong answer.",
            "sent2": "The magician fordoes the trick, making the coin reappear.",
            "sent3": "The chef fordoes the burnt dish by starting over from scratch.",
            "sent4": "The mechanic fordoes the error in the car's engine, fixing it in no time.",
            "sent5": "The artist fordoes the wrong brushstroke, correcting the painting flawlessly."
        },
        {
            "definition": "To cause harm or suffering",
            "pos": "verb",
            "sent1": "The harsh words fordoes the child's confidence.",
            "sent2": "The illness fordoes the patient's strength, making them weak.",
            "sent3": "The betrayal fordoes the friendship, leaving both parties hurt.",
            "sent4": "The accident fordoes the driver's car, leading to expensive repairs.",
            "sent5": "The war fordoes the country, bringing destruction and loss."
        }
    ]
}