{
    "term": "foreign",
    "meanings": [
        {
            "definition": "Of, from, in, or characteristic of a country or language other than one's own.",
            "pos": "adjective",
            "sent1": "The restaurant served delicious foreign dishes from Italy.",
            "sent2": "She struggled to understand the foreign language spoken by the tourists.",
            "sent3": "Trying to cook a foreign recipe without the right ingredients was a disaster.",
            "sent4": "The foreign music filled the room with a sense of mystery and excitement.",
            "sent5": "The foreign landscape was unlike anything she had ever seen before."
        },
        {
            "definition": "Belonging or connected to a country or language other than one's own.",
            "pos": "adjective",
            "sent1": "The museum displayed a collection of foreign artifacts from ancient civilizations.",
            "sent2": "He found comfort in listening to foreign music that reminded him of home.",
            "sent3": "Wearing a foreign hat at the party made him stand out in a funny way.",
            "sent4": "Her mind was a treasure trove of foreign memories waiting to be explored.",
            "sent5": "The foreign flag fluttered proudly in the wind, representing unity and diversity."
        },
        {
            "definition": "Not familiar or belonging to the place where you are or the person you are with.",
            "pos": "adjective",
            "sent1": "The new student felt foreign in the bustling hallways of the school.",
            "sent2": "The old book had a foreign smell that transported her back in time.",
            "sent3": "Wearing mismatched socks made her feel foreign among the fashion-conscious crowd.",
            "sent4": "The idea of change seemed foreign to her, rooted in familiarity.",
            "sent5": "The foreign concept of time travel fascinated her imagination beyond belief."
        }
    ]
}