{
    "term": "foreclosed",
    "meanings": [
        {
            "definition": "To take possession of a mortgaged property due to the borrower's failure to keep up with payments.",
            "pos": "verb",
            "sent1": "The bank foreclosed on the house when the owner couldn't pay the mortgage.",
            "sent2": "The bank had to foreclose on the property after the owner missed several payments.",
            "sent3": "The bank foreclosed on the house, turning it into a real estate bargain for someone else.",
            "sent4": "The bank's decision to foreclose on the property left the previous owner feeling defeated.",
            "sent5": "The image of the bank seizing the house in a foreclosure was a stark reminder of financial struggles."
        },
        {
            "definition": "To prevent someone from doing something by taking action in advance.",
            "pos": "verb",
            "sent1": "The security guard foreclosed any attempts to enter the restricted area.",
            "sent2": "The teacher had to foreclose any cheating during the exam.",
            "sent3": "The clever detective foreclosed the suspect's escape plan with a clever trap.",
            "sent4": "The quick intervention foreclosed any chance of the situation escalating further.",
            "sent5": "The timely warning foreclosed any potential dangers from arising."
        },
        {
            "definition": "To rule out or exclude a possibility.",
            "pos": "verb",
            "sent1": "The detective had to foreclose the theory of the suspect's innocence.",
            "sent2": "The evidence presented in court foreclosed any doubts about the defendant's guilt.",
            "sent3": "The scientist had to foreclose the idea of life on Mars due to lack of evidence.",
            "sent4": "The logical reasoning foreclosed any other possible explanations for the phenomenon.",
            "sent5": "The conclusive results foreclosed any room for uncertainty in the experiment."
        }
    ]
}