{
    "term": "foreignisms",
    "meanings": [
        {
            "definition": "Words or phrases borrowed from a foreign language.",
            "pos": "noun",
            "sent1": "She used many foreignisms in her speech, making it sound exotic.",
            "sent2": "The book was full of foreignisms, adding an international flair to the story.",
            "sent3": "His essay was like a puzzle, with foreignisms scattered throughout.",
            "sent4": "The city's culture was a melting pot of foreignisms, creating a unique blend.",
            "sent5": "The teacher encouraged students to incorporate foreignisms in their writing to expand their vocabulary."
        },
        {
            "definition": "The use of foreign words or expressions in a language.",
            "pos": "noun",
            "sent1": "The poet's work was known for its rich foreignisms, drawing inspiration from various languages.",
            "sent2": "The translation included many foreignisms to preserve the original meaning of the text.",
            "sent3": "The play was a hilarious mix of local slang and foreignisms, causing laughter in the audience.",
            "sent4": "Her speech was a tapestry of foreignisms, weaving together different linguistic influences.",
            "sent5": "The restaurant menu featured exotic foreignisms that intrigued customers."
        },
        {
            "definition": "The presence of foreign influences or characteristics.",
            "pos": "noun",
            "sent1": "The architecture of the building showed clear foreignisms, reflecting global design trends.",
            "sent2": "The painting displayed a fusion of styles, incorporating foreignisms seamlessly.",
            "sent3": "His fashion sense was a blend of local and foreignisms, creating a unique look.",
            "sent4": "The music festival celebrated diversity with a lineup full of foreignisms.",
            "sent5": "The garden was a beautiful mix of local flora and foreignisms, creating a stunning landscape."
        }
    ]
}