{
    "term": "forensically",
    "meanings": [
        {
            "definition": "In a manner relating to or used in forensic science.",
            "pos": "adverb",
            "sent1": "The scientist examined the evidence forensically to solve the case.",
            "sent2": "The detective analyzed the fingerprints forensically to catch the criminal.",
            "sent3": "The forensic team worked forensically to uncover the truth behind the mysterious disappearance.",
            "sent4": "She looked at the data forensically, like a detective solving a puzzle.",
            "sent5": "The forensic analysis was done forensically, leaving no detail unchecked."
        },
        {
            "definition": "In a manner relating to or used in the investigation of crimes.",
            "pos": "adverb",
            "sent1": "The police officer searched the crime scene forensically for any clues.",
            "sent2": "The investigator approached the case forensically, gathering evidence meticulously.",
            "sent3": "The suspect's alibi was examined forensically, revealing inconsistencies.",
            "sent4": "She delved into the case forensically, like a detective in a TV show.",
            "sent5": "The forensic expert analyzed the blood samples forensically, leading to a breakthrough in the investigation."
        },
        {
            "definition": "In a manner relating to or used in legal proceedings.",
            "pos": "adverb",
            "sent1": "The lawyer presented the evidence forensically during the trial.",
            "sent2": "The judge reviewed the documents forensically to ensure accuracy.",
            "sent3": "The courtroom drama played out forensically, with each detail scrutinized.",
            "sent4": "She approached the case forensically, like a legal expert building a strong argument.",
            "sent5": "The forensic accountant examined the financial records forensically, uncovering discrepancies."
        }
    ]
}