{
    "term": "formulary",
    "meanings": [
        {
            "definition": "A list of prescription drugs covered by a particular health insurance plan.",
            "pos": "noun",
            "sent1": "The doctor checked the formulary to see which medications were approved by the insurance.",
            "sent2": "I need to consult the formulary to find out if my medication is covered.",
            "sent3": "The formulary seemed like a magical list of potions that could cure any illness.",
            "sent4": "Her formulary of remedies was as valuable as a treasure map in a land of sickness.",
            "sent5": "The formulary was like a secret code that unlocked access to necessary treatments."
        },
        {
            "definition": "A book or document containing a collection of formulas or recipes.",
            "pos": "noun",
            "sent1": "Grandma's old formulary held all her cherished recipes for delicious cookies.",
            "sent2": "The chef's formulary was filled with culinary secrets passed down through generations.",
            "sent3": "The formulary looked like a spellbook, with recipes for enchanting dishes.",
            "sent4": "His formulary of mixtures was a treasure trove of flavors waiting to be explored.",
            "sent5": "The formulary was a culinary bible, guiding cooks to create masterpieces in the kitchen."
        },
        {
            "definition": "Of or relating to a formulary.",
            "pos": "adjective",
            "sent1": "The formulary guidelines ensured that all medications were properly listed.",
            "sent2": "She followed the formulary instructions to create the perfect potion.",
            "sent3": "His formulary approach to cooking involved precise measurements and techniques.",
            "sent4": "The formulary rules were like a roadmap for navigating the world of prescriptions.",
            "sent5": "The formulary standards set a high bar for quality and accuracy in healthcare."
        }
    ]
}