{
    "term": "formed",
    "meanings": [
        {
            "definition": "To give shape or structure to something.",
            "pos": "verb",
            "sent1": "She formed a clay pot in art class.",
            "sent2": "The artist formed a beautiful sculpture out of marble.",
            "sent3": "The children formed a line to go to the playground.",
            "sent4": "His ideas formed the basis of the new project.",
            "sent5": "The baker formed the dough into perfect circles for the cookies."
        },
        {
            "definition": "To come into existence or be created.",
            "pos": "verb",
            "sent1": "A plan formed in her mind to solve the problem.",
            "sent2": "The stars formed in the vast expanse of space.",
            "sent3": "The friendship formed between the two classmates over time.",
            "sent4": "The idea formed like a storm brewing in his thoughts.",
            "sent5": "The story formed gradually in the writer's imagination."
        },
        {
            "definition": "To be made up of something.",
            "pos": "verb",
            "sent1": "The necklace was formed of shiny pearls.",
            "sent2": "The cake was formed from layers of sponge and cream.",
            "sent3": "The team was formed of players from different schools.",
            "sent4": "The planet was formed by swirling gases and dust.",
            "sent5": "The wall was formed of bricks stacked neatly on top of each other."
        },
        {
            "definition": "To take shape or develop.",
            "pos": "verb",
            "sent1": "The storm clouds formed in the sky, signaling rain.",
            "sent2": "The idea formed gradually as they discussed it further.",
            "sent3": "The plan formed perfectly after considering all options.",
            "sent4": "The friendship formed quickly between the two neighbors.",
            "sent5": "The flower garden formed beautifully with each bloom opening up."
        }
    ]
}