{
    "term": "formations",
    "meanings": [
        {
            "definition": "The action of forming or process of being formed.",
            "pos": "noun",
            "sent1": "The formations of the clay pots were carefully crafted by the skilled potter.",
            "sent2": "The geologist studied the rock formations to understand how they were created.",
            "sent3": "The formations of clouds in the sky looked like fluffy animals playing.",
            "sent4": "The formations of stars in the night sky sparkled like diamonds scattered on black velvet.",
            "sent5": "The formations of crystals in the cave glistened in the dim light, creating a magical atmosphere."
        },
        {
            "definition": "A particular arrangement or pattern of elements.",
            "pos": "noun",
            "sent1": "The dance formations of the performers on stage were mesmerizing.",
            "sent2": "The formations of books on the shelf were organized by genre.",
            "sent3": "The formations of colorful balloons at the party added a festive touch.",
            "sent4": "The formations of trees in the forest created a natural canopy overhead.",
            "sent5": "The formations of sand dunes in the desert shifted with the wind, constantly changing the landscape."
        },
        {
            "definition": "A group of people or things assembled in a particular way.",
            "pos": "noun",
            "sent1": "The military formations marched in perfect synchronization during the parade.",
            "sent2": "The formations of students in the classroom were arranged by seating chart.",
            "sent3": "The formations of toys on the shelves made the room look cluttered but cozy.",
            "sent4": "The formations of birds in the sky moved like a graceful ballet performance.",
            "sent5": "The formations of flowers in the garden bloomed in a riot of colors, attracting butterflies and bees."
        }
    ]
}