{
    "term": "formidable",
    "meanings": [
        {
            "definition": "Inspiring fear or respect through being impressively large, powerful, intense, or capable.",
            "pos": "adjective",
            "sent1": "The huge dragon was truly formidable, making everyone tremble in fear.",
            "sent2": "The fortress stood as a formidable obstacle, challenging any who dared approach.",
            "sent3": "The formidable storm cloud looked like a giant angry monster in the sky.",
            "sent4": "Her formidable intellect was a force to be reckoned with in the academic world.",
            "sent5": "The formidable mountain loomed over the landscape, casting a shadow of awe."
        },
        {
            "definition": "Difficult to defeat or overcome.",
            "pos": "adjective",
            "sent1": "The final boss in the game was truly formidable, requiring all skills to defeat.",
            "sent2": "The maze presented a formidable challenge, testing the problem-solving abilities of the participants.",
            "sent3": "Trying to untangle the Christmas lights proved to be a formidable task for him.",
            "sent4": "Overcoming his fear of heights was a formidable mountain he had to climb.",
            "sent5": "The formidable opponent in the chess match made every move a strategic battle."
        },
        {
            "definition": "Awe-inspiring in size or complexity.",
            "pos": "adjective",
            "sent1": "The ancient temple was a formidable structure, leaving visitors in awe of its grandeur.",
            "sent2": "The intricate puzzle posed a formidable challenge, requiring patience and skill to solve.",
            "sent3": "The toddler's attempt to build a Lego tower was a formidable task for his tiny hands.",
            "sent4": "The formidable galaxy stretched across the night sky, twinkling with distant stars.",
            "sent5": "The formidable waterfall cascaded down the cliff, creating a mesmerizing sight."
        }
    ]
}