{
    "term": "formula",
    "meanings": [
        {
            "definition": "A mathematical relationship or rule expressed in symbols.",
            "pos": "noun",
            "sent1": "In math class, we learned a new formula to calculate the area of a circle.",
            "sent2": "Scientists use complex formulas to describe the behavior of particles.",
            "sent3": "I tried to create a funny formula for solving my homework, but it didn't work.",
            "sent4": "Her success seemed like a secret formula that no one else could figure out.",
            "sent5": "The formula for finding the volume of a cube is easy to remember."
        },
        {
            "definition": "A method or procedure for achieving a desired result.",
            "pos": "noun",
            "sent1": "Following the recipe is the formula for baking a delicious cake.",
            "sent2": "The team came up with a winning formula for their project presentation.",
            "sent3": "His formula for getting good grades involved studying every day.",
            "sent4": "She discovered the perfect formula for organizing her closet efficiently.",
            "sent5": "The formula for success in this company is hard work and dedication."
        },
        {
            "definition": "A list of ingredients and their proportions for making a particular dish.",
            "pos": "noun",
            "sent1": "The chef shared the secret formula for his famous spaghetti sauce.",
            "sent2": "I followed the formula for making chocolate chip cookies, but they turned out too sweet.",
            "sent3": "My grandma's formula for the best apple pie includes a pinch of cinnamon.",
            "sent4": "The formula for the perfect margarita is a balance of tequila, lime, and triple sec.",
            "sent5": "She wrote down the formula for her special smoothie so she wouldn't forget."
        },
        {
            "definition": "A symbolic representation of a chemical compound.",
            "pos": "noun",
            "sent1": "The chemical formula for water is H2O.",
            "sent2": "Students need to memorize the formulas for different compounds in chemistry class.",
            "sent3": "I jokingly created a formula for a fictional element called 'laughium'.",
            "sent4": "The formula for salt is NaCl, which represents sodium chloride.",
            "sent5": "The formula for sugar, C12H22O11, looks complicated but is actually simple to understand."
        }
    ]
}