{
    "term": "fortune",
    "meanings": [
        {
            "definition": "Chance or luck as an arbitrary force affecting human affairs.",
            "pos": "noun",
            "sent1": "She believed her fortune changed when she found a lucky penny.",
            "sent2": "He hoped to find his fortune by playing the lottery.",
            "sent3": "It was quite a fortune that the rain stopped just before the outdoor wedding.",
            "sent4": "Her fortune seemed to turn when she met a kind stranger who helped her.",
            "sent5": "The fortune of winning the raffle made her day unforgettable."
        },
        {
            "definition": "A large amount of money or assets.",
            "pos": "noun",
            "sent1": "The pirate's treasure chest was filled with a vast fortune in gold coins.",
            "sent2": "She inherited a fortune from her wealthy relative.",
            "sent3": "Carrying a fortune in cash made him feel like a movie star.",
            "sent4": "His hard work paid off, and he amassed a small fortune over the years.",
            "sent5": "The fortune he made from selling his invention allowed him to retire early."
        },
        {
            "definition": "A person's condition or standing in life determined by material wealth.",
            "pos": "noun",
            "sent1": "Despite his humble beginnings, he rose to a position of fortune and influence.",
            "sent2": "In some societies, a person's fortune dictates their social status.",
            "sent3": "She flaunted her fortune with expensive cars and designer clothes.",
            "sent4": "The young entrepreneur's quick rise to fortune surprised many in the industry.",
            "sent5": "His fortune brought him power, but it also brought him many responsibilities."
        },
        {
            "definition": "Fate or destiny viewed as predetermined and inevitable.",
            "pos": "noun",
            "sent1": "She believed it was her fortune to meet her soulmate at the park.",
            "sent2": "Some people see their misfortunes as part of their predetermined fortune.",
            "sent3": "It was his fortune to be born into a loving and supportive family.",
            "sent4": "The fortune of being in the right place at the right time changed his life.",
            "sent5": "His fortune seemed to be written in the stars, guiding him towards success."
        }
    ]
}