{
    "term": "forted",
    "meanings": [
        {
            "definition": "To have built a fort or stronghold.",
            "pos": "verb",
            "sent1": "The settlers forted their village to protect it from attacks.",
            "sent2": "The soldiers forted the border to prevent enemy invasions.",
            "sent3": "The children forted their sandcastle with shells and sticks, making it impregnable.",
            "sent4": "She forted her heart against the pain of betrayal, building emotional walls.",
            "sent5": "The ancient civilization forted their city with high walls and watchtowers."
        },
        {
            "definition": "To have fortified or strengthened.",
            "pos": "verb",
            "sent1": "Eating healthy food forted his body against illnesses.",
            "sent2": "The blacksmith forted the metal with additional layers for extra durability.",
            "sent3": "The superhero forted his resolve with memories of his loved ones to face the villain.",
            "sent4": "Her determination forted her spirit like a shield against doubts and fears.",
            "sent5": "The team's unity forted their bond, making them unbeatable in the competition."
        },
        {
            "definition": "To have taken refuge in a fort.",
            "pos": "verb",
            "sent1": "During the storm, the villagers forted in the sturdy castle for safety.",
            "sent2": "The travelers forted in the mountain fortress to seek protection from the wild animals.",
            "sent3": "The adventurers forted in the ancient ruins, finding shelter from the harsh weather.",
            "sent4": "The refugees forted in the abandoned fort, hoping for a peaceful night's rest.",
            "sent5": "The survivors forted in the underground bunker, waiting for the danger to pass."
        },
        {
            "definition": "To have provided with a fort or defense.",
            "pos": "verb",
            "sent1": "The general forted the troops with strong barricades and watchtowers.",
            "sent2": "The architect forted the castle with thick walls and a moat for protection.",
            "sent3": "The engineer forted the building against earthquakes with reinforced steel beams.",
            "sent4": "The parents forted their home with security alarms and locks to keep their family safe.",
            "sent5": "The king forted his kingdom with a mighty army and strategic fortifications."
        }
    ]
}