{
    "term": "forties",
    "meanings": [
        {
            "definition": "The numbers 40 to 49.",
            "pos": "noun",
            "sent1": "In math class, we learned about the forties, which are the numbers between 40 and 49.",
            "sent2": "My dad's age is in his forties, so he is between 40 and 49 years old.",
            "sent3": "When the teacher asked for a number between 40 and 49, I shouted 'forties!'",
            "sent4": "The forties on the clock seemed to pass by quickly, just like the years of my life.",
            "sent5": "The forties on the calendar marked the end of one decade and the beginning of another."
        },
        {
            "definition": "A decade of years, especially the years of a person's life between the ages of 40 and 49.",
            "pos": "noun",
            "sent1": "My mom is enjoying her forties, the years between 40 and 49, as she feels more confident and wise.",
            "sent2": "During their forties, many people reflect on their achievements and plan for the future.",
            "sent3": "When my dad turned 40, he joked that he was officially in the 'forties club.'",
            "sent4": "The forties of life are like a bridge between youth and old age, a time of transition.",
            "sent5": "Entering the forties can bring a sense of liberation and self-assurance."
        },
        {
            "definition": "A size of clothing for women that is between a size 14 and 16.",
            "pos": "noun",
            "sent1": "The dress in the store was a perfect fit in the forties size, not too tight or loose.",
            "sent2": "She found a lovely blouse in the forties section, which was just the right size for her.",
            "sent3": "When she tried on the forties dress, she felt like it was made just for her.",
            "sent4": "The forties clothing range is popular among women who prefer a comfortable yet stylish fit.",
            "sent5": "Her favorite jeans were in the forties size, giving her confidence and comfort."
        }
    ]
}