{
    "term": "fortuning",
    "meanings": [
        {
            "definition": "The act of predicting or foreseeing future events.",
            "pos": "noun",
            "sent1": "Fortuning can involve looking at signs and symbols to guess what might happen next.",
            "sent2": "Her fortuning abilities allowed her to anticipate the outcome of the game.",
            "sent3": "The fortuning of the weatherman was always accurate, making him the go-to person for outdoor event planning.",
            "sent4": "His fortuning was like having a crystal ball, always knowing what was about to come.",
            "sent5": "The fortuning of the old wise woman was so precise that people traveled from far and wide seeking her advice."
        },
        {
            "definition": "The state of being lucky or fortunate.",
            "pos": "noun",
            "sent1": "Winning the lottery was a stroke of fortuning that changed his life forever.",
            "sent2": "She considered herself in a constant state of fortuning, always finding good luck in every situation.",
            "sent3": "His friends joked that he must have a lucky charm hidden somewhere, attributing all his fortuning to it.",
            "sent4": "The fortuning of finding a four-leaf clover brought her unexpected joy on a dull day.",
            "sent5": "The fortuning of being born into a loving family is a blessing that should never be taken for granted."
        },
        {
            "definition": "To bring good or bad luck to someone or something.",
            "pos": "verb",
            "sent1": "She believed that breaking a mirror would fortuning her with seven years of bad luck.",
            "sent2": "The black cat crossing his path fortuning a streak of misfortune that followed him all day.",
            "sent3": "He joked that his lucky socks would fortuning him to win every game he played.",
            "sent4": "The old legend said that finding a penny heads up would fortuning good luck to whoever picked it up.",
            "sent5": "The horseshoe above the door was said to fortuning protection and good luck to all who entered."
        }
    ]
}