{
    "term": "forwards",
    "meanings": [
        {
            "definition": "In the direction that one is facing or traveling.",
            "pos": "adverb",
            "sent1": "She walked forwards towards the park.",
            "sent2": "The car moved forwards slowly in traffic.",
            "sent3": "The dog chased its tail forwards in circles.",
            "sent4": "Time always moves forwards, never backward.",
            "sent5": "The arrow pointed forwards, guiding the way."
        },
        {
            "definition": "Toward the front.",
            "pos": "adverb",
            "sent1": "He leaned forwards to get a better view.",
            "sent2": "The students moved forwards in line for lunch.",
            "sent3": "The wind pushed the sailboat forwards swiftly.",
            "sent4": "The team surged forwards towards victory.",
            "sent5": "The sunflower turned forwards, seeking the sun's warmth."
        },
        {
            "definition": "In advance.",
            "pos": "adverb",
            "sent1": "She planned forwards for the upcoming exam.",
            "sent2": "The company prepared forwards for the new product launch.",
            "sent3": "The squirrel stored nuts forwards for the winter.",
            "sent4": "The astronaut trained forwards for the space mission.",
            "sent5": "The chef cooked forwards, anticipating the dinner rush."
        },
        {
            "definition": "Onward in time or place.",
            "pos": "adverb",
            "sent1": "The train moved forwards along the tracks.",
            "sent2": "The river flowed forwards towards the ocean.",
            "sent3": "The story unfolded forwards, revealing its secrets.",
            "sent4": "The marathon runner pressed forwards towards the finish line.",
            "sent5": "The clock ticked forwards, marking each passing second."
        },
        {
            "definition": "In support of or in favor of.",
            "pos": "preposition",
            "sent1": "She stood forwards her friend during the difficult times.",
            "sent2": "The community rallied forwards the new library project.",
            "sent3": "The team cheered forwards their captain's decision.",
            "sent4": "He voted forwards the proposal in the meeting.",
            "sent5": "The crowd moved forwards the speaker, eager to hear more."
        }
    ]
}