{
    "term": "forzandi",
    "meanings": [
        {
            "definition": "A musical term meaning to play with force or emphasis.",
            "pos": "noun",
            "sent1": "During the concert, the pianist used forzandi to make the music powerful.",
            "sent2": "The orchestra conductor instructed the musicians to use forzandi in the climax of the piece.",
            "sent3": "The violinist's forzandi made the audience jump in their seats with excitement.",
            "sent4": "Her forzandi on the cello was like a thunderstorm in the quiet hall.",
            "sent5": "The forzandi in the music was so strong, it felt like a wave crashing over the listeners."
        },
        {
            "definition": "A term used in weightlifting to describe a type of lift that requires maximum effort.",
            "pos": "noun",
            "sent1": "The athlete's forzandi in the deadlift competition impressed everyone with its power.",
            "sent2": "To improve strength, weightlifters often include forzandi lifts in their training routine.",
            "sent3": "His forzandi in weightlifting made him look like a superhero lifting a car.",
            "sent4": "The forzandi required for the heavy lift felt like trying to move a mountain.",
            "sent5": "With each forzandi, the weightlifter pushed himself to new limits of strength."
        },
        {
            "definition": "A term used in Italian cooking to describe a method of cooking food quickly over high heat.",
            "pos": "noun",
            "sent1": "The chef used forzandi to sear the steak perfectly on the grill.",
            "sent2": "When making stir-fry, it's important to use forzandi to keep the vegetables crisp.",
            "sent3": "His forzandi in the kitchen made him look like a master chef in action.",
            "sent4": "The forzandi in the pan created a sizzle that filled the room with delicious aroma.",
            "sent5": "The forzandi cooking technique brought out the rich flavors of the dish in no time."
        }
    ]
}