{
    "term": "fossorial",
    "meanings": [
        {
            "definition": "Adapted for digging or burrowing",
            "pos": "adjective",
            "sent1": "The mole's strong claws are fossorial, helping it dig tunnels underground.",
            "sent2": "The fossorial nature of the badger allows it to create intricate burrows for shelter.",
            "sent3": "The fossorial ants worked together to excavate a new underground chamber.",
            "sent4": "Her determination was fossorial, as she dug deep into the sand to find buried treasure.",
            "sent5": "The fossorial habits of the rabbit were evident in the neatly dug burrow entrance."
        },
        {
            "definition": "Relating to or characteristic of animals that burrow",
            "pos": "adjective",
            "sent1": "The fossorial behavior of the rabbit involves creating intricate tunnels underground.",
            "sent2": "The fossorial adaptations of the armadillo help it thrive in its burrowing lifestyle.",
            "sent3": "The fossorial creatures in the forest had a secret network of underground passages.",
            "sent4": "Her mind was a fossorial maze, filled with hidden thoughts and ideas waiting to be unearthed.",
            "sent5": "The fossorial instincts of the squirrel guided it to stash acorns in hidden underground caches."
        },
        {
            "definition": "An animal that burrows or digs",
            "pos": "noun",
            "sent1": "The fossorial emerged from its burrow to forage for food in the soil.",
            "sent2": "The biologist studied the fossorial to understand its burrowing behavior.",
            "sent3": "The fossorial's underground home was cozy and well-protected from predators.",
            "sent4": "The fossorial's digging skills were unmatched in the animal kingdom.",
            "sent5": "Children were excited to see the fossorial pop its head out of the ground during the nature walk."
        }
    ]
}