{
    "term": "found",
    "meanings": [
        {
            "definition": "establish or originate",
            "pos": "verb",
            "sent1": "She found a new company last year.",
            "sent2": "The explorers found a hidden treasure in the cave.",
            "sent3": "The idea to start a lemonade stand was found during a family picnic.",
            "sent4": "Her passion for painting found its roots in childhood memories.",
            "sent5": "The decision to move to a new city was found after much contemplation."
        },
        {
            "definition": "discover or bring to light",
            "pos": "verb",
            "sent1": "He found a rare coin while digging in the garden.",
            "sent2": "The detective found crucial evidence at the crime scene.",
            "sent3": "The missing key was found in the most unexpected place - the fridge!",
            "sent4": "Her talent for singing was found when she joined the school choir.",
            "sent5": "The old diary found in the attic revealed family secrets."
        },
        {
            "definition": "establish or set up",
            "pos": "verb",
            "sent1": "They found a new branch of their business in a different city.",
            "sent2": "The organization found a scholarship fund for underprivileged students.",
            "sent3": "The decision to found a book club was met with enthusiasm.",
            "sent4": "The pioneers found a settlement in the uncharted territory.",
            "sent5": "The team found a new record for the fastest time in the relay race."
        },
        {
            "definition": "provide a basis for",
            "pos": "verb",
            "sent1": "The research study found evidence to support the theory.",
            "sent2": "Her experience in the field found credibility among her peers.",
            "sent3": "The data found in the report laid the groundwork for further analysis.",
            "sent4": "The historical documents found in the archives shed light on past events.",
            "sent5": "The survey found a correlation between exercise and mental health."
        },
        {
            "definition": "melt and mold metal into shape",
            "pos": "verb",
            "sent1": "The blacksmith found the metal to craft a new sword.",
            "sent2": "The artist found the bronze to create a sculpture.",
            "sent3": "The workshop found a new technique to shape the metal more efficiently.",
            "sent4": "The foundry found a way to improve the metal casting process.",
            "sent5": "The sculptor found inspiration in the molten metal's fluidity."
        }
    ]
}