{
    "term": "founders",
    "meanings": [
        {
            "definition": "A person who establishes an organization or institution.",
            "pos": "noun",
            "sent1": "The founders of the club worked hard to create a welcoming environment for everyone.",
            "sent2": "The founders of the company had a vision that inspired many others to join them.",
            "sent3": "The founders of the bakery were so passionate about pastries that they even dreamt of croissant-shaped clouds.",
            "sent4": "The founders of the nation laid the groundwork for a future filled with unity and progress.",
            "sent5": "The founders of the charity dedicated their lives to helping those in need, leaving a lasting impact on the community."
        },
        {
            "definition": "To become wrecked or disabled, especially a ship.",
            "pos": "verb",
            "sent1": "During the storm, the ship founders on the rocks, causing chaos among the crew.",
            "sent2": "The old boat foundered in the rough sea, unable to withstand the powerful waves.",
            "sent3": "The ship foundered comically on a tiny pebble, much to the surprise of the sailors.",
            "sent4": "The vessel foundered like a leaf in a storm, tossed and turned by the unpredictable currents.",
            "sent5": "The boat foundered slowly, its wooden frame creaking under the pressure of the relentless ocean."
        },
        {
            "definition": "To sink below the surface of the water.",
            "pos": "verb",
            "sent1": "The heavy stone foundered quickly in the pond, disappearing from sight.",
            "sent2": "The sunken ship foundered beneath the waves, lost to the depths of the ocean.",
            "sent3": "The toy boat foundered in the bathtub, causing a mini-flood in the bathroom.",
            "sent4": "The anchor foundered into the seabed, securing the boat in place during the storm.",
            "sent5": "The submarine foundered silently, gliding effortlessly into the dark abyss of the sea."
        }
    ]
}