{
    "term": "foundered",
    "meanings": [
        {
            "definition": "To fill with water and sink",
            "pos": "verb",
            "sent1": "The small boat foundered in the stormy sea.",
            "sent2": "The old ship foundered after hitting a rock.",
            "sent3": "The bathtub foundered under the weight of too many toys.",
            "sent4": "Her hopes foundered like a shipwreck on the shore.",
            "sent5": "The leak caused the boat to slowly founder and disappear beneath the waves."
        },
        {
            "definition": "To stumble or collapse",
            "pos": "verb",
            "sent1": "He foundered on the uneven ground and fell.",
            "sent2": "The tired horse foundered at the end of the race.",
            "sent3": "The robot foundered over its own wires, crashing to the floor.",
            "sent4": "His confidence foundered, and he struggled to regain his balance.",
            "sent5": "The tower of blocks foundered with a loud crash, startling everyone nearby."
        },
        {
            "definition": "To fail or break down",
            "pos": "verb",
            "sent1": "The plan foundered due to lack of support.",
            "sent2": "The negotiations foundered on a single point of disagreement.",
            "sent3": "His attempt at humor foundered, leaving an awkward silence.",
            "sent4": "Their relationship foundered under the weight of constant arguments.",
            "sent5": "The engine foundered, leaving them stranded in the middle of nowhere."
        },
        {
            "definition": "To become ill from overeating",
            "pos": "verb",
            "sent1": "She foundered on too much cake at the party.",
            "sent2": "The dog foundered on the treats left out on the table.",
            "sent3": "The cat foundered on the stolen tuna cans, looking guilty.",
            "sent4": "He foundered on the buffet, regretting his lack of self-control.",
            "sent5": "The guests foundered on the lavish feast, groaning with full stomachs."
        }
    ]
}