{
    "term": "foundering",
    "meanings": [
        {
            "definition": "To stumble or collapse",
            "pos": "verb",
            "sent1": "The tired hiker was foundering on the rocky path.",
            "sent2": "The old bridge foundering under the weight of the heavy truck.",
            "sent3": "The clumsy puppy kept foundering over its own paws.",
            "sent4": "Her confidence foundering as she struggled to speak in front of the crowd.",
            "sent5": "The ship foundering in the stormy sea, unable to stay afloat."
        },
        {
            "definition": "To fail or break down",
            "pos": "verb",
            "sent1": "The student's plan foundering due to lack of preparation.",
            "sent2": "The car's engine foundering after years of neglect.",
            "sent3": "The cake foundering in the oven, turning into a burnt mess.",
            "sent4": "His hopes foundering as he realized he had missed the deadline.",
            "sent5": "The business foundering after making poor financial decisions."
        },
        {
            "definition": "To become stuck or unable to move",
            "pos": "verb",
            "sent1": "The key foundering in the rusty lock, refusing to turn.",
            "sent2": "The heavy door foundering on its hinges, jammed shut.",
            "sent3": "The toy car foundering in the thick mud, unable to roll forward.",
            "sent4": "Her foot foundering in the deep snow, making it hard to walk.",
            "sent5": "The wheel foundering in the mud, unable to gain traction."
        },
        {
            "definition": "To struggle or be in difficulty",
            "pos": "verb",
            "sent1": "The company foundering in the competitive market.",
            "sent2": "The swimmer foundering in the rough waves, fighting to stay afloat.",
            "sent3": "The bird foundering to fly against the strong wind.",
            "sent4": "The team foundering to come up with a solution to the problem.",
            "sent5": "The plant foundering in the dry soil, lacking water to grow."
        }
    ]
}