{
    "term": "fours",
    "meanings": [
        {
            "definition": "The number 4.",
            "pos": "noun",
            "sent1": "I have learned to count up to fours in my math class.",
            "sent2": "The teacher asked us to write down the number fours on the board.",
            "sent3": "At the store, I bought a pack of candies, and there were exactly fours in it.",
            "sent4": "In the game, the player needed to roll a dice and move fours spaces forward.",
            "sent5": "The clock struck fours, signaling the end of the school day."
        },
        {
            "definition": "A group or set of four.",
            "pos": "noun",
            "sent1": "The family of ducks waddled by in a group of fours.",
            "sent2": "The table was set for dinner with chairs arranged in fours.",
            "sent3": "The band marched in perfect formation, moving in fours across the field.",
            "sent4": "The team split into fours to cover different areas of the field.",
            "sent5": "The children played a game of tag, running around in groups of fours."
        },
        {
            "definition": "A playing card with four pips.",
            "pos": "noun",
            "sent1": "During the game, I was dealt a hand with a card of fours.",
            "sent2": "The player laid down a card of fours, hoping to win the round.",
            "sent3": "I accidentally dropped the deck, scattering cards of fours everywhere.",
            "sent4": "The magician pulled out a card of fours from his sleeve, surprising the audience.",
            "sent5": "The gambler's lucky charm was a card of fours, which he always kept close."
        },
        {
            "definition": "A meal or dish consisting of four components.",
            "pos": "noun",
            "sent1": "For lunch, I enjoyed a delicious plate of fours with rice, veggies, chicken, and salad.",
            "sent2": "The chef prepared a special menu featuring a variety of dishes, including fours.",
            "sent3": "At the party, the caterer served a buffet with different plates of fours for everyone.",
            "sent4": "The restaurant's signature dish was a flavorful combination of fours that left customers satisfied.",
            "sent5": "The food critic praised the chef's creativity in presenting a balanced meal of fours."
        }
    ]
}