{
    "term": "foxtrotting",
    "meanings": [
        {
            "definition": "Foxtrotting: a dance characterized by long, continuous flowing movements.",
            "pos": "noun",
            "sent1": "At the dance competition, the couple's foxtrotting was graceful and elegant.",
            "sent2": "Let's learn the foxtrotting steps for the upcoming ballroom dance class.",
            "sent3": "The foxtrotting duo looked like they were gliding on air, mesmerizing the audience.",
            "sent4": "Her foxtrotting across the stage was like a gentle breeze, captivating everyone's attention.",
            "sent5": "The foxtrotting routine was so smooth and fluid, it seemed almost effortless."
        },
        {
            "definition": "Foxtrotting: to dance the foxtrot.",
            "pos": "verb",
            "sent1": "They were foxtrotting to the music, following the rhythm with precision.",
            "sent2": "Let's foxtrotting together at the dance party this weekend.",
            "sent3": "He couldn't help but smile while foxtrotting with his partner, enjoying every step.",
            "sent4": "Her heart was foxtrotting with excitement as she danced under the sparkling lights.",
            "sent5": "Foxtrotting under the stars, they felt like they were in their own magical world."
        },
        {
            "definition": "Foxtrotting: the act of moving in a smooth, flowing manner.",
            "pos": "noun",
            "sent1": "The river's foxtrotting through the valley was a sight to behold.",
            "sent2": "She admired the cat's foxtrotting as it gracefully walked along the fence.",
            "sent3": "The clouds seemed to be foxtrotting across the sky, painting a beautiful picture.",
            "sent4": "Time felt like it was foxtrotting by as they enjoyed their peaceful afternoon.",
            "sent5": "The dancer's foxtrotting on stage was so fluid, it mesmerized the entire audience."
        }
    ]
}