{
    "term": "fra",
    "meanings": [
        {
            "definition": "A person who commits fraud.",
            "pos": "noun",
            "sent1": "The fra was caught stealing money from the company.",
            "sent2": "The police arrested the fra for scamming innocent people.",
            "sent3": "The fra tried to sell invisible potions to unsuspecting customers.",
            "sent4": "Her smile was as fake as a fra's promises.",
            "sent5": "Beware of the fra who pretends to be your friend."
        },
        {
            "definition": "A dishonest act or behavior.",
            "pos": "noun",
            "sent1": "Committing fra is illegal and unethical.",
            "sent2": "His constant fra eventually caught up with him.",
            "sent3": "The fra of cheating on the test was quickly discovered.",
            "sent4": "The dark clouds were a fra of the impending storm.",
            "sent5": "The teacher could see through his fra of innocence."
        },
        {
            "definition": "A deceptive or dishonest practice.",
            "pos": "noun",
            "sent1": "The company's fra led to its downfall.",
            "sent2": "Fra in business can ruin reputations.",
            "sent3": "The magician's fra of making things disappear amazed the audience.",
            "sent4": "The politician's promises turned out to be a clever fra.",
            "sent5": "The fraudster's fra was finally exposed by the authorities."
        },
        {
            "definition": "To deceive or trick someone.",
            "pos": "verb",
            "sent1": "She tried to fra her way out of trouble.",
            "sent2": "He managed to fra his friends into believing his lies.",
            "sent3": "The kids decided to fra their parents by hiding the broken vase.",
            "sent4": "The mirage in the desert can fra travelers into thinking they see water.",
            "sent5": "The con artist knew how to fra people with his smooth talk."
        },
        {
            "definition": "To obtain money or goods by deceit.",
            "pos": "verb",
            "sent1": "He attempted to fra the old lady out of her life savings.",
            "sent2": "The scammer was trying to fra unsuspecting victims online.",
            "sent3": "The thief managed to fra the store out of valuable merchandise.",
            "sent4": "The sly fox was able to fra the chickens out of their eggs.",
            "sent5": "The conman's plan was to fra the wealthy businessman out of his fortune."
        }
    ]
}