{
    "term": "frags",
    "meanings": [
        {
            "definition": "Fragments",
            "pos": "noun",
            "sent1": "She collected the colorful frags of glass from the broken vase.",
            "sent2": "The archaeologist carefully examined the frags of pottery found at the site.",
            "sent3": "The puzzle was missing a few frags, making it impossible to complete.",
            "sent4": "The artist used frags of different materials to create a unique sculpture.",
            "sent5": "The explosion sent frags of debris flying in all directions."
        },
        {
            "definition": "Fragrance",
            "pos": "noun",
            "sent1": "The garden was filled with the sweet frags of blooming flowers.",
            "sent2": "She enjoyed the calming fragrance of lavender in her room.",
            "sent3": "The fragrant soap left a pleasant frag on her skin.",
            "sent4": "The bakery's frag of freshly baked bread drew customers in.",
            "sent5": "The frag of pine trees in the forest was refreshing."
        },
        {
            "definition": "Fragile",
            "pos": "adjective",
            "sent1": "The delicate vase was very frags and needed to be handled with care.",
            "sent2": "The old book's pages were yellowed and frags, showing its age.",
            "sent3": "The fragile glass ornaments were easily broken into frags.",
            "sent4": "The fragile butterfly's wings were like delicate frags of paper.",
            "sent5": "The fragile ice sculpture melted into tiny frags in the sun."
        },
        {
            "definition": "Frags (slang for kills in video games)",
            "pos": "noun",
            "sent1": "He achieved a high score by getting multiple frags in the game.",
            "sent2": "The player celebrated each frag they earned during the match.",
            "sent3": "His teammates cheered as he secured the final frag to win the round.",
            "sent4": "The professional gamer's quick reflexes led to a series of frags.",
            "sent5": "The frag count determined the winner of the intense gaming competition."
        }
    ]
}