{
    "term": "fraise",
    "meanings": [
        {
            "definition": "A military defense consisting of pointed stakes or spikes arranged in a horizontal row.",
            "pos": "noun",
            "sent1": "The soldiers built a fraise to protect their camp from enemy attacks.",
            "sent2": "The fraise surrounding the fortress made it difficult for the enemy to approach.",
            "sent3": "The mischievous squirrel tried to climb over the fraise but got pricked by the sharp spikes.",
            "sent4": "Her words were like a fraise, sharp and pointed, leaving no room for argument.",
            "sent5": "The fraise stood like a wall of thorns, deterring any intruders."
        },
        {
            "definition": "A ruffle or frill, especially on a garment.",
            "pos": "noun",
            "sent1": "She added a delicate fraise to the neckline of her dress for a touch of elegance.",
            "sent2": "The ballerina's tutu was adorned with a beautiful fraise that swirled as she danced.",
            "sent3": "The playful puppy kept tugging at the fraise on the hem of the skirt, causing it to flutter.",
            "sent4": "Her laughter was like a fraise, adding a charming detail to the conversation.",
            "sent5": "The fraise on the pillowcase gave it a decorative flair, enhancing the room's decor."
        },
        {
            "definition": "A strawberry.",
            "pos": "noun",
            "sent1": "She picked a ripe fraise from the garden and savored its sweet taste.",
            "sent2": "The fraise in the fruit salad added a burst of color and flavor.",
            "sent3": "The mischievous toddler had fraise stains all over his face after sneaking into the kitchen.",
            "sent4": "The fraise was a tiny red gem nestled among the green leaves of the plant.",
            "sent5": "The aroma of the fraise filled the kitchen, tempting everyone to have a taste."
        }
    ]
}