{
    "term": "frakturs",
    "meanings": [
        {
            "definition": "A type of decorative script used in calligraphy.",
            "pos": "noun",
            "sent1": "The artist carefully practiced writing frakturs in calligraphy class.",
            "sent2": "The wedding invitation was beautifully written in elegant frakturs.",
            "sent3": "The mischievous student doodled frakturs all over his notebook during the boring lecture.",
            "sent4": "Her handwriting was so intricate, it looked like frakturs dancing on the page.",
            "sent5": "The old book was filled with frakturs that seemed to come to life with each stroke of the pen."
        },
        {
            "definition": "A type of German blackletter font.",
            "pos": "noun",
            "sent1": "The historical document was written in bold frakturs that were hard to read.",
            "sent2": "The menu at the German restaurant was printed in traditional frakturs.",
            "sent3": "The street artist painted graffiti in frakturs on the brick wall, giving it an old-world charm.",
            "sent4": "The frakturs on the signboard seemed to whisper tales of the past to those who passed by.",
            "sent5": "The book cover featured intricate frakturs that added a touch of elegance to the design."
        },
        {
            "definition": "A style of illuminated manuscript.",
            "pos": "noun",
            "sent1": "The medieval library displayed rare frakturs that were a feast for the eyes.",
            "sent2": "The monk meticulously copied the text in frakturs onto the parchment.",
            "sent3": "The children's book was filled with colorful illustrations and frakturs that sparkled in the light.",
            "sent4": "The frakturs in the ancient tome seemed to glow with an otherworldly aura.",
            "sent5": "The museum exhibit showcased beautifully preserved frakturs from centuries ago."
        }
    ]
}