{
    "term": "franker",
    "meanings": [
        {
            "definition": "A person or thing that frankes.",
            "pos": "noun",
            "sent1": "The franker at the post office was very efficient.",
            "sent2": "The new franker in the office helped with sorting mail.",
            "sent3": "The little franker robot was always cheerful and never made mistakes.",
            "sent4": "Her smile was like a franker, marking everyone she met with joy.",
            "sent5": "The bright red uniform of the franker made him easy to spot in the crowd."
        },
        {
            "definition": "A device for franking mail.",
            "pos": "noun",
            "sent1": "The franker on the desk made stamping letters quick and easy.",
            "sent2": "The old franker in the post office needed repairs.",
            "sent3": "The franker beeped happily every time a letter was stamped.",
            "sent4": "The franker hummed softly, like a little machine marking its territory.",
            "sent5": "The shiny new franker gleamed under the bright lights of the post office."
        },
        {
            "definition": "To frank or mark (mail) with a postage stamp.",
            "pos": "verb",
            "sent1": "She would franker each letter carefully before sending it out.",
            "sent2": "Remember to franker the envelopes before dropping them off.",
            "sent3": "He accidentally frankered his own hand while stamping the mail.",
            "sent4": "The sun seemed to franker the landscape with golden light.",
            "sent5": "The artist's brush seemed to franker the canvas with vibrant colors."
        },
        {
            "definition": "To send (mail) by franking.",
            "pos": "verb",
            "sent1": "They would franker the important documents to ensure they arrived on time.",
            "sent2": "He always frankered his letters to save on postage costs.",
            "sent3": "She decided to franker the invitations instead of hand-delivering them.",
            "sent4": "The wind seemed to franker the letters away, scattering them in all directions.",
            "sent5": "The river would franker the messages downstream, carrying them to distant lands."
        }
    ]
}