{
    "term": "frap",
    "meanings": [
        {
            "definition": "To strike or beat forcefully",
            "pos": "verb",
            "sent1": "He frapped the table to get everyone's attention.",
            "sent2": "The boxer frapped his opponent with a powerful punch.",
            "sent3": "The chef frapped the dough to make it smooth and even.",
            "sent4": "The storm frapped the coastline, leaving destruction in its wake.",
            "sent5": "She frapped the door in frustration, causing it to shake on its hinges."
        },
        {
            "definition": "A blended coffee drink",
            "pos": "noun",
            "sent1": "I ordered a frap at the cafe for a refreshing treat.",
            "sent2": "The frap was a popular choice among the customers.",
            "sent3": "The frap was so delicious that it disappeared in minutes.",
            "sent4": "The frap was like a sweet, creamy hug in a cup.",
            "sent5": "The frap's aroma filled the room, tempting everyone to take a sip."
        },
        {
            "definition": "A type of knot used to secure a line",
            "pos": "noun",
            "sent1": "He quickly tied a frap to keep the boat in place.",
            "sent2": "The sailor expertly made a frap to secure the rope.",
            "sent3": "The frap held the line tight, preventing it from slipping.",
            "sent4": "The frap was like a reliable friend, keeping everything in place.",
            "sent5": "The frap's tight grip ensured the safety of the ship during the storm."
        },
        {
            "definition": "To cause to become frothy or foamy",
            "pos": "verb",
            "sent1": "She used a blender to frap the milk for the latte.",
            "sent2": "The barista frapped the ingredients to create a creamy texture.",
            "sent3": "The machine frapped the liquid into a bubbly concoction.",
            "sent4": "The excitement in the room seemed to frap the air with energy.",
            "sent5": "The waterfall's descent frapped the water into a white cascade."
        }
    ]
}