{
    "term": "fraternities",
    "meanings": [
        {
            "definition": "A group of people sharing a common profession or interests.",
            "pos": "noun",
            "sent1": "In our neighborhood, the gardening fraternities meet every Saturday to exchange tips and tricks.",
            "sent2": "The fraternities of bird watchers often go on field trips together to observe different species.",
            "sent3": "The fraternities of stamp collectors had a heated debate over the rarest stamp in the world.",
            "sent4": "The fraternities of book lovers formed an alliance to share their favorite reads with each other.",
            "sent5": "Joining the fraternities of artists opened up a whole new world of creativity and inspiration."
        },
        {
            "definition": "The state or feeling of friendship and mutual support within a group.",
            "pos": "noun",
            "sent1": "The fraternities among the hikers grew stronger as they faced challenges together on the trail.",
            "sent2": "There was a sense of genuine fraternities among the volunteers working at the local shelter.",
            "sent3": "The fraternities among the team members made the workplace a more enjoyable and productive environment.",
            "sent4": "The fraternities within the community helped each other rebuild after the devastating storm.",
            "sent5": "The fraternities within the orchestra created a harmonious atmosphere during rehearsals."
        },
        {
            "definition": "An organization of male students at a college or university.",
            "pos": "noun",
            "sent1": "The fraternities on campus often host social events and fundraisers for various causes.",
            "sent2": "Joining a fraternity can provide male students with a sense of belonging and camaraderie.",
            "sent3": "The fraternities at the university competed in a friendly sports tournament against the sororities.",
            "sent4": "Being part of a fraternity can offer male students a network of support and friendship.",
            "sent5": "The fraternities at the college campus have a long-standing tradition of community service."
        }
    ]
}