{
    "term": "fraternity",
    "meanings": [
        {
            "definition": "A group of people sharing a common profession or interests.",
            "pos": "noun",
            "sent1": "The photography fraternity organized a workshop for beginners.",
            "sent2": "The gardening fraternity meets every Saturday to exchange tips and ideas.",
            "sent3": "The cooking fraternity decided to have a bake-off to settle who makes the best cookies.",
            "sent4": "In the world of artists, the fraternity of painters is known for their vibrant colors and unique styles.",
            "sent5": "Joining the astronomy fraternity opened up a whole new world of stargazing opportunities."
        },
        {
            "definition": "The state or feeling of friendship and mutual support within a group.",
            "pos": "noun",
            "sent1": "The sense of fraternity among the team members was evident during the charity event.",
            "sent2": "The fraternity among the neighbors helped them come together to clean up the park.",
            "sent3": "The fraternity between the two rival teams surprised everyone with their joint victory celebration.",
            "sent4": "The fraternity within the book club made reading sessions even more enjoyable.",
            "sent5": "The fraternity within the dance group created a supportive environment for learning new moves."
        },
        {
            "definition": "An organization of male students at a college or university.",
            "pos": "noun",
            "sent1": "The college fraternity hosted a fundraiser for a local charity.",
            "sent2": "Joining a fraternity in university can provide a sense of belonging and camaraderie.",
            "sent3": "The fraternity brothers decided to have a movie night in their dorm.",
            "sent4": "The fraternity house was known for its legendary parties and social events.",
            "sent5": "Being part of a fraternity can offer opportunities for leadership and personal growth."
        }
    ]
}