{
    "term": "fraxinellas",
    "meanings": [
        {
            "definition": "Fraxinellas: a genus of plants in the family Rutaceae.",
            "pos": "noun",
            "sent1": "The fraxinellas in the garden are blooming beautifully.",
            "sent2": "I planted some fraxinellas in my backyard for their lovely flowers.",
            "sent3": "The fraxinellas in the park seem to be having a fragrant party.",
            "sent4": "Her garden was a colorful canvas, with fraxinellas painting the scene.",
            "sent5": "The fraxinellas stood tall, their blooms like little bursts of joy."
        },
        {
            "definition": "Fraxinellas: a type of flowering plant with colorful blooms.",
            "pos": "noun",
            "sent1": "The fraxinellas in the field had vibrant petals.",
            "sent2": "She admired the fraxinellas for their bright colors.",
            "sent3": "The fraxinellas in the garden looked like a rainbow in bloom.",
            "sent4": "The fraxinellas danced in the wind, their hues blending beautifully.",
            "sent5": "Each fraxinella seemed to whisper a different shade of beauty."
        },
        {
            "definition": "Fraxinellas: plants known for their fragrant flowers.",
            "pos": "noun",
            "sent1": "The fraxinellas filled the air with a sweet scent.",
            "sent2": "People love fraxinellas for their pleasant fragrance.",
            "sent3": "The fraxinellas in the garden perfumed the entire neighborhood.",
            "sent4": "Her bouquet was a mix of fraxinellas, each aroma a memory.",
            "sent5": "The fraxinellas' perfume lingered long after they were gone."
        },
        {
            "definition": "Fraxinellas: a species of plant commonly found in gardens.",
            "pos": "noun",
            "sent1": "Gardens often feature fraxinellas due to their beauty.",
            "sent2": "The fraxinellas in the park attracted many visitors.",
            "sent3": "The fraxinellas seemed to be the celebrities of the garden world.",
            "sent4": "Among the greenery, the fraxinellas stood out like stars.",
            "sent5": "Every garden seemed incomplete without the presence of fraxinellas."
        }
    ]
}