{
    "term": "freezing",
    "meanings": [
        {
            "definition": "Extremely cold",
            "pos": "adjective",
            "sent1": "The ice cream was freezing, making it hard to scoop.",
            "sent2": "The weather outside was freezing, so everyone bundled up in warm clothes.",
            "sent3": "The freezing wind made the trees shiver in their roots.",
            "sent4": "Her freezing glare could chill even the warmest hearts.",
            "sent5": "The freezing water turned to solid ice in seconds."
        },
        {
            "definition": "The act of becoming solid due to cold temperatures",
            "pos": "noun",
            "sent1": "The freezing of the lake happened overnight.",
            "sent2": "The freezing of the chocolate made it perfect for dipping strawberries.",
            "sent3": "The freezing of time seemed impossible, but it happened in that moment.",
            "sent4": "The freezing of emotions left her numb and distant.",
            "sent5": "The freezing of the river created a beautiful ice sculpture."
        },
        {
            "definition": "To make or become very cold",
            "pos": "verb",
            "sent1": "She tried to freezing the water quickly by adding ice cubes.",
            "sent2": "The wind outside can freezing you to the bone if you're not careful.",
            "sent3": "He decided to freezing the room by turning up the air conditioning.",
            "sent4": "The news of the accident seemed to freezing his heart with fear.",
            "sent5": "The snowstorm would freezing the entire town for days."
        },
        {
            "definition": "To preserve food by subjecting it to very low temperatures",
            "pos": "verb",
            "sent1": "They were freezing the leftovers to enjoy another day.",
            "sent2": "The chef recommended freezing the berries for a longer shelf life.",
            "sent3": "She was freezing the soup for a quick meal on a busy day.",
            "sent4": "Freezing the meat would keep it fresh until they were ready to cook.",
            "sent5": "The best way to freezing the vegetables was to blanch them first."
        }
    ]
}