{
    "term": "freighted",
    "meanings": [
        {
            "definition": "To load or burden with goods or supplies",
            "pos": "verb",
            "sent1": "The ship was freighted with crates of fruits and vegetables.",
            "sent2": "The truck driver freighted the boxes of books to the bookstore.",
            "sent3": "The little boat was freighted with so many toys that it almost sank!",
            "sent4": "Her heart was freighted with sadness after hearing the news.",
            "sent5": "The old truck groaned under the weight of the freighted furniture."
        },
        {
            "definition": "To convey as freight",
            "pos": "verb",
            "sent1": "The train freighted the coal to the power plant.",
            "sent2": "The cargo plane freighted medical supplies to the disaster area.",
            "sent3": "The hot air balloon freighted passengers high above the city.",
            "sent4": "His words freighted a sense of urgency that caught everyone's attention.",
            "sent5": "The river freighted the logs downstream with ease."
        },
        {
            "definition": "To be laden with goods",
            "pos": "verb",
            "sent1": "The shelves were freighted with colorful toys for the children.",
            "sent2": "The market stalls were freighted with fresh produce from the farms.",
            "sent3": "The backpacker was freighted with snacks for the long hike.",
            "sent4": "The old attic was freighted with forgotten treasures waiting to be discovered.",
            "sent5": "The ship was freighted with barrels of rum for the sailors."
        },
        {
            "definition": "To be filled with a particular quality or emotion",
            "pos": "verb",
            "sent1": "Her voice was freighted with excitement as she shared the good news.",
            "sent2": "The room was freighted with tension before the important meeting.",
            "sent3": "His words were freighted with humor, making everyone laugh.",
            "sent4": "The air was freighted with the scent of blooming flowers in the garden.",
            "sent5": "The atmosphere was freighted with anticipation before the concert started."
        }
    ]
}