{
    "term": "frenzy",
    "meanings": [
        {
            "definition": "A state or period of uncontrolled excitement or wild behavior.",
            "pos": "noun",
            "sent1": "The children were in a frenzy at the birthday party, running around and laughing.",
            "sent2": "The fans were in a frenzy when their favorite band took the stage.",
            "sent3": "The puppy caused a frenzy of joy as it chased its tail in circles.",
            "sent4": "Her mind was a frenzy of thoughts, making it hard to focus on one thing.",
            "sent5": "The market was in a frenzy of activity, with people rushing from stall to stall."
        },
        {
            "definition": "A temporary madness or delirium.",
            "pos": "noun",
            "sent1": "During the full moon, the villagers believed they were at risk of falling into a frenzy of madness.",
            "sent2": "The illness caused a frenzy of delirium, making it difficult for him to distinguish reality.",
            "sent3": "The idea of a talking cat sent the children into a frenzy of playful madness.",
            "sent4": "Her love for him was like a frenzy, consuming her thoughts day and night.",
            "sent5": "The haunted house filled her dreams with a frenzy of ghostly delirium."
        },
        {
            "definition": "A state of violent mental agitation or wild excitement.",
            "pos": "noun",
            "sent1": "The news of the storm approaching sent the town into a frenzy of preparation.",
            "sent2": "The political rally turned into a frenzy of passionate speeches and cheering.",
            "sent3": "The idea of a squirrel wearing sunglasses caused a frenzy of laughter among the children.",
            "sent4": "His heart raced in a frenzy of fear as he heard footsteps behind him in the dark alley.",
            "sent5": "The discovery of buried treasure sent the archaeologists into a frenzy of excitement."
        }
    ]
}