{
    "term": "french",
    "meanings": [
        {
            "definition": "Of or relating to France or its people or language.",
            "pos": "adjective",
            "sent1": "The Eiffel Tower is a famous French landmark.",
            "sent2": "She spoke in a lovely French accent.",
            "sent3": "The French bakery always smells delicious.",
            "sent4": "The French countryside is like a beautiful painting.",
            "sent5": "The French flag has three colors: blue, white, and red."
        },
        {
            "definition": "The Romance language of France.",
            "pos": "noun",
            "sent1": "Learning French can be fun and challenging.",
            "sent2": "She studied French for many years.",
            "sent3": "The parrot tried to mimic the French words.",
            "sent4": "French sounds like music to my ears.",
            "sent5": "Speaking French fluently opens many doors."
        },
        {
            "definition": "A person from France.",
            "pos": "noun",
            "sent1": "The French at the event were very friendly.",
            "sent2": "He met a French artist at the gallery.",
            "sent3": "The French brought delicious cheese to the party.",
            "sent4": "The French are known for their fashion sense.",
            "sent5": "The French always celebrate Bastille Day with joy."
        },
        {
            "definition": "A style of cooking or food associated with France.",
            "pos": "noun",
            "sent1": "She prepared a delicious French meal for her guests.",
            "sent2": "French cuisine is famous for its flavors.",
            "sent3": "The French dessert was a work of art.",
            "sent4": "The aroma of the French bakery filled the street.",
            "sent5": "The French chef's skills were unmatched."
        },
        {
            "definition": "To cut (green beans) lengthwise into thin strips before cooking.",
            "pos": "verb",
            "sent1": "She carefully French-cut the green beans for the salad.",
            "sent2": "French-cutting the vegetables adds a nice touch to the dish.",
            "sent3": "He attempted to French-cut the carrots but ended up with chunks.",
            "sent4": "The chef's precise French-cutting technique impressed everyone.",
            "sent5": "French-cutting the vegetables requires patience and skill."
        }
    ]
}