{
    "term": "fretty",
    "meanings": [
        {
            "definition": "Anxious or worried",
            "pos": "adjective",
            "sent1": "She felt fretty before the big test.",
            "sent2": "The fretty cat hid under the bed during the thunderstorm.",
            "sent3": "The fretty squirrel kept checking if it buried its acorn properly.",
            "sent4": "His fretty mind raced with what-ifs like a squirrel gathering nuts.",
            "sent5": "The fretty feeling in her stomach was like a storm brewing inside."
        },
        {
            "definition": "Covered with fretwork",
            "pos": "adjective",
            "sent1": "The fretty table had intricate designs carved into its surface.",
            "sent2": "The fretty window frames added elegance to the old house.",
            "sent3": "The fretty chair looked like a piece of art rather than furniture.",
            "sent4": "The fretty patterns danced in the sunlight like shadows on water.",
            "sent5": "The fretty details on the door seemed to tell a story of craftsmanship."
        },
        {
            "definition": "Having frets or ridges",
            "pos": "adjective",
            "sent1": "The fretty guitar neck made it easier to play complex chords.",
            "sent2": "The fretty surface of the rock provided a good grip for climbing.",
            "sent3": "The fretty texture of the fabric added a unique touch to the dress.",
            "sent4": "Her fingers traced the fretty edges of the puzzle pieces, feeling each ridge.",
            "sent5": "The fretty path through the forest was bumpy but full of character."
        },
        {
            "definition": "Showing fretfulness",
            "pos": "adjective",
            "sent1": "His fretty behavior made it clear he was nervous about the presentation.",
            "sent2": "The fretty expression on her face revealed her unease.",
            "sent3": "The fretty puppy kept pacing back and forth in the room.",
            "sent4": "The fretty tone of his voice hinted at his underlying worry.",
            "sent5": "The fretty movements of the bird showed its discomfort in the cage."
        }
    ]
}