{
    "term": "fretwork",
    "meanings": [
        {
            "definition": "Ornamental work consisting of interlaced or intersecting lines, often in a geometric pattern.",
            "pos": "noun",
            "sent1": "The intricate fretwork on the wooden door caught everyone's attention.",
            "sent2": "The craftsman displayed his skill in creating beautiful fretwork on the furniture.",
            "sent3": "The children were amazed by the fretwork on the ceiling, thinking it was a secret code.",
            "sent4": "Her mind was a maze of thoughts, like a complex fretwork of worries.",
            "sent5": "The fretwork on the window seemed to dance in the sunlight, mesmerizing all who saw it."
        },
        {
            "definition": "To be constantly or visibly anxious or worried.",
            "pos": "verb",
            "sent1": "She would fretwork about her upcoming exams, unable to relax.",
            "sent2": "He tends to fretwork over small details, making it hard for him to enjoy the present.",
            "sent3": "The cat would fretwork about the missing toy mouse, pacing back and forth.",
            "sent4": "Her thoughts would fretwork like a squirrel, never staying in one place for long.",
            "sent5": "The storm clouds gathered, causing her to fretwork about the safety of her garden."
        },
        {
            "definition": "A decorative design or pattern created by cutting or carving into a surface.",
            "pos": "noun",
            "sent1": "The artist showcased a stunning fretwork of flowers on the marble sculpture.",
            "sent2": "The intricate fretwork on the wooden frame added elegance to the mirror.",
            "sent3": "The mischievous squirrel left a trail of fretwork on the pumpkin, nibbling away.",
            "sent4": "Her laughter echoed through the room, creating a joyous fretwork of sound.",
            "sent5": "The chef's knife moved swiftly, carving a beautiful fretwork on the watermelon."
        }
    ]
}