{
    "term": "friendly",
    "meanings": [
        {
            "definition": "Kind and pleasant.",
            "pos": "adjective",
            "sent1": "The friendly cat purred softly as it nuzzled against my hand.",
            "sent2": "The friendly cashier greeted each customer with a warm smile.",
            "sent3": "The friendly sun peeked through the clouds, making the day even brighter.",
            "sent4": "Her friendly laughter was like a melody that filled the room with joy.",
            "sent5": "The friendly gesture of holding the door open for others left a lasting impression."
        },
        {
            "definition": "Showing or expressing goodwill.",
            "pos": "adjective",
            "sent1": "A friendly wave from across the street made me feel welcomed.",
            "sent2": "The friendly note left on my desk brightened my day.",
            "sent3": "The friendly gesture of sharing her umbrella in the rain was truly kind.",
            "sent4": "His friendly advice guided me through a difficult decision.",
            "sent5": "The friendly smile on her face showed genuine care and concern."
        },
        {
            "definition": "Not hostile or aggressive.",
            "pos": "adjective",
            "sent1": "The friendly dog wagged its tail happily as it approached us.",
            "sent2": "The friendly competition brought out the best in all the participants.",
            "sent3": "The friendly debate between friends was filled with laughter and respect.",
            "sent4": "Her friendly tone diffused the tension in the room instantly.",
            "sent5": "The friendly atmosphere of the park made everyone feel at ease."
        },
        {
            "definition": "Easy to use or understand.",
            "pos": "adjective",
            "sent1": "The friendly interface of the app made navigation a breeze.",
            "sent2": "The friendly instructions on the package helped me assemble the furniture quickly.",
            "sent3": "The friendly layout of the website made finding information simple.",
            "sent4": "Her friendly explanation clarified the concept for everyone in the class.",
            "sent5": "The friendly design of the tool made it accessible to users of all ages."
        },
        {
            "definition": "Inclined to help or support.",
            "pos": "adjective",
            "sent1": "The friendly neighbor offered to water our plants while we were away.",
            "sent2": "The friendly team member always volunteered to assist others with their tasks.",
            "sent3": "The friendly gesture of lending a hand made the project much easier.",
            "sent4": "Her friendly nature shone through in every act of kindness she showed.",
            "sent5": "The friendly attitude of the group made working together a pleasure."
        }
    ]
}