{
    "term": "friendlies",
    "meanings": [
        {
            "definition": "Friendly: showing kindness or goodwill",
            "pos": "adjective",
            "sent1": "The friendlies cat greeted me with a purr and a rub against my leg.",
            "sent2": "The teacher's smile was warm and friendlies as she welcomed the new student.",
            "sent3": "The friendlies gesture of sharing her umbrella on a rainy day made everyone smile.",
            "sent4": "The friendlies sun peeked through the clouds, brightening up the gloomy day.",
            "sent5": "The friendlies old dog wagged its tail happily at the sight of its owner."
        },
        {
            "definition": "Friendly: a person who is on good terms with another",
            "pos": "adjective",
            "sent1": "She is known as the friendlies neighbor on the block, always ready to lend a hand.",
            "sent2": "The friendlies student in class helped others understand the difficult math problem.",
            "sent3": "The friendlies siblings always shared their toys without any arguments.",
            "sent4": "The friendlies colleagues at work often went out for lunch together.",
            "sent5": "The friendlies cashier greeted each customer with a smile and a kind word."
        },
        {
            "definition": "Friendly: a sports match or competition that is not part of a regular league schedule",
            "pos": "adjective",
            "sent1": "The team played a series of friendlies matches to prepare for the upcoming tournament.",
            "sent2": "The friendlies soccer game between the two schools ended in a tie.",
            "sent3": "The friendlies basketball match turned into a fun game of students versus teachers.",
            "sent4": "The friendlies tennis tournament allowed players of all levels to participate.",
            "sent5": "The friendlies baseball game was a chance for the community to come together and enjoy the sport."
        }
    ]
}