{
    "term": "friendship",
    "meanings": [
        {
            "definition": "The state of being friends.",
            "pos": "noun",
            "sent1": "My friendship with Sarah is very special to me.",
            "sent2": "Friendship is important for a happy life.",
            "sent3": "The friendship between the cat and the dog was heartwarming.",
            "sent4": "Their friendship was like a sturdy bridge connecting their hearts.",
            "sent5": "The bond of friendship between them was unbreakable."
        },
        {
            "definition": "A relationship between friends.",
            "pos": "noun",
            "sent1": "I cherish our friendship and all the memories we share.",
            "sent2": "Friendship requires effort from both sides.",
            "sent3": "The friendship between the sun and the moon was quite amusing.",
            "sent4": "Their friendship was a beacon of light in the darkness of life.",
            "sent5": "The friendship blossomed like a beautiful flower in spring."
        },
        {
            "definition": "A friendly feeling or attitude.",
            "pos": "noun",
            "sent1": "His friendship towards others always shines through.",
            "sent2": "Friendship can make even the toughest days brighter.",
            "sent3": "The friendship in the air was palpable and comforting.",
            "sent4": "Her friendship was like a warm hug on a cold day.",
            "sent5": "The friendship in the room was contagious and heartwarming."
        },
        {
            "definition": "A state of mutual trust and support between friends.",
            "pos": "noun",
            "sent1": "Their friendship was built on trust and loyalty.",
            "sent2": "Friendship provides a strong foundation during tough times.",
            "sent3": "The friendship between the book and the bookmark was quite amusing.",
            "sent4": "Their friendship was a shield against the storms of life.",
            "sent5": "The friendship was a lifeline in the sea of uncertainty."
        }
    ]
}