{
    "term": "frisker",
    "meanings": [
        {
            "definition": "A person who frisks or searches for something.",
            "pos": "noun",
            "sent1": "The frisker found the missing keys under the couch.",
            "sent2": "The museum security guard was a diligent frisker, always on the lookout for any misplaced artifacts.",
            "sent3": "The frisker at the airport chuckled as he discovered a forgotten sandwich in a passenger's bag.",
            "sent4": "She was a skilled frisker, able to uncover hidden treasures in the most unexpected places.",
            "sent5": "The young detective imagined himself as a fearless frisker, solving mysteries with his keen eye."
        },
        {
            "definition": "A device used for frisking or searching.",
            "pos": "noun",
            "sent1": "The security team used a high-tech frisker to scan all incoming packages.",
            "sent2": "The airport installed new friskers to enhance their security measures.",
            "sent3": "The frisker beeped loudly when it detected a metal object in the bag.",
            "sent4": "The frisker's screen displayed a detailed image of the item hidden in the luggage.",
            "sent5": "The portable frisker was lightweight and easy to carry around for inspections."
        },
        {
            "definition": "To search someone for concealed weapons or contraband.",
            "pos": "verb",
            "sent1": "The security officer had to frisk every visitor before allowing them into the event.",
            "sent2": "The police officer frisked the suspect for any illegal substances.",
            "sent3": "The magician jokingly asked the audience to frisk him for hidden cards.",
            "sent4": "She felt violated when the security personnel frisked her at the entrance.",
            "sent5": "The customs officer had to frisk each passenger for prohibited items before they could board the plane."
        }
    ]
}