{
    "term": "fritted",
    "meanings": [
        {
            "definition": "Fritted (verb): past tense of frit - to fuse or sinter (a material, such as glass) into a mass by heating and melting",
            "pos": "verb",
            "sent1": "Yesterday, I fritted the glass pieces together to create a beautiful mosaic.",
            "sent2": "The artist carefully fritted the colored glass to form intricate patterns in the window.",
            "sent3": "After accidentally fritting the glass bottle, it turned into a unique sculpture.",
            "sent4": "Her words fritted my heart, melting away any doubts I had.",
            "sent5": "The sun fritted the sand into a shimmering sheet of glass-like surface."
        },
        {
            "definition": "Fritted (adjective): coated or covered with frit",
            "pos": "adjective",
            "sent1": "The fritted vase sparkled under the light, reflecting its colorful coating.",
            "sent2": "The fritted surface of the mirror added a touch of elegance to the room.",
            "sent3": "The fritted cupcakes looked like tiny jewels, enticing everyone at the party.",
            "sent4": "Her smile was as bright as a fritted gem, radiating joy to all around her.",
            "sent5": "The fritted car hood gleamed in the sun, showcasing its glossy finish."
        },
        {
            "definition": "Fritted (noun): a material, such as glass, that has been fused or sintered into a mass by heating and melting",
            "pos": "noun",
            "sent1": "The artist used fritted glass to create a stunning sculpture that glistened in the gallery.",
            "sent2": "The fritted material was carefully shaped into delicate ornaments for the holiday season.",
            "sent3": "The fritted glass resembled a frozen waterfall, capturing the beauty of nature.",
            "sent4": "Her eyes sparkled like fritted gems, reflecting the light in a mesmerizing way.",
            "sent5": "The fritted beads clinked together, creating a melodic sound as she moved."
        }
    ]
}