{
    "term": "frizzers",
    "meanings": [
        {
            "definition": "A device used to create curls or waves in hair.",
            "pos": "noun",
            "sent1": "She used the frizzers to make her hair curly for the party.",
            "sent2": "The hairstylist reached for the frizzers to give the client beachy waves.",
            "sent3": "The frizzers were like magic wands, transforming her straight hair into beautiful curls.",
            "sent4": "Her hairdresser wielded the frizzers like a sculptor shaping a masterpiece.",
            "sent5": "The frizzers hummed softly as they worked their curling magic on her hair."
        },
        {
            "definition": "A person who specializes in styling hair.",
            "pos": "noun",
            "sent1": "The talented frizzers at the salon always knew the latest hair trends.",
            "sent2": "She decided to visit the frizzers to get a new haircut for the event.",
            "sent3": "The frizzers at the fashion show created stunning hairstyles that turned heads.",
            "sent4": "The frizzers' expertise in hair styling was unmatched in the city.",
            "sent5": "People traveled from far and wide to have their hair styled by the renowned frizzers."
        },
        {
            "definition": "To style hair using a frizzing iron.",
            "pos": "verb",
            "sent1": "She frizzers her hair every morning to achieve the perfect waves.",
            "sent2": "He carefully frizzers his client's hair to give it a natural bounce.",
            "sent3": "The children giggled as they watched their mom frizzers her hair in the mirror.",
            "sent4": "Her hair frizzers like a field of wheat swaying in the wind.",
            "sent5": "The hairstylist expertly frizzers the model's hair for the photoshoot."
        },
        {
            "definition": "The act of creating curls or waves in hair using a frizzing iron.",
            "pos": "noun",
            "sent1": "Her quick frizzers gave her hair a lovely wavy texture.",
            "sent2": "The frizzers' gentle touch transformed her straight hair into cascading curls.",
            "sent3": "The frizzers' dance through her hair left behind a trail of beautiful waves.",
            "sent4": "The frizzers' song of sizzling heat turned her locks into a sea of curls.",
            "sent5": "With a flick of the wrist, the frizzers worked their magic, creating stunning curls."
        }
    ]
}