{
    "term": "frizz",
    "meanings": [
        {
            "definition": "To form small, tight curls or waves in hair.",
            "pos": "verb",
            "sent1": "After she washed her hair, it started to frizz up into little curls.",
            "sent2": "Her hair tends to frizz in humid weather, making it difficult to manage.",
            "sent3": "The rain made her hair frizz up like a fluffy cloud.",
            "sent4": "Her excitement caused her hair to frizz with energy, just like her emotions.",
            "sent5": "The static in the air made her hair frizz out in all directions, creating a wild look."
        },
        {
            "definition": "Hair that is frizzy or curly.",
            "pos": "noun",
            "sent1": "Her natural frizz gave her a unique and beautiful hairstyle.",
            "sent2": "She used a special product to tame her frizz and make her hair smooth.",
            "sent3": "The little girl's frizz bounced around as she ran, adding to her playful appearance.",
            "sent4": "Her frizz framed her face like a halo of curls, enhancing her features.",
            "sent5": "The frizz in her hair seemed to have a mind of its own, dancing in the breeze."
        },
        {
            "definition": "To become frizzy or curly.",
            "pos": "verb",
            "sent1": "The heat caused her hair to frizz up, creating a natural wavy look.",
            "sent2": "If you brush your hair too much, it might frizz and lose its smoothness.",
            "sent3": "His hair started to frizz after he spent the day at the beach, giving him a carefree vibe.",
            "sent4": "The fabric softener made her clothes frizz up in the dryer, just like her hair.",
            "sent5": "The wind made her hair frizz out, adding a touch of wildness to her appearance."
        },
        {
            "definition": "A mass of frizzy or curly hair.",
            "pos": "noun",
            "sent1": "Her frizz cascaded down her back in a beautiful display of curls.",
            "sent2": "The actress's signature look was her voluminous frizz that framed her face.",
            "sent3": "The little boy's frizz bounced around as he played, giving him a carefree look.",
            "sent4": "Her frizz seemed to have a life of its own, moving and swaying with every step.",
            "sent5": "The frizz on her head resembled a fluffy cloud, adding a touch of whimsy to her appearance."
        }
    ]
}