{
    "term": "frizzed",
    "meanings": [
        {
            "definition": "To form small, tight curls or waves in hair.",
            "pos": "verb",
            "sent1": "She frizzed her hair for the party.",
            "sent2": "Her hair always frizzes in the humidity.",
            "sent3": "The hairdryer accidentally frizzed her hair into a wild mess.",
            "sent4": "The heat frizzed her hair like a nest of baby birds.",
            "sent5": "The curling iron frizzed her hair into a beautiful cascade of waves."
        },
        {
            "definition": "To make hair or fur appear frizzy.",
            "pos": "verb",
            "sent1": "The humidity frizzed her hair into a fluffy cloud.",
            "sent2": "The wind frizzed the dog's fur as it ran through the park.",
            "sent3": "The static electricity frizzed her hair like a fuzzy halo.",
            "sent4": "The rain frizzed her hair into a wild tangle of curls.",
            "sent5": "The brush frizzed her hair, creating a soft, fluffy texture."
        },
        {
            "definition": "To become frizzy or tangled.",
            "pos": "verb",
            "sent1": "Her hair frizzed up after being caught in the rain.",
            "sent2": "The fabric frizzed at the edges after being washed.",
            "sent3": "The yarn frizzed as she pulled it through the needle.",
            "sent4": "The rope frizzed as it rubbed against the rough surface.",
            "sent5": "The paper frizzed along the torn edge, creating a jagged texture."
        },
        {
            "definition": "Having hair that is frizzy or tangled.",
            "pos": "adjective",
            "sent1": "She struggled to manage her frizzed hair in the morning.",
            "sent2": "The frizzed hair gave her a wild and carefree look.",
            "sent3": "Her frizzed hair seemed to have a mind of its own.",
            "sent4": "The frizzed hair added a unique texture to her style.",
            "sent5": "The frizzed hair framed her face in a natural, untamed way."
        }
    ]
}