{
    "term": "frontages",
    "meanings": [
        {
            "definition": "The extent of a property that faces a street or water.",
            "pos": "noun",
            "sent1": "The frontages of the houses on our street are all beautifully landscaped.",
            "sent2": "The store's frontages were decorated with colorful banners to attract customers.",
            "sent3": "The ducks enjoyed swimming along the frontages of the lake, showing off their graceful movements.",
            "sent4": "The frontages of the city buildings stood tall and proud, reflecting the morning sunlight.",
            "sent5": "As we walked down the street, the frontages of the shops seemed to invite us in with their welcoming displays."
        },
        {
            "definition": "The act of facing or being situated at the front.",
            "pos": "noun",
            "sent1": "The frontages of the soldiers were stern as they stood in formation.",
            "sent2": "The frontages of the houses in the neighborhood all had colorful doors.",
            "sent3": "The frontages of the students in the class showed their eagerness to learn.",
            "sent4": "The frontages of the cars in the parking lot gleamed under the bright sun.",
            "sent5": "The frontages of the mountains were covered in a blanket of snow, creating a picturesque scene."
        },
        {
            "definition": "The front part of a building or piece of land.",
            "pos": "noun",
            "sent1": "The frontages of the mansion were adorned with intricate carvings.",
            "sent2": "The frontages of the park were filled with blooming flowers in the spring.",
            "sent3": "The frontages of the cake were decorated with colorful frosting designs.",
            "sent4": "The frontages of the garden were a riot of colors with various flowers in bloom.",
            "sent5": "The frontages of the theater were grand and imposing, hinting at the performances within."
        }
    ]
}