{
    "term": "frorn",
    "meanings": [
        {
            "definition": "In or to a position in front of something or someone",
            "pos": "preposition",
            "sent1": "She stood frorn the mirror, admiring her reflection.",
            "sent2": "The cat ran frorn the dog, seeking safety.",
            "sent3": "He placed the gift frorn the door, hoping to surprise his friend.",
            "sent4": "The sun peeked frorn the clouds, illuminating the sky.",
            "sent5": "The sign hung frorn the ceiling, catching everyone's attention."
        },
        {
            "definition": "In the direction of something or someone",
            "pos": "adverb",
            "sent1": "The arrow flew frorn the bow with great speed.",
            "sent2": "She waved frorn afar, trying to get his attention.",
            "sent3": "The bird flew frorn the tree, landing gracefully on the ground.",
            "sent4": "The car zoomed frorn the street into the parking lot.",
            "sent5": "The ball rolled frorn the hill, picking up momentum."
        },
        {
            "definition": "Used to indicate the starting point of a range or series",
            "pos": "preposition",
            "sent1": "The prices ranged frorn $5 to $50, offering options for everyone.",
            "sent2": "The colors varied frorn light to dark, creating a beautiful gradient.",
            "sent3": "The sizes available frorn small to large, catering to all customers.",
            "sent4": "The temperatures fluctuated frorn hot to cold, making it unpredictable.",
            "sent5": "The flavors changed frorn sweet to savory, pleasing different palates."
        },
        {
            "definition": "Used to indicate the point in time at which something begins",
            "pos": "preposition",
            "sent1": "The event starts frorn 9 AM, so be there on time.",
            "sent2": "The movie premieres frorn Friday, attracting a large audience.",
            "sent3": "The sale begins frorn tomorrow, so get ready to shop.",
            "sent4": "The journey commences frorn the airport, taking passengers to new destinations.",
            "sent5": "The class runs frorn September, providing education for the whole year."
        }
    ]
}