{
    "term": "frostnips",
    "meanings": [
        {
            "definition": "frostnips: a condition in which the skin becomes red, swollen, and painful due to exposure to cold temperatures",
            "pos": "noun",
            "sent1": "After playing in the snow all day, Sarah got frostnips on her cheeks.",
            "sent2": "The doctor treated the frostnips on the hiker's fingers with care.",
            "sent3": "When Jack saw his red nose, he joked about having frostnips like Rudolph.",
            "sent4": "The frostnips on her skin felt like tiny pinches from invisible fingers.",
            "sent5": "The frostnips on his ears made him wish he had worn a warmer hat."
        },
        {
            "definition": "frostnips: to experience frostnip, especially on the fingers or toes",
            "pos": "verb",
            "sent1": "During the camping trip, Tim frostnipsed his toes while hiking in the snow.",
            "sent2": "She always wears thick socks to avoid frostnipsing her feet in the winter.",
            "sent3": "The penguin warned the seal not to frostnips its flippers in the icy water.",
            "sent4": "As the skater glided on the frozen pond, she could feel the ice trying to frostnips her toes.",
            "sent5": "The mountaineer's guide advised him on how to prevent frostnipsing during the climb."
        },
        {
            "definition": "frostnips: the act of developing frostnip on the extremities due to cold weather",
            "pos": "noun",
            "sent1": "The frostnips of his fingers made it hard for him to hold the cold metal.",
            "sent2": "In extreme cold, the risk of frostnips increases for those exposed to the elements.",
            "sent3": "The snowman chuckled at the idea of getting frostnips on his carrot nose.",
            "sent4": "The frostnips on the tree branches showed how harsh the winter had been.",
            "sent5": "The skier's gloves protected her hands from the frostnips of the biting wind."
        }
    ]
}