{
    "term": "frostline",
    "meanings": [
        {
            "definition": "The imaginary line on the ground below which the soil is frozen.",
            "pos": "noun",
            "sent1": "In winter, the frostline marks where the ground is frozen solid.",
            "sent2": "The farmer knew it was time to stop planting when he saw the frostline creeping up the soil.",
            "sent3": "The mischievous squirrel thought the frostline was a magical barrier he couldn't cross.",
            "sent4": "The frostline was like a stubborn border refusing to let the warmth in.",
            "sent5": "Children were warned not to play beyond the frostline, where the ground was hard as rock."
        },
        {
            "definition": "The point at which frost begins to form on a surface.",
            "pos": "noun",
            "sent1": "Every morning, the car windshield showed the frostline where the cold had settled.",
            "sent2": "The gardener knew it was autumn when the frostline appeared on the leaves of the plants.",
            "sent3": "The cat curiously pawed at the frostline on the window, trying to catch the cold.",
            "sent4": "The frostline on the grass looked like delicate lace woven by winter's touch.",
            "sent5": "The artist captured the beauty of the frostline on the petals of a frozen flower."
        },
        {
            "definition": "The boundary between frozen and unfrozen ground.",
            "pos": "noun",
            "sent1": "Hikers could feel the frostline underfoot as they walked from thawed earth to icy ground.",
            "sent2": "The builders had to dig deeper to reach below the frostline for a stable foundation.",
            "sent3": "The dog happily dug up the yard, unaware of the frostline that divided the soil.",
            "sent4": "The frostline acted like a natural barrier, separating the winter's grip from the spring thaw.",
            "sent5": "The geologist studied the frostline to understand the effects of freezing on the landscape."
        }
    ]
}