{
    "term": "frostlines",
    "meanings": [
        {
            "definition": "The boundary where frost forms on the ground.",
            "pos": "noun",
            "sent1": "In winter, the frostlines on the grass show where the cold air has touched.",
            "sent2": "The frostlines on the window indicated how cold it was outside.",
            "sent3": "The cat followed the frostlines on the sidewalk, pretending it was a tightrope.",
            "sent4": "Her words created frostlines in their relationship, freezing any warmth between them.",
            "sent5": "The artist painted the frostlines on the canvas, capturing the beauty of winter."
        },
        {
            "definition": "A line marking the limit of frost penetration in soil.",
            "pos": "noun",
            "sent1": "The farmer checked the frostlines in the soil to see how deep the frost had gone.",
            "sent2": "The map showed the frostlines in the ground, helping builders avoid frozen areas.",
            "sent3": "The kids played hopscotch, using the frostlines as boundaries for their game.",
            "sent4": "The frostlines in the earth were like nature's warning of the approaching winter.",
            "sent5": "The scientist studied the frostlines to understand the soil's freezing patterns."
        },
        {
            "definition": "A line indicating the level to which frost penetrates the ground.",
            "pos": "noun",
            "sent1": "The hiker noticed the frostlines on the rocks, showing how high the frost reached.",
            "sent2": "The gardeners marked the frostlines to know where to plant frost-resistant flowers.",
            "sent3": "The detective followed the frostlines in the dirt, hoping they would lead to a clue.",
            "sent4": "The frostlines in the ground were like icy tattoos left by winter's touch.",
            "sent5": "The frostlines on the pavement revealed the cold grip of the season."
        }
    ]
}