{
    "term": "frugally",
    "meanings": [
        {
            "definition": "In a thrifty or economical manner.",
            "pos": "adverb",
            "sent1": "She managed her budget frugally, always looking for the best deals.",
            "sent2": "He lived frugally, saving money by cooking at home instead of eating out.",
            "sent3": "The family joked that Grandma shopped so frugally, she could make a dollar stretch for miles.",
            "sent4": "The wise old owl advised the young birds to spend their resources frugally, like saving up shiny pebbles for a rainy day.",
            "sent5": "The squirrel stored nuts frugally, burying them in different spots to ensure a winter supply."
        },
        {
            "definition": "Using money or resources sparingly.",
            "pos": "adjective",
            "sent1": "She was known for her frugally planned trips, always finding the most affordable accommodations.",
            "sent2": "The frugally designed car was fuel-efficient and cost-effective.",
            "sent3": "The frugally decorated room had a minimalist charm, with simple yet elegant furnishings.",
            "sent4": "The frugally built house used recycled materials, showcasing a commitment to sustainability.",
            "sent5": "The frugally managed company thrived during economic downturns, thanks to its efficient resource allocation."
        },
        {
            "definition": "Showing care and concern for how money is spent.",
            "pos": "adjective",
            "sent1": "His frugally planned wedding was a beautiful celebration without breaking the bank.",
            "sent2": "She admired her friend's frugally chosen gifts, appreciating the thoughtfulness behind each one.",
            "sent3": "The frugally minded couple enjoyed finding joy in simple pleasures, like picnics in the park.",
            "sent4": "The frugally minded shopper carefully compared prices before making any purchase, ensuring every penny was well spent.",
            "sent5": "The frugally managed charity made sure that every donation was used effectively to help those in need."
        }
    ]
}