{
    "term": "fudging",
    "meanings": [
        {
            "definition": "Altering or manipulating in a deceptive way",
            "pos": "adjective",
            "sent1": "The fudging salesperson made false promises to customers.",
            "sent2": "She gave a fudging answer to avoid admitting the mistake.",
            "sent3": "The fudging magician pretended to pull a rabbit out of an empty hat.",
            "sent4": "His fudging smile hid his true feelings of disappointment.",
            "sent5": "The fudging disguise fooled everyone at the party."
        },
        {
            "definition": "Using euphemistic language to avoid telling the truth",
            "pos": "adjective",
            "sent1": "The fudging politician carefully chose his words to mislead the public.",
            "sent2": "She used fudging phrases to soften the impact of her criticism.",
            "sent3": "The fudging excuse for being late was that the traffic was unusually heavy.",
            "sent4": "Her fudging apology seemed insincere to those who knew the truth.",
            "sent5": "The fudging explanation confused rather than clarified the situation."
        },
        {
            "definition": "Making minor changes or adjustments to something",
            "pos": "verb",
            "sent1": "He was fudging the numbers to make the report look better.",
            "sent2": "She was fudging the details of her story to make it more interesting.",
            "sent3": "The chef was fudging the recipe by adding a pinch of extra spice.",
            "sent4": "The artist was fudging the painting by blending different colors together.",
            "sent5": "The student was fudging the margins to fit more text on the page."
        },
        {
            "definition": "Acting in a dishonest or deceitful manner",
            "pos": "adjective",
            "sent1": "The fudging contractor overcharged for the repairs.",
            "sent2": "He had a fudging smile that made others suspicious of his intentions.",
            "sent3": "The fudging fox tried to trick the other animals in the forest.",
            "sent4": "Her fudging behavior at work eventually caught up with her.",
            "sent5": "The fudging character in the movie was always up to no good."
        }
    ]
}