{
    "term": "fuellers",
    "meanings": [
        {
            "definition": "A person or thing that supplies fuel.",
            "pos": "noun",
            "sent1": "The fuellers at the gas station keep the pumps full for customers.",
            "sent2": "The fuellers on the aircraft carrier ensure the planes have enough fuel for their missions.",
            "sent3": "The fuellers in the forest were busy gathering firewood to keep the campfire burning.",
            "sent4": "The sun can be seen as the ultimate fuellers of life on Earth, providing energy for all living things.",
            "sent5": "In the winter, the birds become the little fuellers of warmth by fluffing up their feathers for insulation."
        },
        {
            "definition": "A person who operates a fuel pump.",
            "pos": "noun",
            "sent1": "The fuellers at the gas station help customers fill up their vehicles with gas.",
            "sent2": "The aircraft fuellers work long hours to ensure all planes are ready for takeoff.",
            "sent3": "The little girl pretended to be a fueller, 'filling up' her toy car with imaginary gas.",
            "sent4": "The fueller at the race track pumped gas into the high-performance cars with precision and speed.",
            "sent5": "The fueller's job requires a steady hand and good attention to detail to avoid spills."
        },
        {
            "definition": "A fuel tank or container.",
            "pos": "noun",
            "sent1": "The airplane's fuellers were checked to make sure they were securely fastened before takeoff.",
            "sent2": "The fuellers on the farm were used to store excess gasoline for the tractors.",
            "sent3": "The children used an old barrel as a fueller for their pretend spaceship, imagining it was full of rocket fuel.",
            "sent4": "The fueller on the boat was filled to the brim with diesel for the long journey ahead.",
            "sent5": "The fueller in the garage was labeled clearly to avoid any mix-ups with other liquids."
        }
    ]
}