{
    "term": "fuguelike",
    "meanings": [
        {
            "definition": "Resembling a fugue in structure or style.",
            "pos": "adjective",
            "sent1": "The music had a fuguelike pattern that repeated throughout the piece.",
            "sent2": "Her writing had a fuguelike complexity that captivated the readers.",
            "sent3": "The artist painted a fuguelike mural with intricate patterns and harmonious colors.",
            "sent4": "The city skyline at night looked fuguelike, with lights dancing in a synchronized rhythm.",
            "sent5": "The garden was arranged in a fuguelike design, with plants weaving in and out like musical notes."
        },
        {
            "definition": "In a manner characteristic of a fugue.",
            "pos": "adverb",
            "sent1": "The pianist played the piece fuguelike, transitioning smoothly between themes.",
            "sent2": "She moved fuguelike through the crowded room, gracefully avoiding obstacles.",
            "sent3": "The chef cooked the dish fuguelike, carefully layering flavors in perfect harmony.",
            "sent4": "The dancers moved across the stage fuguelike, each step echoing the other in a mesmerizing dance.",
            "sent5": "The clouds drifted across the sky fuguelike, forming intricate patterns in the sunset."
        },
        {
            "definition": "Having the qualities of a fugue.",
            "pos": "adjective",
            "sent1": "The professor's lecture had a fuguelike structure, with themes interwoven seamlessly.",
            "sent2": "The novel had a fuguelike plot, with multiple storylines converging in a harmonious way.",
            "sent3": "The garden had a fuguelike beauty, with flowers blooming in perfect synchronization.",
            "sent4": "The city had a fuguelike atmosphere, with different cultures blending together like musical motifs.",
            "sent5": "The painting had a fuguelike complexity, with layers of meaning waiting to be discovered."
        }
    ]
}