{
    "term": "fulgurated",
    "meanings": [
        {
            "definition": "To flash or shine brightly",
            "pos": "verb",
            "sent1": "The fireworks fulgurated in the night sky, dazzling everyone below.",
            "sent2": "The lighthouse fulgurated, guiding ships safely to shore.",
            "sent3": "The disco ball fulgurated like a mini galaxy, adding a touch of magic to the party.",
            "sent4": "Her smile fulgurated with joy, lighting up the room.",
            "sent5": "The diamond necklace fulgurated under the spotlight, catching everyone's attention."
        },
        {
            "definition": "To emit flashes of lightning",
            "pos": "verb",
            "sent1": "During the storm, the dark clouds fulgurated with lightning, illuminating the sky.",
            "sent2": "The thunderstorm fulgurated with intense bolts of lightning, striking fear into the hearts of the villagers.",
            "sent3": "The mischievous child claimed the lightning fulgurated from their fingertips, pretending to be a superhero.",
            "sent4": "The anger in his eyes fulgurated like lightning, warning others to stay away.",
            "sent5": "The sudden flash of lightning fulgurated across the horizon, painting the night in a brief glow."
        },
        {
            "definition": "To undergo a surgical procedure using a high-frequency electric current",
            "pos": "verb",
            "sent1": "The patient fulgurated during the delicate surgery, as the electric current carefully targeted the affected area.",
            "sent2": "The medical team fulgurated the tumor with precision, ensuring a successful procedure.",
            "sent3": "The robotic arm fulgurated with accuracy, assisting the surgeon in the complex operation.",
            "sent4": "The advanced technology fulgurated through the patient's body, removing the harmful growth.",
            "sent5": "The innovative technique fulgurated the problem away, leaving the patient relieved and grateful."
        }
    ]
}