{
    "term": "fulled",
    "meanings": [
        {
            "definition": "To shrink and thicken (woolen cloth) by moistening, heating, and pressing.",
            "pos": "verb",
            "sent1": "She fulled the woolen cloth to make it smaller and thicker.",
            "sent2": "The tailor fulled the fabric to give it a denser texture.",
            "sent3": "After she fulled the cloth, it looked like a cozy blanket.",
            "sent4": "The process of fulling the fabric transformed it into a warm, dense material.",
            "sent5": "The wool was fulled until it became a sturdy, compact fabric."
        },
        {
            "definition": "To make (cloth) denser and firmer by soaking, beating, and pressing.",
            "pos": "verb",
            "sent1": "He fulled the cloth by soaking it in water and pressing it firmly.",
            "sent2": "The traditional method of fulling cloth involved beating and pressing it.",
            "sent3": "The tailor fulled the fabric until it felt like a thick, sturdy material.",
            "sent4": "The fulling process turned the cloth into a dense, firm textile.",
            "sent5": "The fabric was fulled to create a strong, durable material."
        },
        {
            "definition": "To gather or pleat (fabric) by stitching it down tightly.",
            "pos": "verb",
            "sent1": "She fulled the fabric by stitching it tightly to create pleats.",
            "sent2": "The dressmaker fulled the fabric to gather it into elegant pleats.",
            "sent3": "The way she fulled the fabric made the dress look beautifully pleated.",
            "sent4": "The fulling technique resulted in perfectly stitched pleats on the fabric.",
            "sent5": "The fabric was fulled with precision to create neat, tight pleats."
        },
        {
            "definition": "To become fulled.",
            "pos": "verb",
            "sent1": "The wool began to full as it was exposed to moisture and heat.",
            "sent2": "Over time, the fabric will full naturally to achieve a denser texture.",
            "sent3": "The cloth seemed to full on its own, becoming thicker and more compact.",
            "sent4": "As the material aged, it started to full and develop a firmer feel.",
            "sent5": "The fabric will full gradually, resulting in a tighter weave."
        }
    ]
}