{
    "term": "fumbled",
    "meanings": [
        {
            "definition": "To handle clumsily or awkwardly",
            "pos": "verb",
            "sent1": "She fumbled with the keys, trying to unlock the door.",
            "sent2": "He fumbled with the puzzle pieces, struggling to put them together.",
            "sent3": "During the play, the actor fumbled with his lines, causing laughter in the audience.",
            "sent4": "In the dark room, she fumbled like a blindfolded person searching for a light switch.",
            "sent5": "The nervous student fumbled through the exam, dropping his pen multiple times."
        },
        {
            "definition": "To make a mess of; bungle",
            "pos": "verb",
            "sent1": "The chef fumbled the recipe, adding salt instead of sugar.",
            "sent2": "She fumbled the presentation, forgetting key points.",
            "sent3": "The magician fumbled his trick, making the rabbit disappear into his hat.",
            "sent4": "The team fumbled the game plan, leading to a chaotic match.",
            "sent5": "He fumbled the interview, stumbling over his words and losing his train of thought."
        },
        {
            "definition": "To grope awkwardly or uncertainly",
            "pos": "verb",
            "sent1": "She fumbled in her bag, searching for her phone without success.",
            "sent2": "He fumbled in the dark, trying to find the light switch.",
            "sent3": "The child fumbled in the toy box, looking for his favorite toy.",
            "sent4": "The explorer fumbled in the cave, feeling the walls for a way out.",
            "sent5": "The detective fumbled in the suspect's pockets, hoping to find a clue."
        },
        {
            "definition": "To drop or mishandle a ball, object, or opportunity",
            "pos": "verb",
            "sent1": "He fumbled the football, causing the opposing team to recover it.",
            "sent2": "She fumbled the glass, almost dropping it on the floor.",
            "sent3": "The student fumbled the chance to ask a question during the lecture.",
            "sent4": "The musician fumbled the note, creating a discordant sound.",
            "sent5": "The politician fumbled the opportunity to address the pressing issue, losing support from the public."
        }
    ]
}