{
    "term": "fundamentalists",
    "meanings": [
        {
            "definition": "A person who believes in the strict, literal interpretation of religious texts.",
            "pos": "noun",
            "sent1": "The fundamentalists in our community attend church every Sunday without fail.",
            "sent2": "The fundamentalists at the mosque follow the teachings of the Quran closely.",
            "sent3": "The fundamentalists organized a bake sale to raise funds for their church.",
            "sent4": "Her dedication to the cause made her stand out like a fundamentalist in a crowd of doubters.",
            "sent5": "The image of the fundamentalists praying together left a lasting impression on me."
        },
        {
            "definition": "A member of a religious movement characterized by a strict adherence to fundamental beliefs.",
            "pos": "noun",
            "sent1": "The fundamentalists in the congregation always wore traditional attire.",
            "sent2": "The fundamentalists in the monastery followed a strict daily routine.",
            "sent3": "The fundamentalists decided to have a picnic to celebrate their unity.",
            "sent4": "His commitment to the cause was as unwavering as a fundamentalist's faith.",
            "sent5": "The fundamentalists' dedication to their beliefs was evident in their actions."
        },
        {
            "definition": "A person who is uncompromising in their beliefs or principles.",
            "pos": "noun",
            "sent1": "The fundamentalists refused to change their stance on the issue.",
            "sent2": "The fundamentalists stood firm in their convictions despite opposition.",
            "sent3": "The fundamentalists' stubbornness sometimes led to misunderstandings.",
            "sent4": "Her determination was as strong as that of a fundamentalist defending their faith.",
            "sent5": "The fundamentalists' unwavering dedication inspired others to stay true to their values."
        }
    ]
}