{
    "term": "funerary",
    "meanings": [
        {
            "definition": "relating to or associated with a funeral",
            "pos": "adjective",
            "sent1": "The somber music played during the funerary procession was deeply moving.",
            "sent2": "The family gathered to mourn at the funerary service for their loved one.",
            "sent3": "The funerary flowers accidentally ended up at the wrong address, causing confusion.",
            "sent4": "The dark clouds in the sky seemed to form a funerary canopy over the cemetery.",
            "sent5": "The priest's words at the funerary ceremony echoed through the silent chapel."
        },
        {
            "definition": "of or relating to the burial of the dead",
            "pos": "adjective",
            "sent1": "The ancient tomb was filled with funerary artifacts and treasures.",
            "sent2": "The archaeologists discovered a hidden chamber filled with funerary inscriptions.",
            "sent3": "The children played a game pretending to be funerary guardians of a mystical realm.",
            "sent4": "The moon cast a funerary glow over the graveyard, creating an eerie atmosphere.",
            "sent5": "The historian studied the funerary practices of different cultures throughout history."
        },
        {
            "definition": "pertaining to the ceremonies or rites used in connection with burial",
            "pos": "adjective",
            "sent1": "The priest performed the funerary rituals with solemnity and reverence.",
            "sent2": "The traditional funerary customs varied greatly between different regions.",
            "sent3": "The comedian joked about the funerary traditions in a lighthearted manner.",
            "sent4": "The ancient civilization had elaborate funerary ceremonies to honor their ancestors.",
            "sent5": "The intricate funerary masks were believed to guide the spirits to the afterlife."
        }
    ]
}