{
    "term": "fungible",
    "meanings": [
        {
            "definition": "Able to be replaced or exchanged by another identical item.",
            "pos": "adjective",
            "sent1": "The toy cars were fungible, so the children could easily swap them.",
            "sent2": "In the game, players can trade their fungible resources for different ones.",
            "sent3": "The fungible puzzle pieces magically transformed into different shapes when swapped.",
            "sent4": "Her thoughts were as fungible as water, flowing from one idea to the next effortlessly.",
            "sent5": "The fungible keys opened multiple doors, each leading to a new adventure."
        },
        {
            "definition": "Interchangeable or replaceable.",
            "pos": "adjective",
            "sent1": "The batteries in the remote control were fungible, so any brand would work.",
            "sent2": "The fungible parts of the machine could easily be switched out for new ones.",
            "sent3": "His socks were so fungible that he often wore mismatched pairs without noticing.",
            "sent4": "Their friendship was as fungible as a deck of cards, easily shuffled and redistributed.",
            "sent5": "The fungible ingredients in the recipe allowed for easy substitutions without altering the taste."
        },
        {
            "definition": "Easily exchangeable or interchangeable.",
            "pos": "adjective",
            "sent1": "The fungible tokens in the game could be traded for various rewards.",
            "sent2": "Currency is fungible, meaning you can exchange one bill for another of the same value.",
            "sent3": "The fungible paint colors blended together to create a beautiful masterpiece.",
            "sent4": "Her emotions were as fungible as the changing seasons, always in flux.",
            "sent5": "The fungible tickets could be used for entry to any of the attractions in the park."
        }
    ]
}