{
    "term": "funking",
    "meanings": [
        {
            "definition": "To emit a strong, offensive odor.",
            "pos": "verb",
            "sent1": "After playing outside all day, the dog came in funk-ing up the whole room.",
            "sent2": "The garbage left in the sun was funk-ing terribly by the time it was collected.",
            "sent3": "The smelly cheese was funk-ing up the fridge, making everyone hold their noses.",
            "sent4": "The old shoes funk-ing in the closet reminded her of the long hike they took.",
            "sent5": "The dirty socks funk-ing in the laundry basket were unbearable to be near."
        },
        {
            "definition": "A state of fear or panic.",
            "pos": "noun",
            "sent1": "She felt a sense of funk-ing when she heard a strange noise in the dark.",
            "sent2": "The loud thunderstorm outside put the whole town in a state of funk-ing.",
            "sent3": "His fear of spiders put him in a funk-ing whenever he saw one.",
            "sent4": "The horror movie left her in a state of funk-ing for the rest of the night.",
            "sent5": "The haunted house tour put everyone in a state of funk-ing as they walked through."
        },
        {
            "definition": "A style of music characterized by a strong rhythm and improvisation.",
            "pos": "noun",
            "sent1": "The band played funky music that had everyone funk-ing on the dance floor.",
            "sent2": "The nightclub was filled with people enjoying the funky beats and funk-ing along.",
            "sent3": "The jazz club always had a great funk-ing vibe that drew in a diverse crowd.",
            "sent4": "The music festival featured various genres, but the funk-ing bands stole the show.",
            "sent5": "The radio station played non-stop funk-ing tunes that kept listeners grooving all day."
        },
        {
            "definition": "To avoid doing something out of fear or laziness.",
            "pos": "verb",
            "sent1": "He kept funk-ing his homework, hoping the teacher wouldn't notice.",
            "sent2": "She was funk-ing the difficult conversation with her friend because she was nervous.",
            "sent3": "The cat was funk-ing going outside in the rain, preferring to stay dry indoors.",
            "sent4": "They were funk-ing the challenging hike, choosing to relax at home instead.",
            "sent5": "The student was funk-ing studying for the test, procrastinating until the last minute."
        }
    ]
}