{
    "term": "fussed",
    "meanings": [
        {
            "definition": "Show unnecessary or excessive concern or worry.",
            "pos": "verb",
            "sent1": "She fussed over every little detail of the party, making sure everything was perfect.",
            "sent2": "The mother fussed over her child, constantly checking if they were warm enough.",
            "sent3": "He fussed about the weather forecast for the picnic, afraid it might rain.",
            "sent4": "The cat fussed over its food, refusing to eat anything but fresh tuna.",
            "sent5": "Grandma fussed over her garden, tending to each plant with care and attention."
        },
        {
            "definition": "Be agitated or make a fuss.",
            "pos": "verb",
            "sent1": "The toddler fussed when his toy was taken away, crying loudly.",
            "sent2": "The dog fussed at the mailman, barking and growling.",
            "sent3": "She fussed over her messy hair, trying to tame it with a brush.",
            "sent4": "The engine fussed before finally starting, sputtering and coughing.",
            "sent5": "The students fussed in the cafeteria, excitedly discussing the upcoming school dance."
        },
        {
            "definition": "Complain or argue about something in a petty or irritating way.",
            "pos": "verb",
            "sent1": "He fussed about the new office seating arrangement, claiming his chair was too close to the window.",
            "sent2": "The customer fussed about the service at the restaurant, demanding to speak to the manager.",
            "sent3": "She fussed over the price of the dress, haggling with the salesperson for a discount.",
            "sent4": "The siblings fussed over who would get the last piece of cake, each claiming they deserved it more.",
            "sent5": "The neighbors fussed about the noise from the party next door, calling the police to complain."
        }
    ]
}