{
    "term": "futility",
    "meanings": [
        {
            "definition": "Pointlessness or uselessness",
            "pos": "noun",
            "sent1": "The futility of arguing with a toddler is evident when they simply repeat 'why' endlessly.",
            "sent2": "The futility of trying to fix a broken toy with tape became clear when it fell apart again.",
            "sent3": "The futility of trying to teach a fish to climb a tree is as obvious as trying to teach a cat to swim.",
            "sent4": "The futility of chasing shadows is like trying to catch the wind in your hands.",
            "sent5": "The futility of watering a plastic plant is a perfect example of wasted effort."
        },
        {
            "definition": "Ineffectiveness or failure",
            "pos": "noun",
            "sent1": "The futility of the old vacuum cleaner was evident when it failed to pick up any dirt.",
            "sent2": "The futility of the leaky bucket was frustrating as it couldn't hold any water.",
            "sent3": "The futility of a broken umbrella is like using a sieve to keep dry in the rain.",
            "sent4": "The futility of a rusted key trying to open a lock is like a silent scream in the dark.",
            "sent5": "The futility of a burnt-out light bulb is as clear as a moonless night."
        },
        {
            "definition": "Lack of success or achievement",
            "pos": "noun",
            "sent1": "The futility of the team's efforts was evident when they lost every game in the season.",
            "sent2": "The futility of the student's attempts to cheat was exposed when they failed the test.",
            "sent3": "The futility of a bird trying to swim is like a fish trying to fly.",
            "sent4": "The futility of a wilted flower trying to bloom is like a dream that never comes true.",
            "sent5": "The futility of a broken compass is like being lost in a maze with no way out."
        }
    ]
}