{
    "term": "gabbards",
    "meanings": [
        {
            "definition": "A type of sheath or scabbard for a sword or dagger.",
            "pos": "noun",
            "sent1": "The knight placed his sword back into the gabbards after the battle.",
            "sent2": "Soldiers often carry their swords in gabbards attached to their belts.",
            "sent3": "The gabbards were like cozy beds for the swords, keeping them safe and snug.",
            "sent4": "The gabbards hung on the wall, resembling silent guardians of the weapons within.",
            "sent5": "The shiny gabbards gleamed in the sunlight, showcasing the swords' beauty."
        },
        {
            "definition": "A type of protective covering for the legs, typically worn by soldiers.",
            "pos": "noun",
            "sent1": "The soldiers wore sturdy gabbards to shield their legs from harm.",
            "sent2": "During the march, the soldiers' gabbards protected them from thorns and branches.",
            "sent3": "The gabbards made the soldiers look like walking fortresses, ready for any danger.",
            "sent4": "The gabbards were like loyal companions, never leaving the soldiers' sides.",
            "sent5": "The soldiers' gabbards were their trusted guardians, defending them in battle."
        },
        {
            "definition": "A type of leather or fabric garment worn by horseback riders to protect their legs.",
            "pos": "noun",
            "sent1": "The equestrian wore sturdy gabbards to shield their legs from branches while riding.",
            "sent2": "The leather gabbards protected the rider's legs from the brush and thorns.",
            "sent3": "The gabbards were like armor for the rider's legs, ensuring a safe journey.",
            "sent4": "The fabric gabbards fluttered in the wind as the rider galloped through the fields.",
            "sent5": "The rider's gabbards were as essential as the reins, keeping them secure in the saddle."
        }
    ]
}