{
    "term": "gag",
    "meanings": [
        {
            "definition": "A device for keeping the mouth open or closed.",
            "pos": "noun",
            "sent1": "The dentist used a gag to keep the patient's mouth open during the procedure.",
            "sent2": "She removed the gag from the box and examined its design.",
            "sent3": "The clown's oversized gag made everyone laugh at the circus.",
            "sent4": "The old movie had a scene where the villain used a gag to silence the hero.",
            "sent5": "The bright red color of the gag made it easy to spot in the drawer."
        },
        {
            "definition": "To choke or retch.",
            "pos": "verb",
            "sent1": "He started to gag on the strong smell coming from the kitchen.",
            "sent2": "The unpleasant taste made her gag and spit out the food.",
            "sent3": "The comedian pretended to gag on a fake banana peel for a funny skit.",
            "sent4": "The thought of public speaking made her gag with nervousness.",
            "sent5": "The pungent odor of the garbage made him gag as he took out the trash."
        },
        {
            "definition": "A joke or prank.",
            "pos": "noun",
            "sent1": "The kids played a funny gag on their teacher by hiding his chalk.",
            "sent2": "The comedy show was full of hilarious gags that had the audience laughing.",
            "sent3": "The classic gag of the whoopee cushion never fails to make people smile.",
            "sent4": "The birthday card had a silly gag printed inside that made her chuckle.",
            "sent5": "The clown's colorful wig was part of his signature gag during performances."
        },
        {
            "definition": "To prevent someone from speaking.",
            "pos": "verb",
            "sent1": "The kidnapper used a cloth to gag the victim and stop any screams.",
            "sent2": "She had to gag her friend to keep the surprise party a secret.",
            "sent3": "The noisy parrot was gagged during the meeting to avoid interruptions.",
            "sent4": "The villain threatened to gag the witness if they spoke out against him.",
            "sent5": "The teacher had to gag the class clown to maintain order in the classroom."
        }
    ]
}