{
    "term": "gage",
    "meanings": [
        {
            "definition": "A pledge or security for the performance of an act.",
            "pos": "noun",
            "sent1": "He offered his watch as a gage for the borrowed money.",
            "sent2": "The knight left his sword as a gage of his loyalty.",
            "sent3": "The squirrel playfully used a nut as a gage in their game.",
            "sent4": "Her smile was a gage of her happiness.",
            "sent5": "The handshake served as a gage of their agreement."
        },
        {
            "definition": "A challenge or defiance.",
            "pos": "noun",
            "sent1": "The duel was a gage of honor between the two knights.",
            "sent2": "His refusal to back down was a clear gage of his determination.",
            "sent3": "The cat's stare was a playful gage to the dog.",
            "sent4": "Her raised eyebrow was a gage of her skepticism.",
            "sent5": "The storm clouds were a gage of nature's power."
        },
        {
            "definition": "To give as security or assurance.",
            "pos": "verb",
            "sent1": "He decided to gage his car to secure the loan.",
            "sent2": "She gaged her necklace to show her commitment.",
            "sent3": "The child gaged his favorite toy to his friend.",
            "sent4": "The gesture gaged their trust in each other.",
            "sent5": "She gaged her support by attending the event."
        },
        {
            "definition": "To measure the dimensions of something.",
            "pos": "verb",
            "sent1": "The tailor carefully gaged the fabric before cutting.",
            "sent2": "He gaged the room to see if the furniture would fit.",
            "sent3": "The scientist gaged the temperature of the liquid.",
            "sent4": "She gaged the distance to the finish line.",
            "sent5": "The carpenter gaged the wood for the perfect fit."
        }
    ]
}