{
    "term": "gagsters",
    "meanings": [
        {
            "definition": "A person who tells jokes or plays pranks.",
            "pos": "noun",
            "sent1": "The gagsters at the party had everyone laughing with their funny stories.",
            "sent2": "The comedy show was a hit thanks to the talented gagsters on stage.",
            "sent3": "The gagsters decided to prank their friend by hiding fake spiders in his room.",
            "sent4": "Her little brother was a natural gagster, always coming up with clever jokes.",
            "sent5": "The school talent show featured a variety of talented gagsters showcasing their humor."
        },
        {
            "definition": "A group of individuals who engage in comedic performances.",
            "pos": "noun",
            "sent1": "The gagsters rehearsed their skit for the upcoming comedy festival.",
            "sent2": "The improv group was known for their quick wit and hilarious antics as gagsters.",
            "sent3": "The gagsters entertained the audience with their slapstick humor and funny costumes.",
            "sent4": "Being part of a team of gagsters allowed her to explore different styles of comedy.",
            "sent5": "The circus had a talented troupe of gagsters who kept the crowd in stitches with their antics."
        },
        {
            "definition": "To silence or restrain someone by putting something in their mouth.",
            "pos": "verb",
            "sent1": "The kidnappers tried to gag the victim to prevent them from screaming.",
            "sent2": "She had to gagster the noisy parrot by giving it a treat to keep it quiet.",
            "sent3": "He had to gagster his little brother with a candy to stop him from revealing the surprise party.",
            "sent4": "The detective had to gagster the informant to protect their identity.",
            "sent5": "In the movie, the villain would often gagster their captives to keep them from escaping."
        }
    ]
}