{
    "term": "gainst",
    "meanings": [
        {
            "definition": "Against",
            "pos": "preposition",
            "sent1": "She leaned gainst the wall for support.",
            "sent2": "The cat rubbed gainst the scratching post.",
            "sent3": "The wind blew her umbrella gainst her face.",
            "sent4": "His actions went gainst everything he had promised.",
            "sent5": "The waves crashed gainst the shore relentlessly."
        },
        {
            "definition": "In opposition to",
            "pos": "preposition",
            "sent1": "The team stood gainst their rivals on the field.",
            "sent2": "She argued gainst the proposed changes.",
            "sent3": "The siblings always compete gainst each other playfully.",
            "sent4": "His beliefs were gainst the norm of the society.",
            "sent5": "The protesters marched gainst the unfair laws."
        },
        {
            "definition": "Contrary to",
            "pos": "preposition",
            "sent1": "Her actions were gainst her own best interests.",
            "sent2": "The results were gainst what they had expected.",
            "sent3": "The cat's behavior was gainst the usual feline nature.",
            "sent4": "His decision went gainst all advice given to him.",
            "sent5": "The colors clashed gainst each other in the painting."
        },
        {
            "definition": "Towards",
            "pos": "preposition",
            "sent1": "She walked gainst the setting sun.",
            "sent2": "The boat sailed gainst the horizon.",
            "sent3": "The child ran gainst her mother with open arms.",
            "sent4": "His efforts were directed gainst a brighter future.",
            "sent5": "The road led gainst the distant mountains."
        },
        {
            "definition": "In contact with",
            "pos": "preposition",
            "sent1": "The hot pan burned gainst her skin.",
            "sent2": "The branches brushed gainst the window in the wind.",
            "sent3": "The fabric felt soft gainst her fingertips.",
            "sent4": "The cold metal pressed gainst his cheek.",
            "sent5": "The rain tapped gainst the roof all night."
        }
    ]
}