{
    "term": "gall",
    "meanings": [
        {
            "definition": "Bold, impudent behavior",
            "pos": "noun",
            "sent1": "His gall in speaking out of turn surprised everyone.",
            "sent2": "Her gall in challenging the authority was admirable.",
            "sent3": "The squirrel's gall in stealing nuts from the bird feeder was comical.",
            "sent4": "The student's gall to ask for an extension on the deadline was bold.",
            "sent5": "The cat's gall in stealing the dog's bed was quite daring."
        },
        {
            "definition": "Bitterness of spirit; rancor",
            "pos": "noun",
            "sent1": "The gall in her voice was evident as she spoke about the betrayal.",
            "sent2": "His gall towards his former friend was palpable.",
            "sent3": "The gall in his coffee made it undrinkable.",
            "sent4": "The gall between the two rival teams was intense.",
            "sent5": "The gall in her eyes showed the depth of her hurt."
        },
        {
            "definition": "A sore on the skin caused by chafing or rubbing",
            "pos": "noun",
            "sent1": "The hiker developed a painful gall on his heel from the new boots.",
            "sent2": "She applied ointment to soothe the gall on her knee.",
            "sent3": "The gall on his elbow made it difficult to bend his arm.",
            "sent4": "The runner had to stop due to a severe gall on her foot.",
            "sent5": "The baby's cry indicated discomfort from the gall on his neck."
        },
        {
            "definition": "To irritate or annoy greatly",
            "pos": "verb",
            "sent1": "The constant noise began to gall him after a while.",
            "sent2": "Her behavior started to gall her colleagues at work.",
            "sent3": "The repetitive music began to gall the listeners.",
            "sent4": "The delay in the project began to gall the team members.",
            "sent5": "The persistent questions began to gall the teacher during the lesson."
        }
    ]
}