{
    "term": "gallstones",
    "meanings": [
        {
            "definition": "Small, hard deposits that form in the gallbladder.",
            "pos": "noun",
            "sent1": "The doctor explained that gallstones are tiny, solid pieces in the gallbladder.",
            "sent2": "She experienced severe pain due to the presence of gallstones in her gallbladder.",
            "sent3": "The gallstones in the gallbladder played hide and seek during the ultrasound.",
            "sent4": "His anger was like gallstones, hard and unforgiving in his heart.",
            "sent5": "The image of gallstones in the gallbladder stuck in her mind like pebbles in a stream."
        },
        {
            "definition": "A condition characterized by the presence of gallstones in the gallbladder.",
            "pos": "noun",
            "sent1": "The hospital diagnosed her with gallstones after the tests.",
            "sent2": "Living with gallstones in the gallbladder can be uncomfortable.",
            "sent3": "The gallstones in the gallbladder threw a party, causing chaos inside.",
            "sent4": "Her laughter bubbled up, lightening the heaviness of gallstones in her life.",
            "sent5": "The weight of gallstones in the gallbladder felt like a burden she couldn't shake off."
        },
        {
            "definition": "The presence of gallstones in the gallbladder.",
            "pos": "noun",
            "sent1": "The ultrasound confirmed the existence of gallstones in the gallbladder.",
            "sent2": "Dealing with the presence of gallstones in the gallbladder requires medical attention.",
            "sent3": "The gallstones in the gallbladder whispered secrets to each other in the dark.",
            "sent4": "The tension in the room was palpable, like the presence of gallstones in the gallbladder.",
            "sent5": "The sharp pain from the presence of gallstones in the gallbladder made her wince."
        }
    ]
}