{
    "term": "galopades",
    "meanings": [
        {
            "definition": "galopades: a lively dance in triple time",
            "pos": "noun",
            "sent1": "During the school talent show, Sarah performed graceful galopades on stage.",
            "sent2": "The ballroom was filled with couples gracefully dancing galopades to the music.",
            "sent3": "At the family reunion, Grandpa tried to join in the galopades but ended up tripping over his own feet.",
            "sent4": "The dancers moved in perfect harmony, their galopades creating a mesmerizing display of elegance.",
            "sent5": "The ballet performance ended with a stunning finale of synchronized galopades."
        },
        {
            "definition": "galopades: a series of quick, skipping steps or movements",
            "pos": "noun",
            "sent1": "The children played a game of tag, their galopades echoing through the playground.",
            "sent2": "The gymnast's routine included a sequence of agile galopades across the mat.",
            "sent3": "The puppy's excited galopades around the yard brought smiles to everyone's faces.",
            "sent4": "The leaves danced in the wind, their galopades creating a rustling melody.",
            "sent5": "The runner's swift galopades propelled him towards the finish line."
        },
        {
            "definition": "galopades: a fast-paced horse race or competition",
            "pos": "noun",
            "sent1": "The annual county fair featured thrilling galopades that drew large crowds.",
            "sent2": "Spectators cheered as the horses thundered down the track in a fierce galopades.",
            "sent3": "In the movie, the hero's daring escape involved a dramatic galopades on horseback.",
            "sent4": "The jockeys prepared for the intense galopades by training rigorously every day.",
            "sent5": "The champion rider led the galopades from start to finish, crossing the line victoriously."
        }
    ]
}