{
    "term": "galvanises",
    "meanings": [
        {
            "definition": "Shock or excite (someone) into taking action.",
            "pos": "verb",
            "sent1": "The inspiring speech galvanises the audience to stand up for what they believe in.",
            "sent2": "The urgent call for help galvanises the community to come together and support each other.",
            "sent3": "The unexpected plot twist in the movie galvanises the viewers, making them gasp in surprise.",
            "sent4": "The thrilling music galvanises the atmosphere, filling it with energy and excitement.",
            "sent5": "The victorious team's celebration galvanises their fans, creating a sense of unity and pride."
        },
        {
            "definition": "Coat (iron or steel) with a protective layer of zinc.",
            "pos": "verb",
            "sent1": "The factory galvanises the metal parts to prevent rusting and corrosion.",
            "sent2": "The construction workers galvanise the steel beams before assembling them to ensure durability.",
            "sent3": "The artist decides to galvanise the sculpture with a shiny zinc finish for a modern look.",
            "sent4": "The engineer carefully galvanises the iron bridge to protect it from the harsh weather conditions.",
            "sent5": "The maintenance crew galvanises the fence surrounding the property to extend its lifespan."
        },
        {
            "definition": "Cause (a metal) to become coated with a protective layer of zinc.",
            "pos": "verb",
            "sent1": "The chemical process galvanises the metal, making it more resistant to rust.",
            "sent2": "The specialized equipment galvanises the components, ensuring their longevity.",
            "sent3": "The innovative technique galvanises the metal surface, enhancing its appearance and durability.",
            "sent4": "The expert craftsman galvanises the intricate metalwork, preserving its beauty for years to come.",
            "sent5": "The automated system galvanises the metal sheets with precision and efficiency."
        }
    ]
}