{
    "term": "galvanoscope",
    "meanings": [
        {
            "definition": "An instrument for detecting the presence and direction of an electric current.",
            "pos": "noun",
            "sent1": "The scientist used a galvanoscope to find out if electricity was flowing.",
            "sent2": "The technician relied on the galvanoscope to check the current in the circuit.",
            "sent3": "When the galvanoscope beeped, it was like a tiny electric detective solving a mystery.",
            "sent4": "Her eyes were like a galvanoscope, always able to detect the hidden currents of emotions.",
            "sent5": "The galvanoscope hummed with energy, revealing the secrets of the electric flow."
        },
        {
            "definition": "A device used to measure small electric currents.",
            "pos": "noun",
            "sent1": "The student carefully adjusted the galvanoscope to measure the tiny currents.",
            "sent2": "The engineer calibrated the galvanoscope to accurately read the electric flow.",
            "sent3": "The galvanoscope seemed to whisper the secrets of the minuscule currents passing through.",
            "sent4": "In her hands, the galvanoscope became a magical wand revealing the invisible currents.",
            "sent5": "With the galvanoscope, he could see the invisible dance of electricity in action."
        },
        {
            "definition": "A tool for observing the deflection of a magnetic needle due to an electric current.",
            "pos": "noun",
            "sent1": "The galvanoscope showed the magnetic needle moving in response to the electric current.",
            "sent2": "Using the galvanoscope, she could see the magnetic needle reacting to the electricity.",
            "sent3": "The galvanoscope made the magnetic needle look like a playful puppy chasing the electric current.",
            "sent4": "His mind was a galvanoscope, always noticing the subtle shifts in the magnetic needle of conversation.",
            "sent5": "With the galvanoscope, the invisible forces of electricity became visible through the dancing needle."
        }
    ]
}