{
    "term": "galvanising",
    "meanings": [
        {
            "definition": "Shock or excite (someone), typically into taking action.",
            "pos": "verb",
            "sent1": "The thrilling movie ending was so galvanising that the audience cheered.",
            "sent2": "The motivational speaker's words were galvanising, inspiring everyone to pursue their dreams.",
            "sent3": "The unexpected plot twist in the story was galvanising, making everyone gasp in surprise.",
            "sent4": "Her passionate speech was galvanising, igniting a fire in the hearts of the listeners.",
            "sent5": "The coach's pep talk was galvanising, pushing the team to give their all on the field."
        },
        {
            "definition": "Coat (iron or steel) with a protective layer of zinc.",
            "pos": "verb",
            "sent1": "The workers were galvanising the metal to prevent rusting.",
            "sent2": "The company decided to galvanise the bridge to increase its longevity.",
            "sent3": "The blacksmith was galvanising the gate, ensuring it would withstand the elements.",
            "sent4": "The construction crew was galvanising the beams, adding a shield against corrosion.",
            "sent5": "The engineer recommended galvanising the pipes for better durability."
        },
        {
            "definition": "To stimulate or excite (someone) into action.",
            "pos": "verb",
            "sent1": "The coach's pep talk galvanised the team to victory.",
            "sent2": "The urgent situation galvanised everyone to work together for a solution.",
            "sent3": "The thrilling competition galvanised the crowd, creating an atmosphere of excitement.",
            "sent4": "The inspiring story galvanised the community to come together and help those in need.",
            "sent5": "The passionate speech galvanised the audience, sparking a wave of enthusiasm."
        }
    ]
}