{
    "term": "galvanise",
    "meanings": [
        {
            "definition": "Shock or excite (someone) into taking action.",
            "pos": "verb",
            "sent1": "The inspiring speech managed to galvanise the audience into standing up for what they believed in.",
            "sent2": "The urgent call to action galvanised the community to come together and make a difference.",
            "sent3": "The unexpected plot twist in the movie galvanised the viewers, leaving them on the edge of their seats.",
            "sent4": "The sudden thunderstorm seemed to galvanise the sleepy town into a frenzy of activity.",
            "sent5": "The passionate performance by the singer galvanised the crowd, filling them with energy and enthusiasm."
        },
        {
            "definition": "Coat (iron or steel) with a protective layer of zinc.",
            "pos": "verb",
            "sent1": "The workers carefully galvanised the metal beams to prevent rusting and corrosion.",
            "sent2": "The company decided to galvanise the fence to ensure it would withstand the harsh weather conditions.",
            "sent3": "The old car was lovingly restored, with the owner choosing to galvanise the metal parts for added protection.",
            "sent4": "The blacksmith used a special technique to galvanise the sword, making it both strong and durable.",
            "sent5": "The shipbuilders knew they had to galvanise the hull to keep it safe from the salty sea water."
        },
        {
            "definition": "To stimulate or arouse to activity.",
            "pos": "verb",
            "sent1": "The cheerful music seemed to galvanise the children, who started dancing and playing around.",
            "sent2": "The coach's pep talk before the game galvanised the team, boosting their morale and determination.",
            "sent3": "The smell of freshly baked cookies galvanised the sleepy dog, who suddenly perked up and wagged its tail.",
            "sent4": "The colorful artwork on the walls galvanised the students, inspiring them to create their own masterpieces.",
            "sent5": "The teacher's praise and encouragement galvanised the shy student, giving them the confidence to speak up in class."
        }
    ]
}