{
    "term": "gambet",
    "meanings": [
        {
            "definition": "A chess opening in which a player sacrifices a pawn to gain a positional advantage.",
            "pos": "noun",
            "sent1": "During the gambet, the player gave up a pawn to improve their position on the board.",
            "sent2": "The gambet in chess involves sacrificing a pawn for a better position.",
            "sent3": "The gambet move was like trading a small coin for a shiny gem in the game.",
            "sent4": "Her gambet was a bold maneuver, like a general sacrificing a soldier to win the battle.",
            "sent5": "The gambet in chess is like a risky trade that can lead to victory if played well."
        },
        {
            "definition": "To make a strategic move in order to gain an advantage.",
            "pos": "verb",
            "sent1": "She decided to gambet by sacrificing a piece to outmaneuver her opponent.",
            "sent2": "Players often gambet in chess to surprise their rivals with unexpected moves.",
            "sent3": "He likes to gambet early in the game, making his opponents rethink their strategies.",
            "sent4": "The CEO's decision to gambet on a new market paid off handsomely for the company.",
            "sent5": "In negotiations, sometimes you need to gambet to show strength and secure a better deal."
        },
        {
            "definition": "A type of dance step in ballet.",
            "pos": "noun",
            "sent1": "The ballet instructor demonstrated the gambet, a graceful and elegant dance move.",
            "sent2": "During the performance, the dancers executed a perfect gambet that impressed the audience.",
            "sent3": "The gambet in ballet looked like a swan gliding across the stage with poise.",
            "sent4": "Her gambet was so fluid and precise, it seemed like she was floating on air.",
            "sent5": "The gambet added a touch of sophistication to the ballet routine, captivating everyone's attention."
        }
    ]
}