{
    "term": "game",
    "meanings": [
        {
            "definition": "An activity engaged in for amusement or fun.",
            "pos": "noun",
            "sent1": "Playing a game with friends is always fun.",
            "sent2": "Let's play a game of tag in the park.",
            "sent3": "The children's laughter filled the room as they played their game.",
            "sent4": "Life is like a game, full of twists and turns.",
            "sent5": "The game of hide and seek brought joy to the kids."
        },
        {
            "definition": "A competitive activity or sport played according to rules.",
            "pos": "noun",
            "sent1": "Soccer is a popular game around the world.",
            "sent2": "The championship game will be intense.",
            "sent3": "The game ended in a tie, much to the players' surprise.",
            "sent4": "In the game of chess, strategy is key to winning.",
            "sent5": "The game of basketball requires teamwork and skill."
        },
        {
            "definition": "A single portion of play in a competitive activity or sport.",
            "pos": "noun",
            "sent1": "She scored a goal in the first game of the match.",
            "sent2": "The final game of the tournament will determine the winner.",
            "sent3": "During the game, the crowd cheered loudly for their team.",
            "sent4": "Every move in the game of tennis is crucial.",
            "sent5": "The game was tied until the last minute of play."
        },
        {
            "definition": "A wild animal pursued for sport or food.",
            "pos": "noun",
            "sent1": "The hunters tracked the game through the forest.",
            "sent2": "Deer are a common game for hunters in this area.",
            "sent3": "The game eluded the hunters, disappearing into the woods.",
            "sent4": "The game was swift and elusive, making it a challenging hunt.",
            "sent5": "Hunting game requires patience and skill."
        }
    ]
}