{
    "term": "gamesmanship",
    "meanings": [
        {
            "definition": "The practice of using tactics or strategies to gain an advantage in a game or competition.",
            "pos": "noun",
            "sent1": "His gamesmanship in chess tournaments always impressed his opponents.",
            "sent2": "She relied on her gamesmanship to win the tennis match.",
            "sent3": "The young boy's gamesmanship in hide-and-seek made him the champion of the neighborhood.",
            "sent4": "Her gamesmanship in negotiations was like a skilled magician performing tricks.",
            "sent5": "The coach's gamesmanship was so sharp that it felt like he could predict every move."
        },
        {
            "definition": "The art of winning games or contests by using clever or cunning methods.",
            "pos": "noun",
            "sent1": "The magician's gamesmanship amazed the audience during the magic show.",
            "sent2": "He used his gamesmanship to outsmart his opponents in the board game.",
            "sent3": "The squirrel's gamesmanship in gathering nuts was truly impressive.",
            "sent4": "Her gamesmanship in solving puzzles was like a masterful painter creating a masterpiece.",
            "sent5": "The detective's gamesmanship in solving cases was unmatched in the city."
        },
        {
            "definition": "The skill or ability to manipulate or outwit opponents in a competitive situation.",
            "pos": "noun",
            "sent1": "His gamesmanship in debates always made him stand out as a strong contender.",
            "sent2": "She used her gamesmanship to navigate through the challenges of the obstacle course.",
            "sent3": "The cat's gamesmanship in catching mice was both impressive and amusing.",
            "sent4": "His gamesmanship in business was like a skilled archer hitting the bullseye every time.",
            "sent5": "The spy's gamesmanship in gathering information was crucial for the success of the mission."
        }
    ]
}