{
    "term": "games",
    "meanings": [
        {
            "definition": "An activity engaged in for amusement or recreation.",
            "pos": "noun",
            "sent1": "Playing games with friends is a fun way to spend time together.",
            "sent2": "Children often play games like tag or hide-and-seek during recess.",
            "sent3": "The family picnic turned into a series of silly games that had everyone laughing.",
            "sent4": "Life is like a game where the rules are always changing, and you have to adapt to win.",
            "sent5": "Her laughter filled the room as she joined in the game of charades."
        },
        {
            "definition": "A competitive activity or sport played according to rules.",
            "pos": "noun",
            "sent1": "The basketball team practiced hard to improve their skills for the upcoming games.",
            "sent2": "Fans eagerly awaited the championship game between the two rival teams.",
            "sent3": "The intense game of chess between the siblings ended in a surprising checkmate.",
            "sent4": "Life can sometimes feel like a game of chess, where every move counts towards your goal.",
            "sent5": "The Olympic Games bring together athletes from around the world to compete in various sports."
        },
        {
            "definition": "A single portion of play forming a scoring unit in a match, especially in tennis.",
            "pos": "noun",
            "sent1": "She won the first game of the set with a powerful serve that her opponent couldn't return.",
            "sent2": "In tennis, a player must win at least four points to win a game.",
            "sent3": "The tennis match was so close that every game felt like a crucial moment.",
            "sent4": "Life's challenges can be seen as individual games that we must overcome to succeed.",
            "sent5": "The final game of the tournament was filled with tension as both players fought for victory."
        }
    ]
}