{
    "term": "gangster",
    "meanings": [
        {
            "definition": "A member of a gang, especially a criminal organization.",
            "pos": "noun",
            "sent1": "The gangster was arrested for his involvement in the criminal organization.",
            "sent2": "The police were on the lookout for the gangster who was known to be part of a criminal group.",
            "sent3": "The gangster tried to sneak away from the police, but his bright red shoes gave him away.",
            "sent4": "The gangster's influence in the criminal underworld was like a shadow that loomed over the city.",
            "sent5": "The image of the gangster with a fedora and a cigar is a classic symbol of organized crime."
        },
        {
            "definition": "A person who engages in organized crime or illegal activities.",
            "pos": "noun",
            "sent1": "The gangster was caught smuggling illegal goods across the border.",
            "sent2": "The city was plagued by gangsters who were involved in organized crime.",
            "sent3": "The gangster's attempt to rob the bank was foiled by a group of elderly ladies.",
            "sent4": "The gangster's charm masked his true intentions of engaging in illegal activities.",
            "sent5": "The gangster's hideout was like a fortress, well-guarded and secretive."
        },
        {
            "definition": "A person who is part of a group that engages in criminal behavior.",
            "pos": "noun",
            "sent1": "The gangster was known to be part of a group that committed petty thefts in the neighborhood.",
            "sent2": "The police were rounding up gangsters who were involved in various criminal activities.",
            "sent3": "The gangster's attempt to steal a candy bar from the store ended in embarrassment.",
            "sent4": "The gangster's loyalty to his criminal group was unwavering, even in the face of danger.",
            "sent5": "The neighborhood was wary of the gangster and his associates, known for their mischief."
        }
    ]
}