{
    "term": "gaping",
    "meanings": [
        {
            "definition": "Wide open",
            "pos": "adjective",
            "sent1": "The gaping hole in the wall let in a lot of light.",
            "sent2": "The cave entrance was gaping, inviting us to explore its depths.",
            "sent3": "The gaping mouth of the cave seemed to whisper secrets to those who dared to enter.",
            "sent4": "Her gaping eyes revealed her surprise at the unexpected gift.",
            "sent5": "The gaping wound on the soldier's arm needed immediate attention."
        },
        {
            "definition": "Staring with the mouth open in wonder or surprise",
            "pos": "verb",
            "sent1": "The child was gaping at the magician's tricks with wide eyes.",
            "sent2": "The audience was gaping in amazement at the acrobat's daring performance.",
            "sent3": "As the clown juggled, the audience couldn't help but gaping in amusement.",
            "sent4": "She found herself gaping at the breathtaking sunset over the horizon.",
            "sent5": "The students were gaping at the teacher's unexpected dance moves."
        },
        {
            "definition": "To be wide open",
            "pos": "verb",
            "sent1": "The door was gaping, revealing a glimpse of the room inside.",
            "sent2": "The treasure chest was gaping, tempting the pirates with its contents.",
            "sent3": "The suitcase lay gaping on the floor, waiting to be packed for the trip.",
            "sent4": "The book lay open on the table, its pages gaping in the breeze.",
            "sent5": "The window was left gaping, letting in the cool evening air."
        },
        {
            "definition": "To open widely",
            "pos": "verb",
            "sent1": "The flower was gaping towards the sun, soaking in its warmth.",
            "sent2": "The lion yawned, gaping widely to show its sharp teeth.",
            "sent3": "The umbrella suddenly inverted, gaping open in the strong wind.",
            "sent4": "The old chest creaked open, its lid gaping to reveal hidden treasures.",
            "sent5": "The bird's beak was gaping as it chirped loudly in the morning."
        }
    ]
}