{
    "term": "gargoyled",
    "meanings": [
        {
            "definition": "Adorned with gargoyles.",
            "pos": "adjective",
            "sent1": "The old mansion had a gargoyled roof, with stone creatures perched on every corner.",
            "sent2": "The cathedral's gargoyled facade was both eerie and fascinating.",
            "sent3": "The gargoyled fountain in the park seemed to come alive at night, scaring away the pigeons.",
            "sent4": "Her face, twisted in a gargoyled expression, made her the perfect actress for horror movies.",
            "sent5": "The gargoyled statues on the building's exterior made it stand out from the rest of the street."
        },
        {
            "definition": "Having the appearance of a gargoyle.",
            "pos": "adjective",
            "sent1": "The little dog's gargoyled face made him look like a tiny protector of the house.",
            "sent2": "The eerie mask had a gargoyled look that sent shivers down her spine.",
            "sent3": "The child's attempt at a gargoyled expression during the game of charades was both hilarious and adorable.",
            "sent4": "The ancient tree, with its twisted branches, had a gargoyled silhouette against the moonlit sky.",
            "sent5": "The shadowy figure in the alley had a gargoyled stance, ready to pounce at any moment."
        },
        {
            "definition": "Decorated with grotesque figures.",
            "pos": "adjective",
            "sent1": "The theater's gargoyled stage set the perfect mood for the dark play about to unfold.",
            "sent2": "The haunted house was filled with gargoyled decorations that made visitors jump in fright.",
            "sent3": "The cake at the Halloween party was a gargoyled masterpiece, with edible monsters crawling all over it.",
            "sent4": "The artist's latest painting was a gargoyled masterpiece, with twisted faces leering from every corner.",
            "sent5": "The costume designer created a gargoyled outfit that made the model look like a living nightmare."
        }
    ]
}