{
    "term": "garring",
    "meanings": [
        {
            "definition": "To cause distress or discomfort",
            "pos": "verb",
            "sent1": "The loud noise from the construction site was garring to the residents.",
            "sent2": "The sad news about the accident garring everyone in the neighborhood.",
            "sent3": "The constant barking of the neighbor's dog was garring but also a bit funny.",
            "sent4": "The sudden change in weather garring our plans like a thunderstorm on a sunny day.",
            "sent5": "The eerie silence after the storm was garring, leaving us uneasy."
        },
        {
            "definition": "To argue or dispute",
            "pos": "verb",
            "sent1": "The siblings were garring over who gets to use the computer first.",
            "sent2": "The politicians garring about the new policy in the debate.",
            "sent3": "The two friends playfully garring about which movie to watch.",
            "sent4": "The lawyers garring in the courtroom like two fierce lions.",
            "sent5": "The students garring over the answer to the math problem, each sure they were right."
        },
        {
            "definition": "To make a harsh sound",
            "pos": "verb",
            "sent1": "The old door garring loudly every time it was opened.",
            "sent2": "The thunder garring in the distance, signaling an approaching storm.",
            "sent3": "The rusty gate garring as it was pushed open, sounding like a tired old man.",
            "sent4": "The engine of the car garring as it struggled to start in the cold weather.",
            "sent5": "The metal chains garring against each other in the wind, creating an eerie sound."
        },
        {
            "definition": "To provoke or irritate",
            "pos": "verb",
            "sent1": "His constant teasing was garring to his little sister.",
            "sent2": "The persistent buzzing of the fly garring everyone in the room.",
            "sent3": "The mischievous grin on his face was garring, knowing he was up to something.",
            "sent4": "The bright light shining directly into his eyes garring him like a spotlight.",
            "sent5": "The repetitive tapping on the desk was garring, making it hard to concentrate."
        }
    ]
}