{
    "term": "garroted",
    "meanings": [
        {
            "definition": "To kill someone by strangulation, typically with a cord or wire.",
            "pos": "verb",
            "sent1": "The villain garroted his victim with a rope in the dark alley.",
            "sent2": "The assassin garroted the target silently to avoid detection.",
            "sent3": "The clumsy spy accidentally garroted himself while trying to sneak past the guards.",
            "sent4": "The grip of fear garroted her heart as she faced the menacing figure in the shadows.",
            "sent5": "The memory of the crime scene where the murderer garroted his victim haunted the detective."
        },
        {
            "definition": "To strangle someone with a cord or wire.",
            "pos": "verb",
            "sent1": "She garroted the snake that slithered into her garden to protect her pets.",
            "sent2": "The criminal used a wire to garrot the security guard during the heist.",
            "sent3": "The magician's trick went wrong when he accidentally garroted his assistant on stage.",
            "sent4": "The vines seemed to garrot the old tree, slowly choking its life away.",
            "sent5": "The survival expert demonstrated how to garrot a fish for food in the wilderness."
        },
        {
            "definition": "To execute someone by strangulation, often as a form of punishment.",
            "pos": "verb",
            "sent1": "In ancient times, they would garrot criminals as a harsh form of justice.",
            "sent2": "The tyrant ordered his enemies to be garroted in public to instill fear.",
            "sent3": "The mischievous child joked that he would garrot his brother if he didn't share his toys.",
            "sent4": "The oppressive regime sought to garrot dissenters to maintain control over the population.",
            "sent5": "The historical novel vividly described how rebels were garroted for their defiance against the crown."
        }
    ]
}