{
    "term": "garuda",
    "meanings": [
        {
            "definition": "A large mythical bird-like creature in Hindu and Buddhist mythology.",
            "pos": "noun",
            "sent1": "In the ancient stories, the garuda was known for its immense size and strength.",
            "sent2": "The garuda is often depicted as a majestic and powerful being in mythological tales.",
            "sent3": "When the garuda tried to fly with an elephant in its talons, it realized it bit off more than it could chew!",
            "sent4": "Her determination to succeed soared like a garuda, unstoppable and fierce.",
            "sent5": "The garuda's wingspan was so vast that it cast a shadow over the entire forest."
        },
        {
            "definition": "The national emblem of Indonesia, depicted as a large bird.",
            "pos": "noun",
            "sent1": "The flag proudly displayed the garuda, symbolizing the nation's strength and unity.",
            "sent2": "Tourists often take pictures with the garuda statue as a symbol of their visit to Indonesia.",
            "sent3": "The mischievous child pretended to ride the garuda statue like a magical bird.",
            "sent4": "The garuda emblem stood tall and proud, a representation of Indonesia's rich heritage.",
            "sent5": "The garuda on the flag seemed to come alive, its wings ready to take flight."
        },
        {
            "definition": "A type of large predatory bird found in Southeast Asia.",
            "pos": "noun",
            "sent1": "The garuda swooped down from the sky, its sharp beak aimed at its prey.",
            "sent2": "Local villagers often spot the garuda circling high above the dense jungle.",
            "sent3": "The mischievous monkeys chattered loudly, warning each other of the approaching garuda.",
            "sent4": "The garuda's hunting skills were unmatched, making it the king of the skies in Southeast Asia.",
            "sent5": "The sight of the garuda in flight was both breathtaking and fearsome, a true predator of the skies."
        }
    ]
}