{
    "term": "gaslight",
    "meanings": [
        {
            "definition": "To manipulate someone by psychological means into questioning their own sanity.",
            "pos": "verb",
            "sent1": "The villain tried to gaslight the hero into believing he was the one causing all the trouble.",
            "sent2": "She realized her partner was trying to gaslight her when he denied things she clearly remembered.",
            "sent3": "The mischievous cat tried to gaslight the dog into thinking he had already eaten his dinner.",
            "sent4": "Her constant lies began to gaslight her own mind, making her doubt even her true memories.",
            "sent5": "The gaslighting tactics used by the con artist were so subtle, they almost went unnoticed."
        },
        {
            "definition": "A type of light source that uses gas as fuel.",
            "pos": "noun",
            "sent1": "The old mansion was lit up by the warm glow of gaslight fixtures.",
            "sent2": "In the 19th century, gaslight was a popular choice for indoor lighting.",
            "sent3": "The cozy restaurant recreated a Victorian atmosphere with its flickering gaslight.",
            "sent4": "The eerie streets were dimly lit by the flickering gaslight, casting long shadows.",
            "sent5": "The soft hiss of the gaslight added a nostalgic touch to the room."
        },
        {
            "definition": "To illuminate with gaslight.",
            "pos": "verb",
            "sent1": "The theater stage was beautifully gaslit, creating a magical ambiance for the play.",
            "sent2": "They decided to gaslight the garden party to give it a vintage feel.",
            "sent3": "The prankster secretly gaslit the room, causing confusion among the guests.",
            "sent4": "The artist carefully gaslit the painting, highlighting its intricate details.",
            "sent5": "The street performers gaslit the square, attracting a crowd with their enchanting show."
        }
    ]
}