{
    "term": "gauntry",
    "meanings": [
        {
            "definition": "A framework of steel bars or beams used to support a bridge or crane.",
            "pos": "noun",
            "sent1": "The gauntry held up the heavy bridge with its strong steel bars.",
            "sent2": "The construction workers carefully assembled the gauntry to support the new crane.",
            "sent3": "The mischievous squirrel thought the gauntry was a fun obstacle course to climb on.",
            "sent4": "The gauntry stood tall like a giant spider's web, supporting the weight above.",
            "sent5": "The sunlight glinted off the gauntry, making it look like a shiny metal ladder to the sky."
        },
        {
            "definition": "To move or lift something using a gauntry.",
            "pos": "verb",
            "sent1": "The workers gauntried the heavy crates onto the ship for loading.",
            "sent2": "They will gauntry the equipment carefully to avoid any damage.",
            "sent3": "The children pretended to gauntry their toys onto the imaginary spaceship.",
            "sent4": "She gauntried her dreams higher and higher, reaching for the stars.",
            "sent5": "The machine gauntried the boxes effortlessly, showing its strength and precision."
        },
        {
            "definition": "A structure used for loading or unloading cargo from ships.",
            "pos": "noun",
            "sent1": "The gauntry at the port was busy with workers unloading the cargo from the ship.",
            "sent2": "The captain directed the crew to move the cargo onto the gauntry for transport.",
            "sent3": "The seagulls perched on the gauntry, waiting for any scraps of food to drop.",
            "sent4": "The gauntry loomed over the dock like a giant metal arm reaching out to the sea.",
            "sent5": "The sound of the waves echoed under the gauntry, creating a rhythmic melody of work and sea."
        }
    ]
}