{
    "term": "gavage",
    "meanings": [
        {
            "definition": "The process of feeding a person or animal through a tube inserted into the stomach.",
            "pos": "noun",
            "sent1": "The veterinarian used gavage to feed the sick cat through a tube.",
            "sent2": "The zookeeper performed gavage on the injured elephant to help it recover.",
            "sent3": "During the gavage procedure, the dog accidentally licked the tube and made a funny face.",
            "sent4": "The gavage process was like a lifeline for the malnourished bird, filling it with nourishment.",
            "sent5": "The gavage feeding method ensured the patient received the necessary nutrients directly."
        },
        {
            "definition": "The act of force-feeding an animal for the purpose of fattening it up.",
            "pos": "noun",
            "sent1": "The farmer used gavage to fatten the geese quickly for the market.",
            "sent2": "In some countries, gavage is a common practice to prepare animals for sale.",
            "sent3": "The gavage feeding made the pig look like it had eaten too many treats at once.",
            "sent4": "The gavage process turned the skinny cow into a plump and healthy one.",
            "sent5": "Through gavage, the livestock gained weight rapidly for the upcoming show."
        },
        {
            "definition": "The practice of administering liquid food or medication through a tube.",
            "pos": "noun",
            "sent1": "The nurse used gavage to provide nutrients to the patient who couldn't eat solid food.",
            "sent2": "Gavage is a helpful method for ensuring patients receive essential fluids.",
            "sent3": "The gavage procedure made the child giggle as the liquid went down the tube.",
            "sent4": "With gavage, the doctor could precisely control the intake of medication.",
            "sent5": "The gavage technique allowed the elderly man to get the necessary nutrition easily."
        }
    ]
}