{
    "term": "geests",
    "meanings": [
        {
            "definition": "A ghost or spirit.",
            "pos": "noun",
            "sent1": "The geests of the old castle were said to roam the halls at night.",
            "sent2": "I felt a cold shiver down my spine as the geests passed through me.",
            "sent3": "The friendly geests in the haunted house loved playing pranks on visitors.",
            "sent4": "The geests of the past whispered secrets in the wind.",
            "sent5": "The geests of Halloween danced under the moonlight, their presence felt by all.",
            "sent6": "In the story, the geests were friendly and helpful to the main character.",
            "sent7": "At the Halloween party, the geests floated around the room, delighting the guests.",
            "sent8": "The geests in the movie were portrayed as mischievous but ultimately kind-hearted.",
            "sent9": "The geests of the forest were said to protect the animals from harm.",
            "sent10": "The geests in the painting seemed to come alive, their eyes following you wherever you went."
        },
        {
            "definition": "The prevailing atmosphere or spirit of a place.",
            "pos": "noun",
            "sent1": "The geests of the town were warm and welcoming to all newcomers.",
            "sent2": "As I entered the church, I could feel the geests of peace and tranquility envelop me.",
            "sent3": "The geests of the party were lively and filled with laughter.",
            "sent4": "The geests of the forest whispered tales of ancient times to those who listened.",
            "sent5": "The geests of the beach were carefree and filled with the sound of crashing waves.",
            "sent6": "In the story, the geests of the haunted house were described as eerie and unsettling.",
            "sent7": "The geests of the library seemed to encourage quiet contemplation and study.",
            "sent8": "The geests of the mountain were said to be fierce and untamed, yet beautiful in their own way.",
            "sent9": "The geests of the city at night were mysterious and full of hidden secrets.",
            "sent10": "The geests of the garden whispered of growth and renewal, their presence felt in every blooming flower."
        },
        {
            "definition": "To inspire or possess with a spirit.",
            "pos": "verb",
            "sent1": "The music seemed to geests the dancers, filling them with energy and joy.",
            "sent2": "Her passionate speech geested the crowd, inspiring them to take action.",
            "sent3": "The painting geested me to pick up a brush and create my own masterpiece.",
            "sent4": "The teacher's words geested a love of learning in her students.",
            "sent5": "The beautiful sunset geested a sense of peace and contentment in all who witnessed it.",
            "sent6": "In the story, the mysterious stranger geested the protagonist to embark on a thrilling adventure.",
            "sent7": "The old book seemed to geest a sense of nostalgia in the reader, transporting them to another time.",
            "sent8": "The wise words of the elder geested wisdom and reflection in the young listeners.",
            "sent9": "The gentle rain geested a feeling of calm and serenity in the midst of the storm.",
            "sent10": "The laughter of children geested a sense of joy and innocence in the air, contagious to all around."
        }
    ]
}