{
    "term": "gem",
    "meanings": [
        {
            "definition": "A precious stone",
            "pos": "noun",
            "sent1": "She wore a beautiful gem necklace to the party.",
            "sent2": "The gem sparkled in the sunlight, catching everyone's eye.",
            "sent3": "The mischievous squirrel hid the gem in its nest for safekeeping.",
            "sent4": "Her laughter was like a gem, brightening up the room.",
            "sent5": "The gemstone glowed with an inner light, mesmerizing all who saw it."
        },
        {
            "definition": "A highly prized or admired person or thing",
            "pos": "noun",
            "sent1": "In the world of music, she was a true gem, loved by all.",
            "sent2": "The old watch was a family gem, passed down through generations.",
            "sent3": "The little girl considered her teddy bear to be her most precious gem.",
            "sent4": "His kindness was a gem in a world full of rough edges.",
            "sent5": "The ancient artifact was a historical gem, treasured by historians."
        },
        {
            "definition": "A small cut and polished diamond or other precious stone",
            "pos": "noun",
            "sent1": "The jeweler carefully examined the gem under the bright light.",
            "sent2": "She received a beautiful gem ring for her birthday.",
            "sent3": "The magician pulled a sparkling gem out of his hat to the audience's amazement.",
            "sent4": "The gem on her finger shone like a tiny star.",
            "sent5": "The crown was adorned with precious gems, each one reflecting the light in a unique way."
        },
        {
            "definition": "A person or thing considered to be outstanding in terms of beauty, rarity, or excellence",
            "pos": "noun",
            "sent1": "The new painting in the gallery was a true gem, attracting many visitors.",
            "sent2": "The vintage car was a gem among the collection, a rare find.",
            "sent3": "The old library was a hidden gem, full of forgotten treasures.",
            "sent4": "Her voice was a gem, captivating all who heard her sing.",
            "sent5": "The garden was a gem of tranquility in the bustling city, a peaceful retreat."
        }
    ]
}