{
    "term": "generous",
    "meanings": [
        {
            "definition": "Showing kindness and willingness to give more than is necessary or expected.",
            "pos": "adjective",
            "sent1": "She was very generous with her compliments, always making others feel good about themselves.",
            "sent2": "The generous man donated money to help those in need.",
            "sent3": "The generous offer of free ice cream on a cold day was met with confusion.",
            "sent4": "Her generous spirit shone brightly, lighting up the room with warmth and kindness.",
            "sent5": "The generous act of sharing her umbrella in the rain left a lasting impression on him."
        },
        {
            "definition": "Characterized by abundance or ample proportions.",
            "pos": "adjective",
            "sent1": "The generous portion of cake was enough to satisfy everyone at the party.",
            "sent2": "The garden was filled with generous blooms of colorful flowers.",
            "sent3": "The generous buffet at the party seemed to stretch on forever.",
            "sent4": "The generous landscape stretched out before them, vast and breathtaking.",
            "sent5": "The generous supply of snacks kept the guests happy throughout the event."
        },
        {
            "definition": "Marked by a readiness to give more of something, such as time or money, than is strictly necessary or expected.",
            "pos": "adjective",
            "sent1": "His generous offer to help with the project was greatly appreciated by everyone.",
            "sent2": "The generous donation to the charity made a significant impact on those in need.",
            "sent3": "The generous promise to bring pizza to the meeting brought smiles to everyone's faces.",
            "sent4": "Her generous heart overflowed with love and compassion for those around her.",
            "sent5": "The generous gift of his time to listen to her problems meant the world to her."
        }
    ]
}