{
    "term": "genua",
    "meanings": [
        {
            "definition": "The plural form of 'genus', referring to a taxonomic category ranking below a family and above a species.",
            "pos": "noun",
            "sent1": "In biology class, we learned about different animals belonging to the same genua.",
            "sent2": "Scientists use the term genua to classify living organisms into groups.",
            "sent3": "The teacher joked that the genua of plants seemed like a big family reunion.",
            "sent4": "Exploring the genua of insects is like discovering a hidden world within our own.",
            "sent5": "The genua of birds includes a diverse range of species, each with unique characteristics."
        },
        {
            "definition": "A city in Italy, located in the Liguria region.",
            "pos": "noun",
            "sent1": "Have you ever visited Genua during your travels in Italy?",
            "sent2": "The historic architecture in Genua attracts tourists from around the world.",
            "sent3": "The bustling streets of Genua are filled with the aroma of delicious Italian cuisine.",
            "sent4": "Genua's coastal beauty is a sight to behold, especially during sunset.",
            "sent5": "Exploring the narrow alleys of Genua feels like stepping back in time."
        },
        {
            "definition": "The plural form of 'genu', referring to the knee or kneecap.",
            "pos": "noun",
            "sent1": "Athletes often protect their genua during intense physical activities.",
            "sent2": "The doctor examined both genua to determine the extent of the injury.",
            "sent3": "She playfully tapped her friend's genua to tease him about being clumsy.",
            "sent4": "His genua felt like they were made of rubber after running the marathon.",
            "sent5": "The dancer's graceful movements showcased the flexibility of her genua."
        }
    ]
}