{
    "term": "geomagnetic",
    "meanings": [
        {
            "definition": "Relating to the Earth's magnetic field.",
            "pos": "adjective",
            "sent1": "The scientist conducted a geomagnetic survey to study the Earth's magnetic field.",
            "sent2": "The compass pointed north due to the geomagnetic forces at play.",
            "sent3": "The geomagnetic storm caused disruptions in communication systems.",
            "sent4": "She felt a geomagnetic pull towards exploring the mysteries of the Earth's magnetic field.",
            "sent5": "The aurora borealis is a stunning display of geomagnetic activity."
        },
        {
            "definition": "Pertaining to the interaction between the Earth's magnetic field and other celestial bodies.",
            "pos": "adjective",
            "sent1": "The satellite's orbit was affected by geomagnetic interactions with Earth.",
            "sent2": "Auroras are a result of geomagnetic interactions between the Sun and Earth's magnetic field.",
            "sent3": "The geomagnetic dance between planets fascinated the astronomers.",
            "sent4": "The comet's path was altered by the geomagnetic pull of Jupiter.",
            "sent5": "Studying geomagnetic phenomena helps us understand the universe better."
        },
        {
            "definition": "Involving the study or measurement of the Earth's magnetic field.",
            "pos": "adjective",
            "sent1": "The researchers used geomagnetic data to create a map of the Earth's magnetic field.",
            "sent2": "Geomagnetic surveys help scientists monitor changes in the Earth's magnetic field.",
            "sent3": "The students enjoyed the hands-on experience of conducting geomagnetic experiments.",
            "sent4": "The geomagnetic observatory provided valuable insights into magnetic field variations.",
            "sent5": "Understanding geomagnetic properties is crucial for navigation and communication systems."
        }
    ]
}