{
    "term": "getout",
    "meanings": [
        {
            "definition": "To leave or escape from a place.",
            "pos": "verb",
            "sent1": "I need to getout of the house before it starts raining.",
            "sent2": "Let's getout of here before the movie starts.",
            "sent3": "Why did the cat getout of the bag so suddenly?",
            "sent4": "After the long meeting, I felt like I needed to getout of there like a bird escaping a cage.",
            "sent5": "The idea of a vacation made him want to getout of the office even more."
        },
        {
            "definition": "To become known or discovered.",
            "pos": "verb",
            "sent1": "The truth always finds a way to getout eventually.",
            "sent2": "I hope my secret doesn't getout to everyone at school.",
            "sent3": "The magician's trick was so good that no one could figure out how it gotout.",
            "sent4": "The scandalous news gotout like wildfire through the small town.",
            "sent5": "The hidden treasure finally gotout after years of being buried underground."
        },
        {
            "definition": "To remove or extract something.",
            "pos": "verb",
            "sent1": "Can you help me getout this splinter from my finger?",
            "sent2": "It's important to getout all the weeds from the garden.",
            "sent3": "The chef needed to getout the right ingredients for the recipe.",
            "sent4": "She tried to getout the stain from her favorite shirt but couldn't.",
            "sent5": "The dentist had to getout the decayed tooth to prevent further damage."
        },
        {
            "definition": "To obtain or acquire something.",
            "pos": "verb",
            "sent1": "I need to getout a new pair of shoes for the party.",
            "sent2": "He managed to getout a rare collectible from the flea market.",
            "sent3": "She was determined to getout the top score in the competition.",
            "sent4": "The explorer hoped to getout the ancient artifact from the ruins.",
            "sent5": "The student worked hard to getout a scholarship for college."
        }
    ]
}