{
    "term": "gharri",
    "meanings": [
        {
            "definition": "A type of horse-drawn carriage used in India.",
            "pos": "noun",
            "sent1": "The gharri trotted along the dusty road, carrying passengers to the market.",
            "sent2": "In the olden days, people in India traveled in a gharri pulled by horses.",
            "sent3": "The gharri driver accidentally took a wrong turn and ended up in the middle of a bustling festival.",
            "sent4": "The gharri stood still under the scorching sun, a symbol of traditional transportation.",
            "sent5": "The colorful gharri with its intricate designs painted a vibrant picture against the backdrop of the city."
        },
        {
            "definition": "A type of vehicle used for transportation in South Asia.",
            "pos": "noun",
            "sent1": "The gharri rattled down the bumpy road, carrying goods to the market.",
            "sent2": "Families in South Asia often rely on a gharri for their daily commute.",
            "sent3": "The overloaded gharri struggled to move forward, causing laughter among onlookers.",
            "sent4": "The gharri moved through the streets like a silent messenger of trade and travel.",
            "sent5": "The familiar sound of the gharri's wheels signaled the start of another busy day in the village."
        },
        {
            "definition": "A type of cart or carriage used for carrying goods or passengers.",
            "pos": "noun",
            "sent1": "The gharri was filled with sacks of rice ready for delivery to the market.",
            "sent2": "Passengers waited eagerly by the roadside for the gharri to arrive and take them to town.",
            "sent3": "The gharri's wheels creaked loudly, adding a musical touch to the quiet countryside.",
            "sent4": "Under the moonlight, the gharri looked like a magical vessel carrying dreams and hopes.",
            "sent5": "The gharri's arrival brought a sense of excitement and anticipation to the sleepy village."
        }
    ]
}