{
    "term": "ghettoing",
    "meanings": [
        {
            "definition": "To confine or segregate a group of people in a specific area, typically based on socioeconomic status or ethnicity.",
            "pos": "verb",
            "sent1": "The government was ghettoing certain neighborhoods, separating them from the rest of the city.",
            "sent2": "The city council decided to stop ghettoing people based on their income levels.",
            "sent3": "The idea of ghettoing people because of their skin color is outdated and unfair.",
            "sent4": "In a way, by ghettoing certain groups, society is creating invisible barriers.",
            "sent5": "The impact of ghettoing communities can be devastating and long-lasting."
        },
        {
            "definition": "The act of creating or forming a ghetto.",
            "pos": "noun",
            "sent1": "The ghettoing of the neighborhood led to increased crime rates.",
            "sent2": "Historically, ghettoing was a common practice in many cities.",
            "sent3": "The children played a game pretending they were ghettoing their toys into separate areas.",
            "sent4": "The artist used colors to represent the process of ghettoing in his painting.",
            "sent5": "The documentary shed light on the harsh reality of ghettoing in urban areas."
        },
        {
            "definition": "The process of isolating or marginalizing a particular group within a community.",
            "pos": "noun",
            "sent1": "The ghettoing of the minority population caused tension within the city.",
            "sent2": "Ghettoing can lead to feelings of exclusion and discrimination.",
            "sent3": "The school project aimed to raise awareness about the negative effects of ghettoing.",
            "sent4": "The media often portrays the process of ghettoing in a negative light.",
            "sent5": "The community worked together to prevent the ghettoing of vulnerable groups."
        }
    ]
}