{
    "term": "ghosted",
    "meanings": [
        {
            "definition": "To abruptly cut off all communication with someone, especially in a romantic relationship.",
            "pos": "verb",
            "sent1": "She ghosted him after their argument, not answering any calls or messages.",
            "sent2": "He ghosted her without warning, leaving her confused and hurt.",
            "sent3": "The ghosted phone buzzed with unanswered texts, a silent reminder of their disagreement.",
            "sent4": "His presence in her life vanished like a ghosted message, leaving her feeling abandoned.",
            "sent5": "The way he ghosted her made her feel like a forgotten ghost in his life."
        },
        {
            "definition": "Having disappeared or left without explanation.",
            "pos": "adjective",
            "sent1": "The ghosted ship was found adrift at sea, its crew mysteriously gone.",
            "sent2": "The ghosted house stood empty, its windows boarded up and its doors locked.",
            "sent3": "The ghosted cake on the table puzzled the party guests, wondering where it came from.",
            "sent4": "Her ghosted memories of the event left her feeling confused and lost.",
            "sent5": "The ghosted town seemed frozen in time, with no signs of life anywhere."
        },
        {
            "definition": "The act of ignoring or avoiding someone intentionally.",
            "pos": "noun",
            "sent1": "His ghosted behavior towards her hurt her deeply, making her feel unwanted.",
            "sent2": "The ghosted silence between them grew louder with each passing day.",
            "sent3": "The ghosted invitation to the party left her feeling excluded and lonely.",
            "sent4": "The ghosted relationship haunted her thoughts, making her question her worth.",
            "sent5": "The ghosted conversation echoed in her mind, a constant reminder of their rift."
        }
    ]
}