{
    "term": "ghoulies",
    "meanings": [
        {
            "definition": "Ghoulies: small, mischievous supernatural creatures",
            "pos": "noun",
            "sent1": "The children in the story encountered playful ghoulies in the forest.",
            "sent2": "The movie featured a group of ghoulies causing chaos in a haunted house.",
            "sent3": "The ghoulies were so tiny and cute that they ended up helping the main character with their pranks.",
            "sent4": "The ghoulies danced under the moonlight, their eerie laughter echoing through the night.",
            "sent5": "Beware of the ghoulies lurking in the shadows, ready to surprise unsuspecting travelers."
        },
        {
            "definition": "Ghoulies: the internal organs of a person or animal, especially the intestines",
            "pos": "noun",
            "sent1": "The surgeon carefully examined the patient's ghoulies during the operation.",
            "sent2": "The chef prepared a dish using the animal's ghoulies as a key ingredient.",
            "sent3": "The comedian joked about eating strange foods, including fried ghoulies.",
            "sent4": "The ghoulies of the creature spilled out, revealing its true form beneath the skin.",
            "sent5": "The explorer studied the ghoulies of different animals to understand their anatomy better."
        },
        {
            "definition": "Ghoulies: a feeling of fear or unease",
            "pos": "noun",
            "sent1": "Walking alone in the dark forest, she couldn't shake off the ghoulies creeping up her spine.",
            "sent2": "The horror movie was filled with suspense, sending ghoulies down the audience's spines.",
            "sent3": "The unexpected sound in the empty house gave her the ghoulies, making her jump.",
            "sent4": "The ghoulies of doubt haunted his mind, making him question every decision.",
            "sent5": "The ghost story was so chilling that it left the listeners with ghoulies long after it ended."
        }
    ]
}