{
    "term": "ghoulie",
    "meanings": [
        {
            "definition": "A mischievous or playful creature, often depicted as a small, impish being.",
            "pos": "noun",
            "sent1": "The little ghoulie giggled as it played hide-and-seek with the children.",
            "sent2": "During Halloween, people enjoy dressing up as ghoulies to scare their friends.",
            "sent3": "The mischievous ghoulie snuck into the kitchen and rearranged all the cookie jars.",
            "sent4": "Her mischievous grin made her look like a little ghoulie up to no good.",
            "sent5": "The playful ghoulie danced around the room, spreading joy wherever it went."
        },
        {
            "definition": "A small, decorative item or trinket, typically used as a Halloween decoration.",
            "pos": "noun",
            "sent1": "She carefully placed the ghoulie on the front porch to welcome trick-or-treaters.",
            "sent2": "The store had a variety of ghoulies for sale, from cute pumpkins to spooky ghosts.",
            "sent3": "The ghoulie hanging from the ceiling added a festive touch to the Halloween party.",
            "sent4": "The ghoulie glowed eerily in the dark, casting spooky shadows on the walls.",
            "sent5": "Children excitedly picked out their favorite ghoulies to decorate the classroom for Halloween."
        },
        {
            "definition": "A small, ghostly figure or spirit, often associated with supernatural occurrences.",
            "pos": "noun",
            "sent1": "The ghoulie appeared in the old mansion, floating silently through the halls.",
            "sent2": "Legends say that a ghoulie haunts the graveyard, searching for lost souls.",
            "sent3": "The ghost hunters were surprised to find a friendly ghoulie in the abandoned house.",
            "sent4": "The ghoulie's ethereal presence sent shivers down the spine of the curious onlookers.",
            "sent5": "In the moonlight, the ghoulie seemed to glow with an otherworldly aura, captivating all who saw it."
        }
    ]
}