{
    "term": "gig",
    "meanings": [
        {
            "definition": "A job, especially a temporary one",
            "pos": "noun",
            "sent1": "She got a gig at the store for the weekend.",
            "sent2": "He found a gig as a waiter during the summer.",
            "sent3": "The gig at the fair was fun and exciting.",
            "sent4": "Working at the carnival felt like a gig in a different world.",
            "sent5": "The gig as a dog walker was tiring but rewarding."
        },
        {
            "definition": "A performance by a musician or group of musicians",
            "pos": "noun",
            "sent1": "The band had a gig at the local pub.",
            "sent2": "Attending a gig at the concert hall was a thrilling experience.",
            "sent3": "The gig at the park had everyone dancing.",
            "sent4": "The gig in the city echoed through the night.",
            "sent5": "The gig by the beach was filled with music and laughter."
        },
        {
            "definition": "A light two-wheeled carriage",
            "pos": "noun",
            "sent1": "The children rode in the gig pulled by a pony.",
            "sent2": "The gig was perfect for a leisurely ride around the park.",
            "sent3": "The gig swayed gently as it moved along the path.",
            "sent4": "The gig glided smoothly over the cobblestone streets.",
            "sent5": "The gig was a charming way to explore the countryside."
        },
        {
            "definition": "A long, light rowboat",
            "pos": "noun",
            "sent1": "They rowed the gig out to the middle of the lake.",
            "sent2": "The gig was ideal for a peaceful day of fishing.",
            "sent3": "The gig bobbed up and down with the gentle waves.",
            "sent4": "The gig cut through the water swiftly and gracefully.",
            "sent5": "The gig provided a serene escape on the calm river."
        },
        {
            "definition": "A spear for catching fish",
            "pos": "noun",
            "sent1": "He used the gig to catch fish in the shallow stream.",
            "sent2": "The sharp gig was essential for fishing in the pond.",
            "sent3": "The gig was carefully aimed at the darting fish.",
            "sent4": "With a swift motion, he plunged the gig into the water.",
            "sent5": "The gleaming gig was a tool for the skilled fisherman."
        }
    ]
}