{
    "term": "gigs",
    "meanings": [
        {
            "definition": "A live performance by a musician or group",
            "pos": "noun",
            "sent1": "The band had a series of gigs at local bars.",
            "sent2": "Attending gigs is a fun way to enjoy live music.",
            "sent3": "The gig last night had everyone dancing and singing along.",
            "sent4": "Her gig at the concert was like a burst of energy on stage.",
            "sent5": "The gig was so memorable that fans talked about it for weeks."
        },
        {
            "definition": "A temporary job or task",
            "pos": "noun",
            "sent1": "She picked up a few gigs to earn extra money.",
            "sent2": "Freelancers often rely on gigs for their income.",
            "sent3": "His gig as a dog walker was both fun and rewarding.",
            "sent4": "Finding a gig as a tutor helped her save up for a trip.",
            "sent5": "The gig at the fair was a quick way to make some cash."
        },
        {
            "definition": "A fishing spear with a single or multiple barbed prongs",
            "pos": "noun",
            "sent1": "The fisherman used a gigs to catch his dinner.",
            "sent2": "The gigs was essential for fishing in the shallow waters.",
            "sent3": "He accidentally dropped the gigs into the lake while fishing.",
            "sent4": "The gigs gleamed in the sunlight as he prepared to fish.",
            "sent5": "Using the gigs required precision and skill to catch fish."
        },
        {
            "definition": "A light two-wheeled carriage pulled by one horse",
            "pos": "noun",
            "sent1": "The farmer used a gigs to transport goods around the farm.",
            "sent2": "The gigs rattled along the dirt road with ease.",
            "sent3": "The gigs was a charming way to travel through the countryside.",
            "sent4": "She enjoyed the peaceful ride in the gigs through the fields.",
            "sent5": "The gigs added a touch of nostalgia to the rural landscape."
        }
    ]
}