{
    "term": "gilded",
    "meanings": [
        {
            "definition": "Covered with a thin layer of gold",
            "pos": "adjective",
            "sent1": "The gilded frame around the mirror sparkled in the sunlight.",
            "sent2": "The gilded crown on the king's head symbolized his royal status.",
            "sent3": "The gilded statue looked like a shiny treasure in the museum.",
            "sent4": "Her gilded bracelet was a symbol of her elegance and wealth.",
            "sent5": "The gilded chandelier illuminated the grand ballroom with a golden glow."
        },
        {
            "definition": "Wealthy and privileged",
            "pos": "adjective",
            "sent1": "The gilded family lived in a mansion with a large garden.",
            "sent2": "She wore a gilded necklace that shimmered with luxury.",
            "sent3": "The gilded guests at the party arrived in fancy cars.",
            "sent4": "His gilded lifestyle allowed him to travel the world in style.",
            "sent5": "The gilded yacht sailed gracefully on the sparkling blue sea."
        },
        {
            "definition": "To cover with a thin layer of gold",
            "pos": "verb",
            "sent1": "She carefully gilded the edges of the picture frame.",
            "sent2": "The artist gilded the statue to enhance its beauty.",
            "sent3": "He decided to gild the vase as a special gift for his mother.",
            "sent4": "The craftsman gilded the intricate design with precision.",
            "sent5": "They planned to gild the entire gate to make it stand out."
        },
        {
            "definition": "To give a deceptively attractive appearance",
            "pos": "verb",
            "sent1": "The company tried to gild their products with false promises.",
            "sent2": "She knew how to gild her words to win people over.",
            "sent3": "His attempt to gild the situation only made things worse.",
            "sent4": "The politician tried to gild his image with empty gestures.",
            "sent5": "The advertisement was designed to gild the mediocre product."
        }
    ]
}