{
    "term": "glace",
    "meanings": [
        {
            "definition": "Having a smooth, shiny surface",
            "pos": "adjective",
            "sent1": "The glace table reflected the sunlight beautifully.",
            "sent2": "Her glace shoes sparkled under the lights.",
            "sent3": "The glace mirror made her look like a movie star.",
            "sent4": "The glace lake seemed like a sheet of glass.",
            "sent5": "The glace car was so polished, you could see your reflection in it."
        },
        {
            "definition": "A thin coating of ice",
            "pos": "noun",
            "sent1": "The morning frost left a delicate glace on the grass.",
            "sent2": "The glace on the pond cracked under the weight of the duck.",
            "sent3": "The glace on the road made walking a slippery adventure.",
            "sent4": "The glace on the tree branches glistened in the sunlight.",
            "sent5": "The glace on the window made everything outside look blurry."
        },
        {
            "definition": "A sweet, glossy icing",
            "pos": "noun",
            "sent1": "The baker drizzled the cake with glace for a shiny finish.",
            "sent2": "The glace on the donuts made them look irresistible.",
            "sent3": "The glace on the cupcakes made them look like little jewels.",
            "sent4": "The glace on the cookies added a touch of sweetness.",
            "sent5": "The glace on the pastries made them look like works of art."
        },
        {
            "definition": "To cover with a thin, shiny coating",
            "pos": "verb",
            "sent1": "She decided to glace the cupcakes with chocolate icing.",
            "sent2": "The chef will glace the dessert with a sugary syrup.",
            "sent3": "He likes to glace his fruit salad with a honey glaze.",
            "sent4": "The artist will glace the painting with a protective varnish.",
            "sent5": "The baker will glace the bread with a shiny egg wash."
        }
    ]
}