{
    "term": "glamorously",
    "meanings": [
        {
            "definition": "In a glamorous manner",
            "pos": "adverb",
            "sent1": "She walked glamorously down the red carpet, turning heads with her stunning gown.",
            "sent2": "The movie star always dresses glamorously for award ceremonies.",
            "sent3": "Even her pet dog seemed to walk glamorously when wearing a tiny bow tie.",
            "sent4": "The city lights sparkled glamorously like a thousand diamonds in the night sky.",
            "sent5": "The old Hollywood actress reminisced about the days when she danced glamorously in films."
        },
        {
            "definition": "With charm and elegance",
            "pos": "adverb",
            "sent1": "The ballerina moved glamorously across the stage, captivating the audience with her grace.",
            "sent2": "The hostess greeted her guests glamorously, making everyone feel welcome.",
            "sent3": "The magician waved his wand glamorously, as if casting a spell on the audience.",
            "sent4": "The sunset painted the sky glamorously with hues of pink and gold.",
            "sent5": "The prince rode into the castle courtyard glamorously on his white horse, drawing all eyes to him."
        },
        {
            "definition": "In a stylish and attractive way",
            "pos": "adverb",
            "sent1": "The fashion model posed glamorously for the camera, showcasing the latest designer collection.",
            "sent2": "The singer performed glamorously on stage, mesmerizing the crowd with her voice.",
            "sent3": "The chef presented the dish glamorously, adding a sprinkle of edible glitter for extra flair.",
            "sent4": "The luxury car gleamed glamorously under the showroom lights, enticing potential buyers.",
            "sent5": "The bride smiled glamorously as she walked down the aisle, radiating happiness and beauty."
        }
    ]
}