{
    "term": "glassie",
    "meanings": [
        {
            "definition": "A small glass container for holding liquids.",
            "pos": "noun",
            "sent1": "I poured water into the glassie on the table.",
            "sent2": "The waiter brought a glassie of orange juice to the customer.",
            "sent3": "The glassie on the shelf looked like it was whispering to the other containers.",
            "sent4": "Her eyes sparkled like a glassie filled with sunlight.",
            "sent5": "The glassie slipped from his hand, shattering into a thousand pieces."
        },
        {
            "definition": "A person who works with glass.",
            "pos": "noun",
            "sent1": "The glassie carefully shaped the molten glass into a beautiful vase.",
            "sent2": "My friend's dad is a talented glassie who creates stunning sculptures.",
            "sent3": "The glassie accidentally blew bubbles into the glass he was working on.",
            "sent4": "She was as delicate and transparent as a glassie in the sunlight.",
            "sent5": "The glassie's hands moved swiftly and skillfully, shaping the glass with precision."
        },
        {
            "definition": "A type of glass marble.",
            "pos": "noun",
            "sent1": "Tommy won a shiny glassie in the marble game at school.",
            "sent2": "The kids played with colorful glassies in the playground.",
            "sent3": "The glassie rolled off the table and onto the floor, causing a commotion.",
            "sent4": "Her laughter echoed like a glassie bouncing off the walls.",
            "sent5": "The glassie gleamed in the sunlight, catching everyone's eye."
        },
        {
            "definition": "A type of glass bottle.",
            "pos": "noun",
            "sent1": "The potion was stored in a glassie with a cork stopper.",
            "sent2": "She collected vintage glassies from different countries.",
            "sent3": "The glassie on the shelf seemed to wink at me mischievously.",
            "sent4": "The glassie stood tall and proud among the other bottles.",
            "sent5": "The glassie reflected the light, creating a beautiful rainbow on the wall."
        }
    ]
}