{
    "term": "glebal",
    "meanings": [
        {
            "definition": "Of or relating to land or soil.",
            "pos": "adjective",
            "sent1": "The glebal earth was rich and fertile, perfect for growing crops.",
            "sent2": "Farmers study the glebal composition of the soil to determine the best crops to plant.",
            "sent3": "The glebal ground seemed to magically yield bountiful harvests every season.",
            "sent4": "Her love for gardening was like the glebal soil, nurturing and sustaining life.",
            "sent5": "The glebal landscape stretched out before us, promising a bountiful harvest."
        },
        {
            "definition": "Pertaining to a church benefice or glebe.",
            "pos": "adjective",
            "sent1": "The glebal duties of the church were carried out with dedication and reverence.",
            "sent2": "The glebal lands surrounding the church provided a peaceful retreat for meditation.",
            "sent3": "The glebal ceremony was a solemn occasion, filled with prayers and hymns.",
            "sent4": "Her commitment to the church was as steadfast as the glebal ties that bound her to the community.",
            "sent5": "The glebal bells rang out, calling the faithful to worship and reflection."
        },
        {
            "definition": "Consisting of or resembling glebe.",
            "pos": "adjective",
            "sent1": "The glebal architecture of the old church reflected a sense of history and tradition.",
            "sent2": "The glebal artifacts found in the ruins hinted at a bygone era of prosperity.",
            "sent3": "The glebal design of the building incorporated elements of nature and simplicity.",
            "sent4": "His paintings captured the essence of glebal beauty, with earthy tones and natural textures.",
            "sent5": "The glebal patterns on the tapestry depicted scenes of rural life and pastoral tranquility."
        }
    ]
}