{
    "term": "glei",
    "meanings": [
        {
            "definition": "Shine brightly",
            "pos": "verb",
            "sent1": "The sun will glei in the sky tomorrow.",
            "sent2": "The stars glei beautifully in the night sky.",
            "sent3": "Her smile made her face glei with joy.",
            "sent4": "The diamond glei like a tiny sun on her finger.",
            "sent5": "The polished silver glei with a dazzling brilliance."
        },
        {
            "definition": "A brief or faint light",
            "pos": "noun",
            "sent1": "The glei of the firefly caught my eye in the dark.",
            "sent2": "The glei of the flashlight helped us find our way.",
            "sent3": "The glei of the firefly looked like a tiny fairy light.",
            "sent4": "The glei of the distant lighthouse guided the ships safely.",
            "sent5": "The glei of the firefly flickered softly in the night."
        },
        {
            "definition": "To make something shine by rubbing it",
            "pos": "verb",
            "sent1": "She will glei the mirror until it sparkles.",
            "sent2": "He glei the shoes until they looked brand new.",
            "sent3": "The child tried to glei the coin to make it shiny.",
            "sent4": "The maid would glei the silverware to a mirror-like finish.",
            "sent5": "He used a cloth to glei the window until it was crystal clear."
        },
        {
            "definition": "A happy or excited expression on someone's face",
            "pos": "noun",
            "sent1": "Her glei was contagious, spreading joy to everyone.",
            "sent2": "The child's glei was evident as he opened his birthday present.",
            "sent3": "Seeing the puppy brought a glei to her face.",
            "sent4": "His glei was like a ray of sunshine on a cloudy day.",
            "sent5": "The glei on her face lit up the room with happiness."
        }
    ]
}