{
    "term": "glittery",
    "meanings": [
        {
            "definition": "Shining with a bright, shimmering light",
            "pos": "adjective",
            "sent1": "The princess wore a glittery crown that sparkled in the sun.",
            "sent2": "The disco ball cast a glittery light across the dance floor.",
            "sent3": "The magician's wand emitted a glittery glow, making the audience gasp in amazement.",
            "sent4": "Her eyes were like glittery stars in the night sky, full of wonder and magic.",
            "sent5": "The treasure chest was filled with glittery jewels that dazzled all who beheld them."
        },
        {
            "definition": "Covered with or resembling glitter",
            "pos": "adjective",
            "sent1": "The birthday cake was decorated with glittery frosting that caught everyone's eye.",
            "sent2": "The costume designer created a glittery outfit for the pop star's concert.",
            "sent3": "The cat walked through the glittery snow, leaving tiny paw prints behind.",
            "sent4": "The city skyline at night looked like a glittery wonderland, with lights twinkling in every direction.",
            "sent5": "The old mirror had a frame that was chipped but still glittery, reflecting a distorted image."
        },
        {
            "definition": "Sparkling or twinkling with reflected light",
            "pos": "adjective",
            "sent1": "The lake's surface was glittery under the moonlight, creating a serene atmosphere.",
            "sent2": "The Christmas tree was adorned with glittery ornaments that shimmered in the soft glow of the room.",
            "sent3": "The dragon's scales were so glittery that they blinded the knight momentarily.",
            "sent4": "The city skyline at night looked like a glittery wonderland, with lights twinkling in every direction.",
            "sent5": "The stars in the night sky appeared as glittery diamonds scattered across a velvet canvas."
        }
    ]
}