{
    "term": "glooms",
    "meanings": [
        {
            "definition": "A state of partial or total darkness",
            "pos": "noun",
            "sent1": "The room was filled with glooms as the sun set outside.",
            "sent2": "The forest was shrouded in glooms as night fell.",
            "sent3": "The cat's playful antics in the glooms of the basement made everyone laugh.",
            "sent4": "The glooms of the cave enveloped the explorers like a heavy blanket.",
            "sent5": "The glooms of the stormy night made it hard to see anything."
        },
        {
            "definition": "A feeling of sadness or melancholy",
            "pos": "noun",
            "sent1": "She couldn't shake off the glooms that clouded her mind.",
            "sent2": "The news of the loss cast glooms over the entire family.",
            "sent3": "Despite his best efforts, his glooms always seemed to linger.",
            "sent4": "The glooms in her heart were like a heavy weight dragging her down.",
            "sent5": "The glooms of loneliness crept in during the quiet night."
        },
        {
            "definition": "To make dark or dim",
            "pos": "verb",
            "sent1": "The heavy curtains glooms the room even during the day.",
            "sent2": "The storm clouds glooms the sky, blocking out the sun.",
            "sent3": "His attempt to glooms the painting ended up making it look mysterious.",
            "sent4": "The shadows glooms the alley, hiding any movement within.",
            "sent5": "The fog glooms the landscape, creating an eerie atmosphere."
        },
        {
            "definition": "To be in a state of sadness or melancholy",
            "pos": "verb",
            "sent1": "She glooms in her room after the argument with her friend.",
            "sent2": "He glooms silently, staring out of the window at the rain.",
            "sent3": "The puppy glooms when left alone, waiting for its owner to return.",
            "sent4": "The old man glooms over his lost youth, reminiscing about the past.",
            "sent5": "As the music played, she glooms, lost in memories of happier times."
        }
    ]
}