{
    "term": "glorioles",
    "meanings": [
        {
            "definition": "A halo or ring of light surrounding the head of a saint or deity in religious art.",
            "pos": "noun",
            "sent1": "The painting depicted the saint with a glorioles shining brightly above his head.",
            "sent2": "The glorioles around the deity's head in the artwork added a sense of divinity.",
            "sent3": "The glorioles in the painting made the saint look like he had a special lightbulb above his head.",
            "sent4": "Her kindness seemed to create a glorioles around her, illuminating the room with warmth.",
            "sent5": "The glorioles around the angel's head in the picture made it look truly heavenly."
        },
        {
            "definition": "A circle of light or brightness surrounding something, such as the sun or moon.",
            "pos": "noun",
            "sent1": "The glorioles of light around the sun during sunset painted the sky in beautiful colors.",
            "sent2": "The glorioles of the moon on a clear night added a magical touch to the sky.",
            "sent3": "The glorioles of light around the streetlamp made the night seem cozy and inviting.",
            "sent4": "The glorioles of the campfire danced in the darkness, creating a mesmerizing effect.",
            "sent5": "The glorioles of the fireflies in the garden made it look like a fairy tale come to life."
        },
        {
            "definition": "A radiant or shining quality or aura.",
            "pos": "noun",
            "sent1": "Her smile had a glorioles that brightened up the room.",
            "sent2": "The glorioles of happiness around her was contagious to everyone she met.",
            "sent3": "The glorioles of excitement around the children on the playground was palpable.",
            "sent4": "The glorioles of success surrounded him as he received the award.",
            "sent5": "The glorioles of love between the couple was evident in every glance they shared."
        }
    ]
}