{
    "term": "glow",
    "meanings": [
        {
            "definition": "To emit a steady light without flame",
            "pos": "verb",
            "sent1": "The fireflies glow in the dark forest.",
            "sent2": "The lantern glows softly in the night.",
            "sent3": "The nightlight decided to glow brighter than the moon.",
            "sent4": "Her smile made her whole face glow with happiness.",
            "sent5": "The stars above seemed to glow with a magical light."
        },
        {
            "definition": "A steady radiance of light",
            "pos": "noun",
            "sent1": "The soft glow of the candle filled the room.",
            "sent2": "The city skyline had a warm glow at sunset.",
            "sent3": "The glow of the fire made everyone feel cozy.",
            "sent4": "The glow of the sunrise painted the sky in hues of pink and orange.",
            "sent5": "The glow of the campfire danced in the darkness."
        },
        {
            "definition": "To have a warm, reddish color",
            "pos": "verb",
            "sent1": "The sky began to glow with the colors of dawn.",
            "sent2": "The embers of the fire started to glow as they burned.",
            "sent3": "The cheeks of the child started to glow with embarrassment.",
            "sent4": "The horizon began to glow with the approaching sunrise.",
            "sent5": "The leaves of the trees seemed to glow in the autumn sunlight."
        },
        {
            "definition": "A feeling of warmth and happiness",
            "pos": "noun",
            "sent1": "The memory of that day always brings a warm glow to my heart.",
            "sent2": "The laughter of children filled the room with a joyful glow.",
            "sent3": "The unexpected gift brought a glow of happiness to her face.",
            "sent4": "The kind words from a friend can bring a glow to your day.",
            "sent5": "The cozy fireplace filled the room with a comforting glow."
        }
    ]
}