{
    "term": "gluts",
    "meanings": [
        {
            "definition": "An excessive supply or amount of something",
            "pos": "noun",
            "sent1": "The store had gluts of candy, overflowing from the shelves.",
            "sent2": "The gluts of toys in the store made it difficult to walk through the aisles.",
            "sent3": "The gluts of homework on his desk seemed to mock him as he tried to relax.",
            "sent4": "Her laughter echoed through the room, a glut of joy in the air.",
            "sent5": "The gluts of books in the library created a cozy atmosphere for reading."
        },
        {
            "definition": "To fill or feed to excess",
            "pos": "verb",
            "sent1": "She gluts herself on ice cream every night, unable to resist its sweetness.",
            "sent2": "The buffet offered a variety of dishes, tempting guests to glut themselves on delicious food.",
            "sent3": "He decided to glut on popcorn during the movie, ending up with a stomachache.",
            "sent4": "The garden gluts with sunlight, nourishing the plants with warmth and energy.",
            "sent5": "The river gluts the fields with water, providing essential hydration for the crops."
        },
        {
            "definition": "To flood the market with a particular product",
            "pos": "verb",
            "sent1": "The company decided to glut the market with their new smartphone, hoping to attract more customers.",
            "sent2": "The fashion industry tends to glut the market with new trends every season.",
            "sent3": "The bakery accidentally gluts the market with too many cupcakes, causing a sugar rush in the town.",
            "sent4": "The artist plans to glut the art world with her unique paintings, aiming to make a statement.",
            "sent5": "The tech company's strategy is to glut the market with affordable gadgets, reaching a wider audience."
        }
    ]
}