{
    "term": "goaf",
    "meanings": [
        {
            "definition": "An area of waste rock in a mine.",
            "pos": "noun",
            "sent1": "The miners cleared out the goaf to make space for new excavation.",
            "sent2": "The goaf in the mine was filled with discarded rocks and debris.",
            "sent3": "The goaf was so full of rocks that it looked like a mountain of waste.",
            "sent4": "The goaf resembled a forgotten corner of the mine, untouched and abandoned.",
            "sent5": "The goaf was a reminder of the hard work done by the miners."
        },
        {
            "definition": "To leave or depart.",
            "pos": "verb",
            "sent1": "After finishing his work, he decided to goaf home for the day.",
            "sent2": "She had to goaf early to catch the last bus.",
            "sent3": "The cat decided to goaf from the room when it got too noisy.",
            "sent4": "The students were eager to goaf for the weekend break.",
            "sent5": "The tired hiker was ready to goaf from the trail and rest."
        },
        {
            "definition": "To move or proceed.",
            "pos": "verb",
            "sent1": "The car began to goaf slowly up the steep hill.",
            "sent2": "The parade continued to goaf through the streets, attracting a crowd.",
            "sent3": "The toy train would goaf around the track in circles for hours.",
            "sent4": "The river seemed to goaf endlessly towards the horizon.",
            "sent5": "The ants would goaf in a line, following each other's trail."
        },
        {
            "definition": "A place where coal has been extracted.",
            "pos": "noun",
            "sent1": "The old goaf was now a tourist attraction, showcasing the history of coal mining.",
            "sent2": "The goaf was a reminder of the coal that once filled the underground tunnels.",
            "sent3": "Visiting the goaf gave a glimpse into the harsh conditions miners worked in.",
            "sent4": "The goaf stood as a silent witness to the coal mining industry's past.",
            "sent5": "Exploring the goaf felt like stepping back in time to the era of coal extraction."
        }
    ]
}