{
    "term": "godling",
    "meanings": [
        {
            "definition": "A minor or lesser god.",
            "pos": "noun",
            "sent1": "The godling watched over the garden with care.",
            "sent2": "The villagers offered prayers to the godling for a bountiful harvest.",
            "sent3": "The mischievous godling played tricks on the other gods.",
            "sent4": "In the realm of gods, the godling's light shone brightly.",
            "sent5": "Legends spoke of a powerful godling who could control the elements."
        },
        {
            "definition": "A deity or divine being.",
            "pos": "noun",
            "sent1": "The ancient temple was dedicated to a powerful godling.",
            "sent2": "People traveled from afar to seek blessings from the godling.",
            "sent3": "The godling's presence brought peace and harmony to the land.",
            "sent4": "The godling's voice echoed like thunder through the mountains.",
            "sent5": "The godling's gaze held the secrets of the universe."
        },
        {
            "definition": "A small or insignificant god.",
            "pos": "noun",
            "sent1": "The godling of the stream was often overlooked by the other gods.",
            "sent2": "Despite being a godling, he was humble and kind to all.",
            "sent3": "The godling of mischief caused playful chaos among the gods.",
            "sent4": "Even the smallest godling could wield great power when needed.",
            "sent5": "The godling's laughter filled the heavens with joy."
        },
        {
            "definition": "A young or immature god.",
            "pos": "noun",
            "sent1": "The godling stumbled as he tried to control his divine powers.",
            "sent2": "The godling's youthful energy brought a sense of renewal to the pantheon.",
            "sent3": "The elder gods often teased the godling for his inexperience.",
            "sent4": "The godling's innocence was a refreshing change among the ancient deities.",
            "sent5": "In the realm of gods, the godling's potential was limitless."
        }
    ]
}