{
    "term": "godparents",
    "meanings": [
        {
            "definition": "A person who presents a child at baptism and promises to take responsibility for their religious education.",
            "pos": "noun",
            "sent1": "My godparents, Sarah and John, stood by me during my baptism.",
            "sent2": "The godparents gifted the child a beautiful cross necklace for their baptism.",
            "sent3": "The godparents joked that they were now officially in charge of the child's spiritual homework.",
            "sent4": "Being a godparent is like being a guiding star in a child's religious journey.",
            "sent5": "The godparents' role is to guide the child's faith like a gentle shepherd."
        },
        {
            "definition": "A person who is a sponsor for a child at baptism.",
            "pos": "noun",
            "sent1": "My godparents, Mary and David, sponsored my baptism ceremony.",
            "sent2": "The godparents were honored to be chosen as sponsors for the baptism.",
            "sent3": "The godparents proudly held the baptismal candle during the ceremony.",
            "sent4": "The role of godparents is to support the child's spiritual growth like a sturdy pillar.",
            "sent5": "The godparents' presence at the baptism was like a beacon of love and support."
        },
        {
            "definition": "A person who is responsible for the moral and religious education of a child.",
            "pos": "noun",
            "sent1": "The godparents took their role seriously in guiding the child's moral compass.",
            "sent2": "The godparents were dedicated to instilling good values in the child.",
            "sent3": "The godparents playfully quizzed the child on religious teachings during family gatherings.",
            "sent4": "The godparents' influence on the child's character was as strong as a lighthouse in a storm.",
            "sent5": "The godparents' teachings were like seeds of wisdom planted in the child's heart."
        }
    ]
}