{
    "term": "going",
    "meanings": [
        {
            "definition": "Moving or traveling from one place to another.",
            "pos": "adjective",
            "sent1": "The fast car is going down the road.",
            "sent2": "The train is going to the next station.",
            "sent3": "The flying squirrel is going faster than a rocket!",
            "sent4": "The river is going like a snake through the forest.",
            "sent5": "The rocket ship is going at the speed of light."
        },
        {
            "definition": "In the process of happening or taking place.",
            "pos": "adjective",
            "sent1": "The party is going on in the backyard.",
            "sent2": "The construction work is going smoothly.",
            "sent3": "The cat is going on a secret mission to find the missing toy.",
            "sent4": "The storm is going through the town like a wild beast.",
            "sent5": "The magic show is going on with amazing tricks."
        },
        {
            "definition": "Functioning or operating in a particular way.",
            "pos": "adjective",
            "sent1": "The clock is going perfectly without any errors.",
            "sent2": "The computer is going through its startup process.",
            "sent3": "The robot is going crazy and dancing on the table.",
            "sent4": "The engine is going like a well-oiled machine.",
            "sent5": "The plan is going smoothly without any hiccups."
        },
        {
            "definition": "Intending or planning to do something.",
            "pos": "adjective",
            "sent1": "The determined student is going to study all night.",
            "sent2": "The team is going to win the championship.",
            "sent3": "The sneaky fox is going to steal the farmer's chickens.",
            "sent4": "The ambitious entrepreneur is going to build a successful business.",
            "sent5": "The brave knight is going to rescue the princess from the dragon."
        }
    ]
}