{
    "term": "goldbricked",
    "meanings": [
        {
            "definition": "To deceive or swindle by means of a gold brick.",
            "pos": "verb",
            "sent1": "The con artist goldbricked the unsuspecting victim by selling a fake gold brick.",
            "sent2": "She goldbricked her way into the wealthy businessman's trust with promises of rare gold bricks.",
            "sent3": "The sneaky thief goldbricked the tourists by offering them a 'discounted' gold brick.",
            "sent4": "His smooth talk and fake smiles goldbricked many into believing his gold brick was real.",
            "sent5": "The scammer's plan to goldbrick the old lady with a painted gold brick was quickly uncovered."
        },
        {
            "definition": "To avoid work or responsibility by pretending to be busy or working.",
            "pos": "verb",
            "sent1": "He goldbricked his way through the day by looking busy but doing nothing.",
            "sent2": "The lazy student goldbricked his homework by pretending to research all day.",
            "sent3": "She tried to goldbrick her chores by rearranging the same papers over and over.",
            "sent4": "The employee goldbricked his tasks by constantly shuffling papers without actually working.",
            "sent5": "The manager noticed the employee trying to goldbrick his responsibilities and warned him sternly."
        },
        {
            "definition": "A person who deceives or swindles others by means of a gold brick.",
            "pos": "noun",
            "sent1": "The goldbricked promised the investors huge returns on their 'gold' bricks.",
            "sent2": "The cunning goldbricked convinced many to invest in his 'rare' gold bricks.",
            "sent3": "The town's notorious goldbricked was finally caught after years of cheating people.",
            "sent4": "The smooth-talking goldbricked managed to sell fake gold bricks to the entire neighborhood.",
            "sent5": "Beware of the charming goldbricked who claims to have a special deal on gold bricks."
        }
    ]
}