{
    "term": "goldarning",
    "meanings": [
        {
            "definition": "The act of decorating with gold.",
            "pos": "noun",
            "sent1": "She loved the elegant goldarning on the picture frame.",
            "sent2": "The goldarning on the vase made it look luxurious.",
            "sent3": "The goldarning on the cake was so shiny, it almost blinded us!",
            "sent4": "Her smile was like a beautiful goldarning, brightening up the room.",
            "sent5": "The goldarning on the crown sparkled like a thousand tiny stars."
        },
        {
            "definition": "A decorative technique using gold.",
            "pos": "noun",
            "sent1": "The artist's intricate goldarning was admired by all.",
            "sent2": "Learning the art of goldarning requires patience and skill.",
            "sent3": "The goldarning on the statue seemed to wink in the sunlight.",
            "sent4": "Her laughter was like a touch of goldarning in the dull room.",
            "sent5": "The delicate goldarning on the jewelry caught everyone's eye."
        },
        {
            "definition": "To adorn with gold.",
            "pos": "verb",
            "sent1": "She decided to goldarn the edges of the mirror for a touch of elegance.",
            "sent2": "The craftsman carefully goldarned the intricate patterns on the box.",
            "sent3": "He playfully goldarned his shoes with glitter for the party.",
            "sent4": "Her words were goldarned with kindness, making them even more meaningful.",
            "sent5": "The sunset seemed to goldarn the sky with its golden hues."
        },
        {
            "definition": "The process of adding gold to something for decoration.",
            "pos": "noun",
            "sent1": "The goldarning of the frame took hours of meticulous work.",
            "sent2": "The goldarning of the sword made it a prized possession.",
            "sent3": "The goldarning of the room transformed it into a royal chamber.",
            "sent4": "His music was like a gentle goldarning of the air around us.",
            "sent5": "The goldarning of the dress shimmered under the lights."
        }
    ]
}