{
    "term": "goldbrick",
    "meanings": [
        {
            "definition": "A person who shirks work or responsibility.",
            "pos": "noun",
            "sent1": "Tom is known as a goldbrick at the office because he avoids doing his tasks.",
            "sent2": "The supervisor warned everyone to watch out for any goldbrick trying to avoid their duties.",
            "sent3": "When the team needed help, Jerry pretended to be a goldbrick and disappeared.",
            "sent4": "Her lazy attitude turned her into a goldbrick, just sitting around while others worked.",
            "sent5": "The goldbrick in the group always finds a way to avoid contributing to the project."
        },
        {
            "definition": "To deceive or swindle.",
            "pos": "verb",
            "sent1": "The scammer tried to goldbrick unsuspecting victims with promises of easy money.",
            "sent2": "Be cautious of those who may try to goldbrick you into making hasty decisions.",
            "sent3": "The con artist's plan to goldbrick the elderly couple was foiled by the vigilant neighbor.",
            "sent4": "She realized too late that the smooth-talking salesman had managed to goldbrick her into buying unnecessary products.",
            "sent5": "The dishonest contractor attempted to goldbrick the homeowner by overcharging for repairs."
        },
        {
            "definition": "A worthless object that appears valuable.",
            "pos": "noun",
            "sent1": "The shiny rock turned out to be a mere goldbrick, fooling many with its appearance.",
            "sent2": "The antique vase was actually a goldbrick, with no historical significance.",
            "sent3": "The treasure hunter was disappointed to find the chest filled with goldbrick replicas.",
            "sent4": "The jewelry store unknowingly sold a goldbrick necklace, thinking it was genuine.",
            "sent5": "The museum curator was embarrassed to discover the artifact was just a goldbrick imitation."
        }
    ]
}