{
    "term": "golgotha",
    "meanings": [
        {
            "definition": "A place of suffering or sacrifice",
            "pos": "noun",
            "sent1": "The old, abandoned factory became a golgotha for the stray animals seeking shelter.",
            "sent2": "The battlefield was a golgotha of fallen soldiers, a somber reminder of the cost of war.",
            "sent3": "The crowded subway at rush hour felt like a golgotha of commuters, all packed in like sardines.",
            "sent4": "The hospital emergency room was a golgotha of pain and anguish, with patients waiting for care.",
            "sent5": "The refugee camp was a golgotha of despair, with families struggling to survive each day."
        },
        {
            "definition": "A place of burial",
            "pos": "noun",
            "sent1": "The peaceful cemetery served as a golgotha for generations of families, honoring their loved ones.",
            "sent2": "The ancient tomb was a mysterious golgotha, holding secrets of the past.",
            "sent3": "The backyard garden became a golgotha for the family's beloved pets, marked with small gravestones.",
            "sent4": "The battlefield was a golgotha of fallen soldiers, a solemn reminder of the sacrifices made.",
            "sent5": "The mountain peak was a golgotha for climbers who never made it back down, a haunting memorial."
        },
        {
            "definition": "A place of execution",
            "pos": "noun",
            "sent1": "The medieval town square was a golgotha where public punishments were carried out.",
            "sent2": "The condemned prisoner faced the gallows, a golgotha where justice and mercy met.",
            "sent3": "The kitchen after a failed cooking experiment looked like a golgotha of burnt dishes.",
            "sent4": "The abandoned prison became a golgotha of broken dreams and lost souls.",
            "sent5": "The guillotine was a golgotha of swift justice, ending lives in an instant."
        }
    ]
}