{
    "term": "goofing",
    "meanings": [
        {
            "definition": "To make a silly mistake or error.",
            "pos": "verb",
            "sent1": "I was goofing when I accidentally put salt instead of sugar in the cake batter.",
            "sent2": "She always ends up goofing on her math homework, but she learns from her mistakes.",
            "sent3": "While goofing in the kitchen, I mixed up the salt and sugar for the cookies!",
            "sent4": "I felt like I was goofing my way through the dance routine, but I managed to finish it.",
            "sent5": "The comedian's act was full of goofing around and making hilarious mistakes."
        },
        {
            "definition": "To engage in playful or silly behavior.",
            "pos": "verb",
            "sent1": "The children were goofing around in the playground, laughing and playing tag.",
            "sent2": "During the break, the coworkers enjoyed goofing off and sharing jokes in the office.",
            "sent3": "The puppy was goofing with its tail, chasing it in circles around the yard.",
            "sent4": "The friends spent the afternoon goofing around at the park, enjoying each other's company.",
            "sent5": "The siblings were always goofing about, creating fun memories together."
        },
        {
            "definition": "To waste time or fool around.",
            "pos": "verb",
            "sent1": "Instead of studying, he spent the evening goofing on his phone, scrolling through social media.",
            "sent2": "The students were caught goofing in class instead of paying attention to the lesson.",
            "sent3": "She knew she was goofing when she spent hours rearranging her room instead of doing her chores.",
            "sent4": "The group decided to goof off at the beach, playing games and relaxing under the sun.",
            "sent5": "I caught myself goofing around when I should have been working on my project."
        }
    ]
}