{
    "term": "goofballs",
    "meanings": [
        {
            "definition": "A silly or foolish person",
            "pos": "noun",
            "sent1": "Tommy is always the goofballs in our group, making us laugh with his silly jokes.",
            "sent2": "The goofballs at the party were dancing crazily and having a great time.",
            "sent3": "The goofballs in the comedy show had the audience roaring with laughter.",
            "sent4": "She felt like a goofballs in a world of serious adults, always finding humor in everything.",
            "sent5": "The goofballs in the class, Billy, was known for his funny pranks and jokes."
        },
        {
            "definition": "A foolish or silly action",
            "pos": "noun",
            "sent1": "Running around in circles was a total goofballs, but it made everyone giggle.",
            "sent2": "His attempt to juggle while riding a unicycle was a goofballs that ended in a mess.",
            "sent3": "The goofballs of trying to fit all the groceries in one bag resulted in a comical scene.",
            "sent4": "Her decision to wear mismatched socks was a goofballs that made a fashion statement.",
            "sent5": "The goofballs of trying to balance on a ball while holding a cup of water was hilarious to watch."
        },
        {
            "definition": "A type of medication or drug, typically a stimulant or hallucinogen",
            "pos": "noun",
            "sent1": "The doctor prescribed some goofballs to help with her anxiety and sleep issues.",
            "sent2": "Abusing goofballs can have serious consequences on a person's health.",
            "sent3": "The teenagers thought it would be fun to experiment with goofballs, not realizing the dangers.",
            "sent4": "He felt like he was floating on clouds after taking the goofballs the doctor gave him.",
            "sent5": "The effects of the goofballs made everything seem brighter and more vibrant to her."
        }
    ]
}