{
    "term": "gooseneck",
    "meanings": [
        {
            "definition": "A curved or bent part resembling the neck of a goose.",
            "pos": "noun",
            "sent1": "The lamp had a beautiful gooseneck that arched gracefully over the desk.",
            "sent2": "The gooseneck of the swan made it look elegant as it glided across the pond.",
            "sent3": "The gooseneck of the hose seemed to mimic the shape of a playful goose.",
            "sent4": "Her hair cascaded down her back in a gooseneck, adding a touch of whimsy to her appearance.",
            "sent5": "The gooseneck of the river wound its way through the valley, reflecting the sunlight."
        },
        {
            "definition": "A flexible tube or pipe with a curved shape.",
            "pos": "noun",
            "sent1": "The gooseneck of the showerhead allowed for easy adjustment of the water flow.",
            "sent2": "The gooseneck of the lamp could be twisted to direct the light where needed.",
            "sent3": "The gooseneck of the hose danced in the wind, resembling a snake charmer's instrument.",
            "sent4": "The gooseneck of the road curved sharply, leading us into unknown territory.",
            "sent5": "The gooseneck of the tree branch swayed gently in the breeze, like a natural swing."
        },
        {
            "definition": "A type of trailer hitch with a curved extension.",
            "pos": "noun",
            "sent1": "The gooseneck of the trailer hitch allowed for smoother turns while driving.",
            "sent2": "The gooseneck of the truck made it easier to tow heavy loads behind.",
            "sent3": "The gooseneck of the hitch looked like a friendly smile on the back of the vehicle.",
            "sent4": "The gooseneck of the caravan ensured a secure connection between the truck and trailer.",
            "sent5": "The gooseneck of the hitch provided stability and control during the journey."
        }
    ]
}