{
    "term": "gore",
    "meanings": [
        {
            "definition": "Blood that has been shed, especially as a result of violence.",
            "pos": "noun",
            "sent1": "The horror movie was full of gore and made me cover my eyes.",
            "sent2": "The crime scene was covered in gore, a chilling sight for the investigators.",
            "sent3": "The Halloween costume was so realistic with fake gore that it scared everyone at the party.",
            "sent4": "The artist used red paint to create a painting that resembled the gore of a battlefield.",
            "sent5": "The documentary showed the brutal reality of war with graphic images of gore."
        },
        {
            "definition": "A triangular piece of material inserted in a garment to make it wider or more full.",
            "pos": "noun",
            "sent1": "The dress had beautiful lace gore sewn into the skirt for added elegance.",
            "sent2": "The tailor added a gore to the dress to give it a more flowing silhouette.",
            "sent3": "The costume designer used a colorful gore to enhance the flare of the dancer's outfit.",
            "sent4": "The fashion designer's new collection featured gowns with intricate gored details.",
            "sent5": "The historical costume had elaborate gores that added volume and movement to the dress."
        },
        {
            "definition": "To pierce or stab with a horn or tusk.",
            "pos": "verb",
            "sent1": "The bull tried to gore the matador with its horns during the intense bullfight.",
            "sent2": "The rhinoceros can gore predators with its powerful horn when threatened.",
            "sent3": "The mischievous unicorn pretended to gore its friends with its magical horn.",
            "sent4": "The warrior's spear was like a deadly horn ready to gore any enemy in battle.",
            "sent5": "The charging buffalo attempted to gore anything in its path with its sharp horns."
        }
    ]
}