{
    "term": "goth",
    "meanings": [
        {
            "definition": "A member of a subculture that combines dark, morbid elements with punk and other musical styles.",
            "pos": "noun",
            "sent1": "The goth at the concert wore all black clothes and heavy eyeliner.",
            "sent2": "She enjoys listening to goth music while reading poetry.",
            "sent3": "The goth joked that they only come out at night because they are allergic to sunlight.",
            "sent4": "Her goth soul was as deep and mysterious as the darkest ocean.",
            "sent5": "The goth's presence was like a shadow, always lingering in the background."
        },
        {
            "definition": "A style of rock music characterized by dark, introspective lyrics and heavy, distorted guitar sounds.",
            "pos": "noun",
            "sent1": "The goth band's music was filled with haunting lyrics and eerie guitar riffs.",
            "sent2": "Many teenagers enjoy listening to goth for its emotional depth.",
            "sent3": "The goth music played at the party set a spooky atmosphere.",
            "sent4": "The goth melodies echoed through the night like ghostly whispers.",
            "sent5": "Listening to goth felt like diving into a pool of melancholy."
        },
        {
            "definition": "To move or proceed, especially to a specified location or in a specified direction.",
            "pos": "verb",
            "sent1": "She decided to goth towards the park to enjoy the sunny weather.",
            "sent2": "The cat likes to goth around the house exploring every corner.",
            "sent3": "The squirrel tried to goth up the tree but slipped on the wet bark.",
            "sent4": "The river seemed to goth endlessly towards the horizon.",
            "sent5": "The clouds gothed slowly across the sky, casting shadows on the ground."
        },
        {
            "definition": "To be in the process of doing something.",
            "pos": "verb",
            "sent1": "He was gothing through his homework when the phone rang.",
            "sent2": "The chef was gothing in the kitchen, preparing a delicious meal.",
            "sent3": "She gothed around the room, trying to decide where to place the furniture.",
            "sent4": "Time goths swiftly when you're having fun with friends.",
            "sent5": "The colors gothed together on the canvas, creating a beautiful painting."
        }
    ]
}