{
    "term": "gothites",
    "meanings": [
        {
            "definition": "A person who is part of the goth subculture.",
            "pos": "noun",
            "sent1": "She is a gothites who loves wearing black clothes and dark makeup.",
            "sent2": "Many gothites enjoy listening to gothic music and expressing themselves through unique fashion choices.",
            "sent3": "The gothites at the party stood out with their dramatic outfits and mysterious aura.",
            "sent4": "Her gothites nature shone through in her love for all things dark and macabre.",
            "sent5": "The gothites in the movie were portrayed as misunderstood individuals with a passion for the darker side of life."
        },
        {
            "definition": "A style of music associated with the goth subculture.",
            "pos": "noun",
            "sent1": "The gothites at the concert swayed to the haunting melodies of gothic music.",
            "sent2": "Gothites often find solace in the melancholic lyrics and atmospheric sounds of gothic music.",
            "sent3": "The gothites' playlist was filled with eerie tunes that set the mood for a spooky night.",
            "sent4": "The gothic music enveloped the room, transporting the gothites to a world of darkness and introspection.",
            "sent5": "Listening to gothic music can evoke a range of emotions in gothites, from sorrow to empowerment."
        },
        {
            "definition": "A type of mineral.",
            "pos": "noun",
            "sent1": "The geologist identified the gothites in the rock sample as a rare mineral with unique properties.",
            "sent2": "Miners discovered a vein of gothites deep within the earth, sparking interest in its composition.",
            "sent3": "The gothites in the mineral collection glimmered under the light, captivating onlookers with its beauty.",
            "sent4": "The gothites mineral was prized for its striking appearance and geological significance.",
            "sent5": "Collectors sought after the gothites specimen for its rarity and intricate crystal structure."
        }
    ]
}