{
    "term": "grabbing",
    "meanings": [
        {
            "definition": "To seize suddenly or quickly",
            "pos": "verb",
            "sent1": "She was grabbing the toy from the shelf.",
            "sent2": "The cat was grabbing the mouse in its paws.",
            "sent3": "The magician was grabbing the audience's focus with his tricks.",
            "sent4": "The idea of traveling to space was grabbing her imagination.",
            "sent5": "The sound of thunder was grabbing everyone's attention."
        },
        {
            "definition": "To take hold of something",
            "pos": "verb",
            "sent1": "He was grabbing the rope to climb up the tree.",
            "sent2": "The child was grabbing the balloon tightly in her hand.",
            "sent3": "The monkey was grabbing the banana with a mischievous grin.",
            "sent4": "The sun was grabbing the horizon as it set in the evening sky.",
            "sent5": "The cold water was grabbing his feet as he stepped into the lake."
        },
        {
            "definition": "To capture or obtain forcibly",
            "pos": "verb",
            "sent1": "The police were grabbing the thief before he could escape.",
            "sent2": "The spider was grabbing the fly in its web for dinner.",
            "sent3": "The wind was grabbing the hat off his head and playing with it.",
            "sent4": "The idea was grabbing his mind, and he couldn't stop thinking about it.",
            "sent5": "The scent of fresh cookies was grabbing everyone's noses in the kitchen."
        },
        {
            "definition": "To attract or hold the attention of someone",
            "pos": "verb",
            "sent1": "The colorful poster was grabbing the children's interest.",
            "sent2": "The movie was grabbing the audience's emotions with its powerful scenes.",
            "sent3": "The clown was grabbing everyone's laughter with his silly antics.",
            "sent4": "The mystery novel was grabbing her curiosity, and she couldn't put it down.",
            "sent5": "The bright fireworks were grabbing everyone's gaze in the night sky."
        }
    ]
}