{
    "term": "grabble",
    "meanings": [
        {
            "definition": "To search with the hands in a hasty or clumsy way",
            "pos": "verb",
            "sent1": "She had to grabble in her bag to find her keys.",
            "sent2": "The child tried to grabble for the toy hidden in the box.",
            "sent3": "As she grabbled for her phone, it slipped further into the couch cushions.",
            "sent4": "In the dark room, his hands grabbled for the light switch.",
            "sent5": "The chef had to grabble for the right spice among the many jars."
        },
        {
            "definition": "To grope or feel around with the hands",
            "pos": "verb",
            "sent1": "He would grabble in the dark to find his way out of the cave.",
            "sent2": "The blindfolded person had to grabble to identify objects by touch.",
            "sent3": "The cat would grabble at the yarn, thinking it was a mouse.",
            "sent4": "Her fingers grabbled for the right thread in the sewing kit.",
            "sent5": "The child's hands grabbled for the hidden candy in the jar."
        },
        {
            "definition": "To scramble or struggle to obtain something",
            "pos": "verb",
            "sent1": "The competitors grabbled to reach the finish line first.",
            "sent2": "She had to grabble with the lock to open the door.",
            "sent3": "The squirrel would grabble with the nut to carry it up the tree.",
            "sent4": "The students grabbled for the last piece of cake at the party.",
            "sent5": "The workers grabbled to finish the project before the deadline."
        },
        {
            "definition": "To fish with the hands by groping underwater",
            "pos": "verb",
            "sent1": "The children would grabble in the shallow stream for tadpoles.",
            "sent2": "He would grabble in the pond to catch the slippery fish.",
            "sent3": "The otter would grabble for clams at the bottom of the river.",
            "sent4": "The diver had to grabble for the lost treasure in the sunken ship.",
            "sent5": "The boy loved to grabble for seashells along the sandy beach."
        }
    ]
}