{
    "term": "grades",
    "meanings": [
        {
            "definition": "A level of quality or rank",
            "pos": "noun",
            "sent1": "The toy car's quality was of the highest grades.",
            "sent2": "She received top grades for her excellent performance.",
            "sent3": "The cake's deliciousness was of such high grades that it disappeared in minutes.",
            "sent4": "His dedication to his craft reached grades that surpassed all expectations.",
            "sent5": "The sunset painted the sky with vibrant colors of different grades."
        },
        {
            "definition": "A mark or rating given to a student's work",
            "pos": "noun",
            "sent1": "The student proudly displayed her good grades on the fridge.",
            "sent2": "His grades in math improved after extra study sessions.",
            "sent3": "The cat's grades for catching mice were not impressive.",
            "sent4": "Her grades in art class were a reflection of her creativity.",
            "sent5": "The grades on the test paper revealed his hard work and dedication."
        },
        {
            "definition": "A slope or incline",
            "pos": "noun",
            "sent1": "The road had a steep grades that made it hard to climb.",
            "sent2": "The skiers enjoyed the gentle grades of the beginner slope.",
            "sent3": "The grades of the hill made it a challenging hike.",
            "sent4": "The grades of the mountain were daunting but rewarding to conquer.",
            "sent5": "The grades of the slide made it thrilling for the children."
        },
        {
            "definition": "A degree of inclination or decline",
            "pos": "noun",
            "sent1": "The ship had to navigate the varying grades of the river.",
            "sent2": "The graph showed the different grades of temperature change.",
            "sent3": "The grades of the rollercoaster made her stomach drop.",
            "sent4": "The grades of the path made it difficult to walk uphill.",
            "sent5": "The grades of the hillside created a beautiful landscape."
        }
    ]
}