{
    "term": "grained",
    "meanings": [
        {
            "definition": "Having a particular type of grain or texture.",
            "pos": "adjective",
            "sent1": "The wooden table had a grained surface that felt rough to the touch.",
            "sent2": "The artist used a grained paper to create a textured effect in the painting.",
            "sent3": "The cat's fur looked grained, making it seem like a tiny tiger.",
            "sent4": "The old door had a grained appearance, resembling the bark of a tree.",
            "sent5": "The bread had a grained crust that added a delightful crunch."
        },
        {
            "definition": "Having a specified number of grains.",
            "pos": "adjective",
            "sent1": "The farmer planted a grained field of wheat to ensure a plentiful harvest.",
            "sent2": "The jeweler crafted a grained necklace with exactly 100 tiny pearls.",
            "sent3": "The grained bag of rice weighed heavily in the chef's hands.",
            "sent4": "The grained jar contained a precise amount of sugar for the recipe.",
            "sent5": "The grained box held a perfect dozen of colorful marbles."
        },
        {
            "definition": "Having a particular type of grain pattern.",
            "pos": "adjective",
            "sent1": "The fabric had a grained design that resembled waves in the ocean.",
            "sent2": "The grained wallpaper added a unique pattern to the room.",
            "sent3": "The grained carpet looked like a field of flowers under the sunlight.",
            "sent4": "The grained tile floor created an illusion of movement in the hallway.",
            "sent5": "The grained curtain had a striped pattern that matched the furniture."
        },
        {
            "definition": "Having a particular type of grain size.",
            "pos": "adjective",
            "sent1": "The geologist examined the grained rock under a microscope to determine its size.",
            "sent2": "The grained sand on the beach varied in size from fine to coarse.",
            "sent3": "The grained soil in the garden was perfect for growing vegetables.",
            "sent4": "The grained sugar crystals were different sizes, creating a unique texture in the dessert.",
            "sent5": "The grained pebbles on the path provided a comfortable walking surface."
        }
    ]
}