{
    "term": "grain",
    "meanings": [
        {
            "definition": "A small, hard seed or fruit of a cereal plant",
            "pos": "noun",
            "sent1": "The farmer planted a grain of wheat in the field.",
            "sent2": "I enjoy eating bread made from whole grain wheat.",
            "sent3": "The squirrel stored the grain in its tiny pantry for the winter.",
            "sent4": "Her eyes sparkled like grains of sand in the sunlight.",
            "sent5": "The grain of rice was so small, it was hard to pick up with chopsticks."
        },
        {
            "definition": "A small, hard particle of a substance",
            "pos": "noun",
            "sent1": "I found a grain of sand in my shoe after the beach.",
            "sent2": "The chef added a grain of salt to the soup for flavor.",
            "sent3": "The detective discovered a grain of truth in the suspect's alibi.",
            "sent4": "His patience was wearing thin, like a single grain of sand in an hourglass.",
            "sent5": "The scientist observed the grain of pollen under the microscope."
        },
        {
            "definition": "A unit of weight equal to 1/7000th of a pound",
            "pos": "noun",
            "sent1": "The jeweler measured the diamond in grains.",
            "sent2": "Gold is often weighed in grains in the jewelry industry.",
            "sent3": "The baker carefully measured the yeast in grains for the recipe.",
            "sent4": "Time slipped through his fingers like grains of sand in an hourglass.",
            "sent5": "The pharmacist counted out the medication in grains for the prescription."
        },
        {
            "definition": "A texture or pattern of fibers in wood",
            "pos": "noun",
            "sent1": "The carpenter admired the fine grain of the oak wood.",
            "sent2": "The table had a beautiful grain that showed the quality of the wood.",
            "sent3": "The artist painted a grain pattern on the wooden sculpture for a realistic look.",
            "sent4": "The old door had a unique grain that told the story of its history.",
            "sent5": "The violin maker selected the wood for its tight grain and resonance."
        },
        {
            "definition": "A small amount or degree",
            "pos": "noun",
            "sent1": "She had a grain of hope that things would get better.",
            "sent2": "There was not a grain of truth in his wild story.",
            "sent3": "The comedian added a grain of humor to his routine.",
            "sent4": "His kindness was a grain of light in a dark world.",
            "sent5": "The student's confidence grew little by little, like a grain of sand turning into a pearl."
        }
    ]
}