{
    "term": "grampies",
    "meanings": [
        {
            "definition": "Grampies (noun): plural of grampy, a term of endearment for a grandfather.",
            "pos": "noun",
            "sent1": "My grampies always tell the best stories about the old days.",
            "sent2": "The family gathered around to celebrate with their grampies.",
            "sent3": "When my grampies fall asleep in the chair, we all sneak up and take silly selfies with him.",
            "sent4": "His grampies were like a treasure trove of wisdom and love.",
            "sent5": "The smell of pipe tobacco always reminds me of my grampies' den."
        },
        {
            "definition": "Grampies (verb): third person singular present of grampy, to act like a grandfather.",
            "pos": "verb",
            "sent1": "He grampies by teaching his grandson how to fish.",
            "sent2": "She grampies by always having a pocket full of candies for the kids.",
            "sent3": "The young man tried to grampies by wearing his pants up high like his grandpa.",
            "sent4": "She grampies so well that the neighborhood kids all call her 'Grandma' too.",
            "sent5": "The actor had to grampies for the role, learning how to walk with a cane and tell dad jokes."
        },
        {
            "definition": "Grampies (adjective): relating to or characteristic of a grandfather.",
            "pos": "adjective",
            "sent1": "The grampies sweater he wore was knitted with love by his granddaughter.",
            "sent2": "The old photo album was filled with grampies memories of family picnics.",
            "sent3": "The grampies clock on the mantel chimed every hour with a cheerful tune.",
            "sent4": "The antique rocking chair had a grampies charm that made everyone feel at home.",
            "sent5": "The cozy cabin in the woods had a grampies feel, with its crackling fireplace and rocking chair."
        }
    ]
}