{
    "term": "gramary",
    "meanings": [
        {
            "definition": "A type of magic or sorcery",
            "pos": "noun",
            "sent1": "The old book contained secrets of powerful gramary.",
            "sent2": "She believed in the existence of ancient gramary.",
            "sent3": "The children giggled at the idea of learning gramary spells.",
            "sent4": "His words held a mysterious gramary that captivated the audience.",
            "sent5": "The forest was filled with whispers of forgotten gramary."
        },
        {
            "definition": "The practice of magic or sorcery",
            "pos": "noun",
            "sent1": "In the world of fantasy, gramary was a common skill.",
            "sent2": "Legends spoke of great wizards mastering the art of gramary.",
            "sent3": "The witch's potion shop specialized in rare gramary ingredients.",
            "sent4": "The town was known for its dark history of forbidden gramary.",
            "sent5": "The castle was shrouded in tales of dark gramary rituals."
        },
        {
            "definition": "A spell or incantation",
            "pos": "noun",
            "sent1": "She whispered a powerful gramary to unlock the hidden door.",
            "sent2": "The ancient scroll contained a forbidden gramary.",
            "sent3": "The magician's hat was filled with colorful gramary scrolls.",
            "sent4": "The wizard's staff glowed with enchanting gramary.",
            "sent5": "The potion required a precise gramary to work its magic."
        },
        {
            "definition": "To practice magic or sorcery",
            "pos": "verb",
            "sent1": "The sorcerer would often gramary in the moonlight.",
            "sent2": "She decided to gramary to protect her village from harm.",
            "sent3": "The wizard chuckled as he began to gramary in front of the amazed crowd.",
            "sent4": "The old man warned against gramary without proper training.",
            "sent5": "The young apprentice eagerly learned how to gramary from the master."
        }
    ]
}