{
    "term": "grapnels",
    "meanings": [
        {
            "definition": "A small anchor with several flukes, used for grappling or dragging in the water.",
            "pos": "noun",
            "sent1": "The sailors used grapnels to anchor their boat securely in the harbor.",
            "sent2": "The fisherman's grapnels caught onto a rock at the bottom of the river.",
            "sent3": "As the storm raged on, the grapnels held onto the ocean floor like determined little claws.",
            "sent4": "Her determination was like a set of grapnels, firmly grasping onto her goals.",
            "sent5": "The image of the grapnels sinking into the seabed stayed with him, a symbol of strength and stability."
        },
        {
            "definition": "To seize or hold with a grapnel.",
            "pos": "verb",
            "sent1": "He grapnels the rope tightly to secure the boat to the dock.",
            "sent2": "She grapnels the loose end of the net to prevent it from drifting away.",
            "sent3": "The cat grapnels the toy mouse with its sharp claws, thinking it's real prey.",
            "sent4": "His words grapnelled her attention, holding it captive like a skilled magician.",
            "sent5": "The memory of her smile grapnels his heart, refusing to let go even in his dreams."
        },
        {
            "definition": "A grappling hook or similar device used for securing a ship to a mooring.",
            "pos": "noun",
            "sent1": "The old sailor's grapnels were rusty but reliable, always keeping his ship safe.",
            "sent2": "The crew threw the grapnels to the dock workers, who secured the ship in place.",
            "sent3": "The mischievous seagull stole one of the grapnels, thinking it was a shiny toy.",
            "sent4": "The grapnels of friendship kept them connected, no matter the distance between them.",
            "sent5": "The sound of the grapnels hitting the wooden dock echoed through the quiet harbor, signaling the ship's arrival."
        }
    ]
}