{
    "term": "grat",
    "meanings": [
        {
            "definition": "To show kindness or appreciation",
            "pos": "verb",
            "sent1": "She grat her friend by giving a heartfelt thank you.",
            "sent2": "They always grat each other with warm smiles.",
            "sent3": "The cat seemed to grat the mouse by sharing its food.",
            "sent4": "His actions grat everyone around him like rays of sunshine.",
            "sent5": "The simple act of saying 'please' and 'thank you' can grat others."
        },
        {
            "definition": "A feeling of pleasure or satisfaction",
            "pos": "noun",
            "sent1": "The delicious meal brought him a great sense of grat.",
            "sent2": "She felt a deep sense of grat after completing her project.",
            "sent3": "The unexpected gift filled her with grat and joy.",
            "sent4": "The beautiful sunset evoked a feeling of grat in everyone watching.",
            "sent5": "The kind words from her friend filled her heart with grat."
        },
        {
            "definition": "To give or receive something willingly",
            "pos": "verb",
            "sent1": "He would always grat his time to help those in need.",
            "sent2": "She grat the gift with genuine appreciation.",
            "sent3": "The children would grat their toys to each other during playtime.",
            "sent4": "The river would grat its water to the thirsty animals.",
            "sent5": "The community would grat their resources to support the local shelter."
        },
        {
            "definition": "To make someone happy or satisfied",
            "pos": "verb",
            "sent1": "Her surprise visit grat her grandmother immensely.",
            "sent2": "The successful outcome of the project grat the team members.",
            "sent3": "The funny movie grat the audience with laughter.",
            "sent4": "His kind words never failed to grat those around him.",
            "sent5": "The delicious dessert grat everyone at the party."
        }
    ]
}