{
    "term": "gravely",
    "meanings": [
        {
            "definition": "In a serious or solemn manner.",
            "pos": "adverb",
            "sent1": "She looked gravely at the doctor as he delivered the bad news.",
            "sent2": "The teacher spoke gravely to the students about the importance of honesty.",
            "sent3": "The clown tried to act gravely during the performance, but his silly antics kept shining through.",
            "sent4": "The storm clouds gathered gravely in the sky, foretelling a heavy downpour.",
            "sent5": "His gravely voice echoed through the empty hall, sending shivers down everyone's spines."
        },
        {
            "definition": "To a degree that is serious or critical.",
            "pos": "verb",
            "sent1": "She knew she had to gravely consider her options before making a decision.",
            "sent2": "The doctor had to gravely assess the patient's condition before proceeding with treatment.",
            "sent3": "The chef gravely seasoned the dish with too much salt, making it almost inedible.",
            "sent4": "The detective gravely examined the evidence, searching for any clues to solve the case.",
            "sent5": "The captain gravely steered the ship through the treacherous waters, avoiding disaster by a hair's breadth."
        },
        {
            "definition": "In a way that is severe or threatening.",
            "pos": "adverb",
            "sent1": "The dark clouds loomed gravely over the town, signaling an impending storm.",
            "sent2": "The dictator spoke gravely to the citizens, warning them of dire consequences if they disobeyed.",
            "sent3": "The cat arched its back gravely, trying to appear more intimidating than it actually was.",
            "sent4": "The old tree stood gravely in the forest, its twisted branches casting eerie shadows.",
            "sent5": "The villain's gravely whispered threats sent a chill down the hero's spine, fueling his determination to stop the evil plan."
        }
    ]
}