{
    "term": "gravelled",
    "meanings": [
        {
            "definition": "Covered with gravel.",
            "pos": "adjective",
            "sent1": "The driveway was gravelled, making it easy to walk on.",
            "sent2": "Her shoes were gravelled after the hike through the rocky terrain.",
            "sent3": "The gravelled path led us to a beautiful garden hidden in the woods.",
            "sent4": "His gravelled hands showed the hard work he put into the construction project.",
            "sent5": "The gravelled surface sparkled in the sunlight, creating a picturesque scene."
        },
        {
            "definition": "Confused or perplexed.",
            "pos": "adjective",
            "sent1": "She looked gravelled by the complex math problem on the test.",
            "sent2": "The directions were so gravelled that he ended up lost in the city.",
            "sent3": "His gravelled expression made everyone laugh during the magic show mix-up.",
            "sent4": "The gravelled look on her face showed she had no idea what was happening.",
            "sent5": "Their gravelled reactions to the surprise party were priceless."
        },
        {
            "definition": "To cover with gravel.",
            "pos": "verb",
            "sent1": "The workers gravelled the path to prevent mud during rainy days.",
            "sent2": "He gravelled the garden to create a neat and low-maintenance landscape.",
            "sent3": "She decided to gravelled the driveway for a fresh new look.",
            "sent4": "The construction crew will gravelled the road for better traction.",
            "sent5": "They gravelled the playground to make it safer for the children to play."
        },
        {
            "definition": "To confuse or perplex.",
            "pos": "verb",
            "sent1": "The tricky riddle gravelled the students during the competition.",
            "sent2": "His sudden change in plans gravelled his friends who were waiting for him.",
            "sent3": "The magician's illusions gravelled the audience, leaving them in awe.",
            "sent4": "The unexpected question gravelled the contestant in the quiz show.",
            "sent5": "The mysterious disappearance of the key gravelled everyone in the house."
        }
    ]
}