{
    "term": "greave",
    "meanings": [
        {
            "definition": "A piece of armor for the leg below the knee.",
            "pos": "noun",
            "sent1": "The knight wore sturdy greaves to protect his legs in battle.",
            "sent2": "Soldiers in ancient times often used greaves to shield their lower legs.",
            "sent3": "The greaves looked like shiny tubes on the knight's legs, making him resemble a walking metal statue.",
            "sent4": "Her determination was her greave, shielding her from the harsh criticisms of others.",
            "sent5": "The greaves clanked loudly as the knight marched, announcing his presence on the battlefield."
        },
        {
            "definition": "To equip with greaves.",
            "pos": "verb",
            "sent1": "The blacksmith would greave the armor before sending it off to the soldiers.",
            "sent2": "It was important to greave the soldiers properly before they headed into battle.",
            "sent3": "The young squire learned how to greave the knights' armor with precision and care.",
            "sent4": "She would greave the leg plates with intricate designs, adding a touch of elegance to the armor.",
            "sent5": "The armorers worked tirelessly to greave each set of armor, ensuring the soldiers were well-protected."
        },
        {
            "definition": "To protect with greaves.",
            "pos": "verb",
            "sent1": "The brave warrior greaved his legs before facing the dragon in combat.",
            "sent2": "She always made sure to greave her shins before engaging in any dangerous activities.",
            "sent3": "The clumsy knight forgot to greave his legs and ended up with bruises after the jousting match.",
            "sent4": "His unwavering faith in himself acted as a shield, greaving him against self-doubt.",
            "sent5": "The magical greaves enchanted by the wizard provided unparalleled protection to the wearer."
        }
    ]
}