{
    "term": "greedinesses",
    "meanings": [
        {
            "definition": "Excessive desire for more than is needed or deserved.",
            "pos": "noun",
            "sent1": "Her greedinesses for sweets led her to eat the entire cake in one sitting.",
            "sent2": "His greedinesses for power made him take advantage of others to climb the corporate ladder.",
            "sent3": "The squirrel's greedinesses for acorns was so extreme, it filled its entire nest with them.",
            "sent4": "The politician's greedinesses for money was like a bottomless pit, never satisfied with what he had.",
            "sent5": "The greedinesses of the dragon for treasure was legendary, hoarding gold and jewels in its lair."
        },
        {
            "definition": "The quality of being greedy.",
            "pos": "noun",
            "sent1": "The greedinesses of the child were evident when he refused to share his toys.",
            "sent2": "She could see the greedinesses in his eyes as he reached for the last piece of cake.",
            "sent3": "The greedinesses of the cat for treats was comical, always trying to steal more from the jar.",
            "sent4": "His greedinesses shone through when he insisted on taking the biggest slice of pizza for himself.",
            "sent5": "The greedinesses of the dog for attention was adorable, always wanting to be petted and praised."
        },
        {
            "definition": "The state of being greedy.",
            "pos": "noun",
            "sent1": "In the greedinesses of the moment, he grabbed all the cookies without thinking of others.",
            "sent2": "The greedinesses of the market led to inflated prices and shortages of essential goods.",
            "sent3": "The greedinesses of the storm for destruction was evident in the way it tore through the town.",
            "sent4": "The greedinesses of the fire for fuel consumed everything in its path, leaving only ashes behind.",
            "sent5": "The greedinesses of the river for land eroded the banks, changing the landscape over time."
        }
    ]
}