{
    "term": "greenweeds",
    "meanings": [
        {
            "definition": "Plants that are green in color and considered undesirable or invasive.",
            "pos": "noun, adjective",
            "sent1": "The gardeners worked hard to remove the greenweeds from the flower beds.",
            "sent2": "The farmer struggled to control the spread of greenweeds in his fields.",
            "sent3": "The greenweeds seemed to have a party in the garden overnight!",
            "sent4": "The greenweeds took over the yard like an army invading a territory.",
            "sent5": "The greenweeds in the forest were so thick, they blocked out the sunlight.",
            "sent6": "In the meadow, the greenweeds grew taller than the flowers.",
            "sent7": "The greenweeds made the backyard look messy and unkempt.",
            "sent8": "The greenweeds seemed to multiply overnight, much to the gardener's dismay.",
            "sent9": "The greenweeds were so stubborn, they kept coming back no matter how many times they were pulled out.",
            "sent10": "The greenweeds swayed gently in the breeze, creating a sea of green in the field."
        },
        {
            "definition": "To grow or proliferate rapidly, especially in a way that is unwanted or harmful.",
            "pos": "verb",
            "sent1": "If we don't take action soon, the greenweeds will overtake the entire garden.",
            "sent2": "The invasive species began to greenweeds in the once pristine forest.",
            "sent3": "The greenweeds in the yard seemed to have a mind of their own, spreading everywhere.",
            "sent4": "Neglecting the issue will only allow the problem to greenweeds further.",
            "sent5": "The rumors about the new plant species began to greenweeds throughout the community.",
            "sent6": "The greenweeds quickly took hold of the neglected field, choking out other plants.",
            "sent7": "The greenweeds seemed to multiply overnight, much to the gardener's dismay.",
            "sent8": "The farmer tried to greenweeds the spread of the invasive plants, but it was a challenging task.",
            "sent9": "The greenweeds in the garden seemed to have a life of their own, growing faster than anything else.",
            "sent10": "The greenweeds crept into the cracks of the pavement, showing no signs of stopping."
        }
    ]
}