{
    "term": "greedy",
    "meanings": [
        {
            "definition": "Having or showing an intense and selfish desire for something, especially wealth or power.",
            "pos": "adjective",
            "sent1": "The greedy man grabbed all the cookies for himself.",
            "sent2": "She is always greedy for more money, never satisfied with what she has.",
            "sent3": "The greedy squirrel hoarded all the nuts in the park, leaving none for the other animals.",
            "sent4": "His greedy eyes scanned the room, looking for any valuable items to take.",
            "sent5": "The greedy child refused to share his toys with his friends, wanting them all to himself."
        },
        {
            "definition": "Excessively eager to acquire or possess more, especially material things.",
            "pos": "adjective",
            "sent1": "The greedy shopper bought everything on sale, even things she didn't need.",
            "sent2": "He was so greedy for new gadgets that he spent all his savings on the latest phone.",
            "sent3": "The greedy collector filled his house with so many items that he could barely move around.",
            "sent4": "Her greedy hands reached out to grab the last piece of cake before anyone else could.",
            "sent5": "The greedy businessman always wanted more clients, never satisfied with his current success."
        },
        {
            "definition": "Having a strong or excessive desire for food or drink.",
            "pos": "adjective",
            "sent1": "The greedy puppy gobbled up his food in seconds, always hungry for more.",
            "sent2": "She felt greedy for chocolate after dinner and couldn't resist having a piece.",
            "sent3": "The greedy cat meowed loudly for treats, trying to get more than his fair share.",
            "sent4": "His greedy stomach rumbled loudly, demanding another helping of dessert.",
            "sent5": "The greedy toddler cried for more juice, not willing to share with his siblings."
        }
    ]
}