{
    "term": "greve",
    "meanings": [
        {
            "definition": "To cause mental or emotional distress",
            "pos": "verb",
            "sent1": "The loud noise can greve the baby and make him cry.",
            "sent2": "Seeing his pet run away greves him deeply.",
            "sent3": "The mischievous kitten's antics never fail to greve its owner.",
            "sent4": "The thought of failing the test greves her like a dark cloud.",
            "sent5": "The sad movie's ending will surely greve the audience."
        },
        {
            "definition": "A serious or grave situation",
            "pos": "noun",
            "sent1": "The car accident created a greve for the entire community.",
            "sent2": "Facing a greve like this requires careful planning and action.",
            "sent3": "The sudden power outage turned into a greve for the party guests.",
            "sent4": "The financial crisis was a greve that affected many families.",
            "sent5": "The natural disaster left behind a greve that will take time to heal."
        },
        {
            "definition": "A type of French wine-growing region",
            "pos": "noun",
            "sent1": "The vineyards in the greve produce exquisite wines.",
            "sent2": "Visiting the greve region is a dream for wine enthusiasts.",
            "sent3": "The winery's special event celebrated the greve's unique wines.",
            "sent4": "The greve's soil and climate contribute to its renowned wines.",
            "sent5": "The greve's winemakers take pride in their traditional methods."
        },
        {
            "definition": "A type of medieval weapon consisting of a long shaft with a blade at one end",
            "pos": "noun",
            "sent1": "The knight wielded the greve with skill in battle.",
            "sent2": "The blacksmith crafted a sturdy greve for the warrior.",
            "sent3": "The museum displayed an ancient greve used by knights.",
            "sent4": "In the medieval play, the hero brandished a greve against the dragon.",
            "sent5": "The greve's sharp blade gleamed in the sunlight of the battlefield."
        }
    ]
}