{
    "term": "gridlock",
    "meanings": [
        {
            "definition": "A situation where traffic is completely blocked in all directions.",
            "pos": "noun",
            "sent1": "During the rush hour, the city experienced severe gridlock.",
            "sent2": "The accident on the highway caused a massive gridlock for hours.",
            "sent3": "The gridlock was so bad that even the birds couldn't fly through it.",
            "sent4": "The gridlock resembled a giant puzzle with no solution in sight.",
            "sent5": "The gridlock turned the streets into a chaotic mess of honking cars and frustrated drivers."
        },
        {
            "definition": "A deadlock or stalemate in a political or business situation.",
            "pos": "noun",
            "sent1": "The negotiations reached a gridlock, and no progress was made.",
            "sent2": "The board meeting ended in a gridlock with no decision reached.",
            "sent3": "The gridlock in the office over the new project led to a hilarious dance-off.",
            "sent4": "The gridlock in the political debate mirrored a frozen computer screen.",
            "sent5": "The gridlock in the business deal felt like being stuck in quicksand, unable to move forward."
        },
        {
            "definition": "To cause a traffic jam or deadlock.",
            "pos": "verb",
            "sent1": "The construction work gridlocked the main road, causing chaos for commuters.",
            "sent2": "His reckless driving style often gridlocks the streets during peak hours.",
            "sent3": "She playfully joked that her bad singing could gridlock the entire city.",
            "sent4": "The sudden downpour gridlocked the traffic as umbrellas popped open everywhere.",
            "sent5": "The broken traffic light gridlocked the intersection, leaving drivers confused and frustrated."
        },
        {
            "definition": "To be stuck in a traffic jam or deadlock.",
            "pos": "verb",
            "sent1": "I was gridlocked on the highway for hours due to the accident.",
            "sent2": "The delivery truck got gridlocked in the narrow alleyway and couldn't move.",
            "sent3": "He pretended to be gridlocked in place, unable to move, to prank his friends.",
            "sent4": "Her thoughts were gridlocked, unable to find a way out of the mental traffic jam.",
            "sent5": "The old car's engine sputtered and died, leaving them gridlocked in the middle of nowhere."
        }
    ]
}