{
    "term": "grills",
    "meanings": [
        {
            "definition": "A metal framework used for cooking food over an open flame.",
            "pos": "noun",
            "sent1": "The campers roasted marshmallows on the grills.",
            "sent2": "The chef placed the steaks on the grills to sear them.",
            "sent3": "The grills sizzled happily as the burgers cooked to perfection.",
            "sent4": "The grills turned the raw meat into a delicious meal.",
            "sent5": "The smell of smoke from the grills filled the air with a mouth-watering aroma."
        },
        {
            "definition": "A set of metal bars used as a protective covering over a window or door.",
            "pos": "noun",
            "sent1": "The house had sturdy grills on all the windows.",
            "sent2": "She felt safe behind the grills of her front door.",
            "sent3": "The cat tried to squeeze through the grills but got stuck.",
            "sent4": "The grills rattled in the wind, creating a spooky sound.",
            "sent5": "The sunlight filtered through the grills, casting interesting shadows in the room."
        },
        {
            "definition": "To cook food on a grill.",
            "pos": "verb",
            "sent1": "Dad grills the burgers on the barbecue every weekend.",
            "sent2": "She grills vegetables for a healthy dinner option.",
            "sent3": "The chef grills the fish with a secret blend of spices.",
            "sent4": "The aroma of grilling meat wafted through the neighborhood.",
            "sent5": "The sound of sizzling meat on the grill made everyone's mouth water."
        },
        {
            "definition": "To question or interrogate someone closely.",
            "pos": "verb",
            "sent1": "The detective grills the suspect in the interrogation room.",
            "sent2": "She grills her kids about their whereabouts when they come home late.",
            "sent3": "The journalist grills the politician about the corruption scandal.",
            "sent4": "The teacher grills the students to ensure they understand the lesson.",
            "sent5": "The lawyer grills the witness to uncover the truth about the case."
        }
    ]
}