{
    "term": "grilleries",
    "meanings": [
        {
            "definition": "Grilleries (noun): A collection of grills or grilling equipment.",
            "pos": "noun",
            "sent1": "During the barbecue, the backyard was filled with various grilleries for cooking.",
            "sent2": "The store offers a wide selection of grilleries, from charcoal grills to gas grills.",
            "sent3": "At the picnic, everyone admired the impressive grilleries lined up for cooking.",
            "sent4": "The chef's grilleries resembled a metallic army ready for battle against hunger.",
            "sent5": "The smell of sizzling meat wafted from the grilleries, enticing everyone nearby."
        },
        {
            "definition": "Grilleries (verb): The act of grilling food on a grill.",
            "pos": "noun, verb",
            "sent1": "Dad's favorite weekend activity is the grilleries, where he cooks delicious burgers.",
            "sent2": "We enjoyed the grilleries at the beach, cooking hot dogs over an open flame.",
            "sent3": "The family reunion turned into a grilleries competition, with everyone showcasing their skills.",
            "sent4": "The backyard echoed with the sounds of laughter and grilleries as friends cooked together.",
            "sent5": "The aroma of the grilleries filled the air, making everyone's mouths water in anticipation."
        },
        {
            "definition": "Grilleries (adjective): Describing something related to grilling or grills.",
            "pos": "adjective",
            "sent1": "The chef's apron had a grilleries design, with images of BBQ tools and flames.",
            "sent2": "The restaurant's menu featured a special section for grilleries dishes like ribs and steaks.",
            "sent3": "The backyard party had a grilleries theme, with decorations of grills and skewers.",
            "sent4": "The grilleries festival showcased the latest in grilling technology and techniques.",
            "sent5": "The smell of smoke and spices created a grilleries atmosphere that made everyone hungry."
        }
    ]
}