{
    "term": "grislier",
    "meanings": [
        {
            "definition": "Causing a feeling of horror or disgust",
            "pos": "adjective",
            "sent1": "The grislier scene in the movie made me cover my eyes in fear.",
            "sent2": "The haunted house became even grislier as Halloween approached.",
            "sent3": "The grislier decorations at the Halloween party scared the guests, but they couldn't help but admire the creativity.",
            "sent4": "The grislier details of the crime scene painted a vivid picture of the heinous act.",
            "sent5": "The grislier images from the horror movie haunted my dreams for days."
        },
        {
            "definition": "Characterized by or involving violence or bloodshed",
            "pos": "adjective",
            "sent1": "The grislier scenes in the action movie kept me on the edge of my seat.",
            "sent2": "The battle became even grislier as more soldiers joined the fight.",
            "sent3": "The grislier fight between the two characters in the story added an unexpected twist.",
            "sent4": "The grislier details of the war were etched in the soldier's memory forever.",
            "sent5": "The grislier nature of the crime scene shocked even the seasoned detective."
        },
        {
            "definition": "Involving or showing death or violence in a very detailed and realistic way",
            "pos": "adjective",
            "sent1": "The grislier images in the documentary left a lasting impact on the viewers.",
            "sent2": "The novel's grislier descriptions of the battlefield transported the readers to the war zone.",
            "sent3": "The grislier portrayal of the murder mystery kept the audience guessing until the very end.",
            "sent4": "The grislier details of the crime scene were meticulously analyzed by the forensic team.",
            "sent5": "The grislier aspects of the horror story made it hard to sleep at night."
        }
    ]
}