{
    "term": "groins",
    "meanings": [
        {
            "definition": "The area of the body where the legs meet the torso.",
            "pos": "noun",
            "sent1": "He felt a sharp pain in his groins after running for a long time.",
            "sent2": "She stretched her groins before starting her dance class.",
            "sent3": "The comedian joked about accidentally kicking himself in the groins during a soccer game.",
            "sent4": "The groins of the statue seemed to embrace the onlookers with their curved elegance.",
            "sent5": "The doctor pointed to the groins on the anatomy chart to explain the muscle structure."
        },
        {
            "definition": "A structure built to protect a shoreline from erosion.",
            "pos": "noun",
            "sent1": "The engineers reinforced the groins along the beach to prevent further erosion.",
            "sent2": "The waves crashed against the groins, showing their strength in holding back the sea.",
            "sent3": "The groins along the coast stood like silent guardians against the relentless waves.",
            "sent4": "The groins jutted out into the ocean, a man-made barrier against nature's force.",
            "sent5": "The groins created a picturesque scene as the sun set behind them, casting long shadows."
        },
        {
            "definition": "A curved edge formed by two intersecting vaults.",
            "pos": "noun",
            "sent1": "The cathedral's architecture featured intricate groins that added to its grandeur.",
            "sent2": "The artist sketched the groins of the archway to capture their unique shape.",
            "sent3": "The groins in the ceiling created interesting patterns that mesmerized the visitors.",
            "sent4": "Light played on the groins of the structure, creating a play of shadows and highlights.",
            "sent5": "The groins in the design gave the room a sense of depth and dimension."
        }
    ]
}