{
    "term": "gross",
    "meanings": [
        {
            "definition": "Total, entire, complete.",
            "pos": "adjective",
            "sent1": "The gross amount of candy in the jar was 100 pieces.",
            "sent2": "The gross weight of the shipment was 500 pounds.",
            "sent3": "It was a gross miscalculation to assume the answer without checking.",
            "sent4": "The gross silence in the room made everyone uncomfortable.",
            "sent5": "The gross darkness of the night enveloped the city."
        },
        {
            "definition": "Disgusting, offensive, repulsive.",
            "pos": "adjective",
            "sent1": "The smell from the garbage can was really gross.",
            "sent2": "She found the movie so gross that she had to look away.",
            "sent3": "The idea of eating bugs seemed gross at first, but then it became a trend.",
            "sent4": "The slimy texture of the food was grossing out the diners.",
            "sent5": "The gross sight of the decaying fruit made her stomach turn."
        },
        {
            "definition": "Coarse, rough, unrefined.",
            "pos": "adjective",
            "sent1": "The gross fabric of the old couch was scratchy against her skin.",
            "sent2": "His manners were so gross that he was often avoided at social events.",
            "sent3": "The gross language used by the comedian shocked the audience.",
            "sent4": "The gross texture of the unfinished wood was unpleasant to touch.",
            "sent5": "The gross sound of the engine indicated it needed repair."
        },
        {
            "definition": "A group of 144 items.",
            "pos": "noun",
            "sent1": "She ordered a gross of pencils for the school year.",
            "sent2": "The store sold a gross of eggs to the bakery.",
            "sent3": "The magician pulled out a gross of colorful scarves from his hat.",
            "sent4": "The warehouse received a shipment of a gross of light bulbs.",
            "sent5": "The company purchased a gross of pens for the office staff."
        }
    ]
}