{
    "term": "grotesquely",
    "meanings": [
        {
            "definition": "In a manner that is distorted or unnatural in shape or appearance.",
            "pos": "adverb",
            "sent1": "The artist painted the tree grotesquely, with twisted branches and strange colors.",
            "sent2": "The old house was decorated grotesquely with mismatched furniture and bright patterns.",
            "sent3": "The clown's makeup was applied grotesquely, making him look like a colorful monster.",
            "sent4": "The shadows in the dimly lit room danced grotesquely on the walls, creating eerie shapes.",
            "sent5": "The sculpture in the park was carved grotesquely, with exaggerated features and odd proportions."
        },
        {
            "definition": "In a manner that is shockingly or disgustingly ugly or absurd.",
            "pos": "adverb",
            "sent1": "The smell from the garbage can was grotesquely strong, making everyone cover their noses.",
            "sent2": "The villain in the movie laughed grotesquely as he revealed his evil plan.",
            "sent3": "The fashion designer's new collection was so grotesquely bright that it hurt the eyes.",
            "sent4": "The storm clouds gathered grotesquely in the sky, foretelling a heavy downpour.",
            "sent5": "The actor's performance was so bad that it was almost grotesquely comical to watch."
        },
        {
            "definition": "In a manner that is exaggerated or excessive in a way that is disturbing or offensive.",
            "pos": "adverb",
            "sent1": "The politician grotesquely exaggerated his opponent's flaws to win the election.",
            "sent2": "The horror movie depicted violence and gore grotesquely, leaving the audience shocked.",
            "sent3": "The cake was decorated grotesquely with too many bright colors and mismatched toppings.",
            "sent4": "The music blared grotesquely loud, causing discomfort to everyone in the room.",
            "sent5": "The gossip spread through the small town grotesquely, distorting the truth beyond recognition."
        }
    ]
}