{
    "term": "grounded",
    "meanings": [
        {
            "definition": "Having a solid foundation or basis",
            "pos": "adjective",
            "sent1": "The building felt grounded with its strong pillars and sturdy walls.",
            "sent2": "The scientist's theory was grounded in years of research and evidence.",
            "sent3": "The idea of using chocolate as a building material may not be grounded in reality.",
            "sent4": "Her beliefs were so grounded that they served as an anchor in times of uncertainty.",
            "sent5": "The tree's roots were deeply grounded in the rich soil, providing stability."
        },
        {
            "definition": "Connected to the earth",
            "pos": "adjective",
            "sent1": "The grounded tree stretched its roots deep into the soil for nourishment.",
            "sent2": "The grounded feeling of walking barefoot on grass brought a sense of peace.",
            "sent3": "The astronaut felt strangely grounded after returning from space.",
            "sent4": "Her mind was like a kite, always grounded by the pull of gravity.",
            "sent5": "The grounded rocks along the riverbank were smoothed by years of water flow."
        },
        {
            "definition": "Punished by being restricted to one's home or a certain place",
            "pos": "adjective",
            "sent1": "After breaking curfew, she was grounded for a week by her parents.",
            "sent2": "The mischievous puppy was grounded in the backyard for digging up the garden.",
            "sent3": "The cat looked at the closed door, feeling grounded for knocking over the vase.",
            "sent4": "Being grounded to her room felt like a prison sentence for the teenager.",
            "sent5": "The grounded child sat by the window, watching others play outside."
        },
        {
            "definition": "Rational and sensible",
            "pos": "adjective",
            "sent1": "His grounded advice helped his friends make wise decisions.",
            "sent2": "The grounded approach to problem-solving focused on practical solutions.",
            "sent3": "The idea of wearing a swimsuit in the snow was definitely not grounded.",
            "sent4": "Her grounded perspective on life kept her from getting caught up in drama.",
            "sent5": "The grounded decision to save money for a rainy day paid off in times of need."
        }
    ]
}