{
    "term": "growingly",
    "meanings": [
        {
            "definition": "In a growing manner",
            "pos": "adverb",
            "sent1": "The flowers in the garden were growingly blooming each day.",
            "sent2": "She was growingly excited about her upcoming birthday party.",
            "sent3": "The puppy growingly wagged its tail as it saw its owner approaching.",
            "sent4": "The sun growingly illuminated the sky as dawn approached.",
            "sent5": "The child's curiosity growingly led her to explore the world around her."
        },
        {
            "definition": "Increasingly",
            "pos": "adverb",
            "sent1": "His grades were growingly improving with each study session.",
            "sent2": "The storm clouds were growingly gathering in the sky.",
            "sent3": "The crowd growingly cheered as the team scored a goal.",
            "sent4": "The suspense growingly built up as the movie reached its climax.",
            "sent5": "The artist's skills were growingly recognized by art enthusiasts."
        },
        {
            "definition": "More and more",
            "pos": "adverb",
            "sent1": "She felt growingly confident with each successful presentation.",
            "sent2": "The snow was growingly covering the ground as the storm continued.",
            "sent3": "The laughter growingly filled the room as the jokes got funnier.",
            "sent4": "The excitement growingly spread among the crowd waiting for the concert.",
            "sent5": "The stars growingly appeared in the night sky as darkness fell."
        },
        {
            "definition": "Gradually becoming more prevalent or intense",
            "pos": "adjective",
            "sent1": "The growingly popular trend caught the attention of many fashion enthusiasts.",
            "sent2": "The growingly loud music from the party next door kept her awake.",
            "sent3": "The growingly spicy food made his taste buds tingle.",
            "sent4": "The growingly competitive market forced businesses to innovate.",
            "sent5": "The growingly dark clouds signaled an approaching storm."
        }
    ]
}