{
    "term": "growing",
    "meanings": [
        {
            "definition": "Increasing in size or quantity.",
            "pos": "adjective",
            "sent1": "The tree in our yard is growing taller every year.",
            "sent2": "The city's population is growing rapidly.",
            "sent3": "The cake was growing bigger in the oven, almost like magic.",
            "sent4": "Her enthusiasm for learning was growing like a wildfire.",
            "sent5": "The excitement in the room was growing with each passing minute."
        },
        {
            "definition": "Developing or maturing.",
            "pos": "adjective",
            "sent1": "The young puppy is growing into a loyal companion.",
            "sent2": "His skills are growing stronger with each practice session.",
            "sent3": "The idea of a talking dog was growing on him, making him chuckle.",
            "sent4": "Her confidence was growing like a flower blooming in spring.",
            "sent5": "The bond between the two friends was growing deeper every day."
        },
        {
            "definition": "Becoming larger or taller in size.",
            "pos": "adjective",
            "sent1": "The snowball was growing as it rolled down the hill.",
            "sent2": "The skyscraper was growing taller as construction progressed.",
            "sent3": "His pile of laundry seemed to be growing taller by the minute.",
            "sent4": "The shadow of the mountain was growing longer as the sun set.",
            "sent5": "The anticipation in the room was growing bigger by the second."
        },
        {
            "definition": "Cultivating or producing plants or crops.",
            "pos": "verb",
            "sent1": "She enjoys growing tomatoes in her backyard garden.",
            "sent2": "Farmers work hard to grow crops to feed the community.",
            "sent3": "The idea of growing a money tree sounded silly but intriguing.",
            "sent4": "His dedication to growing roses was like tending to a delicate art.",
            "sent5": "The joy of growing sunflowers brought a smile to her face."
        }
    ]
}