{
    "term": "grubber",
    "meanings": [
        {
            "definition": "A person who digs or searches for something in the ground.",
            "pos": "noun",
            "sent1": "The young grubby grubber found a shiny rock while digging in the garden.",
            "sent2": "The grubby grubber unearthed a hidden treasure during his excavation.",
            "sent3": "The little grubby grubber was so excited to find a buried toy in the backyard.",
            "sent4": "The dedicated grubby grubber delved deep into the soil, uncovering ancient artifacts.",
            "sent5": "The diligent grubby grubber never tires of exploring the earth for hidden gems."
        },
        {
            "definition": "A type of Australian football player who is skilled at ground-level play.",
            "pos": "noun",
            "sent1": "The agile grubby grubber swiftly picked up the loose ball and passed it to a teammate.",
            "sent2": "The grubby grubber's quick reflexes allowed him to intercept the ball effortlessly.",
            "sent3": "The determined grubby grubber outmaneuvered his opponents with his clever footwork.",
            "sent4": "The skilled grubby grubber weaved through the defense like a nimble dancer.",
            "sent5": "The talented grubby grubber's precision kicks always impress the crowd."
        },
        {
            "definition": "To dig or search for something in the ground.",
            "pos": "verb",
            "sent1": "She decided to grubber for worms in the moist soil for her science project.",
            "sent2": "The kids love to grubber for buried treasure in the sandbox during recess.",
            "sent3": "He playfully grubbered in the garden, pretending to be a treasure hunter.",
            "sent4": "The dog excitedly grubbered in the backyard, looking for his buried bone.",
            "sent5": "The archaeologist carefully grubbered the ancient site, hoping to uncover relics."
        }
    ]
}