{
    "term": "grubs",
    "meanings": [
        {
            "definition": "Larvae of insects, especially beetles",
            "pos": "noun",
            "sent1": "The garden was infested with grubs, tiny beetle larvae.",
            "sent2": "The farmer found grubs in the soil while planting his crops.",
            "sent3": "The grubs were having a party underground, munching on roots.",
            "sent4": "The grubs wriggled like tiny dancers in the soil.",
            "sent5": "The grubs squirmed and wiggled, eager to become beetles one day."
        },
        {
            "definition": "To dig or search for something in the ground, especially for food",
            "pos": "verb",
            "sent1": "The hungry squirrel grubs for acorns in the yard.",
            "sent2": "The dog grubs in the backyard looking for buried bones.",
            "sent3": "Grandpa grubs in the garden, searching for his lost keys.",
            "sent4": "The archaeologist grubs carefully in the ancient ruins.",
            "sent5": "The kids love to grub in the sand at the beach, searching for treasures."
        },
        {
            "definition": "A person who does menial work",
            "pos": "noun",
            "sent1": "The grubs at the construction site worked hard all day.",
            "sent2": "The young man started as a grub, sweeping floors at the office.",
            "sent3": "The office manager jokingly called himself the 'chief grub'.",
            "sent4": "The grubs in the kitchen tirelessly washed dishes and cleaned.",
            "sent5": "The new employee was excited to prove himself as a valuable grub."
        },
        {
            "definition": "To eat food greedily or without manners",
            "pos": "verb",
            "sent1": "The hungry child grubs down his meal in seconds.",
            "sent2": "The raccoon grubs on the leftovers left in the trash can.",
            "sent3": "The guests at the party started to grub on the buffet as soon as it was served.",
            "sent4": "The birds outside the window grubbed on the seeds in the feeder.",
            "sent5": "The teenager would always grub on snacks while watching TV in the evening."
        }
    ]
}