{
    "term": "grubbers",
    "meanings": [
        {
            "definition": "A person who digs or searches for food or other objects in the ground.",
            "pos": "noun",
            "sent1": "The little grubbers in the garden were excited to find some hidden treasures in the soil.",
            "sent2": "The archaeologist was a skilled grubber, uncovering ancient artifacts with care.",
            "sent3": "The hungry grubbers in the forest were on a mission to find the tastiest mushrooms.",
            "sent4": "She was a true grubber of information, always delving into books and research.",
            "sent5": "The curious grubber followed the trail of clues to solve the mystery."
        },
        {
            "definition": "A type of Australian rules football kick where the ball is kicked along the ground.",
            "pos": "noun",
            "sent1": "The player's precise grubber surprised the opponents and led to a goal.",
            "sent2": "During the match, he executed a perfect grubber kick to advance the ball.",
            "sent3": "The tricky grubber kick caught the defenders off guard, allowing a clear shot at the goal.",
            "sent4": "His strategic use of the grubber kick changed the momentum of the game.",
            "sent5": "The coach praised his team for practicing the grubber kick with dedication."
        },
        {
            "definition": "A type of gardening tool used for digging up weeds.",
            "pos": "noun",
            "sent1": "The gardener reached for the trusty grubber to remove the stubborn weeds.",
            "sent2": "With the sharp edge of the grubber, she easily uprooted the unwanted plants.",
            "sent3": "The mischievous squirrel mistook the grubber for a nut and tried to bury it.",
            "sent4": "In her hands, the grubber became a weapon against the invasive weeds.",
            "sent5": "The old grubber had seen many seasons of hard work in the garden."
        }
    ]
}