{
    "term": "grudge",
    "meanings": [
        {
            "definition": "A persistent feeling of ill will or resentment resulting from a past insult or injury.",
            "pos": "noun",
            "sent1": "She held a grudge against her friend for not inviting her to the party.",
            "sent2": "His grudge towards his brother started when he broke his favorite toy.",
            "sent3": "The grudge between the two siblings made family gatherings awkward.",
            "sent4": "The grudge in her heart grew like a dark cloud, overshadowing her happiness.",
            "sent5": "The grudge she carried was like a heavy burden, weighing her down every day."
        },
        {
            "definition": "To be resentful or envious of (someone) for (a possession or attribute).",
            "pos": "verb",
            "sent1": "She would often grudge her sister's success in school.",
            "sent2": "He didn't want to grudge his friend's new car, but he couldn't help feeling envious.",
            "sent3": "It was hard for him not to grudge his colleague's promotion, even though he tried to be happy for them.",
            "sent4": "She grudged her neighbor's beautiful garden, wishing hers could look the same.",
            "sent5": "The way he grudged his classmate's talent was evident in his jealous glances."
        },
        {
            "definition": "To give or allow reluctantly or resentfully.",
            "pos": "verb",
            "sent1": "She would grudge him access to the secret room in the house.",
            "sent2": "He grudged her the last piece of cake, but eventually gave it to her.",
            "sent3": "He grudged sharing his toys with his little brother, but did so begrudgingly.",
            "sent4": "She grudged him the opportunity to prove himself, doubting his abilities.",
            "sent5": "The teacher grudged the students extra time on the test, feeling it was unfair to others."
        }
    ]
}