{
    "term": "grunt",
    "meanings": [
        {
            "definition": "A low, short, guttural sound made by an animal or person.",
            "pos": "noun",
            "sent1": "The pig let out a loud grunt when it saw the food.",
            "sent2": "I heard a grunt coming from the bushes.",
            "sent3": "The grunt from the dog sounded like a funny hiccup.",
            "sent4": "The grunt of the engine signaled the start of the race.",
            "sent5": "The grunt of the bear echoed through the forest."
        },
        {
            "definition": "A low-ranking soldier in the military.",
            "pos": "noun",
            "sent1": "The grunt carried heavy equipment during the training.",
            "sent2": "The grunts lined up for inspection in the barracks.",
            "sent3": "The grunt's uniform was too big, making him look like a child playing dress-up.",
            "sent4": "The grunts stood at attention, ready for their orders.",
            "sent5": "The grunt's helmet gleamed under the sun."
        },
        {
            "definition": "To make a low, short, guttural sound.",
            "pos": "verb",
            "sent1": "The dog will grunt when it wants attention.",
            "sent2": "I accidentally stepped on a toy, causing it to grunt.",
            "sent3": "The old floorboards grunt under the weight of each step.",
            "sent4": "The car engine started to grunt before roaring to life.",
            "sent5": "The tree branches grunt in the wind."
        },
        {
            "definition": "To perform hard, physical labor.",
            "pos": "verb",
            "sent1": "The workers grunt as they lift the heavy boxes.",
            "sent2": "He had to grunt through the tough workout.",
            "sent3": "She pretended to grunt dramatically while carrying the groceries.",
            "sent4": "The machine grunted as it strained to lift the load.",
            "sent5": "The athlete grunted with effort as he crossed the finish line."
        }
    ]
}