{
    "term": "guardian",
    "meanings": [
        {
            "definition": "A person who guards, protects, or looks after something.",
            "pos": "noun",
            "sent1": "The brave guardian stood watch over the treasure chest.",
            "sent2": "The zookeeper acted as a guardian for the animals in the sanctuary.",
            "sent3": "The fluffy dog thought he was the guardian of the house, barking at every passing car.",
            "sent4": "The lighthouse served as a guardian, guiding ships safely through the stormy seas.",
            "sent5": "In the fairy tale, the magical sword was the only guardian against the evil sorcerer."
        },
        {
            "definition": "A person legally responsible for the care and management of a minor or incompetent person.",
            "pos": "noun",
            "sent1": "The court appointed her as the guardian of the orphaned siblings.",
            "sent2": "The aunt became the legal guardian of her niece after her parents passed away.",
            "sent3": "The mischievous child jokingly called his older sister the guardian of bedtime.",
            "sent4": "The wise old owl was seen as the guardian of the forest, watching over all its inhabitants.",
            "sent5": "The superhero was not only a guardian of the city but also a mentor to the young sidekick."
        },
        {
            "definition": "A protective device or safety feature.",
            "pos": "noun",
            "sent1": "The helmet acted as a guardian for his head during the bike ride.",
            "sent2": "The firewall on the computer served as a guardian against online threats.",
            "sent3": "The umbrella became his guardian against the unexpected rain shower.",
            "sent4": "The seatbelt in the car was a silent guardian, ready to protect in case of a sudden stop.",
            "sent5": "The sunscreen lotion was the guardian of her skin, shielding it from harmful UV rays."
        }
    ]
}