{
    "term": "guernsey",
    "meanings": [
        {
            "definition": "A type of sweater",
            "pos": "noun",
            "sent1": "My grandmother knitted me a cozy guernsey for the winter.",
            "sent2": "She wore a guernsey over her blouse to keep warm.",
            "sent3": "The guernsey was so itchy, it made me dance like a silly monkey!",
            "sent4": "The guernsey hugged her like a warm embrace on a cold day.",
            "sent5": "The guernsey's soft fabric felt like a gentle hug from a friend."
        },
        {
            "definition": "A breed of dairy cattle",
            "pos": "noun",
            "sent1": "The guernsey cows produced rich milk for the farm.",
            "sent2": "Farmers often choose guernsey cattle for their dairy farms.",
            "sent3": "The guernsey cow tried to do a cartwheel, but she tipped over instead!",
            "sent4": "The guernsey cattle dotted the green fields like golden patches.",
            "sent5": "The guernsey's gentle eyes mirrored the calm of the countryside."
        },
        {
            "definition": "A type of cow",
            "pos": "noun",
            "sent1": "The guernsey grazed peacefully in the meadow.",
            "sent2": "The farmer milked the guernsey every morning.",
            "sent3": "The guernsey cow wore a tiny hat and pretended to be a cowboy!",
            "sent4": "The guernsey's brown and white coat shone in the sunlight.",
            "sent5": "The guernsey's gentle moo filled the air with tranquility."
        },
        {
            "definition": "A type of potato",
            "pos": "noun",
            "sent1": "The guernsey potatoes were perfect for roasting.",
            "sent2": "She mashed the guernsey potatoes with butter and herbs.",
            "sent3": "The guernsey potato rolled off the table and into the soup pot!",
            "sent4": "The guernsey potato's earthy aroma filled the kitchen.",
            "sent5": "The guernsey potato's golden skin glistened in the oven light."
        },
        {
            "definition": "A type of apple",
            "pos": "noun",
            "sent1": "The guernsey apples were crisp and sweet.",
            "sent2": "He picked a basket of guernsey apples from the orchard.",
            "sent3": "The guernsey apple tried to juggle with the other fruits but kept dropping them!",
            "sent4": "The guernsey apple's red skin gleamed in the sunlight.",
            "sent5": "The guernsey apple's juicy flesh burst with flavor in every bite."
        }
    ]
}