{
    "term": "guids",
    "meanings": [
        {
            "definition": "To show the way to someone by leading or directing them.",
            "pos": "verb",
            "sent1": "She guids her little brother through the maze.",
            "sent2": "The tour guide guids visitors around the museum.",
            "sent3": "The dog guids the lost cat back home.",
            "sent4": "His bright smile guids others to happiness.",
            "sent5": "The lighthouse guids ships safely to shore."
        },
        {
            "definition": "A person who advises or shows the way to others.",
            "pos": "noun",
            "sent1": "The wise old man is a trusted guids in the village.",
            "sent2": "The scout leader is a great guids for the young campers.",
            "sent3": "The friendly guids always has the best hiking tips.",
            "sent4": "She is a shining guids in the world of mentorship.",
            "sent5": "The experienced teacher is a valuable guids to her students."
        },
        {
            "definition": "A device or mechanism that directs or controls the movement of something.",
            "pos": "noun",
            "sent1": "The compass is a reliable guids for hikers.",
            "sent2": "The traffic light is an essential guids for drivers.",
            "sent3": "The GPS system is a modern guids for travelers.",
            "sent4": "The remote control is a convenient guids for changing channels.",
            "sent5": "The steering wheel is a crucial guids for steering the car."
        },
        {
            "definition": "A set of rules or principles that provide direction or advice.",
            "pos": "noun",
            "sent1": "The company follows strict guids for ethical behavior.",
            "sent2": "The recipe book is a helpful guids for cooking.",
            "sent3": "The etiquette guids at the dinner party were amusingly strict.",
            "sent4": "The constitution is a foundational guids for the country.",
            "sent5": "The safety manual is an important guids for workplace safety."
        }
    ]
}