{
    "term": "guisards",
    "meanings": [
        {
            "definition": "A person who wears a mask or costume for a disguise.",
            "pos": "noun",
            "sent1": "During Halloween, many children enjoy dressing up as guisards to trick-or-treat.",
            "sent2": "The theater troupe consisted of talented guisards who entertained the audience with their performances.",
            "sent3": "The guisards at the masquerade ball had everyone guessing their true identities.",
            "sent4": "The guisards moved through the crowd like mysterious shadows, their true faces hidden behind elaborate masks.",
            "sent5": "The guisards' costumes were so elaborate that even their closest friends couldn't recognize them."
        },
        {
            "definition": "A group of people who dress up in masks or costumes for entertainment.",
            "pos": "noun",
            "sent1": "The carnival parade was a colorful spectacle with various guisards showcasing their elaborate costumes.",
            "sent2": "The circus featured a talented group of guisards who amazed the audience with their acrobatics.",
            "sent3": "The guisards at the party brought laughter and joy with their funny antics.",
            "sent4": "The guisards danced gracefully, their movements synchronized like a well-oiled machine.",
            "sent5": "The guisards' performance was a feast for the eyes, captivating everyone in the audience."
        },
        {
            "definition": "To disguise oneself by wearing a mask or costume.",
            "pos": "verb",
            "sent1": "The spy decided to guisard himself to infiltrate the enemy's base undetected.",
            "sent2": "She guisards as a clown to entertain children at birthday parties.",
            "sent3": "He tried to guisard as a tree in the game of hide-and-seek, but his giggles gave him away.",
            "sent4": "The chameleon can guisard itself to blend seamlessly with its surroundings.",
            "sent5": "In the play, the protagonist must guisard to escape capture by the villain."
        }
    ]
}