{
    "term": "gumptious",
    "meanings": [
        {
            "definition": "Showing initiative and resourcefulness.",
            "pos": "adjective",
            "sent1": "The gumptious student took charge of the project and came up with creative solutions.",
            "sent2": "She is known for her gumptious attitude towards challenges, always finding a way to overcome them.",
            "sent3": "The gumptious squirrel managed to find a way into the bird feeder despite all obstacles.",
            "sent4": "Her gumptious spirit was like a bright light in the dark, guiding others towards success.",
            "sent5": "The gumptious entrepreneur turned a small idea into a thriving business through sheer determination."
        },
        {
            "definition": "Energetic and enthusiastic.",
            "pos": "adjective",
            "sent1": "The gumptious puppy ran around the yard with boundless energy.",
            "sent2": "She greeted each day with a gumptious smile, ready to tackle whatever came her way.",
            "sent3": "The gumptious child's laughter filled the room with joy and excitement.",
            "sent4": "Her gumptious personality was like a burst of sunshine on a cloudy day.",
            "sent5": "The gumptious team cheered each other on, full of energy and enthusiasm."
        },
        {
            "definition": "Bold and enterprising.",
            "pos": "adjective",
            "sent1": "The gumptious explorer ventured into the unknown, fearless and determined.",
            "sent2": "He made a gumptious decision to start his own business, despite the risks involved.",
            "sent3": "The gumptious idea of building a treehouse in the backyard excited the children.",
            "sent4": "Her gumptious spirit soared like an eagle, unafraid of challenges ahead.",
            "sent5": "The gumptious plan to travel the world was met with both excitement and apprehension."
        }
    ]
}