{
    "term": "gyp",
    "meanings": [
        {
            "definition": "Cheat or swindle",
            "pos": "verb",
            "sent1": "He tried to gyp his friend by taking more than his share of the candy.",
            "sent2": "Some people gyp others by selling fake products online.",
            "sent3": "The magician joked that he would gyp the audience by making their money disappear.",
            "sent4": "The shady salesman was known to gyp unsuspecting customers with false promises.",
            "sent5": "The pickpocket's quick hands allowed him to gyp tourists without them noticing."
        },
        {
            "definition": "A swindle or fraud",
            "pos": "noun",
            "sent1": "The email claiming she won a prize turned out to be a gyp to steal personal information.",
            "sent2": "The Ponzi scheme was a massive gyp that affected many investors.",
            "sent3": "The fake charity turned out to be a gyp to trick kind-hearted donors.",
            "sent4": "The counterfeit designer handbags were a gyp that fooled many shoppers.",
            "sent5": "The promise of easy money turned out to be a gyp to lure unsuspecting victims."
        },
        {
            "definition": "To cheat or swindle",
            "pos": "verb",
            "sent1": "She would often gyp her siblings in games by changing the rules halfway through.",
            "sent2": "Some people gyp elderly individuals by pretending to offer home repair services.",
            "sent3": "The clever fox managed to gyp the other animals out of their food supply.",
            "sent4": "The con artist would gyp vulnerable individuals out of their life savings.",
            "sent5": "The street performer would gyp tourists by pretending to be a statue and then asking for money."
        },
        {
            "definition": "A swindler or cheat",
            "pos": "noun",
            "sent1": "The gyp convinced people to invest in a fake business opportunity.",
            "sent2": "The town was wary of the newcomer, fearing he might be a gyp looking to take advantage.",
            "sent3": "The movie villain was portrayed as a gyp who tricked the hero into a dangerous situation.",
            "sent4": "The gyp's smooth talk and false promises led many to financial ruin.",
            "sent5": "The detective was determined to catch the gyp who had been scamming the elderly in the neighborhood."
        }
    ]
}