{
    "term": "gypping",
    "meanings": [
        {
            "definition": "Cheat or swindle",
            "pos": "verb",
            "sent1": "He was caught gypping in the card game.",
            "sent2": "She accused him of gypping her out of her money.",
            "sent3": "The magician joked that he was gypping the audience with his disappearing act.",
            "sent4": "The scam artist was gypping unsuspecting victims with his fake investment scheme.",
            "sent5": "The sneaky fox was gypping the other animals by stealing their food."
        },
        {
            "definition": "To deceive or trick",
            "pos": "verb",
            "sent1": "The con artist was gypping people with his fake lottery tickets.",
            "sent2": "She realized too late that he had been gypping her all along.",
            "sent3": "The mischievous leprechaun was gypping travelers with his illusions.",
            "sent4": "Her smile was like a mask, gypping everyone into believing she was happy.",
            "sent5": "The clever detective caught the criminal gypping the shop owner with counterfeit money."
        },
        {
            "definition": "To take advantage of someone",
            "pos": "verb",
            "sent1": "The salesman was gypping unsuspecting customers with overpriced products.",
            "sent2": "He felt guilty for gypping his friend into doing all the work.",
            "sent3": "The greedy landlord was gypping tenants by charging exorbitant rent.",
            "sent4": "The cunning fox was gypping the rabbit by pretending to be its friend.",
            "sent5": "The dishonest mechanic was gypping customers by recommending unnecessary repairs."
        },
        {
            "definition": "To engage in dishonest behavior",
            "pos": "verb",
            "sent1": "The corrupt politician was gypping the public with false promises.",
            "sent2": "She regretted gypping her way out of trouble instead of being honest.",
            "sent3": "The sly cat was gypping the birds by pretending to be harmless.",
            "sent4": "The dark clouds were gypping the sun of its chance to shine.",
            "sent5": "The shady businessman was gypping investors by manipulating the stock market."
        }
    ]
}