{
    "term": "habus",
    "meanings": [
        {
            "definition": "To seize or take possession of something by force or without permission.",
            "pos": "verb",
            "sent1": "The thief tried to habus the precious jewels from the museum.",
            "sent2": "The bully always tries to habus other kids' lunch money.",
            "sent3": "The raccoon managed to habus all the snacks from the picnic basket.",
            "sent4": "The storm seemed to habus the sunlight from the sky, leaving everything dark and gloomy.",
            "sent5": "The magician's trick was to habus a coin from behind someone's ear, leaving them amazed."
        },
        {
            "definition": "A situation in which someone is taken advantage of or exploited.",
            "pos": "noun",
            "sent1": "The scam artist created a habus by tricking people into giving him money.",
            "sent2": "The workers felt like they were in a habus when their boss refused to pay them fairly.",
            "sent3": "The cat felt like it was in a habus when the mischievous puppy kept stealing its toys.",
            "sent4": "The student loan company seemed to be in a habus with high interest rates, making it hard for graduates to pay back.",
            "sent5": "The superhero saved the city from the evil villain's habus, restoring peace and justice."
        },
        {
            "definition": "A legal claim or right to property.",
            "pos": "noun",
            "sent1": "The document proved his habus to the ancestral land, allowing him to build a house there.",
            "sent2": "She had a habus to the family heirloom, passed down for generations.",
            "sent3": "The explorer found a hidden treasure chest, claiming habus over its contents.",
            "sent4": "The artist's signature on the painting indicated his habus over the masterpiece.",
            "sent5": "The king's royal seal granted him habus over the entire kingdom, making him the ruler."
        }
    ]
}