{
    "term": "hackling",
    "meanings": [
        {
            "definition": "To comb or brush (hair or wool) with a hackle.",
            "pos": "verb",
            "sent1": "She enjoys hackling her long hair to keep it smooth and untangled.",
            "sent2": "The farmer was hackling the sheep's wool before spinning it into yarn.",
            "sent3": "The little girl pretended to be a hairstylist, hackling her doll's hair with a tiny comb.",
            "sent4": "The gentle breeze hackled the tall grass, creating a mesmerizing wave-like pattern.",
            "sent5": "Hackling the fabric gently with the brush brought out its natural shine."
        },
        {
            "definition": "To criticize or question closely.",
            "pos": "verb",
            "sent1": "The teacher was hackling the student's essay to help them improve their writing skills.",
            "sent2": "During the debate, the candidates hackled each other's arguments to find weaknesses.",
            "sent3": "The siblings playfully hackled each other's choice of movies for the movie night.",
            "sent4": "The journalist hackled the politician with tough questions during the press conference.",
            "sent5": "Hackling the details of the contract revealed some discrepancies that needed clarification."
        },
        {
            "definition": "A comb for hackling flax or hemp.",
            "pos": "noun",
            "sent1": "The old farm had a traditional hackling tool used for processing flax into linen.",
            "sent2": "The artisan carefully selected a hackling comb to prepare the hemp fibers for weaving.",
            "sent3": "The antique hackling comb was displayed in the museum as a tool from the past.",
            "sent4": "The intricate design of the hackling comb made it efficient for separating fibers.",
            "sent5": "The sharp teeth of the hackling comb ensured a thorough combing process for the flax."
        }
    ]
}