{
    "term": "hadrosaur",
    "meanings": [
        {
            "definition": "A type of dinosaur that lived during the Late Cretaceous period.",
            "pos": "noun",
            "sent1": "The hadrosaur roamed the earth millions of years ago.",
            "sent2": "Paleontologists found a complete hadrosaur skeleton in the desert.",
            "sent3": "The museum displayed a robotic hadrosaur that moved and roared.",
            "sent4": "In her dream, the hadrosaur symbolized ancient wisdom and strength.",
            "sent5": "Children gasped in awe as the life-sized hadrosaur model came to life."
        },
        {
            "definition": "A hadrosaur fossil was discovered in North America.",
            "pos": "noun",
            "sent1": "The scientists carefully excavated the hadrosaur fossil from the ground.",
            "sent2": "The museum proudly showcased the rare hadrosaur fossil to visitors.",
            "sent3": "The hadrosaur fossil was so well-preserved, it looked like it could wake up any moment.",
            "sent4": "The discovery of the hadrosaur fossil was a treasure trove of information for researchers.",
            "sent5": "The children marveled at the intricate details of the ancient hadrosaur fossil."
        },
        {
            "definition": "The hadrosaur had a duck-billed appearance.",
            "pos": "noun",
            "sent1": "The hadrosaur's duck-like bill helped it forage for plants.",
            "sent2": "The paleontologist sketched the hadrosaur's distinctive duck-billed profile.",
            "sent3": "The chef joked that the hadrosaur would have been a great sous-chef with its bill.",
            "sent4": "The hadrosaur's duck-billed face stood out among other dinosaur species.",
            "sent5": "The children giggled at the idea of a giant duck-billed hadrosaur waddling around."
        },
        {
            "definition": "Scientists study hadrosaur bones to learn more about their behavior.",
            "pos": "noun",
            "sent1": "The researchers carefully analyzed the hadrosaur bones to understand their movements.",
            "sent2": "Studying the hadrosaur bones revealed insights into their social interactions.",
            "sent3": "The detective novel featured a plot where the protagonist solved a mystery using hadrosaur bones.",
            "sent4": "The hadrosaur bones whispered secrets of the ancient world to the scientists.",
            "sent5": "The documentary showcased how advanced technology helped decode the mysteries of hadrosaur bones."
        }
    ]
}