{
    "term": "haems",
    "meanings": [
        {
            "definition": "A unit of measurement for the amount of iron in hemoglobin.",
            "pos": "noun",
            "sent1": "The doctor measured the haems in the patient's blood to check for anemia.",
            "sent2": "The lab technician analyzed the haems in the blood sample under the microscope.",
            "sent3": "The vampire was disappointed to find low haems in the blood bags at the blood bank.",
            "sent4": "The haems in the bloodstream were like tiny iron soldiers carrying oxygen to every cell.",
            "sent5": "The teacher used a model to explain the concept of haems to the students."
        },
        {
            "definition": "The plural form of haem, a red protein responsible for transporting oxygen in the blood.",
            "pos": "noun",
            "sent1": "The doctor discussed the importance of haems in oxygen transport during the biology class.",
            "sent2": "The haems in the blood bind with oxygen molecules for efficient delivery to tissues.",
            "sent3": "The chef added extra haems to the recipe to give the dish a rich red color.",
            "sent4": "The haems in the bloodstream worked tirelessly to ensure every cell received oxygen.",
            "sent5": "The researcher studied the structure of haems to understand their role in the body."
        },
        {
            "definition": "To add haemoglobin to something, such as a food product.",
            "pos": "verb",
            "sent1": "The chef decided to haems the soup to increase its nutritional value.",
            "sent2": "She carefully haemsed the smoothie with spinach to boost its iron content.",
            "sent3": "The comedian joked that he would haems his breakfast cereal with extra iron.",
            "sent4": "The athlete haemsed his protein shake with extra haemoglobin for better performance.",
            "sent5": "The mother haemsed the baby food to ensure her child received enough iron."
        }
    ]
}