{
    "term": "haeres",
    "meanings": [
        {
            "definition": "A person who inherits or is entitled to inherit the property of another.",
            "pos": "noun",
            "sent1": "The haeres was happy to receive the old house from their relative.",
            "sent2": "The lawyer explained the rights of the haeres in the will reading.",
            "sent3": "The haeres found out they inherited a haunted mansion - what a surprise!",
            "sent4": "She felt like a haeres of ancient wisdom when she discovered the hidden family treasure.",
            "sent5": "The haeres eagerly awaited news of the inheritance, hoping for a fortune."
        },
        {
            "definition": "A person who receives or is entitled to receive the property of a deceased person.",
            "pos": "noun",
            "sent1": "The haeres was grateful for the belongings left to them by their late uncle.",
            "sent2": "The haeres carefully sorted through the items in the estate sale.",
            "sent3": "The haeres joked that they were now the proud owner of a ghost's possessions.",
            "sent4": "She felt like a haeres of memories as she held her grandmother's antique locket.",
            "sent5": "The haeres respectfully handled the delicate china passed down to them."
        },
        {
            "definition": "A person who is legally entitled to inherit the property of a deceased person.",
            "pos": "noun",
            "sent1": "The haeres had to go through a legal process to claim the inheritance.",
            "sent2": "The lawyer confirmed the rights of the haeres to the family estate.",
            "sent3": "The haeres joked that they were now the official owner of the family heirlooms.",
            "sent4": "She felt like a haeres of justice when the court ruled in her favor.",
            "sent5": "The haeres proudly displayed the legal document proving their entitlement."
        }
    ]
}