{
    "term": "hagiographies",
    "meanings": [
        {
            "definition": "The writing of the lives of saints.",
            "pos": "noun",
            "sent1": "Hagiographies tell stories about holy people.",
            "sent2": "Many ancient texts are hagiographies of saints.",
            "sent3": "The library had a whole section dedicated to hagiographies; it was like a treasure trove of saintly tales.",
            "sent4": "Her life was a hagiography, with every action seeming divinely inspired.",
            "sent5": "In the dim candlelight, the hagiographies seemed to come alive, painting a vivid picture of piety."
        },
        {
            "definition": "Biographies of saints or venerated individuals.",
            "pos": "noun",
            "sent1": "The bookstore had a special section for hagiographies of revered figures.",
            "sent2": "Scholars study hagiographies to learn about the lives of saints.",
            "sent3": "Reading hagiographies feels like peeking into the past to witness the deeds of the holy.",
            "sent4": "Her bookshelf was filled with hagiographies, each one a window into a saint's life.",
            "sent5": "The hagiographies painted a colorful portrait of the revered individuals, making their stories unforgettable."
        },
        {
            "definition": "A biography that idealizes its subject.",
            "pos": "noun",
            "sent1": "The author wrote a hagiography of the leader, portraying them as flawless.",
            "sent2": "Some critics argue that the biography was more of a hagiography than an accurate account.",
            "sent3": "The hagiography was so glowing that it almost seemed like a fairy tale.",
            "sent4": "In the hagiography, the subject's every flaw was polished away, leaving only perfection.",
            "sent5": "The hagiography read like a love letter to the subject, highlighting only their virtues."
        }
    ]
}