{
    "term": "haints",
    "meanings": [
        {
            "definition": "Ghosts or spirits",
            "pos": "noun",
            "sent1": "The old house was said to be filled with haints.",
            "sent2": "People believe in haints haunting the graveyard at night.",
            "sent3": "The children told spooky stories about haints to scare each other.",
            "sent4": "The misty forest seemed to be hiding mysterious haints.",
            "sent5": "The movie about haints gave me chills and made me check under my bed."
        },
        {
            "definition": "To haunt or trouble",
            "pos": "verb",
            "sent1": "The memories of the past haint her dreams.",
            "sent2": "The abandoned house haints the neighborhood with its eerie presence.",
            "sent3": "The unfinished homework continued to haint him throughout the weekend.",
            "sent4": "The melody of the song haints my thoughts, playing on repeat.",
            "sent5": "The mystery of the missing key haints the detective, keeping him up at night."
        },
        {
            "definition": "A person who haunts or troubles",
            "pos": "noun",
            "sent1": "She was known as the haint of the old mansion, wandering its halls at night.",
            "sent2": "The haint in the legend was said to seek revenge on those who disturbed its resting place.",
            "sent3": "The mischievous haint played pranks on the unsuspecting visitors.",
            "sent4": "The haint of the pirate captain was rumored to guard his buried treasure.",
            "sent5": "The town feared the arrival of the mysterious haint, foretold by the howling winds."
        },
        {
            "definition": "Haunted or troubled by ghosts or spirits",
            "pos": "adjective",
            "sent1": "The eerie mansion had a haint atmosphere that sent shivers down your spine.",
            "sent2": "The old graveyard was considered a haint place, avoided by the locals.",
            "sent3": "The haint room in the inn was always left vacant by superstitious guests.",
            "sent4": "The haint forest was rumored to be a gateway to the spirit world.",
            "sent5": "The haint painting in the museum seemed to follow you with its ghostly gaze."
        }
    ]
}