{
    "term": "halidoms",
    "meanings": [
        {
            "definition": "Halidoms: holy places or objects",
            "pos": "noun",
            "sent1": "The ancient temple was filled with halidoms that people came to worship.",
            "sent2": "The cathedral displayed various halidoms, attracting pilgrims from far and wide.",
            "sent3": "The mischievous children played hide-and-seek among the halidoms, giggling as they hid behind sacred statues.",
            "sent4": "Her heart was a sanctuary, where memories of her grandmother's halidoms were enshrined.",
            "sent5": "The moonlight bathed the halidoms in a mystical glow, casting a serene aura over the sacred space."
        },
        {
            "definition": "Halidoms: sacred relics or shrines",
            "pos": "noun",
            "sent1": "The museum showcased ancient halidoms, including relics from long-forgotten civilizations.",
            "sent2": "Pilgrims traveled to the remote mountain to visit the halidoms and seek blessings.",
            "sent3": "Legend has it that the halidoms possess magical powers, granting wishes to those who believe.",
            "sent4": "The shrine stood tall, a beacon of hope for all who sought solace in its halidoms.",
            "sent5": "The old map led the explorer to a hidden chamber filled with mysterious halidoms, each with a story to tell."
        },
        {
            "definition": "Halidoms: items or places considered to be holy or blessed",
            "pos": "noun",
            "sent1": "The village revered the ancient tree as one of their most cherished halidoms.",
            "sent2": "The small chapel held simple halidoms that held great significance for the local community.",
            "sent3": "During the festival, the townspeople paraded through the streets, carrying the halidoms with pride.",
            "sent4": "Her grandmother's necklace was a halidom passed down through generations, believed to bring good fortune.",
            "sent5": "The sunlit meadow felt like a halidom of nature, a peaceful sanctuary away from the chaos of the city."
        }
    ]
}