{
    "term": "hallucinations",
    "meanings": [
        {
            "definition": "Perceptions that appear real but are created by the mind",
            "pos": "noun",
            "sent1": "Sometimes, people with schizophrenia experience hallucinations, seeing things that others cannot see.",
            "sent2": "The patient described vivid hallucinations of colorful butterflies fluttering around the room.",
            "sent3": "During the play, the actor's hallucinations of talking animals made the audience burst into laughter.",
            "sent4": "Her hallucinations of a ghostly figure lurking in the shadows added an eerie atmosphere to the story.",
            "sent5": "The artist's painting captured the hallucinations of a dreamlike world with floating islands and strange creatures."
        },
        {
            "definition": "False sensory experiences",
            "pos": "noun",
            "sent1": "The drug caused hallucinations, making the user feel sensations that were not real.",
            "sent2": "She was terrified by the hallucinations of spiders crawling on her skin.",
            "sent3": "The children's game of pretending to have magical powers led to hilarious hallucinations of flying broomsticks.",
            "sent4": "The old house was filled with echoes, creating auditory hallucinations of ghostly whispers.",
            "sent5": "The virtual reality game induced hallucinations of flying through space, tricking the senses into believing the experience was real."
        },
        {
            "definition": "Delusions or false beliefs",
            "pos": "noun",
            "sent1": "His hallucinations of being a superhero led him to believe he could fly off the roof.",
            "sent2": "The cult leader's manipulative tactics caused his followers to have shared hallucinations of impending doom.",
            "sent3": "The politician's hallucinations of being loved by all voters made him overconfident in the election.",
            "sent4": "The conspiracy theorist's hallucinations of government surveillance fueled his paranoia.",
            "sent5": "In the dream, her hallucinations of being a famous actress felt so real that she woke up expecting paparazzi outside her door."
        }
    ]
}