{
    "term": "hammerlocks",
    "meanings": [
        {
            "definition": "A wrestling hold in which one arm is twisted and forced upward behind the opponent's back.",
            "pos": "noun",
            "sent1": "During the match, the wrestler applied a painful hammerlocks on his opponent.",
            "sent2": "The wrestler quickly executed a hammerlocks to gain control over his rival.",
            "sent3": "The audience gasped as the wrestler expertly locked his opponent in a hammerlocks.",
            "sent4": "The hammerlocks was like a trap, leaving the opponent helpless.",
            "sent5": "The wrestler's hammerlocks was so tight, it seemed unbeatable."
        },
        {
            "definition": "A type of wrestling move that involves twisting an opponent's arm behind their back.",
            "pos": "noun",
            "sent1": "In the wrestling match, the champion used a powerful hammerlocks to subdue his challenger.",
            "sent2": "The wrestler's signature move was the hammerlocks, which always impressed the crowd.",
            "sent3": "The hammerlocks move looked painful but was executed with precision.",
            "sent4": "The hammerlocks maneuver was like poetry in motion, showcasing skill and strength.",
            "sent5": "The opponent winced as he felt the hammerlocks tightening on his arm."
        },
        {
            "definition": "To put someone in a hammerlock.",
            "pos": "verb",
            "sent1": "He tried to hammerlocks his opponent but couldn't get a good grip.",
            "sent2": "The wrestler managed to hammerlocks his rival after a fierce struggle.",
            "sent3": "She jokingly threatened to hammerlocks her friend if he didn't stop teasing her.",
            "sent4": "The coach's advice was to metaphorically hammerlocks the competition with hard work.",
            "sent5": "The team captain's determination to hammerlocks the victory was evident in his every move."
        }
    ]
}