{
    "term": "hammerlock",
    "meanings": [
        {
            "definition": "A wrestling hold in which one arm is twisted and forced upward behind the opponent's back.",
            "pos": "noun",
            "sent1": "During the match, the wrestler applied a hammerlock to gain control.",
            "sent2": "The wrestler executed a perfect hammerlock, causing his opponent to submit.",
            "sent3": "The audience chuckled as the wrestler struggled to escape the hammerlock.",
            "sent4": "Her argument had him in a verbal hammerlock, unable to counter her points.",
            "sent5": "The hammerlock maneuver looked painful but was done with precision."
        },
        {
            "definition": "A type of wrestling move that involves twisting an opponent's arm behind their back.",
            "pos": "noun",
            "sent1": "In the wrestling tournament, he used a hammerlock to pin his opponent.",
            "sent2": "The coach demonstrated the hammerlock technique to the eager students.",
            "sent3": "The wrestler jokingly asked if he could use a hammerlock in a thumb war.",
            "sent4": "Her negotiation skills put the rival company in a business hammerlock.",
            "sent5": "The hammerlock move was effective in immobilizing the opponent."
        },
        {
            "definition": "To put someone in a wrestling hold where their arm is twisted behind their back.",
            "pos": "verb",
            "sent1": "He tried to hammerlock his friend during their playful wrestling match.",
            "sent2": "She quickly hammerlocked her opponent, showcasing her skill in the sport.",
            "sent3": "The siblings laughed as they playfully hammerlocked each other in the living room.",
            "sent4": "His persuasive argument hammerlocked his opponent into agreeing with him.",
            "sent5": "The detective hammerlocked the suspect, preventing any chance of escape."
        }
    ]
}