{
    "term": "hamming",
    "meanings": [
        {
            "definition": "To act or perform in a theatrical or exaggerated manner.",
            "pos": "verb",
            "sent1": "During the school play, Sarah was hamming it up on stage, pretending to be a famous actress.",
            "sent2": "The comedian hammed his way through the skit, making everyone in the audience laugh.",
            "sent3": "The toddler started hamming around the living room, pretending to be a superhero.",
            "sent4": "She hammed up her excitement for the surprise party, making it seem like the event of the year.",
            "sent5": "The actor's ability to ham up his emotions brought the character to life on stage."
        },
        {
            "definition": "To make a loud noise or commotion.",
            "pos": "verb",
            "sent1": "The construction workers were hamming away with their tools, creating a cacophony of sounds.",
            "sent2": "The children hammed loudly during recess, playing and shouting with joy.",
            "sent3": "The monkeys in the zoo started hamming around, causing a ruckus among the visitors.",
            "sent4": "The thunderstorm outside was hamming so fiercely that it shook the windows.",
            "sent5": "The excited fans began hamming with cheers as their favorite team scored a goal."
        },
        {
            "definition": "To communicate in a playful or teasing manner.",
            "pos": "verb",
            "sent1": "The siblings were hamming each other about who could finish their chores faster.",
            "sent2": "Friends often ham around with jokes and funny stories during their gatherings.",
            "sent3": "The classmates were hamming back and forth, trying to outwit each other in the debate.",
            "sent4": "She hammed with her best friend, sharing inside jokes and laughter.",
            "sent5": "The comedians hammed with the audience, creating a lighthearted atmosphere in the room."
        }
    ]
}