{
    "term": "hammertoes",
    "meanings": [
        {
            "definition": "A deformity of the toe joints causing the toes to bend downward like a claw",
            "pos": "noun",
            "sent1": "My grandma has hammertoes, so her toes look like claws.",
            "sent2": "The doctor diagnosed me with hammertoes because my toes are bending downward.",
            "sent3": "It's hard for the hammertoes to wear socks because they get stuck in the fabric.",
            "sent4": "Her hammertoes were like eagle talons, gripping the ground with each step.",
            "sent5": "The image of hammertoes haunted him, making him cringe at the thought of toe deformities."
        },
        {
            "definition": "Toes that are bent in a claw-like position due to muscle imbalance",
            "pos": "noun",
            "sent1": "The gymnast's hammertoes made it challenging for her to balance on the beam.",
            "sent2": "He couldn't wiggle his hammertoes freely due to the muscle imbalance.",
            "sent3": "The hammertoes tried to dance, but their muscle imbalance made them trip over each other.",
            "sent4": "Her hammertoes, like tiny claws, grasped the edge of her sandals.",
            "sent5": "The hammertoes wiggled uncontrollably, showcasing the muscle imbalance in her feet."
        },
        {
            "definition": "A condition where the toes are permanently bent downward at the middle joint",
            "pos": "noun",
            "sent1": "The elderly man's hammertoes made it painful for him to walk long distances.",
            "sent2": "She had to buy special shoes to accommodate her hammertoes' permanent bend.",
            "sent3": "The hammertoes threw a party, but the permanent bend at the middle joint made dancing difficult.",
            "sent4": "His hammertoes, like little hooks, caught on the carpet as he walked.",
            "sent5": "The hammertoes' permanent bend served as a reminder of the foot condition's impact on daily life."
        }
    ]
}