{
    "term": "handfasting",
    "meanings": [
        {
            "definition": "A ceremony in which a couple's hands are tied together to symbolize their union.",
            "pos": "noun",
            "sent1": "During the handfasting, their hands were gently bound together with a ribbon.",
            "sent2": "The handfasting ceremony was a beautiful way to show their commitment to each other.",
            "sent3": "At the handfasting, they accidentally used a very long ribbon, making it hard to move around.",
            "sent4": "The handfasting was like a strong knot, securing their love for eternity.",
            "sent5": "The guests will always remember the handfasting as a touching moment of unity."
        },
        {
            "definition": "The act of joining two people in marriage or commitment.",
            "pos": "noun",
            "sent1": "Their handfasting was a special moment that brought them together in marriage.",
            "sent2": "Handfasting is a meaningful way to unite two hearts in love.",
            "sent3": "During the handfasting, they both promised to always share the last cookie.",
            "sent4": "The handfasting ceremony was a bridge that connected their souls forever.",
            "sent5": "The handfasting marked the beginning of their shared journey as a married couple."
        },
        {
            "definition": "A type of ancient Celtic marriage ritual.",
            "pos": "noun",
            "sent1": "The handfasting was a tradition passed down through generations in their family.",
            "sent2": "In ancient times, handfasting was a sacred Celtic custom.",
            "sent3": "During the handfasting, they accidentally mixed up the traditional Celtic music with modern pop songs.",
            "sent4": "The handfasting ritual was like a time machine, connecting them to their Celtic ancestors.",
            "sent5": "The handfasting brought a touch of ancient magic to their modern wedding ceremony."
        }
    ]
}