{
    "term": "handlines",
    "meanings": [
        {
            "definition": "A type of fishing line that is held in the hand.",
            "pos": "noun",
            "sent1": "The fisherman used handlines to catch small fish in the river.",
            "sent2": "Handlines are commonly used by anglers for fishing in shallow waters.",
            "sent3": "The handlines tangled up, causing the fisherman to struggle with his catch.",
            "sent4": "Her patience was like handlines, slowly reeling in the big catch of success.",
            "sent5": "The glint of the sun on the handlines made them shimmer like silver threads in the water."
        },
        {
            "definition": "A method of controlling a fire using a hose that is held by hand.",
            "pos": "noun",
            "sent1": "Firefighters quickly extinguished the flames with handlines during the drill.",
            "sent2": "Using handlines efficiently is crucial in firefighting to contain the blaze.",
            "sent3": "The firefighter accidentally sprayed himself with water from the handlines, causing laughter among the team.",
            "sent4": "The handlines were like a lifeline, keeping the fire under control in the forest.",
            "sent5": "The hiss of water from the handlines drowned out the crackling of the flames."
        },
        {
            "definition": "A type of rope used for lifting or lowering objects by hand.",
            "pos": "noun",
            "sent1": "Workers relied on handlines to hoist heavy crates onto the ship.",
            "sent2": "Handlines are essential for safely moving cargo in warehouses.",
            "sent3": "The handlines got tangled with the pulley, causing a comical mishap in the loading process.",
            "sent4": "The handlines were like strong arms, effortlessly lifting the cargo to the top floor.",
            "sent5": "The creak of the handlines echoed through the warehouse as the goods were lifted."
        }
    ]
}