{
    "term": "handglass",
    "meanings": [
        {
            "definition": "A small mirror held in the hand for close inspection of the face or hair.",
            "pos": "noun",
            "sent1": "She used the handglass to check her makeup before the party.",
            "sent2": "The handglass reflected her image clearly as she fixed her hair.",
            "sent3": "Carrying the handglass, she pretended to be a detective solving a beauty mystery.",
            "sent4": "The handglass became her magic portal to a world of flawless reflections.",
            "sent5": "In her handglass, she saw every detail of her smile magnified."
        },
        {
            "definition": "A handheld magnifying glass used for examining small objects.",
            "pos": "noun",
            "sent1": "The jeweler used the handglass to inspect the tiny diamond closely.",
            "sent2": "With the handglass, he could see the intricate patterns on the butterfly's wings.",
            "sent3": "The curious cat tried to catch the light beam passing through the handglass.",
            "sent4": "Through the handglass, the world seemed to shrink into a miniature wonderland.",
            "sent5": "Every insect under the handglass revealed a hidden world of details."
        },
        {
            "definition": "A portable device used for reflecting light onto a surface.",
            "pos": "noun",
            "sent1": "The photographer adjusted the handglass to create the perfect lighting for the photo shoot.",
            "sent2": "Using the handglass, he directed sunlight onto the flower for a stunning effect.",
            "sent3": "The mischievous child used the handglass to playfully reflect sunlight into his friend's eyes.",
            "sent4": "The handglass transformed the dull room into a sparkling dance of light and shadows.",
            "sent5": "With the handglass, he painted the scene with beams of golden sunlight."
        }
    ]
}