{
    "term": "hand",
    "meanings": [
        {
            "definition": "The terminal part of the human arm located below the forearm, used for grasping and holding.",
            "pos": "noun",
            "sent1": "She used her hand to pick up the book.",
            "sent2": "He shook my hand when we met.",
            "sent3": "The hand waved at the passing cars.",
            "sent4": "The hand of friendship was extended to the new student.",
            "sent5": "The baby's tiny hand wrapped around her finger."
        },
        {
            "definition": "A pointer or indicator on a clock or watch indicating the time.",
            "pos": "noun",
            "sent1": "The small hand pointed to the number six.",
            "sent2": "The hour hand shows the current time.",
            "sent3": "The hand on the clock seemed to be in a hurry.",
            "sent4": "Time slipped through the hands like sand.",
            "sent5": "The hand moved steadily towards midnight."
        },
        {
            "definition": "A round of applause or approval.",
            "pos": "noun",
            "sent1": "The audience gave a loud hand after the performance.",
            "sent2": "The hand echoed through the auditorium.",
            "sent3": "The hand was music to the performer's ears.",
            "sent4": "The hand was like a thunderous storm of appreciation.",
            "sent5": "The hand filled the room with joy and gratitude."
        },
        {
            "definition": "A person's handwriting.",
            "pos": "noun",
            "sent1": "Her hand was elegant and neat on the paper.",
            "sent2": "The doctor's hand was difficult to read.",
            "sent3": "His hand seemed to have a mind of its own on the page.",
            "sent4": "The hand danced across the letter with grace.",
            "sent5": "The hand told a story through its strokes."
        },
        {
            "definition": "A laborer or worker.",
            "pos": "noun",
            "sent1": "The farmhand worked hard in the fields.",
            "sent2": "The construction hand lifted heavy materials.",
            "sent3": "The hand toiled under the scorching sun.",
            "sent4": "The hand built the foundation of the house.",
            "sent5": "The hand's sweat showed the effort put into the work."
        }
    ]
}