{
    "term": "hangs",
    "meanings": [
        {
            "definition": "To be suspended or attached from above",
            "pos": "verb",
            "sent1": "The picture hangs on the wall.",
            "sent2": "The light fixture hangs from the ceiling.",
            "sent3": "The monkey hangs from the tree branch, looking down at us.",
            "sent4": "The chandelier hangs like a crystal raindrop in the room.",
            "sent5": "The painting hangs crookedly, making the room look lopsided."
        },
        {
            "definition": "To remain in a place or position",
            "pos": "verb",
            "sent1": "The smell of fresh bread hangs in the air.",
            "sent2": "The fog hangs low over the river in the morning.",
            "sent3": "The question hangs in the room, waiting for an answer.",
            "sent4": "The mist hangs like a soft blanket over the valley.",
            "sent5": "The sound of laughter hangs around the playground."
        },
        {
            "definition": "To execute by suspending by the neck",
            "pos": "verb",
            "sent1": "In the olden days, they would hang criminals for serious crimes.",
            "sent2": "The pirate captain threatened to hang the traitor from the mast.",
            "sent3": "The ghost story told of a spirit seeking revenge by hanging its murderer.",
            "sent4": "The shadow of the gallows hangs ominously over the town square.",
            "sent5": "The judge's sentence to hang the convict was met with silence in the courtroom."
        },
        {
            "definition": "To be undecided or unresolved",
            "pos": "verb",
            "sent1": "The decision on which movie to watch hangs in the air.",
            "sent2": "The question of who will win the game hangs over the crowd.",
            "sent3": "The mystery of the missing key hangs in the detective's mind.",
            "sent4": "The tension between the two friends hangs like a heavy cloud.",
            "sent5": "The future of the project hangs on the approval of the boss."
        }
    ]
}