{
    "term": "hangbirds",
    "meanings": [
        {
            "definition": "A bird that hangs or swings from branches or wires.",
            "pos": "noun",
            "sent1": "The hangbirds chirped happily as they swung from the tree branches.",
            "sent2": "I spotted a group of colorful hangbirds hanging gracefully from the telephone wires.",
            "sent3": "The mischievous hangbirds played a game of tag while hanging from the vines.",
            "sent4": "The hangbirds seemed like delicate ornaments dangling from the willow tree.",
            "sent5": "The children were mesmerized by the acrobatic skills of the hangbirds."
        },
        {
            "definition": "A bird known for its ability to hang upside down.",
            "pos": "noun",
            "sent1": "The circus hangbirds amazed the audience with their upside-down tricks.",
            "sent2": "The tiny hangbirds effortlessly hung upside down to reach the juicy berries.",
            "sent3": "The curious hangbirds decided to have a topsy-turvy tea party hanging from the branches.",
            "sent4": "The hangbirds' unique talent of hanging upside down fascinated the biologist.",
            "sent5": "The children giggled at the silly hangbirds hanging upside down like bats."
        },
        {
            "definition": "A bird that builds its nest in a hanging position.",
            "pos": "noun",
            "sent1": "The weaver hangbirds meticulously crafted their hanging nests from twigs and leaves.",
            "sent2": "The colorful hangbirds' nest swayed gently in the breeze, suspended from the branch.",
            "sent3": "The mischievous hangbirds pranked each other by hanging their nests in unexpected places.",
            "sent4": "The hangbirds' hanging nests were like cozy hammocks swaying in the wind.",
            "sent5": "The photographer captured the beauty of the hangbirds' hanging nests against the sunset."
        }
    ]
}