{
    "term": "hang",
    "meanings": [
        {
            "definition": "To suspend or be suspended from above",
            "pos": "verb",
            "sent1": "The picture frame will hang on the wall.",
            "sent2": "I like to hang my clothes in the closet.",
            "sent3": "I saw a monkey hang from a tree branch at the zoo.",
            "sent4": "The chandelier seemed to hang like a crystal cloud in the room.",
            "sent5": "The bat seemed to hang effortlessly in the air as it hunted for insects."
        },
        {
            "definition": "To attach or be attached to a wall or ceiling",
            "pos": "verb",
            "sent1": "I will hang the painting above the fireplace.",
            "sent2": "The light fixture hangs from the ceiling.",
            "sent3": "The spider decided to hang its web in the corner of the room.",
            "sent4": "The stars seemed to hang like twinkling ornaments in the night sky.",
            "sent5": "The clock will hang perfectly centered on the wall."
        },
        {
            "definition": "To execute by suspending by the neck",
            "pos": "verb",
            "sent1": "In the olden days, they would hang criminals for serious crimes.",
            "sent2": "The judge ordered the criminal to hang for his actions.",
            "sent3": "The ghost story told of a haunted house where spirits would hang the unwary.",
            "sent4": "The weight of guilt seemed to hang heavily around the criminal's neck.",
            "sent5": "The shadow of the gallows seemed to hang ominously over the town square."
        },
        {
            "definition": "To spend time in a particular place or with a particular group",
            "pos": "verb",
            "sent1": "I like to hang out with my friends at the park.",
            "sent2": "Let's hang at the coffee shop after school.",
            "sent3": "The cat decided to hang around the garden all day.",
            "sent4": "The memories of childhood friends still hang in my heart.",
            "sent5": "The feeling of belonging seemed to hang in the air whenever we were together."
        },
        {
            "definition": "To hesitate or be undecided",
            "pos": "verb",
            "sent1": "I tend to hang back when making big decisions.",
            "sent2": "Don't hang too long on that choice; make a decision.",
            "sent3": "The student would hang on the answer before responding.",
            "sent4": "The question seemed to hang in the air, waiting for a response.",
            "sent5": "The feeling of uncertainty seemed to hang in the room like a heavy fog."
        },
        {
            "definition": "To cause to be suspended or attached",
            "pos": "verb",
            "sent1": "She will hang the curtains in the living room.",
            "sent2": "The teacher asked the students to hang their artwork on the wall.",
            "sent3": "The wind will hang the wind chimes on the porch.",
            "sent4": "The scent of flowers seemed to hang in the air after she sprayed perfume.",
            "sent5": "The responsibility of leadership seemed to hang on his shoulders."
        },
        {
            "definition": "To be dependent on or influenced by something",
            "pos": "verb",
            "sent1": "His mood can hang on the outcome of the game.",
            "sent2": "My decision will hang on what my parents say.",
            "sent3": "The success of the project will hang on teamwork.",
            "sent4": "The future of the company seemed to hang on the CEO's decision.",
            "sent5": "The survival of the species can hang on environmental changes."
        }
    ]
}