{
    "term": "hank",
    "meanings": [
        {
            "definition": "A coil or loop of something, especially yarn or thread.",
            "pos": "noun",
            "sent1": "She carefully untangled the hank of yarn.",
            "sent2": "The store sold colorful hanks of thread.",
            "sent3": "The mischievous kitten played with the hank, creating a mess.",
            "sent4": "Her thoughts were a tangled hank of emotions.",
            "sent5": "The hank of yarn resembled a colorful spring."
        },
        {
            "definition": "A unit of measurement for lengths of yarn or thread.",
            "pos": "noun",
            "sent1": "She needed one more hank of yarn to finish the project.",
            "sent2": "The pattern required three hanks of thread.",
            "sent3": "He jokingly measured the distance in hanks of thread.",
            "sent4": "The road stretched out like an endless hank of yarn.",
            "sent5": "The hank of thread was just the right length for the job."
        },
        {
            "definition": "To form into a coil or loop.",
            "pos": "verb",
            "sent1": "She would hank the rope before storing it.",
            "sent2": "He hanked the wires neatly to avoid tangles.",
            "sent3": "The magician hanked the scarves into a colorful bouquet.",
            "sent4": "His words seemed to hank around her heart.",
            "sent5": "The dancer's movements hanked gracefully around the stage."
        },
        {
            "definition": "To hold onto tightly.",
            "pos": "verb",
            "sent1": "She hanked onto the railing as the ship rocked.",
            "sent2": "He hanked onto his hat in the strong wind.",
            "sent3": "The child hanked onto the balloon, afraid to let go.",
            "sent4": "His memories hanked onto his mind, refusing to fade.",
            "sent5": "The climber hanked onto the rock face, determined to reach the top."
        }
    ]
}