{
    "term": "haplotypes",
    "meanings": [
        {
            "definition": "A set of DNA variations or polymorphisms that tend to be inherited together",
            "pos": "noun",
            "sent1": "Scientists studied the haplotypes in the DNA to understand how traits are passed down.",
            "sent2": "The haplotypes on the chromosome determine certain genetic traits.",
            "sent3": "The haplotypes at the family reunion made for interesting discussions about inherited traits.",
            "sent4": "The haplotypes of genetic information were like puzzle pieces fitting together perfectly.",
            "sent5": "The concept of haplotypes helped explain why certain traits run in families."
        },
        {
            "definition": "The specific combination of alleles located on a single chromosome",
            "pos": "noun",
            "sent1": "Each haplotypes combination on the chromosome determines a unique genetic makeup.",
            "sent2": "The haplotypes found on the chromosome can influence an individual's characteristics.",
            "sent3": "The haplotypes on the chromosome were like a secret code for genetic traits.",
            "sent4": "The haplotypes of alleles on the chromosome were like a recipe for inherited traits.",
            "sent5": "Understanding the haplotypes on a chromosome is key to studying genetic inheritance."
        },
        {
            "definition": "A group of genes inherited together from a single parent",
            "pos": "noun",
            "sent1": "The haplotypes inherited from a single parent can determine certain family traits.",
            "sent2": "Each haplotypes group from a parent contributes to the genetic makeup of an individual.",
            "sent3": "The haplotypes from a single parent were like a genetic gift bag.",
            "sent4": "The haplotypes passed down from a parent were like a genetic legacy.",
            "sent5": "The haplotypes inherited from a parent shape an individual's genetic profile."
        }
    ]
}