{
    "term": "happis",
    "meanings": [
        {
            "definition": "Happis (noun): A feeling of joy or contentment.",
            "pos": "noun",
            "sent1": "The sight of the rainbow brought happis to her heart.",
            "sent2": "His face lit up with happis when he saw his birthday cake.",
            "sent3": "The puppy's playful antics filled the room with happis.",
            "sent4": "The garden bloomed with happis after the spring rain.",
            "sent5": "The children's laughter echoed with happis through the park."
        },
        {
            "definition": "Happis (verb): To experience joy or contentment.",
            "pos": "verb",
            "sent1": "She happis every time she hears her favorite song.",
            "sent2": "They happis whenever they spend time together.",
            "sent3": "The family happis during their weekend picnics.",
            "sent4": "His heart happis whenever he helps others in need.",
            "sent5": "The flowers happis in the warm sunlight of the morning."
        },
        {
            "definition": "Happis (adjective): Feeling joyful or content.",
            "pos": "adjective",
            "sent1": "The happis children played in the park all day.",
            "sent2": "She had a happis smile on her face after receiving good news.",
            "sent3": "The happis puppy wagged its tail excitedly.",
            "sent4": "The happis flowers bloomed brightly in the garden.",
            "sent5": "The happis students celebrated the end of exams with a party."
        },
        {
            "definition": "Happis (adverb): In a joyful or content manner.",
            "pos": "adverb",
            "sent1": "She danced happis in the meadow under the sun.",
            "sent2": "The children played happis in the playground after school.",
            "sent3": "The birds chirped happis in the early morning light.",
            "sent4": "The family laughed happis around the dinner table.",
            "sent5": "The stream flowed happis through the peaceful forest."
        }
    ]
}