{
    "term": "haptic",
    "meanings": [
        {
            "definition": "Relating to the sense of touch.",
            "pos": "adjective",
            "sent1": "The haptic feedback on the phone made it vibrate when I touched the screen.",
            "sent2": "She enjoyed the haptic experience of running her fingers over the soft fabric.",
            "sent3": "The haptic gloves allowed the magician to perform tricks by feeling the objects in the dark.",
            "sent4": "The haptic sensation of the rough bark under his palm reminded him of the tree's age.",
            "sent5": "The haptic nature of the warm sand between her toes brought back childhood memories."
        },
        {
            "definition": "Involving tactile sensation.",
            "pos": "adjective",
            "sent1": "The haptic game controller provided realistic feedback during the race.",
            "sent2": "The artist used haptic techniques to create a textured painting that could be felt.",
            "sent3": "The haptic handshake between the robots was a sign of their agreement.",
            "sent4": "The haptic connection between them was so strong, they could almost feel each other's presence.",
            "sent5": "The haptic interaction with the sculpture allowed visitors to explore its contours."
        },
        {
            "definition": "Of or relating to the perception and manipulation of objects using the sense of touch.",
            "pos": "adjective",
            "sent1": "The haptic technology in the virtual reality headset simulated touching objects in the game.",
            "sent2": "The haptic feedback in the surgical robot helped the doctor feel the tissues more accurately.",
            "sent3": "The haptic interface allowed users to navigate the virtual world by touch.",
            "sent4": "The haptic control panel enabled precise adjustments through tactile feedback.",
            "sent5": "The haptic feedback suit allowed the astronaut to feel objects in space simulations."
        }
    ]
}