{
    "term": "harassers",
    "meanings": [
        {
            "definition": "A person or group that persistently annoys or provokes others.",
            "pos": "noun",
            "sent1": "The harassers in the neighborhood kept ringing the doorbell and running away.",
            "sent2": "The school bullies were known as the harassers among the students.",
            "sent3": "The mischievous harassers filled the teacher's desk with confetti as a prank.",
            "sent4": "The harassers were like pesky mosquitoes, buzzing around and causing irritation.",
            "sent5": "The harassers were like persistent shadows, always following and bothering others."
        },
        {
            "definition": "To subject someone to aggressive pressure or intimidation.",
            "pos": "verb",
            "sent1": "The group of kids would harassers their classmate by teasing him every day.",
            "sent2": "The aggressive salesperson would harassers customers into buying unnecessary products.",
            "sent3": "The playful puppy would harassers the older dog by constantly nipping at its tail.",
            "sent4": "The storm clouds seemed to harassers the peaceful town, threatening with heavy rain.",
            "sent5": "The persistent alarm clock would harassers the sleeper until they finally woke up."
        },
        {
            "definition": "The act of harassing or causing distress to someone.",
            "pos": "noun",
            "sent1": "The constant harassers from online trolls affected the mental health of the victim.",
            "sent2": "The workplace harassment policy was created to protect employees from harassers.",
            "sent3": "The mischievous squirrel became a harassers by stealing nuts from other animals.",
            "sent4": "The dark clouds were like harassers, casting a gloomy shadow over the picnic.",
            "sent5": "The loud noise from the construction site acted as a harassers to the residents nearby."
        }
    ]
}