{
    "term": "harass",
    "meanings": [
        {
            "definition": "To disturb persistently; torment, as with troubles or cares",
            "pos": "verb",
            "sent1": "The noisy neighbors would constantly harass us with their loud music.",
            "sent2": "The bullies would harass the younger students on the playground every day.",
            "sent3": "The mischievous squirrel would harass the birds by stealing their food.",
            "sent4": "The relentless rain would harass the farmers, causing their crops to flood.",
            "sent5": "The persistent mosquito would harass me all night, buzzing in my ear."
        },
        {
            "definition": "To trouble by repeated attacks; annoy persistently",
            "pos": "verb",
            "sent1": "The persistent telemarketer would harass me with multiple phone calls every day.",
            "sent2": "The paparazzi would harass the celebrity outside her house, trying to get a photo.",
            "sent3": "The playful puppy would harass the older dog by constantly nipping at its tail.",
            "sent4": "The strong winds would harass the fragile tent, threatening to blow it away.",
            "sent5": "The annoying alarm clock would harass me every morning, waking me up abruptly."
        },
        {
            "definition": "To create an unpleasant or hostile situation for, especially by uninvited and unwelcome verbal or physical conduct",
            "pos": "verb",
            "sent1": "The online troll would harass other users with hurtful comments and messages.",
            "sent2": "The aggressive salesperson would harass customers into buying products they didn't need.",
            "sent3": "The mischievous cat would harass the dog by swatting at its tail.",
            "sent4": "The dark clouds would harass the sky, threatening to bring a storm.",
            "sent5": "The persistent cough would harass me during the quiet movie, drawing annoyed glances."
        }
    ]
}