{
    "term": "harassments",
    "meanings": [
        {
            "definition": "Aggressive pressure or intimidation.",
            "pos": "noun",
            "sent1": "The harassments from the bully made the student feel scared.",
            "sent2": "The constant harassments from the aggressive salesperson made the customer uncomfortable.",
            "sent3": "The harassments from the loud neighbor were like a storm that never seemed to end.",
            "sent4": "The harassments at work felt like a dark cloud hanging over her every day.",
            "sent5": "The harassments were like a heavy weight pressing down on his shoulders, making it hard to breathe."
        },
        {
            "definition": "Annoyance or irritation.",
            "pos": "noun",
            "sent1": "The small harassments of a dripping faucet can drive you crazy at night.",
            "sent2": "The constant harassments of telemarketing calls can be very frustrating.",
            "sent3": "The harassments of a fly buzzing around your head can be surprisingly irritating.",
            "sent4": "The harassments of a squeaky door can grate on your nerves after a while.",
            "sent5": "The harassments of a dripping tap can be like a never-ending drip of annoyance in your day."
        },
        {
            "definition": "Persistent unwanted attention or trouble.",
            "pos": "noun",
            "sent1": "The harassments from the persistent admirer made her feel uncomfortable.",
            "sent2": "The constant harassments from the paparazzi made the celebrity's life difficult.",
            "sent3": "The harassments from the mischievous squirrel stealing nuts were oddly persistent.",
            "sent4": "The harassments from the malfunctioning alarm system were like a nagging voice in the background.",
            "sent5": "The harassments felt like a swarm of bees buzzing around her head, never giving her a moment's peace."
        }
    ]
}