{
    "term": "harbour",
    "meanings": [
        {
            "definition": "A place on the coast where ships may moor in shelter",
            "pos": "noun",
            "sent1": "The small fishing village had a safe harbour for boats to stay in during storms.",
            "sent2": "The harbour was bustling with activity as ships unloaded their cargo.",
            "sent3": "The harbour was so peaceful that even the seagulls seemed to relax there.",
            "sent4": "Her heart was a harbour of memories, each ship representing a different moment in time.",
            "sent5": "The harbour, with its protective arms, cradled the ships like a mother holding her children."
        },
        {
            "definition": "To give a home or shelter to",
            "pos": "verb",
            "sent1": "The kind family decided to harbour the stray kitten and give it a warm place to sleep.",
            "sent2": "The old lighthouse would harbour sailors who were lost at sea.",
            "sent3": "The treehouse seemed to harbour all the neighborhood kids during their secret meetings.",
            "sent4": "His heart harboured a deep love for nature, always seeking to protect it.",
            "sent5": "The cave harboured a hidden treasure that had been lost for centuries."
        },
        {
            "definition": "To hold in the mind",
            "pos": "verb",
            "sent1": "She would harbour the memory of her grandmother's smile forever.",
            "sent2": "The mystery novel would harbour clues that kept the readers guessing until the end.",
            "sent3": "His mind seemed to harbour a never-ending stream of creative ideas.",
            "sent4": "The secret would harbour in his thoughts, waiting for the right moment to be revealed.",
            "sent5": "The song's melody would harbour in her mind, playing on repeat like a favorite tune."
        },
        {
            "definition": "To contain or hold something within",
            "pos": "verb",
            "sent1": "The jar would harbour the delicious homemade jam made by Grandma.",
            "sent2": "The treasure chest would harbour the pirate's most valuable loot.",
            "sent3": "The backpack seemed to harbour an endless supply of snacks for the hiking trip.",
            "sent4": "The old book would harbour a hidden compartment where secrets were kept.",
            "sent5": "The cloud would harbour the raindrops until they were ready to fall to the ground."
        }
    ]
}