{
    "term": "hardheartedness",
    "meanings": [
        {
            "definition": "Lack of sympathy or compassion.",
            "pos": "noun",
            "sent1": "Her hardheartedness towards the stray animals was evident in her refusal to help them.",
            "sent2": "The teacher was moved by the student's hardheartedness towards their classmates in need.",
            "sent3": "Despite his hardheartedness, he couldn't resist adopting the adorable puppy.",
            "sent4": "The politician's hardheartedness towards the disadvantaged was like a wall blocking their progress.",
            "sent5": "The hardheartedness of the villain made him a memorable character in the story."
        },
        {
            "definition": "Cruel or unfeeling behavior.",
            "pos": "noun",
            "sent1": "The dictator's hardheartedness led to the suffering of countless innocent people.",
            "sent2": "The bully's hardheartedness towards his classmates made school a difficult place for many.",
            "sent3": "In the movie, the villain's hardheartedness was so extreme that even the other villains were shocked.",
            "sent4": "The hardheartedness of the antagonist made the hero's victory even more satisfying.",
            "sent5": "The hardheartedness of the character made the audience despise him."
        },
        {
            "definition": "Cold-heartedness or indifference.",
            "pos": "noun",
            "sent1": "Her hardheartedness towards the suffering of others was unsettling to those around her.",
            "sent2": "The CEO's hardheartedness towards the employees' struggles caused resentment in the company.",
            "sent3": "Despite his hardheartedness, he couldn't help but shed a tear at the touching movie ending.",
            "sent4": "The hardheartedness of winter seemed to seep into every corner of the town.",
            "sent5": "The hardheartedness of the judge's decision left the defendant in shock."
        }
    ]
}