{
    "term": "hardcores",
    "meanings": [
        {
            "definition": "The most dedicated or committed members of a group or subculture.",
            "pos": "noun",
            "sent1": "In the gaming community, the hardcores are the players who never miss a tournament.",
            "sent2": "The hardcores of the fitness group always motivate others to push their limits.",
            "sent3": "At the book club meeting, the hardcores brought their own snacks in case the discussion got too intense.",
            "sent4": "Her dedication to environmental causes made her one of the hardcores in the conservation group.",
            "sent5": "The hardcores' unwavering support for the team inspired everyone around them."
        },
        {
            "definition": "The most extreme or intense form of something.",
            "pos": "noun",
            "sent1": "The storm reached hardcores, with strong winds and heavy rain causing damage.",
            "sent2": "The movie's action scenes were hardcores, keeping the audience on the edge of their seats.",
            "sent3": "The competition between the two siblings for the last cookie became hardcores.",
            "sent4": "The singer's performance was hardcores, leaving the crowd in awe.",
            "sent5": "The dessert's sweetness was hardcores, making it irresistible to everyone at the party."
        },
        {
            "definition": "The solid inner core of a nuclear reactor.",
            "pos": "noun",
            "sent1": "The engineers inspected the hardcores of the reactor to ensure its stability.",
            "sent2": "Understanding the function of the hardcores is crucial for safe nuclear energy production.",
            "sent3": "The scientists joked that the hardcores of the reactor were like the heart of the operation.",
            "sent4": "The maintenance team worked diligently to protect the hardcores of the nuclear reactor.",
            "sent5": "The hardcores of the reactor must be shielded to prevent any radiation leaks."
        }
    ]
}