{
    "term": "hardline",
    "meanings": [
        {
            "definition": "Firm or uncompromising in a position or viewpoint.",
            "pos": "adjective",
            "sent1": "She took a hardline stance on the issue, refusing to consider any other options.",
            "sent2": "The manager's hardline decision left no room for negotiation.",
            "sent3": "The cat took a hardline approach to getting its favorite toy, refusing to play with anything else.",
            "sent4": "His hardline attitude towards punctuality was well-known among his colleagues.",
            "sent5": "The teacher's hardline rule about no talking during exams was strictly enforced."
        },
        {
            "definition": "Characterized by strict adherence to a particular set of beliefs or principles.",
            "pos": "adjective",
            "sent1": "The community was known for its hardline commitment to environmental conservation.",
            "sent2": "Her hardline dedication to her craft earned her respect from her peers.",
            "sent3": "The hardline belief in the power of lucky socks led to an interesting fashion trend.",
            "sent4": "The hardline loyalty of the fans was evident in their unwavering support.",
            "sent5": "His hardline adherence to the daily routine never wavered, even on weekends."
        },
        {
            "definition": "A strict or uncompromising policy or approach.",
            "pos": "noun",
            "sent1": "The government's hardline against illegal activities led to a decrease in crime rates.",
            "sent2": "The company's hardline on safety protocols ensured a secure work environment.",
            "sent3": "The hardline on dessert portions at the party left everyone craving more sweets.",
            "sent4": "Her hardline in negotiations made her a formidable opponent at the bargaining table.",
            "sent5": "The coach's hardline on punctuality set a standard of discipline for the team."
        }
    ]
}