{
    "term": "hardies",
    "meanings": [
        {
            "definition": "Bold or daring",
            "pos": "adjective",
            "sent1": "The hardies explorer ventured into the unknown forest.",
            "sent2": "She admired the hardies decision he made to speak up in class.",
            "sent3": "The hardies squirrel challenged the cat to a race.",
            "sent4": "His hardies spirit shone brightly in the face of adversity.",
            "sent5": "The hardies knight fearlessly faced the dragon to save the princess."
        },
        {
            "definition": "Strong or robust",
            "pos": "adjective",
            "sent1": "The hardies oak tree stood tall in the forest.",
            "sent2": "The hardies rope held the weight of the heavy box.",
            "sent3": "The hardies elephant effortlessly lifted the heavy log.",
            "sent4": "Her hardies willpower helped her overcome the challenges.",
            "sent5": "The hardies ship sailed through the storm without faltering."
        },
        {
            "definition": "To encourage or support",
            "pos": "verb",
            "sent1": "She always hardies her friends to pursue their dreams.",
            "sent2": "The coach hardies the team before the big game.",
            "sent3": "The teacher hardies her students to believe in themselves.",
            "sent4": "His words of wisdom hardies me to never give up.",
            "sent5": "The community hardies each other during difficult times."
        },
        {
            "definition": "To toughen or strengthen",
            "pos": "verb",
            "sent1": "Training regularly hardies the muscles for the competition.",
            "sent2": "The experience of failure hardies one's resolve for success.",
            "sent3": "Facing challenges head-on hardies the spirit for future obstacles.",
            "sent4": "Adversity only serves to hardies the determination to achieve goals.",
            "sent5": "The journey of life continuously hardies us for what lies ahead."
        }
    ]
}