{
    "term": "hard",
    "meanings": [
        {
            "definition": "Not easily penetrated or cut",
            "pos": "adjective",
            "sent1": "The rock was so hard that even the sharpest knife couldn't make a mark.",
            "sent2": "Studying for the test was hard, but I managed to pass with a good grade.",
            "sent3": "It was hard to believe that the cat could fit into such a small box.",
            "sent4": "Her heart was as hard as stone, unmoved by his heartfelt apology.",
            "sent5": "The diamond's hard surface sparkled in the sunlight, catching everyone's eye."
        },
        {
            "definition": "Difficult to endure or accomplish",
            "pos": "adjective",
            "sent1": "The long hike up the mountain was hard, but the view from the top was worth it.",
            "sent2": "It's hard to stay focused when there are so many distractions around.",
            "sent3": "Trying to juggle all those balls at once was hard, but he managed to keep them in the air.",
            "sent4": "Her words hit him hard, leaving him speechless and hurt.",
            "sent5": "The puzzle was so hard that it took hours to finally solve it."
        },
        {
            "definition": "Firmly fixed in place",
            "pos": "adjective",
            "sent1": "The door was hard shut, and no amount of pushing could open it.",
            "sent2": "The tree's roots were hard in the ground, keeping it stable during the storm.",
            "sent3": "The lid of the jar was on so hard that she had to ask for help to open it.",
            "sent4": "His beliefs were hard set, and nothing could sway his opinion.",
            "sent5": "The statue was hard in its position, standing tall and unmoving."
        },
        {
            "definition": "Lacking in empathy or understanding",
            "pos": "adjective",
            "sent1": "She had a hard heart, never showing compassion to those in need.",
            "sent2": "It's hard for him to understand others' feelings when he's so focused on himself.",
            "sent3": "His hard attitude made it difficult for others to approach him with their problems.",
            "sent4": "The teacher's hard response to the student's question left them feeling discouraged.",
            "sent5": "The boss's hard demeanor made the employees hesitant to share their ideas."
        },
        {
            "definition": "Intensely or severely",
            "pos": "adverb",
            "sent1": "The storm hit hard, causing damage to the houses in its path.",
            "sent2": "She worked hard to achieve her goals, never giving up despite the challenges.",
            "sent3": "The music was playing so hard that it could be heard from across the street.",
            "sent4": "The news hit him hard, leaving him in a state of shock.",
            "sent5": "The sun shone hard, casting a bright light over the entire garden."
        }
    ]
}