{
    "term": "hardpans",
    "meanings": [
        {
            "definition": "a layer of compacted soil that is impervious to water",
            "pos": "noun",
            "sent1": "The farmer struggled to plant crops due to the hardpans in the soil.",
            "sent2": "The construction workers encountered hardpans while digging the foundation.",
            "sent3": "The hardpans in the garden played a prank on the plants by not letting any water through.",
            "sent4": "Her heart felt like hardpans, impenetrable and unyielding to his affections.",
            "sent5": "The hardpans in the ground were like a stubborn barrier, refusing to let the water soak through."
        },
        {
            "definition": "to become compacted and impervious to water",
            "pos": "verb",
            "sent1": "Over time, the soil hardpans, making it difficult for plants to grow.",
            "sent2": "If you don't loosen the soil, it will hardpans and hinder water absorption.",
            "sent3": "The mud puddle decided to hardpans after the rain, not letting any more drops sink in.",
            "sent4": "His mind seemed to hardpans against new ideas, resistant to change.",
            "sent5": "The snow began to hardpans under the weight of the heavy boots, turning into solid ice."
        },
        {
            "definition": "a hard, compacted layer of soil that restricts root growth",
            "pos": "noun",
            "sent1": "The gardener had to break through the hardpans to help the plants thrive.",
            "sent2": "The tree's roots struggled to penetrate the hardpans beneath the surface.",
            "sent3": "The hardpans in the yard decided to have a party and invited all the roots to dance on top.",
            "sent4": "The hardpans of doubt in her mind prevented the roots of confidence from growing.",
            "sent5": "The hardpans acted like a shield, blocking the roots from reaching deeper into the soil."
        }
    ]
}