{
    "term": "harems",
    "meanings": [
        {
            "definition": "A group of women associated with one man.",
            "pos": "noun",
            "sent1": "In the story, the king had a large harem of queens and princesses.",
            "sent2": "The sultan's harem was filled with beautiful women from different lands.",
            "sent3": "The harem of ladies followed the prince everywhere, causing quite a commotion.",
            "sent4": "Her group of friends could be considered her own little harem, always by her side.",
            "sent5": "The harem of female dancers captivated the audience with their graceful movements."
        },
        {
            "definition": "The living quarters reserved for wives and concubines in a Muslim household.",
            "pos": "noun",
            "sent1": "The harem in the palace was elegantly decorated with luxurious fabrics and cushions.",
            "sent2": "The sultan visited the harem every evening to spend time with his wives.",
            "sent3": "One day, the mischievous cat sneaked into the harem and caused chaos among the concubines.",
            "sent4": "The harem was a sanctuary where the women could relax and unwind away from the busy palace life.",
            "sent5": "The scent of jasmine filled the harem, creating a peaceful atmosphere for the residents."
        },
        {
            "definition": "A group of female animals sharing a single male.",
            "pos": "noun",
            "sent1": "The lion's harem consisted of several lionesses who hunted together.",
            "sent2": "In the wild, you can often observe a harem of female elephants led by a dominant male.",
            "sent3": "The farmer noticed the harem of hens following the rooster around the yard.",
            "sent4": "The harem of female deer grazed peacefully in the meadow under the watchful eye of the buck.",
            "sent5": "The harem of female dolphins swam playfully alongside the male dolphin in the ocean."
        }
    ]
}