{
    "term": "harianas",
    "meanings": [
        {
            "definition": "Harianas (noun): a type of traditional Filipino dance",
            "pos": "noun",
            "sent1": "During the festival, the dancers performed the harianas with grace and joy.",
            "sent2": "The harianas is a beautiful dance that showcases the rich culture of the Philippines.",
            "sent3": "At the party, everyone tried to do the harianas, but ended up in a hilarious dance-off.",
            "sent4": "Her movements were like a gentle breeze, flowing through the harianas with elegance.",
            "sent5": "The rhythmic beats of the drums accompanied the harianas, creating a mesmerizing performance."
        },
        {
            "definition": "Harianas (adjective): relating to or characteristic of the Philippines",
            "pos": "adjective",
            "sent1": "The restaurant served delicious harianas dishes that reminded me of home.",
            "sent2": "She wore a beautiful harianas dress to celebrate the Filipino culture.",
            "sent3": "The harianas music playing in the background filled the room with warmth and nostalgia.",
            "sent4": "The painting depicted a scenic view of harianas landscapes under the golden sun.",
            "sent5": "His harianas accent was music to my ears, bringing back memories of my travels."
        },
        {
            "definition": "Harianas (verb): to perform a traditional Filipino dance",
            "pos": "verb",
            "sent1": "The group decided to harianas together to honor their heritage.",
            "sent2": "She practiced for weeks to harianas perfectly at the upcoming event.",
            "sent3": "As a surprise, the groom and bride chose to harianas for their first dance.",
            "sent4": "The dancers harmoniously harianas to the lively music, captivating the audience.",
            "sent5": "In the park, children joyfully harianas under the stars, creating a magical moment."
        }
    ]
}