{
    "term": "harken",
    "meanings": [
        {
            "definition": "Listen",
            "pos": "verb",
            "sent1": "I harken to the birds chirping outside my window.",
            "sent2": "Please harken to the teacher during the lesson.",
            "sent3": "If you harken closely, you might hear the whispers of the wind.",
            "sent4": "Her heart harkened to the call of the ocean waves.",
            "sent5": "Harken to the sound of the falling rain, it speaks softly."
        },
        {
            "definition": "Pay attention",
            "pos": "verb",
            "sent1": "Harken to the warning signs along the road.",
            "sent2": "It is important to harken when crossing the street.",
            "sent3": "She failed to harken to the caution tape and tripped over it.",
            "sent4": "The old clock tower harkened to the passing of time.",
            "sent5": "Harken to the advice of the wise owl perched on the branch."
        },
        {
            "definition": "Hear or heed",
            "pos": "verb",
            "sent1": "I always harken to the sound of my mother's voice.",
            "sent2": "The dog would harken to its owner's commands.",
            "sent3": "The cat refused to harken to the call of its name.",
            "sent4": "The ancient ruins harkened to the stories of the past.",
            "sent5": "Harken to the melody of the violin, it sings a sweet tune."
        },
        {
            "definition": "Obey or follow",
            "pos": "verb",
            "sent1": "The loyal knight would always harken to the king's orders.",
            "sent2": "Children should harken to their parents' guidance.",
            "sent3": "The mischievous squirrel did not harken to the 'Do not feed' sign.",
            "sent4": "The wild horses harkened to the call of the herd leader.",
            "sent5": "Harken to the rules of the forest, or face the consequences."
        }
    ]
}