{
    "term": "harlequins",
    "meanings": [
        {
            "definition": "A comic character in traditional pantomime, typically masked and dressed in a diamond-patterned costume.",
            "pos": "noun",
            "sent1": "The children at the circus laughed at the funny harlequins.",
            "sent2": "The harlequins in the play wore colorful costumes and entertained the audience.",
            "sent3": "The harlequins tripped over each other, causing the audience to burst into laughter.",
            "sent4": "Her personality was like a group of harlequins, always changing and full of surprises.",
            "sent5": "The image of the harlequins dancing on stage stayed in the audience's minds long after the show."
        },
        {
            "definition": "A pattern of contrasting colors or shapes resembling the costume of a harlequin.",
            "pos": "noun",
            "sent1": "The quilt had a beautiful harlequins design with bright colors.",
            "sent2": "The building's exterior featured a harlequins pattern that caught everyone's attention.",
            "sent3": "She painted her room in a harlequins style, making it look vibrant and lively.",
            "sent4": "The city skyline at night looked like a harlequins of lights and shadows.",
            "sent5": "The artist used a harlequins of colors to create a striking painting that stood out in the gallery."
        },
        {
            "definition": "A professional rugby team based in London, England.",
            "pos": "noun",
            "sent1": "The harlequins won the championship with their exceptional teamwork.",
            "sent2": "Fans cheered loudly for the harlequins during the final match.",
            "sent3": "The harlequins celebrated their victory with a parade through the city.",
            "sent4": "The harlequins' coach was proud of the team's performance throughout the season.",
            "sent5": "Watching the harlequins play rugby was an exciting experience for the spectators."
        }
    ]
}