{
    "term": "harmonic",
    "meanings": [
        {
            "definition": "Relating to harmony or music.",
            "pos": "adjective",
            "sent1": "The choir sang in harmonic tones, creating a beautiful melody.",
            "sent2": "The band members played their instruments in perfect harmonic synchronization.",
            "sent3": "The birds chirped in harmonic unison, as if they were part of a musical ensemble.",
            "sent4": "The colors of the sunset blended together in a harmonic display across the sky.",
            "sent5": "The dancers moved in harmonic rhythm, like notes in a musical composition."
        },
        {
            "definition": "Characterized by harmony or agreement.",
            "pos": "adjective",
            "sent1": "The family had a harmonic relationship, always supporting each other.",
            "sent2": "The team worked in a harmonic manner to achieve their common goal.",
            "sent3": "The flavors in the dish were surprisingly harmonic, creating a perfect blend.",
            "sent4": "The different elements of the painting came together in a harmonic balance.",
            "sent5": "The community lived in harmonic peace, respecting each other's differences."
        },
        {
            "definition": "A component of a complex wave that has a frequency that is an integral multiple of the fundamental frequency.",
            "pos": "noun",
            "sent1": "The sound engineer adjusted the harmonic to enhance the audio quality.",
            "sent2": "The musician studied the harmonic of the wave to create a unique sound.",
            "sent3": "The scientist discovered a new harmonic in the wave pattern, surprising the research team.",
            "sent4": "The radio host explained the concept of harmonic to the listeners, making it easy to understand.",
            "sent5": "The mathematician calculated the harmonic of the wave, revealing its complex structure."
        }
    ]
}