{
    "term": "harpsichords",
    "meanings": [
        {
            "definition": "A musical instrument played by means of a keyboard",
            "pos": "noun",
            "sent1": "The school had a room filled with harpsichords for the students to practice on.",
            "sent2": "The musician played a beautiful melody on the harpsichords during the concert.",
            "sent3": "The harpsichords at the music store seemed to be having a conversation with each other.",
            "sent4": "The sound of the harpsichords filled the room like a gentle breeze on a summer day.",
            "sent5": "The intricate design of the harpsichords made them look like elegant pieces of furniture."
        },
        {
            "definition": "Plural form of harpsichord",
            "pos": "noun",
            "sent1": "In the music museum, there were many harpsichords on display from different time periods.",
            "sent2": "The orchestra needed more harpsichords for their upcoming performance.",
            "sent3": "The collection of harpsichords in the room made it feel like a magical forest of music.",
            "sent4": "The harpsichords in the room stood out like colorful flowers in a field of green grass.",
            "sent5": "The harmonious sounds of the harpsichords echoed through the concert hall."
        },
        {
            "definition": "Used to refer to multiple harpsichords",
            "pos": "noun",
            "sent1": "The music shop had a sale on harpsichords, so I bought two for my home.",
            "sent2": "At the music festival, there were rows of harpsichords lined up for the performers.",
            "sent3": "The room was so full of harpsichords that it felt like a crowded party of instruments.",
            "sent4": "The sound of multiple harpsichords playing together was like a symphony of keys and strings.",
            "sent5": "The sight of the many harpsichords on stage was a breathtaking display of musical artistry."
        }
    ]
}