{
    "term": "harpies",
    "meanings": [
        {
            "definition": "Cruel or grasping person",
            "pos": "noun",
            "sent1": "The harpies in the story always wanted more and never shared.",
            "sent2": "She was known as a harpies because she would take advantage of others for her own gain.",
            "sent3": "The harpies at the office would always steal other people's ideas.",
            "sent4": "The landlord was a harpies, constantly increasing the rent without reason.",
            "sent5": "The harpies in the fairy tale would trick people into giving them their belongings."
        },
        {
            "definition": "Mythological creature with a woman's head and a bird's body",
            "pos": "noun",
            "sent1": "In the ancient story, the harpies would swoop down from the sky with their bird-like bodies.",
            "sent2": "The harpies were feared by sailors for their ability to create storms at sea.",
            "sent3": "The harpies in the myth were always depicted as fierce and powerful creatures.",
            "sent4": "The harpies' screeches echoed through the forest, sending shivers down the spines of all who heard.",
            "sent5": "The hero encountered the harpies guarding the treasure, their wingspan blocking the entrance."
        },
        {
            "definition": "Annoying or nagging woman",
            "pos": "noun",
            "sent1": "She can be a real harpies when she starts complaining about everything.",
            "sent2": "The harpies next door would always find something to criticize about our garden.",
            "sent3": "The harpies in the comedy show kept pestering the main character with silly questions.",
            "sent4": "Her mother-in-law was a harpies, constantly nagging her about how to raise her children.",
            "sent5": "The harpies in the story would never stop talking, driving everyone around her crazy."
        }
    ]
}