{
    "term": "hatred",
    "meanings": [
        {
            "definition": "Intense dislike or ill will towards someone or something.",
            "pos": "noun",
            "sent1": "Her hatred towards spiders made her scream whenever she saw one.",
            "sent2": "The siblings' hatred for each other was evident in their constant arguments.",
            "sent3": "Despite her hatred for broccoli, she tried to hide it in her napkin without anyone noticing.",
            "sent4": "The dark clouds of hatred loomed over the peaceful town, causing tension among the residents.",
            "sent5": "The teacher's hatred for tardiness was well-known among the students."
        },
        {
            "definition": "A feeling of strong aversion or intense dislike.",
            "pos": "noun",
            "sent1": "His hatred of public speaking made him nervous before every presentation.",
            "sent2": "The movie received widespread hatred from critics for its poor acting.",
            "sent3": "She couldn't hide her hatred of the taste of the medicine, making it difficult to swallow.",
            "sent4": "The athlete's hatred of losing drove him to train harder than ever before.",
            "sent5": "The child's hatred of vegetables led to creative ways of avoiding them at dinner."
        },
        {
            "definition": "Hostility and animosity towards a person or group.",
            "pos": "noun",
            "sent1": "The political debate was filled with hatred between the two candidates.",
            "sent2": "The rivalry between the two teams was fueled by years of accumulated hatred.",
            "sent3": "Despite their mutual hatred, they managed to work together on the project.",
            "sent4": "The hatred between the neighboring kingdoms led to years of conflict and war.",
            "sent5": "The teacher tried to address the students' hatred towards each other through open discussions."
        }
    ]
}