{
    "term": "haughtiest",
    "meanings": [
        {
            "definition": "Having or showing arrogant superiority",
            "pos": "adjective",
            "sent1": "She acted like the haughtiest person in the room, looking down on everyone else.",
            "sent2": "The queen's haughtiest expression made it clear she considered herself above all others.",
            "sent3": "Despite being just a squirrel, he put on his haughtiest face when challenging the cat.",
            "sent4": "The haughtiest peacock strutted around the farm, demanding attention from all.",
            "sent5": "Her haughtiest tone could make even the bravest knight feel small."
        },
        {
            "definition": "Behaving in a proud and disdainful manner",
            "pos": "adjective",
            "sent1": "He gave a haughtiest laugh, looking down at those who dared to question him.",
            "sent2": "The actress's haughtiest attitude made it difficult for her to make friends on set.",
            "sent3": "The haughtiest cat in the neighborhood refused to play with the other felines.",
            "sent4": "With a haughtiest toss of her head, she walked away from the argument, feeling superior.",
            "sent5": "His haughtiest behavior at the party alienated many of the guests."
        },
        {
            "definition": "Displaying an attitude of superiority or disdain",
            "pos": "adjective",
            "sent1": "The haughtiest student in the class always acted as if he knew better than the teacher.",
            "sent2": "Her haughtiest remarks during the meeting offended her colleagues.",
            "sent3": "The haughtiest dog at the park refused to play with any other pets.",
            "sent4": "With the haughtiest expression, she dismissed his suggestion without a second thought.",
            "sent5": "The haughtiest look in his eyes made it clear he believed himself to be above everyone else."
        }
    ]
}