{
    "term": "haunched",
    "meanings": [
        {
            "definition": "Having a haunch or haunches.",
            "pos": "adjective",
            "sent1": "The haunched rabbit hopped quickly across the field.",
            "sent2": "The lion's haunched body moved gracefully as it stalked its prey.",
            "sent3": "The haunched cat tried to squeeze through the narrow gap but got stuck halfway.",
            "sent4": "The haunched mountain stood tall against the horizon, casting a shadow over the valley.",
            "sent5": "The haunched elephant lumbered through the dense jungle, its powerful legs carrying its massive body effortlessly."
        },
        {
            "definition": "Having a hump or humps.",
            "pos": "adjective",
            "sent1": "The camel's haunched back was laden with heavy bags of goods.",
            "sent2": "The haunched camel knelt down to allow the weary traveler to climb aboard.",
            "sent3": "The haunched camel looked comical with its oversized load causing its back to rise in a hump.",
            "sent4": "The haunched dromedary stood out in the desert landscape, its hump a symbol of survival in harsh conditions.",
            "sent5": "The haunched camel's hump swayed gently as it walked, a natural reservoir of water in the arid desert."
        },
        {
            "definition": "Having a hip or hips.",
            "pos": "adjective",
            "sent1": "The haunched dancer moved gracefully across the stage, emphasizing her fluid hip movements.",
            "sent2": "The haunched horse galloped with power, its hips propelling it forward.",
            "sent3": "The haunched penguin waddled awkwardly, its hips swinging from side to side.",
            "sent4": "The haunched figure skater glided effortlessly on the ice, showcasing her strong hips.",
            "sent5": "The haunched athlete sprinted towards the finish line, the movement of her hips driving her forward."
        }
    ]
}