{
    "term": "haunt",
    "meanings": [
        {
            "definition": "To visit frequently or habitually",
            "pos": "verb",
            "sent1": "The memories of her childhood home haunt her dreams.",
            "sent2": "The old abandoned house seemed to haunt the neighborhood.",
            "sent3": "The idea of eating broccoli every day would haunt him forever.",
            "sent4": "The haunting melody of the song stayed with her long after it ended.",
            "sent5": "The image of the red balloon floating in the sky would haunt his thoughts."
        },
        {
            "definition": "A place frequently visited",
            "pos": "noun",
            "sent1": "The park became his favorite haunt for weekend picnics.",
            "sent2": "The local cafe was a popular haunt for students after school.",
            "sent3": "The library was a haunt for book lovers seeking new adventures.",
            "sent4": "The beach was a haunt for seagulls searching for food.",
            "sent5": "The forest trail was a haunt for hikers exploring nature."
        },
        {
            "definition": "To be persistently in the mind of",
            "pos": "verb",
            "sent1": "The idea of traveling the world would haunt her thoughts.",
            "sent2": "His words of encouragement would haunt her during challenging times.",
            "sent3": "The image of the cute puppy would haunt her mind all day.",
            "sent4": "The thought of the upcoming exam would haunt him until he studied.",
            "sent5": "The smell of fresh cookies baking would haunt her senses."
        },
        {
            "definition": "A ghost or spirit",
            "pos": "noun",
            "sent1": "The haunted house was said to be home to a friendly haunt.",
            "sent2": "The children told stories of a mysterious haunt in the attic.",
            "sent3": "The Halloween costume party featured a spooky haunt as the main attraction.",
            "sent4": "The legend of the haunted ship included tales of a vengeful haunt.",
            "sent5": "The old graveyard was rumored to be haunted by a mischievous haunt."
        }
    ]
}