{
    "term": "havocs",
    "meanings": [
        {
            "definition": "Widespread destruction or devastation",
            "pos": "noun",
            "sent1": "The hurricane brought havocs to the coastal town, leaving buildings destroyed and streets flooded.",
            "sent2": "The earthquake unleashed havocs on the city, toppling buildings and causing widespread damage.",
            "sent3": "The mischievous raccoon wreaked havocs in the garden, scattering trash everywhere.",
            "sent4": "The virus spread like wildfire, wreaking havocs on the population and overwhelming healthcare systems.",
            "sent5": "The tornado's path of havocs was visible from miles away, showing the extent of its destruction."
        },
        {
            "definition": "To cause great damage or harm",
            "pos": "verb",
            "sent1": "The vandals planned to havocs the park by spray painting graffiti on the walls.",
            "sent2": "The wildfire can easily havocs the entire forest if not contained quickly.",
            "sent3": "The mischievous child loves to havocs his room by throwing toys everywhere.",
            "sent4": "The hacker's virus aimed to havocs the company's computer systems and steal sensitive information.",
            "sent5": "The reckless driver's actions could havocs innocent lives on the road if not stopped."
        },
        {
            "definition": "Chaos or disorder caused by a destructive force",
            "pos": "noun",
            "sent1": "The protest turned into havocs as clashes broke out between the demonstrators and the police.",
            "sent2": "The arrival of the unexpected guest caused havocs in the carefully planned party.",
            "sent3": "The playful puppy created havocs in the living room, knocking over vases and spilling water.",
            "sent4": "The rumor about layoffs spread quickly, causing havocs among the employees.",
            "sent5": "The sudden power outage led to havocs in the office, with everyone scrambling to find flashlights."
        }
    ]
}