{
    "term": "hazmats",
    "meanings": [
        {
            "definition": "Hazardous materials",
            "pos": "noun",
            "sent1": "The factory workers handled hazmats with caution.",
            "sent2": "It is important to properly dispose of hazmats to protect the environment.",
            "sent3": "The hazmats in the storage room seemed to whisper 'danger' to the workers.",
            "sent4": "The hazmats were like silent troublemakers waiting to cause chaos.",
            "sent5": "The bright red labels on the hazmats warned of their dangerous nature."
        },
        {
            "definition": "Hazmat suits",
            "pos": "noun",
            "sent1": "The hazmats suits shielded the firefighters from harm.",
            "sent2": "The hazmats suits were stored in a special locker for emergencies.",
            "sent3": "The hazmats suits made the wearers look like astronauts on a mission.",
            "sent4": "Wearing the hazmats suits transformed the workers into safety warriors.",
            "sent5": "The hazmats suits were like protective cocoons against danger."
        },
        {
            "definition": "Hazmat team",
            "pos": "noun",
            "sent1": "The hazmats team rushed to the scene of the spill.",
            "sent2": "The hazmats team trained regularly to handle emergencies effectively.",
            "sent3": "The hazmats team's mascot, a brave squirrel, brought smiles to their faces.",
            "sent4": "The hazmats team worked together like a well-oiled machine.",
            "sent5": "The hazmats team's dedication shone brightly during the crisis."
        },
        {
            "definition": "Hazmat training",
            "pos": "noun",
            "sent1": "The hazmats training included simulations of various hazardous scenarios.",
            "sent2": "New employees underwent hazmats training to ensure safety protocols were understood.",
            "sent3": "During hazmats training, the instructor accidentally triggered a fake spill, causing laughter.",
            "sent4": "Hazmats training was like preparing for a safety marathon.",
            "sent5": "The hazmats training left a lasting impression on the trainees."
        }
    ]
}