{
    "term": "headstones",
    "meanings": [
        {
            "definition": "A stone marker placed at the head of a grave.",
            "pos": "noun",
            "sent1": "The headstones in the cemetery were old and weathered.",
            "sent2": "Families often visit the headstones of their loved ones to pay their respects.",
            "sent3": "The headstones seemed to whisper stories of the past to those who listened.",
            "sent4": "The headstones stood like silent sentinels guarding the memories of the deceased.",
            "sent5": "The headstones gleamed in the moonlight, casting eerie shadows on the ground."
        },
        {
            "definition": "A monument or marker that identifies a burial site.",
            "pos": "noun",
            "sent1": "Tourists gathered around the headstones to learn about the history of the cemetery.",
            "sent2": "The headstones were engraved with the names of those who had passed away.",
            "sent3": "The headstones looked like tiny castles marking the final resting places of the deceased.",
            "sent4": "The headstones stood tall and proud, a testament to the lives they commemorated.",
            "sent5": "The headstones served as beacons guiding visitors through the cemetery's winding paths."
        },
        {
            "definition": "A memorial stone placed at the head of a grave to mark the location.",
            "pos": "noun",
            "sent1": "The headstones were adorned with fresh flowers in loving memory of the departed.",
            "sent2": "Visitors left small tokens of remembrance on the headstones as a sign of respect.",
            "sent3": "The headstones seemed to nod in approval at the visitors paying their respects.",
            "sent4": "The headstones stood stoically, bearing witness to the passage of time.",
            "sent5": "The headstones shone brightly in the sunlight, a symbol of eternal remembrance."
        }
    ]
}