{
    "term": "headbangers",
    "meanings": [
        {
            "definition": "A person who vigorously shakes their head in time to music, typically heavy metal.",
            "pos": "noun",
            "sent1": "At the concert, the headbangers were enjoying the music by moving their heads energetically.",
            "sent2": "The headbangers at the metal show were headbanging to the beat of the drums.",
            "sent3": "The headbangers looked like they were having a head-shaking competition at the concert.",
            "sent4": "The headbangers' synchronized head movements created a mesmerizing sight.",
            "sent5": "The headbangers' head-shaking was so intense, it seemed like they were in their own world."
        },
        {
            "definition": "A genre of music characterized by aggressive guitar riffs and intense drumming, often enjoyed by headbangers.",
            "pos": "noun",
            "sent1": "Heavy metal is a popular genre among headbangers who love energetic music.",
            "sent2": "The headbangers were thrilled to hear their favorite headbanging music at the concert.",
            "sent3": "The headbangers' playlist was filled with headbanging tunes that got them pumped up.",
            "sent4": "The headbangers' love for intense guitar riffs defined their music taste.",
            "sent5": "The headbangers' passion for headbanging music was evident in their excitement at the concert."
        },
        {
            "definition": "The act of headbanging, a common form of expression at rock concerts.",
            "pos": "noun",
            "sent1": "Headbanging is a fun way for concert-goers to show their love for the music.",
            "sent2": "The headbangers' headbanging added to the energetic atmosphere of the rock concert.",
            "sent3": "The headbangers' headbanging was so enthusiastic that even the band members joined in.",
            "sent4": "The headbangers' synchronized head movements were like a dance to the music.",
            "sent5": "The headbangers' headbanging was a memorable part of the rock concert experience."
        }
    ]
}