{
    "term": "heads",
    "meanings": [
        {
            "definition": "The upper part of the human body, containing the brain and other organs.",
            "pos": "noun",
            "sent1": "She bumped her heads on the low doorway.",
            "sent2": "The baby has a soft spot on their heads.",
            "sent3": "Heads up! Watch out for that tree branch!",
            "sent4": "Her thoughts were swimming in her heads like fish in a pond.",
            "sent5": "The heads of the flowers swayed gently in the breeze."
        },
        {
            "definition": "The top or front of something.",
            "pos": "noun",
            "sent1": "The heads of the bookshelf were beautifully carved.",
            "sent2": "The heads of the mountains were covered in snow.",
            "sent3": "The heads of the line were excited to enter the amusement park.",
            "sent4": "The heads of the waves crashed against the shore.",
            "sent5": "The heads of the building gleamed in the sunlight."
        },
        {
            "definition": "A person in charge or leader.",
            "pos": "noun",
            "sent1": "The heads of the company made an important decision.",
            "sent2": "The heads of the team led them to victory.",
            "sent3": "The heads of the household organized a family meeting.",
            "sent4": "She was the heads of the student council.",
            "sent5": "The heads of the tribe were respected by all."
        },
        {
            "definition": "To move in a particular direction.",
            "pos": "verb",
            "sent1": "The boat heads towards the island.",
            "sent2": "The car heads down the street.",
            "sent3": "The cat heads towards its favorite napping spot.",
            "sent4": "The hiker heads up the mountain trail.",
            "sent5": "The bird heads south for the winter."
        },
        {
            "definition": "To be in charge or take responsibility.",
            "pos": "verb",
            "sent1": "She heads the project with efficiency.",
            "sent2": "He heads the department with authority.",
            "sent3": "The dog heads the pack during their walks.",
            "sent4": "The teacher heads the class discussion.",
            "sent5": "The captain heads the ship through rough waters."
        }
    ]
}