{
    "term": "heady",
    "meanings": [
        {
            "definition": "Having a strong or intoxicating effect",
            "pos": "adjective",
            "sent1": "The heady aroma of freshly baked cookies filled the kitchen.",
            "sent2": "The heady scent of flowers in the garden was delightful.",
            "sent3": "The heady mix of spices in the stew made everyone's eyes water.",
            "sent4": "The heady rush of adrenaline before a roller coaster ride is exhilarating.",
            "sent5": "The heady feeling of success after winning the game was unforgettable."
        },
        {
            "definition": "Reckless or impetuous",
            "pos": "adjective",
            "sent1": "His heady decision to jump off the cliff without checking for safety was dangerous.",
            "sent2": "She made a heady choice to drive fast in the rain, risking an accident.",
            "sent3": "The heady move to quit his job without a backup plan left him in a tough spot.",
            "sent4": "Their heady behavior at the party led to some unexpected consequences.",
            "sent5": "The heady impulse to buy a pet without considering the responsibility was regrettable."
        },
        {
            "definition": "Bold or daring",
            "pos": "adjective",
            "sent1": "The heady decision to climb the mountain without a guide was brave.",
            "sent2": "Her heady move to speak up against injustice was commendable.",
            "sent3": "The heady choice to try skydiving for the first time was met with nervous laughter.",
            "sent4": "Their heady plan to start a business from scratch was met with skepticism.",
            "sent5": "The heady act of standing up to a bully showed true courage."
        },
        {
            "definition": "Exciting or stimulating",
            "pos": "adjective",
            "sent1": "The heady news of a surprise party for her birthday made her smile.",
            "sent2": "The heady feeling of anticipation before a concert is electrifying.",
            "sent3": "The heady idea of traveling the world on a whim sparked their imagination.",
            "sent4": "The heady atmosphere at the carnival filled the air with joy.",
            "sent5": "The heady experience of riding a roller coaster for the first time was thrilling."
        }
    ]
}