{
    "term": "headpin",
    "meanings": [
        {
            "definition": "A bowling pin that stands at the front of the triangular arrangement of pins",
            "pos": "noun",
            "sent1": "The headpin in bowling is the first pin you aim to knock down.",
            "sent2": "Make sure you aim for the headpin when bowling to get a strike.",
            "sent3": "When the headpin fell, it looked like the leader of the pin group was taking a nap.",
            "sent4": "The headpin stood tall like a guardian at the front of the pin formation.",
            "sent5": "The headpin, like a king, commands the attention of all other pins in bowling."
        },
        {
            "definition": "A pin used in sewing to secure fabric pieces together",
            "pos": "noun",
            "sent1": "She carefully placed the headpin to hold the fabric in place before sewing.",
            "sent2": "Don't forget to remove the headpin after you finish sewing the fabric together.",
            "sent3": "The headpin held the fabric like a tiny hero keeping everything in order.",
            "sent4": "Her fingers moved swiftly, securing the fabric with the headpin like a skilled tailor.",
            "sent5": "The headpin, like a tiny sentinel, guarded the fabric pieces from shifting."
        },
        {
            "definition": "The main or top part of something, such as a nail or screw",
            "pos": "noun",
            "sent1": "Make sure the headpin of the nail is flush with the surface for a neat finish.",
            "sent2": "The headpin of the screw should be securely fastened to hold the shelf in place.",
            "sent3": "The headpin of the nail peeked out like a curious little explorer.",
            "sent4": "The headpin of the screw, like a crown, held everything together at the top.",
            "sent5": "The headpin of the nail, gleaming in the light, was the finishing touch to the project."
        }
    ]
}