{
    "term": "head",
    "meanings": [
        {
            "definition": "The upper part of the human body, containing the brain and the eyes, ears, nose, mouth, and jaws.",
            "pos": "noun",
            "sent1": "She bumped her head on the door frame.",
            "sent2": "The baby has a soft spot on its head.",
            "sent3": "He shook his head in disbelief.",
            "sent4": "The idea popped into her head out of nowhere.",
            "sent5": "The head of the table was reserved for the guest of honor."
        },
        {
            "definition": "The front, top, or upper part of something.",
            "pos": "noun",
            "sent1": "The head of the bed was against the wall.",
            "sent2": "The head of the line reached the ticket counter first.",
            "sent3": "The head of the arrow was sharp and pointed.",
            "sent4": "The head of the mountain was covered in snow.",
            "sent5": "The head of the document contained the title and date."
        },
        {
            "definition": "The person in charge of a group or organization.",
            "pos": "noun",
            "sent1": "The head of the company made an important decision.",
            "sent2": "The head of the team led them to victory.",
            "sent3": "The head of the household managed the finances.",
            "sent4": "The head of the committee organized the event.",
            "sent5": "The head of the school greeted the students every morning."
        },
        {
            "definition": "A person who is in charge of a department or division within an organization.",
            "pos": "noun",
            "sent1": "The head of the marketing department approved the campaign.",
            "sent2": "The head of the IT division fixed the network issue.",
            "sent3": "The head of the sales team exceeded the monthly target.",
            "sent4": "The head of the HR department conducted interviews.",
            "sent5": "The head of the finance division managed the budget efficiently."
        },
        {
            "definition": "The top or leading position in a competition or organization.",
            "pos": "noun",
            "sent1": "She aimed to be the head of the class this semester.",
            "sent2": "The head of the leaderboard changed frequently during the race.",
            "sent3": "The head of the tournament received a trophy.",
            "sent4": "The head of the company was a visionary leader.",
            "sent5": "The head of the organization set ambitious goals for the team."
        }
    ]
}