{
    "term": "hearts",
    "meanings": [
        {
            "definition": "The organ in the body that pumps blood.",
            "pos": "noun",
            "sent1": "Our hearts beat to keep us alive.",
            "sent2": "Doctors listen to hearts with a stethoscope.",
            "sent3": "I can't believe my heart decided to skip a beat!",
            "sent4": "Her heart of gold shines through in everything she does.",
            "sent5": "The heart is a vital organ that we must take care of."
        },
        {
            "definition": "The central or innermost part of something.",
            "pos": "noun",
            "sent1": "The heart of the matter is understanding each other.",
            "sent2": "In the heart of the forest, you can find peace.",
            "sent3": "The heart of the puzzle was missing, making it impossible to solve.",
            "sent4": "The heart of the city buzzes with energy and life.",
            "sent5": "The heart of a story is what keeps us reading."
        },
        {
            "definition": "A shape or symbol representing love or affection.",
            "pos": "noun",
            "sent1": "She drew hearts all over the Valentine's card.",
            "sent2": "The heart emoji is used to express love online.",
            "sent3": "He sent her a heart-shaped balloon to show his affection.",
            "sent4": "Their love was like a heart drawn in the sand, easily washed away.",
            "sent5": "The heart symbol is universally recognized as a sign of love."
        },
        {
            "definition": "The suit in a deck of cards with a red heart symbol.",
            "pos": "noun",
            "sent1": "I always try to collect hearts when playing cards.",
            "sent2": "The queen of hearts is a powerful card in the deck.",
            "sent3": "Hearts are my lucky suit in card games.",
            "sent4": "She held the ace of hearts, securing her victory.",
            "sent5": "The heart suit is associated with love and luck in games."
        }
    ]
}