{
    "term": "heard",
    "meanings": [
        {
            "definition": "past tense of hear",
            "pos": "verb",
            "sent1": "Yesterday, I heard a loud noise.",
            "sent2": "I heard a beautiful song on the radio.",
            "sent3": "I heard a joke that made me laugh out loud.",
            "sent4": "Her words were like music to my ears, and I heard every note.",
            "sent5": "The sound of the waves crashing against the shore was heard throughout the night."
        },
        {
            "definition": "to receive information by the ear",
            "pos": "verb",
            "sent1": "She heard the news of her promotion with joy.",
            "sent2": "I heard the sound of footsteps approaching.",
            "sent3": "I heard a secret whispered in the wind.",
            "sent4": "The truth can be heard even in the quietest of whispers.",
            "sent5": "The birds chirping outside could be heard clearly through the open window."
        },
        {
            "definition": "to be informed of",
            "pos": "verb",
            "sent1": "I heard about the party from a friend.",
            "sent2": "Have you heard the latest gossip?",
            "sent3": "I heard about the new movie coming out next week.",
            "sent4": "The news I heard today left me speechless.",
            "sent5": "The rumors I heard turned out to be true after all."
        },
        {
            "definition": "to listen to",
            "pos": "verb",
            "sent1": "I heard the teacher's instructions carefully.",
            "sent2": "She heard the music playing softly in the background.",
            "sent3": "I heard the podcast while cooking dinner.",
            "sent4": "His words were so captivating that I heard every syllable.",
            "sent5": "The audience heard the speaker's message loud and clear."
        },
        {
            "definition": "to perceive by the ear",
            "pos": "verb",
            "sent1": "I heard a strange noise coming from the attic.",
            "sent2": "She heard the sound of raindrops on the roof.",
            "sent3": "I heard a melody in the distance.",
            "sent4": "The wind whispered secrets that only I could hear.",
            "sent5": "The howling of the wind could be heard echoing through the valley."
        }
    ]
}