{
    "term": "hearties",
    "meanings": [
        {
            "definition": "hearty - warm and friendly in manner",
            "pos": "adjective",
            "sent1": "The hearties greeting from the neighbor made me feel welcome.",
            "sent2": "She always has a hearties smile for everyone she meets.",
            "sent3": "The hearties wave from the mailman brightened my day.",
            "sent4": "Her hearties nature was like a ray of sunshine on a cloudy day.",
            "sent5": "The hearties welcome at the party made me feel like part of the family."
        },
        {
            "definition": "hearty - strong and healthy",
            "pos": "adjective",
            "sent1": "After a good night's sleep, I woke up feeling hearties and ready for the day.",
            "sent2": "The athlete's hearties physique was a result of regular exercise and a balanced diet.",
            "sent3": "The hearties horse galloped across the field with grace and strength.",
            "sent4": "The hearties oak tree stood tall and proud in the forest.",
            "sent5": "The hearties lion roared loudly, showing its strength and vitality."
        },
        {
            "definition": "hearty - enthusiastic and sincere",
            "pos": "adjective",
            "sent1": "The hearties applause from the audience showed their genuine appreciation.",
            "sent2": "She gave a hearties cheer to support her friend during the race.",
            "sent3": "The hearties laughter of the children filled the room with joy.",
            "sent4": "Her hearties speech inspired everyone in the room to take action.",
            "sent5": "The hearties support from the community lifted everyone's spirits."
        },
        {
            "definition": "hearty - a person who is hearty",
            "pos": "adjective",
            "sent1": "Grandpa is a hearties man who loves to tell stories by the fireplace.",
            "sent2": "The hearties chef prepared a delicious meal for the guests.",
            "sent3": "The hearties sailor shared tales of his adventures at sea.",
            "sent4": "The hearties grandmother always had a warm hug and a kind word.",
            "sent5": "The hearties farmer greeted everyone with a smile at the market."
        }
    ]
}