{
    "term": "heats",
    "meanings": [
        {
            "definition": "The form of energy associated with the motion of atoms or molecules and capable of being transmitted through solid and fluid media by conduction, through fluid media by convection, and through empty space by radiation.",
            "pos": "noun",
            "sent1": "The heats from the sun warm the Earth and make life possible.",
            "sent2": "The heats from the fire kept us warm during the camping trip.",
            "sent3": "The heats from the oven made the cookies bake faster than expected.",
            "sent4": "The heats of the argument between the siblings could be felt by everyone in the room.",
            "sent5": "The intense heats of the desert made it a challenging environment to survive in."
        },
        {
            "definition": "The condition or quality of being hot; high temperature.",
            "pos": "noun",
            "sent1": "After playing outside, the child felt the heats of the sun on their skin.",
            "sent2": "The heats of the summer day made everyone seek shade.",
            "sent3": "The heats of the spicy chili made his mouth burn.",
            "sent4": "The heats of the sauna enveloped her in a comforting warmth.",
            "sent5": "The heats of the bonfire kept us cozy on the cool evening."
        },
        {
            "definition": "A period of intense or extreme weather, such as a heat wave.",
            "pos": "noun",
            "sent1": "During the heats of summer, people often seek relief in air-conditioned buildings.",
            "sent2": "The sudden heats of the storm caught everyone off guard.",
            "sent3": "The unexpected heats of the blizzard made for a memorable snow day.",
            "sent4": "The heats of the heat wave made it unbearable to be outside for long.",
            "sent5": "The extreme heats of the drought caused crops to wither in the fields."
        },
        {
            "definition": "A source of heat, such as a stove or furnace.",
            "pos": "noun",
            "sent1": "The heats from the fireplace warmed the entire living room.",
            "sent2": "She placed her hands near the heats of the stove to warm them up.",
            "sent3": "The heats of the grill filled the backyard with a delicious aroma.",
            "sent4": "The heats of the radiator kept the room cozy on cold winter nights.",
            "sent5": "The heats of the campfire provided light and warmth in the dark forest."
        },
        {
            "definition": "Intensity of feeling, especially of anger or excitement.",
            "pos": "noun",
            "sent1": "The heats of his anger were evident in his clenched fists.",
            "sent2": "The heats of excitement bubbled within her as she opened the gift.",
            "sent3": "The heats of the competition fueled their determination to win.",
            "sent4": "The heats of the crowd's cheers motivated the team to give their best performance.",
            "sent5": "The heats of her passion for music shone through in her energetic performance."
        }
    ]
}