{
    "term": "heaviness",
    "meanings": [
        {
            "definition": "The quality or state of being heavy.",
            "pos": "noun",
            "sent1": "The heaviness of the box made it difficult to lift.",
            "sent2": "I could feel the heaviness of the rock in my hand.",
            "sent3": "The heaviness of the rain clouds signaled a storm was coming.",
            "sent4": "The heaviness of the news weighed on her heart.",
            "sent5": "The heaviness of the silence in the room was palpable."
        },
        {
            "definition": "The degree to which something is heavy.",
            "pos": "noun",
            "sent1": "She was surprised by the heaviness of the suitcase.",
            "sent2": "The heaviness of the snow caused the roof to collapse.",
            "sent3": "The heaviness of his backpack made him walk like a turtle.",
            "sent4": "The heaviness of the atmosphere indicated a storm was approaching.",
            "sent5": "The heaviness of the fog obscured everything in sight."
        },
        {
            "definition": "The amount of weight or mass of an object.",
            "pos": "noun",
            "sent1": "The heaviness of the fruit basket made her arms ache.",
            "sent2": "He was surprised by the heaviness of the old book.",
            "sent3": "The heaviness of the grocery bags made her regret not taking a cart.",
            "sent4": "The heaviness of the anchor pulled the boat down into the water.",
            "sent5": "The heaviness of the package made it difficult to carry up the stairs."
        },
        {
            "definition": "The quality of being oppressive or burdensome.",
            "pos": "noun",
            "sent1": "The heaviness of the workload stressed him out.",
            "sent2": "The heaviness of the secret she was keeping weighed on her mind.",
            "sent3": "The heaviness of the responsibility made him feel like Atlas.",
            "sent4": "The heaviness of the decision hung over them like a dark cloud.",
            "sent5": "The heaviness of the debt felt like a heavy chain around his neck."
        }
    ]
}