{
    "term": "heavy",
    "meanings": [
        {
            "definition": "Having great weight.",
            "pos": "adjective",
            "sent1": "The rock was heavy and hard to lift.",
            "sent2": "The suitcase was too heavy for me to carry.",
            "sent3": "I tried to lift the heavy rock, but it wouldn't budge!",
            "sent4": "The heavy burden of responsibility weighed on his shoulders.",
            "sent5": "The heavy elephant made the ground shake with each step."
        },
        {
            "definition": "Difficult to lift or move.",
            "pos": "adjective",
            "sent1": "The heavy box was stuck on the top shelf.",
            "sent2": "The piano was too heavy for one person to move.",
            "sent3": "I felt like a superhero trying to lift the heavy box.",
            "sent4": "The heavy weight of the world seemed to rest on her shoulders.",
            "sent5": "The heavy door creaked as I struggled to push it open."
        },
        {
            "definition": "Showing seriousness or importance.",
            "pos": "adjective",
            "sent1": "The teacher's heavy tone indicated the importance of the lesson.",
            "sent2": "The CEO's heavy decision affected the entire company.",
            "sent3": "I couldn't help but laugh at the heavy expression on his face.",
            "sent4": "The heavy responsibility of leadership weighed on her mind.",
            "sent5": "The heavy silence in the room made everyone uneasy."
        },
        {
            "definition": "Full of food or drink.",
            "pos": "adjective",
            "sent1": "After the feast, I felt heavy and full.",
            "sent2": "The heavy meal left me satisfied but sleepy.",
            "sent3": "I regretted eating the heavy meal as I struggled to stay awake.",
            "sent4": "The heavy dinner made me feel like I needed a nap.",
            "sent5": "The heavy buffet offered a variety of delicious dishes."
        },
        {
            "definition": "Dark or intense in color.",
            "pos": "adjective",
            "sent1": "The heavy storm clouds blocked out the sun.",
            "sent2": "The heavy curtains made the room feel cozy and dark.",
            "sent3": "The heavy shade of the paint made the room feel smaller.",
            "sent4": "The heavy shadows cast by the trees created a mysterious atmosphere.",
            "sent5": "The heavy black of the night sky was dotted with stars."
        }
    ]
}