{
    "term": "heavinesses",
    "meanings": [
        {
            "definition": "The state or quality of being heavy.",
            "pos": "noun",
            "sent1": "The heavinesses of the boxes made them hard to lift.",
            "sent2": "She felt the heavinesses of the weights as she worked out.",
            "sent3": "The heavinesses of the suitcases seemed to grow with each step.",
            "sent4": "The heavinesses of the situation weighed down on her like a ton of bricks.",
            "sent5": "The heavinesses of the fog made it impossible to see more than a few feet ahead."
        },
        {
            "definition": "The degree to which something is heavy.",
            "pos": "noun",
            "sent1": "The heavinesses of the rocks varied depending on their size.",
            "sent2": "He measured the heavinesses of the fruits at the market.",
            "sent3": "The heavinesses of the raindrops surprised us with their force.",
            "sent4": "The heavinesses of his words left a lasting impact on the audience.",
            "sent5": "The heavinesses of the silence in the room made everyone uncomfortable."
        },
        {
            "definition": "The oppressive quality of being physically heavy.",
            "pos": "noun",
            "sent1": "The heavinesses of the humid air made it hard to breathe.",
            "sent2": "She could feel the heavinesses of exhaustion weighing her down.",
            "sent3": "The heavinesses of the blanket felt like a warm hug.",
            "sent4": "The heavinesses of the atmosphere in the room made it feel suffocating.",
            "sent5": "The heavinesses of the fabric draped over the furniture added a cozy touch to the room."
        },
        {
            "definition": "The quality of being burdensome or difficult to bear.",
            "pos": "noun",
            "sent1": "The heavinesses of responsibility weighed heavily on his shoulders.",
            "sent2": "She couldn't ignore the heavinesses of the emotional baggage she carried.",
            "sent3": "The heavinesses of the workload seemed never-ending.",
            "sent4": "The heavinesses of the secret she held inside felt like a heavy burden.",
            "sent5": "The heavinesses of the decision lingered in the air, waiting to be made."
        }
    ]
}