{
    "term": "heaving",
    "meanings": [
        {
            "definition": "To lift or haul with great effort",
            "pos": "verb",
            "sent1": "The workers were heaving the heavy boxes onto the truck.",
            "sent2": "She heaved the sack of potatoes onto her shoulder.",
            "sent3": "After heaving the suitcase up the stairs, she realized she forgot her keys.",
            "sent4": "He heaved the boulder aside, revealing a hidden cave entrance.",
            "sent5": "The fishermen were heaving the net out of the water, hoping for a big catch."
        },
        {
            "definition": "To throw or cast forcefully",
            "pos": "verb",
            "sent1": "He heaved the ball across the field to his teammate.",
            "sent2": "The angry child heaved his toy against the wall.",
            "sent3": "She heaved the snowball at her brother, hitting him square in the back.",
            "sent4": "The storm heaved the branches around violently in the wind.",
            "sent5": "The pirate heaved the treasure chest overboard, hoping to lighten the ship."
        },
        {
            "definition": "To rise and fall rhythmically, as the chest during breathing",
            "pos": "verb",
            "sent1": "The baby was heaving peacefully in her sleep.",
            "sent2": "His chest was heaving after running a long distance.",
            "sent3": "The old engine was heaving and sputtering before finally starting.",
            "sent4": "The waves were heaving gently against the shore in the moonlight.",
            "sent5": "She could see his chest heaving with each breath as he slept soundly."
        },
        {
            "definition": "To feel strong emotions, such as nausea or disgust",
            "pos": "verb",
            "sent1": "She was heaving with disgust at the sight of the rotten food.",
            "sent2": "The smell of the garbage had her heaving uncontrollably.",
            "sent3": "He was heaving with nausea after the roller coaster ride.",
            "sent4": "The gruesome scene in the movie had the audience heaving in horror.",
            "sent5": "The foul odor had everyone heaving and covering their noses."
        }
    ]
}