{
    "term": "hebraization",
    "meanings": [
        {
            "definition": "The act of making something Hebrew in character or form.",
            "pos": "noun",
            "sent1": "The hebraization of the menu at the restaurant added traditional Jewish dishes.",
            "sent2": "The hebraization of the music festival brought in Israeli artists and cultural performances.",
            "sent3": "The hebraization of the school play by adding Hebrew songs made the audience smile.",
            "sent4": "Her room underwent a hebraization, transforming into a cozy Jewish-themed space.",
            "sent5": "The hebraization of the garden with Hebrew signs made it feel like a little piece of Israel."
        },
        {
            "definition": "The process of adopting Hebrew language or customs.",
            "pos": "noun",
            "sent1": "Learning Hebrew was a challenging but rewarding hebraization for the students.",
            "sent2": "The family's hebraization included celebrating Jewish holidays and speaking Hebrew at home.",
            "sent3": "His hebraization of wearing a kippah to school sparked curiosity among his classmates.",
            "sent4": "The hebraization of her daily routine with Hebrew prayers brought her a sense of peace.",
            "sent5": "The hebraization of their wedding ceremony with Hebrew blessings made it truly special."
        },
        {
            "definition": "The act of converting a word or name into a Hebrew form.",
            "pos": "noun",
            "sent1": "The hebraization of her name from Sarah to Sarahah was unexpected but meaningful.",
            "sent2": "The hebraization of the term 'thank you' into 'todah' is commonly used in Hebrew.",
            "sent3": "The hebraization of the street signs into Hebrew caused some confusion among tourists.",
            "sent4": "His hebraization of the company name gave it a more international and inclusive appeal.",
            "sent5": "The hebraization of the book title into Hebrew characters added a unique touch to the cover design."
        }
    ]
}