{
    "term": "heel",
    "meanings": [
        {
            "definition": "The back part of the human foot below the ankle.",
            "pos": "noun",
            "sent1": "She felt pain in her heel after walking for a long time.",
            "sent2": "He wore shoes with comfortable heels for the party.",
            "sent3": "The heel of her foot was not happy about the long hike.",
            "sent4": "His determination was the heel that kept him going through tough times.",
            "sent5": "The heel of her foot throbbed with each step she took."
        },
        {
            "definition": "The part of a shoe or boot supporting the heel.",
            "pos": "noun",
            "sent1": "The heel of the shoe provided good support for her foot.",
            "sent2": "The boots had sturdy heels that helped him walk on uneven ground.",
            "sent3": "She accidentally stepped on the heel of her shoe and stumbled.",
            "sent4": "The heel of the boot was like a strong foundation for his steps.",
            "sent5": "The heel of the shoe clicked on the pavement as she walked."
        },
        {
            "definition": "A contemptible person.",
            "pos": "noun",
            "sent1": "He was known as a heel for his dishonest actions.",
            "sent2": "The movie villain was portrayed as a heel who everyone disliked.",
            "sent3": "The heel of the story turned out to be the unexpected hero.",
            "sent4": "She saw him as a heel until she learned about his kind deeds.",
            "sent5": "The heel in the story eventually redeemed himself through selfless acts."
        },
        {
            "definition": "To follow closely or persistently.",
            "pos": "verb",
            "sent1": "The dog would heel whenever his owner called.",
            "sent2": "She asked her friend to heel as they explored the new neighborhood.",
            "sent3": "The detective decided to heel the suspect discreetly.",
            "sent4": "The memories of childhood would always heel her thoughts.",
            "sent5": "The melody of the song would heel in her mind long after it ended."
        }
    ]
}