{
    "term": "heeled",
    "meanings": [
        {
            "definition": "Having a heel or heels.",
            "pos": "adjective",
            "sent1": "The heeled shoes were comfortable to walk in.",
            "sent2": "She wore heeled boots to the party.",
            "sent3": "The heeled sneakers made him look taller than he actually was.",
            "sent4": "Her heeled sandals clicked on the pavement as she walked.",
            "sent5": "The heeled loafers added a touch of elegance to his outfit."
        },
        {
            "definition": "Equipped with a heel or heels.",
            "pos": "adjective",
            "sent1": "The heeled chair had intricate carvings on its legs.",
            "sent2": "The heeled table wobbled on the uneven floor.",
            "sent3": "She tried to balance on the heeled stool but almost fell off.",
            "sent4": "The heeled ladder was not stable enough to climb.",
            "sent5": "The heeled bed frame added a touch of sophistication to the room."
        },
        {
            "definition": "Having a specified kind of heel or number of heels.",
            "pos": "adjective",
            "sent1": "The heeled boots had a chunky heel for extra support.",
            "sent2": "She preferred heeled shoes with a kitten heel.",
            "sent3": "His heeled sandals had a unique design on the heel.",
            "sent4": "The heeled clogs had a wooden heel that clacked on the floor.",
            "sent5": "The heeled pumps had a pointed heel that elongated her legs."
        },
        {
            "definition": "Having a heel of a specified kind or height.",
            "pos": "adjective",
            "sent1": "The heeled boots had a low heel for comfortable walking.",
            "sent2": "She chose heeled sandals with a medium heel for the beach.",
            "sent3": "His heeled shoes had a high heel that made him tower over others.",
            "sent4": "The heeled sneakers had a platform heel for a trendy look.",
            "sent5": "The heeled loafers had a modest heel suitable for everyday wear."
        },
        {
            "definition": "Having a heel of a specified kind or number.",
            "pos": "adjective",
            "sent1": "The heeled shoes had a single heel at the back.",
            "sent2": "She admired the heeled boots with a double heel design.",
            "sent3": "His heeled sandals had a triple heel that was unique.",
            "sent4": "The heeled clogs had a quadruple heel for added stability.",
            "sent5": "The heeled pumps had a row of small heels along the back."
        }
    ]
}