{
    "term": "heelings",
    "meanings": [
        {
            "definition": "The act of turning a ship's stern to the wind in order to change direction.",
            "pos": "noun",
            "sent1": "During the storm, the captain ordered the heelings to navigate safely.",
            "sent2": "The sailors adjusted the heelings to steer the ship towards the harbor.",
            "sent3": "The heelings of the ship seemed to dance as the wind pushed against them.",
            "sent4": "As the heelings shifted, the ship gracefully followed the wind's command.",
            "sent5": "The heelings of the ship creaked as they turned, echoing through the sea.",
            "sent6": "With precision, the sailors managed the heelings to change course smoothly."
        },
        {
            "definition": "The process of repairing or reinforcing the heel of a shoe.",
            "pos": "noun",
            "sent1": "The cobbler specialized in heelings, making shoes sturdy again.",
            "sent2": "She carefully examined the heelings of the shoe before starting the repair.",
            "sent3": "The heelings of the old boots were so worn out, they needed immediate attention.",
            "sent4": "After the heelings were fixed, the shoes felt brand new and comfortable.",
            "sent5": "The heelings of the shoe were now strong and reliable, ready for more walking.",
            "sent6": "He learned how to do heelings to extend the life of his favorite shoes."
        },
        {
            "definition": "The act of leaning to one side, typically while walking or running.",
            "pos": "noun",
            "sent1": "She lost her balance and did heelings to avoid falling on the sidewalk.",
            "sent2": "The child's heelings made it look like they were about to topple over.",
            "sent3": "His heelings were so exaggerated that he almost looked like he was dancing.",
            "sent4": "The heelings of the runner were so pronounced, it seemed like they were gliding.",
            "sent5": "With each step, her heelings added a playful sway to her walk.",
            "sent6": "The heelings of the dog as it ran around the park brought smiles to onlookers."
        }
    ]
}