{
    "term": "heelers",
    "meanings": [
        {
            "definition": "A person who heels or repairs shoes.",
            "pos": "noun",
            "sent1": "The heeler fixed my favorite shoes perfectly.",
            "sent2": "The heeler at the shop is very skilled with shoe repairs.",
            "sent3": "The heeler joked that he could fix shoes in his sleep.",
            "sent4": "She was a heeler, stitching soles back together like a magician.",
            "sent5": "The heeler's craftsmanship made the worn-out shoes look brand new."
        },
        {
            "definition": "A breed of dog known for herding cattle.",
            "pos": "noun",
            "sent1": "The heeler rounded up the cows with ease.",
            "sent2": "Heelers are intelligent dogs that excel at herding livestock.",
            "sent3": "The heeler playfully nipped at the cows' heels during herding.",
            "sent4": "The heeler moved the cattle like a furry conductor directing an orchestra.",
            "sent5": "Watching the heeler work was like witnessing a canine shepherd in action."
        },
        {
            "definition": "A type of shoe with a thick, high heel.",
            "pos": "noun",
            "sent1": "She wore stylish heelers to the party.",
            "sent2": "The fashion store displayed a variety of trendy heelers.",
            "sent3": "The heeler shoes made her feel taller and more confident.",
            "sent4": "The heeler boots clicked loudly on the pavement as she walked.",
            "sent5": "Her favorite pair of heelers added a touch of elegance to her outfit."
        },
        {
            "definition": "A person who supports a political candidate or cause.",
            "pos": "noun",
            "sent1": "She was a dedicated heeler for the mayor's campaign.",
            "sent2": "The heeler attended every rally to show support for the cause.",
            "sent3": "The heeler proudly wore campaign buttons all over her jacket.",
            "sent4": "He was a heeler who passionately advocated for his chosen candidate.",
            "sent5": "The heeler's enthusiasm for the political movement was contagious."
        }
    ]
}