{
    "term": "heels",
    "meanings": [
        {
            "definition": "The back part of the foot below the ankle.",
            "pos": "noun",
            "sent1": "She felt pain in her heels after standing all day.",
            "sent2": "The dancer's heels lifted gracefully as she performed.",
            "sent3": "He tried to scratch his itchy heel discreetly during the meeting.",
            "sent4": "The heels of the loafers were worn down from years of use.",
            "sent5": "The runner's heels hit the pavement rhythmically with each step."
        },
        {
            "definition": "The part of a shoe or boot supporting the heel.",
            "pos": "noun",
            "sent1": "The high heels of her shoes clicked on the marble floor.",
            "sent2": "He checked the quality of the shoe heels before buying them.",
            "sent3": "The kitten playfully attacked the dangling heel of the shoe.",
            "sent4": "The heels of his boots left imprints in the soft mud.",
            "sent5": "She admired the intricate design on the heels of the boots."
        },
        {
            "definition": "To lean back on the heels.",
            "pos": "verb",
            "sent1": "She heels back in her chair while listening intently.",
            "sent2": "Heels against the wall, she balanced on her tiptoes.",
            "sent3": "The cat heels lazily against the warm radiator.",
            "sent4": "He heels back in surprise as the door suddenly slams shut.",
            "sent5": "The tree heels back in the wind, its branches swaying."
        },
        {
            "definition": "To follow closely or persistently.",
            "pos": "verb",
            "sent1": "The detective heels the suspect through the crowded market.",
            "sent2": "The loyal dog heels its owner wherever she goes.",
            "sent3": "The curious child heels the teacher around the classroom.",
            "sent4": "The shadow heels him silently as he walks down the dimly lit street.",
            "sent5": "The memory of her laughter heels him wherever he goes."
        }
    ]
}