{
    "term": "heid",
    "meanings": [
        {
            "definition": "The uppermost part of the body in humans, joined to the trunk by the neck.",
            "pos": "noun",
            "sent1": "She gently touched her heid to feel if she had a fever.",
            "sent2": "The heid holds the eyes, nose, and mouth.",
            "sent3": "The heid nodded in agreement with a smile.",
            "sent4": "His heid was filled with ideas, like a bustling city.",
            "sent5": "The heid can turn from side to side to look around."
        },
        {
            "definition": "A person's head regarded as the location of the mind and thought.",
            "pos": "noun",
            "sent1": "Using her heid, she solved the puzzle quickly.",
            "sent2": "He used his heid to come up with a clever plan.",
            "sent3": "The heid seemed to be full of bright ideas today.",
            "sent4": "Her heid was a library of knowledge waiting to be explored.",
            "sent5": "The heid can imagine wonderful stories and adventures."
        },
        {
            "definition": "The front, top, or upper part of something.",
            "pos": "noun",
            "sent1": "The heid of the mountain was covered in snow.",
            "sent2": "The heid of the tree reached towards the sky.",
            "sent3": "The heid of the cake was decorated with colorful frosting.",
            "sent4": "The heid of the building gleamed in the sunlight.",
            "sent5": "The heid of the bookshelf held her favorite books."
        },
        {
            "definition": "The person in charge of a group or organization.",
            "pos": "noun",
            "sent1": "As the heid of the team, he made important decisions.",
            "sent2": "The heid of the company led with confidence.",
            "sent3": "The heid of the club organized a fun event for everyone.",
            "sent4": "She was the heid of the family, always looking out for others.",
            "sent5": "The heid of the school guided the students towards success."
        },
        {
            "definition": "A rounded mass of foam or froth on a liquid.",
            "pos": "noun",
            "sent1": "The heid of the beer was thick and creamy.",
            "sent2": "She scooped off the heid of the soup before serving.",
            "sent3": "The heid of the hot chocolate was sprinkled with cinnamon.",
            "sent4": "The heid of the latte art was a delicate heart shape.",
            "sent5": "The heid of the cappuccino was like a fluffy cloud on top."
        }
    ]
}