{
    "term": "heiring",
    "meanings": [
        {
            "definition": "The act of inheriting something from a deceased person.",
            "pos": "noun",
            "sent1": "After his grandmother passed away, he received a valuable ring through heiring.",
            "sent2": "The heiring of the family estate brought both joy and responsibility to the siblings.",
            "sent3": "The unexpected heiring of a haunted house made for an interesting family reunion.",
            "sent4": "In the world of antique collectors, heiring a rare piece is like finding hidden treasure.",
            "sent5": "The tradition of heiring family heirlooms ensures that memories are passed down through generations."
        },
        {
            "definition": "A person who inherits something.",
            "pos": "noun",
            "sent1": "As the only child, she became the sole heiring of her parents' wealth.",
            "sent2": "The heiring was overwhelmed with gratitude upon receiving the unexpected inheritance.",
            "sent3": "The young heiring was surprised to find out about the secret fortune left by a distant relative.",
            "sent4": "Being the heiring of a famous artist means carrying on a legacy of creativity and passion.",
            "sent5": "The heiring's responsibility is not just to receive but also to preserve the family's heritage."
        },
        {
            "definition": "To receive something as an inheritance.",
            "pos": "verb",
            "sent1": "She was thrilled to heiring her grandmother's antique jewelry collection.",
            "sent2": "The siblings decided to heiring the family business and continue their parents' legacy.",
            "sent3": "He tried to heiring the old mansion, but the ghosts seemed to have other plans.",
            "sent4": "In the will, she was surprised to heiring a mysterious key with no explanation.",
            "sent5": "The young prince was eager to heiring the throne and lead his kingdom into a new era."
        }
    ]
}