{
    "term": "held",
    "meanings": [
        {
            "definition": "past tense of hold",
            "pos": "verb",
            "sent1": "Yesterday, she held the door open for her friend.",
            "sent2": "He held the trophy tightly in his hands.",
            "sent3": "The squirrel held onto the nut like it was a precious treasure.",
            "sent4": "The memories of that day held her heart in a warm embrace.",
            "sent5": "The old tree held onto its leaves long into winter, refusing to let go."
        },
        {
            "definition": "kept in one's possession",
            "pos": "adjective",
            "sent1": "The toy she held dear was lost in the park.",
            "sent2": "The held book was a cherished gift from her grandmother.",
            "sent3": "The held ticket was the key to an exciting adventure.",
            "sent4": "The held photograph brought back sweet memories of childhood.",
            "sent5": "The held necklace sparkled in the sunlight, a precious keepsake."
        },
        {
            "definition": "supported or carried",
            "pos": "adjective",
            "sent1": "The held umbrella shielded her from the rain.",
            "sent2": "The held bag was heavy with groceries.",
            "sent3": "The held kitten purred contentedly in her arms.",
            "sent4": "The held banner fluttered proudly in the wind.",
            "sent5": "The held lantern illuminated the dark path ahead."
        },
        {
            "definition": "organized or hosted an event",
            "pos": "verb",
            "sent1": "She held a birthday party for her best friend.",
            "sent2": "The school held a fundraiser to support a local charity.",
            "sent3": "The town held a parade to celebrate Independence Day.",
            "sent4": "He held a meeting to discuss the new project.",
            "sent5": "The company held a conference to share innovative ideas."
        }
    ]
}