{
    "term": "heliographs",
    "meanings": [
        {
            "definition": "A signaling device that uses flashes of sunlight to send messages over long distances.",
            "pos": "noun",
            "sent1": "The heliographs gleamed brightly in the sun, sending signals across the valley.",
            "sent2": "The military used heliographs to communicate important information during battles.",
            "sent3": "The mischievous squirrel thought the heliographs were tiny mirrors to play with.",
            "sent4": "Her smile was like a heliograph, bright and clear, signaling her happiness to everyone around.",
            "sent5": "The heliographs danced on the wall, creating a mesmerizing pattern of light and shadow."
        },
        {
            "definition": "The act of sending messages using a heliograph.",
            "pos": "noun",
            "sent1": "Learning to use heliographs requires practice and precision.",
            "sent2": "During emergencies, the heliograph operation must be swift and accurate.",
            "sent3": "The heliograph competition at the fair was intense, with participants racing to send messages.",
            "sent4": "His eyes moved like heliographs, swiftly conveying his thoughts without words.",
            "sent5": "The heliograph technique was passed down through generations, ensuring its preservation."
        },
        {
            "definition": "A message sent using a heliograph.",
            "pos": "noun",
            "sent1": "The heliograph carried news of the victory to the waiting troops.",
            "sent2": "Receiving a heliograph from a loved one brought joy to the soldier's heart.",
            "sent3": "The heliograph message about the picnic location made everyone excited for the weekend.",
            "sent4": "Her laughter rang out like a heliograph, spreading happiness to all who heard.",
            "sent5": "The heliograph note was a beacon of hope in the midst of despair."
        }
    ]
}