{
    "term": "hells",
    "meanings": [
        {
            "definition": "(noun) The place or state of punishment for the wicked after death.",
            "pos": "noun",
            "sent1": "In some stories, the wicked characters end up in hells for their bad deeds.",
            "sent2": "The concept of hells is often found in religious teachings about the afterlife.",
            "sent3": "When the character realized he forgot his homework, he felt like he was in hells.",
            "sent4": "The abandoned amusement park looked like a hells where joy had long been forgotten.",
            "sent5": "The author described the haunted house as a hells filled with lost souls."
        },
        {
            "definition": "(noun) A place or situation of great suffering or turmoil.",
            "pos": "noun",
            "sent1": "The war-torn country was a hells of destruction and despair.",
            "sent2": "She felt like she was in hells when her car broke down in the middle of nowhere.",
            "sent3": "Trying to untangle the Christmas lights felt like entering a hells of knots.",
            "sent4": "The crowded subway during rush hour was a hells of pushing and shoving.",
            "sent5": "The storm turned the peaceful beach into a hells of crashing waves and howling winds."
        },
        {
            "definition": "(verb) To curse or damn someone or something.",
            "pos": "verb",
            "sent1": "He would often hells the malfunctioning computer when it froze.",
            "sent2": "The pirate captain would hells his enemies before engaging in battle.",
            "sent3": "She jokingly threatened to hells the broken toaster if it didn't start working.",
            "sent4": "The witch in the story would hells anyone who dared to enter her forest.",
            "sent5": "The angry customer began to hells at the poor customer service representative."
        },
        {
            "definition": "(adjective) Used for emphasis to express anger or frustration.",
            "pos": "adjective",
            "sent1": "She let out a hells scream when she saw the spider crawling towards her.",
            "sent2": "The hells storm caused a lot of damage to the town.",
            "sent3": "The hells traffic made him late for his important meeting.",
            "sent4": "He received a hells glare from his teacher after forgetting his homework again.",
            "sent5": "The hells noise coming from the construction site was unbearable."
        }
    ]
}