{
    "term": "hellfires",
    "meanings": [
        {
            "definition": "Intense heat and flames associated with hell.",
            "pos": "noun",
            "sent1": "The campfire crackled with hellfires, warming us on the chilly night.",
            "sent2": "The firefighters bravely battled the raging hellfires to save the forest.",
            "sent3": "The chef accidentally set the kitchen ablaze, turning it into a realm of hellfires.",
            "sent4": "The volcano erupted, spewing forth rivers of molten rock like hellfires consuming everything in their path.",
            "sent5": "As the sun set, the sky was painted with hues of red and orange, resembling the colors of hellfires."
        },
        {
            "definition": "A place or state of torment or suffering.",
            "pos": "noun",
            "sent1": "The abandoned asylum was said to be haunted by the echoes of past hellfires.",
            "sent2": "She felt like she was trapped in the midst of hellfires, unable to escape the pain.",
            "sent3": "Trying to untangle the Christmas lights felt like being stuck in a maze of hellfires.",
            "sent4": "The crowded subway during rush hour was a claustrophobic's version of hellfires.",
            "sent5": "The marathon runners pushed through the last mile, their muscles burning like hellfires."
        },
        {
            "definition": "A source of intense anger or punishment.",
            "pos": "noun",
            "sent1": "His boss's scathing words felt like hellfires burning through his confidence.",
            "sent2": "The teacher's glare was enough to make any student feel the heat of hellfires.",
            "sent3": "Forgetting her anniversary was like inviting hellfires of wrath upon himself.",
            "sent4": "The judge's verdict came down like a sentence of hellfires, leaving him devastated.",
            "sent5": "The toddler's tantrum unleashed a storm of hellfires, scorching everything in its path."
        }
    ]
}