{
    "term": "helo",
    "meanings": [
        {
            "definition": "A greeting or salutation",
            "pos": "noun",
            "sent1": "Every morning, the children exchanged cheerful helos at the school gate.",
            "sent2": "The helo from the friendly neighbor always brightened her day.",
            "sent3": "The little puppy's wagging tail was its way of saying helo to everyone it met.",
            "sent4": "The colorful flowers in the garden seemed to wave a silent helo to the passersby.",
            "sent5": "The helo from the old friend brought back fond memories of childhood."
        },
        {
            "definition": "To say hello or greet someone",
            "pos": "verb",
            "sent1": "She would helo her friends with a big smile whenever she saw them.",
            "sent2": "It is polite to helo others when you meet them for the first time.",
            "sent3": "The parrot learned to helo visitors by mimicking the sounds it heard.",
            "sent4": "The gentle breeze seemed to helo the leaves as it passed through the trees.",
            "sent5": "The kind gesture to helo a stranger made their day a little brighter."
        },
        {
            "definition": "A type of military helicopter",
            "pos": "noun",
            "sent1": "The soldiers boarded the helo swiftly for their mission behind enemy lines.",
            "sent2": "The sound of the approaching helo signaled the start of the rescue operation.",
            "sent3": "The helo's powerful blades stirred up dust as it landed in the desert.",
            "sent4": "The helo's arrival brought a sense of relief to the troops waiting below.",
            "sent5": "The pilot skillfully maneuvered the helo through the stormy skies."
        },
        {
            "definition": "A type of small, single-seat helicopter",
            "pos": "noun",
            "sent1": "The adventurous explorer flew the tiny helo over the vast jungle.",
            "sent2": "The compact helo was perfect for navigating tight spaces in the city.",
            "sent3": "The helo's bright red color made it stand out among the other aircraft.",
            "sent4": "The helo pilot performed daring stunts to entertain the crowd below.",
            "sent5": "The miniature helo buzzed like a busy bee as it flew overhead."
        }
    ]
}