{
    "term": "hemagglutinins",
    "meanings": [
        {
            "definition": "Substances that cause red blood cells to agglutinate.",
            "pos": "noun",
            "sent1": "The hemagglutinins in the sample caused the red blood cells to clump together.",
            "sent2": "Scientists are studying the effects of different hemagglutinins on red blood cells.",
            "sent3": "The hemagglutinins decided to have a party and invited all the red blood cells to join in the fun.",
            "sent4": "The hemagglutinins acted like magnets, pulling the red blood cells closer together.",
            "sent5": "The teacher used a colorful model to demonstrate how hemagglutinins make red blood cells stick together."
        },
        {
            "definition": "Proteins found on the surface of influenza viruses that bind to red blood cells.",
            "pos": "noun",
            "sent1": "The hemagglutinins on the virus helped it attach to the red blood cells.",
            "sent2": "Doctors are researching ways to target the hemagglutinins on influenza viruses.",
            "sent3": "The mischievous hemagglutinins played a game of tag with the red blood cells.",
            "sent4": "The hemagglutinins were like keys that fit perfectly into the locks of red blood cells.",
            "sent5": "The hemagglutinins were like tiny hands reaching out to grab the red blood cells."
        },
        {
            "definition": "Agents that cause the clumping together of red blood cells.",
            "pos": "noun",
            "sent1": "The hemagglutinins in the experiment induced the red blood cells to stick together.",
            "sent2": "Researchers are investigating the mechanisms by which hemagglutinins bind red blood cells.",
            "sent3": "The hemagglutinins organized a flash mob with the red blood cells in the laboratory.",
            "sent4": "The hemagglutinins were like glue that held the red blood cells in a tight cluster.",
            "sent5": "The hemagglutinins were like traffic cops directing the red blood cells to merge into a single line."
        }
    ]
}