{
    "term": "hemerocallises",
    "meanings": [
        {
            "definition": "Hemerocallises: plural form of hemerocallis",
            "pos": "noun",
            "sent1": "In her garden, she planted many hemerocallises to add color and beauty.",
            "sent2": "The hemerocallises in the field bloomed brightly under the sun.",
            "sent3": "The hemerocallises seemed to dance in the breeze, showing off their vibrant hues.",
            "sent4": "The garden looked like a painting with the hemerocallises as the stars of the show.",
            "sent5": "Each morning, the hemerocallises greeted her with a new burst of color."
        },
        {
            "definition": "Hemerocallises: belonging to the genus Hemerocallis",
            "pos": "adjective",
            "sent1": "The hemerocallises flowers were a lovely addition to the bouquet.",
            "sent2": "She admired the hemerocallises plants for their resilience in different climates.",
            "sent3": "The hemerocallises leaves rustled in the wind, whispering secrets of the garden.",
            "sent4": "Her smile was as bright as the hemerocallises petals in full bloom.",
            "sent5": "The hemerocallises garden was a peaceful retreat from the bustling city life."
        },
        {
            "definition": "Hemerocallises: a type of flowering plant with showy flowers that typically last for only one day",
            "pos": "noun",
            "sent1": "Every morning, she eagerly awaited the blooming of the hemerocallises in her yard.",
            "sent2": "The hemerocallises added a touch of elegance to the garden despite their short lifespan.",
            "sent3": "The mischievous squirrel enjoyed nibbling on the hemerocallises petals, leaving a trail of destruction.",
            "sent4": "The fleeting beauty of the hemerocallises reminded her to cherish each moment.",
            "sent5": "As the sun set, the hemerocallises closed their petals, ready to bloom again the next day."
        }
    ]
}