{
    "term": "hepatitides",
    "meanings": [
        {
            "definition": "Inflammation of the liver caused by a viral infection or toxic substances.",
            "pos": "noun",
            "sent1": "The hepatitides affected his liver, making him feel very sick.",
            "sent2": "Doctors are studying different treatments for hepatitides to help patients recover faster.",
            "sent3": "The hepatitides in his liver threw a party, but the immune system wasn't invited.",
            "sent4": "The hepatitides spread through his liver like wildfire, causing chaos within.",
            "sent5": "The hepatitides attacking his liver were like tiny warriors on a mission to cause trouble."
        },
        {
            "definition": "A disease characterized by inflammation of the liver.",
            "pos": "noun",
            "sent1": "She was diagnosed with hepatitides after experiencing fatigue and jaundice.",
            "sent2": "Hepatitides can have various causes, including viral infections and alcohol abuse.",
            "sent3": "The hepatitides in her liver decided to throw a party, but it was a real liver-ache.",
            "sent4": "The hepatitides of corruption had infiltrated the liver of the government.",
            "sent5": "The hepatitides of injustice were spreading through society like a poison, affecting everyone."
        },
        {
            "definition": "The plural form of hepatitis.",
            "pos": "noun",
            "sent1": "The doctor explained that hepatitides is the plural of hepatitis, referring to multiple cases.",
            "sent2": "In the medical report, they noted several instances of hepatitides in the community.",
            "sent3": "The hepatitides were having a competition to see who could cause the most trouble in the liver.",
            "sent4": "The hepatitides of rumors were spreading through the town, causing chaos.",
            "sent5": "The hepatitides of change were sweeping through the organization, transforming everything in their path."
        }
    ]
}