{
    "term": "heraldries",
    "meanings": [
        {
            "definition": "The system by which coats of arms and other armorial bearings are devised, described, and regulated.",
            "pos": "noun",
            "sent1": "In medieval times, families used heraldries to show their unique symbols on shields.",
            "sent2": "The museum displayed various heraldries representing different noble families.",
            "sent3": "The knight's heraldries were so intricate that they seemed like secret codes.",
            "sent4": "Heraldries in ancient times were like colorful stories painted on shields.",
            "sent5": "The heraldries of the kingdom were proudly displayed during the royal procession."
        },
        {
            "definition": "The practice of devising, granting, and blazoning armorial bearings.",
            "pos": "noun",
            "sent1": "The heraldries of the knights were carefully designed to represent their bravery.",
            "sent2": "Artists specialized in creating unique heraldries for noble families.",
            "sent3": "The heraldries of the kingdom were so popular that everyone wanted one.",
            "sent4": "The heraldries of old were like beautiful paintings that told stories of valor.",
            "sent5": "The heraldries of the castle were a source of pride for all its inhabitants."
        },
        {
            "definition": "The study of coats of arms and the history of heraldic symbols.",
            "pos": "noun",
            "sent1": "Scholars dedicated their lives to unraveling the mysteries of heraldries.",
            "sent2": "The library contained many books on the subject of heraldries and their meanings.",
            "sent3": "The students found the study of heraldries surprisingly fascinating.",
            "sent4": "Exploring the world of heraldries was like diving into a colorful history book.",
            "sent5": "The professor's knowledge of heraldries was unmatched in the academic world."
        }
    ]
}