{
    "term": "heredes",
    "meanings": [
        {
            "definition": "A person who inherits property or title from a deceased person.",
            "pos": "noun",
            "sent1": "The heredes received the old mansion from their late relative.",
            "sent2": "After the reading of the will, the heredes were informed of their inheritance.",
            "sent3": "The heredes were surprised to find out they inherited a pet parrot that could mimic their late uncle's voice.",
            "sent4": "The heredes were like seeds planted in the soil of their ancestor's estate, growing into the new owners of the land.",
            "sent5": "The heredes were the rightful owners of the ancient family sword, passed down through generations."
        },
        {
            "definition": "The recipient of an inheritance.",
            "pos": "noun",
            "sent1": "As the heredes, they were entrusted with the family's wealth and possessions.",
            "sent2": "The heredes were grateful for the legacy left to them by their grandparents.",
            "sent3": "The heredes joked that their inheritance included a collection of quirky hats from their eccentric aunt.",
            "sent4": "The heredes stood at the threshold of a new chapter in their lives, holding the key to their future.",
            "sent5": "The heredes felt the weight of responsibility as they took on the role of caretakers of the family estate."
        },
        {
            "definition": "A successor or heir.",
            "pos": "noun",
            "sent1": "The heredes were ready to step into the shoes of their forebears and continue the family legacy.",
            "sent2": "In the ancient tradition, the heredes were chosen based on their wisdom and integrity.",
            "sent3": "The heredes found out they were the chosen successors while exploring the hidden attic of the old mansion.",
            "sent4": "The heredes were like puzzle pieces fitting perfectly into the story of their lineage.",
            "sent5": "The heredes were the next chapter in the book of their family history, carrying on the traditions of their ancestors."
        }
    ]
}