{
    "term": "heroisms",
    "meanings": [
        {
            "definition": "Behavior or qualities of a hero.",
            "pos": "noun",
            "sent1": "His heroisms in the face of danger inspired everyone around him.",
            "sent2": "The book celebrated the heroisms of the main character who always stood up for what was right.",
            "sent3": "The heroisms of the little puppy trying to protect its toy from a big dog were both adorable and brave.",
            "sent4": "Her dedication to volunteer work showed heroisms that shone brighter than any medal.",
            "sent5": "The heroisms of the firefighter rushing into the burning building will forever be remembered in our town."
        },
        {
            "definition": "Acts of bravery or courage.",
            "pos": "noun",
            "sent1": "The soldier's heroisms on the battlefield saved many lives.",
            "sent2": "People often overlook the everyday heroisms of teachers who inspire their students.",
            "sent3": "The heroisms of the cat bravely facing off against a much larger dog made everyone laugh.",
            "sent4": "In the face of adversity, her heroisms shone like a beacon of hope.",
            "sent5": "The heroisms of the marathon runner pushing through the pain to reach the finish line were truly inspiring."
        },
        {
            "definition": "The state or condition of being a hero.",
            "pos": "noun",
            "sent1": "The heroisms of Superman are known worldwide.",
            "sent2": "In movies, we often see characters achieving heroisms in the most challenging situations.",
            "sent3": "The heroisms of the little child dressing up as a superhero for Halloween were adorable.",
            "sent4": "Her heroisms in the face of adversity made her a role model for many young girls.",
            "sent5": "The heroisms of the police officer who saved the kitten from the tree warmed everyone's hearts."
        }
    ]
}