{
    "term": "hetaerae",
    "meanings": [
        {
            "definition": "A group of courtesans or high-class prostitutes in ancient Greece.",
            "pos": "noun",
            "sent1": "In ancient Greece, the hetaerae entertained wealthy men with their charm and beauty.",
            "sent2": "The hetaerae were known for their elegance and sophistication in their profession.",
            "sent3": "The hetaerae decided to host a fancy dinner party for all their clients.",
            "sent4": "Her dance was like that of a hetaerae, captivating everyone in the room.",
            "sent5": "The hetaerae's presence at the banquet added an air of luxury and allure."
        },
        {
            "definition": "Women who were educated and skilled in the arts of conversation, music, and dance.",
            "pos": "noun",
            "sent1": "The hetaerae were admired for their intelligence and talents in various arts.",
            "sent2": "She was a true hetaerae, excelling in both music and dance.",
            "sent3": "The hetaerae's witty remarks always kept the conversation lively and engaging.",
            "sent4": "Her voice was as melodious as that of a hetaerae singing in the evening.",
            "sent5": "The hetaerae's graceful movements on the dance floor mesmerized the audience."
        },
        {
            "definition": "A term used to refer to a class of women who were companions to men of high social standing.",
            "pos": "noun",
            "sent1": "The hetaerae accompanied the noblemen to social events and gatherings.",
            "sent2": "She was known as a hetaerae, always by the side of the wealthy gentleman.",
            "sent3": "The hetaerae's presence at the ball made all the other guests envious.",
            "sent4": "Her loyalty to her patron was unwavering, like that of a hetaerae to her benefactor.",
            "sent5": "The hetaerae's poise and elegance complemented the distinguished men they accompanied."
        }
    ]
}