{
    "term": "heteronormative",
    "meanings": [
        {
            "definition": "Of or relating to the belief that heterosexuality is the norm",
            "pos": "adjective",
            "sent1": "The movie portrayed a heteronormative society where only straight relationships were shown.",
            "sent2": "In many cultures, the idea of heteronormative behavior is deeply ingrained.",
            "sent3": "The comedy skit humorously highlighted the absurdity of heteronormative thinking.",
            "sent4": "Her unconventional fashion sense challenged the heteronormative standards of beauty.",
            "sent5": "The children's book aimed to teach young readers about the dangers of heteronormative assumptions."
        },
        {
            "definition": "Conforming to traditional gender roles and expectations",
            "pos": "adjective",
            "sent1": "The advertisement featured a heteronormative family with a stay-at-home mom and a working dad.",
            "sent2": "Some people feel pressured to conform to heteronormative standards of appearance.",
            "sent3": "The sitcom humorously exaggerated the characters' adherence to heteronormative gender roles.",
            "sent4": "Her rebellious style challenged the heteronormative expectations of femininity.",
            "sent5": "The school play aimed to break free from heteronormative portrayals of relationships."
        },
        {
            "definition": "Assuming that everyone is heterosexual and cisgender",
            "pos": "adjective",
            "sent1": "The company's policy was criticized for being heteronormative and excluding LGBTQ+ individuals.",
            "sent2": "Heteronormative language can be exclusionary to those who identify differently.",
            "sent3": "The comedy sketch hilariously mocked the absurdity of heteronormative assumptions.",
            "sent4": "Her inclusive approach challenged the heteronormative views of sexuality and gender.",
            "sent5": "The educational video aimed to raise awareness about the impact of heteronormative attitudes on marginalized groups."
        }
    ]
}