{
    "term": "heterocercal",
    "meanings": [
        {
            "definition": "Having a tail fin with the upper lobe larger than the lower lobe.",
            "pos": "adjective",
            "sent1": "The fish had a heterocercal tail that helped it swim smoothly.",
            "sent2": "The heterocercal tail of the shark allows it to move gracefully through the water.",
            "sent3": "The heterocercal tail of the goldfish made it the envy of the other fish in the tank.",
            "sent4": "Her heterocercal movements on the dance floor were mesmerizing to watch.",
            "sent5": "The heterocercal design of the boat's rudder improved its maneuverability in the rough sea."
        },
        {
            "definition": "Of or relating to a fish with an asymmetrical tail fin.",
            "pos": "adjective",
            "sent1": "The biologist studied the heterocercal structure of the fish's tail.",
            "sent2": "The heterocercal nature of the angelfish's tail distinguishes it from other species.",
            "sent3": "The fish with the heterocercal tail always swam in circles, much to the amusement of onlookers.",
            "sent4": "Her thoughts swam in heterocercal patterns, never following a straight line.",
            "sent5": "The artist captured the beauty of the heterocercal tail in a stunning painting."
        },
        {
            "definition": "Characterized by an unequal tail fin.",
            "pos": "adjective",
            "sent1": "The heterocercal feature of the fish's tail made it unique among its peers.",
            "sent2": "The heterocercal appearance of the guppy's tail caught the eye of the aquarium visitors.",
            "sent3": "The fish with the heterocercal tail always seemed to be swimming against the current.",
            "sent4": "Her heterocercal personality traits made her stand out in a crowd.",
            "sent5": "The heterocercal shape of the kite allowed it to soar high in the sky."
        }
    ]
}