{
    "term": "heterosporous",
    "meanings": [
        {
            "definition": "Producing two kinds of spores, male and female.",
            "pos": "adjective",
            "sent1": "The heterosporous plant had both male and female spores.",
            "sent2": "The scientist studied the heterosporous fern to understand its reproductive process.",
            "sent3": "The garden was surprised to see the heterosporous plant growing different spores.",
            "sent4": "In the world of spores, the heterosporous species stood out with its dual nature.",
            "sent5": "The textbook explained the concept of heterosporous plants with colorful illustrations."
        },
        {
            "definition": "Characterized by the production of two different types of spores.",
            "pos": "adjective",
            "sent1": "The heterosporous moss released both male and female spores into the air.",
            "sent2": "The botanist identified the heterosporous characteristics of the plant through careful observation.",
            "sent3": "The classroom erupted in laughter when the teacher mentioned the heterosporous spores.",
            "sent4": "The forest whispered secrets of the heterosporous plants that thrived within its depths.",
            "sent5": "The children's book described the magical world of heterosporous plants in simple terms."
        },
        {
            "definition": "Having separate male and female spores.",
            "pos": "adjective",
            "sent1": "The heterosporous organism had distinct male and female spores for reproduction.",
            "sent2": "The biologist marveled at the heterosporous nature of the aquatic plant.",
            "sent3": "At the spore party, the heterosporous guests mingled with their own kind.",
            "sent4": "The garden bloomed with the beauty of heterosporous flowers, each with its unique spores.",
            "sent5": "The documentary showcased the incredible diversity of heterosporous species in the wild."
        }
    ]
}