{
    "term": "heulandites",
    "meanings": [
        {
            "definition": "A type of mineral commonly found in volcanic rocks.",
            "pos": "noun",
            "sent1": "The geologist discovered heulandites embedded in the volcanic rock.",
            "sent2": "Miners often come across heulandites while excavating volcanic areas.",
            "sent3": "The heulandites in the volcanic rock seemed to sparkle with hidden secrets.",
            "sent4": "The heulandites were like tiny jewels hidden within the rough volcanic rock.",
            "sent5": "The heulandites, with their unique shapes, stood out among the volcanic minerals."
        },
        {
            "definition": "A group of zeolite minerals characterized by their complex crystal structures.",
            "pos": "noun",
            "sent1": "The collection of heulandites displayed intricate crystal formations.",
            "sent2": "Scientists study the properties of heulandites to understand their crystal structures.",
            "sent3": "The heulandites huddled together, each showing off its own crystal pattern.",
            "sent4": "The heulandites intertwined like a complex puzzle of crystal structures.",
            "sent5": "The heulandites' crystal structures were as complex as a maze, fascinating researchers."
        },
        {
            "definition": "A mineral used in crystal healing for its purported energy cleansing properties.",
            "pos": "noun",
            "sent1": "Crystal healers believe that heulandites can cleanse negative energy.",
            "sent2": "People use heulandites in crystal healing rituals for their energy cleansing effects.",
            "sent3": "The heulandites seemed to radiate a calming energy during the crystal healing session.",
            "sent4": "As the heulandites touched the skin, they seemed to absorb all negative energy.",
            "sent5": "The heulandites' energy cleansing properties were said to bring balance and harmony."
        }
    ]
}