{
    "term": "hexachord",
    "meanings": [
        {
            "definition": "A scale of six notes",
            "pos": "noun",
            "sent1": "In music class, we learned about the hexachord with six different notes.",
            "sent2": "The song was composed using a beautiful hexachord that flowed seamlessly.",
            "sent3": "The hexachord walked into the party fashionably late, but everyone was glad to see it.",
            "sent4": "Her laughter was like a harmonious hexachord, filling the room with joy.",
            "sent5": "The hexachord danced across the musical staff, creating a melodious tune."
        },
        {
            "definition": "A series of six musical tones",
            "pos": "noun",
            "sent1": "The composer arranged the piece using a unique hexachord of tones.",
            "sent2": "The choir harmonized beautifully, each member contributing to the hexachord of tones.",
            "sent3": "The hexachord of tones played hide and seek with the other musical elements.",
            "sent4": "His voice resonated like a powerful hexachord, captivating the audience.",
            "sent5": "The hexachord of tones painted a vivid musical landscape in the listener's mind."
        },
        {
            "definition": "A group of six pitches",
            "pos": "noun",
            "sent1": "The singer's performance showcased a diverse hexachord of pitches.",
            "sent2": "The orchestra tuned their instruments to match the specific hexachord of pitches.",
            "sent3": "The hexachord of pitches threw a surprise party for the other musical elements.",
            "sent4": "The hexachord of pitches soared through the air, carrying emotions with each note.",
            "sent5": "The hexachord of pitches painted a colorful melody in the listener's ears."
        },
        {
            "definition": "A set of six notes in a scale",
            "pos": "noun",
            "sent1": "The pianist's fingers effortlessly played the intricate hexachord of notes.",
            "sent2": "The composer carefully selected the perfect hexachord of notes for the symphony.",
            "sent3": "The hexachord of notes organized a picnic for the other musical elements.",
            "sent4": "Her voice was a soothing hexachord of notes, calming everyone around her.",
            "sent5": "The hexachord of notes painted a vibrant musical picture in the listener's mind."
        }
    ]
}