{
    "term": "highballing",
    "meanings": [
        {
            "definition": "To move or progress rapidly or aggressively.",
            "pos": "verb",
            "sent1": "The cheetah was highballing across the savanna, chasing its prey.",
            "sent2": "The train was highballing down the tracks, reaching top speed in no time.",
            "sent3": "The squirrel was highballing through the trees, trying to gather as many nuts as possible.",
            "sent4": "The athlete was highballing towards the finish line, determined to win the race.",
            "sent5": "The car was highballing through the winding roads, making sharp turns effortlessly."
        },
        {
            "definition": "To estimate or quote a price or value at a high level.",
            "pos": "verb",
            "sent1": "The salesman was highballing the cost of the car, hoping to make a big profit.",
            "sent2": "The contractor was highballing the renovation project, expecting it to be more expensive than usual.",
            "sent3": "The student was highballing the price of the textbook, joking that it must be made of gold.",
            "sent4": "The auctioneer was highballing the value of the painting, trying to attract more bidders.",
            "sent5": "The real estate agent was highballing the house price, aiming to get a high commission."
        },
        {
            "definition": "A type of mixed drink typically made with alcohol and a carbonated beverage.",
            "pos": "noun",
            "sent1": "At the party, they served highballing drinks with a splash of soda and whiskey.",
            "sent2": "The bartender mixed a highballing cocktail with gin and tonic for the customer.",
            "sent3": "The highballing drink was so fizzy that it tickled my nose when I took a sip.",
            "sent4": "The highballing beverage looked like a sparkling gem in the dimly lit bar.",
            "sent5": "The highballing cocktail was the perfect refreshment on a hot summer day."
        }
    ]
}