{
    "term": "hijras",
    "meanings": [
        {
            "definition": "Hijras: a traditional third gender in South Asia, often considered to be neither male nor female",
            "pos": "noun",
            "sent1": "In South Asia, hijras play important roles in ceremonies and celebrations.",
            "sent2": "The hijras in the village are respected for their unique cultural position.",
            "sent3": "The hijras added a touch of tradition to the wedding with their graceful dance.",
            "sent4": "The hijras, like a bridge between genders, bring harmony to the community.",
            "sent5": "The colorful attire of hijras brightened up the festival."
        },
        {
            "definition": "Hijras: individuals who may be born male or intersex, but adopt feminine gender roles and often undergo castration",
            "pos": "noun",
            "sent1": "Some hijras choose to undergo castration as part of their gender identity journey.",
            "sent2": "The hijras in the neighborhood are known for their kindness and support.",
            "sent3": "The hijras' unique perspective on gender challenges societal norms.",
            "sent4": "The hijras' decision to embrace femininity is a bold statement of self-acceptance.",
            "sent5": "The hijras' presence brings diversity and understanding to the community."
        },
        {
            "definition": "Hijras: a community of transgender individuals in South Asia who have a long history of social acceptance and cultural significance",
            "pos": "noun",
            "sent1": "The hijras gather regularly to celebrate their shared experiences and culture.",
            "sent2": "In South Asia, hijras are recognized for their contributions to the arts.",
            "sent3": "The hijras' unity and resilience inspire others in the community.",
            "sent4": "The hijras' stories reflect the rich tapestry of South Asian history.",
            "sent5": "The hijras' presence in the village brings a sense of belonging and pride."
        }
    ]
}