{
    "term": "histoplasmosis",
    "meanings": [
        {
            "definition": "A disease caused by inhaling the spores of a fungus called Histoplasma capsulatum.",
            "pos": "noun",
            "sent1": "Histoplasmosis can make you feel very sick.",
            "sent2": "Doctors diagnosed him with histoplasmosis after he got very ill.",
            "sent3": "Histoplasmosis decided to visit when he least expected it.",
            "sent4": "Histoplasmosis crept into his body like a silent intruder.",
            "sent5": "The word histoplasmosis sounded like a mysterious spell from a storybook."
        },
        {
            "definition": "An infection that primarily affects the lungs but can also spread to other parts of the body.",
            "pos": "noun",
            "sent1": "She had histoplasmosis in her lungs, which made it hard to breathe.",
            "sent2": "Histoplasmosis can be a serious illness if not treated promptly.",
            "sent3": "Histoplasmosis in his body felt like having an unwelcome guest.",
            "sent4": "The spread of histoplasmosis was like a wildfire in his system.",
            "sent5": "The doctor explained histoplasmosis as a sneaky invader attacking from within."
        },
        {
            "definition": "Symptoms may include fever, cough, chest pain, and fatigue.",
            "pos": "noun",
            "sent1": "When histoplasmosis strikes, you might feel very tired.",
            "sent2": "Histoplasmosis can cause a high fever and chest pain.",
            "sent3": "Histoplasmosis played a cruel trick by bringing fever and cough together.",
            "sent4": "The symptoms of histoplasmosis were like unwelcome guests at a party.",
            "sent5": "The experience of histoplasmosis was like a rollercoaster of symptoms."
        },
        {
            "definition": "Common in areas with bird or bat droppings, such as caves or old buildings.",
            "pos": "adjective",
            "sent1": "The old building was a perfect home for histoplasmosis to thrive.",
            "sent2": "Histoplasmosis can be found in caves where bats live.",
            "sent3": "The presence of histoplasmosis in the area was a cause for concern.",
            "sent4": "The old attic was a breeding ground for histoplasmosis.",
            "sent5": "The musty smell in the cave hinted at the lurking histoplasmosis."
        }
    ]
}