{
    "term": "hoactzin",
    "meanings": [
        {
            "definition": "A large crested bird native to Central and South America.",
            "pos": "noun",
            "sent1": "The hoactzin perched on a branch, its colorful feathers shining in the sun.",
            "sent2": "I spotted a hoactzin flying gracefully over the rainforest canopy.",
            "sent3": "Why did the hoactzin refuse to share its tree branch? Because it wanted some alone time.",
            "sent4": "Her singing voice was like a hoactzin's crest, standing out beautifully among the crowd.",
            "sent5": "The hoactzin's call echoed through the jungle, a haunting melody that lingered in the air."
        },
        {
            "definition": "The hoactzin is known for its unique digestive system.",
            "pos": "noun",
            "sent1": "Scientists study the hoactzin's digestive system to understand its special features.",
            "sent2": "The hoactzin's diet consists of leaves and fruits, thanks to its unique digestive system.",
            "sent3": "Why did the hoactzin bring a spoon to dinner? To show off its digestive system!",
            "sent4": "Her ability to forgive was like a hoactzin's digestive system, processing emotions with ease.",
            "sent5": "The hoactzin's digestive system amazed researchers with its efficiency and adaptability."
        },
        {
            "definition": "The hoactzin is also called the stinkbird due to its foul odor.",
            "pos": "noun",
            "sent1": "The stinkbird, or hoactzin, emitted a strong odor to ward off predators.",
            "sent2": "We wrinkled our noses as the hoactzin released its distinctive smell.",
            "sent3": "Why did the hoactzin attend the perfume-making class? To learn how to smell better!",
            "sent4": "The kitchen after the cooking mishap smelled like a hoactzin's nest, pungent and unforgettable.",
            "sent5": "The stinkbird's reputation as the hoactzin was due to its unique and potent scent."
        }
    ]
}