{
    "term": "hocket",
    "meanings": [
        {
            "definition": "A musical technique where a single melody is divided between multiple voices or instruments.",
            "pos": "noun",
            "sent1": "In the song, the hocket created a beautiful harmony with each voice taking turns.",
            "sent2": "The musicians played a lovely piece using hocket, passing the melody seamlessly.",
            "sent3": "The hocket in the music made it sound like a game of musical tag.",
            "sent4": "The hocket technique weaved the melody like a colorful thread through the music.",
            "sent5": "Listeners were enchanted by the intricate hocket, each part adding to the whole."
        },
        {
            "definition": "To perform music using the hocket technique.",
            "pos": "verb",
            "sent1": "She loves to hocket with her friends, each taking a turn to play a part of the melody.",
            "sent2": "The band will hocket during the concert, showcasing their musical coordination.",
            "sent3": "The musicians decided to hocket at the park, surprising passersby with their impromptu performance.",
            "sent4": "His fingers danced on the piano keys, hocketing the melody with precision.",
            "sent5": "The orchestra hockets beautifully, creating a mesmerizing musical tapestry."
        },
        {
            "definition": "A piece of music that utilizes the hocket technique.",
            "pos": "noun",
            "sent1": "The composer's latest work is a stunning hocket, showcasing his mastery of the technique.",
            "sent2": "We listened to a captivating hocket at the concert, each instrument playing a unique part.",
            "sent3": "The hocket played at the event was so catchy, it stayed in everyone's minds for days.",
            "sent4": "The hocket piece was like a musical puzzle, each part fitting perfectly with the others.",
            "sent5": "The audience was spellbound by the intricate layers of the hocket composition."
        }
    ]
}