{
    "term": "hock",
    "meanings": [
        {
            "definition": "To pawn or sell something",
            "pos": "verb",
            "sent1": "I had to hock my old watch to get some quick cash.",
            "sent2": "She decided to hock her guitar to pay for the unexpected bill.",
            "sent3": "Tom had to hock his bike to buy a gift for his mom.",
            "sent4": "In a tough spot, he had to hock his favorite jacket for money.",
            "sent5": "Desperate for money, she had to hock her phone to make ends meet."
        },
        {
            "definition": "The joint in the hind leg of a horse, cow, or other quadruped",
            "pos": "noun",
            "sent1": "The horse's hock was injured during the race.",
            "sent2": "The cow's hock was strong and sturdy as it grazed in the field.",
            "sent3": "The dog playfully nipped at the horse's hock during the game.",
            "sent4": "The cat leaped gracefully over the hock of the sleeping dog.",
            "sent5": "The rabbit's hock twitched as it hopped through the garden."
        },
        {
            "definition": "A type of German white wine",
            "pos": "noun",
            "sent1": "They enjoyed a glass of hock with their dinner.",
            "sent2": "The restaurant offered a variety of hock wines on their menu.",
            "sent3": "She accidentally spilled hock on her new dress at the party.",
            "sent4": "The aroma of the hock filled the room as they uncorked the bottle.",
            "sent5": "The guests toasted with hock to celebrate the special occasion."
        },
        {
            "definition": "To disable or injure (a horse) by cutting the tendons of the hamstrings",
            "pos": "verb",
            "sent1": "The cruel trainer would hock horses to win races unfairly.",
            "sent2": "It is inhumane to hock animals for the sake of competition.",
            "sent3": "The villain in the story would hock horses to eliminate the competition.",
            "sent4": "The evil character's plan was to hock the favorite horse of the hero.",
            "sent5": "The forbidden practice of hocking horses for personal gain was exposed."
        }
    ]
}