{
    "term": "hog",
    "meanings": [
        {
            "definition": "A domesticated pig, especially one weighing over 120 pounds",
            "pos": "noun",
            "sent1": "The hog in the farm is so big that it needs a special pen.",
            "sent2": "The farmer raised a hog that won first prize at the county fair.",
            "sent3": "The hog happily rolled in the mud, enjoying its freedom.",
            "sent4": "The hog of a pig was so massive, it seemed like a giant among its peers.",
            "sent5": "Children visiting the farm were amazed by the enormous hog."
        },
        {
            "definition": "To greedily take more than one's fair share of something",
            "pos": "verb",
            "sent1": "Don't hog all the cookies; leave some for others to enjoy.",
            "sent2": "He tends to hog the spotlight during group presentations.",
            "sent3": "She would hog the swings at the park, not letting anyone else play.",
            "sent4": "The wealthy businessman would hog resources, leaving others with little.",
            "sent5": "During the game, he would hog the ball, not passing it to his teammates."
        },
        {
            "definition": "A motorcycle, especially a large one",
            "pos": "noun",
            "sent1": "He rode his hog through the winding roads of the countryside.",
            "sent2": "The bikers gathered at the bar with their hogs parked outside.",
            "sent3": "The hog roared to life as he revved the engine, ready to hit the road.",
            "sent4": "The shiny chrome on his hog gleamed under the sun.",
            "sent5": "She loved the feeling of freedom riding her hog on the open highway."
        },
        {
            "definition": "To hoard or store something in a greedy or selfish manner",
            "pos": "verb",
            "sent1": "She would hog all the best books in the library, not sharing with others.",
            "sent2": "The squirrel would hog all the nuts, storing them away for winter.",
            "sent3": "He would hog all the blankets on the couch, leaving none for his family.",
            "sent4": "The collector would hog rare stamps, never trading or selling them.",
            "sent5": "The dragon in the story would hog all the treasure, not letting anyone near it."
        }
    ]
}