{
    "term": "hogans",
    "meanings": [
        {
            "definition": "Hogan: a traditional Navajo dwelling made of logs and earth",
            "pos": "noun",
            "sent1": "The family lived in hogans that were built by hand.",
            "sent2": "Visiting a hogan allows you to experience Navajo culture firsthand.",
            "sent3": "The hogan looked cozy with its wooden walls and earthy smell.",
            "sent4": "The hogan stood strong like a fortress against the elements.",
            "sent5": "Children played outside the hogan, their laughter echoing through the valley."
        },
        {
            "definition": "Hogan: a surname of Irish origin",
            "pos": "noun",
            "sent1": "Many people with the surname Hogan have Irish roots.",
            "sent2": "Mr. Hogan is proud of his family name and its heritage.",
            "sent3": "The Hogans gathered for a family reunion to celebrate their Irish background.",
            "sent4": "The Hogan family history is filled with tales of resilience and strength.",
            "sent5": "The Hogans are known for their warm hospitality and welcoming nature."
        },
        {
            "definition": "Hogan: a type of wrestling move",
            "pos": "noun",
            "sent1": "The wrestler executed a perfect hogan to win the match.",
            "sent2": "Fans cheered as the wrestler performed his signature hogan move.",
            "sent3": "The hogan move caught his opponent off guard, leading to a quick victory.",
            "sent4": "His hogan move was so powerful, it left the crowd in awe.",
            "sent5": "The hogan move required strength and agility to execute flawlessly."
        },
        {
            "definition": "Hogan: a slang term for a cigar",
            "pos": "noun",
            "sent1": "After a long day, he enjoyed relaxing with a hogan in hand.",
            "sent2": "The aroma of the hogan filled the room with a rich, smoky scent.",
            "sent3": "He savored the hogan, puffing on it slowly as he watched the sunset.",
            "sent4": "The hogan added a touch of sophistication to his evening routine.",
            "sent5": "The hogan's smooth flavor made it his favorite cigar to unwind with."
        }
    ]
}