{
    "term": "hoised",
    "meanings": [
        {
            "definition": "To raise or lift up",
            "pos": "verb",
            "sent1": "The workers hoised the heavy box onto the shelf.",
            "sent2": "She hoised the flag up the pole during the ceremony.",
            "sent3": "The squirrel hoised the acorn up the tree with great effort.",
            "sent4": "The crane hoised the steel beam effortlessly into place.",
            "sent5": "The students hoised the banner high for everyone to see."
        },
        {
            "definition": "To elevate or hoist up",
            "pos": "verb",
            "sent1": "The pulley system hoised the bucket to the top of the well.",
            "sent2": "He hoised the trophy above his head in triumph.",
            "sent3": "The cat hoised the toy mouse onto the couch for playtime.",
            "sent4": "The hot air balloon hoised the passengers gently into the sky.",
            "sent5": "The crane hoised the piano to the third floor of the building."
        },
        {
            "definition": "To lift or haul up",
            "pos": "verb",
            "sent1": "The fishermen hoised the net full of fish onto the boat.",
            "sent2": "She hoised the backpack onto her shoulders before starting the hike.",
            "sent3": "The ants hoised the food crumb up the wall to their nest.",
            "sent4": "The forklift hoised the pallet of boxes effortlessly.",
            "sent5": "The firefighters hoised the person out of the burning building."
        },
        {
            "definition": "To pull or heave up",
            "pos": "verb",
            "sent1": "They hoised the anchor from the seabed with great effort.",
            "sent2": "The weightlifter hoised the barbell above his head.",
            "sent3": "The dog hoised the ball out of the pool with excitement.",
            "sent4": "The hikers hoised themselves up the steep cliff.",
            "sent5": "The crane hoised the fallen tree off the road quickly."
        }
    ]
}