{
    "term": "holdfast",
    "meanings": [
        {
            "definition": "A device or structure that holds something securely in place.",
            "pos": "noun",
            "sent1": "The holdfast on the wall kept the painting from falling.",
            "sent2": "She tightened the holdfast on the table to keep it stable.",
            "sent3": "The mischievous cat tried to play with the holdfast, thinking it was a toy.",
            "sent4": "His loyalty to his friends was like a strong holdfast in times of trouble.",
            "sent5": "The holdfast of the ship's anchor dug deep into the ocean floor."
        },
        {
            "definition": "A firm grip or grasp.",
            "pos": "noun",
            "sent1": "His holdfast on the rope saved him from falling.",
            "sent2": "The child's holdfast on the toy was strong and determined.",
            "sent3": "She held onto the holdfast tightly, afraid of letting go.",
            "sent4": "The athlete's determination was like a powerful holdfast on the trophy.",
            "sent5": "The holdfast of the monkey on the branch was impressive to watch."
        },
        {
            "definition": "To keep or maintain possession of something.",
            "pos": "verb",
            "sent1": "He wanted to holdfast his favorite toy and not let go.",
            "sent2": "She tried to holdfast the memories of her childhood close to her heart.",
            "sent3": "The squirrel tried to holdfast the nut in its tiny paws.",
            "sent4": "She had to holdfast her position in the game to win.",
            "sent5": "The old man wanted to holdfast his independence for as long as possible."
        },
        {
            "definition": "To remain secure or intact.",
            "pos": "verb",
            "sent1": "The glue must holdfast the pieces together for the project to work.",
            "sent2": "The friendship between them managed to holdfast despite the distance.",
            "sent3": "The superhero's cape had to holdfast during the windy scene.",
            "sent4": "Her resolve to succeed would holdfast through any challenge.",
            "sent5": "The ancient ruins managed to holdfast against the test of time."
        }
    ]
}