{
    "term": "holds",
    "meanings": [
        {
            "definition": "To have or keep in one's grasp.",
            "pos": "verb",
            "sent1": "She holds the flower gently in her hand.",
            "sent2": "He holds the book tightly under his arm.",
            "sent3": "The little girl holds the butterfly carefully to not scare it away.",
            "sent4": "His love for music holds his heart captive.",
            "sent5": "The memory of her smile holds a special place in his mind."
        },
        {
            "definition": "To keep or retain possession of.",
            "pos": "verb",
            "sent1": "The boy holds onto his favorite toy tightly.",
            "sent2": "The museum holds many ancient artifacts for visitors to see.",
            "sent3": "The squirrel holds onto the acorn as if it's a treasure.",
            "sent4": "Her promise to him holds a significant value in their relationship.",
            "sent5": "The old photograph holds precious memories of their childhood."
        },
        {
            "definition": "To contain or be capable of containing.",
            "pos": "verb",
            "sent1": "The jar holds a collection of colorful marbles.",
            "sent2": "The bag holds all the groceries she bought.",
            "sent3": "The cupcake holds a surprise filling inside.",
            "sent4": "The lake holds a reflection of the mountains in its calm waters.",
            "sent5": "The box holds a secret compartment at the bottom."
        },
        {
            "definition": "To maintain or support.",
            "pos": "verb",
            "sent1": "The pillar holds up the roof of the house.",
            "sent2": "The friendship between them holds through thick and thin.",
            "sent3": "The teacher's encouragement holds the student's confidence high.",
            "sent4": "His belief in himself holds him steady during tough times.",
            "sent5": "The bridge holds the weight of passing cars without any trouble."
        },
        {
            "definition": "To keep in a particular state or condition.",
            "pos": "verb",
            "sent1": "The freezer holds the ice cream at the perfect temperature.",
            "sent2": "Her smile holds a sense of warmth and kindness.",
            "sent3": "The song holds a nostalgic feeling that takes you back in time.",
            "sent4": "His determination holds him focused on his goals.",
            "sent5": "The painting holds a sense of mystery in its intricate details."
        }
    ]
}