{
    "term": "hold",
    "meanings": [
        {
            "definition": "Keep or retain possession of.",
            "pos": "verb",
            "sent1": "I will hold onto this toy tightly.",
            "sent2": "Please hold this book for me while I tie my shoe.",
            "sent3": "I can't hold all these balloons at once!",
            "sent4": "Her smile held the promise of a bright future.",
            "sent5": "The memory of her laughter will always hold a special place in my heart."
        },
        {
            "definition": "Grasp or grip.",
            "pos": "noun",
            "sent1": "His hold on the rope was strong.",
            "sent2": "She lost her hold on the slippery handle.",
            "sent3": "The monkey's hold on the branch was impressive.",
            "sent4": "The child's tiny hold on the pencil was endearing.",
            "sent5": "The wrestler's hold on his opponent was unbreakable."
        },
        {
            "definition": "Support or bear the weight of.",
            "pos": "verb",
            "sent1": "The sturdy table can hold many books.",
            "sent2": "The bridge can hold the weight of heavy trucks.",
            "sent3": "I hope this chair can hold me without breaking!",
            "sent4": "Her encouraging words held me up during tough times.",
            "sent5": "The tree branches held the weight of the swinging children."
        },
        {
            "definition": "Remain secure or intact.",
            "pos": "verb",
            "sent1": "The tape must hold the box closed.",
            "sent2": "The lock should hold the door shut.",
            "sent3": "I hope the glue will hold this broken vase together.",
            "sent4": "His promise to always be there for me held true.",
            "sent5": "The friendship between them held strong despite the distance."
        },
        {
            "definition": "Have or occupy a particular position.",
            "pos": "verb",
            "sent1": "She will hold the title of class president.",
            "sent2": "The actor will hold the lead role in the play.",
            "sent3": "I never thought I would hold such an important position.",
            "sent4": "His words held the attention of the entire audience.",
            "sent5": "The painting will hold a prominent place in the gallery."
        }
    ]
}