{
    "term": "holdup",
    "meanings": [
        {
            "definition": "a delay or obstacle",
            "pos": "noun",
            "sent1": "The traffic jam was a real holdup on our way to the park.",
            "sent2": "The construction work caused a holdup in the delivery of the materials.",
            "sent3": "The holdup at the store checkout made everyone impatient.",
            "sent4": "The holdup in the schedule put the entire project behind.",
            "sent5": "The unexpected holdup in the meeting disrupted our plans."
        },
        {
            "definition": "a robbery",
            "pos": "noun",
            "sent1": "The bank teller was terrified during the holdup.",
            "sent2": "The police quickly responded to the reported holdup at the convenience store.",
            "sent3": "The movie depicted a comical holdup scene at the jewelry store.",
            "sent4": "The holdup at the museum was orchestrated with precision.",
            "sent5": "The daring holdup at the train station shocked the passengers."
        },
        {
            "definition": "to delay or hinder",
            "pos": "verb",
            "sent1": "Please don't holdup the process any longer.",
            "sent2": "The bad weather may holdup the flight departure.",
            "sent3": "His tendency to holdup decision-making frustrated his team.",
            "sent4": "The technical issue could holdup the website launch.",
            "sent5": "Don't let fear holdup your progress towards your goals."
        },
        {
            "definition": "to rob by force",
            "pos": "verb",
            "sent1": "The criminals decided to holdup the jewelry store.",
            "sent2": "The masked individuals attempted to holdup the bank.",
            "sent3": "The old western movie featured a classic train holdup scene.",
            "sent4": "The gang planned to holdup the armored truck during its route.",
            "sent5": "The daring thieves managed to holdup the casino without getting caught."
        }
    ]
}