{
    "term": "holmia",
    "meanings": [
        {
            "definition": "A rare metallic element of the lanthanide series, used in nuclear reactors.",
            "pos": "noun",
            "sent1": "Scientists studied the properties of holmia to understand its role in nuclear reactions.",
            "sent2": "The lab technician handled the holmia sample with care due to its radioactive nature.",
            "sent3": "The students joked that the holmia was so rare, it must have come from outer space.",
            "sent4": "In the reactor, the holmia glowed like a tiny star, powering the entire facility.",
            "sent5": "The holmia's shimmer reminded me of a precious gem, despite its scientific importance."
        },
        {
            "definition": "A compound containing holmium.",
            "pos": "noun",
            "sent1": "The chemist mixed the holmia with other elements to create a new compound.",
            "sent2": "The pharmaceutical company developed a medication using holmia as a key ingredient.",
            "sent3": "The chef accidentally added holmia to the recipe, resulting in a strange but tasty dish.",
            "sent4": "The compound's color resembled that of a rainbow, with the holmia adding a unique hue.",
            "sent5": "The holmia-infused compound emitted a faint glow, intriguing the researchers."
        },
        {
            "definition": "The act of holmium being present or used.",
            "pos": "noun",
            "sent1": "The detection of holmia in the sample confirmed the presence of holmium.",
            "sent2": "The team celebrated the successful holmia extraction from the ore.",
            "sent3": "During the experiment, the holmia mysteriously disappeared, causing confusion among the scientists.",
            "sent4": "The holmia's influence in the reaction was akin to a silent but crucial player in a play.",
            "sent5": "The holmia's role in the process was as vital as the conductor in an orchestra."
        }
    ]
}