{
    "term": "holocaust",
    "meanings": [
        {
            "definition": "Destruction or slaughter on a mass scale, especially caused by fire or nuclear war.",
            "pos": "noun",
            "sent1": "The town was left in ruins after the holocaust of the war.",
            "sent2": "The documentary highlighted the horrors of the holocaust during World War II.",
            "sent3": "The chef accidentally caused a holocaust in the kitchen when the oven caught fire.",
            "sent4": "The forest fire was a natural holocaust, wiping out acres of trees in its path.",
            "sent5": "The survivors of the holocaust shared their stories to ensure such devastation never happened again."
        },
        {
            "definition": "A Jewish sacrificial offering that is burned completely on an altar.",
            "pos": "noun",
            "sent1": "The priest performed the holocaust as part of the religious ceremony.",
            "sent2": "In ancient times, people would gather to witness the holocaust on the altar.",
            "sent3": "The rabbi accidentally burned the holocaust offering, causing a commotion in the temple.",
            "sent4": "The aroma of the holocaust filled the air, signaling the completion of the ritual.",
            "sent5": "The holocaust symbolized the community's devotion and faith in their beliefs."
        },
        {
            "definition": "A great or complete devastation or destruction, especially by fire.",
            "pos": "noun",
            "sent1": "The city faced a holocaust after the massive fire engulfed the buildings.",
            "sent2": "The historical site was preserved to remember the holocaust that occurred centuries ago.",
            "sent3": "The children's game of building block towers ended in a playful holocaust of destruction.",
            "sent4": "The artist's painting depicted a world consumed by a fiery holocaust of chaos.",
            "sent5": "The novel described a post-apocalyptic world recovering from a devastating holocaust."
        }
    ]
}