{
    "term": "homebody",
    "meanings": [
        {
            "definition": "a person who enjoys staying at home",
            "pos": "noun",
            "sent1": "My sister is a true homebody, always happiest when she's at home.",
            "sent2": "Being a homebody, John rarely goes out and prefers the coziness of his own space.",
            "sent3": "The homebody in me rejoices at the thought of a quiet night in with a good book.",
            "sent4": "As a homebody, Sarah's house is her sanctuary where she finds peace and joy.",
            "sent5": "The homebody's love for their home is like a warm hug that never lets go."
        },
        {
            "definition": "someone who prefers the comfort of their own home",
            "pos": "noun",
            "sent1": "Even during holidays, the homebody in our group would rather relax at home.",
            "sent2": "As a homebody, Mary finds solace in the familiar surroundings of her house.",
            "sent3": "The homebody's idea of a wild night is staying up late watching movies at home.",
            "sent4": "The homebody's house is their fortress, protecting them from the chaos of the outside world.",
            "sent5": "The homebody's heart is where their home is, always longing for its comforting embrace."
        },
        {
            "definition": "a person who is content with spending time indoors",
            "pos": "noun",
            "sent1": "Being a homebody, Tom finds joy in simple activities like reading indoors.",
            "sent2": "The homebody in our family is always content with a quiet day spent at home.",
            "sent3": "The homebody's idea of adventure is trying a new recipe in the comfort of their kitchen.",
            "sent4": "The homebody's world expands within the walls of their home, where they feel most alive.",
            "sent5": "The homebody's soul finds peace in the familiar corners of their indoor sanctuary."
        }
    ]
}