{
    "term": "homosex",
    "meanings": [
        {
            "definition": "A person who is sexually attracted to people of the same sex.",
            "pos": "noun",
            "sent1": "My friend is a homosex and is happily married to his husband.",
            "sent2": "She realized she was a homosex when she developed feelings for her female coworker.",
            "sent3": "The party was full of homoses, making it a great opportunity for my LGBTQ+ friend to socialize.",
            "sent4": "In a world where homoses were the majority, traditional marriage would be quite different.",
            "sent5": "The movie portrayed the struggles and triumphs of a young homosex coming out to his family."
        },
        {
            "definition": "The state of being sexually attracted to people of the same sex.",
            "pos": "noun",
            "sent1": "Homosex is a natural and beautiful part of human diversity.",
            "sent2": "Acceptance of one's own homosex can lead to a fulfilling life.",
            "sent3": "The comedian joked about the awkwardness of discovering his own homosex during high school.",
            "sent4": "In a world where only homosex existed, love would be simpler but just as profound.",
            "sent5": "The painting captured the essence of pure and unconditional homosex."
        },
        {
            "definition": "The practice of engaging in sexual activity with people of the same sex.",
            "pos": "noun",
            "sent1": "Homosex was decriminalized in many countries over the years.",
            "sent2": "Some cultures have historically embraced homosex as a normal part of life.",
            "sent3": "The sitcom episode humorously portrayed a mix-up at a homosex support group meeting.",
            "sent4": "The novel used a forbidden homosex relationship to explore themes of societal norms.",
            "sent5": "The play depicted the struggles and joys of a secret homosex affair in a conservative society."
        }
    ]
}