{
    "term": "hooded",
    "meanings": [
        {
            "definition": "Having a hood.",
            "pos": "adjective",
            "sent1": "The jacket had a hooded design for rainy days.",
            "sent2": "She wore a hooded sweatshirt to stay warm.",
            "sent3": "The cat looked funny in a tiny hooded cape.",
            "sent4": "The forest was like a hooded figure, mysterious and secretive.",
            "sent5": "The hooded lantern cast a dim light in the room."
        },
        {
            "definition": "Covered with or as if with a hood.",
            "pos": "adjective",
            "sent1": "The car had a hooded roof that protected from the sun.",
            "sent2": "The statue stood tall, its head hooded by a shroud.",
            "sent3": "The flower bed looked like a hooded blanket of colors.",
            "sent4": "The mountain was a hooded giant, its peak hidden in clouds.",
            "sent5": "The streetlight cast a hooded glow on the deserted street."
        },
        {
            "definition": "Wearing a hood.",
            "pos": "adjective",
            "sent1": "The hooded figure moved silently through the night.",
            "sent2": "The mysterious stranger was hooded and cloaked.",
            "sent3": "The hooded hero saved the day with a flick of the cape.",
            "sent4": "The hooded traveler journeyed through the dark forest.",
            "sent5": "The hooded cloak concealed the identity of the thief."
        },
        {
            "definition": "Having a hoodlike part or covering.",
            "pos": "adjective",
            "sent1": "The mushroom had a hooded shape, like a tiny umbrella.",
            "sent2": "The flower's petals formed a hooded canopy over the center.",
            "sent3": "The bird's nest was a cozy hooded shelter for its chicks.",
            "sent4": "The mountain range was a series of hooded peaks in the distance.",
            "sent5": "The lampshade had a hooded design that directed light downwards."
        }
    ]
}