{
    "term": "hooking",
    "meanings": [
        {
            "definition": "To catch or snare with a hook.",
            "pos": "verb",
            "sent1": "I was hooking a fish from the river.",
            "sent2": "She enjoys hooking her keys on the key holder.",
            "sent3": "The clever fox was hooking the attention of the curious crow.",
            "sent4": "His words were hooking my interest like a skilled angler.",
            "sent5": "The idea of hooking a big fish excited him beyond measure."
        },
        {
            "definition": "To connect or attach with a hook.",
            "pos": "verb",
            "sent1": "He was hooking the two pieces of wood together.",
            "sent2": "She was hooking the necklace around her neck.",
            "sent3": "The monkey was hooking the banana with a mischievous grin.",
            "sent4": "Their eyes met, hooking them in an instant bond.",
            "sent5": "The magnet was hooking the metal objects effortlessly."
        },
        {
            "definition": "To engage in prostitution.",
            "pos": "verb",
            "sent1": "She was caught hooking on the street corner.",
            "sent2": "He knew the dangers of hooking for money.",
            "sent3": "The movie portrayed a glamorous life of hooking, far from reality.",
            "sent4": "Her decision to start hooking shocked her family.",
            "sent5": "The risks of hooking were always at the back of her mind."
        },
        {
            "definition": "To curve or bend like a hook.",
            "pos": "verb",
            "sent1": "The road was hooking around the mountain.",
            "sent2": "The tree branches were hooking towards the sky.",
            "sent3": "The river was hooking its way through the valley.",
            "sent4": "His smile was hooking upwards in joy.",
            "sent5": "The artist's brush was hooking graceful lines on the canvas."
        }
    ]
}