{
    "term": "hooped",
    "meanings": [
        {
            "definition": "Having a circular shape or form",
            "pos": "adjective",
            "sent1": "The hula hoop was hooped and colorful.",
            "sent2": "The round table was hooped with intricate designs.",
            "sent3": "The hooped cake looked like a delicious wheel.",
            "sent4": "The hooped rainbow in the sky brought joy to everyone.",
            "sent5": "The hooped bracelet sparkled in the sunlight."
        },
        {
            "definition": "To encircle or surround with a hoop",
            "pos": "verb",
            "sent1": "She hooped the barrel to keep it secure.",
            "sent2": "The children hooped the playground with caution tape.",
            "sent3": "He hooped his sandwich with a toothpick for decoration.",
            "sent4": "The magician hooped the audience with his amazing tricks.",
            "sent5": "The gardener hooped the plants to protect them from the wind."
        },
        {
            "definition": "To jump through hoops or obstacles",
            "pos": "verb",
            "sent1": "The circus performer hooped through the fiery ring.",
            "sent2": "She hooped over the hurdles with grace and skill.",
            "sent3": "The cat hooped over the fence to catch the mouse.",
            "sent4": "He hooped through the challenges to reach his goal.",
            "sent5": "The athlete hooped through the tires in record time."
        },
        {
            "definition": "To be in a state of despair or trouble",
            "pos": "verb",
            "sent1": "She felt hooped when her car broke down in the middle of nowhere.",
            "sent2": "He was hooped when he lost his wallet on the trip.",
            "sent3": "The student hooped when he realized he forgot his homework.",
            "sent4": "The team was hooped after losing the championship game.",
            "sent5": "The family was hooped when their house got flooded."
        }
    ]
}