{
    "term": "hoopskirt",
    "meanings": [
        {
            "definition": "A large, stiff skirt made of hoops or frames worn underneath a dress to give it a full, bell-shaped appearance.",
            "pos": "noun",
            "sent1": "The hoopskirt made her dress look very wide and round.",
            "sent2": "She wore a hoopskirt under her gown to make it look more elegant.",
            "sent3": "The hoopskirt was so big, she accidentally knocked over a chair while turning.",
            "sent4": "Her hoopskirt transformed her into a walking flower, blooming with each step.",
            "sent5": "The hoopskirt rustled softly as she glided across the room, like a floating cloud.",
            "sent6": "With a hoopskirt, her dress had the shape of a giant mushroom cap.",
            "sent7": "The hoopskirt swayed gently as she danced, creating a mesmerizing effect.",
            "sent8": "She felt like a princess in her hoopskirt, ready to attend the royal ball.",
            "sent9": "The hoopskirt added a touch of grandeur to her outfit, making her feel regal.",
            "sent10": "As she twirled, the hoopskirt spun around her like a graceful dancer."
        },
        {
            "definition": "To wear or use a hoopskirt.",
            "pos": "verb",
            "sent1": "She decided to hoopskirt her costume for the historical play.",
            "sent2": "He hoopskirted the outfit to give it a vintage look.",
            "sent3": "They planned to hoopskirt the dress for the themed party.",
            "sent4": "Hoopskirting the gown added a touch of elegance to the ensemble.",
            "sent5": "Hoopskirting the garment transformed its silhouette completely.",
            "sent6": "After hoopskirting the dress, it had a more traditional appearance.",
            "sent7": "Hoopskirting the skirt made it stand out among the other costumes.",
            "sent8": "She enjoyed hoopskirting her outfits for special occasions.",
            "sent9": "Hoopskirting the attire was a fun way to experiment with different styles.",
            "sent10": "He learned how to hoopskirt clothing from his grandmother, who loved vintage fashion."
        }
    ]
}