{
    "term": "hopples",
    "meanings": [
        {
            "definition": "A device consisting of a strap around each of a horse's pasterns, connected by a short chain or leather strap, used to prevent the horse from jumping or galloping.",
            "pos": "noun",
            "sent1": "The hopples kept the horse from running too fast.",
            "sent2": "The trainer attached the hopples to the horse's legs before the race.",
            "sent3": "The mischievous foal tried to chew on the hopples, thinking they were a new toy.",
            "sent4": "The hopples were like handcuffs for the horse, limiting its movements.",
            "sent5": "The shiny hopples clinked softly as the horse trotted around the stable."
        },
        {
            "definition": "To restrain or impede the movement of a horse by using hopples.",
            "pos": "verb",
            "sent1": "The jockey hopples the horse to control its speed during the race.",
            "sent2": "She carefully hopples the spirited stallion to prevent it from bolting.",
            "sent3": "The horse seemed to enjoy the rhythmic sound of the hopples as it trotted.",
            "sent4": "The hopples seemed to dance around the horse's legs, guiding its steps.",
            "sent5": "With a gentle tug, she hopples the horse, signaling it to slow down."
        },
        {
            "definition": "The plural form of the word 'hopple', referring to multiple devices used to restrain a horse's movement.",
            "pos": "noun",
            "sent1": "The stable had a collection of hopples for all the horses.",
            "sent2": "The hopples clinked softly as the horses moved around the pen.",
            "sent3": "The mischievous colt managed to tangle all the hopples together in a playful mess.",
            "sent4": "The hopples lay neatly in a row, ready to be used on the horses.",
            "sent5": "The shiny hopples gleamed in the sunlight, catching the eye of every passerby."
        }
    ]
}