{
    "term": "horahs",
    "meanings": [
        {
            "definition": "A Jewish circle dance typically performed at weddings and other celebrations.",
            "pos": "noun",
            "sent1": "At the wedding, everyone joined in the horahs, moving in a circle together.",
            "sent2": "The horahs at the celebration was filled with joy and music.",
            "sent3": "During the horahs, Sarah accidentally stepped on David's foot, causing a funny moment.",
            "sent4": "The horahs of life keeps us moving in circles, always connected to those around us.",
            "sent5": "The vibrant colors and lively music made the horahs unforgettable."
        },
        {
            "definition": "A traditional Israeli folk dance.",
            "pos": "noun",
            "sent1": "The community gathered to perform the horahs, a dance passed down through generations.",
            "sent2": "In Israel, the horahs is a beloved dance symbolizing unity and tradition.",
            "sent3": "During the horahs, Jacob's hat flew off, creating a comical moment.",
            "sent4": "The horahs weaves a story of culture and history through its graceful movements.",
            "sent5": "The rhythmic beats of the horahs echoed through the village, inviting everyone to dance along."
        },
        {
            "definition": "A lively and energetic dance often performed in a group.",
            "pos": "noun",
            "sent1": "The horahs at the party had everyone clapping and dancing together.",
            "sent2": "Friends gathered in a circle to dance the horahs with smiles on their faces.",
            "sent3": "During the horahs, Emily's shoe flew off, causing laughter among the dancers.",
            "sent4": "The horahs swept through the crowd like a whirlwind of joy and movement.",
            "sent5": "The infectious energy of the horahs filled the room, lifting spirits and bringing people together."
        }
    ]
}