{
    "term": "horde",
    "meanings": [
        {
            "definition": "A large group or crowd, especially one that is disorderly or unruly.",
            "pos": "noun",
            "sent1": "The horde of children ran through the park, laughing and shouting.",
            "sent2": "A horde of fans gathered outside the stadium, hoping to catch a glimpse of their favorite celebrity.",
            "sent3": "The horde of puppies made a mess in the living room, but their wagging tails showed they meant no harm.",
            "sent4": "As the storm approached, a dark horde of clouds gathered ominously in the sky.",
            "sent5": "The horde of shoppers rushed into the store as soon as the doors opened, eager for the Black Friday deals."
        },
        {
            "definition": "A tribe or clan of nomadic people.",
            "pos": "noun",
            "sent1": "The horde traveled across the desert, searching for a new place to set up camp.",
            "sent2": "Legends speak of a fierce horde that roamed the plains, feared by all who crossed their path.",
            "sent3": "The horde of travelers set up their tents under the starry sky, sharing stories around the campfire.",
            "sent4": "In the distance, a horde of riders on horseback could be seen approaching, their banners fluttering in the wind.",
            "sent5": "The ancient horde moved with the changing seasons, following the herds of animals for sustenance."
        },
        {
            "definition": "To gather or move in a large group.",
            "pos": "verb",
            "sent1": "The protesters began to horde together, chanting slogans and holding up signs.",
            "sent2": "People would horde around the street performer, eager to catch a glimpse of his magic tricks.",
            "sent3": "The kids decided to horde all their toys in one corner of the room, creating a colorful pile.",
            "sent4": "As the news of the sale spread, customers started to horde into the store, hoping to snag the best deals.",
            "sent5": "The birds would horde together in the evening, preparing to migrate to warmer lands for the winter."
        }
    ]
}