{
    "term": "hork",
    "meanings": [
        {
            "definition": "To vomit",
            "pos": "verb",
            "sent1": "I felt sick and had to hork in the bathroom.",
            "sent2": "After eating too much, he horked all over the floor.",
            "sent3": "The roller coaster made me want to hork out my lunch.",
            "sent4": "The smell was so awful, it made me want to hork my lunch back up.",
            "sent5": "The sight and smell of the spoiled milk made me hork uncontrollably."
        },
        {
            "definition": "A disgusting or unpleasant person",
            "pos": "noun",
            "sent1": "That bully is a real hork, always picking on others.",
            "sent2": "She's such a hork, never helping anyone in need.",
            "sent3": "The grumpy old man next door is a real hork when it comes to sharing his tools.",
            "sent4": "The hork of a boss never appreciates our hard work.",
            "sent5": "The hork in the movie was the character everyone loved to hate."
        },
        {
            "definition": "To steal or snatch",
            "pos": "verb",
            "sent1": "The thief tried to hork the purse from the lady's hand.",
            "sent2": "He managed to hork a few cookies from the jar without anyone noticing.",
            "sent3": "The sneaky raccoon tried to hork the picnic basket when nobody was looking.",
            "sent4": "The pickpocket skillfully horked the wallet from the distracted tourist.",
            "sent5": "The magician seemed to hork the coin right out of thin air."
        },
        {
            "definition": "A disgusting or unpleasant thing",
            "pos": "noun",
            "sent1": "The garbage can was full of all sorts of horks.",
            "sent2": "The abandoned house was full of creepy horks.",
            "sent3": "The mystery meatloaf looked like a hork on a plate.",
            "sent4": "The swamp was filled with slimy horks lurking beneath the surface.",
            "sent5": "The old fridge emitted a terrible horking smell when opened."
        }
    ]
}