{
    "term": "horsepoxes",
    "meanings": [
        {
            "definition": "A disease affecting horses.",
            "pos": "noun",
            "sent1": "The veterinarian treated the horse for horsepoxes.",
            "sent2": "The stable owner was worried about the spread of horsepoxes among the horses.",
            "sent3": "The horse with horsepoxes tried to convince the other horses it was just a fashionable spotted coat.",
            "sent4": "The horsepoxes in the herd spread like wildfire, affecting every horse in its path.",
            "sent5": "The sight of the sick horsepoxes was a stark reminder of the importance of vaccination."
        },
        {
            "definition": "To infect or afflict with horsepoxes.",
            "pos": "verb",
            "sent1": "The contagious horsepoxes quickly spread to the neighboring stables.",
            "sent2": "The groom accidentally horsepoxes the entire herd by not following proper hygiene.",
            "sent3": "The mischievous horsepoxes seemed to have a knack for targeting the most valuable racehorses.",
            "sent4": "The rumors of horsepoxes being deliberately used to sabotage the competition were finally confirmed.",
            "sent5": "The decision to quarantine the horse that horsepoxes the others was met with mixed reactions from the equestrian community."
        },
        {
            "definition": "The plural form of horsepox.",
            "pos": "noun",
            "sent1": "The researchers were studying the genetic variations among different horsepoxes.",
            "sent2": "The encyclopedia entry listed various types of horsepoxes found in different regions.",
            "sent3": "The auction featured a rare collection of antique horsepoxes from around the world.",
            "sent4": "The museum exhibit showcased the evolution of horsepoxes through the centuries.",
            "sent5": "The children's book explained the importance of protecting horses from horsepoxes."
        }
    ]
}