{
    "term": "hospitalist",
    "meanings": [
        {
            "definition": "A physician who specializes in caring for patients in the hospital.",
            "pos": "noun",
            "sent1": "The hospitalist visited the patient every day to check on their progress.",
            "sent2": "The hospitalist was called in to consult on the complex case.",
            "sent3": "The hospitalist joked that they practically lived in the hospital with how much time they spent there.",
            "sent4": "The hospitalist was like a guardian angel, watching over the patients in their care.",
            "sent5": "The hospitalist's dedication to their patients was truly admirable."
        },
        {
            "definition": "The practice of providing medical care to hospitalized patients.",
            "pos": "noun",
            "sent1": "Hospitalists work closely with other healthcare professionals to ensure patients receive quality care.",
            "sent2": "The hospitalist's main focus is on treating patients within the hospital.",
            "sent3": "The hospitalist's passion for hospital care was evident in their every action.",
            "sent4": "In the world of healthcare, hospitalists are the unsung heroes of the hospital corridors.",
            "sent5": "The hospitalist's expertise in hospital medicine was unmatched."
        },
        {
            "definition": "A healthcare professional who coordinates and manages the treatment of patients in a hospital setting.",
            "pos": "noun",
            "sent1": "The hospitalist collaborated with the nursing staff to create a comprehensive care plan.",
            "sent2": "Hospitalists play a crucial role in ensuring patients receive the best treatment during their hospital stay.",
            "sent3": "The hospitalist's organizational skills were legendary among the hospital staff.",
            "sent4": "The hospitalist was the conductor of the medical orchestra, harmonizing the patient's care.",
            "sent5": "The hospitalist's presence brought a sense of reassurance to the hospital environment."
        }
    ]
}