{
    "term": "hospitable",
    "meanings": [
        {
            "definition": "Receiving or treating guests or strangers warmly and generously.",
            "pos": "adjective",
            "sent1": "The innkeeper was very hospitable, offering us warm blankets and a hearty meal.",
            "sent2": "The hotel staff were always hospitable, greeting every guest with a smile.",
            "sent3": "The hospitable cat welcomed the new kitten with open paws, sharing its toys.",
            "sent4": "The hospitable garden bloomed with colorful flowers, inviting bees and butterflies.",
            "sent5": "The hospitable neighborhood threw a block party, inviting everyone to join in the fun."
        },
        {
            "definition": "Offering a pleasant or welcoming environment.",
            "pos": "adjective",
            "sent1": "The cozy cabin by the lake was truly hospitable, with a crackling fireplace and comfy chairs.",
            "sent2": "The park's hospitable atmosphere made it a favorite spot for picnics and relaxation.",
            "sent3": "The hospitable sun shone brightly, warming the earth and lifting spirits.",
            "sent4": "The hospitable cafe welcomed customers with the aroma of freshly brewed coffee.",
            "sent5": "The hospitable library provided a quiet and inviting space for reading and studying."
        },
        {
            "definition": "Showing kindness and generosity towards others.",
            "pos": "adjective",
            "sent1": "She had a hospitable nature, always ready to help those in need with a smile.",
            "sent2": "The hospitable volunteer spent hours serving food to the homeless with compassion.",
            "sent3": "The hospitable gesture of sharing her umbrella with a stranger touched everyone's heart.",
            "sent4": "His hospitable attitude towards new colleagues made them feel welcomed and valued.",
            "sent5": "The hospitable act of donating blankets to the shelter warmed the hearts of many."
        }
    ]
}