{
    "term": "hot",
    "meanings": [
        {
            "definition": "Having a high degree of heat or a high temperature.",
            "pos": "adjective",
            "sent1": "The soup was too hot to eat quickly.",
            "sent2": "The sun made the sand hot to walk on.",
            "sent3": "The hot tea burned my tongue, making me jump in surprise.",
            "sent4": "The hot metal glowed like a fiery ember in the darkness.",
            "sent5": "The hot stove sizzled and crackled with heat."
        },
        {
            "definition": "Capable of causing a burning sensation.",
            "pos": "adjective",
            "sent1": "The hot chili pepper made my mouth feel like it was on fire.",
            "sent2": "The hot iron left a mark on the fabric.",
            "sent3": "The hot sauce was so spicy, it made everyone's eyes water.",
            "sent4": "Her hot words stung more than any physical blow.",
            "sent5": "The hot sand scorched our feet as we ran across the beach."
        },
        {
            "definition": "Very popular or in demand.",
            "pos": "adjective",
            "sent1": "The new video game was so hot that it sold out within hours.",
            "sent2": "The hot movie star attracted a large crowd of fans.",
            "sent3": "The hot toy of the season was flying off the shelves.",
            "sent4": "The hot new restaurant in town had a line out the door.",
            "sent5": "The hot fashion trend spread like wildfire among teenagers."
        },
        {
            "definition": "Spicy or pungent in flavor.",
            "pos": "adjective",
            "sent1": "The hot salsa made my eyes water.",
            "sent2": "The hot curry had a strong aroma.",
            "sent3": "The hot mustard cleared my sinuses instantly.",
            "sent4": "The hot peppers added a kick to the dish.",
            "sent5": "The hot sauce gave the bland dish a burst of flavor."
        },
        {
            "definition": "Full of intense emotion or excitement.",
            "pos": "adjective",
            "sent1": "The hot anticipation of the concert kept me awake all night.",
            "sent2": "The hot competition made everyone nervous.",
            "sent3": "The hot argument between siblings ended in laughter.",
            "sent4": "The hot passion in their eyes was undeniable.",
            "sent5": "The hot energy of the crowd fueled the performers on stage."
        }
    ]
}