{
    "term": "hotting",
    "meanings": [
        {
            "definition": "To make or become hot.",
            "pos": "verb",
            "sent1": "After playing outside, the sun was hotting my skin.",
            "sent2": "She was hotting the soup on the stove for dinner.",
            "sent3": "The idea of a beach vacation was hotting up their conversation.",
            "sent4": "His anger was hotting like a boiling pot ready to overflow.",
            "sent5": "The fire was hotting the room, making it cozy and warm."
        },
        {
            "definition": "To heat or warm something.",
            "pos": "verb",
            "sent1": "The blanket was hotting her cold feet.",
            "sent2": "He was hotting his hands by the fireplace.",
            "sent3": "The sun was hotting the sand at the beach, making it perfect for a nap.",
            "sent4": "The love in her heart was hotting every corner of his soul.",
            "sent5": "The hot tea was hotting her body, chasing away the chill."
        },
        {
            "definition": "To become excited or passionate.",
            "pos": "verb",
            "sent1": "The kids were hotting about the upcoming trip to the amusement park.",
            "sent2": "She was hotting with enthusiasm about her new project.",
            "sent3": "The crowd was hotting up as the concert started.",
            "sent4": "His words were hotting her heart, igniting a spark of hope.",
            "sent5": "The idea of exploring the unknown was hotting his adventurous spirit."
        },
        {
            "definition": "To engage in illegal activities.",
            "pos": "verb",
            "sent1": "The gang was hotting their next big heist.",
            "sent2": "He was caught hotting stolen goods in the alley.",
            "sent3": "The group was hotting a plan to break into the abandoned building.",
            "sent4": "The criminals were hotting their escape route through the back alleys.",
            "sent5": "The undercover cop was hotting the criminals' every move, ready to make an arrest."
        }
    ]
}