{
    "term": "hough",
    "meanings": [
        {
            "definition": "The joint in the hind leg of a horse, cow, or other quadruped, corresponding to the human knee.",
            "pos": "noun",
            "sent1": "The horse's hough was injured, making it difficult for the animal to walk.",
            "sent2": "The cow's hough was strong and allowed it to move swiftly across the field.",
            "sent3": "The clumsy cow tripped over its own hough, causing a comical scene in the pasture.",
            "sent4": "The hough of the horse was like a sturdy pillar supporting its powerful body.",
            "sent5": "The veterinarian carefully examined the hough of the injured horse, looking for any signs of damage."
        },
        {
            "definition": "To hamstring or disable by cutting the tendons of the hock.",
            "pos": "verb",
            "sent1": "The cruel farmer decided to hough the cow to prevent it from running away.",
            "sent2": "The bandits houghed the horses of their enemies to slow down their pursuit.",
            "sent3": "The mischievous prankster joked that he would hough the town's mayor to keep him from attending meetings.",
            "sent4": "The betrayal felt like a sharp knife houghing his trust and leaving him vulnerable.",
            "sent5": "The evil sorcerer's curse seemed to hough the hero's strength, making each step a struggle."
        },
        {
            "definition": "To cut the tendons of the hock of (a horse, cow, etc.) to disable it.",
            "pos": "verb",
            "sent1": "The rancher had to hough the horse to prevent it from causing harm to itself.",
            "sent2": "The poachers houghed the deer to hinder its ability to escape.",
            "sent3": "The chef joked that he would hough the chicken before cooking it, causing laughter in the kitchen.",
            "sent4": "The betrayal felt like a sharp knife houghing his trust and leaving him vulnerable.",
            "sent5": "The evil sorcerer's curse seemed to hough the hero's strength, making each step a struggle."
        }
    ]
}