{
    "term": "howked",
    "meanings": [
        {
            "definition": "To dig or excavate with a tool",
            "pos": "verb",
            "sent1": "The archaeologist howked the ground to find ancient artifacts.",
            "sent2": "She howked the soil to plant flowers in her garden.",
            "sent3": "The kids howked in the sandbox looking for buried treasure.",
            "sent4": "The workers howked through the rock to build a tunnel.",
            "sent5": "The farmer howked a hole to plant a new tree."
        },
        {
            "definition": "To fish with a hook",
            "pos": "verb",
            "sent1": "Dad howked a big fish from the lake for dinner.",
            "sent2": "They howked for hours but only caught a small trout.",
            "sent3": "The fisherman howked a boot instead of a fish by mistake.",
            "sent4": "She howked the bait into the water and waited patiently.",
            "sent5": "The boy howked a fish so large it almost pulled him into the water."
        },
        {
            "definition": "To steal or rob",
            "pos": "verb",
            "sent1": "The thief howked a valuable painting from the museum.",
            "sent2": "He howked money from the cash register when no one was looking.",
            "sent3": "The raccoon howked snacks from the picnic basket.",
            "sent4": "She howked jewels from the safe with precision.",
            "sent5": "The pirate howked treasures from ships on the high seas."
        },
        {
            "definition": "To search or rummage through something",
            "pos": "verb",
            "sent1": "She howked through her bag to find her keys.",
            "sent2": "The detective howked through the files for evidence.",
            "sent3": "The squirrel howked through the leaves for acorns.",
            "sent4": "He howked through the attic for his old toys.",
            "sent5": "The student howked through the library for a specific book."
        }
    ]
}