{
    "term": "hucks",
    "meanings": [
        {
            "definition": "To throw or fling with great force",
            "pos": "verb",
            "sent1": "He hucks the ball across the field.",
            "sent2": "She hucks the frisbee to her friend at the park.",
            "sent3": "The superhero hucks the villain into the air with a mighty throw.",
            "sent4": "The strong wind hucks the leaves off the trees.",
            "sent5": "The chef hucks the pizza dough high into the air to stretch it out.",
            "sent6": "With a powerful swing, he hucks the hammer over the fence.",
            "sent7": "She hucks the keys to her friend waiting outside.",
            "sent8": "The farmer hucks the hay bales onto the truck with ease.",
            "sent9": "The coach hucks the basketball to the player for a quick pass.",
            "sent10": "The storm hucks debris through the air, causing chaos."
        },
        {
            "definition": "A strong, forceful throw",
            "pos": "noun",
            "sent1": "His hucks always reach the farthest distance.",
            "sent2": "The quarterback's huck landed perfectly in the receiver's hands.",
            "sent3": "The cat's playful huck of the toy surprised everyone.",
            "sent4": "The huck of the javelin soared through the air at the track meet.",
            "sent5": "The child's huck of the ball impressed the coach.",
            "sent6": "The pitcher's huck was so powerful it broke the window.",
            "sent7": "The huck of the rock into the pond created ripples in the water.",
            "sent8": "The huck of the paper airplane glided smoothly through the air.",
            "sent9": "The huck of the watermelon split it open on impact.",
            "sent10": "The huck of the rope over the branch made a perfect swing."
        },
        {
            "definition": "A slang term for a person or thing",
            "pos": "noun",
            "sent1": "Hey, hucks, can you pass me that book?",
            "sent2": "The group of friends affectionately called each other hucks.",
            "sent3": "The little hucks at the park were playing tag.",
            "sent4": "She's the biggest hucks in our class, always making us laugh.",
            "sent5": "The old car was nicknamed 'Old Huck' by the neighborhood kids.",
            "sent6": "The team captain was known as the hucks of the team.",
            "sent7": "The teacher referred to the students as her little hucks.",
            "sent8": "The hucks of the group always had the best stories to tell.",
            "sent9": "The hucks of the family was the family dog, always by their side.",
            "sent10": "The hucks of the office was the coffee machine, always busy brewing."
        }
    ]
}