{
    "term": "huff",
    "meanings": [
        {
            "definition": "A strong breath or puff of air.",
            "pos": "noun",
            "sent1": "The little girl let out a huff as she blew out the candles on her birthday cake.",
            "sent2": "The wind made a huff sound as it blew through the trees.",
            "sent3": "Grandpa let out a huff, trying to blow away the dandelion seeds.",
            "sent4": "The dragon's huff of fire lit up the night sky.",
            "sent5": "With a huff, the balloon slowly deflated."
        },
        {
            "definition": "To express one's anger or annoyance by exhaling loudly.",
            "pos": "verb",
            "sent1": "She would huff loudly whenever her brother teased her.",
            "sent2": "The teacher could hear him huff in frustration during the test.",
            "sent3": "The cat would huff at the dog, showing its displeasure.",
            "sent4": "He would huff like a steam engine when things didn't go his way.",
            "sent5": "The child would huff and puff when asked to clean up his toys."
        },
        {
            "definition": "To inhale a drug or substance through the nose.",
            "pos": "verb",
            "sent1": "The man would huff the scent of the flowers in the garden.",
            "sent2": "She accidentally huffed some pepper while cooking.",
            "sent3": "The dog would huff the smell of treats from the kitchen.",
            "sent4": "He huffed the aroma of fresh bread baking in the oven.",
            "sent5": "The chef would huff the fragrant spices before adding them to the dish."
        },
        {
            "definition": "A fit of anger or annoyance.",
            "pos": "noun",
            "sent1": "After the argument, she stormed off in a huff.",
            "sent2": "He left the room in a huff, slamming the door behind him.",
            "sent3": "The toddler threw a huff when told it was bedtime.",
            "sent4": "In a huff, she crumpled up the paper and threw it in the bin.",
            "sent5": "The player walked off the field in a huff after being benched."
        }
    ]
}