{
    "term": "huffiest",
    "meanings": [
        {
            "definition": "Showing excessive pride or arrogance",
            "pos": "adjective",
            "sent1": "The huffiest peacock strutted around the farm, thinking it was better than all the other birds.",
            "sent2": "She always acted like the huffiest person in the room, never willing to listen to anyone else's ideas.",
            "sent3": "The huffiest cat in the neighborhood refused to play with the other felines, believing itself to be royalty.",
            "sent4": "His huffiest attitude made him blind to the kindness of others, isolating him in his own self-importance.",
            "sent5": "The huffiest rooster in the coop would never share the spotlight with any other bird, crowing loudly to assert dominance."
        },
        {
            "definition": "Full of anger or annoyance",
            "pos": "adjective",
            "sent1": "After losing the game, he stormed off in the huffiest manner, slamming the door behind him.",
            "sent2": "She gave him the huffiest look, clearly indicating her displeasure with his behavior.",
            "sent3": "The huffiest customer in the store demanded to speak to the manager, upset about the service she received.",
            "sent4": "His huffiest outburst startled everyone in the room, causing them to step back in fear.",
            "sent5": "The huffiest dog in the park growled at anyone who came too close, showing its irritation with the crowd."
        },
        {
            "definition": "In a state of being puffed up or swollen",
            "pos": "adjective",
            "sent1": "The huffiest balloon at the party was about to burst from being filled with too much air.",
            "sent2": "The pastry looked huffiest after being left in the oven for too long, expanding beyond its intended size.",
            "sent3": "The huffiest tire on the car needed to be deflated slightly to prevent it from popping on the bumpy road.",
            "sent4": "The huffiest cheeks on the child were a result of blowing up too many balloons at the birthday party.",
            "sent5": "The huffiest pillow in the room was so overfilled that it was uncomfortable to rest your head on."
        }
    ]
}