{
    "term": "huffier",
    "meanings": [
        {
            "definition": "Showing excessive pride or arrogance",
            "pos": "adjective",
            "sent1": "The huffier cat strutted around like it owned the place.",
            "sent2": "She always acted huffier than everyone else in the room.",
            "sent3": "The huffier peacock thought it was the most important bird in the zoo.",
            "sent4": "His huffier attitude made him seem untouchable to others.",
            "sent5": "The huffier king believed no one could challenge his authority."
        },
        {
            "definition": "Full of oneself",
            "pos": "adjective",
            "sent1": "The huffier child refused to share his toys with anyone.",
            "sent2": "She became even huffier after receiving praise for her work.",
            "sent3": "His huffier behavior annoyed his friends during the game.",
            "sent4": "The huffier student thought he knew more than the teacher.",
            "sent5": "The huffier actress demanded special treatment on set."
        },
        {
            "definition": "Expressing annoyance or anger",
            "pos": "adjective",
            "sent1": "Her huffier tone indicated she was not in the mood to talk.",
            "sent2": "He gave a huffier response than expected when asked about his day.",
            "sent3": "The huffier customer complained about the service at the restaurant.",
            "sent4": "The huffier driver honked loudly at the slow-moving car.",
            "sent5": "The huffier cat hissed at the unfamiliar dog in its territory."
        },
        {
            "definition": "To blow or puff out loudly",
            "pos": "verb",
            "sent1": "He huffiered out a cloud of smoke from his pipe.",
            "sent2": "The wind huffiered through the trees on the stormy night.",
            "sent3": "The child huffiered out the candles on the birthday cake.",
            "sent4": "The steam huffiered from the kettle on the stove.",
            "sent5": "She huffiered out a sigh of relief after finishing her exam."
        },
        {
            "definition": "To breathe heavily and noisily",
            "pos": "verb",
            "sent1": "After running, she huffiered as she tried to catch her breath.",
            "sent2": "The exhausted dog huffiered after chasing the ball in the park.",
            "sent3": "He huffiered from climbing the steep hill in the hot sun.",
            "sent4": "The old man huffiered as he struggled to lift the heavy box.",
            "sent5": "The hiker huffiered up the mountain trail, feeling the strain in his legs."
        }
    ]
}