{
    "term": "hui",
    "meanings": [
        {
            "definition": "A Maori gathering or assembly.",
            "pos": "noun",
            "sent1": "The hui brought the community together to discuss important matters.",
            "sent2": "The hui was held in the village hall to plan the upcoming festival.",
            "sent3": "During the hui, everyone shared stories and laughter.",
            "sent4": "The hui was a hive of activity, buzzing with voices and ideas.",
            "sent5": "The hui felt like a warm embrace, welcoming all who attended."
        },
        {
            "definition": "A Chinese secret society or criminal organization.",
            "pos": "noun",
            "sent1": "The hui operated in the shadows, hidden from the authorities.",
            "sent2": "Members of the hui were known for their loyalty and secrecy.",
            "sent3": "The hui's activities were shrouded in mystery, intriguing many.",
            "sent4": "Joining the hui was like entering a world of whispers and codes.",
            "sent5": "The hui's influence spread quietly, like a hidden river beneath the surface."
        },
        {
            "definition": "A type of traditional Chinese musical ensemble.",
            "pos": "noun",
            "sent1": "The hui performed beautiful melodies at the cultural festival.",
            "sent2": "Listening to the hui play was a mesmerizing experience.",
            "sent3": "The hui's music filled the air, enchanting all who heard.",
            "sent4": "The hui's harmonies danced like colorful butterflies in the wind.",
            "sent5": "Attending a hui concert was like stepping into a musical dream."
        },
        {
            "definition": "A group or association.",
            "pos": "noun",
            "sent1": "The hui of artists collaborated on a stunning mural for the city.",
            "sent2": "Being part of the hui meant sharing ideas and supporting each other.",
            "sent3": "The hui of book lovers met every week to discuss their latest reads.",
            "sent4": "Joining the hui of chefs meant learning new recipes and techniques.",
            "sent5": "The hui of volunteers worked tirelessly to help those in need."
        }
    ]
}