{
    "term": "humanitarianism",
    "meanings": [
        {
            "definition": "The belief in the value of human life and the importance of helping others.",
            "pos": "noun",
            "sent1": "Humanitarianism is about caring for people and making sure they are safe.",
            "sent2": "Many organizations work tirelessly to promote humanitarianism and support those in need.",
            "sent3": "When the superhero saved the day, his humanitarianism shone through.",
            "sent4": "Her humanitarianism was a beacon of light in a world filled with darkness.",
            "sent5": "The essence of humanitarianism lies in extending a helping hand to those who need it most."
        },
        {
            "definition": "Actions taken to improve the welfare and well-being of others, especially those in need.",
            "pos": "noun",
            "sent1": "The Red Cross is known for its humanitarianism in times of crisis.",
            "sent2": "Donations to charities are a form of humanitarianism that can make a big difference.",
            "sent3": "The cat showed its humanitarianism by sharing its food with the hungry mouse.",
            "sent4": "Her acts of humanitarianism were like a warm hug to those in despair.",
            "sent5": "In times of adversity, true humanitarianism shines brightest."
        },
        {
            "definition": "The promotion of human welfare and social reform.",
            "pos": "noun",
            "sent1": "Humanitarianism plays a crucial role in advocating for social justice.",
            "sent2": "The government's policies reflect a commitment to humanitarianism and equality.",
            "sent3": "The comedian's jokes about humanitarianism brought laughter and reflection.",
            "sent4": "In the artist's painting, the brushstrokes depicted the essence of humanitarianism.",
            "sent5": "The power of humanitarianism can transform societies and uplift the marginalized."
        }
    ]
}