{
    "term": "humanist",
    "meanings": [
        {
            "definition": "A person who believes in the value and agency of human beings.",
            "pos": "noun",
            "sent1": "The humanist spoke passionately about the importance of kindness and empathy.",
            "sent2": "The school invited a humanist to give a talk on the power of compassion.",
            "sent3": "The humanist joked that the squirrels in the park were more considerate than some people.",
            "sent4": "Her smile was like a beacon of hope, a humanist light in a world of darkness.",
            "sent5": "In the story, the humanist character always stood up for what was right, inspiring others to do the same."
        },
        {
            "definition": "A scholar or student of the humanities.",
            "pos": "noun",
            "sent1": "As a humanist, she studied literature, art, and philosophy with great enthusiasm.",
            "sent2": "The university library was filled with books on various subjects, attracting many humanists.",
            "sent3": "The humanist got lost in the library and jokingly declared it a 'humanities maze.'",
            "sent4": "Her mind was a canvas, each idea a brushstroke of a dedicated humanist.",
            "sent5": "The humanist's passion for the humanities was contagious, inspiring others to delve into the world of knowledge."
        },
        {
            "definition": "An advocate for human welfare and social reform.",
            "pos": "noun",
            "sent1": "The humanist tirelessly worked to improve living conditions for the homeless.",
            "sent2": "In times of crisis, humanists come together to support those in need.",
            "sent3": "The humanist playfully suggested organizing a 'kindness parade' to spread joy in the community.",
            "sent4": "Her actions were a symphony of compassion, each note played by a dedicated humanist.",
            "sent5": "The image of the humanist handing out food to the hungry lingered in the minds of all who witnessed it."
        }
    ]
}