{
    "term": "hummer",
    "meanings": [
        {
            "definition": "A person or thing that hums.",
            "pos": "noun",
            "sent1": "The little boy's toy hummer made a soft buzzing sound.",
            "sent2": "The hummer of the refrigerator filled the kitchen with a gentle noise.",
            "sent3": "The hummer of the bee seemed to serenade the flowers in the garden.",
            "sent4": "Her voice was like a hummer, soothing and constant in the background.",
            "sent5": "The hummer of the computer fan was a comforting lullaby as he worked."
        },
        {
            "definition": "A type of vehicle, typically a large, powerful car.",
            "pos": "noun",
            "sent1": "The shiny red hummer drove past, turning heads on the street.",
            "sent2": "The hummer was so big that it could easily navigate rough terrains.",
            "sent3": "He jokingly called his old car a hummer, even though it was tiny.",
            "sent4": "The hummer glided down the highway like a majestic beast.",
            "sent5": "The hummer's engine roared as it conquered the steep hill."
        },
        {
            "definition": "A type of bird known for its distinctive call.",
            "pos": "noun",
            "sent1": "The colorful hummer fluttered around the garden, its wings a blur.",
            "sent2": "The hummer's chirp echoed through the forest, signaling dawn.",
            "sent3": "The hummer's call was so unique that it could be recognized from afar.",
            "sent4": "She compared his singing voice to a hummer, sweet and melodious.",
            "sent5": "The hummer's song was a symphony of nature, harmonizing with the wind."
        },
        {
            "definition": "A slang term for a sexual act.",
            "pos": "noun",
            "sent1": "The group of friends burst into laughter when someone mentioned a hummer.",
            "sent2": "He blushed when he overheard a conversation about hummers at school.",
            "sent3": "The comedian's joke about hummers had the audience in stitches.",
            "sent4": "She rolled her eyes at the crude reference to hummers in the movie.",
            "sent5": "The awkward silence followed his accidental mention of hummers at the dinner table."
        }
    ]
}