{
    "term": "humoral",
    "meanings": [
        {
            "definition": "Relating to bodily fluids, especially blood.",
            "pos": "adjective",
            "sent1": "The doctor explained that the humoral imbalance in his blood needed to be corrected.",
            "sent2": "The humoral test results showed high levels of glucose in his blood.",
            "sent3": "His humoral blood test results were so extreme that they seemed like a science fiction plot.",
            "sent4": "The humoral flow of blood through his veins was like a river rushing through a canyon.",
            "sent5": "She visualized the humoral nature of blood as a vibrant red river flowing inside her body."
        },
        {
            "definition": "Characterized by or pertaining to the four humors of ancient physiology.",
            "pos": "adjective",
            "sent1": "The play depicted a humoral character who embodied the traits of melancholy.",
            "sent2": "In ancient medicine, the humoral theory classified personalities based on four humors.",
            "sent3": "His humoral personality made him the perfect fit for the role of the jester.",
            "sent4": "The humoral balance of the characters in the story created a harmonious narrative.",
            "sent5": "The humoral essence of the protagonist shone through his actions and words."
        },
        {
            "definition": "Of or relating to the immune system.",
            "pos": "adjective",
            "sent1": "The humoral response of his immune system was swift in fighting off the infection.",
            "sent2": "Vaccines work by triggering a humoral immune response in the body.",
            "sent3": "His humoral immunity was so strong that he rarely fell ill.",
            "sent4": "The humoral defense mechanism of the body acted like an army protecting against invaders.",
            "sent5": "She imagined her humoral shield guarding her against any harmful pathogens."
        }
    ]
}