{
    "term": "hung",
    "meanings": [
        {
            "definition": "past tense of hang",
            "pos": "verb",
            "sent1": "Yesterday, I hung a picture on the wall.",
            "sent2": "She hung the clothes on the line to dry.",
            "sent3": "The monkey hung from the tree branch and waved at us.",
            "sent4": "His decision to quit his job hung over him like a dark cloud.",
            "sent5": "The smell of fresh bread hung in the air, making everyone hungry."
        },
        {
            "definition": "suspended or attached from above",
            "pos": "adjective",
            "sent1": "The chandelier in the ballroom looked very hung.",
            "sent2": "The painting was hung on the gallery wall for everyone to admire.",
            "sent3": "The piñata hung high, tempting the children at the party.",
            "sent4": "The mistletoe hung above the doorway, waiting for a kiss.",
            "sent5": "The decorations hung from the ceiling, creating a festive atmosphere."
        },
        {
            "definition": "to be in a state of being suspended or supported",
            "pos": "verb",
            "sent1": "The swing hung motionless in the breeze.",
            "sent2": "The hammock hung between the two trees, inviting relaxation.",
            "sent3": "The question hung in the air, unanswered and unresolved.",
            "sent4": "The future of the project hung in the balance, uncertain and tense.",
            "sent5": "The painting hung crooked on the wall, needing adjustment."
        },
        {
            "definition": "to have something attached or draped on something else",
            "pos": "verb",
            "sent1": "She hung the curtains in the living room.",
            "sent2": "The necklace hung elegantly around her neck.",
            "sent3": "The cat hung its tail lazily over the edge of the sofa.",
            "sent4": "The vines hung gracefully from the trellis in the garden.",
            "sent5": "The medal hung proudly on his chest, a symbol of his achievement."
        }
    ]
}