{
    "term": "hurriers",
    "meanings": [
        {
            "definition": "A person who hurries or rushes.",
            "pos": "noun",
            "sent1": "The hurriers dashed to catch the bus before it left.",
            "sent2": "The hurriers in the race sprinted towards the finish line.",
            "sent3": "The hurriers at the airport forgot their passports and had to rush back comically.",
            "sent4": "Time was a relentless hurrier, always pushing them to move faster.",
            "sent5": "The hurriers in the emergency room were constantly on the move, attending to patients with urgency."
        },
        {
            "definition": "A device or mechanism used for pulling or dragging heavy loads.",
            "pos": "noun",
            "sent1": "The workers used the hurriers to transport the heavy crates across the warehouse.",
            "sent2": "The old-fashioned hurriers were made of sturdy wood and metal for durability.",
            "sent3": "The hurriers in the factory hummed as they pulled the heavy machinery effortlessly.",
            "sent4": "The hurriers on the construction site were like loyal beasts of burden, aiding in the heavy lifting.",
            "sent5": "The hurriers groaned under the weight of the massive boulders, but they never faltered in their task."
        },
        {
            "definition": "The act of moving quickly or with haste.",
            "pos": "noun",
            "sent1": "The hurriers of the wind rustled the leaves in the trees.",
            "sent2": "The children's laughter filled the playground as they played tag, full of hurriers.",
            "sent3": "The hurriers of the river carried the fallen leaves downstream in a playful dance.",
            "sent4": "The hurriers of time never seemed to slow down, always pushing everyone forward.",
            "sent5": "The hurriers of the storm swept through the town, leaving a trail of destruction in their wake."
        }
    ]
}