{
    "term": "hustling",
    "meanings": [
        {
            "definition": "To move quickly or hurriedly",
            "pos": "verb",
            "sent1": "She was hustling to catch the bus before it left.",
            "sent2": "The squirrel was hustling across the park to find nuts for winter.",
            "sent3": "The little bunny was hustling to beat the tortoise in the race.",
            "sent4": "Time was hustling by like a fast train, leaving memories in its wake.",
            "sent5": "The wind was hustling through the trees, making them sway in a dance."
        },
        {
            "definition": "To engage in energetic activity",
            "pos": "verb",
            "sent1": "The kids were hustling around the playground, full of energy.",
            "sent2": "The ants were hustling to gather food for their colony.",
            "sent3": "The busy bees were hustling to make honey for their hive.",
            "sent4": "The river was hustling over the rocks, bubbling with life.",
            "sent5": "The workers were hustling to finish the project before the deadline."
        },
        {
            "definition": "To obtain by forceful action or persuasion",
            "pos": "verb",
            "sent1": "He was hustling to get the last ticket to the concert.",
            "sent2": "The salesperson was hustling to convince customers to buy the product.",
            "sent3": "The cat was hustling to get the toy mouse from under the couch.",
            "sent4": "The waves were hustling to claim the lost treasure from the shipwreck.",
            "sent5": "The detective was hustling to gather evidence before the suspect escaped."
        },
        {
            "definition": "To work as a prostitute",
            "pos": "verb",
            "sent1": "In the movie, the character was hustling on the streets to survive.",
            "sent2": "The novel depicted a young woman hustling in the city's red-light district.",
            "sent3": "The show portrayed the challenges of hustling in a dangerous profession.",
            "sent4": "The documentary shed light on the reality of hustling in urban areas.",
            "sent5": "The song lyrics told the story of a woman hustling to make ends meet."
        },
        {
            "definition": "A fraud or swindle",
            "pos": "noun",
            "sent1": "The scam artist's hustle was finally exposed by the authorities.",
            "sent2": "The old man fell victim to a clever hustle and lost his savings.",
            "sent3": "The group of friends planned a hustle to prank their teacher on April Fools' Day.",
            "sent4": "The movie plot revolved around a high-stakes hustle in the underground gambling world.",
            "sent5": "The con artist's smooth talk was part of his hustle to deceive unsuspecting victims."
        }
    ]
}