{
    "term": "hustled",
    "meanings": [
        {
            "definition": "To move quickly or hurriedly",
            "pos": "verb",
            "sent1": "She hustled to catch the bus before it left.",
            "sent2": "The squirrel hustled across the park to find nuts.",
            "sent3": "The little rabbit hustled to finish its carrot before the others.",
            "sent4": "Time hustled by like a fast train, leaving memories in its wake.",
            "sent5": "The wind hustled through the trees, carrying whispers of the forest."
        },
        {
            "definition": "To obtain by forceful action or persuasion",
            "pos": "verb",
            "sent1": "He hustled his way into getting the last ticket for the show.",
            "sent2": "The bully hustled the smaller kids out of their lunch money.",
            "sent3": "The clever fox hustled the chickens into giving up their eggs.",
            "sent4": "She hustled the information from the reluctant witness.",
            "sent5": "The determined detective hustled the truth out of the suspect."
        },
        {
            "definition": "To engage in energetic activity or work",
            "pos": "verb",
            "sent1": "The team hustled to finish the project before the deadline.",
            "sent2": "The ants hustled together to build their anthill.",
            "sent3": "The kids hustled to clean up the mess before their parents came home.",
            "sent4": "The bees hustled from flower to flower, collecting nectar.",
            "sent5": "The workers hustled all day to complete the construction on time."
        },
        {
            "definition": "To deceive or swindle someone",
            "pos": "verb",
            "sent1": "The con artist hustled the old man out of his savings.",
            "sent2": "She realized too late that she had been hustled into buying a fake watch.",
            "sent3": "The tricky magician hustled the audience with his disappearing act.",
            "sent4": "The smooth talker hustled his way into getting free drinks all night.",
            "sent5": "The scammer hustled unsuspecting victims with promises of easy money."
        }
    ]
}