{
    "term": "hustles",
    "meanings": [
        {
            "definition": "Moves quickly or busily",
            "pos": "adverb",
            "sent1": "She hustles around the house to finish her chores.",
            "sent2": "The squirrel hustles up the tree to escape the cat.",
            "sent3": "The busy bee hustles from flower to flower collecting nectar.",
            "sent4": "Time hustles by when you're having fun.",
            "sent5": "The wind hustles through the leaves, creating a soothing sound."
        },
        {
            "definition": "Engages in dishonest or illegal activities",
            "pos": "verb",
            "sent1": "He hustles unsuspecting tourists with fake designer goods.",
            "sent2": "The con artist hustles people out of their money with scams.",
            "sent3": "The pickpocket hustles through the crowded market.",
            "sent4": "The fraudster hustles his way into people's trust before deceiving them.",
            "sent5": "The swindler hustles his victims with promises of easy money."
        },
        {
            "definition": "Obtains by force or persuasion",
            "pos": "verb",
            "sent1": "She hustles the last piece of cake before anyone else can take it.",
            "sent2": "The bully hustles lunch money from the smaller kids.",
            "sent3": "The negotiator hustles a better deal for her client.",
            "sent4": "He hustles his way into getting the promotion he wanted.",
            "sent5": "The salesman hustles a reluctant customer into making a purchase."
        },
        {
            "definition": "Energetic activity or effort",
            "pos": "noun",
            "sent1": "His constant hustles at work have earned him a promotion.",
            "sent2": "The team's hustles on the field led them to victory.",
            "sent3": "The child's endless hustles around the playground tire out the parents.",
            "sent4": "The company's marketing hustles have increased their sales significantly.",
            "sent5": "She put all her hustles into organizing the event, and it was a great success."
        }
    ]
}