{
    "term": "hyacinthine",
    "meanings": [
        {
            "definition": "Resembling a hyacinth in color or fragrance.",
            "pos": "adjective",
            "sent1": "The hyacinthine dress she wore matched the flowers in the garden.",
            "sent2": "The room was filled with the sweet, hyacinthine scent of the blooming flowers.",
            "sent3": "The hyacinthine curtains in the living room made the guests feel like they were in a flower garden.",
            "sent4": "Her laughter had a hyacinthine quality that brightened up the entire room.",
            "sent5": "The sunset painted the sky in hyacinthine hues, creating a breathtaking view."
        },
        {
            "definition": "Of a deep purplish-blue color.",
            "pos": "adjective",
            "sent1": "The artist used a hyacinthine shade to paint the beautiful landscape.",
            "sent2": "Her eyes sparkled with a hyacinthine intensity under the moonlight.",
            "sent3": "The hyacinthine sky at dusk looked like a giant canvas painted by nature.",
            "sent4": "The lake reflected the hyacinthine mountains, creating a stunning mirror image.",
            "sent5": "The hyacinthine flowers in the field swayed gently in the breeze, a sea of purple-blue beauty."
        },
        {
            "definition": "Having the characteristics of a hyacinth flower.",
            "pos": "adjective",
            "sent1": "The delicate and hyacinthine petals of the flower captivated everyone's attention.",
            "sent2": "The garden was filled with the vibrant colors of hyacinthine blooms.",
            "sent3": "The chef created a hyacinthine dessert that looked almost too beautiful to eat.",
            "sent4": "Her voice had a hyacinthine quality, soft and soothing like a gentle breeze.",
            "sent5": "The hyacinthine garden was a paradise of fragrant flowers, buzzing bees, and fluttering butterflies."
        }
    ]
}