{
    "term": "hybrid",
    "meanings": [
        {
            "definition": "A thing made by combining two different elements",
            "pos": "noun",
            "sent1": "The new flower in the garden is a hybrid of a rose and a daisy.",
            "sent2": "The scientist created a hybrid plant by mixing two different types of seeds.",
            "sent3": "The hybrid fruit tree grew both apples and oranges, surprising everyone.",
            "sent4": "Her painting was a hybrid of abstract and realistic styles, blending them beautifully.",
            "sent5": "The hybrid car combined the features of both a sedan and a hatchback, making it unique."
        },
        {
            "definition": "An offspring of two plants or animals of different species or varieties",
            "pos": "noun",
            "sent1": "The hybrid puppy had the spots of a Dalmatian and the fur of a Poodle.",
            "sent2": "The farmer bred a hybrid chicken that laid colorful eggs.",
            "sent3": "The hybrid kitten meowed like a cat but purred like a lion, amusing everyone.",
            "sent4": "The hybrid bird sang a melody that was a mix of a canary's and a nightingale's, enchanting all who heard.",
            "sent5": "The hybrid fish swam gracefully, displaying the scales of both a goldfish and a betta."
        },
        {
            "definition": "A car with a gasoline engine and an electric motor",
            "pos": "noun",
            "sent1": "The hybrid vehicle used both gas and electricity to run efficiently.",
            "sent2": "Many people prefer driving a hybrid for its fuel economy and eco-friendliness.",
            "sent3": "The hybrid car hummed quietly on the road, surprising pedestrians with its silent engine.",
            "sent4": "She felt like a hybrid car, balancing work and family life with ease.",
            "sent5": "The hybrid automobile seamlessly switched between gas and electric power, impressing the driver."
        }
    ]
}