{
    "term": "hydro",
    "meanings": [
        {
            "definition": "Hydro: relating to water",
            "pos": "adjective",
            "sent1": "The hydro cycle describes how water moves around the Earth.",
            "sent2": "The hydro dam was built to control the flow of water in the river.",
            "sent3": "After the rain, the streets were like a hydro playground for the kids.",
            "sent4": "Her eyes were as clear as hydro, reflecting the beauty of the ocean.",
            "sent5": "The hydro sound of the waterfall was soothing to the ears."
        },
        {
            "definition": "Hydro: a prefix meaning water",
            "pos": "noun",
            "sent1": "The word 'hydrophobia' contains the prefix hydro, meaning water.",
            "sent2": "In chemistry, 'hydrogen' starts with the prefix hydro.",
            "sent3": "The hydro prefix made the word 'hydrate' sound like a superhero's name.",
            "sent4": "His love for hydrobiology stemmed from understanding the prefix hydro.",
            "sent5": "Learning about the hydro prefix helped her appreciate the importance of water."
        },
        {
            "definition": "Hydro: a hydroelectric power plant",
            "pos": "noun",
            "sent1": "The hydro on the river generated electricity for the whole town.",
            "sent2": "The hydro was a marvel of engineering, harnessing the power of water.",
            "sent3": "The town's economy thrived thanks to the hydro bringing in revenue.",
            "sent4": "The hum of the hydro could be heard from miles away, a symbol of progress.",
            "sent5": "Visiting the hydro was like stepping into a futuristic world powered by nature."
        },
        {
            "definition": "Hydro: a hydrotherapy treatment",
            "pos": "noun",
            "sent1": "The spa offered a relaxing hydro to soothe tired muscles.",
            "sent2": "After the accident, she went for a hydro to help with her recovery.",
            "sent3": "The hydro felt like a warm hug, easing away all worries.",
            "sent4": "His favorite part of the day was the hydro, a moment of pure relaxation.",
            "sent5": "The hydro was like a magic potion, rejuvenating both body and mind."
        },
        {
            "definition": "Hydro: a hydroplane aircraft",
            "pos": "noun",
            "sent1": "The hydro soared through the sky with grace and speed.",
            "sent2": "Piloting a hydro requires skill and precision to navigate the skies.",
            "sent3": "The hydro made air travel feel like a thrilling adventure.",
            "sent4": "Watching the hydro take off was like witnessing a bird in flight.",
            "sent5": "The hydro's design was inspired by the efficiency of water-based transportation."
        }
    ]
}