{
    "term": "hydroceles",
    "meanings": [
        {
            "definition": "A collection of fluid within the scrotum.",
            "pos": "noun",
            "sent1": "The doctor diagnosed him with hydroceles after noticing the fluid buildup in his scrotum.",
            "sent2": "The hydroceles in his scrotum caused discomfort and required medical attention.",
            "sent3": "His friends joked that his scrotum was like a water balloon, teasing him about his hydroceles.",
            "sent4": "The hydroceles in his scrotum felt like carrying a small water pouch around all day.",
            "sent5": "The image of hydroceles in his scrotum stuck in his mind, making him anxious."
        },
        {
            "definition": "Swelling in the scrotum caused by fluid buildup.",
            "pos": "noun",
            "sent1": "The swelling from hydroceles made it difficult for him to walk comfortably.",
            "sent2": "He visited the doctor to address the discomfort caused by the hydroceles in his scrotum.",
            "sent3": "His scrotum looked like a balloon animal due to the hydroceles, amusing his friends.",
            "sent4": "The hydroceles in his scrotum were like a growing bubble, expanding with each passing day.",
            "sent5": "The swelling from hydroceles was so pronounced that it was impossible to ignore."
        },
        {
            "definition": "A condition where fluid accumulates around the testicle.",
            "pos": "noun",
            "sent1": "The discomfort from hydroceles around his testicle made it hard for him to sit for long periods.",
            "sent2": "The doctor explained the implications of the hydroceles around his testicle and recommended treatment.",
            "sent3": "He joked that his testicle felt like a fishbowl due to the hydroceles, lightening the mood.",
            "sent4": "The hydroceles around his testicle were like a protective cushion, albeit an uncomfortable one.",
            "sent5": "The sensation of hydroceles around his testicle was unsettling, like a constant weight dragging him down."
        }
    ]
}