{
    "term": "hydrocele",
    "meanings": [
        {
            "definition": "A collection of fluid within the scrotum.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the man with a hydrocele after examining his swollen scrotum.",
            "sent2": "The hydrocele in his scrotum made it uncomfortable for him to walk.",
            "sent3": "The hydrocele in the scrotum seemed to have a mind of its own, causing trouble for the man.",
            "sent4": "The hydrocele felt like a water balloon inside his scrotum, sloshing around with every step.",
            "sent5": "The hydrocele looked like a small water pouch hanging in the scrotum, visible through his pants."
        },
        {
            "definition": "A swelling in the scrotum caused by fluid buildup.",
            "pos": "noun",
            "sent1": "The hydrocele in his scrotum was causing discomfort and needed medical attention.",
            "sent2": "He felt the hydrocele in his scrotum grow larger as the day went on.",
            "sent3": "The hydrocele in the scrotum made him walk like a penguin, drawing some chuckles.",
            "sent4": "The hydrocele felt like a heavy weight pulling down on his scrotum, affecting his movements.",
            "sent5": "The hydrocele was like a hidden surprise in his scrotum, unexpected and bothersome."
        },
        {
            "definition": "A condition in which fluid accumulates in the sac surrounding a testicle.",
            "pos": "noun",
            "sent1": "The hydrocele around his testicle caused discomfort and required treatment.",
            "sent2": "He felt the hydrocele surrounding his testicle increase in size over time.",
            "sent3": "The hydrocele around his testicle made him walk with a funny waddle, amusing his friends.",
            "sent4": "The hydrocele felt like a protective cushion around his testicle, but it was causing trouble.",
            "sent5": "The hydrocele was like a bubble wrap around his testicle, fragile yet bothersome."
        }
    ]
}