{
    "term": "hyperdrives",
    "meanings": [
        {
            "definition": "A device that allows a spacecraft to travel faster than the speed of light.",
            "pos": "noun",
            "sent1": "The hyperdrives on the spaceship hummed softly as they propelled the craft through space.",
            "sent2": "The crew relied on the hyperdrives to reach distant galaxies in record time.",
            "sent3": "The hyperdrives seemed to have a mind of their own, zipping the ship across the universe.",
            "sent4": "Her ambition was like hyperdrives, propelling her towards her dreams at an incredible speed.",
            "sent5": "The shimmering glow of the hyperdrives illuminated the cockpit, mesmerizing the crew."
        },
        {
            "definition": "To propel a spacecraft faster than the speed of light using a hyperdrive.",
            "pos": "verb",
            "sent1": "The captain hyperdrives the ship through the vast expanse of space effortlessly.",
            "sent2": "They hyperdrives their way through the galaxy, breaking all known speed records.",
            "sent3": "The alien spaceship hyperdrives past Earth, leaving astronomers baffled.",
            "sent4": "His determination hyperdrives him towards success, surpassing all expectations.",
            "sent5": "The hyperdrive technology revolutionized space travel, allowing ships to hyperdrive to distant stars."
        },
        {
            "definition": "The hyperdrive malfunctioned during the space mission.",
            "pos": "noun",
            "sent1": "The unexpected failure of the hyperdrives left the crew stranded in deep space.",
            "sent2": "Repairing the hyperdrive became the top priority to ensure the mission's success.",
            "sent3": "The comical robot blamed the hyperdrive malfunction on space gremlins.",
            "sent4": "The hyperdrive glitch turned the routine mission into a thrilling space adventure.",
            "sent5": "The ominous warning lights signaled trouble in the hyperdrive system, creating tension onboard."
        }
    ]
}