{
    "term": "hyperventilations",
    "meanings": [
        {
            "definition": "Excessive rapid breathing",
            "pos": "noun",
            "sent1": "During panic attacks, hyperventilations can occur, causing dizziness and tingling.",
            "sent2": "The doctor explained that hyperventilations can lead to a drop in carbon dioxide levels in the blood.",
            "sent3": "Sarah's exaggerated hyperventilations during the scary movie made her friends laugh.",
            "sent4": "The sound of hyperventilations filled the room, echoing like a strong wind.",
            "sent5": "The image of the character's hyperventilations in the book stayed with me long after I finished reading."
        },
        {
            "definition": "The act of breathing too quickly and shallowly",
            "pos": "noun",
            "sent1": "After running a marathon, he experienced hyperventilations as his body tried to recover.",
            "sent2": "The lifeguard recognized the signs of hyperventilations in the swimmer struggling to catch their breath.",
            "sent3": "The exaggerated hyperventilations of the cartoon character added a comedic touch to the scene.",
            "sent4": "The room was filled with the sound of rapid hyperventilations, like a chorus of tiny birds.",
            "sent5": "The memory of her first panic attack and the subsequent hyperventilations haunted her dreams."
        },
        {
            "definition": "Breathing too fast and too deeply",
            "pos": "adjective",
            "sent1": "The doctor advised against hyperventilations exercises, as they could lead to lightheadedness.",
            "sent2": "She felt the effects of her hyperventilations breathing pattern during the yoga class.",
            "sent3": "His exaggerated hyperventilations while blowing out the birthday candles made everyone chuckle.",
            "sent4": "The room was filled with the heavy, labored hyperventilations of the exhausted hiker.",
            "sent5": "The image of the dragon's hyperventilations before breathing fire was both terrifying and fascinating."
        }
    ]
}