{
    "term": "hyperpolarize",
    "meanings": [
        {
            "definition": "To make (a cell membrane potential) more negative than resting potential.",
            "pos": "verb",
            "sent1": "During the experiment, the scientist used a special technique to hyperpolarize the cell membrane.",
            "sent2": "The neuron hyperpolarized after receiving inhibitory signals.",
            "sent3": "The cell membrane decided to hyperpolarize itself just to show off.",
            "sent4": "The sudden rainstorm seemed to hyperpolarize the atmosphere, making everything feel more intense.",
            "sent5": "The flashlight's bright beam of light hyperpolarized the dark room, revealing hidden corners.",
            "sent6": "After the storm passed, the sky seemed to hyperpolarize, becoming even darker than before."
        },
        {
            "definition": "To cause (a neuron) to become more negative than its resting potential.",
            "pos": "verb",
            "sent1": "The neurotransmitter released by the neighboring neuron helped hyperpolarize the target neuron.",
            "sent2": "The neuron hyperpolarized in response to the inhibitory signal.",
            "sent3": "The neuron decided to hyperpolarize itself just to be different.",
            "sent4": "The music seemed to hyperpolarize his emotions, making him feel more melancholic.",
            "sent5": "The sudden drop in temperature hyperpolarized his skin, sending shivers down his spine.",
            "sent6": "The unexpected news seemed to hyperpolarize her mood, making her feel more downcast."
        },
        {
            "definition": "To increase the difference in electric charge between the inside and outside of a cell membrane.",
            "pos": "verb",
            "sent1": "The ion channels opened to allow ions to flow, helping to hyperpolarize the cell membrane.",
            "sent2": "The cell membrane hyperpolarized due to the sudden influx of potassium ions.",
            "sent3": "The cell membrane decided to hyperpolarize itself just for fun.",
            "sent4": "The argument seemed to hyperpolarize the room, creating tension between the people present.",
            "sent5": "The colorful lights hyperpolarized the party atmosphere, making it more vibrant and lively.",
            "sent6": "The unexpected guest seemed to hyperpolarize the family dynamics, causing a stir among the members."
        }
    ]
}