{
    "term": "hyperpolarizations",
    "meanings": [
        {
            "definition": "The act of making a cell more negative than its resting membrane potential.",
            "pos": "noun",
            "sent1": "During hyperpolarizations, the cell becomes even more negative inside.",
            "sent2": "Scientists study hyperpolarizations to understand how cells change their charge.",
            "sent3": "The hyperpolarizations in the cell were so extreme, even the protons were surprised!",
            "sent4": "Her laughter caused a wave of hyperpolarizations in the room, making everyone feel lighter.",
            "sent5": "The hyperpolarizations were like a deep sigh for the cell, releasing all tension."
        },
        {
            "definition": "The process of increasing the difference in charge between the inside and outside of a cell.",
            "pos": "noun",
            "sent1": "The hyperpolarizations in the cell were necessary for proper functioning.",
            "sent2": "Cells rely on hyperpolarizations to maintain their electrical balance.",
            "sent3": "The hyperpolarizations seemed to dance around the cell, playing with the charges.",
            "sent4": "His words caused a sudden hyperpolarizations of emotions in her heart.",
            "sent5": "The hyperpolarizations were like a tug-of-war between the inside and outside of the cell."
        },
        {
            "definition": "A state in which the membrane potential is more negative than the resting potential.",
            "pos": "noun",
            "sent1": "The hyperpolarizations indicated a shift towards a more negative state in the cell.",
            "sent2": "The membrane entered hyperpolarizations after the stimulus was removed.",
            "sent3": "The hyperpolarizations made the cell feel like it was in a cozy, negative blanket.",
            "sent4": "In the silence, the hyperpolarizations of the cell were the only sound heard.",
            "sent5": "The hyperpolarizations painted the cell in shades of blue, signaling a calm state."
        }
    ]
}