{
    "term": "hyperparasitic",
    "meanings": [
        {
            "definition": "Of or relating to a parasite that itself has parasites.",
            "pos": "adjective",
            "sent1": "The hyperparasitic wasp lays its eggs inside another parasite.",
            "sent2": "The hyperparasitic fungus thrives by feeding on a parasite that infects plants.",
            "sent3": "The hyperparasitic relationship between the two insects was like a never-ending chain of freeloaders.",
            "sent4": "The concept of a hyperparasitic organism is like a parasite living inside another parasite, a true inception of parasitism.",
            "sent5": "The hyperparasitic behavior of the tiny mite was both fascinating and disturbing to the researchers."
        },
        {
            "definition": "Characterized by being a parasite on another parasite.",
            "pos": "adjective",
            "sent1": "The hyperparasitic wasp targets parasites that have already infested other organisms.",
            "sent2": "The hyperparasitic relationship between the two organisms was complex and intriguing.",
            "sent3": "The hyperparasitic behavior of the beetle seemed like a parasitic inception within another parasitic host.",
            "sent4": "The idea of a hyperparasitic creature preying on another parasite is both fascinating and eerie.",
            "sent5": "The hyperparasitic nature of the organism was like a parasite feeding on another parasite, a double layer of parasitism."
        },
        {
            "definition": "Acting as a parasite on another parasite.",
            "pos": "adjective",
            "sent1": "The hyperparasitic fungus grows on a parasite that infects bees.",
            "sent2": "The hyperparasitic relationship between the two organisms was a unique form of parasitism.",
            "sent3": "The hyperparasitic behavior of the tiny insect was like a parasite within a parasite, a parasitic inception.",
            "sent4": "The hyperparasitic organism was like a parasite feeding on another parasite, a parasitic loop.",
            "sent5": "The hyperparasitic nature of the organism was both fascinating and concerning to the scientists."
        }
    ]
}