{
    "term": "hyperkineses",
    "meanings": [
        {
            "definition": "Excessive movement or activity",
            "pos": "noun",
            "sent1": "The child's hyperkineses made it hard for him to sit still in class.",
            "sent2": "The playground was filled with the hyperkineses of children running and playing.",
            "sent3": "During the game of tag, his hyperkineses made him the fastest runner in the group.",
            "sent4": "Her hyperkineses on the dance floor were like a whirlwind of energy.",
            "sent5": "The hyperkineses of the squirrel as it darted from tree to tree was a sight to behold."
        },
        {
            "definition": "A condition characterized by excessive muscular activity",
            "pos": "noun",
            "sent1": "The doctor diagnosed him with hyperkineses after observing his constant muscle movements.",
            "sent2": "In hyperkineses, the muscles are in a state of constant motion.",
            "sent3": "His hyperkineses during the race made it seem like his muscles had a mind of their own.",
            "sent4": "The hyperkineses of the athlete's muscles were like a well-oiled machine in action.",
            "sent5": "The hyperkineses of the dancer's muscles brought life to the performance."
        },
        {
            "definition": "Abnormal increase in muscle function",
            "pos": "noun",
            "sent1": "The patient's hyperkineses were causing his muscles to twitch involuntarily.",
            "sent2": "Hyperkineses can lead to a rapid and uncontrolled increase in muscle function.",
            "sent3": "His hyperkineses during the workout made it seem like his muscles had a mind of their own.",
            "sent4": "The hyperkineses of the bodybuilder's muscles were like a symphony of strength.",
            "sent5": "The hyperkineses of the cheetah's muscles allowed it to sprint with incredible speed."
        }
    ]
}