{
    "term": "hypersensitivity",
    "meanings": [
        {
            "definition": "Excessive sensitivity to stimuli",
            "pos": "noun",
            "sent1": "Her hypersensitivity to loud noises made it challenging for her to attend concerts.",
            "sent2": "His hypersensitivity to light meant he always wore sunglasses outdoors.",
            "sent3": "The cat's hypersensitivity to the vacuum cleaner was quite comical as it darted under the bed.",
            "sent4": "The hypersensitivity of the security system was compared to a vigilant guard always on alert.",
            "sent5": "The child's hypersensitivity to textures made him refuse to wear anything but soft cotton."
        },
        {
            "definition": "Extreme sensitivity to allergens",
            "pos": "noun",
            "sent1": "My sister's hypersensitivity to pollen causes her to sneeze constantly during spring.",
            "sent2": "The doctor advised him to avoid dairy due to his hypersensitivity to lactose.",
            "sent3": "The dog's hypersensitivity to fleas led to a hilarious scratching frenzy in the park.",
            "sent4": "Her hypersensitivity to peanuts was likened to a mine detector for hidden allergens.",
            "sent5": "The hypersensitivity of her skin made her break out in hives at the slightest touch."
        },
        {
            "definition": "Overreaction to certain substances or situations",
            "pos": "noun",
            "sent1": "His hypersensitivity to criticism often led to unnecessary arguments with his colleagues.",
            "sent2": "The child's hypersensitivity to change made transitions very challenging for the family.",
            "sent3": "The plant's hypersensitivity to overwatering resulted in it wilting dramatically.",
            "sent4": "Her hypersensitivity to injustice was like a fire burning within her, driving her to activism.",
            "sent5": "The hypersensitivity of the alarm system caused it to go off at the slightest movement."
        }
    ]
}