{
    "term": "hyperdrive",
    "meanings": [
        {
            "definition": "A propulsion system that allows a spacecraft to travel faster than the speed of light.",
            "pos": "noun",
            "sent1": "The spaceship's hyperdrive enabled it to zoom through space at incredible speeds.",
            "sent2": "The crew relied on the hyperdrive to reach distant galaxies in record time.",
            "sent3": "When the hyperdrive malfunctioned, the spaceship ended up in a different universe!",
            "sent4": "Her imagination was like a hyperdrive, propelling her stories into uncharted territories.",
            "sent5": "The scientist's explanation of the hyperdrive was as clear as a bright star in the night sky."
        },
        {
            "definition": "To engage or activate a hyperdrive system.",
            "pos": "verb",
            "sent1": "Captain, prepare to hyperdrive us out of here!",
            "sent2": "The pilot quickly hyperdrove the ship to escape the approaching asteroid field.",
            "sent3": "The chef hyperdrove around the kitchen, preparing dishes at lightning speed.",
            "sent4": "Her determination hyperdrove her to finish the race despite the obstacles.",
            "sent5": "The music hyperdrove the crowd into a frenzy, with everyone dancing joyfully."
        },
        {
            "definition": "The technology or mechanism used for faster-than-light travel.",
            "pos": "noun",
            "sent1": "Scientists are still studying the hyperdrive to unlock its full potential.",
            "sent2": "The blueprint detailed the intricate workings of the hyperdrive system.",
            "sent3": "The hyperdrive was the star of the spaceship show, captivating all who saw it.",
            "sent4": "In her dreams, the hyperdrive was a magical key to exploring the universe.",
            "sent5": "The hyperdrive hummed softly, ready to propel the spacecraft into the unknown."
        }
    ]
}