{
    "term": "hyper",
    "meanings": [
        {
            "definition": "Overexcited or overactive",
            "pos": "adjective",
            "sent1": "The hyper puppy ran around the yard with endless energy.",
            "sent2": "The children were hyper after eating too much candy at the party.",
            "sent3": "The hyper squirrel kept darting back and forth, amusing everyone in the park.",
            "sent4": "Her hyper enthusiasm for the project was contagious among her teammates.",
            "sent5": "The hyper colors of the painting made it stand out in the gallery."
        },
        {
            "definition": "Excessive or exaggerated",
            "pos": "adjective",
            "sent1": "She gave a hyper reaction to the small mistake, making a big deal out of it.",
            "sent2": "The hyper claims in the advertisement made people skeptical about its effectiveness.",
            "sent3": "His hyper concern over the weather forecast led him to bring an umbrella on a sunny day.",
            "sent4": "The hyper details in the story made it hard to distinguish fact from fiction.",
            "sent5": "The hyper decorations at the party made it look like a fairy tale setting."
        },
        {
            "definition": "Above or beyond",
            "pos": "adverb",
            "sent1": "The plane flew hyper the clouds, reaching new heights.",
            "sent2": "She climbed the tree hyper her friends, showing off her agility.",
            "sent3": "The cat leaped hyper the fence, surprising the neighbors.",
            "sent4": "His grades went hyper expectations, impressing his teachers.",
            "sent5": "The rocket soared hyper the atmosphere, disappearing into space."
        },
        {
            "definition": "Extremely active or energetic",
            "pos": "adjective",
            "sent1": "The hyper child bounced around the room, full of life.",
            "sent2": "The athlete was hyper during the match, never slowing down.",
            "sent3": "The hyper dance routine entertained the audience with its fast pace.",
            "sent4": "Her hyper performance on stage captivated the entire audience.",
            "sent5": "The hyper waves crashed against the shore, creating a lively scene."
        }
    ]
}