{
    "term": "hypnotisms",
    "meanings": [
        {
            "definition": "The practice of inducing a state of consciousness in which a person loses the power of voluntary action and is highly responsive to suggestion or direction.",
            "pos": "noun",
            "sent1": "During the hypnotisms session, the person felt like they were in a dreamlike state.",
            "sent2": "The hypnotisms performed by the therapist helped the patient relax deeply.",
            "sent3": "The hypnotisms made the volunteer cluck like a chicken, much to everyone's amusement.",
            "sent4": "Her soothing voice acted as a hypnotisms, guiding him into a peaceful trance.",
            "sent5": "The hypnotisms created a vivid world of imagination for the participant."
        },
        {
            "definition": "The state or condition of being hypnotized.",
            "pos": "noun",
            "sent1": "After the hypnotisms, he woke up feeling refreshed and rejuvenated.",
            "sent2": "The hypnotisms left her in a calm and tranquil state.",
            "sent3": "The hypnotisms had him believing he was a famous movie star, much to his delight.",
            "sent4": "In the hypnotisms, time seemed to slow down, like a gentle river flowing.",
            "sent5": "The hypnotisms enveloped her in a sense of peace and serenity."
        },
        {
            "definition": "The act or process of hypnotizing someone.",
            "pos": "noun",
            "sent1": "The hypnotisms involved swinging a pocket watch back and forth.",
            "sent2": "She studied the art of hypnotisms to help people overcome their fears.",
            "sent3": "The hypnotisms on stage made the audience burst into laughter unexpectedly.",
            "sent4": "His words had a hypnotisms effect, calming her nerves instantly.",
            "sent5": "The hypnotisms began with a gentle voice guiding him into a deep relaxation."
        }
    ]
}