{
    "term": "hypocausts",
    "meanings": [
        {
            "definition": "An ancient Roman heating system in which hot air circulated under the floor and through the walls of a building.",
            "pos": "noun",
            "sent1": "The hypocausts in the Roman villa kept the floors warm.",
            "sent2": "The archaeologists discovered well-preserved hypocausts in the ancient ruins.",
            "sent3": "The hypocausts decided to take a break from heating and went on strike.",
            "sent4": "Her kindness was like the gentle warmth of hypocausts, spreading through the room.",
            "sent5": "The students marveled at the ingenuity of the hypocausts in the history lesson."
        },
        {
            "definition": "A type of heating system used in Roman baths and villas.",
            "pos": "noun",
            "sent1": "The hypocausts efficiently heated the Roman baths for the visitors.",
            "sent2": "In the villa, the hypocausts provided a cozy warmth during the winter.",
            "sent3": "The hypocausts threw a party to celebrate their successful heating season.",
            "sent4": "His passion for cooking was like the precision of hypocausts in maintaining temperature.",
            "sent5": "The flickering flames of the hypocausts danced gracefully under the mosaic floors."
        },
        {
            "definition": "A method of heating buildings by circulating hot air under the floors.",
            "pos": "noun",
            "sent1": "The hypocausts were essential for keeping the grand hall warm.",
            "sent2": "During winter, the hypocausts were a welcome feature in the chilly rooms.",
            "sent3": "The mischievous cat loved to nap on the toasty hypocausts.",
            "sent4": "Her words were like the comforting heat of hypocausts, soothing his worries.",
            "sent5": "The gentle hum of the hypocausts lulled the residents into a peaceful slumber."
        }
    ]
}