{
    "term": "hypothenuses",
    "meanings": [
        {
            "definition": "The longest side of a right-angled triangle, opposite the right angle.",
            "pos": "noun",
            "sent1": "In a right-angled triangle, the hypothenuses is the side across from the right angle.",
            "sent2": "The carpenter measured the hypothenuses of the triangle to ensure it was a right angle.",
            "sent3": "The hypothenuses of the triangle was so long that it reached the top of the tree!",
            "sent4": "Her determination was the hypothenuses that guided her through the challenges.",
            "sent5": "The hypothenuses, like a silent giant, stood firm in the face of the storm."
        },
        {
            "definition": "To find the length of the hypotenuse, use the Pythagorean theorem.",
            "pos": "verb",
            "sent1": "To solve the problem, you need to hypothenuses the length of the missing side.",
            "sent2": "She hypothenusesed the hypotenuse of the triangle using the Pythagorean theorem.",
            "sent3": "The detective had to hypothenuses the truth from the clues given.",
            "sent4": "His intuition helped him hypothenuses the correct decision in the end.",
            "sent5": "The scientist hypothenusesed the outcome of the experiment based on previous data."
        },
        {
            "definition": "The hypotenuse is always the side opposite the right angle.",
            "pos": "noun",
            "sent1": "Remember, the hypotenuse is the side that is not touching the right angle.",
            "sent2": "The hypotenuse of the triangle was painted in a bright color for easy identification.",
            "sent3": "The mischievous cat loved to play with the hypotenuse of the triangle.",
            "sent4": "Her smile was the hypotenuse that connected everyone in the room.",
            "sent5": "The hypotenuse, like a bridge, connected the two sides of the triangle seamlessly."
        }
    ]
}