{
    "term": "hypostyles",
    "meanings": [
        {
            "definition": "A hall with a roof supported by columns.",
            "pos": "noun",
            "sent1": "The ancient temple had a grand hypostyles where people gathered for ceremonies.",
            "sent2": "The hypostyles in the mosque provided a cool and shaded area for worshippers.",
            "sent3": "The hypostyles in the library made it look like a forest of knowledge.",
            "sent4": "The hypostyles of the cathedral stood like giants holding up the heavens.",
            "sent5": "Walking through the hypostyles felt like entering a magical realm of pillars and shadows."
        },
        {
            "definition": "A structure with a roof supported by columns.",
            "pos": "noun",
            "sent1": "The garden pavilion featured a delicate hypostyles that added elegance to the design.",
            "sent2": "The hypostyles of the gazebo created a sense of openness and airiness.",
            "sent3": "The children pretended the hypostyles were giant lollipops holding up the roof.",
            "sent4": "The hypostyles of the pergola resembled a row of soldiers standing guard.",
            "sent5": "The ancient ruins revealed the remnants of hypostyles that once marked a majestic structure."
        },
        {
            "definition": "A building with a roof supported by columns.",
            "pos": "noun",
            "sent1": "The royal palace boasted a grand hypostyles that impressed all who entered.",
            "sent2": "The hypostyles of the government building added a touch of classical beauty to the architecture.",
            "sent3": "The hypostyles of the museum made visitors feel like they were walking through history.",
            "sent4": "The hypostyles of the mansion seemed to reach up and touch the sky.",
            "sent5": "The hypostyles of the ancient structure whispered tales of bygone glory to those who listened."
        }
    ]
}