{
    "term": "hysterical",
    "meanings": [
        {
            "definition": "Causing uncontrollable laughter or amusement.",
            "pos": "adjective",
            "sent1": "The comedian's jokes were so hysterical that everyone in the audience was laughing non-stop.",
            "sent2": "The movie was so funny that it had the whole family in hysterical laughter.",
            "sent3": "The clown's antics were so hysterical that even the grumpiest person couldn't help but smile.",
            "sent4": "The viral video of the baby laughing uncontrollably was absolutely hysterical.",
            "sent5": "The sitcom's hilarious plot twists always left the viewers in hysterical fits of giggles."
        },
        {
            "definition": "In a state of extreme excitement or confusion.",
            "pos": "adjective",
            "sent1": "The children were hysterical with joy when they saw the presents under the Christmas tree.",
            "sent2": "The fans were hysterical with excitement as their favorite band took the stage.",
            "sent3": "The puppy was so hysterical after getting a new toy that it ran around the house in circles.",
            "sent4": "The students were hysterical with confusion during the surprise pop quiz.",
            "sent5": "The crowd became hysterical with excitement when the team scored the winning goal."
        },
        {
            "definition": "Characterized by or arising from uncontrolled emotion.",
            "pos": "adjective",
            "sent1": "Her hysterical sobbing could be heard throughout the entire house.",
            "sent2": "The actor's performance was so convincing that it left the audience in a state of hysterical emotion.",
            "sent3": "The toddler's tantrum in the supermarket was both hysterical and embarrassing for the parents.",
            "sent4": "The news of the surprise party left her in a state of hysterical joy.",
            "sent5": "The movie's heartbreaking ending left everyone in the theater feeling hysterical sadness."
        }
    ]
}