{
    "term": "iatrogenesis",
    "meanings": [
        {
            "definition": "The inadvertent and preventable induction of disease or complications by the medical treatment or procedures of a physician or surgeon.",
            "pos": "noun",
            "sent1": "Iatrogenesis can occur when a doctor's treatment causes more harm than good.",
            "sent2": "The hospital took measures to prevent iatrogenesis during surgeries.",
            "sent3": "The comedy skit humorously portrayed iatrogenesis as a mix-up in the doctor's orders.",
            "sent4": "In the play, the character's iatrogenesis led to unexpected consequences.",
            "sent5": "The textbook explained iatrogenesis with a clear example to help students understand."
        },
        {
            "definition": "The study of the adverse effects of medical treatment on patients.",
            "pos": "noun",
            "sent1": "Researchers focused on iatrogenesis to understand how treatments can go wrong.",
            "sent2": "The university offered a course on iatrogenesis and patient safety.",
            "sent3": "The documentary shed light on the importance of studying iatrogenesis in healthcare.",
            "sent4": "The book highlighted the significance of iatrogenesis research in improving medical care.",
            "sent5": "The seminar discussed real cases of iatrogenesis to educate healthcare professionals."
        },
        {
            "definition": "The process by which a patient is harmed by medical intervention.",
            "pos": "noun",
            "sent1": "Iatrogenesis can sometimes result from well-intentioned medical procedures.",
            "sent2": "The hospital implemented new protocols to reduce iatrogenesis risks.",
            "sent3": "The sitcom episode comically portrayed a mix-up leading to iatrogenesis.",
            "sent4": "Her recovery was delayed due to iatrogenesis from the previous treatment.",
            "sent5": "The news article highlighted the need to address iatrogenesis for patient safety."
        }
    ]
}