{
    "term": "ichthyosaurians",
    "meanings": [
        {
            "definition": "A group of marine reptiles that lived during the Mesozoic era.",
            "pos": "noun",
            "sent1": "The ichthyosaurians swam gracefully in the ancient seas.",
            "sent2": "Scientists study the fossils of ichthyosaurians to learn about prehistoric marine life.",
            "sent3": "The ichthyosaurians threw a party under the sea to celebrate their ancient heritage.",
            "sent4": "The ichthyosaurians ruled the Mesozoic oceans like majestic sea kings.",
            "sent5": "Children were amazed by the ichthyosaurians at the museum, imagining them swimming in the deep blue sea."
        },
        {
            "definition": "Belonging to or relating to the ichthyosaurians.",
            "pos": "adjective",
            "sent1": "The researcher discovered a new species with ichthyosaurians features.",
            "sent2": "The ichthyosaurians fossils provided valuable information about ancient marine ecosystems.",
            "sent3": "The ichthyosaurians-themed party decorations were a hit among the guests.",
            "sent4": "Her eyes sparkled like the scales of an ichthyosaurians under the sunlight.",
            "sent5": "The painting depicted a mystical world filled with ichthyosaurians creatures."
        },
        {
            "definition": "A member of the group of marine reptiles known as ichthyosaurians.",
            "pos": "noun",
            "sent1": "The ichthyosaurians swam swiftly through the prehistoric waters.",
            "sent2": "An ichthyosaurians skeleton was carefully excavated by paleontologists.",
            "sent3": "The ichthyosaurians gathered for a family reunion in the ancient sea.",
            "sent4": "Her laughter echoed through the room like the call of an ichthyosaurians.",
            "sent5": "The documentary showcased the life cycle of an ichthyosaurians from birth to adulthood."
        }
    ]
}