{
    "term": "iconolatries",
    "meanings": [
        {
            "definition": "The worship of icons.",
            "pos": "noun",
            "sent1": "Some people engage in iconolatries by praying in front of religious images.",
            "sent2": "In certain cultures, iconolatries is a common form of religious devotion.",
            "sent3": "During the festival, the town was filled with iconolatries, each person carrying a small statue.",
            "sent4": "Her love for art bordered on iconolatries, as she spent hours admiring and studying each painting.",
            "sent5": "The intensity of his iconolatries was evident in the way he carefully cleaned and displayed his collection of icons."
        },
        {
            "definition": "The belief in the power or significance of icons.",
            "pos": "noun",
            "sent1": "Her iconolatries led her to believe that carrying a lucky charm would bring her good fortune.",
            "sent2": "In ancient times, iconolatries played a crucial role in rituals and ceremonies.",
            "sent3": "His iconolatries were put to the test when he lost his favorite lucky coin.",
            "sent4": "The iconolatries of the ancient civilization were so strong that they believed statues could protect them from harm.",
            "sent5": "The power of her iconolatries was evident when she refused to part with her grandmother's old pendant."
        },
        {
            "definition": "The practice of revering icons.",
            "pos": "noun",
            "sent1": "Iconolatries can be seen in the way people carefully clean and maintain their family heirlooms.",
            "sent2": "The tradition of iconolatries has been passed down through generations in this community.",
            "sent3": "His iconolatries extended to his favorite sports team, with posters of players covering his walls.",
            "sent4": "In times of trouble, people often turn to iconolatries for comfort and guidance.",
            "sent5": "The depth of her iconolatries was evident in the way she spoke about her most cherished possessions."
        }
    ]
}