{
    "term": "icterus",
    "meanings": [
        {
            "definition": "Yellow discoloration of the skin, mucous membranes, and sclera due to increased levels of bilirubin in the blood.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with icterus after noticing the yellow tint in their eyes.",
            "sent2": "The baby's icterus was concerning to the parents, prompting a visit to the pediatrician.",
            "sent3": "The icterus made the patient look like a walking banana, much to everyone's amusement.",
            "sent4": "Her icterus was a glaring sign of the underlying health issues she was facing.",
            "sent5": "The icterus on his skin was as bright as a summer sun, impossible to ignore."
        },
        {
            "definition": "A medical condition characterized by jaundice.",
            "pos": "noun",
            "sent1": "The hospital treated many cases of icterus caused by liver problems.",
            "sent2": "The doctor explained that icterus is a common symptom of certain illnesses.",
            "sent3": "Despite his icterus, the patient kept a positive attitude and made jokes about looking like a lemon.",
            "sent4": "Her icterus was a warning sign of the health issues she needed to address.",
            "sent5": "The icterus on his skin was a vivid reminder of the importance of liver health."
        },
        {
            "definition": "A symptom of liver disease or dysfunction.",
            "pos": "noun",
            "sent1": "The icterus in his eyes indicated a possible liver problem.",
            "sent2": "The nurse recognized the icterus as a key symptom of the patient's condition.",
            "sent3": "The icterus on his skin was like a neon sign pointing to his liver issues.",
            "sent4": "Her icterus was a red flag that something was wrong internally.",
            "sent5": "The icterus on his skin was a stark reminder of the liver's crucial role in the body."
        }
    ]
}