{
    "term": "identification",
    "meanings": [
        {
            "definition": "The action or process of identifying someone or something.",
            "pos": "noun",
            "sent1": "During the game, the coach asked for the players' identification to confirm their ages.",
            "sent2": "The police officer used the suspect's identification to determine his true identity.",
            "sent3": "At the costume party, the guests played a game of identification to guess who was dressed as what.",
            "sent4": "In the crowded market, finding the right stall was like a game of identification in a sea of vendors.",
            "sent5": "The scientist's groundbreaking research led to the identification of a new species of plant."
        },
        {
            "definition": "A document or card that proves a person's identity.",
            "pos": "noun",
            "sent1": "Before boarding the plane, passengers must show their identification to the security staff.",
            "sent2": "She kept her identification in a safe place to avoid losing it.",
            "sent3": "The magician's trick involved making his identification disappear and reappear in a different pocket.",
            "sent4": "The identification in his wallet was the only thing that linked him to his past life.",
            "sent5": "The identification with a holographic seal was considered the most secure form of ID."
        },
        {
            "definition": "The association of someone or something with an idea or group.",
            "pos": "noun",
            "sent1": "The identification of the brand with luxury made it popular among the elite.",
            "sent2": "Her identification with the charity organization brought in many donations.",
            "sent3": "The comedian's identification with a famous character made his impersonation hilarious.",
            "sent4": "The artist's identification with nature was evident in all her paintings.",
            "sent5": "The identification of the suspect with the crime scene was crucial for the investigation."
        }
    ]
}