{
    "term": "ideographs",
    "meanings": [
        {
            "definition": "A character or symbol representing an idea or concept.",
            "pos": "noun",
            "sent1": "In some cultures, ideographs are used instead of letters to write words.",
            "sent2": "The ancient civilization used ideographs to communicate complex ideas.",
            "sent3": "The children drew funny ideographs on the chalkboard during playtime.",
            "sent4": "Her smile was like an ideograph, conveying warmth and kindness without words.",
            "sent5": "The ideographs on the sign guided travelers to the hidden temple."
        },
        {
            "definition": "A written character that represents an idea or object directly rather than a particular word or phrase.",
            "pos": "noun",
            "sent1": "The artist created unique ideographs to symbolize different emotions.",
            "sent2": "The ideographs on the map indicated important landmarks.",
            "sent3": "The ideographs on the menu made the restaurant seem mysterious and intriguing.",
            "sent4": "His eyes were like ideographs, revealing his thoughts without speaking.",
            "sent5": "The ideographs on the ancient tablet told a story of a forgotten civilization."
        },
        {
            "definition": "A symbol or character that conveys meaning without being a phonetic representation of a word.",
            "pos": "noun",
            "sent1": "The cave paintings used ideographs to communicate with future generations.",
            "sent2": "The company logo was designed using ideographs to represent unity and strength.",
            "sent3": "The detective deciphered the secret code hidden in the ideographs.",
            "sent4": "Her laughter was like an ideograph, spreading joy without words.",
            "sent5": "The ideographs on the ancient scroll held the key to unlocking a long-lost language."
        }
    ]
}