{
    "term": "idiomatically",
    "meanings": [
        {
            "definition": "In a manner characteristic of a particular language or dialect.",
            "pos": "adverb",
            "sent1": "She spoke idiomatically, using phrases only familiar to her region.",
            "sent2": "He translated the text idiomatically, capturing the essence of the original language.",
            "sent3": "The comedian humorously tried to speak idiomatically, but ended up confusing the audience.",
            "sent4": "Her singing flowed idiomatically, as if she was a native speaker of the language.",
            "sent5": "The tour guide explained idiomatically, making it easy for the tourists to understand."
        },
        {
            "definition": "In a way that is natural to a particular group of people.",
            "pos": "adverb",
            "sent1": "The children played idiomatically, following their own set of rules.",
            "sent2": "She interacted idiomatically with the locals, blending in seamlessly.",
            "sent3": "The team worked idiomatically, each member knowing their role perfectly.",
            "sent4": "His storytelling style was idiomatically engaging, captivating listeners of all ages.",
            "sent5": "The community celebrated idiomatically, with traditions passed down through generations."
        },
        {
            "definition": "Using expressions that are unique to a specific language or culture.",
            "pos": "adjective",
            "sent1": "The idiomatically crafted poem reflected the beauty of the native language.",
            "sent2": "She wore an idiomatically designed dress, showcasing her cultural pride.",
            "sent3": "The restaurant served idiomatically flavored dishes, transporting diners to another country.",
            "sent4": "His artwork was idiomatically inspired, drawing from the rich heritage of his ancestors.",
            "sent5": "The play was idiomatically performed, capturing the essence of the local customs."
        }
    ]
}