{
    "term": "idle",
    "meanings": [
        {
            "definition": "Not active or in use",
            "pos": "adjective",
            "sent1": "The idle car sat in the driveway for weeks.",
            "sent2": "The computer screen remained idle for hours.",
            "sent3": "The idle playground was eerily quiet on a sunny day.",
            "sent4": "His mind felt like an idle engine, unable to start.",
            "sent5": "The idle factory echoed with emptiness and silence."
        },
        {
            "definition": "Not working or producing anything",
            "pos": "adjective",
            "sent1": "The idle machine hummed softly in the corner.",
            "sent2": "The idle printer needed a new ink cartridge.",
            "sent3": "The idle oven refused to bake the cookies properly.",
            "sent4": "Her idle creativity sparked to life with a new idea.",
            "sent5": "The idle farm equipment gathered dust in the barn."
        },
        {
            "definition": "Not filled with activity or work",
            "pos": "adjective",
            "sent1": "The idle office was quiet after everyone left.",
            "sent2": "The idle classroom felt empty during summer break.",
            "sent3": "The idle street was peaceful in the early morning.",
            "sent4": "His idle hands fidgeted with a pen on the desk.",
            "sent5": "The idle park bench beckoned for someone to sit and rest."
        },
        {
            "definition": "Not employed or busy",
            "pos": "adjective",
            "sent1": "The idle worker leaned against the wall, waiting for a task.",
            "sent2": "The idle student doodled in the margins of the notebook.",
            "sent3": "The idle cashier chatted with customers during a slow period.",
            "sent4": "Her idle schedule allowed for a spontaneous adventure.",
            "sent5": "The idle days of summer stretched out lazily before them."
        },
        {
            "definition": "Lacking worth or basis",
            "pos": "adjective",
            "sent1": "The idle gossip spread quickly through the small town.",
            "sent2": "The idle promises were soon forgotten by all.",
            "sent3": "The idle rumors caused unnecessary drama in the community.",
            "sent4": "His idle threats held no weight in the argument.",
            "sent5": "The idle excuses fell flat in the face of responsibility."
        }
    ]
}