{
    "term": "igg",
    "meanings": [
        {
            "definition": "To ignore or disregard something.",
            "pos": "verb",
            "sent1": "She decided to igg the rude comments and focus on the positive ones instead.",
            "sent2": "Sometimes it's better to igg distractions and stay focused on your goals.",
            "sent3": "When her little brother kept asking for attention, she playfully igged him and continued reading her book.",
            "sent4": "In order to maintain her peace of mind, she learned to igg negativity like water off a duck's back.",
            "sent5": "The wise old owl advised the young owl to igg the noise of the city and listen to the whispers of the forest instead."
        },
        {
            "definition": "A feeling of annoyance or irritation.",
            "pos": "noun",
            "sent1": "After waiting for hours, he couldn't hide his igg towards the delayed train.",
            "sent2": "Her constant complaints about the weather were starting to become a source of igg for everyone around her.",
            "sent3": "The igg in his voice was evident as he grumbled about having to do extra work.",
            "sent4": "The igg in the room was palpable as they waited for the test results to be announced.",
            "sent5": "The persistent buzzing of the fly became an unbearable igg to her peaceful afternoon nap."
        },
        {
            "definition": "A slang term for a person who is annoying or irritating.",
            "pos": "noun",
            "sent1": "She rolled her eyes at the antics of the class igg who always disrupted the lesson.",
            "sent2": "The group chat was filled with complaints about the new office igg who never stopped talking.",
            "sent3": "Despite his friends teasing him, he secretly found the class igg's jokes quite funny.",
            "sent4": "The little brother was affectionately called the family igg for his mischievous pranks.",
            "sent5": "The neighborhood igg's loud music late at night was a constant source of frustration for the residents."
        }
    ]
}