{
    "term": "ill",
    "meanings": [
        {
            "definition": "Not in good health",
            "pos": "adjective",
            "sent1": "She felt ill and decided to stay home from school.",
            "sent2": "The doctor prescribed some medicine to help with her ill health.",
            "sent3": "Despite feeling ill, she still managed to finish her homework.",
            "sent4": "The ill effects of the flu lingered for days.",
            "sent5": "The pale, ill girl coughed softly in the corner of the room."
        },
        {
            "definition": "Evil or harmful",
            "pos": "adjective",
            "sent1": "The ill intentions of the villain were clear from the start.",
            "sent2": "The witch cast a spell with ill consequences for the kingdom.",
            "sent3": "The ill wizard's potion turned the prince into a frog.",
            "sent4": "The ill deeds of the pirate were known far and wide.",
            "sent5": "The ill curse haunted the old castle for centuries."
        },
        {
            "definition": "Unfavorable or adverse",
            "pos": "adjective",
            "sent1": "The ill weather ruined their plans for a picnic.",
            "sent2": "The ill timing of the meeting caused chaos in the office.",
            "sent3": "Despite the ill news, they remained hopeful for a solution.",
            "sent4": "The ill omen of the black cat crossing their path left them uneasy.",
            "sent5": "The ill-fated decision led to a series of unfortunate events."
        },
        {
            "definition": "Poorly or badly",
            "pos": "adverb",
            "sent1": "She played ill during the game to trick the opponent.",
            "sent2": "The singer performed ill at the concert due to a sore throat.",
            "sent3": "The actor pretended to act ill to get out of doing chores.",
            "sent4": "The car engine ran ill after being neglected for too long.",
            "sent5": "The student wrote ill on the test because of a lack of preparation."
        }
    ]
}