{
    "term": "illuminist",
    "meanings": [
        {
            "definition": "A person who practices or advocates for the use of light or illumination in a spiritual or philosophical context.",
            "pos": "noun",
            "sent1": "The illuminist guided the seekers towards inner light and wisdom.",
            "sent2": "The illuminist's teachings focused on the power of enlightenment through illumination.",
            "sent3": "The illuminist lit up the room with candles and profound thoughts.",
            "sent4": "Her words shone brightly, like an illuminist guiding lost souls.",
            "sent5": "The illuminist's presence brought clarity and understanding to all who listened."
        },
        {
            "definition": "Of or relating to the Enlightenment period in European history.",
            "pos": "adjective",
            "sent1": "The illuminist ideas influenced many during the Enlightenment era.",
            "sent2": "His illuminist beliefs were rooted in reason and progress.",
            "sent3": "The illuminist thinkers of the past would be amazed by modern technology.",
            "sent4": "Her illuminist approach to problem-solving shed light on complex issues.",
            "sent5": "The illuminist principles paved the way for societal advancements."
        },
        {
            "definition": "A member of a group or movement that seeks spiritual enlightenment or knowledge.",
            "pos": "noun",
            "sent1": "As an illuminist, she sought truth and understanding beyond the physical world.",
            "sent2": "The illuminist community gathered to share insights and experiences.",
            "sent3": "The illuminist group meditated under the stars, seeking cosmic wisdom.",
            "sent4": "He was known as the illuminist leader, guiding others on their spiritual journeys.",
            "sent5": "The illuminist society embraced diversity in their quest for enlightenment."
        }
    ]
}