{
    "term": "illuviations",
    "meanings": [
        {
            "definition": "The process of depositing material washed down from higher ground.",
            "pos": "noun",
            "sent1": "After heavy rain, the illuviations from the hillside covered the valley below.",
            "sent2": "The illuviations from the mountains formed a thick layer of sediment in the riverbed.",
            "sent3": "The illuviations decided to take a shortcut down the slope, creating a muddy mess.",
            "sent4": "The illuviations flowed like a slow-moving river, carrying nutrients to the lower fields.",
            "sent5": "The illuviations transformed the landscape, leaving a trail of rich soil in their wake."
        },
        {
            "definition": "The material deposited by illuviation.",
            "pos": "noun",
            "sent1": "Farmers use the illuviations at the base of the hill to enrich their crops.",
            "sent2": "The geologist studied the illuviations to understand the soil composition.",
            "sent3": "The illuviations piled up at the bottom of the slope, creating a mini mountain.",
            "sent4": "The illuviations settled like a soft blanket over the valley floor.",
            "sent5": "The illuviations held the secrets of centuries in their layers of sediment."
        },
        {
            "definition": "The movement of dissolved or suspended material within a soil profile.",
            "pos": "noun",
            "sent1": "The illuviations slowly seeped through the soil, carrying nutrients with them.",
            "sent2": "Gardeners must understand the illuviations to properly nourish their plants.",
            "sent3": "The illuviations in the garden seemed to have a mind of their own, swirling around the roots.",
            "sent4": "The illuviations danced through the soil, creating a symphony of growth.",
            "sent5": "The illuviations whispered secrets of the earth as they moved through the layers of soil."
        }
    ]
}