{
    "term": "illuviating",
    "meanings": [
        {
            "definition": "To wash or leach out soluble constituents from soil.",
            "pos": "verb",
            "sent1": "After heavy rain, the water began illuviating the nutrients from the topsoil.",
            "sent2": "The farmer used a special solution to illuviating the minerals from the soil.",
            "sent3": "The mischievous squirrel accidentally knocked over the bucket, illuviating the seeds all over the garden.",
            "sent4": "The river's strong current illuviated the sand along its banks, creating new formations.",
            "sent5": "The scientist conducted an experiment to illuviating the different layers of sediment in the sample."
        },
        {
            "definition": "To separate or remove particles by the action of water or other liquid.",
            "pos": "verb",
            "sent1": "The dishwasher's powerful jets illuviated the food particles from the plates.",
            "sent2": "The rain illuviated the dust from the car's windshield, improving visibility.",
            "sent3": "The children had fun illuviating the bubbles in the bath, creating a foamy mess.",
            "sent4": "The waterfall illuviated the rocks from the cliff, revealing a hidden cave entrance.",
            "sent5": "The cleaning solution effectively illuviated the stubborn stains from the carpet fibers."
        },
        {
            "definition": "To cause sedimentation or deposition of material.",
            "pos": "verb",
            "sent1": "The slow-moving river illuviated layers of silt along its banks.",
            "sent2": "Over time, the settling particles illuviated into distinct layers of sediment.",
            "sent3": "The artist's brushstrokes illuviated the paint onto the canvas, creating a beautiful landscape.",
            "sent4": "The volcanic eruption illuviated ash over the entire region, covering everything in a gray blanket.",
            "sent5": "The wind illuviated sand grains into intricate patterns on the dunes."
        }
    ]
}