{
    "term": "illuminism",
    "meanings": [
        {
            "definition": "The belief in or advocacy of intellectual enlightenment and spiritual insight.",
            "pos": "noun",
            "sent1": "Her fascination with illuminism led her to explore various philosophies and spiritual teachings.",
            "sent2": "Many people find comfort and guidance in the principles of illuminism.",
            "sent3": "When asked about her illuminism beliefs, she joked that her cat was the true guru.",
            "sent4": "In the darkness of ignorance, illuminism shines like a beacon of truth.",
            "sent5": "The illuminism of knowledge dispels the shadows of confusion."
        },
        {
            "definition": "The use of light or lighting for decorative or practical purposes.",
            "pos": "noun",
            "sent1": "The party venue was adorned with colorful illuminism to create a festive atmosphere.",
            "sent2": "The architect incorporated innovative illuminism to enhance the beauty of the building.",
            "sent3": "The illuminism in the garden transformed it into a magical wonderland at night.",
            "sent4": "Her smile lit up the room like a gentle illuminism.",
            "sent5": "The illuminism of the chandelier added elegance to the dining room."
        },
        {
            "definition": "The artistic or architectural style characterized by the use of light and shadow to create dramatic effects.",
            "pos": "noun",
            "sent1": "The play of illuminism in the painting brought life to the characters on canvas.",
            "sent2": "The cathedral's design showcased the grandeur of illuminism in architecture.",
            "sent3": "The artist's use of illuminism in the portrait made the subject appear mysterious.",
            "sent4": "The illuminism of the stage lighting set the mood for the theatrical performance.",
            "sent5": "The filmmaker masterfully employed illuminism to evoke emotions in the audience."
        }
    ]
}