{
    "term": "immersed",
    "meanings": [
        {
            "definition": "Involved deeply in a particular activity or interest.",
            "pos": "adjective",
            "sent1": "She was completely immersed in her favorite book, not noticing anything around her.",
            "sent2": "The artist was so immersed in painting that hours flew by without her realizing.",
            "sent3": "He was so immersed in playing video games that he forgot to eat dinner.",
            "sent4": "Her mind was immersed in thoughts of the upcoming exam, making it hard to focus on anything else.",
            "sent5": "The child was immersed in building a sandcastle, oblivious to the world around him."
        },
        {
            "definition": "Completely covered or submerged in a liquid.",
            "pos": "adjective",
            "sent1": "The sponge became fully immersed in the soapy water, ready for cleaning.",
            "sent2": "The swimmer was immersed in the refreshing pool, enjoying the cool water on a hot day.",
            "sent3": "The toy boat accidentally got immersed in the bathtub, creating a mini adventure for the child.",
            "sent4": "The sunken ship lay immersed in the depths of the ocean, a silent witness to history.",
            "sent5": "The vegetables were immersed in boiling water to cook them quickly for dinner."
        },
        {
            "definition": "Deeply absorbed or engrossed in something.",
            "pos": "adjective",
            "sent1": "The students were immersed in the fascinating story their teacher was telling.",
            "sent2": "She was so immersed in the movie that she didn't hear her phone ringing.",
            "sent3": "The detective was immersed in solving the mystery, trying to connect all the clues.",
            "sent4": "The audience was immersed in the music, swaying to the rhythm of the melody.",
            "sent5": "The scientist was immersed in the research, eager to discover new findings in the lab."
        }
    ]
}