{
    "term": "imminent",
    "meanings": [
        {
            "definition": "About to happen; impending.",
            "pos": "adjective",
            "sent1": "The storm clouds gathered, signaling the imminent arrival of rain.",
            "sent2": "The students were excited as the imminent end of the school day approached.",
            "sent3": "The imminent surprise party was almost ruined when the birthday girl walked in early.",
            "sent4": "The imminent deadline loomed over him like a dark cloud, urging him to finish his work.",
            "sent5": "The imminent danger of the situation made everyone act quickly to find a solution."
        },
        {
            "definition": "Likely to occur at any moment.",
            "pos": "adjective",
            "sent1": "The chef knew the cake was imminent from the delicious smell wafting from the oven.",
            "sent2": "The imminent arrival of the train had the passengers waiting eagerly on the platform.",
            "sent3": "The imminent sale at the store drew in many customers looking for great deals.",
            "sent4": "The imminent success of the project was evident in the team's hard work and dedication.",
            "sent5": "The imminent change in weather prompted everyone to bring umbrellas just in case."
        },
        {
            "definition": "Threatening to occur soon.",
            "pos": "adjective",
            "sent1": "The imminent storm clouds darkened the sky, hinting at an upcoming downpour.",
            "sent2": "The imminent threat of a test made the students study diligently the night before.",
            "sent3": "The imminent arrival of the in-laws had the couple scrambling to clean the house.",
            "sent4": "The imminent danger of the situation made them take necessary precautions to stay safe.",
            "sent5": "The imminent deadline for the project made everyone work together efficiently to meet it."
        }
    ]
}