{
    "term": "immovable",
    "meanings": [
        {
            "definition": "Not able to be moved or changed.",
            "pos": "adjective",
            "sent1": "The heavy boulder was immovable, no matter how hard we tried to push it.",
            "sent2": "The ancient statue stood immovable in the courtyard, unaffected by the passing of time.",
            "sent3": "The stubborn cat remained immovable in front of the closed door, demanding to be let in.",
            "sent4": "Her decision to quit her job was as immovable as a mountain, nothing could sway her.",
            "sent5": "The giant oak tree's roots were so immovable, they seemed to anchor it to the ground forever."
        },
        {
            "definition": "Firmly fixed in place.",
            "pos": "adjective",
            "sent1": "The signpost was immovable, guiding travelers along the correct path.",
            "sent2": "The old lighthouse stood immovable on the rocky cliff, warning ships of danger.",
            "sent3": "The toddler's toy car got stuck immovable under the heavy cabinet, causing a mini traffic jam.",
            "sent4": "His loyalty to his friends was as immovable as the North Star, always there to guide them.",
            "sent5": "The castle gates were so immovable, even the strongest knights struggled to open them."
        },
        {
            "definition": "Unyielding or steadfast.",
            "pos": "adjective",
            "sent1": "Despite the storm, the captain remained immovable in his decision to sail on.",
            "sent2": "The teacher's immovable dedication to her students inspired them to work harder.",
            "sent3": "The immovable belief in magic led the children to search for fairies in the garden.",
            "sent4": "Her faith in herself was as immovable as a rock, never wavering in times of doubt.",
            "sent5": "The soldier's immovable courage in battle earned him the respect of his comrades."
        }
    ]
}