{
    "term": "immortals",
    "meanings": [
        {
            "definition": "Living forever; never dying or decaying.",
            "pos": "adjective",
            "sent1": "The ancient tree in the forest seemed almost immortals, standing tall for centuries.",
            "sent2": "Legends speak of immortals creatures that roam the earth, untouched by time.",
            "sent3": "The vampire joked that he must be truly immortals since he never seemed to age.",
            "sent4": "The majestic mountains appeared immortals, their peaks reaching towards the endless sky.",
            "sent5": "In the fairy tale, the princess possessed an immortals beauty that enchanted all who beheld her."
        },
        {
            "definition": "A person who is not subject to death.",
            "pos": "noun",
            "sent1": "In the story, the hero was hailed as an immortals for his bravery in battle.",
            "sent2": "The ancient myths often featured immortals who possessed great powers beyond mortal understanding.",
            "sent3": "The comedian joked that his cat must be an immortals, considering how many lives it seemed to have.",
            "sent4": "The wise old sage was regarded as an immortals by the villagers, his knowledge seemingly endless.",
            "sent5": "The painting depicted a group of immortals gathered around a mystical fountain of youth."
        },
        {
            "definition": "A being with eternal life or existence.",
            "pos": "noun",
            "sent1": "The deity was worshipped as an immortals by the ancient civilization, believed to watch over them for all time.",
            "sent2": "In folklore, immortals were said to possess magical abilities that surpassed those of ordinary beings.",
            "sent3": "The children giggled at the idea of their pet goldfish being an immortals, swimming happily in its bowl.",
            "sent4": "The stars in the night sky seemed like immortals beings, shining brightly for countless generations.",
            "sent5": "The legend foretold the return of the immortals, who would bring peace and prosperity to the land once more."
        }
    ]
}