{
    "term": "impeach",
    "meanings": [
        {
            "definition": "To accuse a public official of misconduct in office.",
            "pos": "verb",
            "sent1": "The citizens decided to impeach the mayor for stealing money from the city.",
            "sent2": "The Congress may impeach a president if they believe they have committed a serious crime.",
            "sent3": "Why did they impeach the school principal for eating all the cookies in the cafeteria?",
            "sent4": "The decision to impeach the governor's character left a lasting impact on the state.",
            "sent5": "The act of impeachment can bring justice to those who abuse their power."
        },
        {
            "definition": "To challenge the credibility or validity of something.",
            "pos": "verb",
            "sent1": "The lawyer tried to impeach the witness's testimony by presenting contradictory evidence.",
            "sent2": "It is important to impeach any false information before spreading it further.",
            "sent3": "The detective's attempt to impeach the suspect's alibi led to a surprising revelation.",
            "sent4": "Her doubts began to impeach the reliability of the old map she found.",
            "sent5": "The scientist's goal was to impeach the flawed theory with solid data."
        },
        {
            "definition": "To call into question the integrity or honesty of someone.",
            "pos": "verb",
            "sent1": "The journalist aimed to impeach the politician's reputation with evidence of corruption.",
            "sent2": "If you impeach someone's character without proof, it can lead to serious consequences.",
            "sent3": "The comedian's jokes managed to impeach the seriousness of the news anchor.",
            "sent4": "Her constant lies began to impeach her standing within the community.",
            "sent5": "The teacher's fairness helped impeach any doubts about her grading methods."
        }
    ]
}