{
    "term": "imperialism",
    "meanings": [
        {
            "definition": "A policy of extending a country's power and influence through colonization, use of military force, or other means.",
            "pos": "noun",
            "sent1": "The imperialism of the ancient empire led to the expansion of its territories.",
            "sent2": "European countries practiced imperialism by establishing colonies in various parts of the world.",
            "sent3": "The penguin's imperialism over the fish in the aquarium was comical.",
            "sent4": "Her imperialism in the office made her the undisputed leader of the team.",
            "sent5": "The imperialism of the sun over the solar system is undeniable."
        },
        {
            "definition": "The system of imperial government or rule.",
            "pos": "noun",
            "sent1": "Under British imperialism, many colonies were governed from afar.",
            "sent2": "The collapse of the empire marked the end of imperialism in the region.",
            "sent3": "The cat's imperialism over the household was met with resistance from the dog.",
            "sent4": "The imperialism of the clock tower over the town square was a symbol of authority.",
            "sent5": "The imperialism of the queen bee in the hive ensured order and productivity."
        },
        {
            "definition": "The belief in or advocacy of empire or imperial interests.",
            "pos": "noun",
            "sent1": "His strong imperialism drove him to seek control over neighboring lands.",
            "sent2": "The political party's platform was based on nationalism and imperialism.",
            "sent3": "The squirrel's imperialism over the backyard nuts was a source of amusement for the children.",
            "sent4": "The imperialism of technology in our lives is evident in our dependence on smartphones.",
            "sent5": "The imperialism of fashion trends influences the choices of many individuals."
        }
    ]
}