{
    "term": "impellers",
    "meanings": [
        {
            "definition": "A device that moves fluid by rotation.",
            "pos": "noun",
            "sent1": "The impellers in the water pump spun quickly to push the liquid through the pipes.",
            "sent2": "The mechanic replaced the worn impellers in the pump to improve its efficiency.",
            "sent3": "The impellers at the water park were so enthusiastic, they made the lazy river flow faster than expected.",
            "sent4": "Her words acted as impellers, stirring up emotions in the crowd.",
            "sent5": "The impellers resembled tiny propellers, whirling the water around with great force."
        },
        {
            "definition": "A component of a pump or turbine that imparts motion to a fluid.",
            "pos": "noun",
            "sent1": "The impellers inside the turbine helped generate electricity by spinning rapidly.",
            "sent2": "Make sure to clean the impellers regularly to prevent clogs in the pump.",
            "sent3": "The impellers in the pump were so efficient, they could move even the thickest liquids effortlessly.",
            "sent4": "His determination acted as impellers, propelling him towards his goals with unstoppable force.",
            "sent5": "The impellers were like little blades, slicing through the water with precision and power."
        },
        {
            "definition": "Someone or something that impels or drives forward.",
            "pos": "noun",
            "sent1": "She was the impellers behind the charity event, motivating everyone to contribute.",
            "sent2": "The impellers of change often face resistance from those comfortable with the status quo.",
            "sent3": "The impellers in the race were the cheering crowd, urging the runners to the finish line.",
            "sent4": "His passion for music acted as impellers, pushing him to practice tirelessly every day.",
            "sent5": "The impellers of progress are often those who dare to dream beyond the ordinary."
        }
    ]
}