{
    "term": "impersonation",
    "meanings": [
        {
            "definition": "The act of pretending to be someone else for entertainment or fraud.",
            "pos": "noun",
            "sent1": "During the play, the actor's impersonation of a famous singer was very convincing.",
            "sent2": "The comedian's impersonation of the president was hilarious.",
            "sent3": "The party entertainer's impersonation of a superhero made everyone laugh.",
            "sent4": "Her impersonation of a detective was so good, she fooled everyone at the party.",
            "sent5": "The impersonation of a ghost by the actor was spooky and realistic."
        },
        {
            "definition": "The act of imitating someone's voice or mannerisms for comedic effect.",
            "pos": "noun",
            "sent1": "The comedian's impersonation of a famous singer was spot-on.",
            "sent2": "She entertained the audience with her impersonation of a cartoon character.",
            "sent3": "His impersonation of a robot had everyone in stitches.",
            "sent4": "The child's impersonation of a dinosaur was both cute and funny.",
            "sent5": "The impersonation of a pirate by the actor was full of swagger and humor."
        },
        {
            "definition": "The act of representing oneself as another person online for malicious purposes.",
            "pos": "noun",
            "sent1": "The hacker's impersonation of a bank employee led to a security breach.",
            "sent2": "Online scammers often use impersonation to trick people into giving out personal information.",
            "sent3": "The impostor's impersonation of a celebrity on social media fooled many fans.",
            "sent4": "The spy's impersonation of a diplomat allowed them to gather sensitive information.",
            "sent5": "The criminal's impersonation of a police officer was so convincing, no one suspected a thing."
        }
    ]
}