{
    "term": "impinging",
    "meanings": [
        {
            "definition": "To have an effect or impact, especially a negative one.",
            "pos": "verb",
            "sent1": "The loud music from the party next door was impinging on my ability to concentrate.",
            "sent2": "The storm's strong winds impinging on the fragile tree branches caused them to break.",
            "sent3": "The mischievous squirrel impinging on the peaceful garden was scolded by the old gardener.",
            "sent4": "The harsh reality of the situation impinging on her dreams felt like a sudden storm in her mind.",
            "sent5": "The teacher's strict rules impinging on the students' freedom made the classroom feel suffocating."
        },
        {
            "definition": "To encroach or infringe upon something.",
            "pos": "verb",
            "sent1": "The construction site was impinging on the playground area, limiting the children's play space.",
            "sent2": "The new building was impinging on the neighbor's property line, causing a dispute.",
            "sent3": "The curious cat impinging on the dog's territory received a playful chase in return.",
            "sent4": "The invasive vine impinging on the garden fence seemed determined to take over the entire yard.",
            "sent5": "The overbearing rules were impinging on the employees' work-life balance, leading to frustration."
        },
        {
            "definition": "To collide or strike against something.",
            "pos": "verb",
            "sent1": "The basketball impinging against the backboard made a loud echoing sound in the empty gym.",
            "sent2": "The car's bumper impinging on the wall left a dent in the sturdy concrete.",
            "sent3": "The mischievous puppy impinging on the sleeping cat's tail caused a sudden yelp.",
            "sent4": "The crashing waves impinging on the rocky shore created a mesmerizing spray of water.",
            "sent5": "The hammer impinging on the nail with a loud bang echoed through the workshop."
        }
    ]
}