{
    "term": "imposition",
    "meanings": [
        {
            "definition": "The action or process of imposing something",
            "pos": "noun",
            "sent1": "The teacher's imposition of extra homework was unexpected.",
            "sent2": "The government's imposition of new taxes caused frustration among the citizens.",
            "sent3": "The imposition of wearing a silly hat to work made everyone laugh.",
            "sent4": "Her imposition of strict rules turned the house into a fortress.",
            "sent5": "The imposition of silence in the library was a stark reminder to keep quiet."
        },
        {
            "definition": "A burden or demand placed on someone",
            "pos": "noun",
            "sent1": "Carrying the heavy bags was an imposition on his tired arms.",
            "sent2": "The financial imposition of unexpected bills strained their budget.",
            "sent3": "The imposition of having to choose only one dessert felt like a sweet burden.",
            "sent4": "The emotional imposition of guilt weighed heavily on her conscience.",
            "sent5": "The imposition of responsibility on his young shoulders was overwhelming."
        },
        {
            "definition": "An unwelcome demand or burden",
            "pos": "noun",
            "sent1": "The sudden imposition of extra work ruined his weekend plans.",
            "sent2": "The imposition of attending the meeting on her day off was unwelcome.",
            "sent3": "The imposition of a surprise pop quiz made the students groan.",
            "sent4": "The imposition of a strict curfew felt like an unnecessary restriction.",
            "sent5": "The imposition of a long commute added to his already stressful day."
        },
        {
            "definition": "The act of laying on or imposing something on someone or something",
            "pos": "noun",
            "sent1": "The imposition of heavy books on the delicate table caused it to break.",
            "sent2": "The imposition of strict regulations on the industry stifled innovation.",
            "sent3": "The imposition of a new dress code at the office led to some interesting fashion choices.",
            "sent4": "The imposition of a heavy workload on the team strained their productivity.",
            "sent5": "The imposition of a new schedule disrupted the usual routine."
        }
    ]
}