{
    "term": "impound",
    "meanings": [
        {
            "definition": "To seize and take legal custody of something",
            "pos": "verb",
            "sent1": "The police had to impound the stolen car as evidence in the investigation.",
            "sent2": "The city impounded the stray dogs to ensure they were not a danger to the community.",
            "sent3": "The judge jokingly said he would impound all the noisy toys if the children didn't quiet down in court.",
            "sent4": "The new law allows authorities to impound any vehicles used in illegal activities.",
            "sent5": "The storm caused the river to rise and impound debris against the bridge, blocking the flow of water."
        },
        {
            "definition": "To confine or restrain",
            "pos": "verb",
            "sent1": "The zookeepers had to impound the injured elephant for its own safety.",
            "sent2": "The security guard impounded the troublemaker until the police arrived.",
            "sent3": "The mischievous cat managed to impound itself in the closet and couldn't find its way out.",
            "sent4": "Her fear seemed to impound her thoughts, making it hard to focus on anything else.",
            "sent5": "The heavy chains impound the gate, preventing anyone from entering without permission."
        },
        {
            "definition": "A place where animals are kept in custody",
            "pos": "noun",
            "sent1": "The animal shelter served as an impound for stray dogs and cats.",
            "sent2": "The impound was filled with barking and meowing as the animals awaited adoption.",
            "sent3": "The children loved visiting the impound to play with the puppies and kittens.",
            "sent4": "The impound had separate sections for dogs and cats to keep them comfortable.",
            "sent5": "The impound provided temporary care for lost pets until their owners could be found."
        }
    ]
}