{
    "term": "impotence",
    "meanings": [
        {
            "definition": "Lack of power or ability to perform",
            "pos": "noun",
            "sent1": "His impotence in the face of danger left him feeling helpless.",
            "sent2": "The king's impotence to make decisions led to chaos in the kingdom.",
            "sent3": "The impotence of the tiny kitten trying to open the heavy door was both cute and frustrating.",
            "sent4": "The impotence of the old machine became evident when it failed to start for the tenth time.",
            "sent5": "The impotence of the flashlight's dying batteries left them in darkness."
        },
        {
            "definition": "Inability to achieve or maintain an erection",
            "pos": "noun",
            "sent1": "His impotence made him embarrassed to seek help for his condition.",
            "sent2": "The doctor explained that impotence could be caused by various health issues.",
            "sent3": "The comedian joked about his impotence in fixing things around the house, making the audience laugh.",
            "sent4": "The impotence of the broken clock to keep time symbolized the passing of an era.",
            "sent5": "The impotence of the dam to hold back the floodwaters was a disaster waiting to happen."
        },
        {
            "definition": "Ineffectiveness or weakness in action or expression",
            "pos": "noun",
            "sent1": "The impotence of his arguments failed to convince anyone in the room.",
            "sent2": "The impotence of the old engine resulted in frequent breakdowns on the road.",
            "sent3": "The impotence of the scarecrow to scare away birds was evident as they perched on its arms.",
            "sent4": "The impotence of the pen running out of ink halted the student's note-taking in the middle of the lecture.",
            "sent5": "The impotence of the weak bridge to support heavy trucks led to its collapse during rush hour."
        }
    ]
}