{
    "term": "impregnator",
    "meanings": [
        {
            "definition": "A person who impregnates someone.",
            "pos": "noun",
            "sent1": "The impregnator was overjoyed to hear the news of impending fatherhood.",
            "sent2": "The impregnator took responsibility for his actions and supported the mother-to-be.",
            "sent3": "The impregnator joked that he had a 'magic touch' when it came to starting a family.",
            "sent4": "He was like a skilled impregnator, planting the seeds of new life wherever he went.",
            "sent5": "The impregnator's presence at the baby shower was a reminder of the upcoming arrival."
        },
        {
            "definition": "A substance that causes impregnation.",
            "pos": "noun",
            "sent1": "The impregnator was carefully applied to the fabric to make it water-resistant.",
            "sent2": "The impregnator enhanced the durability of the wood by protecting it from moisture.",
            "sent3": "The impregnator spilled on the floor, creating a slippery surface that led to comical falls.",
            "sent4": "The impregnator seeped into the cracks, fortifying the structure with unseen strength.",
            "sent5": "The impregnator's effect was evident as the material repelled all liquids effortlessly."
        },
        {
            "definition": "To make pregnant.",
            "pos": "verb",
            "sent1": "He hoped to impregnator his partner and start a family together.",
            "sent2": "The doctor advised her to avoid certain foods that could impregnator her during pregnancy.",
            "sent3": "The unexpected news seemed to impregnator the room with a sense of excitement.",
            "sent4": "Her words had the power to impregnator the minds of those who listened, leaving a lasting impact.",
            "sent5": "The warm embrace of the sun seemed to impregnator the flowers with new life each morning."
        }
    ]
}