{
    "term": "imprint",
    "meanings": [
        {
            "definition": "A mark or indentation made by pressure",
            "pos": "noun",
            "sent1": "The imprint of the coin was left on the soft clay.",
            "sent2": "She noticed the imprint of her shoe on the sandy beach.",
            "sent3": "The puppy's playful paws left an imprint on the muddy floor.",
            "sent4": "The imprint of history can be seen in the ancient ruins.",
            "sent5": "The imprint of the seal on the document made it official."
        },
        {
            "definition": "To establish firmly in the mind or memory",
            "pos": "verb",
            "sent1": "The teacher tried to imprint the lesson in the students' minds.",
            "sent2": "Her grandmother's wise words were imprinted in her memory.",
            "sent3": "He jokingly tried to imprint the silly dance moves in his friend's mind.",
            "sent4": "The beautiful scenery imprinted itself in her mind forever.",
            "sent5": "The traumatic experience imprinted a fear that lingered."
        },
        {
            "definition": "To produce a mark or pattern on a surface",
            "pos": "verb",
            "sent1": "The artist used a stamp to imprint the design on the paper.",
            "sent2": "The heavy object accidentally imprinted a dent on the wooden table.",
            "sent3": "The child tried to imprint their handprint on the wet cement.",
            "sent4": "The logo was imprinted on the product packaging.",
            "sent5": "The tire tracks imprinted a trail in the soft mud."
        },
        {
            "definition": "A lasting effect or influence",
            "pos": "noun",
            "sent1": "The mentor's guidance had a positive imprint on her career.",
            "sent2": "The singer's performance left a lasting imprint on the audience.",
            "sent3": "The comedian's jokes had a humorous imprint on the crowd.",
            "sent4": "The leader's vision left an inspiring imprint on the organization.",
            "sent5": "The author's words had a profound imprint on the reader's thoughts."
        }
    ]
}