{
    "term": "incapacitated",
    "meanings": [
        {
            "definition": "Deprived of strength or power",
            "pos": "adjective",
            "sent1": "After the long journey, the tired hiker felt incapacitated and could not take another step.",
            "sent2": "The injured athlete was incapacitated and had to sit out the game.",
            "sent3": "The sleepy cat looked incapacitated as it struggled to keep its eyes open.",
            "sent4": "The old car's engine sputtered and coughed, leaving it incapacitated on the side of the road.",
            "sent5": "The storm's strong winds left the trees incapacitated, their branches broken and scattered."
        },
        {
            "definition": "Unable to act or respond",
            "pos": "adjective",
            "sent1": "During the exam, the nervous student felt incapacitated and couldn't remember the answers.",
            "sent2": "The frozen computer screen left the frustrated user feeling incapacitated.",
            "sent3": "The sleepy sloth seemed incapacitated, barely moving from its spot on the tree.",
            "sent4": "The silence in the room was so heavy, it felt like a thick fog, leaving everyone incapacitated.",
            "sent5": "The sudden power outage left the entire building incapacitated, with darkness enveloping every corner."
        },
        {
            "definition": "Made incapable or unfit",
            "pos": "adjective",
            "sent1": "The expired medicine was now incapacitated and no longer effective.",
            "sent2": "The broken lock on the door left the house vulnerable and incapacitated.",
            "sent3": "The clumsy magician's failed trick left him looking incapacitated in front of the audience.",
            "sent4": "The rusted gears in the clock tower were now incapacitated, unable to keep time.",
            "sent5": "The leak in the boat's hull left it incapacitated, slowly taking in water."
        }
    ]
}