{
    "term": "incendiary",
    "meanings": [
        {
            "definition": "Designed to cause fires.",
            "pos": "adjective",
            "sent1": "The incendiary device ignited the building.",
            "sent2": "The firefighters quickly extinguished the incendiary blaze.",
            "sent3": "The prankster's incendiary antics with matches got him in trouble.",
            "sent4": "Her words were like incendiary sparks in the heated argument.",
            "sent5": "The incendiary nature of the fireworks display left everyone in awe."
        },
        {
            "definition": "A person who starts fires.",
            "pos": "noun",
            "sent1": "The authorities were searching for the incendiary responsible for the forest fire.",
            "sent2": "The detective suspected the new neighbor might be an incendiary.",
            "sent3": "The clumsy incendiary accidentally set off the smoke alarm while cooking.",
            "sent4": "The incendiary's actions left a trail of destruction in the neighborhood.",
            "sent5": "The captured incendiary confessed to starting multiple fires in the area."
        },
        {
            "definition": "A device or substance that causes fires.",
            "pos": "noun",
            "sent1": "The firefighters used a special incendiary to control the wildfire.",
            "sent2": "The arsonist's incendiary of choice was a homemade explosive.",
            "sent3": "The movie villain's secret weapon was an incendiary hidden in his cane.",
            "sent4": "The incendiary left behind a distinct chemical trace at the crime scene.",
            "sent5": "The military unit carried incendiaries to create a diversion during the mission."
        },
        {
            "definition": "Tending to stir up conflict or violence.",
            "pos": "adjective",
            "sent1": "The politician's incendiary remarks sparked outrage among the crowd.",
            "sent2": "The journalist's article was criticized for its incendiary language.",
            "sent3": "The comedian's incendiary jokes caused a stir at the event.",
            "sent4": "The incendiary social media post led to a heated debate online.",
            "sent5": "The incendiary behavior of the rival gangs escalated the tension in the city."
        }
    ]
}