{
    "term": "inclusion",
    "meanings": [
        {
            "definition": "The action or state of including or of being included.",
            "pos": "noun",
            "sent1": "In the classroom, the teacher promotes inclusion by encouraging all students to participate.",
            "sent2": "The company's policy on inclusion ensures that everyone's ideas are valued.",
            "sent3": "During the game, the team's spirit of inclusion led to everyone feeling like they belonged.",
            "sent4": "Inclusion is like a warm hug that wraps around everyone, making them feel accepted.",
            "sent5": "The concept of inclusion is like a colorful mosaic, where each piece adds to the beauty of the whole."
        },
        {
            "definition": "The act of including someone or something in a group or structure.",
            "pos": "noun",
            "sent1": "The manager's decision to promote inclusion in the team boosted morale.",
            "sent2": "In the family reunion, everyone felt the warmth of inclusion as they shared stories.",
            "sent3": "The inclusion of the shy student in the drama club brought out their hidden talent.",
            "sent4": "Inclusion is like a key that unlocks the door to a sense of belonging.",
            "sent5": "The power of inclusion is like a magnet that draws people together in unity."
        },
        {
            "definition": "The state of being included.",
            "pos": "noun",
            "sent1": "The student's happiness showed the positive impact of inclusion in the class.",
            "sent2": "In the team, everyone celebrated the feeling of inclusion after a successful project.",
            "sent3": "The inclusion of the new member brought fresh ideas to the group.",
            "sent4": "Inclusion is like a spotlight that shines on each individual, highlighting their worth.",
            "sent5": "The beauty of inclusion is like a garden where every flower blooms in harmony."
        }
    ]
}