{
    "term": "inclusively",
    "meanings": [
        {
            "definition": "Including all the services or items normally expected or required.",
            "pos": "adjective",
            "sent1": "The all-inclusive vacation package covered everything we needed for our trip.",
            "sent2": "The hotel offers an inclusive deal that includes meals and activities.",
            "sent3": "The inclusive party package had everything from decorations to music.",
            "sent4": "Her inclusive approach to teamwork made everyone feel valued and important.",
            "sent5": "The inclusive school environment welcomed students of all abilities with open arms."
        },
        {
            "definition": "Including the stated limit or extremes in consideration or account.",
            "pos": "adjective",
            "sent1": "The budget proposal was all-inclusive, accounting for every possible expense.",
            "sent2": "The survey was designed to be inclusive of all opinions, even the most extreme ones.",
            "sent3": "The inclusive guest list for the party included both the quietest and the loudest friends.",
            "sent4": "Her inclusive decision-making process ensured that all viewpoints were taken into account.",
            "sent5": "The inclusive approach to problem-solving considered even the most unlikely solutions."
        },
        {
            "definition": "Including the limits or extremes in consideration or account.",
            "pos": "adjective",
            "sent1": "The weather forecast was inclusive of the highest and lowest temperatures for the week.",
            "sent2": "The report was inclusive of all possible scenarios, from best to worst case.",
            "sent3": "The inclusive seating plan accounted for both the tallest and shortest guests.",
            "sent4": "Her inclusive perspective on the issue considered both ends of the spectrum.",
            "sent5": "The inclusive timeline covered all possible delays and advancements."
        }
    ]
}