{
    "term": "incorporeally",
    "meanings": [
        {
            "definition": "In a way that lacks a physical body or form.",
            "pos": "adverb",
            "sent1": "She floated incorporeally through the room, her presence barely felt.",
            "sent2": "The ghost moved incorporeally through the walls, unseen by all.",
            "sent3": "The idea of time slipping incorporeally through our fingers is both fascinating and unsettling.",
            "sent4": "His incorporeal voice echoed incorporeally in the empty hall, sending shivers down our spines.",
            "sent5": "The mist enveloped the landscape incorporeally, creating an ethereal atmosphere."
        },
        {
            "definition": "Without a physical presence.",
            "pos": "adjective",
            "sent1": "The ghostly figure appeared incorporeally in the moonlight, sending chills down our spines.",
            "sent2": "The incorporeal entity seemed to pass through solid objects effortlessly.",
            "sent3": "The magician's trick made the coin disappear incorporeally, leaving the audience in awe.",
            "sent4": "Her incorporeal beauty seemed to shine brighter than any physical attribute.",
            "sent5": "The incorporeal music filled the room, captivating everyone with its haunting melody."
        },
        {
            "definition": "In a manner that is not tangible or material.",
            "pos": "adverb",
            "sent1": "The dream slipped incorporeally through her mind, leaving a sense of longing.",
            "sent2": "The concept of love exists incorporeally, yet its effects are deeply felt.",
            "sent3": "The idea of time passing incorporeally made him appreciate each moment more.",
            "sent4": "Her laughter rang incorporeally in the air, bringing joy to all who heard it.",
            "sent5": "The memories of childhood floated incorporeally in his mind, vivid and nostalgic."
        }
    ]
}