{
    "term": "incompressible",
    "meanings": [
        {
            "definition": "Unable to be compressed.",
            "pos": "adjective",
            "sent1": "The rock was incompressible, no matter how hard I tried to squish it.",
            "sent2": "The foam material used in the packaging is incompressible to protect fragile items.",
            "sent3": "I joked that my backpack was incompressible because I couldn't fit anything else in it.",
            "sent4": "Her determination was like an incompressible force, impossible to diminish.",
            "sent5": "The steel beams were as incompressible as a solid wall, unyielding to pressure."
        },
        {
            "definition": "Not capable of being squeezed into a smaller space.",
            "pos": "adjective",
            "sent1": "The balloon was incompressible, refusing to shrink no matter how much I pushed.",
            "sent2": "The suitcase was incompressible, making it difficult to fit in the overhead compartment.",
            "sent3": "I found it funny how my cat acted incompressible when I tried to put her in a small box.",
            "sent4": "His stubbornness was like an incompressible block, impossible to change.",
            "sent5": "The memory foam pillow was as incompressible as a brick, providing firm support."
        },
        {
            "definition": "Resistant to being reduced in volume.",
            "pos": "adjective",
            "sent1": "The air mattress was incompressible, staying full and firm all night.",
            "sent2": "The sponge was incompressible, always returning to its original size after squeezing.",
            "sent3": "I playfully called my friend incompressible because he never budged on his opinions.",
            "sent4": "Her love for animals was like an incompressible spring, always bouncing back.",
            "sent5": "The gel material was as incompressible as a solid block, maintaining its shape under pressure."
        }
    ]
}