{
    "term": "inconsiderate",
    "meanings": [
        {
            "definition": "Thoughtless or lacking concern for others.",
            "pos": "adjective",
            "sent1": "She was being inconsiderate when she talked loudly during the movie.",
            "sent2": "It is inconsiderate to interrupt someone while they are speaking.",
            "sent3": "The inconsiderate driver honked loudly at the slow-moving turtle crossing the road.",
            "sent4": "His inconsiderate behavior towards his classmates left them feeling hurt and ignored.",
            "sent5": "The inconsiderate guest left a mess behind without cleaning up after themselves."
        },
        {
            "definition": "Not showing regard for the feelings or needs of others.",
            "pos": "adjective",
            "sent1": "It was inconsiderate of him to ignore her birthday and not even send a card.",
            "sent2": "Being inconsiderate of others' time can lead to strained relationships.",
            "sent3": "The inconsiderate cat knocked over the vase and walked away without a care.",
            "sent4": "Her inconsiderate remarks hurt his feelings and made him question their friendship.",
            "sent5": "The inconsiderate neighbor played loud music late into the night, disturbing everyone's sleep."
        },
        {
            "definition": "Acting without consideration for the consequences of one's actions.",
            "pos": "adjective",
            "sent1": "His inconsiderate decision to drive recklessly resulted in a car accident.",
            "sent2": "Being inconsiderate of safety rules can lead to dangerous situations.",
            "sent3": "The inconsiderate chef added too much salt to the dish, ruining the flavor.",
            "sent4": "The inconsiderate gambler bet all his money without thinking about the risks involved.",
            "sent5": "The inconsiderate hiker left trash on the trail, harming the environment."
        }
    ]
}