{
    "term": "incontrovertible",
    "meanings": [
        {
            "definition": "Not able to be denied or disputed.",
            "pos": "adjective",
            "sent1": "The evidence was incontrovertible, showing clearly who was at fault.",
            "sent2": "Her logic was so incontrovertible that no one could argue against it.",
            "sent3": "It was incontrovertible that the cat had stolen the dog's toy, leaving paw prints all over it.",
            "sent4": "The beauty of the sunset was incontrovertible, painting the sky in vibrant hues.",
            "sent5": "The teacher's explanation was so clear and incontrovertible that even the youngest students understood."
        },
        {
            "definition": "Indisputable.",
            "pos": "adjective",
            "sent1": "The fact that she was the winner was incontrovertible, as her name was clearly written on the trophy.",
            "sent2": "The team's victory was incontrovertible, with a lead that no one could challenge.",
            "sent3": "It was incontrovertible that the clown's shoes were too big for his feet, causing him to trip comically.",
            "sent4": "The bond between the siblings was incontrovertible, unbreakable like a chain of steel.",
            "sent5": "The taste of the freshly baked cookies was incontrovertible, making everyone crave more."
        },
        {
            "definition": "Unquestionable.",
            "pos": "adjective",
            "sent1": "The decision to cancel the event was incontrovertible, given the severe weather forecast.",
            "sent2": "His loyalty to his friends was incontrovertible, always standing by them in times of need.",
            "sent3": "It was incontrovertible that the cat believed it was the ruler of the house, sitting on the throne-like armchair.",
            "sent4": "The impact of the speech was incontrovertible, shaking the audience to their core.",
            "sent5": "The aroma of the freshly brewed coffee was incontrovertible, filling the room with warmth and comfort."
        }
    ]
}