{
    "term": "incrustations",
    "meanings": [
        {
            "definition": "A hard coating or crust formed on the surface of something.",
            "pos": "noun",
            "sent1": "The ancient artifact had intricate incrustations that sparkled in the sunlight.",
            "sent2": "The ship's hull was covered in incrustations from years of exposure to saltwater.",
            "sent3": "The cake decorator added edible incrustations to the dessert, making it look like a work of art.",
            "sent4": "Her mind was a treasure trove of memories, each one a precious incrustation in the vast sea of her thoughts.",
            "sent5": "The castle walls were adorned with beautiful incrustations that told stories of the past."
        },
        {
            "definition": "The act of encrusting or being encrusted.",
            "pos": "noun",
            "sent1": "The slow process of incrustations forming on the rocks fascinated the geologist.",
            "sent2": "The incrustations of ice on the window melted under the warm sun.",
            "sent3": "The artist's playful incrustations of glitter on the painting added a whimsical touch.",
            "sent4": "His heart felt heavy with the incrustations of sorrow that had built up over time.",
            "sent5": "The garden gnome's hat was adorned with colorful incrustations that caught the eye."
        },
        {
            "definition": "Something that is encrusted or covered with a hard coating.",
            "pos": "noun",
            "sent1": "The diver discovered a chest on the ocean floor with mysterious incrustations.",
            "sent2": "The old statue in the park had green incrustations on its surface.",
            "sent3": "The car enthusiast polished the chrome incrustations on his vintage vehicle.",
            "sent4": "Her laughter was like a bright light breaking through the dark incrustations of despair.",
            "sent5": "The ancient sword was a masterpiece with intricate incrustations along its blade."
        }
    ]
}