{
    "term": "incuriousness",
    "meanings": [
        {
            "definition": "Lack of curiosity or interest.",
            "pos": "noun",
            "sent1": "Her incuriousness about the world around her often led to missed opportunities.",
            "sent2": "His incuriousness towards new ideas made it challenging for him to adapt to change.",
            "sent3": "The cat's incuriousness towards the mouse playing in front of it was comical.",
            "sent4": "The incuriousness of the closed-off city left visitors feeling disconnected from its history.",
            "sent5": "The incuriousness of the student was like a locked door, preventing new knowledge from entering."
        },
        {
            "definition": "Apathy or disinterest.",
            "pos": "noun",
            "sent1": "The incuriousness of the audience made the speaker feel unappreciated.",
            "sent2": "She couldn't hide her incuriousness during the boring lecture.",
            "sent3": "His incuriousness towards the movie plot resulted in him falling asleep in the cinema.",
            "sent4": "The incuriousness of the crowd dampened the excitement of the event.",
            "sent5": "The teacher's incuriousness towards the students' progress was concerning to the parents."
        },
        {
            "definition": "Unwillingness to investigate or explore.",
            "pos": "noun",
            "sent1": "The detective's incuriousness about the new evidence puzzled his colleagues.",
            "sent2": "Her incuriousness towards the mysterious noise in the attic left the problem unsolved.",
            "sent3": "The incuriousness of the hiker led him to miss the hidden waterfall along the trail.",
            "sent4": "The incuriousness of the scientist hindered the discovery of a groundbreaking theory.",
            "sent5": "The incuriousness of the explorer prevented him from finding the hidden treasure in the cave."
        }
    ]
}