{
    "term": "indeclinable",
    "meanings": [
        {
            "definition": "Not capable of being declined or varied in form.",
            "pos": "adjective",
            "sent1": "The shape of a circle is indeclinable; it always remains the same.",
            "sent2": "The mountain's height is indeclinable; it does not change over time.",
            "sent3": "The robot's indeclinable design made it impossible to transform into anything else.",
            "sent4": "Her love for him was as indeclinable as the North Star, unwavering and constant.",
            "sent5": "The indeclinable truth of nature is that the sun will rise every morning without fail."
        },
        {
            "definition": "Not subject to decline or decrease.",
            "pos": "adjective",
            "sent1": "His enthusiasm for the project was indeclinable; it only grew stronger with each passing day.",
            "sent2": "The company's profits remained indeclinable despite the economic downturn.",
            "sent3": "The indeclinable supply of cookies in the jar mysteriously never seemed to diminish.",
            "sent4": "Their friendship was indeclinable, like a sturdy oak tree standing tall through all seasons.",
            "sent5": "The indeclinable bond between mother and child is unbreakable and enduring."
        },
        {
            "definition": "Not changing or varying.",
            "pos": "adjective",
            "sent1": "The indeclinable pattern on the wallpaper repeated itself without any alteration.",
            "sent2": "The temperature in the room remained indeclinable, neither rising nor falling.",
            "sent3": "The indeclinable routine of his daily life became a source of comfort and stability.",
            "sent4": "Her voice was as indeclinable as a melody that never strayed from its original tune.",
            "sent5": "The indeclinable rhythm of the waves crashing on the shore lulled her into a peaceful sleep."
        }
    ]
}