{
    "term": "indestructible",
    "meanings": [
        {
            "definition": "Not able to be destroyed or damaged.",
            "pos": "adjective",
            "sent1": "The superhero's shield was indestructible, protecting him from any harm.",
            "sent2": "The diamond is known for being indestructible, lasting for generations without a scratch.",
            "sent3": "The toddler proudly declared his toy truck indestructible, despite it being made of cardboard.",
            "sent4": "Her spirit was as indestructible as a fortress, standing strong against any adversity.",
            "sent5": "The ancient castle walls stood tall and indestructible, a testament to the craftsmanship of the past."
        },
        {
            "definition": "Incapable of being broken down or decomposed.",
            "pos": "adjective",
            "sent1": "The plastic bottle claimed to be indestructible, lasting for years without degrading.",
            "sent2": "The ancient artifact was made of a material that proved indestructible over time.",
            "sent3": "The rumor about the eternal gum being indestructible turned out to be true.",
            "sent4": "Their friendship was like an indestructible bond, unbreakable even in the toughest times.",
            "sent5": "The metal statue in the park stood tall and indestructible, a symbol of endurance and strength."
        },
        {
            "definition": "Immune to destruction or harm.",
            "pos": "adjective",
            "sent1": "The magical amulet was said to make its wearer indestructible, impervious to any attack.",
            "sent2": "The ancient scroll contained a spell that could make objects indestructible.",
            "sent3": "The cat believed its nine lives made it indestructible, fearlessly taking on any challenge.",
            "sent4": "His optimism was like an indestructible shield, protecting him from negativity.",
            "sent5": "The legendary hero's sword was truly indestructible, never losing its sharp edge in battle."
        }
    ]
}