{
    "term": "indefeasible",
    "meanings": [
        {
            "definition": "Not capable of being annulled or voided.",
            "pos": "adjective",
            "sent1": "The contract was indefeasible, meaning it could not be canceled.",
            "sent2": "Her love for her family was indefeasible and unwavering.",
            "sent3": "The cat's claim to the sunny spot by the window was indefeasible, much to the dog's dismay.",
            "sent4": "His determination to succeed was as indefeasible as a mountain standing firm against the wind.",
            "sent5": "The knight's loyalty to his king was indefeasible, shining brightly through all challenges."
        },
        {
            "definition": "Not subject to being lost or forfeited.",
            "pos": "adjective",
            "sent1": "The title deed to the land was indefeasible, ensuring it could not be taken away.",
            "sent2": "Her friendship was indefeasible, lasting through thick and thin.",
            "sent3": "The student's claim to the last cookie was indefeasible, leading to a playful tug-of-war.",
            "sent4": "The bond between the siblings was as indefeasible as the unbreakable chain of time.",
            "sent5": "The ancient artifact's historical value was indefeasible, preserving its significance for generations to come."
        },
        {
            "definition": "Not able to be disputed or challenged.",
            "pos": "adjective",
            "sent1": "The scientific evidence presented was indefeasible, leaving no room for doubt.",
            "sent2": "His reputation for honesty was indefeasible, earning him trust from all around.",
            "sent3": "The cat's claim to the title of 'best napper' was indefeasible, much to the amusement of the household.",
            "sent4": "Her logic was as indefeasible as the laws of nature, undeniable and solid.",
            "sent5": "The warrior's courage was indefeasible, inspiring all who witnessed his bravery."
        }
    ]
}