{
    "term": "indigestions",
    "meanings": [
        {
            "definition": "Difficulty in digesting food.",
            "pos": "noun",
            "sent1": "Her indigestions made it hard for her to eat certain foods.",
            "sent2": "After eating too quickly, he experienced indigestions and felt uncomfortable.",
            "sent3": "The party food caused indigestions for many guests, leading to some funny faces.",
            "sent4": "His mind was a whirlwind of thoughts, a storm of indigestions that he couldn't calm.",
            "sent5": "The indigestions felt like a heavy rock in her stomach, weighing her down."
        },
        {
            "definition": "A condition of being unable to digest food properly.",
            "pos": "noun",
            "sent1": "The doctor diagnosed him with chronic indigestions, requiring a strict diet.",
            "sent2": "She suffered from indigestions after every meal, feeling bloated and uncomfortable.",
            "sent3": "His indigestions were so bad that he joked about needing a food translator.",
            "sent4": "The city's traffic was like a congested road of indigestions, causing delays and frustration.",
            "sent5": "The indigestions in her stomach felt like a tangled knot, impossible to unravel."
        },
        {
            "definition": "A feeling of discomfort or pain in the stomach due to difficulty in digesting food.",
            "pos": "noun",
            "sent1": "The spicy meal gave him indigestions, leaving him regretting his choice.",
            "sent2": "She rubbed her stomach, trying to soothe the indigestions caused by the rich dessert.",
            "sent3": "The indigestions from the buffet left him feeling like a balloon about to pop.",
            "sent4": "The tension in the room created indigestions, making everyone uneasy.",
            "sent5": "The indigestions felt like a fire burning in her stomach, demanding attention."
        }
    ]
}