{
    "term": "indigoes",
    "meanings": [
        {
            "definition": "A deep blue color",
            "pos": "noun",
            "sent1": "The sky at dusk displayed beautiful indigoes.",
            "sent2": "She painted her room in calming indigoes.",
            "sent3": "The artist mixed the indigoes with white to create a lighter shade.",
            "sent4": "His eyes sparkled like indigoes in the sunlight.",
            "sent5": "The indigoes of the ocean mesmerized the onlookers."
        },
        {
            "definition": "A type of plant used for dyeing",
            "pos": "noun",
            "sent1": "The indigoes plant grew abundantly in the garden.",
            "sent2": "Farmers harvested the indigoes for their dyeing purposes.",
            "sent3": "The indigoes plant seemed to wave in the breeze, as if greeting visitors.",
            "sent4": "The indigoes plant was a treasure trove for the textile industry.",
            "sent5": "The indigoes plant's leaves held the secret to vibrant colors."
        },
        {
            "definition": "A dye obtained from certain plants",
            "pos": "noun",
            "sent1": "The indigoes dye was extracted carefully to preserve its quality.",
            "sent2": "Artisans used the indigoes dye to color fabrics with precision.",
            "sent3": "The indigoes dye spilled on the floor, creating a unique pattern.",
            "sent4": "Her dress was adorned with intricate patterns made from indigoes dye.",
            "sent5": "The indigoes dye infused the fabric with a rich hue."
        },
        {
            "definition": "A blue dye used in coloring textiles",
            "pos": "noun",
            "sent1": "The indigoes dye transformed the plain fabric into a work of art.",
            "sent2": "The fashion designer chose indigoes dye for its vibrant shade.",
            "sent3": "The indigoes dye seemed to dance on the fabric as it was applied.",
            "sent4": "The indigoes dye brought life to the once dull cloth.",
            "sent5": "The indigoes dye spread across the fabric like a river of color."
        }
    ]
}