{
    "term": "inductile",
    "meanings": [
        {
            "definition": "Not capable of being molded or shaped easily.",
            "pos": "adjective",
            "sent1": "The hard metal was so inductile that the sculptor struggled to create any form from it.",
            "sent2": "The clay was soft and pliable, unlike the inductile metal that refused to bend.",
            "sent3": "Trying to mold the inductile material was like attempting to sculpt a rock.",
            "sent4": "Her stubborn personality was as inductile as the unyielding metal.",
            "sent5": "The inductile substance resisted any attempt to change its shape, like a solid block of ice."
        },
        {
            "definition": "Not easily influenced or persuaded.",
            "pos": "adjective",
            "sent1": "Despite their best efforts, the inductile child refused to listen to reason.",
            "sent2": "She remained inductile to their suggestions, sticking to her own opinions.",
            "sent3": "The inductile puppy ignored all attempts to train it, determined to do things its own way.",
            "sent4": "His inductile attitude was like a wall, impossible to break through.",
            "sent5": "Her inductile nature made it challenging to change her mind, like trying to move a mountain."
        },
        {
            "definition": "Not able to conduct electricity.",
            "pos": "adjective",
            "sent1": "The plastic material was inductile, making it safe to use in electrical devices.",
            "sent2": "Unlike metals, which conduct electricity, the inductile material acted as an insulator.",
            "sent3": "The inductile wire prevented the flow of electricity, ensuring safety in the circuit.",
            "sent4": "The inductile coating on the cable protected against electrical shocks.",
            "sent5": "The inductile substance blocked the passage of electricity, like a barrier in a circuit."
        }
    ]
}