{
    "term": "indurate",
    "meanings": [
        {
            "definition": "To make hard or resistant to pressure",
            "pos": "verb",
            "sent1": "After years of working in construction, his hands became indurate from handling rough materials.",
            "sent2": "The blacksmith used intense heat to indurate the metal and create a strong sword.",
            "sent3": "The stubborn old mule seemed indurate to any attempts to change its path.",
            "sent4": "Her heart had indurated over time, making it difficult for her to trust others.",
            "sent5": "The ancient ruins stood indurate against the test of time, showing the strength of the civilization."
        },
        {
            "definition": "To make callous or unfeeling",
            "pos": "verb",
            "sent1": "Constant exposure to violence can indurate a person's emotions, making them less sensitive.",
            "sent2": "The cruel treatment of the prisoners only served to indurate the guards further.",
            "sent3": "Despite his gruff exterior, his actions revealed a heart that was not completely indurate.",
            "sent4": "The harsh words seemed to indurate her feelings towards him, causing a rift in their relationship.",
            "sent5": "The tragic events had indurated her soul, leaving her numb to the world's suffering."
        },
        {
            "definition": "Hardened or unfeeling in attitude or opinion",
            "pos": "adjective",
            "sent1": "The indurate politician refused to consider any compromise, sticking firmly to his beliefs.",
            "sent2": "Her indurate demeanor made it challenging for others to approach her with differing views.",
            "sent3": "Despite his indurate exterior, he had a soft spot for stray animals, showing a different side of him.",
            "sent4": "The indurate rock formations stood tall against the elements, unmoved by the passing storms.",
            "sent5": "His indurate stance on the issue alienated many of his former supporters, causing a rift in the community."
        }
    ]
}