{
    "term": "infields",
    "meanings": [
        {
            "definition": "The area of a baseball field that is enclosed by the bases and home plate.",
            "pos": "noun",
            "sent1": "During the game, the players often gather in the infields to strategize.",
            "sent2": "The coach instructed the team to practice fielding ground balls in the infields.",
            "sent3": "The infields looked like a cozy spot for a picnic, but they were too dusty for that.",
            "sent4": "The infields were like a magnet for the players, drawing them in with its green grass.",
            "sent5": "The infields were the heart of the baseball field, bustling with action and energy."
        },
        {
            "definition": "To move a player from the outfield to the infield.",
            "pos": "verb",
            "sent1": "The coach decided to infields the outfielder to strengthen the defense.",
            "sent2": "In the last inning, the team had to infields their best outfielder due to an injury.",
            "sent3": "The outfielder was surprised when asked to infields, but he did his best in the new position.",
            "sent4": "The decision to infields the player paid off as they made a crucial catch in the infield.",
            "sent5": "The coach's strategy to infields the player changed the dynamics of the game."
        },
        {
            "definition": "The infielders on a baseball team.",
            "pos": "noun",
            "sent1": "The infields practiced double plays to improve their coordination on the field.",
            "sent2": "During the game, the infields showed great teamwork in catching pop flies.",
            "sent3": "One of the infields made a funny face to distract the batter during the game.",
            "sent4": "The infields were like a wall, stopping every ball that came their way.",
            "sent5": "The infields' gloves were worn out from all the catches they made during the season."
        }
    ]
}