{
    "term": "infidelic",
    "meanings": [
        {
            "definition": "Relating to or characteristic of infidels.",
            "pos": "adjective",
            "sent1": "The infidelic beliefs of the ancient tribe were different from those of the neighboring clans.",
            "sent2": "Her infidelic behavior at the temple raised eyebrows among the devout worshippers.",
            "sent3": "Despite his infidelic ways, he was always welcomed with open arms by the community.",
            "sent4": "The infidelic nature of the new art form challenged traditional views and sparked controversy.",
            "sent5": "The infidelic symbols on the ancient artifact puzzled archaeologists for years."
        },
        {
            "definition": "Showing a lack of faith or belief in a particular religion.",
            "pos": "adjective",
            "sent1": "The infidelic man refused to participate in any religious ceremonies.",
            "sent2": "Her infidelic attitude towards the church made her an outcast in the village.",
            "sent3": "Despite his infidelic tendencies, he always respected others' beliefs.",
            "sent4": "The infidelic storm destroyed the old church, leaving only ruins behind.",
            "sent5": "His infidelic remarks about the holy book offended many of the faithful."
        },
        {
            "definition": "Behaving in a manner contrary to religious beliefs or teachings.",
            "pos": "adjective",
            "sent1": "Her infidelic actions during the ceremony shocked the entire congregation.",
            "sent2": "The infidelic rituals of the cult were condemned by the mainstream religious leaders.",
            "sent3": "Despite his infidelic behavior, he claimed to be a devout follower of his faith.",
            "sent4": "The infidelic dance performance was deemed sacrilegious by the elders.",
            "sent5": "The infidelic display of disrespect towards the sacred relics angered the priests."
        }
    ]
}