{
    "term": "inflationary",
    "meanings": [
        {
            "definition": "Relating to or characterized by inflation.",
            "pos": "adjective",
            "sent1": "The inflationary prices made it hard for families to afford groceries.",
            "sent2": "The government took measures to control inflationary pressures on the economy.",
            "sent3": "The balloon animal artist created an inflationary poodle that kept growing in size!",
            "sent4": "Her laughter was like an inflationary bubble, spreading joy everywhere.",
            "sent5": "The teacher used an inflationary example to explain the concept of rising prices to the students."
        },
        {
            "definition": "Tending to cause inflation.",
            "pos": "adjective",
            "sent1": "His careless spending habits had an inflationary effect on the economy.",
            "sent2": "The company's decision to increase prices was inflationary in nature.",
            "sent3": "The chef's secret sauce had an inflationary impact on the taste buds, making everyone crave more.",
            "sent4": "The artist's bold strokes were like an inflationary force, elevating the value of the painting.",
            "sent5": "The rumor of a shortage had an inflationary influence on the demand for the product."
        },
        {
            "definition": "Showing signs of inflation.",
            "pos": "adjective",
            "sent1": "The inflationary trends in the housing market worried potential buyers.",
            "sent2": "The report highlighted the inflationary indicators in the stock market.",
            "sent3": "The garden gnome's hat had an inflationary appearance, looking like it was about to pop off.",
            "sent4": "Her excitement was like an inflationary gauge, rising steadily as the event approached.",
            "sent5": "The clouds had an inflationary look, growing bigger and puffier as the day went on."
        }
    ]
}