{
    "term": "inflections",
    "meanings": [
        {
            "definition": "A change in the form of a word that indicates a grammatical distinction, such as number, gender, tense, etc.",
            "pos": "noun",
            "sent1": "The teacher explained how different inflections can show if a word is singular or plural.",
            "sent2": "In English, we use inflections like -s or -es to show when there is more than one of something.",
            "sent3": "The playful puppy added an extra 's' to his bark, showing his understanding of inflections.",
            "sent4": "Her smile had an inflection of sadness, hinting at hidden emotions beneath the surface.",
            "sent5": "The colorful inflections in her speech made the story come alive for the children."
        },
        {
            "definition": "The modulation of intonation or pitch in the voice.",
            "pos": "noun",
            "sent1": "His voice had a pleasant inflection that made his storytelling captivating.",
            "sent2": "She used a cheerful inflection when greeting her friends on the phone.",
            "sent3": "The robot's monotone voice attempted to mimic human inflections but fell short.",
            "sent4": "The singer's voice rose and fell with emotional inflections, moving the audience to tears.",
            "sent5": "The actor's skillful inflections brought the character to life on stage."
        },
        {
            "definition": "A change in the form of a word to express different grammatical categories.",
            "pos": "noun",
            "sent1": "When learning a new language, it's important to understand how inflections can alter the meaning of words.",
            "sent2": "Latin is known for its complex system of inflections that indicate case, number, and gender.",
            "sent3": "The mischievous student purposely used incorrect inflections to confuse the teacher.",
            "sent4": "The writer played with inflections in her poetry, bending words to fit her unique style.",
            "sent5": "The inflections in Old English were quite different from those in modern languages."
        }
    ]
}