{
    "term": "infrareds",
    "meanings": [
        {
            "definition": "Electromagnetic radiation with wavelengths longer than visible light but shorter than microwaves.",
            "pos": "noun",
            "sent1": "The infrareds from the remote control help change the TV channel.",
            "sent2": "Scientists use special cameras to capture infrareds emitted by objects.",
            "sent3": "The detective used infrareds to uncover hidden clues at the crime scene.",
            "sent4": "Infrareds are like secret messages sent by warm objects to reveal their presence.",
            "sent5": "The warmth of the infrareds felt like a gentle hug from the sun."
        },
        {
            "definition": "Devices or technology that detect or emit infrared radiation.",
            "pos": "noun",
            "sent1": "The security system uses infrareds to detect motion in the house.",
            "sent2": "Hunters use infrareds to track animals in the dark.",
            "sent3": "The robot chef relied on infrareds to cook the perfect meal every time.",
            "sent4": "Infrareds act as the eyes of machines, allowing them to 'see' without light.",
            "sent5": "The infrareds emitted by the device revealed hidden patterns on the wall."
        },
        {
            "definition": "The portion of the electromagnetic spectrum that includes infrared radiation.",
            "pos": "noun",
            "sent1": "Infrareds are part of the spectrum that includes visible light and ultraviolet rays.",
            "sent2": "Astronomers study the universe by observing infrareds from distant stars.",
            "sent3": "The artist painted a beautiful picture inspired by the colors of infrareds.",
            "sent4": "Infrareds are like the quiet whispers of the universe, revealing its hidden beauty.",
            "sent5": "The night sky was filled with the soft glow of infrareds, painting a magical scene."
        }
    ]
}