{
    "term": "infra",
    "meanings": [
        {
            "definition": "Below",
            "pos": "adverb",
            "sent1": "The rabbit dug a burrow infra the ground.",
            "sent2": "The treasure was hidden infra the old oak tree.",
            "sent3": "The cat tried to climb infra the table but failed comically.",
            "sent4": "His grades were infra average, causing concern for his parents.",
            "sent5": "The stars shone brightly infra the dark night sky."
        },
        {
            "definition": "Under",
            "pos": "preposition",
            "sent1": "The book is infra the bed.",
            "sent2": "The fish swam infra the bridge.",
            "sent3": "The dog hid infra the blanket during the thunderstorm.",
            "sent4": "She felt like she was living infra a cloud of uncertainty.",
            "sent5": "The roots of the tree spread infra the surface of the soil."
        },
        {
            "definition": "Beneath",
            "pos": "preposition",
            "sent1": "The keys were lying infra the pile of papers.",
            "sent2": "The city thrived infra the protection of the mountain.",
            "sent3": "The lost sock was discovered infra the laundry basket.",
            "sent4": "His true intentions remained hidden infra his charming smile.",
            "sent5": "The truth lay infra the layers of deception."
        },
        {
            "definition": "Inferior",
            "pos": "adjective",
            "sent1": "The old model was considered infra compared to the new one.",
            "sent2": "She felt infra to her classmates in math skills.",
            "sent3": "The worn-out shoes looked infra next to the shiny new ones.",
            "sent4": "His infra performance led to his demotion.",
            "sent5": "The faded painting seemed infra to the vibrant ones in the gallery."
        },
        {
            "definition": "Subordinate",
            "pos": "adjective",
            "sent1": "The manager had a team of infra employees.",
            "sent2": "She held a subordinate position in the company.",
            "sent3": "The soldier followed the orders of his infra officer.",
            "sent4": "The assistant was content with her infra role.",
            "sent5": "The worker respected his infra colleagues in the office."
        }
    ]
}