{
    "term": "infringements",
    "meanings": [
        {
            "definition": "The action of breaking the terms of a law, agreement, etc.",
            "pos": "noun",
            "sent1": "The teacher warned the students about the consequences of infringements in the school rules.",
            "sent2": "The company faced legal consequences due to their infringements of copyright laws.",
            "sent3": "The cat's constant infringements on the dog's bed territory led to a playful chase around the house.",
            "sent4": "Her repeated infringements of trust with her friends left her feeling isolated and alone.",
            "sent5": "The graffiti artist's bold infringements on public property caught the attention of the entire town."
        },
        {
            "definition": "An act that breaks a rule or law.",
            "pos": "noun",
            "sent1": "The parking ticket was issued for the infringement of the parking regulations.",
            "sent2": "The infringement of speed limits can result in fines and penalties.",
            "sent3": "The squirrel's infringement into the bird feeder caused a commotion among the feathered visitors.",
            "sent4": "His constant infringements of the office dress code made him stand out among his colleagues.",
            "sent5": "The referee blew the whistle for the player's clear infringement during the game."
        },
        {
            "definition": "The action of limiting or undermining something.",
            "pos": "noun",
            "sent1": "The strict regulations were seen as an infringement on personal freedom.",
            "sent2": "The constant interruptions were an infringement on the flow of the meeting.",
            "sent3": "The mischievous puppy's infringement on the garden plants led to a hilarious chase around the yard.",
            "sent4": "The dark clouds were an infringement on the bright blue sky of the morning.",
            "sent5": "The noise pollution from the construction site was a constant infringement on the peaceful neighborhood."
        }
    ]
}