{
    "term": "infusorian",
    "meanings": [
        {
            "definition": "A microscopic aquatic organism belonging to the phylum Ciliophora.",
            "pos": "noun",
            "sent1": "The infusorian was so tiny that it could only be seen under a microscope.",
            "sent2": "Scientists study infusorians to learn more about microscopic life in water.",
            "sent3": "The infusorian threw a tiny party in the pond, inviting all its microscopic friends.",
            "sent4": "Under the lens, the infusorian seemed like a bustling city with its cilia waving like tiny flags.",
            "sent5": "The infusorian's cilia-covered body shimmered in the water, a beautiful sight under the microscope."
        },
        {
            "definition": "An organism that is commonly found in freshwater environments.",
            "pos": "noun",
            "sent1": "The infusorian thrived in the calm waters of the freshwater lake.",
            "sent2": "Fishermen often encounter infusorians while exploring freshwater habitats.",
            "sent3": "The infusorian decided to take a swim in the freshwater stream, enjoying the cool environment.",
            "sent4": "In the peaceful pond, the infusorian was like a tiny explorer discovering the wonders of freshwater life.",
            "sent5": "Children love to observe infusorians in jars of freshwater, marveling at their tiny movements."
        },
        {
            "definition": "A type of protozoan that is characterized by its cilia-covered body.",
            "pos": "noun",
            "sent1": "The infusorian's cilia helped it move gracefully through the water.",
            "sent2": "Infusorians are known for their unique cilia-covered bodies in the world of protozoa.",
            "sent3": "The infusorian's cilia acted like tiny brushes, painting the water with its movements.",
            "sent4": "In the world of microscopic creatures, the infusorian's cilia were like a crown of beauty.",
            "sent5": "As the infusorian swam, its cilia created a mesmerizing dance in the water, a sight to behold."
        }
    ]
}