{
    "term": "inquisitive",
    "meanings": [
        {
            "definition": "Curious or inquiring",
            "pos": "adjective",
            "sent1": "The young child had an inquisitive nature, always asking questions about everything around him.",
            "sent2": "She had an inquisitive mind, always wanting to learn new things and explore different ideas.",
            "sent3": "The inquisitive puppy sniffed around the room, trying to discover where the delicious smell was coming from.",
            "sent4": "Her inquisitive eyes scanned the room, searching for any clues that might help solve the mystery.",
            "sent5": "The inquisitive squirrel watched intently as the humans put out food, wondering if it was safe to approach."
        },
        {
            "definition": "Eager for knowledge",
            "pos": "adjective",
            "sent1": "The students were inquisitive, eagerly raising their hands to answer the teacher's questions.",
            "sent2": "He was always inquisitive, excited to delve into new books and expand his understanding.",
            "sent3": "The inquisitive explorer couldn't wait to uncover the ancient secrets hidden within the ruins.",
            "sent4": "Her inquisitive thirst for knowledge led her to spend hours in the library, absorbing information like a sponge.",
            "sent5": "The inquisitive scientist eagerly awaited the results of the experiment, hoping to make a groundbreaking discovery."
        },
        {
            "definition": "Showing curiosity or interest",
            "pos": "adjective",
            "sent1": "The inquisitive cat pawed at the mysterious object, intrigued by its unusual shape.",
            "sent2": "Their inquisitive nature led them to explore the abandoned house, eager to uncover its secrets.",
            "sent3": "The inquisitive child's eyes widened with interest as they listened to the fantastical tale.",
            "sent4": "His inquisitive gaze followed the shooting star across the night sky, filled with wonder and awe.",
            "sent5": "The inquisitive puppy wagged its tail excitedly, showing its interest in the new toy."
        }
    ]
}