{
    "term": "inquisitorially",
    "meanings": [
        {
            "definition": "In a manner characteristic of an inquisitor.",
            "pos": "adverb",
            "sent1": "She looked at him inquisitorially, trying to understand his motives.",
            "sent2": "The detective questioned the suspect inquisitorially to get to the truth.",
            "sent3": "The cat stared inquisitorially at the closed door, wondering what was behind it.",
            "sent4": "Her eyes scanned the room inquisitorially, searching for any signs of deception.",
            "sent5": "The teacher observed the students inquisitorially, making sure they were following the rules."
        },
        {
            "definition": "In a manner that involves questioning or investigating closely.",
            "pos": "adverb",
            "sent1": "He examined the evidence inquisitorially, looking for any inconsistencies.",
            "sent2": "The journalist inquisitorially interviewed the witness to gather all the details.",
            "sent3": "The toddler inquisitorially asked why the sky was blue over and over again.",
            "sent4": "The scientist inquisitorially probed the data, trying to find a breakthrough.",
            "sent5": "The lawyer inquisitorially cross-examined the witness, trying to find any contradictions."
        },
        {
            "definition": "In a manner that is overly intrusive or prying.",
            "pos": "adverb",
            "sent1": "She inquisitorially pried into her friend's personal life, causing tension between them.",
            "sent2": "The nosy neighbor inquisitorially asked about the new neighbors moving in.",
            "sent3": "The gossip magazine inquisitorially speculated about the celebrity's secret relationship.",
            "sent4": "The paparazzi inquisitorially followed the actress, invading her privacy.",
            "sent5": "The curious child inquisitorially peeked through the keyhole, trying to see what was inside the room."
        }
    ]
}