{
    "term": "inscriptional",
    "meanings": [
        {
            "definition": "Of or relating to an inscription.",
            "pos": "adjective",
            "sent1": "The inscriptional words on the stone tablet were ancient and mysterious.",
            "sent2": "The museum displayed many inscriptional artifacts from different civilizations.",
            "sent3": "The inscriptional message on the tombstone made the visitors wonder about the person buried there.",
            "sent4": "Her smile was like an inscriptional symbol of joy that brightened up the room.",
            "sent5": "The inscriptional carvings on the temple walls told stories of gods and heroes."
        },
        {
            "definition": "Consisting of inscriptions.",
            "pos": "adjective",
            "sent1": "The inscriptional plaques on the building described its historical significance.",
            "sent2": "The library's walls were covered in inscriptional writings from various time periods.",
            "sent3": "The inscriptional notes on the map guided the travelers through the forest.",
            "sent4": "His mind was a library of inscriptional memories etched with moments of happiness and sorrow.",
            "sent5": "The inscriptional details on the map helped the explorers navigate the treacherous terrain."
        },
        {
            "definition": "Written or engraved on a surface.",
            "pos": "adjective",
            "sent1": "The inscriptional message on the monument honored the fallen soldiers.",
            "sent2": "The inscriptional letters on the ancient scroll were barely legible.",
            "sent3": "The inscriptional graffiti on the wall caught the attention of passersby.",
            "sent4": "Her laughter echoed like an inscriptional promise of eternal friendship.",
            "sent5": "The inscriptional symbols on the cave walls revealed the secrets of the lost civilization."
        }
    ]
}