{
    "term": "insecticidally",
    "meanings": [
        {
            "definition": "In a manner that kills insects.",
            "pos": "adverb",
            "sent1": "The farmer sprayed the crops insecticidally to protect them from pests.",
            "sent2": "The exterminator treated the house insecticidally to get rid of the ants.",
            "sent3": "The garden gnome chuckled as he sprinkled the flowerbed insecticidally, ensuring no bugs would bother the plants.",
            "sent4": "The fog rolled in insecticidally, enveloping the field in a mist that eradicated all unwanted insects.",
            "sent5": "The spray can hissed insecticidally, releasing a cloud of protection against the invading bugs."
        },
        {
            "definition": "Relating to the use of insecticides.",
            "pos": "adjective",
            "sent1": "The insecticidally treated seeds grew into strong, pest-resistant plants.",
            "sent2": "The company specialized in producing insecticidally safe products for households.",
            "sent3": "The superhero's suit was designed with an insecticidally infused fabric to repel any bug attacks.",
            "sent4": "Her smile was as effective as an insecticidally coated shield against negativity.",
            "sent5": "The room had an insecticidally clean scent, indicating thorough pest control measures."
        },
        {
            "definition": "With the purpose of eradicating insects.",
            "pos": "adverb",
            "sent1": "The team worked insecticidally to clear the area of mosquitoes before the event.",
            "sent2": "She cleaned the kitchen insecticidally, making sure no crumbs attracted unwanted guests.",
            "sent3": "The cat pounced insecticidally on the toy mouse, pretending it was a dangerous insect.",
            "sent4": "The music played insecticidally, driving away any buzzing intruders from the peaceful garden.",
            "sent5": "The sunlight filtered through the leaves insecticidally, creating a warm environment free of pests."
        }
    ]
}