{
    "term": "insomnias",
    "meanings": [
        {
            "definition": "The condition of being unable to sleep, typically resulting in tiredness and irritability.",
            "pos": "noun",
            "sent1": "Her insomnias kept her awake all night, leaving her exhausted in the morning.",
            "sent2": "After suffering from insomnias for weeks, he finally sought help from a sleep specialist.",
            "sent3": "The insomnias seemed to have a party in her head, keeping her wide awake when she wanted to sleep.",
            "sent4": "The insomnias were like unwelcome guests that overstayed their welcome, leaving her drained every day.",
            "sent5": "The insomnias were like mischievous elves, playing tricks on her mind and stealing her rest."
        },
        {
            "definition": "A chronic inability to fall asleep or remain asleep for an adequate length of time.",
            "pos": "noun",
            "sent1": "His insomnias made him toss and turn all night, unable to find a moment of peace.",
            "sent2": "Living with insomnias can be incredibly challenging, affecting every aspect of daily life.",
            "sent3": "The insomnias seemed to have a vendetta against him, refusing to let him rest no matter what.",
            "sent4": "The insomnias were like a stubborn lock, keeping him out of the realm of sleep.",
            "sent5": "The insomnias were like a relentless enemy, attacking his peace of mind every night."
        },
        {
            "definition": "A sleep disorder characterized by difficulty falling or staying asleep.",
            "pos": "noun",
            "sent1": "Her insomnias caused her to lie awake in bed, counting sheep to no avail.",
            "sent2": "Dealing with insomnias can be frustrating, especially when you just want to rest.",
            "sent3": "The insomnias were like a mischievous imp, hiding under her pillow and giggling at her attempts to sleep.",
            "sent4": "The insomnias were like a thick fog, clouding her mind and preventing her from drifting off.",
            "sent5": "The insomnias were like a persistent alarm clock, ringing in her ears every time she closed her eyes."
        }
    ]
}