{
    "term": "institutionalizes",
    "meanings": [
        {
            "definition": "Establishes or organizes as an institution.",
            "pos": "verb",
            "sent1": "The government institutionalizes laws to maintain order.",
            "sent2": "The university institutionalizes its policies for student conduct.",
            "sent3": "The teacher institutionalizes a rule that all homework must be completed on time.",
            "sent4": "Just like a puzzle piece, each rule institutionalizes itself into the school system.",
            "sent5": "The tradition of wearing uniforms institutionalizes discipline among students."
        },
        {
            "definition": "Places or commits to an institution, typically for long-term care.",
            "pos": "verb",
            "sent1": "Families sometimes institutionalize elderly relatives in nursing homes.",
            "sent2": "The court may institutionalize individuals deemed unfit to care for themselves.",
            "sent3": "The movie character jokingly institutionalizes their messy roommate in a cleaning service.",
            "sent4": "In the story, the villain tries to institutionalize the hero in a mental asylum.",
            "sent5": "The decision to institutionalize a loved one is never easy but may be necessary for their well-being."
        },
        {
            "definition": "Incorporates into a system or structure.",
            "pos": "verb",
            "sent1": "The company institutionalizes feedback from employees to improve operations.",
            "sent2": "The software update institutionalizes new security measures to protect user data.",
            "sent3": "The chef playfully institutionalizes a secret ingredient into every dish.",
            "sent4": "The architect's design institutionalizes natural light as a key element of the building.",
            "sent5": "The school institutionalizes technology into its curriculum to enhance learning experiences."
        }
    ]
}