{
    "term": "institutionalize",
    "meanings": [
        {
            "definition": "Establish or organize as an institution.",
            "pos": "verb",
            "sent1": "The government decided to institutionalize new policies for public safety.",
            "sent2": "Universities often institutionalize certain traditions to maintain their culture.",
            "sent3": "It would be quite a sight to see a squirrel trying to institutionalize a nut-gathering routine.",
            "sent4": "Her passion for gardening was so strong that she managed to institutionalize it into a successful business.",
            "sent5": "The teacher's dedication to education was so inspiring that it seemed to institutionalize a love for learning in all her students."
        },
        {
            "definition": "Make into or treat as an institution.",
            "pos": "verb",
            "sent1": "The community decided to institutionalize the local library as a hub for learning.",
            "sent2": "In some cultures, family values are institutionalized and highly respected.",
            "sent3": "It would be amusing to see a cat trying to institutionalize its favorite toy as a sacred object.",
            "sent4": "Her leadership skills were so remarkable that she seemed to institutionalize respect among her team.",
            "sent5": "The artist's unique style was so influential that it began to institutionalize a new trend in the art world."
        },
        {
            "definition": "Place or confine in an institution, especially a mental health facility.",
            "pos": "verb",
            "sent1": "The court decided to institutionalize the patient for further evaluation.",
            "sent2": "In extreme cases, individuals may need to be institutionalized for their own safety.",
            "sent3": "It would be quite a scene to see a penguin trying to institutionalize itself in a tropical environment.",
            "sent4": "His fear of failure seemed to institutionalize him within the confines of his comfort zone.",
            "sent5": "The strict rules of the boarding school seemed to institutionalize discipline in all the students."
        }
    ]
}