{
    "term": "institutionalise",
    "meanings": [
        {
            "definition": "Establish or organize as an institution.",
            "pos": "verb",
            "sent1": "The government decided to institutionalise the new program to help more people.",
            "sent2": "Universities often institutionalise certain traditions to maintain a sense of history and community.",
            "sent3": "The idea to institutionalise nap time at work was met with mixed reactions.",
            "sent4": "She wanted to institutionalise a culture of kindness in her workplace.",
            "sent5": "The teacher hoped to institutionalise a love for reading in her students."
        },
        {
            "definition": "Make into or treat as an institution.",
            "pos": "verb",
            "sent1": "The family decided to institutionalise their weekly game night as a special tradition.",
            "sent2": "Over time, the small business grew and was institutionalised as a key player in the industry.",
            "sent3": "He jokingly suggested to institutionalise Taco Tuesday at the office.",
            "sent4": "The local artist's work was so influential that it became institutionalised in the art world.",
            "sent5": "The community sought to institutionalise the annual charity event for years to come."
        },
        {
            "definition": "Place or confine in an institution, especially a mental health facility.",
            "pos": "verb",
            "sent1": "The court ordered to institutionalise the patient for further evaluation.",
            "sent2": "In extreme cases, individuals may need to be institutionalised for their own safety.",
            "sent3": "The idea to institutionalise the troublemakers in a separate class was considered.",
            "sent4": "She felt like her creativity was being institutionalised in the rigid environment.",
            "sent5": "The strict rules seemed to institutionalise the students' behavior in the school."
        }
    ]
}