{
    "term": "instrumentalist",
    "meanings": [
        {
            "definition": "A person who plays a musical instrument.",
            "pos": "noun",
            "sent1": "The instrumentalist played the guitar beautifully.",
            "sent2": "The talented instrumentalist performed a solo at the concert.",
            "sent3": "The instrumentalist accidentally dropped their violin during the recital.",
            "sent4": "She was the instrumentalist of the orchestra, leading with her violin like a conductor.",
            "sent5": "The young instrumentalist practiced diligently every day to improve their skills."
        },
        {
            "definition": "A person who advocates for the use of instruments in music.",
            "pos": "noun",
            "sent1": "As an instrumentalist, he always promoted the importance of using instruments in music.",
            "sent2": "The instrumentalist believed that every song could benefit from the addition of instruments.",
            "sent3": "The instrumentalist campaigned for more instruments in the school band.",
            "sent4": "She was the instrumentalist behind the movement to include more instruments in the music curriculum.",
            "sent5": "The passionate instrumentalist inspired others to appreciate the beauty of musical instruments."
        },
        {
            "definition": "A person who believes that instruments are the most important aspect of music.",
            "pos": "noun",
            "sent1": "The instrumentalist valued instruments above all else in music.",
            "sent2": "To the instrumentalist, instruments were the heart and soul of every melody.",
            "sent3": "The instrumentalist joked that without instruments, music would just be people singing.",
            "sent4": "She was such a dedicated instrumentalist that she even dreamt in melodies of instruments.",
            "sent5": "The passionate instrumentalist could hear the beauty of instruments in every sound around her."
        }
    ]
}