{
    "term": "instant",
    "meanings": [
        {
            "definition": "Happening or done immediately",
            "pos": "adjective",
            "sent1": "The teacher's instant response to the question impressed the students.",
            "sent2": "The delivery service provides instant solutions for urgent needs.",
            "sent3": "It was an instant decision to wear a hat on a sunny day.",
            "sent4": "Her smile had an instant brightening effect on everyone around her.",
            "sent5": "The thunderstorm brought an instant change in the weather."
        },
        {
            "definition": "A very short period of time",
            "pos": "noun",
            "sent1": "In an instant, the cat caught the mouse.",
            "sent2": "He arrived at the meeting in an instant.",
            "sent3": "The magician made the rabbit disappear in an instant.",
            "sent4": "The race was over in an instant, with the winner crossing the finish line first.",
            "sent5": "The alarm clock woke her up in an instant."
        },
        {
            "definition": "A momentary or very brief time period",
            "pos": "noun",
            "sent1": "The sun peeked out for an instant before disappearing behind the clouds.",
            "sent2": "She hesitated for an instant before making her decision.",
            "sent3": "The comedian's joke lasted only an instant but made everyone laugh.",
            "sent4": "The feeling of joy lasted just an instant before reality set in.",
            "sent5": "The flash of lightning illuminated the sky for an instant."
        },
        {
            "definition": "A food or drink that is quick and easy to prepare by adding hot water",
            "pos": "noun",
            "sent1": "He enjoyed a cup of instant coffee in the morning.",
            "sent2": "She always carries a packet of instant noodles for a quick meal.",
            "sent3": "The instant soup was a lifesaver during the camping trip.",
            "sent4": "The convenience store offers a variety of instant meals for busy customers.",
            "sent5": "The instant hot chocolate warmed her up on a cold winter day."
        }
    ]
}