{
    "term": "insulted",
    "meanings": [
        {
            "definition": "To offend or upset someone by saying or doing something disrespectful or rude.",
            "pos": "verb",
            "sent1": "She insulted her friend by making fun of her in front of everyone.",
            "sent2": "He felt insulted when his boss criticized his work in front of the whole team.",
            "sent3": "The cat insulted the dog by stealing its favorite toy and running away with it.",
            "sent4": "The graffiti on the wall insulted the neighborhood's sense of pride.",
            "sent5": "The rude comment insulted her deeply, leaving a lasting impact on her emotions."
        },
        {
            "definition": "To treat someone with disrespect or scorn.",
            "pos": "verb",
            "sent1": "The bully insulted the new student by calling him names.",
            "sent2": "She insulted her waiter by snapping her fingers to get his attention.",
            "sent3": "The parrot insulted the visitors by mimicking their laughter in a mocking tone.",
            "sent4": "The graffiti artist insulted the establishment by painting a controversial mural on its wall.",
            "sent5": "The disrespectful behavior insulted the teacher, causing her to address the issue immediately."
        },
        {
            "definition": "To cause injury or harm to someone's pride or self-esteem.",
            "pos": "verb",
            "sent1": "His harsh words insulted her deeply, leaving her feeling small and insignificant.",
            "sent2": "The rejection letter insulted his self-esteem, making him doubt his abilities.",
            "sent3": "The broken mirror insulted her vanity by showing her reflection in a distorted way.",
            "sent4": "The loss of the competition insulted his pride, pushing him to train harder for the next one.",
            "sent5": "The public humiliation insulted her self-esteem, leading her to seek support from friends and family."
        }
    ]
}