{
    "term": "internationalize",
    "meanings": [
        {
            "definition": "To make something international in character or scope.",
            "pos": "verb",
            "sent1": "The company decided to internationalize their products by selling them in different countries.",
            "sent2": "Many businesses choose to internationalize in order to reach a wider market.",
            "sent3": "The idea to internationalize the school lunch menu with dishes from around the world was met with excitement by the students.",
            "sent4": "Her dream to internationalize her small bakery and share her unique pastries globally was finally coming true.",
            "sent5": "The decision to internationalize the annual conference brought together experts from various countries for a truly global exchange of ideas."
        },
        {
            "definition": "To extend to or involve other countries or nations.",
            "pos": "verb",
            "sent1": "The organization's mission is to internationalize humanitarian aid efforts to help those in need worldwide.",
            "sent2": "The company's goal is to internationalize their business operations and establish branches in different countries.",
            "sent3": "The plan to internationalize the charity event by inviting international performers was a huge success.",
            "sent4": "Her passion for music led her to internationalize her music collection with songs from artists around the globe.",
            "sent5": "The decision to internationalize the project team by including members from various countries brought diverse perspectives to the table."
        },
        {
            "definition": "To become international in character or scope.",
            "pos": "verb",
            "sent1": "As the company grew, it started to internationalize and expand its reach beyond national borders.",
            "sent2": "The small local business aimed to internationalize and compete in the global market.",
            "sent3": "The once traditional festival began to internationalize with the addition of cultural performances from different countries.",
            "sent4": "Her artwork started to internationalize as it gained recognition and was exhibited in galleries worldwide.",
            "sent5": "The decision to internationalize the website by offering multiple language options made it accessible to a global audience."
        }
    ]
}