{
    "term": "interdiction",
    "meanings": [
        {
            "definition": "The action of prohibiting or forbidding something.",
            "pos": "noun",
            "sent1": "The interdiction of sugary snacks in school helps promote healthier eating habits.",
            "sent2": "The interdiction of smoking in public places has led to cleaner air for everyone.",
            "sent3": "The interdiction of using phones during class made the students come up with creative ways to communicate.",
            "sent4": "Her interdiction of any negative talk created a positive atmosphere in the room.",
            "sent5": "The interdiction of littering in the park keeps the environment clean and beautiful."
        },
        {
            "definition": "The act of intercepting and preventing the movement of goods or people.",
            "pos": "noun",
            "sent1": "The coast guard's interdiction of illegal fishing boats protected the marine life.",
            "sent2": "The police conducted an interdiction operation to stop the smuggling of contraband.",
            "sent3": "The interdiction of the thief by the security guard was swift and effective.",
            "sent4": "Her sharp eyes acted as an interdiction, spotting any suspicious activity.",
            "sent5": "The interdiction of the criminal at the border prevented a major security breach."
        },
        {
            "definition": "A legal process that allows for the seizure of property.",
            "pos": "noun",
            "sent1": "The interdiction of the suspect's assets was part of the investigation.",
            "sent2": "The court issued an interdiction on the property until the case was resolved.",
            "sent3": "The interdiction of the stolen goods by the police surprised the thieves.",
            "sent4": "The interdiction of the valuable artifacts was a blow to the art thieves.",
            "sent5": "The interdiction of the illegal merchandise was a significant win for law enforcement."
        }
    ]
}