{
    "term": "interceptions",
    "meanings": [
        {
            "definition": "The act of intercepting or stopping something from reaching its intended destination.",
            "pos": "noun",
            "sent1": "The football player made two interceptions during the game.",
            "sent2": "The police made several interceptions to prevent the criminals from escaping.",
            "sent3": "The cat's playful interception of the toy mouse amused everyone in the room.",
            "sent4": "Her quick interception of the falling vase saved it from shattering on the floor.",
            "sent5": "The interception of the package by the neighbor made sure it reached the right house."
        },
        {
            "definition": "The act of catching or seizing something that is in motion.",
            "pos": "noun",
            "sent1": "The basketball player's interceptions helped his team gain possession of the ball.",
            "sent2": "The security guard made an interception of the thief before he could escape.",
            "sent3": "The interception of the flying frisbee by the dog was quite impressive.",
            "sent4": "Her interception of the falling book saved it from hitting the ground.",
            "sent5": "The interception of the runaway balloon prevented it from floating away."
        },
        {
            "definition": "The act of secretly listening to or recording a communication.",
            "pos": "noun",
            "sent1": "The spy's interceptions of enemy messages were crucial for the mission.",
            "sent2": "The interception of the phone call revealed important information.",
            "sent3": "The interception of the whispered conversation by the eavesdropper surprised him.",
            "sent4": "Her interception of the coded message helped decipher the secret plan.",
            "sent5": "The interception of the radio transmission exposed the enemy's location."
        }
    ]
}