{
    "term": "intellectively",
    "meanings": [
        {
            "definition": "In an intellectual manner",
            "pos": "adverb",
            "sent1": "She solved the puzzle intellectively, carefully analyzing each clue.",
            "sent2": "He always approaches problems intellectively, thinking deeply before making decisions.",
            "sent3": "The cat stared intellectively at the empty food bowl, as if pondering its next move.",
            "sent4": "Her eyes sparkled intellectively as she delved into the complex philosophical text.",
            "sent5": "The student studied intellectively, absorbing every detail of the scientific theory."
        },
        {
            "definition": "Relating to or involving intellect",
            "pos": "adjective",
            "sent1": "His intellectively curious nature led him to explore various academic fields.",
            "sent2": "The book provided an intellectively stimulating discussion on the human mind.",
            "sent3": "The robot's intellectively designed circuits allowed it to process information efficiently.",
            "sent4": "The painting depicted an intellectively vibrant scene of scholars engaged in debate.",
            "sent5": "The museum showcased intellectively crafted artifacts from ancient civilizations."
        },
        {
            "definition": "Using or involving the intellect",
            "pos": "adjective",
            "sent1": "The intellectively challenging test required critical thinking skills.",
            "sent2": "She approached the problem with an intellectively sharp mind, quickly finding a solution.",
            "sent3": "The detective's intellectively sharp observations helped solve the mysterious case.",
            "sent4": "His intellectively crafted arguments persuaded even the most skeptical audience.",
            "sent5": "The professor's intellectively engaging lectures captivated the students' attention."
        }
    ]
}