{
    "term": "interest",
    "meanings": [
        {
            "definition": "A feeling of wanting to know or learn about something.",
            "pos": "noun",
            "sent1": "Her interest in science led her to conduct experiments in her backyard.",
            "sent2": "His interest in history made him visit museums regularly.",
            "sent3": "The cat's interest in the moving laser pointer provided endless entertainment for the family.",
            "sent4": "The detective's interest in the case was like a burning flame, driving him to uncover the truth.",
            "sent5": "The child's interest in dinosaurs was so intense that he could name every species."
        },
        {
            "definition": "The state of wanting to learn or know more about something.",
            "pos": "noun",
            "sent1": "The student's interest in math motivated him to solve complex equations.",
            "sent2": "Her interest in literature grew as she read more books.",
            "sent3": "The robot's interest in human behavior led to some comical misunderstandings.",
            "sent4": "The plant's interest in sunlight was evident as it leaned towards the window.",
            "sent5": "The explorer's interest in ancient civilizations took him to remote archaeological sites."
        },
        {
            "definition": "The quality of attracting someone's attention or curiosity.",
            "pos": "noun",
            "sent1": "The movie's special effects were of great interest to the audience.",
            "sent2": "The mysterious package piqued her interest.",
            "sent3": "The magician's interest in pulling rabbits out of hats never waned.",
            "sent4": "The painting's interest lay in its hidden symbols and meanings.",
            "sent5": "The new exhibit at the museum generated a lot of interest among visitors."
        },
        {
            "definition": "A person's concern or curiosity about something.",
            "pos": "noun",
            "sent1": "His interest in her well-being showed in the way he checked on her daily.",
            "sent2": "The teacher's interest in her students' progress was evident in the extra help she provided.",
            "sent3": "The cat's interest in the fishbowl was a constant source of worry for the owner.",
            "sent4": "The detective's interest in the suspect's alibi led to a breakthrough in the case.",
            "sent5": "The community's interest in the local park's renovation sparked a fundraising campaign."
        },
        {
            "definition": "A legal right, claim, or share in something.",
            "pos": "noun",
            "sent1": "She had a vested interest in the success of the company as a shareholder.",
            "sent2": "His interest in the property gave him a say in its future development.",
            "sent3": "The siblings' interest in the inheritance caused some family tension.",
            "sent4": "The company's interest in the patent protected its innovative product.",
            "sent5": "The government's interest in the land for conservation purposes led to negotiations with the owners."
        }
    ]
}