{
    "term": "interracial",
    "meanings": [
        {
            "definition": "Existing or occurring between different races",
            "pos": "adjective",
            "sent1": "Their interracial friendship showed how people from different races can get along well.",
            "sent2": "The school celebrated its diverse student body with an interracial cultural festival.",
            "sent3": "The interracial potluck dinner was a delicious blend of various cuisines.",
            "sent4": "The garden was like an interracial bouquet, with flowers of different colors and origins.",
            "sent5": "The art exhibition aimed to showcase the beauty of interracial harmony through paintings."
        },
        {
            "definition": "Involving or representing different races",
            "pos": "adjective",
            "sent1": "The movie had an interracial cast that accurately reflected the city's diversity.",
            "sent2": "The company's marketing campaign aimed to appeal to an interracial audience.",
            "sent3": "The interracial soccer team had players from all over the world, making communication fun.",
            "sent4": "The music festival was an interracial symphony of sounds, blending various genres seamlessly.",
            "sent5": "The fashion show featured models of different ethnicities, showcasing an interracial style."
        },
        {
            "definition": "Of, relating to, or involving individuals of different races",
            "pos": "adjective",
            "sent1": "The school's policy promoted an inclusive and interracial environment for all students.",
            "sent2": "The art gallery displayed paintings that depicted interracial relationships beautifully.",
            "sent3": "The interracial picnic was a great opportunity for cultural exchange and tasty food.",
            "sent4": "The city's skyline was a mix of tall buildings, creating an interracial urban landscape.",
            "sent5": "The book club discussed novels that explored the complexities of interracial love stories."
        }
    ]
}