{
    "term": "inter",
    "meanings": [
        {
            "definition": "To bury a dead body",
            "pos": "verb",
            "sent1": "They interred their beloved pet in the backyard.",
            "sent2": "The family decided to inter their grandfather in the family plot.",
            "sent3": "The cat interred its favorite toy under the couch.",
            "sent4": "The memories of her childhood were interred deep in her heart.",
            "sent5": "The ancient civilization interred their kings with great ceremony."
        },
        {
            "definition": "To place in a tomb or grave",
            "pos": "verb",
            "sent1": "The archaeologists interred the artifacts carefully to preserve them.",
            "sent2": "It is traditional to inter the deceased facing east.",
            "sent3": "The pirate captain interred his treasure on a deserted island.",
            "sent4": "The secrets of the past were interred in the ancient tomb.",
            "sent5": "Legends say that the pharaohs were interred with their riches for the afterlife."
        },
        {
            "definition": "To confine or shut up",
            "pos": "verb",
            "sent1": "The magician interred the rabbit in the hat before the show.",
            "sent2": "The zookeeper had to inter the injured bird for its own safety.",
            "sent3": "The mischievous elf interred himself in the cookie jar.",
            "sent4": "The storm clouds seemed to inter the sun, casting a shadow over the land.",
            "sent5": "The detective had to inter the suspect in a holding cell until further questioning."
        },
        {
            "definition": "To put in a temporary place",
            "pos": "verb",
            "sent1": "She had to inter her luggage in the hotel lobby before checking in.",
            "sent2": "The librarian asked the student to inter the borrowed books on the return cart.",
            "sent3": "The chef had to inter the dessert in the fridge to set before serving.",
            "sent4": "The artist decided to inter the painting in the studio until the exhibition.",
            "sent5": "The teacher had to inter the test papers in a folder for grading later."
        },
        {
            "definition": "To deposit a dead body in a grave or tomb",
            "pos": "verb",
            "sent1": "The villagers interred the fallen warrior with honor and respect.",
            "sent2": "It is a solemn duty to inter the deceased according to their beliefs.",
            "sent3": "The ancient tradition was to inter the deceased with their possessions.",
            "sent4": "The priest interred the body while reciting prayers for the departed.",
            "sent5": "The soldiers interred their fallen comrade in a solemn ceremony."
        }
    ]
}