{
    "term": "intercalates",
    "meanings": [
        {
            "definition": "Insert (days) in a calendar.",
            "pos": "verb",
            "sent1": "She intercalates extra days into the calendar to make sure all events are accounted for.",
            "sent2": "The committee intercalates additional days into the schedule to accommodate more meetings.",
            "sent3": "The busy bee intercalates time for relaxation into her packed calendar.",
            "sent4": "Like a skilled puzzle solver, he intercalates the missing days into the calendar effortlessly.",
            "sent5": "The chef intercalates cooking classes into her weekly calendar to improve her skills."
        },
        {
            "definition": "Insert (an extra month) in a calendar.",
            "pos": "verb",
            "sent1": "They intercalate an extra month into the lunar calendar to align it with the solar year.",
            "sent2": "In some cultures, they intercalate a leap month to keep the lunar calendar accurate.",
            "sent3": "The magician intercalates an extra month into his calendar to have more time for practicing new tricks.",
            "sent4": "The artist intercalates an extra month into her calendar to complete her masterpiece on time.",
            "sent5": "The farmer intercalates an extra month for planting in his agricultural calendar to ensure a bountiful harvest."
        },
        {
            "definition": "Insert (an extra day) in a calendar.",
            "pos": "verb",
            "sent1": "He intercalates an extra day into the calendar to account for the leap year.",
            "sent2": "The astronomer intercalates an extra day in February every four years to keep the calendar accurate.",
            "sent3": "The student intercalates an extra day into her calendar for a study marathon before the exam.",
            "sent4": "The coach intercalates an extra day into the training calendar for a special fitness challenge.",
            "sent5": "The teacher intercalates an extra day for a fun field trip in the school calendar to reward her students."
        },
        {
            "definition": "Insert (an extra period of time) in a calendar.",
            "pos": "verb",
            "sent1": "They intercalate an extra period of time into the project schedule to ensure its completion.",
            "sent2": "The event planner intercalates an extra period of time for unexpected delays in the timeline.",
            "sent3": "The explorer intercalates an extra period of time for exploring new territories in his travel calendar.",
            "sent4": "The scientist intercalates an extra period of time for conducting thorough experiments in the research calendar.",
            "sent5": "The manager intercalates an extra period of time for team bonding activities in the work calendar to boost morale."
        }
    ]
}