{
    "term": "intendances",
    "meanings": [
        {
            "definition": "The act or fact of intending.",
            "pos": "noun",
            "sent1": "Her intendances were clear from the determined look on her face.",
            "sent2": "His intendances to study hard paid off with good grades.",
            "sent3": "The mix-up in their intendances led to a hilarious misunderstanding.",
            "sent4": "In the game of chess, each move is a strategic intendances to win.",
            "sent5": "The teacher's intendances for the lesson were evident in her detailed plan."
        },
        {
            "definition": "The state of being intended.",
            "pos": "noun",
            "sent1": "The intendances of the message were misunderstood by the recipient.",
            "sent2": "The intendances of the law were debated by the legal experts.",
            "sent3": "The intendances of the party invitation were lost in the mail.",
            "sent4": "The intendances of the artwork were open to interpretation by the viewers.",
            "sent5": "The intendances of the contract were clearly outlined in the fine print."
        },
        {
            "definition": "A purpose or design.",
            "pos": "noun",
            "sent1": "The intendances of the new policy were to improve efficiency.",
            "sent2": "She worked diligently to achieve her career intendances.",
            "sent3": "The cat's playful intendances with the yarn amused the children.",
            "sent4": "The intendances of the architect were evident in the innovative building design.",
            "sent5": "His intendances for the weekend were to relax and unwind."
        },
        {
            "definition": "A plan or project.",
            "pos": "noun",
            "sent1": "The company's intendances for expansion included opening new branches.",
            "sent2": "She presented her business intendances to the investors.",
            "sent3": "The school's renovation intendances were delayed due to budget constraints.",
            "sent4": "The intendances for the event were carefully outlined in the agenda.",
            "sent5": "His travel intendances were disrupted by unexpected weather conditions."
        }
    ]
}