{
    "term": "interruptible",
    "meanings": [
        {
            "definition": "Capable of being interrupted.",
            "pos": "adjective",
            "sent1": "The teacher's lecture was so interruptible that even a sneeze could break the flow.",
            "sent2": "During the meeting, the phone rang, showing how interruptible the discussion was.",
            "sent3": "The interruptible movie kept pausing at the most suspenseful moments, making everyone laugh.",
            "sent4": "Her concentration was like an interruptible thread, easily broken by any noise.",
            "sent5": "The fragile glass was as interruptible as a soap bubble, shattering at the slightest touch."
        },
        {
            "definition": "Able to be stopped temporarily.",
            "pos": "adjective",
            "sent1": "The interruptible water supply meant we had to store extra for emergencies.",
            "sent2": "The construction work was interruptible due to the heavy rain, causing delays.",
            "sent3": "His video game character was so interruptible that it froze every few minutes.",
            "sent4": "The traffic flow was like an interruptible river, slowing down during rush hour.",
            "sent5": "The internet connection was as interruptible as a flickering light, going on and off unpredictably."
        },
        {
            "definition": "Subject to being disrupted.",
            "pos": "adjective",
            "sent1": "The interruptible power grid was vulnerable to outages during storms.",
            "sent2": "The fragile vase was interruptible, easily breaking if not handled carefully.",
            "sent3": "The interruptible Wi-Fi signal made it hard to stream movies without interruptions.",
            "sent4": "His plans were like an interruptible house of cards, falling apart with the slightest disturbance.",
            "sent5": "The old bridge was as interruptible as a creaky door, swaying in the wind."
        }
    ]
}