{
    "term": "interchangeable",
    "meanings": [
        {
            "definition": "Capable of being interchanged or swapped.",
            "pos": "adjective",
            "sent1": "These two toys are interchangeable because you can easily swap their parts.",
            "sent2": "The blue and red pens are interchangeable, so you can use either one to write.",
            "sent3": "It's funny how the twins are almost interchangeable, always confusing people.",
            "sent4": "In the game of chess, the pawns are like interchangeable soldiers on the battlefield.",
            "sent5": "The keys on the keyboard are interchangeable, allowing you to type smoothly."
        },
        {
            "definition": "Able to be used in place of each other.",
            "pos": "adjective",
            "sent1": "My black shoes and brown shoes are interchangeable, so I can wear either pair with my outfit.",
            "sent2": "The two brands of batteries are interchangeable, so you can use either in the remote control.",
            "sent3": "It's amusing how the actors in the play are almost interchangeable, making the audience do a double-take.",
            "sent4": "In the world of fashion, scarves are like interchangeable accessories that can transform an outfit.",
            "sent5": "The parts of the toy are interchangeable, allowing you to create different combinations."
        },
        {
            "definition": "Switchable or replaceable.",
            "pos": "adjective",
            "sent1": "The light bulbs in the lamp are interchangeable, so you can easily switch them out.",
            "sent2": "The phone covers are interchangeable, letting you replace them to match your mood.",
            "sent3": "It's comical how the characters in the movie are almost interchangeable, causing confusion.",
            "sent4": "In a toolbox, the different screwdriver heads are like interchangeable tools for various tasks.",
            "sent5": "The parts of the machine are interchangeable, making maintenance simple."
        }
    ]
}