{
    "term": "interpleaded",
    "meanings": [
        {
            "definition": "To involve in a legal proceeding where conflicting claims are made.",
            "pos": "verb",
            "sent1": "The judge interpleaded the two parties to resolve their disagreement.",
            "sent2": "The lawyer interpleaded the evidence to support her client's case.",
            "sent3": "The court clerk interpleaded the documents, causing confusion in the courtroom.",
            "sent4": "The mediator interpleaded the arguments, seeking a fair resolution.",
            "sent5": "The judge's decision to interplead the witnesses made the trial more complex."
        },
        {
            "definition": "To bring together parties with opposing claims to determine rightful ownership.",
            "pos": "verb",
            "sent1": "The mediator interpleaded the neighbors to settle the property dispute.",
            "sent2": "The attorney interpleaded the siblings to clarify the inheritance rights.",
            "sent3": "The judge interpleaded the rival companies, hoping for a peaceful agreement.",
            "sent4": "The counselor interpleaded the conflicting parties, aiming for a just outcome.",
            "sent5": "The arbitrator's role was to interplead the disputing parties for a fair resolution."
        },
        {
            "definition": "To act as an intermediary in a dispute between two parties.",
            "pos": "verb",
            "sent1": "The teacher interpleaded the students to resolve their argument peacefully.",
            "sent2": "The parent interpleaded between the siblings to stop the fight.",
            "sent3": "The friend interpleaded in the disagreement, trying to find a compromise.",
            "sent4": "The counselor interpleaded in the conflict, helping both sides understand each other.",
            "sent5": "The mediator interpleaded in the negotiation, facilitating communication between the parties."
        }
    ]
}