{
    "term": "intercity",
    "meanings": [
        {
            "definition": "Connecting or involving cities.",
            "pos": "adjective",
            "sent1": "The intercity highway made it easy to travel between the neighboring cities.",
            "sent2": "The intercity flights were always full of passengers going from one city to another.",
            "sent3": "The intercity bus driver joked that he was the 'city connector' on wheels.",
            "sent4": "The intercity bridges symbolize the strong bond between urban areas.",
            "sent5": "The intercity train network weaved a web of connections between metropolitan regions."
        },
        {
            "definition": "Traveling between cities.",
            "pos": "adjective",
            "sent1": "She enjoyed the intercity road trip, admiring the changing landscapes along the way.",
            "sent2": "The intercity bus service was a convenient way to visit multiple cities in a day.",
            "sent3": "The intercity travelers shared stories of their urban adventures during the journey.",
            "sent4": "His mind was an intercity highway, racing between thoughts of different cities.",
            "sent5": "The intercity journey felt like a whirlwind tour of bustling cityscapes."
        },
        {
            "definition": "A train or bus service between cities.",
            "pos": "noun",
            "sent1": "The intercity train departed from the station, heading towards the next city on its route.",
            "sent2": "Passengers crowded the intercity bus, eager to reach their destination in the neighboring city.",
            "sent3": "The intercity shuttle was a lifeline for commuters traveling between urban centers.",
            "sent4": "The intercity express was known for its punctuality and efficiency in city-to-city travel.",
            "sent5": "The intercity transport system connected distant cities, bringing people closer together."
        }
    ]
}