{
    "term": "intendance",
    "meanings": [
        {
            "definition": "The position or function of an intendant.",
            "pos": "noun",
            "sent1": "In the royal court, the intendance of the chief advisor was crucial for decision-making.",
            "sent2": "The intendance of the mayor involves overseeing the city's budget and resources.",
            "sent3": "The intendance of the mischievous elf caused chaos in the workshop.",
            "sent4": "Her intendance over the project was like a guiding light, leading everyone to success.",
            "sent5": "The intendance of the captain kept the ship sailing smoothly through rough waters."
        },
        {
            "definition": "The office or jurisdiction of an intendant.",
            "pos": "noun",
            "sent1": "The grand hall was the intendance of the king's advisor, where important meetings took place.",
            "sent2": "The intendance of the courthouse is responsible for maintaining order and justice.",
            "sent3": "The intendance of the squirrel over the park led to some nutty decisions.",
            "sent4": "His intendance over the land was like a protective shield, keeping intruders at bay.",
            "sent5": "The colorful banners marked the intendance of the festival, welcoming all visitors."
        },
        {
            "definition": "The act or process of managing or overseeing something.",
            "pos": "noun",
            "sent1": "Effective intendance of the project ensured it was completed on time and within budget.",
            "sent2": "The intendance of the school involves coordinating schedules and resources.",
            "sent3": "The cat's intendance over the house made it clear who was in charge.",
            "sent4": "Her intendance of the garden transformed it into a blooming paradise.",
            "sent5": "The diligent intendance of the chef resulted in a delicious and well-organized kitchen."
        }
    ]
}