{
    "term": "intercepters",
    "meanings": [
        {
            "definition": "a person or thing that intercepts",
            "pos": "noun",
            "sent1": "The intercepters caught the ball before it hit the ground.",
            "sent2": "The intercepters in the game intercepted the pass and scored a touchdown.",
            "sent3": "The intercepters, a group of quick-thinking students, intercepted the teacher's surprise quiz with a clever distraction.",
            "sent4": "The intercepters of the enemy's plans were like vigilant guards, always one step ahead.",
            "sent5": "The intercepters, with their keen eyes and fast reflexes, were the heroes of the match."
        },
        {
            "definition": "a device or system used to intercept something",
            "pos": "noun",
            "sent1": "The military used advanced intercepters to detect incoming missiles.",
            "sent2": "The radar intercepters were crucial in identifying and tracking enemy aircraft.",
            "sent3": "The intercepters, a network of sensors, worked together seamlessly to protect the city from cyber attacks.",
            "sent4": "The intercepters, like silent guardians, stood ready to defend against any threat.",
            "sent5": "The intercepters, with their sophisticated technology, ensured the safety of the nation."
        },
        {
            "definition": "the act of intercepting something",
            "pos": "noun",
            "sent1": "The intercepters of the pass prevented a goal in the soccer match.",
            "sent2": "The intercepters of the stolen goods were hailed as heroes by the community.",
            "sent3": "The intercepters, a team of skilled agents, intercepted the secret message before it fell into the wrong hands.",
            "sent4": "The intercepters of the spy's transmission were like unseen shadows in the night.",
            "sent5": "The intercepters, with their swift actions, stopped the crime in its tracks."
        }
    ]
}