{
    "term": "internationalism",
    "meanings": [
        {
            "definition": "The principle or policy of cooperation among nations.",
            "pos": "noun",
            "sent1": "Internationalism promotes working together between countries for common goals.",
            "sent2": "Many organizations support internationalism to foster global harmony.",
            "sent3": "At the internationalism-themed party, guests wore flags of different nations as hats.",
            "sent4": "The idea of internationalism is like a bridge connecting nations across the world.",
            "sent5": "In the play, the character symbolizing internationalism wore a globe costume."
        },
        {
            "definition": "The belief in or advocacy for international cooperation and unity.",
            "pos": "noun",
            "sent1": "Her strong internationalism led her to volunteer for global causes.",
            "sent2": "The politician's speeches often emphasize the importance of internationalism.",
            "sent3": "The cat's internationalism was evident when it befriended a dog from another country.",
            "sent4": "To her, internationalism was a beacon of hope in a divided world.",
            "sent5": "The painting depicted the concept of internationalism through diverse people holding hands."
        },
        {
            "definition": "The state or condition of being international in scope or character.",
            "pos": "noun",
            "sent1": "The company's success was due to its internationalism, reaching customers worldwide.",
            "sent2": "The festival celebrated cultural diversity and internationalism.",
            "sent3": "The tree's branches symbolized the internationalism of its roots spreading across borders.",
            "sent4": "Her personality had an aura of internationalism, blending different traditions seamlessly.",
            "sent5": "The novel beautifully captured the essence of internationalism through its characters' global journeys."
        }
    ]
}