{
    "term": "interests",
    "meanings": [
        {
            "definition": "The feeling of wanting to know or learn about something.",
            "pos": "noun",
            "sent1": "Her interests include reading and painting.",
            "sent2": "I have a strong interest in astronomy.",
            "sent3": "His interest in dinosaurs is truly fascinating.",
            "sent4": "Curiosity sparked his interest in ancient civilizations.",
            "sent5": "She pursued her interests with great enthusiasm."
        },
        {
            "definition": "The quality of attracting someone's attention or curiosity.",
            "pos": "noun",
            "sent1": "The movie's special effects captured my interests.",
            "sent2": "The mysterious book cover piqued my interest.",
            "sent3": "The magician's tricks held the audience's interest.",
            "sent4": "The painting's vibrant colors drew interest from all viewers.",
            "sent5": "The unusual sculpture sparked public interest."
        },
        {
            "definition": "A person's hobbies or activities.",
            "pos": "noun",
            "sent1": "His interests include playing guitar and hiking.",
            "sent2": "She shared her interests in gardening with her friends.",
            "sent3": "His interest in collecting stamps is quite unique.",
            "sent4": "Exploring new cuisines is one of her favorite interests.",
            "sent5": "Their shared interest in photography brought them together."
        },
        {
            "definition": "A stake or share in a business or property.",
            "pos": "noun",
            "sent1": "He has a financial interest in the company.",
            "sent2": "She bought shares to gain interest in the business.",
            "sent3": "His interest in the property grew after the renovation.",
            "sent4": "Investors have shown great interest in the new project.",
            "sent5": "The partnership agreement outlines each party's interest in the venture."
        }
    ]
}