{
    "term": "intimidatory",
    "meanings": [
        {
            "definition": "Having the quality of causing fear or timidity.",
            "pos": "adjective",
            "sent1": "The dark alley had an intimidatory atmosphere that made me nervous.",
            "sent2": "The teacher's intimidatory glare silenced the noisy students.",
            "sent3": "The tiny kitten tried to act intimidatory towards the big dog, but ended up being cuddled instead.",
            "sent4": "The storm clouds gathered in an intimidatory manner, signaling an impending downpour.",
            "sent5": "The haunted house was filled with intimidatory shadows that seemed to move on their own."
        },
        {
            "definition": "Characterized by intimidation.",
            "pos": "adjective",
            "sent1": "The workplace had an intimidatory culture where employees felt constantly on edge.",
            "sent2": "The gang's intimidatory tactics kept the neighborhood residents in fear.",
            "sent3": "The squirrel's intimidatory behavior towards the birds was actually just a playful chase.",
            "sent4": "The old castle stood on the hill, its towers looming intimidatory over the village below.",
            "sent5": "The movie's soundtrack added an extra layer of intimidatory tension to the suspenseful scene."
        },
        {
            "definition": "Tending to intimidate or frighten.",
            "pos": "adjective",
            "sent1": "The dog's intimidatory growl warned strangers to stay away from its territory.",
            "sent2": "The politician's intimidatory speeches aimed to deter opposition from speaking out.",
            "sent3": "The child's intimidatory mask for Halloween turned out to be more cute than scary.",
            "sent4": "The forest at night had an intimidatory stillness that sent shivers down my spine.",
            "sent5": "The roller coaster's intimidatory height made my heart race with anticipation."
        }
    ]
}