{
    "term": "intoxications",
    "meanings": [
        {
            "definition": "The state of being intoxicated by alcohol or drugs.",
            "pos": "noun",
            "sent1": "After the party, his intoxications were evident from his unsteady walk.",
            "sent2": "The hospital treated many cases of intoxications due to excessive drinking.",
            "sent3": "The intoxications of joy filled the room as they celebrated their victory.",
            "sent4": "Her love for music was like intoxications that filled her soul with happiness.",
            "sent5": "The intoxications of laughter echoed through the hall, creating a joyful atmosphere."
        },
        {
            "definition": "The act of making someone drunk or high.",
            "pos": "noun",
            "sent1": "The bartender's job involves preventing intoxications in customers.",
            "sent2": "Illegal substances can lead to severe intoxications if consumed irresponsibly.",
            "sent3": "The magician's trick involved the intoxications of the audience with his mesmerizing performance.",
            "sent4": "The artist's paintings had the power to create intoxications of wonder in those who viewed them.",
            "sent5": "The intoxications caused by the potion made the character act in a silly manner."
        },
        {
            "definition": "A strong excitement or enthusiasm.",
            "pos": "noun",
            "sent1": "Her intoxications for the upcoming concert were contagious, spreading to her friends.",
            "sent2": "The team's victory brought intoxications of joy to their loyal fans.",
            "sent3": "The children's intoxications for the amusement park trip were evident in their wide smiles.",
            "sent4": "The leader's speech ignited intoxications of hope among the crowd.",
            "sent5": "The intoxications of anticipation filled the air as they waited for the surprise announcement."
        }
    ]
}