{
    "term": "intrude",
    "meanings": [
        {
            "definition": "To come or go in without permission or welcome.",
            "pos": "verb",
            "sent1": "The curious cat would often intrude into our neighbor's garden.",
            "sent2": "Please do not intrude into my personal space without asking first.",
            "sent3": "The mischievous squirrel decided to intrude into the bird feeder for a snack.",
            "sent4": "The loud noise from the construction site seemed to intrude into the peaceful morning.",
            "sent5": "The unwelcome sound of the alarm clock intruded into her dreams, waking her up abruptly."
        },
        {
            "definition": "To thrust or bring in without invitation, permission, or welcome.",
            "pos": "verb",
            "sent1": "The strong wind would intrude through the cracks in the old window.",
            "sent2": "He felt a sense of guilt intrude into his thoughts as he realized his mistake.",
            "sent3": "The unexpected rainstorm seemed to intrude on their picnic plans.",
            "sent4": "The feeling of doubt would intrude into her mind, making her question her decisions.",
            "sent5": "The smell of freshly baked cookies would intrude into the entire house, tempting everyone."
        },
        {
            "definition": "To enter as an uninvited or unwelcome guest.",
            "pos": "verb",
            "sent1": "The raccoon would often intrude into the backyard at night, searching for food.",
            "sent2": "She didn't want to intrude into their private conversation, so she quietly left the room.",
            "sent3": "The loud music from the party next door seemed to intrude into their peaceful evening.",
            "sent4": "The feeling of loneliness would intrude into his heart, making him long for companionship.",
            "sent5": "The bright sunlight would intrude through the curtains, waking him up early in the morning."
        }
    ]
}