{
    "term": "invasive",
    "meanings": [
        {
            "definition": "Tending to spread prolifically and undesirably or harmfully.",
            "pos": "adjective",
            "sent1": "The invasive plant quickly took over the garden, choking out all other flowers.",
            "sent2": "The invasive species of fish disrupted the balance of the pond ecosystem.",
            "sent3": "The invasive vines seemed to have a mind of their own, creeping into every corner of the yard.",
            "sent4": "Her invasive questions invaded his privacy like an unwelcome guest.",
            "sent5": "The invasive smell of burnt popcorn lingered in the office for hours."
        },
        {
            "definition": "Characterized by or involving invasion or aggressive attack.",
            "pos": "adjective",
            "sent1": "The invasive army marched through the enemy territory without mercy.",
            "sent2": "The invasive behavior of the bullies made the students feel unsafe at school.",
            "sent3": "The invasive thunderstorm unleashed its fury on the small town, causing chaos.",
            "sent4": "His invasive glare felt like daggers piercing through her soul.",
            "sent5": "The invasive sound of the alarm shattered the peaceful night."
        },
        {
            "definition": "Of, relating to, or being a species that is not native to an ecosystem.",
            "pos": "adjective",
            "sent1": "The invasive species of beetle threatened the survival of the local plants.",
            "sent2": "The invasive birds competed with the native species for food and nesting sites.",
            "sent3": "The invasive rabbits hopped around the farm, causing mischief wherever they went.",
            "sent4": "The invasive flowers added a splash of color to the otherwise dull landscape.",
            "sent5": "The invasive frog croaked loudly, disrupting the peaceful night sounds."
        }
    ]
}