{
    "term": "investiture",
    "meanings": [
        {
            "definition": "The action of formally investing a person with honors or rank.",
            "pos": "noun",
            "sent1": "During the investiture, the leader received a shiny medal.",
            "sent2": "The investiture ceremony was a grand event with many dignitaries present.",
            "sent3": "At the investiture, the mayor accidentally tripped over their robe.",
            "sent4": "The investiture of power upon the new king was met with cheers and applause.",
            "sent5": "The investiture symbolized the beginning of a new chapter in the leader's life."
        },
        {
            "definition": "The formal bestowal of the authority to carry out a specific role or duty.",
            "pos": "noun",
            "sent1": "The investiture of responsibilities onto the student council members was a solemn occasion.",
            "sent2": "After the investiture, the new manager wasted no time in making important decisions.",
            "sent3": "During the investiture, the principal accidentally handed the wrong certificate to a student.",
            "sent4": "The investiture of trust in the employee proved to be a wise decision by the company.",
            "sent5": "The investiture ceremony marked the official beginning of the captain's leadership."
        },
        {
            "definition": "The garments worn during a formal ceremony of investiture.",
            "pos": "noun",
            "sent1": "The investiture attire consisted of a regal robe and a golden crown.",
            "sent2": "The investiture robes were carefully tailored to fit each recipient perfectly.",
            "sent3": "During the investiture, the robe got caught on a chair, causing a moment of embarrassment.",
            "sent4": "The investiture garments shimmered under the bright lights of the ceremony hall.",
            "sent5": "The investiture outfit made the wearer feel like royalty for a day."
        }
    ]
}