{
    "term": "invertors",
    "meanings": [
        {
            "definition": "A person or thing that inverts.",
            "pos": "noun",
            "sent1": "The invertors at the circus amazed the audience with their acrobatic skills.",
            "sent2": "The inventor of the new gadget was hailed as a genius.",
            "sent3": "The invertors in the funhouse made everyone laugh with their silly antics.",
            "sent4": "Her mind worked like an invertor, always seeing things from a different perspective.",
            "sent5": "The little girl imagined herself as an invertor, turning the world upside down with her imagination."
        },
        {
            "definition": "A device that converts direct current into alternating current.",
            "pos": "noun",
            "sent1": "The invertors in the power station helped supply electricity to the city.",
            "sent2": "The engineer installed the invertors to ensure a steady flow of power.",
            "sent3": "The invertors hummed softly as they transformed the energy source.",
            "sent4": "The invertors acted like magic wands, changing the electrical current effortlessly.",
            "sent5": "The invertors buzzed with energy, turning the direct current into a useful form for homes."
        },
        {
            "definition": "A device that reverses the order or position of something.",
            "pos": "noun",
            "sent1": "The invertors on the conveyor belt flipped the boxes upside down for packaging.",
            "sent2": "The factory used invertors to rearrange the products efficiently.",
            "sent3": "The invertors in the puzzle game twisted and turned the pieces in unexpected ways.",
            "sent4": "His words acted as invertors, changing the meaning of the conversation completely.",
            "sent5": "The artist's brush was like an invertor, reshuffling the colors on the canvas in a new pattern."
        }
    ]
}