{
    "term": "investitures",
    "meanings": [
        {
            "definition": "The action of formally investing a person with honors or rank.",
            "pos": "noun",
            "sent1": "During the investitures, the leader bestowed honors upon the brave soldiers.",
            "sent2": "The investitures at the ceremony marked the official recognition of their achievements.",
            "sent3": "At the investitures, everyone received a shiny badge as a symbol of their hard work.",
            "sent4": "The investitures were like a magical transformation, turning ordinary citizens into respected officials.",
            "sent5": "The investitures were a grand event, making the recipients feel truly special."
        },
        {
            "definition": "The formal bestowal of the symbols of office or rank.",
            "pos": "noun",
            "sent1": "The investitures included handing over the keys to the new office.",
            "sent2": "The investitures ceremony featured the presentation of the official uniform.",
            "sent3": "During the investitures, each person received a unique badge representing their role.",
            "sent4": "The investitures were like passing the torch of responsibility to the next generation.",
            "sent5": "The investitures were a symbolic moment, signifying the beginning of their new roles."
        },
        {
            "definition": "The ceremony of investing a person with the insignia of an office.",
            "pos": "noun",
            "sent1": "The investitures involved the solemn placement of the office badge.",
            "sent2": "At the investitures, the official seal was handed over to the new leader.",
            "sent3": "During the investitures, each person proudly wore the office emblem.",
            "sent4": "The investitures felt like a royal coronation, with the office symbols gleaming.",
            "sent5": "The investitures were a moment of pride, as the insignia marked their official roles."
        }
    ]
}