{
    "term": "invigorate",
    "meanings": [
        {
            "definition": "Give strength or energy to.",
            "pos": "verb",
            "sent1": "A brisk walk in the fresh air can invigorate your body.",
            "sent2": "Drinking a glass of water in the morning can invigorate you for the day ahead.",
            "sent3": "The energetic music seemed to invigorate the sleepy cat, making it playfully chase after a toy.",
            "sent4": "The sunrise over the mountains invigorated her spirit, filling her with a renewed sense of purpose.",
            "sent5": "The coach's motivational speech was like a shot of invigorating energy, inspiring the team to give their all."
        },
        {
            "definition": "Make someone feel strong and healthy.",
            "pos": "verb",
            "sent1": "The hearty soup will invigorate you when you're feeling under the weather.",
            "sent2": "Exercising regularly can invigorate both your body and mind.",
            "sent3": "The superhero movie invigorated the young audience, making them feel like they could conquer anything.",
            "sent4": "Her encouraging words were like a warm hug, invigorating him with a sense of well-being.",
            "sent5": "The fresh scent of pine trees in the forest invigorated her senses, making her feel alive and vibrant."
        },
        {
            "definition": "Make something more lively or exciting.",
            "pos": "verb",
            "sent1": "Adding colorful decorations can invigorate a dull room and make it more vibrant.",
            "sent2": "The unexpected plot twist in the story invigorated the readers, keeping them engaged until the end.",
            "sent3": "The energetic dance performance invigorated the audience, bringing a sense of joy and excitement.",
            "sent4": "The new paint job on the old car invigorated its appearance, making it look brand new.",
            "sent5": "The cool breeze on a hot summer day invigorated everyone at the picnic, creating a lively atmosphere."
        }
    ]
}