{
    "term": "invocating",
    "meanings": [
        {
            "definition": "To call upon (a deity or spirit) in prayer, as a witness, or for inspiration.",
            "pos": "verb",
            "sent1": "She was invocating the gods for guidance during her difficult journey.",
            "sent2": "The priest invocated the divine spirits to bless the newborn baby.",
            "sent3": "While invocating the ancient spirits, the young witch accidentally summoned a mischievous imp.",
            "sent4": "Her heartfelt invocating seemed to awaken a dormant power within her.",
            "sent5": "The sound of her invocating echoed through the sacred grove, filling the air with reverence."
        },
        {
            "definition": "To appeal to or cite as authority.",
            "pos": "verb",
            "sent1": "The lawyer was invocating a precedent to support his argument in court.",
            "sent2": "He invocated the wise words of his grandfather to guide him in times of trouble.",
            "sent3": "Invocating the rule book, she confidently challenged the referee's decision.",
            "sent4": "The author invocated historical events to emphasize the importance of learning from the past.",
            "sent5": "By invocating the teachings of her mentor, she found the strength to overcome her fears."
        },
        {
            "definition": "To summon with incantations; conjure.",
            "pos": "verb",
            "sent1": "The sorcerer was invocating a powerful spell to protect the village from harm.",
            "sent2": "They invocated the ancient ritual to bring forth the spirit of the forest.",
            "sent3": "Invocating the spell incorrectly resulted in a comical display of floating objects.",
            "sent4": "The magician invocated a mesmerizing illusion that left the audience in awe.",
            "sent5": "By invocating the enchanted amulet, she was able to unlock its hidden powers."
        }
    ]
}