{
    "term": "invocations",
    "meanings": [
        {
            "definition": "The act of invoking or calling upon a higher power for assistance.",
            "pos": "noun",
            "sent1": "During the ceremony, the priest made invocations to the gods for a bountiful harvest.",
            "sent2": "The community gathered together to offer invocations for peace and prosperity.",
            "sent3": "The invocations for good weather seemed to work as the sun shone brightly all day.",
            "sent4": "Her invocations to the universe for guidance were answered with a sense of clarity.",
            "sent5": "The invocations for protection echoed through the ancient temple, filling the air with reverence."
        },
        {
            "definition": "A formal request for guidance or support.",
            "pos": "noun",
            "sent1": "The student's invocations for extra help with the assignment were heard by the teacher.",
            "sent2": "She sent a heartfelt invocation to her friends for their assistance during a difficult time.",
            "sent3": "His comical invocations for a miracle to finish his homework on time made everyone laugh.",
            "sent4": "The company's invocation for financial backing was met with a generous donation.",
            "sent5": "The invocations for emotional support from loved ones brought comfort during the tough situation."
        },
        {
            "definition": "The act of summoning or calling forth.",
            "pos": "noun",
            "sent1": "The magician's invocations of mystical creatures amazed the audience.",
            "sent2": "The ancient ritual involved invocations of spirits from the other realm.",
            "sent3": "His playful invocations of his inner child brought laughter to the group.",
            "sent4": "The invocations of courage from within helped her face her fears head-on.",
            "sent5": "The invocations of positive energy filled the room with a sense of peace and harmony."
        }
    ]
}