{
    "term": "invocation",
    "meanings": [
        {
            "definition": "The act of calling upon a higher power for assistance or guidance.",
            "pos": "noun",
            "sent1": "During the ceremony, the priest led the invocation to ask for blessings.",
            "sent2": "The community gathered for the invocation to seek divine intervention.",
            "sent3": "The magician's invocation for a rabbit to appear turned into a funny moment when a squirrel showed up instead.",
            "sent4": "Her invocation for strength was like a beacon of light guiding her through tough times.",
            "sent5": "The sound of the bell marked the start of the invocation, filling the room with a sense of peace."
        },
        {
            "definition": "A formal request for help or support.",
            "pos": "noun",
            "sent1": "The student's invocation for extra time on the exam was denied by the teacher.",
            "sent2": "The charity organization made an invocation for donations to support their cause.",
            "sent3": "His invocation for a second chance at the game was met with laughter from his teammates.",
            "sent4": "The captain's invocation for teamwork was like a rallying cry before the big match.",
            "sent5": "The mayor's invocation for unity resonated with the crowd, inspiring them to come together for a common goal."
        },
        {
            "definition": "The act of summoning a spirit or deity.",
            "pos": "noun",
            "sent1": "The witch performed an invocation to call upon the spirits of the forest.",
            "sent2": "In ancient times, people would gather for an invocation to summon the gods for protection.",
            "sent3": "The children's playful invocation for a friendly ghost to appear led to giggles and excitement.",
            "sent4": "The shaman's invocation for healing was like a bridge between the physical and spiritual realms.",
            "sent5": "The tribal chief's invocation for rain was accompanied by rhythmic drumming, creating a mystical atmosphere."
        }
    ]
}