{
    "term": "invoke",
    "meanings": [
        {
            "definition": "Call on (a deity or spirit) in prayer, as a witness, or for inspiration.",
            "pos": "verb",
            "sent1": "During the ceremony, the priest will invoke the blessings of the gods.",
            "sent2": "She decided to invoke the guidance of her ancestors during this difficult time.",
            "sent3": "The young girl would often playfully invoke the help of imaginary fairies in her games.",
            "sent4": "The artist's painting seemed to invoke the tranquility of a serene forest.",
            "sent5": "The old man's words were so powerful, they seemed to invoke a sense of peace in everyone around him."
        },
        {
            "definition": "Cite or appeal to (someone or something) as an authority for an action or in support of an argument.",
            "pos": "verb",
            "sent1": "The lawyer will invoke the testimony of the witness to prove his case.",
            "sent2": "In his essay, he chose to invoke the words of a famous philosopher to strengthen his argument.",
            "sent3": "The student jokingly tried to invoke the authority of his pet dog to get out of doing homework.",
            "sent4": "Her speech managed to invoke the wisdom of past leaders to inspire the audience.",
            "sent5": "The politician's words were carefully crafted to invoke a sense of unity among the citizens."
        },
        {
            "definition": "Summon (a law or precedent) in support of one's case.",
            "pos": "verb",
            "sent1": "The attorney will invoke the legal precedent to defend his client in court.",
            "sent2": "During the debate, the debater tried to invoke a specific law to strengthen his argument.",
            "sent3": "The children playfully decided to invoke the 'no dessert before dinner' rule to avoid eating vegetables.",
            "sent4": "The author's novel seemed to invoke the spirit of classic literature in a modern setting.",
            "sent5": "The teacher's words were able to invoke a sense of responsibility in the students to study harder."
        }
    ]
}