{
    "term": "involved",
    "meanings": [
        {
            "definition": "Included in a situation or activity",
            "pos": "adjective",
            "sent1": "She felt involved in the game when her friends asked her to join.",
            "sent2": "It's important for everyone to feel involved in the decision-making process.",
            "sent3": "The cat seemed involved in the family meeting, sitting right in the middle of the table.",
            "sent4": "The colors of the painting were so involved that it took hours to appreciate all the details.",
            "sent5": "The mystery novel had such an involved plot that readers couldn't guess the ending."
        },
        {
            "definition": "Complicated or intricate",
            "pos": "adjective",
            "sent1": "The math problem looked so involved that many students found it challenging.",
            "sent2": "The artist's painting was so involved with tiny details that it mesmerized viewers.",
            "sent3": "Trying to untangle the headphones was an involved task that required patience.",
            "sent4": "The dance routine was so involved that it took weeks of practice to get it right.",
            "sent5": "The clock mechanism was incredibly involved, with gears and springs working together seamlessly."
        },
        {
            "definition": "Emotionally connected or invested",
            "pos": "adjective",
            "sent1": "She was deeply involved in the charity work, feeling a strong connection to the cause.",
            "sent2": "The actor was so involved in the emotional scene that tears welled up in his eyes.",
            "sent3": "The puppy looked involved in the game of fetch, wagging its tail eagerly.",
            "sent4": "Her speech was so involved with passion that the audience was moved to tears.",
            "sent5": "The music was so involved with emotion that it touched the hearts of everyone in the room."
        }
    ]
}