{
    "term": "ironside",
    "meanings": [
        {
            "definition": "A person or thing that is strong and unyielding.",
            "pos": "noun",
            "sent1": "The old warrior was known as an ironside for his unwavering courage.",
            "sent2": "The mountain stood tall and firm like an ironside against the wind.",
            "sent3": "The stubborn mule was jokingly called an ironside by the villagers.",
            "sent4": "Her determination was an ironside shield against any doubts or fears.",
            "sent5": "The ancient tree's roots were like ironside anchors keeping it firmly in place."
        },
        {
            "definition": "A type of ship used in the past for war.",
            "pos": "noun",
            "sent1": "The historical documentary featured a majestic ironside sailing across the sea.",
            "sent2": "The sailors prepared the ironside for battle against enemy fleets.",
            "sent3": "The children played pretend, pretending their wooden boat was a mighty ironside.",
            "sent4": "The ironside cut through the waves like a sharp sword through the air.",
            "sent5": "The ironside's cannons roared, echoing across the ocean in a display of power."
        },
        {
            "definition": "A type of armor made of iron plates.",
            "pos": "noun",
            "sent1": "The knight donned his ironside before heading into the jousting tournament.",
            "sent2": "The museum displayed a collection of medieval ironside suits.",
            "sent3": "The clumsy squire struggled to lift the heavy ironside armor.",
            "sent4": "The ironside gleamed under the sunlight, reflecting its strength and resilience.",
            "sent5": "The blacksmith carefully crafted each piece of the ironside to perfection."
        },
        {
            "definition": "To strengthen or fortify with iron.",
            "pos": "verb",
            "sent1": "The blacksmith would ironside the gate to make it more secure.",
            "sent2": "The workers decided to ironside the bridge to ensure its durability.",
            "sent3": "The chef joked that he would ironside the skillet to make it indestructible.",
            "sent4": "The engineer planned to ironside the structure to withstand any earthquakes.",
            "sent5": "The carpenter used iron nails to ironside the wooden frame of the house."
        }
    ]
}