{
    "term": "iron",
    "meanings": [
        {
            "definition": "A strong, hard magnetic silvery-gray metal",
            "pos": "noun",
            "sent1": "The iron in the toolbox was heavy.",
            "sent2": "The iron bar was used to build the structure.",
            "sent3": "The iron block tried to stick to the magnet, but it kept slipping away.",
            "sent4": "Her will was as unyielding as iron when it came to her beliefs.",
            "sent5": "The iron sword gleamed in the sunlight, ready for battle."
        },
        {
            "definition": "A tool or implement made of iron",
            "pos": "noun",
            "sent1": "The blacksmith forged a new iron for the farmer.",
            "sent2": "The iron hammer was perfect for driving in the nails.",
            "sent3": "The iron pot danced on the stove, bubbling with soup.",
            "sent4": "Her words were like an iron, striking fear into his heart.",
            "sent5": "The iron key unlocked the ancient chest, revealing its treasures."
        },
        {
            "definition": "To press clothes with a heated iron",
            "pos": "verb",
            "sent1": "She would iron her dress before the party.",
            "sent2": "He ironed his shirt to remove the wrinkles.",
            "sent3": "The iron glided smoothly over the fabric, making it crisp.",
            "sent4": "Her words ironed out the misunderstandings between them.",
            "sent5": "The sun seemed to iron out the wrinkles of the vast ocean."
        },
        {
            "definition": "To make hard, stern, or unyielding",
            "pos": "verb",
            "sent1": "He tried to iron out his emotions before the meeting.",
            "sent2": "The teacher ironed out the rules for the class.",
            "sent3": "Her strict rules ironed out any chance of chaos in the house.",
            "sent4": "The experience ironed his resolve to succeed.",
            "sent5": "The mountain range stood like an iron barrier against the storm."
        }
    ]
}