{
    "term": "irradiations",
    "meanings": [
        {
            "definition": "The act of illuminating or shining light on something.",
            "pos": "noun",
            "sent1": "The room was filled with bright irradiations from the morning sun.",
            "sent2": "The garden was bathed in warm irradiations as the sun set.",
            "sent3": "The cat basked lazily in the gentle irradiations coming through the window.",
            "sent4": "Her smile was like a burst of joyful irradiations in the room.",
            "sent5": "The painting captured the artist's skill in portraying different shades of irradiations."
        },
        {
            "definition": "The process of exposing something to radiation.",
            "pos": "noun",
            "sent1": "The doctor explained the importance of protecting oneself from harmful irradiations.",
            "sent2": "The irradiations used in cancer treatment are carefully controlled for maximum effectiveness.",
            "sent3": "The superhero's power came from a rare irradiations accident in the lab.",
            "sent4": "The scientist likened the experiment to subjecting the material to intense irradiations.",
            "sent5": "The spaceship's shield protected the crew from dangerous cosmic irradiations."
        },
        {
            "definition": "The emission of light or heat from a source.",
            "pos": "noun",
            "sent1": "The campfire's comforting irradiations kept the group warm in the chilly night.",
            "sent2": "The city skyline glowed with the vibrant irradiations of neon lights.",
            "sent3": "The dragon's fiery breath was an intense burst of scorching irradiations.",
            "sent4": "The stage lights flooded the theater with dazzling irradiations during the performance.",
            "sent5": "The sunrise painted the sky with soft, golden irradiations, signaling the start of a new day."
        }
    ]
}