{
    "term": "irresponsibleness",
    "meanings": [
        {
            "definition": "Lacking a sense of responsibility or accountability.",
            "pos": "adjective",
            "sent1": "Her irresponsibleness behavior led to many problems at work.",
            "sent2": "The student's irresponsibleness attitude towards homework affected his grades.",
            "sent3": "His irresponsibleness in forgetting his keys made him late for the third time this week.",
            "sent4": "The company suffered due to the irresponsibleness decisions made by the manager.",
            "sent5": "The consequences of her irresponsibleness were evident in the chaos that ensued."
        },
        {
            "definition": "Not capable of being trusted or relied upon.",
            "pos": "adjective",
            "sent1": "The old car's irresponsibleness engine broke down on the highway.",
            "sent2": "His irresponsibleness promises left her feeling disappointed and let down.",
            "sent3": "The unreliable weather forecast showed its irresponsibleness when it rained unexpectedly.",
            "sent4": "The bridge's irresponsibleness structure could not withstand the heavy storm.",
            "sent5": "The irresponsibleness alarm clock failed to wake him up for the important meeting."
        },
        {
            "definition": "Showing a lack of concern for the consequences of one's actions.",
            "pos": "adjective",
            "sent1": "His irresponsibleness behavior at the party caused a lot of trouble.",
            "sent2": "The company suffered due to the employee's irresponsibleness decisions.",
            "sent3": "She laughed at the irresponsibleness situation she found herself in.",
            "sent4": "The irresponsibleness driver ignored the traffic rules and caused an accident.",
            "sent5": "The consequences of his irresponsibleness actions were severe and irreversible."
        }
    ]
}