{
    "term": "irregardless",
    "meanings": [
        {
            "definition": "Regardless",
            "pos": "adverb",
            "sent1": "Irregardless, she always arrives on time.",
            "sent2": "He continued to work, irregardless of the obstacles.",
            "sent3": "The cat, irregardless of the closed door, found a way to sneak in.",
            "sent4": "Her determination was like a river, flowing steadily irregardless of the rocks in its path.",
            "sent5": "The sun shines brightly, irregardless of the clouds in the sky."
        },
        {
            "definition": "Without regard",
            "pos": "adverb",
            "sent1": "Irregardless of the consequences, he spoke his mind.",
            "sent2": "She spent money freely, irregardless of her savings.",
            "sent3": "The child, irregardless of the mess, happily played in the mud.",
            "sent4": "His words cut through the silence, irregardless of the tension in the room.",
            "sent5": "The flowers bloomed beautifully, irregardless of the lack of rain."
        },
        {
            "definition": "In spite of",
            "pos": "preposition",
            "sent1": "Irregardless of the rain, the picnic went on as planned.",
            "sent2": "They continued their journey, irregardless of the storm approaching.",
            "sent3": "The team won the game, irregardless of the injuries they faced.",
            "sent4": "She smiled brightly, irregardless of the challenges ahead.",
            "sent5": "The tree stood tall, irregardless of the strong winds."
        },
        {
            "definition": "Nevertheless",
            "pos": "adverb",
            "sent1": "Irregardless, he decided to give it a try.",
            "sent2": "She was tired, but irregardless, she kept going.",
            "sent3": "The cake was burnt, but irregardless, they still enjoyed it.",
            "sent4": "The road was long, but irregardless, they reached their destination.",
            "sent5": "The dog was old, but irregardless, it played like a puppy."
        }
    ]
}