{
    "term": "irritancy",
    "meanings": [
        {
            "definition": "The quality or state of being irritating or annoying.",
            "pos": "noun",
            "sent1": "The constant irritancy of the buzzing mosquito kept me awake all night.",
            "sent2": "Her habit of tapping her pen on the desk was a constant irritancy to her classmates.",
            "sent3": "The irritancy of the squeaky door was so persistent that it almost seemed intentional.",
            "sent4": "The irritancy of the dripping faucet echoed through the empty house like a haunting melody.",
            "sent5": "The irritancy of the scratchy fabric against his skin made him squirm uncomfortably."
        },
        {
            "definition": "A source of irritation or annoyance.",
            "pos": "noun",
            "sent1": "The loud neighbors were a major irritancy in the otherwise peaceful neighborhood.",
            "sent2": "The slow internet connection was a constant irritancy for the remote workers.",
            "sent3": "The barking dog next door became an irritancy that disrupted the entire street.",
            "sent4": "The never-ending traffic jam was an irritancy that tested everyone's patience.",
            "sent5": "The persistent telemarketing calls were an irritancy that drove her to disconnect the phone."
        },
        {
            "definition": "The act of causing irritation or annoyance.",
            "pos": "noun",
            "sent1": "His constant interrupting of the teacher's explanations was an irritancy in the classroom.",
            "sent2": "The repetitive beeping of the alarm clock was an irritancy that woke him up every morning.",
            "sent3": "The irritancy of the dripping faucet was finally fixed after weeks of complaints.",
            "sent4": "The irritancy of the broken elevator forced everyone to take the stairs.",
            "sent5": "The irritancy of the malfunctioning printer caused delays in the office workflow."
        }
    ]
}