{
    "term": "irrigating",
    "meanings": [
        {
            "definition": "Supplying water to land or crops to help growth",
            "pos": "noun",
            "sent1": "The farmer's irrigation system was essential for irrigating his fields.",
            "sent2": "Irrigating the crops regularly ensured they grew healthy and strong.",
            "sent3": "The irrigation worker accidentally sprayed himself while irrigating the plants.",
            "sent4": "Her care and attention were like a gentle rain, irrigating the garden of their friendship.",
            "sent5": "The sound of water irrigating the fields was music to the farmer's ears."
        },
        {
            "definition": "To supply land or crops with water",
            "pos": "verb",
            "sent1": "The farmer spent hours irrigating the dry soil to help his crops grow.",
            "sent2": "Irrigating the fields during the dry season was crucial for a successful harvest.",
            "sent3": "She joked that she was irrigating the plants with her tears because she forgot the watering can.",
            "sent4": "His words were like a refreshing stream, irrigating hope into her heart.",
            "sent5": "The sprinklers were busy irrigating the lawn, making it lush and green."
        },
        {
            "definition": "To cleanse or wash out with a flow of water",
            "pos": "verb",
            "sent1": "The dentist recommended irrigating the gums after every meal to prevent infection.",
            "sent2": "Irrigating the wound with antiseptic helped prevent any potential infections.",
            "sent3": "She felt like she was irrigating her mind when she took a long shower after a stressful day.",
            "sent4": "The rain came down in torrents, irrigating the streets and washing away the dirt.",
            "sent5": "The river flowed through the valley, irrigating away all traces of the previous day's troubles."
        }
    ]
}