{
    "term": "ischemic",
    "meanings": [
        {
            "definition": "relating to, involving, or affected by ischemia",
            "pos": "adjective",
            "sent1": "The doctor explained that the ischemic heart attack was due to a lack of blood flow.",
            "sent2": "The patient's ischemic condition required immediate medical attention.",
            "sent3": "Despite his ischemic leg, the runner managed to finish the race with a smile.",
            "sent4": "Her ischemic fingers felt numb, like they were encased in ice.",
            "sent5": "The ischemic area of the brain was clearly visible on the scan, showing the impact of reduced blood flow."
        },
        {
            "definition": "causing or characterized by ischemia",
            "pos": "adjective",
            "sent1": "The ischemic blockage in the artery led to severe pain in his chest.",
            "sent2": "The ischemic stroke left lasting damage to his speech abilities.",
            "sent3": "The ischemic traffic jam on the highway frustrated all the drivers.",
            "sent4": "Her ischemic decision to skip breakfast resulted in a mid-morning energy crash.",
            "sent5": "The ischemic condition of the pipes caused water to flow slowly, affecting the entire building."
        },
        {
            "definition": "pertaining to a condition in which there is an inadequate blood supply to a part of the body",
            "pos": "adjective",
            "sent1": "The ischemic foot needed special care to improve blood circulation.",
            "sent2": "The patient's ischemic leg was a result of a blocked artery.",
            "sent3": "The ischemic picnic ran out of food before everyone had a chance to eat.",
            "sent4": "Her ischemic phone battery died just as she was about to make an important call.",
            "sent5": "The ischemic area of the garden struggled to grow plants due to poor irrigation."
        }
    ]
}