{
    "term": "isles",
    "meanings": [
        {
            "definition": "A small island",
            "pos": "noun",
            "sent1": "The sailor discovered a hidden isles during his voyage.",
            "sent2": "The tropical isles were a paradise for vacationers.",
            "sent3": "The isles in the lake seemed to play hide and seek with the visitors.",
            "sent4": "The isles stood like jewels in the vast ocean, beckoning explorers.",
            "sent5": "The isles were like tiny emeralds in the sea, shimmering under the sun."
        },
        {
            "definition": "A small peninsula or promontory",
            "pos": "noun",
            "sent1": "The isles jutted out into the sea, offering a stunning view.",
            "sent2": "The rocky isles provided a natural barrier against the waves.",
            "sent3": "The isles looked like the outstretched arms of a giant trying to swim.",
            "sent4": "The isles were like fingers reaching into the vast blue expanse.",
            "sent5": "The isles resembled the nose of a great sea creature, sniffing the salty air."
        },
        {
            "definition": "A small piece of land surrounded by water",
            "pos": "noun",
            "sent1": "The isles in the pond were home to many ducks and fish.",
            "sent2": "The lush green isles in the river added to the beauty of the landscape.",
            "sent3": "The isles seemed to float like lily pads on the calm water.",
            "sent4": "The isles were like tiny oases in the middle of the river.",
            "sent5": "The isles were like stepping stones for the adventurous frog."
        },
        {
            "definition": "A small group or cluster of islands",
            "pos": "noun",
            "sent1": "The archipelago consisted of several isles, each with its own charm.",
            "sent2": "The isles in the bay formed a picturesque scene for painters.",
            "sent3": "The isles huddled together like a family of tiny islands.",
            "sent4": "The isles were like a necklace of pearls adorning the ocean.",
            "sent5": "The isles were like puzzle pieces waiting to be explored and connected."
        }
    ]
}