{
    "term": "iso",
    "meanings": [
        {
            "definition": "Equal",
            "pos": "adjective",
            "sent1": "The two boxes are iso in size.",
            "sent2": "The twins have iso heights.",
            "sent3": "It's funny how the cupcakes are always iso in frosting.",
            "sent4": "Their friendship is like an iso balance scale, always in perfect harmony.",
            "sent5": "The classroom desks are arranged in an iso pattern for fairness."
        },
        {
            "definition": "Same",
            "pos": "adjective",
            "sent1": "The colors of the flags are iso.",
            "sent2": "The shoes are iso in style.",
            "sent3": "It's strange how their voices sound iso on the phone.",
            "sent4": "Their thoughts were like iso puzzle pieces, fitting perfectly together.",
            "sent5": "The keys on the piano are pressed with iso force for consistency."
        },
        {
            "definition": "Isomer",
            "pos": "noun",
            "sent1": "The scientist studied the iso of the molecule.",
            "sent2": "The lab had various iso for experimentation.",
            "sent3": "The party had an iso of different snacks for everyone to enjoy.",
            "sent4": "The garden was a beautiful iso of colorful flowers.",
            "sent5": "The artist created an iso of shapes in the painting."
        },
        {
            "definition": "Isolate",
            "pos": "verb",
            "sent1": "She had to iso herself from the noise to focus.",
            "sent2": "The doctor needed to iso the virus in the lab.",
            "sent3": "He tried to iso the red socks from the white laundry.",
            "sent4": "The detective had to iso the crucial evidence from the rest.",
            "sent5": "The chef had to iso the fresh ingredients for the recipe."
        },
        {
            "definition": "Isolation",
            "pos": "noun",
            "sent1": "The feeling of iso was overwhelming in the empty room.",
            "sent2": "The prisoner experienced long periods of iso.",
            "sent3": "The cat sought iso under the bed during the storm.",
            "sent4": "The tree stood in iso at the edge of the forest.",
            "sent5": "The astronaut felt iso in the vastness of space."
        }
    ]
}