{
    "term": "isolated",
    "meanings": [
        {
            "definition": "Separated from others",
            "pos": "adjective",
            "sent1": "The small cabin was isolated from the rest of the village.",
            "sent2": "The cat felt isolated when its owner went on vacation.",
            "sent3": "The isolated cookie in the jar felt lonely without its friends.",
            "sent4": "The isolated island in the ocean seemed like a forgotten piece of paradise.",
            "sent5": "The isolated tree in the field stood alone against the wind."
        },
        {
            "definition": "Alone or lonely",
            "pos": "adjective",
            "sent1": "The isolated child sat quietly in the corner of the playground.",
            "sent2": "She felt isolated in the new school until she made a friend.",
            "sent3": "The isolated teddy bear on the shelf longed for a hug.",
            "sent4": "The isolated star in the night sky twinkled sadly.",
            "sent5": "The isolated snowflake drifted down from the sky, feeling alone."
        },
        {
            "definition": "Kept apart from others",
            "pos": "adjective",
            "sent1": "The isolated prisoner spent days in solitary confinement.",
            "sent2": "The rare flower was isolated from the other plants for protection.",
            "sent3": "The isolated puzzle piece couldn't find where it belonged.",
            "sent4": "The isolated book on the shelf had a story waiting to be discovered.",
            "sent5": "The isolated cloud drifted away from the group, feeling left out."
        },
        {
            "definition": "Remote or secluded",
            "pos": "adjective",
            "sent1": "The isolated cabin in the mountains was a peaceful retreat.",
            "sent2": "The village was isolated by the deep snowfall in winter.",
            "sent3": "The isolated lighthouse on the cliff guided ships safely.",
            "sent4": "The isolated beach was a hidden gem for those seeking solitude.",
            "sent5": "The isolated mountain peak was a challenging climb for experienced hikers."
        }
    ]
}