{
    "term": "isoproterenol",
    "meanings": [
        {
            "definition": "A synthetic catecholamine used as a bronchodilator and vasodilator.",
            "pos": "noun",
            "sent1": "The doctor prescribed isoproterenol to help widen the patient's airways.",
            "sent2": "The nurse administered isoproterenol to help the patient breathe better.",
            "sent3": "The isoproterenol made the lungs feel like they were taking a refreshing deep breath.",
            "sent4": "The effect of isoproterenol on the airways was like opening a window to let in fresh air.",
            "sent5": "The image of isoproterenol expanding the air passages stuck in the patient's mind."
        },
        {
            "definition": "A medication used to treat bradycardia and heart block.",
            "pos": "noun",
            "sent1": "The paramedic quickly administered isoproterenol to treat the patient's slow heart rate.",
            "sent2": "The cardiologist prescribed isoproterenol to help with the heart blockage.",
            "sent3": "The isoproterenol worked like a superhero, saving the heart from its troubles.",
            "sent4": "The impact of isoproterenol on the heart was like a sudden jolt of energy.",
            "sent5": "The thought of isoproterenol racing to rescue the heart was comforting to the patient."
        },
        {
            "definition": "A drug that stimulates beta-adrenergic receptors.",
            "pos": "noun",
            "sent1": "The isoproterenol activates the beta-adrenergic receptors to improve heart function.",
            "sent2": "Doctors use isoproterenol to target specific receptors in the body.",
            "sent3": "The beta-adrenergic receptors danced with joy when they met isoproterenol.",
            "sent4": "Isoproterenol's effect on the receptors was like a key unlocking a door to better health.",
            "sent5": "The image of isoproterenol interacting with the receptors was crystal clear in the researcher's mind."
        }
    ]
}