{
    "term": "jackshafts",
    "meanings": [
        {
            "definition": "A shaft used for transmitting power between a driving shaft and a driven shaft.",
            "pos": "noun",
            "sent1": "The mechanic explained how the jackshafts help transfer power in the engine.",
            "sent2": "The factory's machinery relies on sturdy jackshafts to move energy efficiently.",
            "sent3": "The jackshafts in the old tractor had a chat about their important job.",
            "sent4": "The jackshafts in the clockwork of life turn steadily, connecting one moment to the next.",
            "sent5": "The shiny jackshafts gleamed in the sunlight, showcasing their vital role in the system."
        },
        {
            "definition": "A shaft that supports gears or pulleys in a machine.",
            "pos": "noun",
            "sent1": "The jackshafts in the bicycle keep the gears turning smoothly.",
            "sent2": "The factory workers checked the jackshafts to ensure the machine's proper functioning.",
            "sent3": "The mischievous squirrel mistook the jackshafts for a playground and tried to climb them.",
            "sent4": "The jackshafts hummed in harmony, supporting the intricate dance of the machine's components.",
            "sent5": "The worn-out jackshafts groaned under the weight of the heavy gears, signaling the need for maintenance."
        },
        {
            "definition": "A shaft that changes the direction of power transmission in a machine.",
            "pos": "noun",
            "sent1": "The engineer adjusted the jackshafts to redirect the power flow in the system.",
            "sent2": "The jackshafts in the windmill efficiently alter the direction of energy for optimal performance.",
            "sent3": "The playful cat batted at the jackshafts, trying to figure out their purpose in the machine.",
            "sent4": "Like a skilled conductor, the jackshafts orchestrated the flow of power through the mechanical symphony.",
            "sent5": "The brightly colored jackshafts twisted and turned, guiding the power along unexpected paths within the machine."
        }
    ]
}