{
    "term": "jackknifes",
    "meanings": [
        {
            "definition": "A type of knife with a folding blade.",
            "pos": "noun",
            "sent1": "My grandpa always carries a jackknifes in his pocket for cutting fruits.",
            "sent2": "The scout used his jackknifes to carve a wooden figurine during the camping trip.",
            "sent3": "The chef's favorite tool in the kitchen is the trusty jackknifes.",
            "sent4": "In the old Western movie, the cowboy skillfully wielded his jackknifes for various tasks.",
            "sent5": "The collector proudly displayed his antique jackknifes collection in a glass case."
        },
        {
            "definition": "To fold or bend in the middle like a jackknife.",
            "pos": "verb",
            "sent1": "She carefully jackknifes the paper to fit it into the envelope.",
            "sent2": "The gymnast effortlessly jackknifes her body during the routine.",
            "sent3": "The magician seemed to jackknifes his body in impossible ways during the performance.",
            "sent4": "The flexible yoga instructor can easily jackknifes into different poses.",
            "sent5": "The acrobat's incredible strength allows him to jackknifes his body with grace and precision."
        },
        {
            "definition": "A type of dive where the diver bends at the waist and brings the legs up towards the head before straightening out.",
            "pos": "noun",
            "sent1": "The Olympic diver executed a perfect jackknifes during the competition.",
            "sent2": "The synchronized swimmers practiced their jackknifes for the upcoming routine.",
            "sent3": "The penguin at the zoo did a comical jackknifes into the water, splashing everyone around.",
            "sent4": "The dolphin's leap out of the water resembled a majestic jackknifes in motion.",
            "sent5": "The graceful swan performed a beautiful jackknifes before gliding elegantly across the pond."
        }
    ]
}