{
    "term": "jackshaft",
    "meanings": [
        {
            "definition": "A shaft used for transmitting power between a driving shaft and a driven shaft.",
            "pos": "noun",
            "sent1": "The jackshaft efficiently transfers power from one shaft to another.",
            "sent2": "The mechanic replaced the worn-out jackshaft in the engine.",
            "sent3": "The jackshaft decided it was tired of being in the middle and wanted to be the main shaft for a change.",
            "sent4": "The jackshaft was the unsung hero, silently moving power where it was needed.",
            "sent5": "The shiny jackshaft gleamed in the dimly lit machinery room, silently doing its job."
        },
        {
            "definition": "A shaft that supports gears or pulleys for a machine.",
            "pos": "noun",
            "sent1": "The jackshaft held the gears firmly in place, ensuring smooth operation.",
            "sent2": "The factory worker greased the jackshaft to prevent any squeaking noises.",
            "sent3": "The mischievous squirrel mistook the jackshaft for a tree branch and tried to climb it.",
            "sent4": "The jackshaft was the backbone of the machine, supporting all the moving parts.",
            "sent5": "The old jackshaft creaked under the weight of the heavy pulleys, but it never gave up."
        },
        {
            "definition": "A shaft that connects two or more parts of a machine.",
            "pos": "noun",
            "sent1": "The jackshaft linked the engine to the wheels, allowing the car to move.",
            "sent2": "The engineer designed a sturdy jackshaft to ensure the machine's stability.",
            "sent3": "The curious cat thought the jackshaft was a perfect scratching post.",
            "sent4": "The jackshaft was like a bridge, connecting different sections of the machine seamlessly.",
            "sent5": "The intricate network of gears relied on the jackshaft to keep everything in sync."
        }
    ]
}