{
    "term": "jacks",
    "meanings": [
        {
            "definition": "A playing card bearing a representation of a soldier or servant.",
            "pos": "noun",
            "sent1": "In the game, I picked a jacks card with a soldier on it.",
            "sent2": "She collected jacks cards with different soldiers and servants.",
            "sent3": "The jacks card with the soldier made the game more interesting.",
            "sent4": "Her jacks card, depicting a servant, seemed to bring her luck.",
            "sent5": "The jacks card showing a soldier was her favorite in the deck."
        },
        {
            "definition": "A small, six-pointed metal object used in the game of jacks.",
            "pos": "noun",
            "sent1": "I found a shiny jacks while playing the game.",
            "sent2": "The kids played with the jacks on the playground.",
            "sent3": "His jacks bounced higher than anyone else's during the game.",
            "sent4": "The jacks gleamed under the sunlight as they were tossed in the air.",
            "sent5": "She practiced her hand-eye coordination by playing with the jacks."
        },
        {
            "definition": "A device for lifting heavy objects, typically consisting of a tripod or a pair of supports with a projecting bar or claw.",
            "pos": "noun",
            "sent1": "The workers used jacks to lift the heavy boxes.",
            "sent2": "The mechanic brought out the jacks to raise the car.",
            "sent3": "The jacks made the task of lifting the piano much easier.",
            "sent4": "With the help of the jacks, they effortlessly lifted the furniture.",
            "sent5": "The jacks were essential tools for moving the heavy equipment."
        },
        {
            "definition": "A socket with two or more pairs of pins that can be plugged into a corresponding socket to make a connection.",
            "pos": "noun",
            "sent1": "He plugged the cable into the jacks to connect the devices.",
            "sent2": "The jacks on the back of the TV allowed for multiple connections.",
            "sent3": "The jacks made it convenient to link various gadgets together.",
            "sent4": "She carefully inserted the cable into the jacks for a secure connection.",
            "sent5": "The jacks on the stereo system enabled seamless integration with other devices."
        }
    ]
}