{
    "term": "jack",
    "meanings": [
        {
            "definition": "A device used for lifting heavy objects.",
            "pos": "noun",
            "sent1": "Dad used a jack to lift the car for changing the tire.",
            "sent2": "The mechanic brought a jack to raise the engine for repair.",
            "sent3": "The jack made the heavy box seem as light as a feather.",
            "sent4": "With the jack's help, the burden was lifted off their shoulders.",
            "sent5": "The jack's power to lift amazed the onlookers."
        },
        {
            "definition": "A playing card with a picture of a soldier or servant.",
            "pos": "noun",
            "sent1": "In the game, I drew a jack from the deck of cards.",
            "sent2": "The joker, queen, and jack are all face cards in a deck.",
            "sent3": "The jack in the deck looked like a brave knight ready for battle.",
            "sent4": "The jack in my hand seemed to hold the fate of the game.",
            "sent5": "The jack's image on the card was clear and detailed."
        },
        {
            "definition": "To steal something.",
            "pos": "verb",
            "sent1": "He tried to jack the wallet from the unsuspecting man.",
            "sent2": "The thief attempted to jack the jewels from the safe.",
            "sent3": "The sneaky raccoon tried to jack some snacks from the picnic basket.",
            "sent4": "She managed to jack a kiss from her crush at the party.",
            "sent5": "The cunning fox planned to jack some eggs from the henhouse."
        },
        {
            "definition": "A male given name.",
            "pos": "noun",
            "sent1": "Jack is a common name for boys in many English-speaking countries.",
            "sent2": "My friend's name is Jack, and he is a great soccer player.",
            "sent3": "Jack waved enthusiastically when his name was called at the ceremony.",
            "sent4": "In the story, Jack was the hero who saved the village from disaster.",
            "sent5": "The name Jack has a strong and friendly ring to it."
        }
    ]
}