{
    "term": "jaga",
    "meanings": [
        {
            "definition": "To guard or protect",
            "pos": "verb",
            "sent1": "I always jaga my little sister when we play outside.",
            "sent2": "Soldiers jaga the castle to keep it safe from enemies.",
            "sent3": "The brave knight jaga the kingdom from dragons and monsters.",
            "sent4": "Her love for animals made her jaga the stray cats in the neighborhood.",
            "sent5": "The loyal dog would jaga the house while the family was away."
        },
        {
            "definition": "A person who guards or protects",
            "pos": "noun",
            "sent1": "The jaga at the museum ensures no one touches the artifacts.",
            "sent2": "The security guard is a jaga who keeps the building safe.",
            "sent3": "The jaga caught the thief trying to steal from the store.",
            "sent4": "The jaga guided the lost hikers back to the trail.",
            "sent5": "The jaga's presence made the neighborhood feel secure."
        },
        {
            "definition": "A type of potato",
            "pos": "noun",
            "sent1": "I planted jaga in my garden to grow fresh potatoes.",
            "sent2": "The farmer harvested the jaga potatoes for market.",
            "sent3": "The chef used jaga to make delicious mashed potatoes.",
            "sent4": "The jaga potatoes were a hit at the family dinner.",
            "sent5": "The jaga potato soup warmed us on cold evenings."
        },
        {
            "definition": "A type of traditional Malaysian dance",
            "pos": "noun",
            "sent1": "The jaga dance is performed at cultural festivals.",
            "sent2": "She learned the graceful movements of the jaga dance.",
            "sent3": "The jaga dancers wore colorful costumes during the performance.",
            "sent4": "The jaga dance tells a story of love and unity.",
            "sent5": "The rhythmic beats of the jaga dance filled the air with joy."
        }
    ]
}