{
    "term": "jager",
    "meanings": [
        {
            "definition": "A hunter",
            "pos": "noun",
            "sent1": "The jager tracked the deer through the forest.",
            "sent2": "The skilled jager quietly stalked his prey.",
            "sent3": "The jager's camouflage made him almost invisible in the woods.",
            "sent4": "Like a silent ghost, the jager moved through the trees.",
            "sent5": "The jager's keen eyes spotted the hidden rabbit."
        },
        {
            "definition": "A type of German alcoholic beverage",
            "pos": "noun",
            "sent1": "At the party, they served a delicious jager cocktail.",
            "sent2": "The bar had a wide selection of jager drinks.",
            "sent3": "The jager shot warmed him up on a cold night.",
            "sent4": "The jager liqueur added a kick to the punch.",
            "sent5": "She enjoyed the sweet taste of the jager schnapps."
        },
        {
            "definition": "A member of a German military unit specializing in hunting and tracking",
            "pos": "noun",
            "sent1": "The elite jager unit was known for their stealth.",
            "sent2": "The jager soldiers were highly trained in reconnaissance.",
            "sent3": "The jager team completed their mission with precision.",
            "sent4": "The jager squad moved swiftly through the enemy territory.",
            "sent5": "The jager platoon located the enemy camp undetected."
        },
        {
            "definition": "A type of German military rifle",
            "pos": "noun",
            "sent1": "The soldier cleaned his jager rifle before the mission.",
            "sent2": "The jager firearm was reliable in combat.",
            "sent3": "The jager gun had a powerful scope for long-range shots.",
            "sent4": "The jager weapon was essential for the sharpshooters.",
            "sent5": "The jager rifle was passed down through generations of marksmen."
        }
    ]
}