{
    "term": "jak",
    "meanings": [
        {
            "definition": "A type of tree or shrub native to Southeast Asia.",
            "pos": "noun",
            "sent1": "The jak tree provides shade with its broad leaves.",
            "sent2": "The villagers gathered under the jak tree for a picnic.",
            "sent3": "The monkeys in the jungle love to swing from the jak tree branches.",
            "sent4": "The jak tree stood tall like a guardian in the forest.",
            "sent5": "The ripe jak fruit hung temptingly from the tree."
        },
        {
            "definition": "A type of fastening device.",
            "pos": "noun",
            "sent1": "She used a jak to secure the tent in place.",
            "sent2": "The backpack had a sturdy jak to keep it closed.",
            "sent3": "The curious toddler tried to figure out how the jak worked.",
            "sent4": "The old lock clicked shut as the jak was turned.",
            "sent5": "The shiny jak gleamed in the sunlight."
        },
        {
            "definition": "To pull, lift, or move something with force.",
            "pos": "verb",
            "sent1": "He had to jak the heavy box onto the shelf.",
            "sent2": "The workers had to jak the stuck door open.",
            "sent3": "She tried to jak the stubborn zipper on her bag.",
            "sent4": "The team had to jak together to move the boulder.",
            "sent5": "The strong winds jakked the umbrella out of her hand."
        },
        {
            "definition": "A type of lightweight jacket.",
            "pos": "noun",
            "sent1": "She wore a jak to stay warm in the cool evening.",
            "sent2": "The hiker packed a waterproof jak for the trip.",
            "sent3": "The stylish jak completed his outfit for the party.",
            "sent4": "The colorful jak brightened up her winter wardrobe.",
            "sent5": "The cozy jak felt like a hug on a chilly day."
        }
    ]
}