{
    "term": "jaker",
    "meanings": [
        {
            "definition": "A person who operates a jack.",
            "pos": "noun",
            "sent1": "The jaker lifted the car with the jack.",
            "sent2": "I saw the jaker fixing the tire with the jack.",
            "sent3": "The jaker forgot to bring the jack to work today.",
            "sent4": "She was a jaker, always lifting others up like a jack.",
            "sent5": "The jaker's job is to use the jack to raise heavy things."
        },
        {
            "definition": "A device used for lifting heavy objects.",
            "pos": "noun",
            "sent1": "The mechanic used the jaker to lift the engine.",
            "sent2": "We need the jaker to lift this heavy box.",
            "sent3": "The jaker was too heavy to carry up the stairs.",
            "sent4": "The jaker stood tall, ready to lift anything in its path.",
            "sent5": "The jaker's strength lies in its ability to lift heavy loads."
        },
        {
            "definition": "To lift or raise with a jack.",
            "pos": "verb",
            "sent1": "He will jaker the car to change the tire.",
            "sent2": "Please jaker the table so we can move it.",
            "sent3": "She tried to jaker the heavy box but it was too much.",
            "sent4": "The sun slowly jakered above the horizon.",
            "sent5": "With a grunt, he began to jaker the heavy load onto his shoulders."
        },
        {
            "definition": "To move quickly or suddenly.",
            "pos": "verb",
            "sent1": "The cat will jaker across the room when it hears a noise.",
            "sent2": "I had to jaker to catch the bus before it left.",
            "sent3": "The squirrel jakered up the tree to escape the dog.",
            "sent4": "Time seemed to jaker by as she waited for the results.",
            "sent5": "The wind jakered through the trees, rustling the leaves."
        }
    ]
}