{
    "term": "jaks",
    "meanings": [
        {
            "definition": "A type of tree or shrub.",
            "pos": "noun",
            "sent1": "The jaks in the park provide shade on sunny days.",
            "sent2": "I planted a jaks in my backyard to attract birds.",
            "sent3": "The squirrels love to climb the jaks and play hide-and-seek.",
            "sent4": "The jaks stood tall like a guardian in the forest.",
            "sent5": "The sweet fragrance of the jaks filled the air."
        },
        {
            "definition": "A type of fish.",
            "pos": "noun",
            "sent1": "The jaks in the pond swam gracefully.",
            "sent2": "I caught a colorful jaks while fishing by the river.",
            "sent3": "The jaks splashed playfully in the water, chasing each other.",
            "sent4": "The shimmering scales of the jaks sparkled under the sunlight.",
            "sent5": "The jaks darted swiftly through the clear stream."
        },
        {
            "definition": "A type of card game.",
            "pos": "noun",
            "sent1": "Let's play a round of jaks after dinner.",
            "sent2": "I learned how to play jaks with my friends last weekend.",
            "sent3": "Grandpa always wins at jaks, he's a master strategist.",
            "sent4": "The competition in the jaks tournament was intense.",
            "sent5": "The sound of shuffling cards filled the room during the jaks game."
        },
        {
            "definition": "To throw or pitch forcefully.",
            "pos": "verb",
            "sent1": "He jaks the ball across the field with great strength.",
            "sent2": "She jaks the frisbee to her dog in the park.",
            "sent3": "The pitcher jaks the baseball with precision and speed.",
            "sent4": "The quarterback jaks the football down the field for a touchdown.",
            "sent5": "The athlete jaks the shot put to a new personal record."
        },
        {
            "definition": "To talk or chat informally.",
            "pos": "verb",
            "sent1": "We like to jaks about our favorite movies during lunch.",
            "sent2": "She enjoys jaksing with her friends over a cup of tea.",
            "sent3": "The neighbors often jaks over the fence about gardening tips.",
            "sent4": "The colleagues gathered to jaks about the upcoming project.",
            "sent5": "The children happily jaksed about their adventures at school."
        }
    ]
}