{
    "term": "jambu",
    "meanings": [
        {
            "definition": "A type of tropical fruit.",
            "pos": "noun",
            "sent1": "I enjoyed the juicy jambu at the market.",
            "sent2": "The jambu was ripe and delicious.",
            "sent3": "The jambu rolled off the table and surprised everyone.",
            "sent4": "Her laughter was as refreshing as a jambu on a hot day.",
            "sent5": "The jambu's vibrant color stood out among the other fruits."
        },
        {
            "definition": "A type of tree native to Southeast Asia.",
            "pos": "noun",
            "sent1": "The jambu tree provided shade in the garden.",
            "sent2": "Birds nested in the branches of the jambu.",
            "sent3": "The mischievous squirrel climbed the jambu and chattered away.",
            "sent4": "The jambu tree's leaves whispered secrets in the wind.",
            "sent5": "The fragrance of the jambu blossoms filled the air with sweetness."
        },
        {
            "definition": "A sweet, pink-colored drink made from rose petals.",
            "pos": "noun",
            "sent1": "She sipped the refreshing jambu on a sunny afternoon.",
            "sent2": "The jambu was a hit at the party.",
            "sent3": "The jambu sparkled in the sunlight like a precious gem.",
            "sent4": "Her smile was as bright as a glass of jambu.",
            "sent5": "The jambu's aroma danced playfully in the air."
        },
        {
            "definition": "A type of Indian dessert made from fruit and sugar.",
            "pos": "noun",
            "sent1": "Grandma's jambu was the highlight of the meal.",
            "sent2": "The sweet jambu melted in my mouth.",
            "sent3": "The mischievous child smeared jambu on his face, pretending it was war paint.",
            "sent4": "The jambu dessert was a symphony of flavors.",
            "sent5": "The jambu dessert was a burst of happiness in every bite."
        }
    ]
}