{
    "term": "jamming",
    "meanings": [
        {
            "definition": "To block or obstruct a passage",
            "pos": "verb",
            "sent1": "The fallen tree was jamming the road, making it impossible for cars to pass through.",
            "sent2": "I accidentally jammed the door with my foot, and now it won't open.",
            "sent3": "The naughty squirrel was jamming acorns into the tiny hole in the fence, trying to hide them.",
            "sent4": "The overflowing trash can was jamming the chute, causing a backup of garbage in the building.",
            "sent5": "The stubborn zipper kept jamming, making it difficult to close the jacket."
        },
        {
            "definition": "To play music informally with others",
            "pos": "verb",
            "sent1": "Every Friday night, we gather in the garage to jam with our guitars and drums.",
            "sent2": "The band members were jamming on stage, creating a lively and energetic atmosphere.",
            "sent3": "The kids were jamming on their toy instruments, pretending to be a rock band in the living room.",
            "sent4": "The street performers were jamming on their saxophones, drawing a crowd with their music.",
            "sent5": "The friends decided to jam together, each playing a different instrument in harmony."
        },
        {
            "definition": "A preserve made from fruit and sugar",
            "pos": "noun",
            "sent1": "My grandma's homemade jamming is the best topping for toast in the morning.",
            "sent2": "The store sells a variety of jamming flavors, from strawberry to apricot.",
            "sent3": "The picnic basket was filled with sandwiches spread with delicious jamming.",
            "sent4": "The bakery displayed jars of colorful jamming, enticing customers with their sweetness.",
            "sent5": "The warm scones were served with a dollop of fresh jamming, adding a burst of flavor."
        }
    ]
}