{
    "term": "janisary",
    "meanings": [
        {
            "definition": "A member of the Turkish infantry forming the Sultan's guard",
            "pos": "noun",
            "sent1": "The janisary stood proudly outside the Sultan's palace.",
            "sent2": "The janisary protected the Sultan with unwavering loyalty.",
            "sent3": "The janisary accidentally tripped over his own sword, causing a moment of comic relief.",
            "sent4": "The janisary's presence was like an impenetrable fortress around the Sultan.",
            "sent5": "The janisary's uniform gleamed in the sunlight, a symbol of strength and protection."
        },
        {
            "definition": "A member of a group of elite soldiers in the Ottoman Empire",
            "pos": "noun",
            "sent1": "The janisary troops were known for their exceptional skills in battle.",
            "sent2": "The janisary unit was feared by enemies for their fierce determination.",
            "sent3": "The janisary group celebrated their latest victory with a feast fit for kings.",
            "sent4": "The janisary soldiers moved as one, a force to be reckoned with on the battlefield.",
            "sent5": "The janisary warriors were the pride of the Ottoman Empire, unmatched in bravery.",
            "sent6": "In the Ottoman Empire, a janisary was a symbol of power and protection.",
            "sent7": "The janisary's armor shone in the sunlight, a sight to behold on the battlefield."
        },
        {
            "definition": "A loyal follower or supporter, especially one who is obedient and unquestioning",
            "pos": "noun",
            "sent1": "She was his most trusted janisary, always by his side in times of need.",
            "sent2": "The janisary faithfully carried out every order without hesitation.",
            "sent3": "The janisary's unwavering loyalty sometimes bordered on blind obedience.",
            "sent4": "He relied on his janisary for unwavering support in times of uncertainty.",
            "sent5": "The janisary's dedication knew no bounds, a true pillar of strength in troubled times."
        }
    ]
}