{
    "term": "janneyed",
    "meanings": [
        {
            "definition": "Janneyed (adjective): having the appearance of actress Allison Janney",
            "pos": "adjective",
            "sent1": "The costume designer created a janneyed look for the lead actress.",
            "sent2": "Her janneyed hairstyle perfectly captured the essence of Allison Janney.",
            "sent3": "At the costume party, everyone admired his janneyed outfit resembling Allison Janney.",
            "sent4": "The janneyed makeup transformed her into a spitting image of Allison Janney.",
            "sent5": "The janneyed dress made her feel like a famous actress on the red carpet."
        },
        {
            "definition": "Janneyed (verb): past tense of the verb 'janney', meaning to imitate or mimic the acting style of Allison Janney",
            "pos": "verb",
            "sent1": "She janneyed her lines flawlessly during the audition.",
            "sent2": "The acting coach encouraged the students to janney their performances after Allison Janney.",
            "sent3": "In the school play, he tried to janney his role but added his unique twist.",
            "sent4": "The comedian janneyed Allison Janney's comedic timing in his stand-up routine.",
            "sent5": "Her ability to janney the emotions of Allison Janney impressed the casting director."
        },
        {
            "definition": "Janneyed (adverb): in a manner similar to Allison Janney",
            "pos": "adverb",
            "sent1": "She performed the monologue janneyed, capturing the audience's attention.",
            "sent2": "The actor delivered his lines janneyed, showcasing his versatility.",
            "sent3": "During the play, the actress moved janneyed across the stage, drawing applause.",
            "sent4": "The singer sang janneyed, evoking strong emotions in the listeners.",
            "sent5": "His speech was delivered janneyed, leaving a lasting impact on the viewers."
        }
    ]
}