{
    "term": "jannying",
    "meanings": [
        {
            "definition": "Engaging in the activity of going from house to house in costume, often during the Christmas season.",
            "pos": "noun",
            "sent1": "During the holidays, the children enjoyed jannying in their festive outfits.",
            "sent2": "Jannying is a fun way to celebrate Christmas by visiting neighbors and friends.",
            "sent3": "The jannying group giggled as they knocked on each door, excited for the treats.",
            "sent4": "Jannying felt like stepping into a magical world where every house held a surprise.",
            "sent5": "The joy of jannying filled the air with laughter and cheer."
        },
        {
            "definition": "The act of participating in a traditional Newfoundland Christmas tradition involving visiting homes and receiving treats.",
            "pos": "noun",
            "sent1": "In Newfoundland, jannying is a cherished custom that brings communities together.",
            "sent2": "Children eagerly anticipate the night of jannying to collect sweets and goodies.",
            "sent3": "The jannying event turned into a friendly competition for the most treats gathered.",
            "sent4": "Jannying transformed the quiet streets into a bustling hub of festive activity.",
            "sent5": "The warmth of jannying traditions created lasting memories for all who took part."
        },
        {
            "definition": "To go jannying with a group of friends.",
            "pos": "verb",
            "sent1": "Let's janny together this Christmas and spread joy in our neighborhood.",
            "sent2": "She enjoys jannying with her friends every year, sharing laughter and happiness.",
            "sent3": "They planned to janny around the town, bringing smiles to everyone they met.",
            "sent4": "Jannying with friends felt like embarking on a merry adventure filled with surprises.",
            "sent5": "The group jannied through the streets, creating a trail of joy wherever they went."
        }
    ]
}