{
    "term": "jawar",
    "meanings": [
        {
            "definition": "A type of grain used for food.",
            "pos": "noun",
            "sent1": "I cooked a delicious meal with jawar as the main ingredient.",
            "sent2": "The farmer harvested jawar from the fields to sell at the market.",
            "sent3": "The jawar grain danced in the pot as it cooked, releasing a pleasant aroma.",
            "sent4": "Her love for cooking was like a field of jawar, abundant and nourishing.",
            "sent5": "The jawar grain, golden and wholesome, filled the kitchen with warmth."
        },
        {
            "definition": "To speak or shout angrily.",
            "pos": "verb",
            "sent1": "He would jawar at anyone who dared to disturb his peace.",
            "sent2": "The teacher had to jawar to get the noisy class to quiet down.",
            "sent3": "The cat seemed to jawar at the birds outside, frustrated that it couldn't catch them.",
            "sent4": "His words jawared through the room, leaving everyone stunned into silence.",
            "sent5": "The storm outside matched his jawaring voice, fierce and unrelenting."
        },
        {
            "definition": "A type of plant used for animal feed.",
            "pos": "noun",
            "sent1": "The cows happily grazed on the fresh jawar in the pasture.",
            "sent2": "The farmer planted jawar to ensure his animals had enough food for the winter.",
            "sent3": "The mischievous goat managed to sneak into the jawar field and feast on the plants.",
            "sent4": "The jawar plants swayed gently in the breeze, providing a peaceful scene.",
            "sent5": "The jawar field was a buffet for the hungry livestock, offering them sustenance."
        },
        {
            "definition": "A type of grass native to Africa.",
            "pos": "noun",
            "sent1": "The savanna was covered in lush jawar, swaying in the wind.",
            "sent2": "The elephants enjoyed munching on the tall jawar grasses.",
            "sent3": "The zebras played hide and seek among the tall jawar grasses.",
            "sent4": "The jawar grasses whispered secrets to the passing antelopes.",
            "sent5": "Under the African sun, the jawar grass stood tall and proud, a symbol of resilience."
        }
    ]
}