{
    "term": "jealousest",
    "meanings": [
        {
            "definition": "Feeling or showing envy or resentment towards someone because of their achievements or advantages.",
            "pos": "adjective",
            "sent1": "She was the jealousest student in the class when her friend got a higher grade.",
            "sent2": "The jealousest sister couldn't hide her envy when her sibling won the competition.",
            "sent3": "The jealousest cat in the house hissed at the new kitten getting all the attention.",
            "sent4": "His jealousest thoughts towards his colleague's promotion consumed him.",
            "sent5": "The green-eyed monster made her the jealousest person in the room."
        },
        {
            "definition": "Feeling or showing suspicion or fear of being replaced in a relationship.",
            "pos": "adjective",
            "sent1": "He became the jealousest boyfriend whenever she talked to other guys.",
            "sent2": "The jealousest partner always checked their significant other's phone for messages.",
            "sent3": "The jealousest puppy growled at anyone who approached its owner.",
            "sent4": "Her heart felt the jealousest pang when she saw her ex with someone new.",
            "sent5": "The jealousest lover's insecurities drove a wedge between them."
        },
        {
            "definition": "To be protective or possessive of someone or something.",
            "pos": "verb",
            "sent1": "She jealousest over her little brother, making sure he was always safe.",
            "sent2": "The mother jealousest over her newborn, never letting anyone else hold the baby.",
            "sent3": "The dog jealousest over its favorite toy, not allowing any other pet near it.",
            "sent4": "He jealousest over his girlfriend, not wanting her to spend time with anyone else.",
            "sent5": "The queen jealousest over her kingdom, fiercely protecting it from invaders."
        }
    ]
}