{
    "term": "jealousies",
    "meanings": [
        {
            "definition": "The state or feeling of being jealous.",
            "pos": "noun",
            "sent1": "Her jealousies towards her sister were evident to everyone.",
            "sent2": "His jealousies often led to unnecessary arguments in their relationship.",
            "sent3": "The cat's jealousies over the attention given to the new puppy were quite comical.",
            "sent4": "The dark clouds of jealousies loomed over their friendship, threatening to break it apart.",
            "sent5": "The green-eyed monster of jealousies consumed her thoughts, making her miserable."
        },
        {
            "definition": "Resentment against a rival or a person enjoying success or advantage.",
            "pos": "noun",
            "sent1": "His jealousies towards his colleague's promotion were hard to hide.",
            "sent2": "The jealousies between the two teams were palpable during the game.",
            "sent3": "The plant's jealousies towards the bigger, sunnier plant next to it were quite amusing.",
            "sent4": "The jealousies in her heart burned like a fire, fueling her desire for revenge.",
            "sent5": "The bitter taste of jealousies lingered in the air, poisoning their interactions."
        },
        {
            "definition": "Suspicion or fear of rivalry, unfaithfulness, etc., as in love or aims.",
            "pos": "noun",
            "sent1": "Her jealousies towards her partner's ex were unfounded.",
            "sent2": "The jealousies in their relationship caused constant tension between them.",
            "sent3": "The tree's jealousies towards the neighboring tree's taller height were quite amusing.",
            "sent4": "The shadow of jealousies followed her everywhere, clouding her judgment.",
            "sent5": "The whispers of jealousies echoed in her mind, creating doubts and insecurities."
        },
        {
            "definition": "Vigilance in maintaining or guarding something.",
            "pos": "noun",
            "sent1": "The soldier's jealousies over his post were unwavering.",
            "sent2": "The jealousies of the castle walls ensured the safety of the kingdom.",
            "sent3": "The squirrel's jealousies over its stash of nuts were quite amusing to watch.",
            "sent4": "The jealousies of the security guard kept the museum artifacts safe from theft.",
            "sent5": "The fierce jealousies of the mother bird protected her nest from predators."
        }
    ]
}