{
    "term": "jesses",
    "meanings": [
        {
            "definition": "Straps or leashes used to tether a hawk or falcon.",
            "pos": "noun",
            "sent1": "The falconer attached the jesses to the hawk's legs before the flight.",
            "sent2": "During the falconry show, the jesses kept the hawk safely in place.",
            "sent3": "The mischievous squirrel mistook the jesses for its own leash and tried to run away with them.",
            "sent4": "The jesses were like invisible strings connecting the majestic hawk to its handler.",
            "sent5": "The jesses fluttered in the wind as the falcon soared through the sky."
        },
        {
            "definition": "A short strap fastened around the leg of a hawk or falcon in falconry.",
            "pos": "noun",
            "sent1": "The leather jesses were carefully secured around the falcon's powerful legs.",
            "sent2": "The falconer adjusted the jesses to ensure a comfortable fit for the bird.",
            "sent3": "The mischievous squirrel tried to chew on the jesses, thinking they were tasty treats.",
            "sent4": "The jesses gleamed in the sunlight, contrasting with the bird's dark feathers.",
            "sent5": "The jesses clinked softly as the falcon hopped onto the falconer's glove."
        },
        {
            "definition": "To fasten jesses on a bird of prey.",
            "pos": "verb",
            "sent1": "The falconer gently jesses the hawk before the show to prepare it for flight.",
            "sent2": "It is important to jesses the falcon securely to prevent any accidents during training.",
            "sent3": "The young apprentice accidentally jessed himself to the bird, causing a moment of confusion.",
            "sent4": "With a swift motion, the falconer jesses the bird, signaling the start of the performance.",
            "sent5": "The experienced falconer skillfully jesses the hawk, forming a strong bond between them."
        }
    ]
}