{
    "term": "jete",
    "meanings": [
        {
            "definition": "A jump in ballet where one leg is extended forward and the other is brought up to meet it.",
            "pos": "noun",
            "sent1": "During the ballet performance, the dancer executed a graceful jete across the stage.",
            "sent2": "The ballerina's jete was the highlight of the show, showcasing her agility and strength.",
            "sent3": "The jete looked like a bird soaring through the air, captivating the audience with its beauty.",
            "sent4": "Her jete was like a shooting star, swift and mesmerizing in its movement.",
            "sent5": "The jete was so elegant and precise, it left a lasting impression on everyone who watched."
        },
        {
            "definition": "A leap or jump in fencing.",
            "pos": "noun",
            "sent1": "The fencer's jete helped him evade his opponent's attack with a swift leap.",
            "sent2": "With a quick jete, the fencer dodged the incoming strike, showcasing his agility.",
            "sent3": "The jete in fencing was like a dance of swords, each move calculated and strategic.",
            "sent4": "His jete was a sudden escape, leaving his opponent surprised and off guard.",
            "sent5": "The fencer's jete was like a graceful dance, blending athleticism with precision."
        },
        {
            "definition": "A type of step in ballroom dancing where one foot is extended forward and the other is brought to meet it.",
            "pos": "noun",
            "sent1": "The couple performed a flawless jete, gliding across the dance floor with elegance.",
            "sent2": "In ballroom dancing, the jete adds a touch of sophistication to the routine.",
            "sent3": "Their jete in ballroom dancing was like a synchronized movement, perfectly timed and coordinated.",
            "sent4": "The jete in their routine was a moment of unity, where their steps aligned in harmony.",
            "sent5": "The jete in ballroom dancing was a graceful display of partnership and skill."
        }
    ]
}