{
    "term": "jetes",
    "meanings": [
        {
            "definition": "A type of dance movement where one leg is extended in the air while the other supports the body.",
            "pos": "noun",
            "sent1": "During the ballet performance, the dancer executed graceful jetes across the stage.",
            "sent2": "The ballet instructor demonstrated how to perform jetes with elegance and precision.",
            "sent3": "The little girl pretended to be a ballerina, attempting jetes in her living room.",
            "sent4": "Her jetes were like a bird soaring through the sky, light and effortless.",
            "sent5": "The dancer's jetes were so captivating that the audience couldn't take their eyes off her."
        },
        {
            "definition": "A type of aircraft engine that produces a high-velocity stream of exhaust gases.",
            "pos": "noun",
            "sent1": "The jet engine of the airplane roared as it prepared for takeoff.",
            "sent2": "Passengers could feel the power of the jetes as the plane accelerated down the runway.",
            "sent3": "The mechanic jokingly said, 'I wish my car had jetes to beat the traffic.'",
            "sent4": "The jetes of the aircraft cut through the sky like a knife through butter.",
            "sent5": "The sound of the jetes echoed through the airport, signaling the arrival of the plane."
        },
        {
            "definition": "A type of gemstone that is black in color and is often used in jewelry.",
            "pos": "noun",
            "sent1": "She admired the elegant necklace adorned with shimmering jetes.",
            "sent2": "The ring sparkled with a beautiful jete set in the center.",
            "sent3": "The jeweler proudly displayed a collection of exquisite jetes in the store window.",
            "sent4": "Her eyes lit up when she saw the rare jete, glistening under the light.",
            "sent5": "The jete in her bracelet seemed to absorb all the light around it, creating a mysterious aura."
        }
    ]
}