{
    "term": "jettisonable",
    "meanings": [
        {
            "definition": "Capable of being jettisoned.",
            "pos": "adjective",
            "sent1": "The heavy cargo was too jettisonable for the small aircraft to carry.",
            "sent2": "In case of emergency, the lifeboat is designed to be jettisonable from the ship.",
            "sent3": "The jettisonable supplies were tossed overboard to lighten the load and keep the boat afloat.",
            "sent4": "She treated her toxic relationship as jettisonable baggage, letting go for her own well-being.",
            "sent5": "The astronaut quickly identified the jettisonable parts of the spacecraft to ensure a safe return to Earth."
        },
        {
            "definition": "Able to be discarded or thrown overboard.",
            "pos": "adjective",
            "sent1": "The damaged equipment was deemed jettisonable to prevent further harm.",
            "sent2": "During the storm, the crew decided which items were jettisonable to save the ship.",
            "sent3": "The jettisonable trash was tossed into the ocean, leaving the deck clean and tidy.",
            "sent4": "She saw the toxic friendship as jettisonable, deciding to cut ties for her own happiness.",
            "sent5": "The jettisonable cargo was thrown overboard to lighten the load and keep the boat afloat."
        },
        {
            "definition": "Suitable for being dropped or abandoned.",
            "pos": "adjective",
            "sent1": "The excess weight was clearly jettisonable to improve the plane's performance.",
            "sent2": "The old equipment was considered jettisonable as the new models arrived.",
            "sent3": "He jokingly referred to his outdated phone as jettisonable, ready to upgrade.",
            "sent4": "The jettisonable ideas were left behind as the team moved forward with a new plan.",
            "sent5": "The unnecessary items were jettisonable, making room for more important cargo."
        }
    ]
}