{
    "term": "jeu",
    "meanings": [
        {
            "definition": "A game or play",
            "pos": "noun",
            "sent1": "Playing jeu with friends is always fun.",
            "sent2": "Children enjoy playing different jeux at the park.",
            "sent3": "The family picnic turned into a lively jeu of tag.",
            "sent4": "Life is like a complex jeu where we all play different roles.",
            "sent5": "The board game created a colorful and exciting jeu for everyone."
        },
        {
            "definition": "A toy or plaything",
            "pos": "noun",
            "sent1": "The colorful jeu caught the child's attention.",
            "sent2": "She collected various colorful jeus in her room.",
            "sent3": "The playful kitten found a new jeu to entertain itself.",
            "sent4": "The old teddy bear became a cherished jeu from childhood.",
            "sent5": "The shiny new jeu was the most popular toy at the store."
        },
        {
            "definition": "A competitive activity or sport",
            "pos": "noun",
            "sent1": "The soccer match was an intense jeu between the two teams.",
            "sent2": "Athletes train hard to excel in their chosen jeus.",
            "sent3": "The annual swimming competition turned into a friendly jeu among participants.",
            "sent4": "In the business world, negotiations can sometimes feel like a strategic jeu.",
            "sent5": "The championship game was the ultimate jeu of skill and determination."
        },
        {
            "definition": "A form of entertainment or amusement",
            "pos": "noun",
            "sent1": "The circus provided a delightful jeu for the audience.",
            "sent2": "Movies are a popular form of visual jeu for many people.",
            "sent3": "The comedian's jokes added a humorous touch to the evening jeu.",
            "sent4": "Music concerts offer a sensory-rich jeu for music lovers.",
            "sent5": "The theme park promised a day full of thrilling jeus for visitors."
        }
    ]
}