{
    "term": "jezebels",
    "meanings": [
        {
            "definition": "A shameless or immoral woman",
            "pos": "noun",
            "sent1": "The town gossips often referred to her as one of the local jezebels.",
            "sent2": "The novel portrayed the antagonist as a jezebels character, causing chaos wherever she went.",
            "sent3": "At the costume party, she jokingly dressed up as a jezebels from a historical play.",
            "sent4": "Her behavior at the office was like a swarm of jezebels, spreading rumors and causing trouble.",
            "sent5": "The movie depicted the main character's transformation into a jezebels, leading to her downfall."
        },
        {
            "definition": "A seductive or promiscuous woman",
            "pos": "noun",
            "sent1": "The old movie portrayed the femme fatale as a dangerous jezebels.",
            "sent2": "In the nightclub, she danced like a jezebels, captivating everyone around her.",
            "sent3": "The advertisement used a playful jezebels character to sell the new perfume.",
            "sent4": "Her red dress made her look like a jezebels, turning heads wherever she went.",
            "sent5": "The mysterious woman at the party had an aura of jezebels, intriguing all the guests."
        },
        {
            "definition": "A treacherous or deceitful woman",
            "pos": "noun",
            "sent1": "The spy novel featured a cunning jezebels who betrayed her country.",
            "sent2": "The con artist disguised herself as a wealthy jezebels to deceive her victims.",
            "sent3": "The cat behaved like a sneaky jezebels, always trying to steal food from the kitchen.",
            "sent4": "Her smile was as deceptive as that of a jezebels, hiding her true intentions.",
            "sent5": "The politician's assistant turned out to be a jezebels, leaking confidential information to the press."
        }
    ]
}