{
    "term": "jingler",
    "meanings": [
        {
            "definition": "A person or thing that jingles.",
            "pos": "noun",
            "sent1": "The jingler on the cat's collar made a soft sound as it moved.",
            "sent2": "I found a jingler in the sand at the beach.",
            "sent3": "The jingler on the wind chime danced in the breeze.",
            "sent4": "Her laughter was like a jingler, filling the room with joy.",
            "sent5": "The jingler on the keychain helped me find my keys easily."
        },
        {
            "definition": "A small coin or piece of metal that jingles.",
            "pos": "noun",
            "sent1": "She dropped a jingler into the charity donation box.",
            "sent2": "The jingler in his pocket made a cheerful noise as he walked.",
            "sent3": "The jingler in the piggy bank added up to a nice sum.",
            "sent4": "The jingler in her hand was a reminder of her childhood.",
            "sent5": "He found a shiny jingler on the sidewalk."
        },
        {
            "definition": "A device that makes a jingling sound.",
            "pos": "noun",
            "sent1": "The sleigh had a jingler attached to the reins.",
            "sent2": "The wind-up toy had a jingler inside that chimed as it moved.",
            "sent3": "The jingler on the door alerted them to someone's arrival.",
            "sent4": "The jingler on the bicycle added a fun touch to the ride.",
            "sent5": "The jingler on the alarm clock woke him up every morning."
        },
        {
            "definition": "A person who jingles or makes a jingling sound.",
            "pos": "noun",
            "sent1": "The little girl was known as the jingler of the family.",
            "sent2": "The jingler in the band played the tambourine with enthusiasm.",
            "sent3": "The jingler at the parade added a festive touch with her bells.",
            "sent4": "The jingler in the choir kept the rhythm with her bells.",
            "sent5": "The jingler at the party entertained everyone with her musical talent."
        }
    ]
}