{
    "term": "jingals",
    "meanings": [
        {
            "definition": "A type of small bell often used on a horse's harness.",
            "pos": "noun",
            "sent1": "The jingals on the horse's harness jingled softly as it trotted along.",
            "sent2": "I heard the familiar sound of jingals as the horse approached.",
            "sent3": "The mischievous squirrel tied jingals to the horse's harness, causing a musical commotion.",
            "sent4": "The jingals on the harness were like tiny dancers, moving with each step of the horse.",
            "sent5": "The sunlight caught the jingals, creating a sparkling display as the horse moved."
        },
        {
            "definition": "A type of small, light cannon used in the 19th century.",
            "pos": "noun",
            "sent1": "The soldiers loaded the jingals with cannonballs for the upcoming battle.",
            "sent2": "The loud boom of the jingals echoed across the battlefield.",
            "sent3": "The jingals were so light that the soldiers could easily carry them from place to place.",
            "sent4": "The jingals roared like angry dragons, spitting fire and smoke.",
            "sent5": "The jingals were a fearsome sight, ready to unleash destruction upon their enemies."
        },
        {
            "definition": "A type of traditional Indian percussion instrument.",
            "pos": "noun",
            "sent1": "The musician played the jingals with skill and precision, filling the air with rhythmic beats.",
            "sent2": "The sound of the jingals added a lively rhythm to the traditional Indian music.",
            "sent3": "The jingals seemed to dance in the hands of the talented musician, creating a joyful melody.",
            "sent4": "The jingals sang out like a chorus of tiny voices, enchanting all who listened.",
            "sent5": "The jingals' music transported the listeners to a world of vibrant colors and swirling dances."
        }
    ]
}