{
    "term": "jingle",
    "meanings": [
        {
            "definition": "A light ringing sound, such as that made by metal objects striking together.",
            "pos": "noun",
            "sent1": "The jingle of the bells filled the air with joy.",
            "sent2": "I heard the jingle of coins in his pocket.",
            "sent3": "The jingle of the keys reminded me of Santa's sleigh.",
            "sent4": "Her laughter had a jingle that echoed in the room.",
            "sent5": "The jingle of the wind chimes soothed her restless mind."
        },
        {
            "definition": "A catchy short verse or song, typically used in advertising.",
            "pos": "noun",
            "sent1": "The jingle from the commercial stuck in my head all day.",
            "sent2": "She hummed the jingle from the TV ad.",
            "sent3": "The catchy jingle made everyone dance in the store.",
            "sent4": "His jingle about the new product was a hit with customers.",
            "sent5": "The jingle for the soda was simple but effective."
        },
        {
            "definition": "To make a light ringing sound.",
            "pos": "verb",
            "sent1": "The bells jingle softly in the breeze.",
            "sent2": "I love to hear the coins jingle in my pocket.",
            "sent3": "She made the keys jingle to get his attention.",
            "sent4": "The laughter seemed to jingle in the air.",
            "sent5": "The wind chimes jingle harmoniously in the garden."
        },
        {
            "definition": "To rhyme or sound in a catchy, musical way.",
            "pos": "verb",
            "sent1": "The words jingle together like a song.",
            "sent2": "Her lyrics always jingle perfectly with the melody.",
            "sent3": "The keys jingle in a playful rhythm.",
            "sent4": "His voice seemed to jingle with happiness.",
            "sent5": "The bells jingle in harmony under the starlit sky."
        }
    ]
}