{
    "term": "jobbed",
    "meanings": [
        {
            "definition": "Cheat or deceive someone.",
            "pos": "verb",
            "sent1": "He jobbed his friend by tricking him into buying a broken toy.",
            "sent2": "She jobbed her way into getting a higher grade by copying her classmate's answers.",
            "sent3": "The mischievous squirrel jobbed the birds by stealing their seeds and hiding them in a secret stash.",
            "sent4": "The cunning fox jobbed the rabbit by pretending to be injured, then pouncing when the rabbit came closer.",
            "sent5": "The sneaky cat jobbed the dog by luring it away with a fake ball, then stealing its bone."
        },
        {
            "definition": "Work done for a wage or salary.",
            "pos": "noun",
            "sent1": "She found a jobbed at the local bakery, where she baked delicious pastries every day.",
            "sent2": "His jobbed as a construction worker required him to lift heavy bricks and hammer nails.",
            "sent3": "The little boy pretended to have a jobbed as a superhero, fighting imaginary villains in the backyard.",
            "sent4": "Her jobbed as a teacher allowed her to shape young minds and inspire a love for learning.",
            "sent5": "The jobbed of a firefighter is to bravely rescue people from burning buildings and save lives."
        },
        {
            "definition": "To secure a job for someone else.",
            "pos": "verb",
            "sent1": "He jobbed his sister at the company where he worked, ensuring she had a stable income.",
            "sent2": "She jobbed her best friend at the new restaurant, knowing she would excel as a chef.",
            "sent3": "The kind neighbor jobbed the teenager at the local store, giving him a chance to earn some money.",
            "sent4": "The generous boss jobbed his loyal employee at the prestigious firm, recognizing his hard work.",
            "sent5": "The helpful mentor jobbed the recent graduate at the top tech company, opening doors to a bright future."
        }
    ]
}