{
    "term": "jointed",
    "meanings": [
        {
            "definition": "Having joints",
            "pos": "adjective",
            "sent1": "The robot had jointed arms that could move in different directions.",
            "sent2": "The wooden puppet had jointed limbs that allowed it to dance.",
            "sent3": "The jointed action figure tried to do a cartwheel but ended up in a tangled mess.",
            "sent4": "The jointed branches of the tree swayed gracefully in the wind.",
            "sent5": "The jointed door creaked as it swung open, revealing a hidden room."
        },
        {
            "definition": "Connected by joints",
            "pos": "adjective",
            "sent1": "The jointed pieces of the puzzle fit together perfectly.",
            "sent2": "The train cars were jointed to form a long, connected line.",
            "sent3": "The jointed sections of the bridge allowed it to bend and flex during earthquakes.",
            "sent4": "The jointed fingers of the gloves made it easy to grip objects.",
            "sent5": "The jointed segments of the snake moved independently as it slithered along the ground."
        },
        {
            "definition": "Formed with joints",
            "pos": "adjective",
            "sent1": "The jointed chair was made of separate pieces that were assembled together.",
            "sent2": "The jointed metal frame of the bike provided flexibility and strength.",
            "sent3": "The jointed puzzle pieces clicked together to reveal a beautiful picture.",
            "sent4": "The jointed wings of the bird allowed it to soar through the sky with ease.",
            "sent5": "The jointed construction of the table made it easy to fold and store when not in use."
        },
        {
            "definition": "United by joints",
            "pos": "adjective",
            "sent1": "The jointed planks of wood formed a sturdy platform for the stage.",
            "sent2": "The jointed bones of the skeleton were carefully connected by ligaments.",
            "sent3": "The jointed parts of the machine worked together seamlessly to complete the task.",
            "sent4": "The jointed sections of the pipe were securely fastened to prevent leaks.",
            "sent5": "The jointed panels of the door were reinforced with metal for added strength."
        }
    ]
}