{
    "term": "jounciest",
    "meanings": [
        {
            "definition": "Characterized by lively, bouncing movements.",
            "pos": "adjective",
            "sent1": "The puppy was the jounciest of all, bouncing around the yard with excitement.",
            "sent2": "The trampoline was the jounciest one at the park, making everyone jump high.",
            "sent3": "The jounciest squirrel in the forest kept leaping from tree to tree, entertaining the other animals.",
            "sent4": "Her laughter was like the jounciest melody, lifting everyone's spirits.",
            "sent5": "The jounciest dance moves at the party belonged to Sarah, who never stopped moving."
        },
        {
            "definition": "Having the most bounce or springiness.",
            "pos": "adjective",
            "sent1": "The mattress in the store felt the jounciest, making it perfect for a good night's sleep.",
            "sent2": "Out of all the balls, the rubber one was the jounciest, bouncing the highest.",
            "sent3": "The jounciest ball in the game kept rebounding off the walls, surprising the players.",
            "sent4": "His voice had the jounciest quality, rising and falling with enthusiasm.",
            "sent5": "The jounciest branch on the tree swayed in the wind, showing its flexibility."
        },
        {
            "definition": "Full of energy and enthusiasm.",
            "pos": "adjective",
            "sent1": "The children were the jounciest group in the class, always eager to participate.",
            "sent2": "The jounciest member of the team cheered the loudest during the game.",
            "sent3": "Her jounciest idea was to have a picnic in the park, which everyone loved.",
            "sent4": "The jounciest student in the school was known for organizing fun events.",
            "sent5": "The jounciest dog at the shelter wagged its tail non-stop, hoping for a forever home."
        }
    ]
}