{
    "term": "joypopper",
    "meanings": [
        {
            "definition": "A person who brings joy or happiness to others.",
            "pos": "noun",
            "sent1": "My friend Sarah is a real joypopper at parties, always making everyone smile.",
            "sent2": "The clown at the circus was a true joypopper, spreading laughter wherever he went.",
            "sent3": "The joypopper in our neighborhood is Mr. Johnson, who tells the funniest jokes.",
            "sent4": "Her contagious laughter was like a joypopper, lighting up the room with happiness.",
            "sent5": "The little girl's giggles were a joypopper, brightening everyone's day."
        },
        {
            "definition": "A small explosive device that produces a loud noise and bright light for entertainment.",
            "pos": "noun",
            "sent1": "The children were excited to set off the joypopper during the fireworks display.",
            "sent2": "The joypopper lit up the night sky with its dazzling colors and loud bang.",
            "sent3": "The joypopper startled the cat, making it jump in surprise.",
            "sent4": "The joypopper exploded like a mini firework, filling the air with light and sound.",
            "sent5": "The joypopper's sudden burst of light was like a tiny celebration in the dark."
        },
        {
            "definition": "A slang term for a drug that induces feelings of euphoria.",
            "pos": "noun",
            "sent1": "The dangers of using a joypopper without medical advice are well-known.",
            "sent2": "He was caught with a joypopper in his possession, leading to legal trouble.",
            "sent3": "The teenagers thought it was cool to experiment with joypoppers, not realizing the risks.",
            "sent4": "The effects of the joypopper swept over him, filling him with a false sense of happiness.",
            "sent5": "She struggled with addiction after trying a joypopper for the first time."
        }
    ]
}