{
    "term": "judiciary",
    "meanings": [
        {
            "definition": "The branch of government responsible for interpreting laws and administering justice.",
            "pos": "noun",
            "sent1": "The judiciary ensures that laws are followed and justice is served.",
            "sent2": "The judiciary plays a crucial role in upholding the law and ensuring fair trials.",
            "sent3": "When the judiciary is in action, it's like a wise owl overseeing the legal proceedings.",
            "sent4": "Her wisdom and fairness in the courtroom made her a shining example of the judiciary.",
            "sent5": "The judiciary's decisions are like the final puzzle piece that brings justice to light."
        },
        {
            "definition": "The judges of a country or state collectively.",
            "pos": "noun",
            "sent1": "The judiciary consists of experienced judges who uphold the law.",
            "sent2": "In a democracy, the judiciary must remain independent from other branches of government.",
            "sent3": "The judiciary's annual picnic is always a fun event for the judges to relax and bond.",
            "sent4": "The judiciary's unity and solidarity are key to maintaining a fair legal system.",
            "sent5": "Each member of the judiciary brings a unique perspective to the table during trials."
        },
        {
            "definition": "The system of courts of law in a country.",
            "pos": "noun",
            "sent1": "The judiciary ensures that justice is accessible to all citizens.",
            "sent2": "A strong judiciary is essential for upholding the rule of law in society.",
            "sent3": "The judiciary's holiday party was a hit with judges and court staff alike.",
            "sent4": "The judiciary's wheels of justice may turn slowly, but they grind exceedingly fine.",
            "sent5": "The judiciary's presence in every corner of the country ensures legal recourse for all."
        }
    ]
}