{
    "term": "jugglery",
    "meanings": [
        {
            "definition": "Deceptive or skillful manipulation",
            "pos": "noun",
            "sent1": "The magician's jugglery with the cards amazed the audience.",
            "sent2": "She saw through his jugglery and knew he was trying to deceive her.",
            "sent3": "The detective uncovered the criminal's jugglery and solved the case.",
            "sent4": "His jugglery of words made it hard to trust his intentions.",
            "sent5": "The jugglery of shadows created an eerie atmosphere in the room."
        },
        {
            "definition": "Trickery or deceit",
            "pos": "noun",
            "sent1": "The con artist's jugglery with the truth fooled many people.",
            "sent2": "The politician's jugglery of promises left the voters feeling betrayed.",
            "sent3": "The children giggled at the cat's playful jugglery with a ball of yarn.",
            "sent4": "Her jugglery of excuses couldn't hide the fact that she was late again.",
            "sent5": "The jugglery of light and shadow created a mysterious effect on the stage."
        },
        {
            "definition": "The act of juggling objects for entertainment",
            "pos": "noun",
            "sent1": "The circus performer's jugglery with colorful balls delighted the crowd.",
            "sent2": "Children often enjoy learning the art of jugglery with scarves or beanbags.",
            "sent3": "The clown's clumsy jugglery with rubber chickens brought laughter to the audience.",
            "sent4": "His impressive jugglery of flaming torches left everyone in awe.",
            "sent5": "The street performer's jugglery of fruit was both entertaining and skillful."
        },
        {
            "definition": "The performance of tricks or illusions with the hands or objects",
            "pos": "noun",
            "sent1": "The magician's jugglery with rings and scarves captivated the audience.",
            "sent2": "The jugglery of the street performer included balancing acts and sleight of hand.",
            "sent3": "The jugglery of the mime with invisible objects puzzled onlookers.",
            "sent4": "Her jugglery of levitating objects left the spectators in disbelief.",
            "sent5": "The jugglery of the acrobat with hoops and ribbons was graceful and mesmerizing."
        }
    ]
}