{
    "term": "jujuism",
    "meanings": [
        {
            "definition": "The belief in or practice of using supernatural powers to influence or control events.",
            "pos": "noun",
            "sent1": "Her jujuism led her to believe she could change the weather with a spell.",
            "sent2": "In some cultures, jujuism is a common way to seek protection from evil spirits.",
            "sent3": "Sarah's jujuism made her think she could make her cat talk by casting a spell.",
            "sent4": "The magician's jujuism was so powerful, it seemed like he could bend reality to his will.",
            "sent5": "The village's jujuism was so strong that even skeptics started to believe in magic."
        },
        {
            "definition": "A system of beliefs or practices involving the use of charms, amulets, or spells.",
            "pos": "noun",
            "sent1": "The ancient tribe's jujuism included wearing specific charms for protection.",
            "sent2": "Many people turn to jujuism for luck in their daily lives.",
            "sent3": "His jujuism was so strong that he wore his lucky amulet to bed every night.",
            "sent4": "The shop sold all kinds of jujuism items, from crystals to spell books.",
            "sent5": "She embraced jujuism by carrying a special charm wherever she went."
        },
        {
            "definition": "The act of using magic or sorcery to achieve a desired outcome.",
            "pos": "noun",
            "sent1": "The witch's jujuism was so powerful that she could make potions with a flick of her wrist.",
            "sent2": "Jujuism has been a part of their family tradition for generations.",
            "sent3": "His jujuism backfired when he accidentally turned his cat into a pumpkin.",
            "sent4": "The sorcerer's jujuism was so potent that even the skeptics were in awe.",
            "sent5": "The book contained ancient jujuism spells that promised to grant any wish."
        }
    ]
}