{
    "term": "jumbies",
    "meanings": [
        {
            "definition": "A supernatural being or spirit in Caribbean folklore.",
            "pos": "noun",
            "sent1": "The children whispered stories of jumbies lurking in the dark forest.",
            "sent2": "The villagers believed in the existence of jumbies that roamed the island at night.",
            "sent3": "The jumbies must have been playing tricks on me when I thought I saw a shadow move.",
            "sent4": "The old house was filled with creaks and whispers, as if the jumbies were watching.",
            "sent5": "The jumbies were said to have glowing eyes and eerie laughter that echoed through the night."
        },
        {
            "definition": "A feeling of fear or unease.",
            "pos": "noun",
            "sent1": "A shiver ran down her spine, a sign of the jumbies' presence.",
            "sent2": "The dark alley filled her with jumbies as she hurried home.",
            "sent3": "The jumbies of nervousness danced in his stomach before the big test.",
            "sent4": "The jumbies of doubt clouded her mind, making her second-guess every decision.",
            "sent5": "The jumbies of unease whispered unsettling thoughts in her ear, making her anxious.",
            "sent6": "The jumbies of fear gripped her heart, making her freeze in terror."
        },
        {
            "definition": "To be haunted or possessed by jumbies.",
            "pos": "verb",
            "sent1": "The old mansion was said to be jumbies, scaring away any who dared to enter.",
            "sent2": "She felt like she was being jumbies by a ghostly presence in the room.",
            "sent3": "The idea of failing the exam jumbies her mind, making it hard to focus.",
            "sent4": "His past mistakes jumbies him, haunting his thoughts day and night.",
            "sent5": "The memories of the accident jumbies her dreams, causing restless nights."
        }
    ]
}