{
    "term": "junkman",
    "meanings": [
        {
            "definition": "A person who collects and sells junk or discarded items.",
            "pos": "noun",
            "sent1": "The junkman drove around the neighborhood in his old truck, looking for items to sell.",
            "sent2": "The junkman had a shop where he displayed all the interesting things he found.",
            "sent3": "The junkman found a broken chair and turned it into a unique piece of art.",
            "sent4": "She saw the junkman as a treasure hunter in a sea of discarded items.",
            "sent5": "The junkman's eyes sparkled with excitement as he found a hidden gem among the junk."
        },
        {
            "definition": "A business that deals in buying and selling scrap materials.",
            "pos": "noun",
            "sent1": "The local junkman offered fair prices for old metal and paper.",
            "sent2": "People brought their recyclables to the junkman's yard to exchange for cash.",
            "sent3": "The junkman's business boomed as more people became environmentally conscious.",
            "sent4": "In the town, the junkman's shop was known as the place to find hidden treasures.",
            "sent5": "The junkman's scale clinked happily as he weighed the day's collection of scrap metal."
        },
        {
            "definition": "To collect or deal in junk or discarded items.",
            "pos": "verb",
            "sent1": "He decided to junkman for a living after realizing the value in discarded items.",
            "sent2": "She loved to junkman on weekends, finding unique pieces to repurpose.",
            "sent3": "The kids joked that their dad would junkman anything that seemed interesting.",
            "sent4": "Her ability to junkman effectively made her popular among antique collectors.",
            "sent5": "The group planned to junkman the old warehouse for hidden treasures over the weekend."
        }
    ]
}