{
    "term": "jurisdiction",
    "meanings": [
        {
            "definition": "The power, right, or authority to interpret and apply the law.",
            "pos": "noun",
            "sent1": "In our town, the mayor has the jurisdiction to make decisions about local laws.",
            "sent2": "The judge's jurisdiction allows them to make rulings in court cases.",
            "sent3": "The jurisdiction of the principal extends to enforcing school rules.",
            "sent4": "Her jurisdiction over the matter was clear as she explained the legal implications.",
            "sent5": "Understanding the jurisdiction of a judge is crucial for a fair legal system."
        },
        {
            "definition": "The territory or sphere of authority within which a court or government agency may properly exercise its power.",
            "pos": "noun",
            "sent1": "The police officer's jurisdiction includes patrolling the neighborhood streets.",
            "sent2": "The court's jurisdiction covers cases within the state boundaries.",
            "sent3": "It seemed like the cat claimed jurisdiction over the entire house.",
            "sent4": "The jurisdiction of the national park extends to the protected wildlife.",
            "sent5": "The boundaries of jurisdiction are clearly marked on the map for reference."
        },
        {
            "definition": "The extent or range of judicial, law enforcement, or other authority.",
            "pos": "noun",
            "sent1": "The sheriff's jurisdiction spans across multiple counties.",
            "sent2": "The jurisdiction of the federal agency includes investigating cybercrimes.",
            "sent3": "The dog acted as if it had jurisdiction over the backyard squirrels.",
            "sent4": "Her expertise in the field gave her a wide jurisdiction in the company.",
            "sent5": "The jurisdiction of the security guard reaches all corners of the building."
        }
    ]
}