{
    "term": "justing",
    "meanings": [
        {
            "definition": "Present participle of the verb 'just': to act or treat fairly and impartially",
            "pos": "verb",
            "sent1": "She was justing by dividing the cookies equally between her friends.",
            "sent2": "The judge was justing when he listened to both sides of the argument.",
            "sent3": "The siblings were justing over who got to sit in the front seat of the car.",
            "sent4": "The teacher was justing the students' efforts by giving them all equal praise.",
            "sent5": "The coach was justing the players by giving each one a chance to show their skills."
        },
        {
            "definition": "Adjective: based on or behaving according to what is morally right and fair",
            "pos": "adjective",
            "sent1": "His justing actions earned him the respect of his peers.",
            "sent2": "The decision to help the elderly lady was a justing choice.",
            "sent3": "The justing student always turned in his homework on time.",
            "sent4": "Her justing behavior towards others made her a role model in the community.",
            "sent5": "The justing response to the situation showed his integrity and honesty."
        },
        {
            "definition": "Adverb: exactly or precisely",
            "pos": "adverb",
            "sent1": "She followed the recipe justing to ensure the cake turned out perfectly.",
            "sent2": "He arrived justing on time for the meeting.",
            "sent3": "The arrow hit the target justing in the center.",
            "sent4": "The tailor measured the fabric justing to avoid any mistakes.",
            "sent5": "The student answered the question justing, showing a deep understanding of the topic."
        },
        {
            "definition": "Noun: the act of being fair and impartial",
            "pos": "noun",
            "sent1": "The justing of the teams was crucial to maintain a balanced competition.",
            "sent2": "Her commitment to justing in all situations was admirable.",
            "sent3": "The siblings agreed to a justing to settle their argument.",
            "sent4": "The concept of justing is fundamental in a democratic society.",
            "sent5": "The teacher emphasized the importance of justing in resolving conflicts peacefully."
        }
    ]
}