{
    "term": "justs",
    "meanings": [
        {
            "definition": "Used to indicate fairness or correctness",
            "pos": "adverb",
            "sent1": "She treated everyone justs, making sure no one felt left out.",
            "sent2": "He followed the rules justs, without any exceptions.",
            "sent3": "The judge ruled justs, but with a touch of humor in his decision.",
            "sent4": "Her actions were like a scale, always balancing justs and unjusts.",
            "sent5": "The teacher's explanation was so clear, it was justs what the students needed."
        },
        {
            "definition": "Exactly or precisely",
            "pos": "adverb",
            "sent1": "The tailor measured the fabric justs to ensure a perfect fit.",
            "sent2": "She arrived justs on time for the meeting.",
            "sent3": "The chef's recipe called for justs the right amount of seasoning.",
            "sent4": "His aim was justs, hitting the bullseye every time.",
            "sent5": "The puzzle pieces fit together justs, completing the picture perfectly."
        },
        {
            "definition": "Only recently",
            "pos": "adverb",
            "sent1": "I justs heard the news about the new movie release.",
            "sent2": "The store justs restocked its shelves with fresh produce.",
            "sent3": "She justs started learning how to play the guitar.",
            "sent4": "The flowers in the garden justs bloomed after the rain.",
            "sent5": "He justs discovered a hidden path in the forest."
        },
        {
            "definition": "A fair or impartial person",
            "pos": "noun",
            "sent1": "She was known as a justs in the community, always listening to both sides.",
            "sent2": "The king appointed him as the royal justs to resolve disputes.",
            "sent3": "The justs made sure everyone had a chance to speak their mind.",
            "sent4": "In the story, the justs character always made decisions based on fairness.",
            "sent5": "The justs was respected for his unbiased judgments."
        },
        {
            "definition": "To act in a just manner",
            "pos": "verb",
            "sent1": "He justs in all his dealings, never resorting to dishonesty.",
            "sent2": "The team captain always justs when making decisions for the group.",
            "sent3": "She justs by considering the needs of others before her own.",
            "sent4": "The leader justs by ensuring everyone is treated equally.",
            "sent5": "They justs by standing up for what is right, even when it's difficult."
        }
    ]
}