{
    "term": "kabaddis",
    "meanings": [
        {
            "definition": "A traditional Indian team sport involving physical contact and tagging opponents.",
            "pos": "noun",
            "sent1": "During the kabaddis game, players must touch opponents and return to their side quickly.",
            "sent2": "The village organized a kabaddis tournament to celebrate the harvest season.",
            "sent3": "In a funny twist, the kabaddis team accidentally tagged their own player instead of the opponent.",
            "sent4": "The kabaddis match was like a dance of touch and retreat, each move strategic and swift.",
            "sent5": "The sound of 'kabaddis' echoed through the field as players lunged and dodged in the intense game."
        },
        {
            "definition": "The act of playing kabaddi.",
            "pos": "noun",
            "sent1": "His favorite part of the day was the kabaddis after school with friends.",
            "sent2": "After learning the rules, she joined the kabaddis club at the community center.",
            "sent3": "The children giggled as they attempted their first kabaddis, stumbling and tagging each other.",
            "sent4": "The kabaddis session felt like a burst of energy, each player fully engaged in the game.",
            "sent5": "The joy of kabaddis filled the air as laughter and cheers accompanied every round played."
        },
        {
            "definition": "A player in a kabaddi match.",
            "pos": "noun",
            "sent1": "The kabaddis sprinted across the court, trying to tag opponents and score points.",
            "sent2": "As a kabaddis, he was known for his agility and quick reflexes during matches.",
            "sent3": "The kabaddis grinned mischievously before dashing to tag an unsuspecting opponent.",
            "sent4": "In the heat of the game, the kabaddis seemed to move like a blur, unstoppable and determined.",
            "sent5": "The crowd cheered for their favorite kabaddis, each player a hero in the intense battle of skill and strategy."
        }
    ]
}