{
    "term": "kabiki",
    "meanings": [
        {
            "definition": "A type of traditional Japanese puppet theater.",
            "pos": "noun",
            "sent1": "The kabiki was beautifully crafted and moved gracefully on the stage.",
            "sent2": "We watched a kabiki performance that told a captivating story.",
            "sent3": "During the kabiki show, the puppet accidentally dropped its prop, creating a funny moment.",
            "sent4": "The kabiki theater transported the audience to a magical world of imagination.",
            "sent5": "The intricate details of the kabiki puppet mesmerized the children in the audience."
        },
        {
            "definition": "A style of Japanese theater featuring elaborate costumes and makeup.",
            "pos": "noun",
            "sent1": "The kabiki actors wore stunning costumes that shimmered under the stage lights.",
            "sent2": "The kabiki performance showcased the artistry of traditional Japanese attire.",
            "sent3": "The kabiki makeup artist skillfully transformed the actors into characters from ancient tales.",
            "sent4": "Her outfit for the play was so elaborate, it resembled a kabiki costume.",
            "sent5": "The intricate kabiki costumes added a touch of elegance to the theatrical production."
        },
        {
            "definition": "A form of entertainment involving storytelling and music.",
            "pos": "noun",
            "sent1": "The kabiki event combined captivating stories with enchanting melodies.",
            "sent2": "We enjoyed a night of kabiki that filled our hearts with joy.",
            "sent3": "The kabiki performance had the audience tapping their feet to the lively tunes.",
            "sent4": "His storytelling had a kabiki charm that kept everyone spellbound.",
            "sent5": "Attending the kabiki show was like stepping into a world of enchantment and melody."
        }
    ]
}