{
    "term": "kaddishes",
    "meanings": [
        {
            "definition": "Kaddishes: plural form of kaddish",
            "pos": "noun",
            "sent1": "During the funeral, the rabbi led the congregation in saying kaddishes.",
            "sent2": "After the service, the family members gathered to say kaddishes for their loved one.",
            "sent3": "The synagogue was filled with the sound of kaddishes, a solemn and comforting ritual.",
            "sent4": "As the kaddishes echoed through the sanctuary, a sense of peace settled over the mourners.",
            "sent5": "The haunting melody of the kaddishes lingered in the air, a tribute to those who had passed away."
        },
        {
            "definition": "Kaddishes: performs the Jewish prayer of mourning",
            "pos": "verb",
            "sent1": "Every Friday evening, the family kaddishes together to honor their ancestors.",
            "sent2": "The rabbi kaddishes with the congregation to remember those who have passed.",
            "sent3": "When the cat meowed along with the kaddishes, it seemed to be paying its respects too.",
            "sent4": "The mourners kaddishes with heavy hearts, seeking solace in the ancient words.",
            "sent5": "She softly kaddishes, her voice trembling with emotion as she remembers her father."
        },
        {
            "definition": "Kaddishes: recites the Kaddish prayer for the deceased",
            "pos": "verb",
            "sent1": "The cantor kaddishes beautifully, bringing comfort to the grieving family.",
            "sent2": "Each year, the community gathers to kaddishes for all those who have passed on.",
            "sent3": "As the child kaddishes for the first time, the elders smile at the tradition continuing.",
            "sent4": "In the quiet cemetery, the wind seemed to kaddishes along with the mourners.",
            "sent5": "She kaddishes with reverence, honoring the memory of her grandmother with each word."
        }
    ]
}