{
    "term": "kae",
    "meanings": [
        {
            "definition": "A type of seaweed",
            "pos": "noun",
            "sent1": "The beach was covered in kae, making it slippery to walk on.",
            "sent2": "The sushi chef used kae to wrap around the rice for the sushi rolls.",
            "sent3": "The seagull tried to steal the kae from the picnic blanket.",
            "sent4": "The kae swayed gently with the ocean currents, like a dancer in the sea.",
            "sent5": "The kae's vibrant green color stood out against the dark rocks."
        },
        {
            "definition": "A traditional Maori food made from corn",
            "pos": "noun",
            "sent1": "Grandma prepared a delicious kae dish for our family dinner.",
            "sent2": "The kae was a staple food in the Maori community for generations.",
            "sent3": "The children giggled as they tried to eat the sticky kae with their hands.",
            "sent4": "The aroma of the cooking kae filled the kitchen, comforting everyone.",
            "sent5": "The kae pudding was a sweet treat enjoyed during special occasions."
        },
        {
            "definition": "A Scottish word for a jackdaw",
            "pos": "noun",
            "sent1": "The kae perched on the tree branch, watching the surroundings.",
            "sent2": "In Scottish folklore, the kae was believed to bring good luck.",
            "sent3": "The mischievous kae stole shiny objects to decorate its nest.",
            "sent4": "The kae's black feathers shimmered in the sunlight like polished coal.",
            "sent5": "The kae's caw echoed through the valley, signaling the start of the day."
        },
        {
            "definition": "A type of Japanese tea ceremony",
            "pos": "noun",
            "sent1": "During the kae, participants focus on the art of tea preparation.",
            "sent2": "The kae is a serene and meditative practice in Japanese culture.",
            "sent3": "The kae ceremony required precise movements and attention to detail.",
            "sent4": "The kae master gracefully performed each step of the ceremony.",
            "sent5": "The kae ritual symbolized harmony and respect among the participants."
        },
        {
            "definition": "A unit of currency in Laos",
            "pos": "noun",
            "sent1": "The market vendor quoted the price in kae for the handmade crafts.",
            "sent2": "Travelers exchanged their dollars for kae to shop at the local markets.",
            "sent3": "The kae coins jingled in the vendor's pouch as he counted the day's earnings.",
            "sent4": "The value of the kae fluctuated based on the country's economic stability.",
            "sent5": "The kae notes featured intricate designs reflecting Laos' cultural heritage."
        }
    ]
}