{
    "term": "kakapo",
    "meanings": [
        {
            "definition": "A large, flightless nocturnal parrot native to New Zealand.",
            "pos": "noun",
            "sent1": "The kakapo sleeps during the day and searches for food at night.",
            "sent2": "I read a book about the kakapo, a parrot that cannot fly.",
            "sent3": "The kakapo tried to stay awake during the day but kept falling asleep.",
            "sent4": "In the darkness, the kakapo moved silently like a ghost.",
            "sent5": "The kakapo's feathers were as soft as a cloud."
        },
        {
            "definition": "The only species of parrot that cannot fly.",
            "pos": "noun",
            "sent1": "The kakapo uses its strong legs to climb trees instead of flying.",
            "sent2": "Have you ever seen a kakapo, the parrot that is unable to fly?",
            "sent3": "The kakapo envied the other parrots soaring high in the sky.",
            "sent4": "The kakapo felt grounded, like a bird with clipped wings.",
            "sent5": "The kakapo's wings were a reminder of its earthbound nature."
        },
        {
            "definition": "Known for its green plumage and owl-like face.",
            "pos": "adjective",
            "sent1": "The kakapo's green feathers blended perfectly with the forest.",
            "sent2": "I saw a picture of the kakapo with its distinctive green plumage.",
            "sent3": "The kakapo's owl-like face made it look wise beyond its years.",
            "sent4": "Her eyes were as piercing as a kakapo's gaze.",
            "sent5": "The kakapo's appearance was a mix of elegance and mystery."
        },
        {
            "definition": "Endangered due to habitat loss and introduced predators.",
            "pos": "adjective",
            "sent1": "Conservation efforts are crucial to protect the kakapo from extinction.",
            "sent2": "The kakapo population is declining rapidly because of habitat loss.",
            "sent3": "The kakapo felt vulnerable in the face of new predators.",
            "sent4": "The kakapo's future hung in the balance, like a delicate thread.",
            "sent5": "The kakapo's plight served as a warning about environmental destruction."
        }
    ]
}