{
    "term": "kamees",
    "meanings": [
        {
            "definition": "A long tunic worn by men in South Asia.",
            "pos": "noun",
            "sent1": "He wore a colorful kamees to the traditional celebration.",
            "sent2": "The tailor stitched a new kamees for the wedding ceremony.",
            "sent3": "The kamees looked like a vibrant rainbow in the crowd.",
            "sent4": "His kamees was a flag of his cultural pride.",
            "sent5": "The intricate embroidery on the kamees dazzled everyone."
        },
        {
            "definition": "To wear a kamees.",
            "pos": "verb",
            "sent1": "She will kamees the elegant outfit for the special event.",
            "sent2": "They always kamees their traditional attire on festive occasions.",
            "sent3": "Let's kamees our best clothes and have a great time!",
            "sent4": "He decided to kamees the formal suit for the important meeting.",
            "sent5": "Kamees your favorite dress and join the party!"
        },
        {
            "definition": "Made of cotton or silk fabric.",
            "pos": "adjective",
            "sent1": "The soft kamees felt comfortable against his skin.",
            "sent2": "She chose a luxurious kamees for the royal banquet.",
            "sent3": "The kamees was as smooth as a gentle breeze.",
            "sent4": "Her kamees shimmered under the evening lights.",
            "sent5": "The kamees was a perfect blend of style and comfort."
        },
        {
            "definition": "Loose-fitting garment.",
            "pos": "noun",
            "sent1": "The loose kamees allowed for easy movement.",
            "sent2": "She preferred to wear a loose kamees in the hot weather.",
            "sent3": "His kamees billowed in the wind like a sail.",
            "sent4": "The oversized kamees was cozy and relaxed.",
            "sent5": "The flowing kamees added a touch of elegance to her look."
        }
    ]
}