{
    "term": "kamis",
    "meanings": [
        {
            "definition": "A traditional Indonesian shirt worn by men.",
            "pos": "noun",
            "sent1": "My father wore a colorful kamis to the wedding.",
            "sent2": "The kamis is a popular attire for special occasions in Indonesia.",
            "sent3": "The kamis looked like a rainbow with its vibrant colors.",
            "sent4": "His kamis was a canvas of cultural patterns and designs.",
            "sent5": "The intricate embroidery on the kamis caught everyone's eye."
        },
        {
            "definition": "The fifth day of the week in the Islamic calendar.",
            "pos": "noun",
            "sent1": "On kamis, Muslims gather for Jummah prayers.",
            "sent2": "Kamis is also known as 'Thursday' in English.",
            "sent3": "It's kamis today, time for some delicious biryani!",
            "sent4": "The serenity of kamis evenings is truly special.",
            "sent5": "Kamis marks the approach of the weekend for many workers."
        },
        {
            "definition": "A type of Japanese paper made from mulberry bark.",
            "pos": "noun",
            "sent1": "The artist used kamis to create delicate origami cranes.",
            "sent2": "Kamis is known for its strength and flexibility in art.",
            "sent3": "The kamis fluttered in the wind like a gentle butterfly.",
            "sent4": "Her artwork was a masterpiece of intricate kamis folds.",
            "sent5": "The kamis added a touch of elegance to the room's decor."
        },
        {
            "definition": "A type of fabric made from cotton or silk.",
            "pos": "noun",
            "sent1": "The dress was made of a soft, flowing kamis.",
            "sent2": "Kamis fabric is perfect for hot summer days.",
            "sent3": "She sewed a beautiful kamis blouse for the party.",
            "sent4": "The kamis shimmered under the lights at the fashion show.",
            "sent5": "The smooth texture of the kamis was a delight to touch."
        }
    ]
}