{
    "term": "kangaroos",
    "meanings": [
        {
            "definition": "Kangaroos: large marsupials native to Australia",
            "pos": "noun",
            "sent1": "In the zoo, we saw kangaroos hopping around.",
            "sent2": "Kangaroos are interesting animals from Australia.",
            "sent3": "The kangaroos at the park seemed to be having a hopping race.",
            "sent4": "The kangaroos in the wildlife documentary looked like bouncy giants.",
            "sent5": "I will never forget the first time I saw kangaroos in the wild."
        },
        {
            "definition": "Kangaroos: hop on their hind legs",
            "pos": "noun",
            "sent1": "Look at the kangaroos hopping in the field!",
            "sent2": "Kangaroos move by hopping on their hind legs.",
            "sent3": "The kangaroos at the circus were practicing their hopping skills.",
            "sent4": "The kangaroos in the video game seemed to hop endlessly.",
            "sent5": "The baby kangaroo learned to hop by watching its mother."
        },
        {
            "definition": "Kangaroos: pouch for carrying young",
            "pos": "noun",
            "sent1": "The mother kangaroo gently placed her joey in the pouch.",
            "sent2": "Kangaroos carry their babies in a special pouch.",
            "sent3": "The kangaroo's pouch looked like a cozy little pocket.",
            "sent4": "The kangaroo's pouch is like a warm, safe nursery on the move.",
            "sent5": "The baby kangaroo peeked out of its mother's pouch curiously."
        },
        {
            "definition": "Kangaroos: herbivorous diet",
            "pos": "noun",
            "sent1": "Kangaroos enjoy munching on grass and leaves.",
            "sent2": "A kangaroo's diet consists mainly of plants.",
            "sent3": "The kangaroos at the salad bar seemed to be picky eaters.",
            "sent4": "The kangaroos in the meadow were like nature's lawnmowers.",
            "sent5": "The kangaroos peacefully grazed in the green pasture."
        }
    ]
}