{
    "term": "kantar",
    "meanings": [
        {
            "definition": "A unit of weight in Turkey and Persia, varying in different localities from about 120 to 160 pounds.",
            "pos": "noun",
            "sent1": "In Turkey, merchants used a kantar to measure heavy goods.",
            "sent2": "The farmer weighed his harvest using a kantar at the market.",
            "sent3": "The chef mistakenly thought a kantar was a small unit of weight for spices.",
            "sent4": "Her love for him felt as heavy as a kantar on her heart.",
            "sent5": "The kantar swung back and forth, creaking under the strain of the load."
        },
        {
            "definition": "A unit of weight in Egypt, varying in different localities from about 120 to 150 pounds.",
            "pos": "noun",
            "sent1": "The ancient Egyptians used a kantar to measure precious metals.",
            "sent2": "At the port, workers unloaded the cargo, each crate weighed with a kantar.",
            "sent3": "The pharaoh's kantar was so heavy, it sank the boat in the Nile!",
            "sent4": "Her laughter lifted his spirits like a kantar being removed from his shoulders.",
            "sent5": "The kantar sat on the scale, a silent judge of the goods placed before it."
        },
        {
            "definition": "A unit of weight in Greece, varying in different localities from about 100 to 120 pounds.",
            "pos": "noun",
            "sent1": "The Greek traders used a kantar to ensure fair exchanges.",
            "sent2": "In ancient Greece, a kantar was a symbol of wealth and power.",
            "sent3": "The kantar rolled down the hill, causing chaos in the marketplace.",
            "sent4": "His guilt pressed on him like a heavy kantar, impossible to ignore.",
            "sent5": "The kantar gleamed in the sunlight, a beacon of accuracy in the bustling market."
        },
        {
            "definition": "A unit of weight in Syria, varying in different localities from about 150 to 200 pounds.",
            "pos": "noun",
            "sent1": "The Syrian merchants traded goods measured in kantar units.",
            "sent2": "The kantar was too heavy for one person to lift; teamwork was essential.",
            "sent3": "The mischievous child tried to use a kantar as a makeshift seesaw.",
            "sent4": "The burden of responsibility felt like a kantar on his shoulders.",
            "sent5": "The kantar towered over the other weights, a true heavyweight champion."
        }
    ]
}