{
    "term": "kapu",
    "meanings": [
        {
            "definition": "A system of laws and regulations in ancient Hawaii",
            "pos": "noun",
            "sent1": "In ancient Hawaii, the kapu governed the behavior of the people.",
            "sent2": "The kapu were strict rules that everyone had to follow.",
            "sent3": "Breaking the kapu was a serious offense in the olden days.",
            "sent4": "The kapu acted as a guide for proper conduct in the community.",
            "sent5": "Learning about the kapu helps us understand the culture of ancient Hawaii better."
        },
        {
            "definition": "Forbidden or prohibited",
            "pos": "adjective",
            "sent1": "Entering the kapu area was strictly forbidden.",
            "sent2": "The kapu fruit was off-limits to everyone except the chief.",
            "sent3": "She felt a rebellious urge to break the kapu rule.",
            "sent4": "The kapu sign on the door warned people to stay out.",
            "sent5": "The kapu gate was locked to keep intruders away."
        },
        {
            "definition": "A sacred or holy place",
            "pos": "noun",
            "sent1": "The temple was considered a kapu by the villagers.",
            "sent2": "Only the priests were allowed to enter the kapu area.",
            "sent3": "Visiting the kapu made her feel a sense of peace.",
            "sent4": "The kapu was adorned with beautiful carvings and symbols.",
            "sent5": "The kapu was a place where prayers were offered to the gods."
        },
        {
            "definition": "To be restricted or off-limits",
            "pos": "verb",
            "sent1": "The beach was kapu for swimming due to dangerous currents.",
            "sent2": "They decided to kapu the forest to protect the endangered species.",
            "sent3": "He kapued the room to keep his little brother out of his stuff.",
            "sent4": "The authorities kapued the area for investigation purposes.",
            "sent5": "The sign kapuing the construction site warned people to stay away."
        }
    ]
}