{
    "term": "karo",
    "meanings": [
        {
            "definition": "A type of corn syrup",
            "pos": "noun",
            "sent1": "I used karo to sweeten my dessert.",
            "sent2": "The recipe called for karo as a key ingredient.",
            "sent3": "The karo flowed smoothly from the bottle, like a golden river.",
            "sent4": "Her voice was as sweet as karo, soothing everyone around her.",
            "sent5": "The karo glistened under the kitchen lights, tempting me to taste it."
        },
        {
            "definition": "A type of dance in Argentina",
            "pos": "noun",
            "sent1": "The tango is a famous karo in Argentina.",
            "sent2": "They performed the karo with grace and passion.",
            "sent3": "The karo competition was full of energy and excitement.",
            "sent4": "Their movements were as precise as a karo, perfectly in sync.",
            "sent5": "The karo music filled the room, making everyone want to dance along."
        },
        {
            "definition": "A type of Indian bread",
            "pos": "noun",
            "sent1": "I enjoyed the warm karo with my curry.",
            "sent2": "The aroma of freshly baked karo filled the kitchen.",
            "sent3": "He shaped the karo dough into perfect rounds, like little moons.",
            "sent4": "The karo was soft and fluffy, melting in my mouth.",
            "sent5": "The karo was the highlight of the meal, complementing the spicy flavors."
        },
        {
            "definition": "A type of sugar cane juice",
            "pos": "noun",
            "sent1": "The vendor sold refreshing karo on a hot day.",
            "sent2": "I quenched my thirst with a glass of chilled karo.",
            "sent3": "The karo was so sweet, it felt like a sugary hug.",
            "sent4": "The karo tasted like sunshine in a cup, bright and invigorating.",
            "sent5": "The karo was a delightful treat, cooling me down instantly."
        }
    ]
}