{
    "term": "karyotyping",
    "meanings": [
        {
            "definition": "The process of examining an individual's chromosomes to detect abnormalities.",
            "pos": "noun",
            "sent1": "Karyotyping helps doctors see if there are any problems in a person's chromosomes.",
            "sent2": "The doctor used karyotyping to check for any issues in the patient's genetic material.",
            "sent3": "During the karyotyping process, the chromosomes revealed a surprise, like a hidden puzzle piece.",
            "sent4": "The karyotyping results painted a clear picture of the genetic health of the individual.",
            "sent5": "Through karyotyping, the genetic code becomes like a map, guiding the search for answers."
        },
        {
            "definition": "A technique used to analyze the number, size, and shape of chromosomes in a cell.",
            "pos": "noun",
            "sent1": "Scientists use karyotyping to study the structure of chromosomes in cells.",
            "sent2": "The lab technician performed karyotyping to understand the cell's genetic composition.",
            "sent3": "The karyotyping process felt like solving a genetic puzzle under the microscope.",
            "sent4": "Karyotyping is like a genetic magnifying glass, revealing the secrets of chromosomes.",
            "sent5": "Through karyotyping, the cell's chromosomes show their unique shapes and sizes."
        },
        {
            "definition": "The act of arranging and classifying chromosomes based on their characteristics.",
            "pos": "noun",
            "sent1": "In karyotyping, scientists organize chromosomes according to their traits.",
            "sent2": "The researcher spent hours karyotyping to categorize the chromosomes accurately.",
            "sent3": "The karyotyping task turned into a fun game of genetic sorting and labeling.",
            "sent4": "Karyotyping is like creating a genetic library where each chromosome has its place.",
            "sent5": "Through karyotyping, the chromosomes reveal their unique identities, like characters in a story."
        }
    ]
}