{
    "term": "katcinas",
    "meanings": [
        {
            "definition": "A representation of a Hopi spirit in the form of a doll or carved figure.",
            "pos": "noun",
            "sent1": "The children admired the intricate katcinas displayed in the museum.",
            "sent2": "During the festival, the dancers wore colorful katcinas to honor their ancestors.",
            "sent3": "The mischievous kitten knocked over the katcinas, thinking they were toys.",
            "sent4": "Her room was filled with katcinas, each one telling a different story.",
            "sent5": "The old man carved the katcinas with such skill that they seemed to come to life."
        },
        {
            "definition": "A Hopi ritual dance performed by men wearing masks and costumes representing spirits.",
            "pos": "noun",
            "sent1": "The villagers gathered to watch the mesmerizing katcinas dance under the moonlight.",
            "sent2": "The rhythmic beats of the drums accompanied the graceful movements of the katcinas.",
            "sent3": "The children giggled as they tried to imitate the elaborate katcinas dance.",
            "sent4": "The katcinas moved with such fluidity, it was as if the spirits themselves were present.",
            "sent5": "The elders believed that performing the katcinas dance brought blessings to the community."
        },
        {
            "definition": "A Hopi religious ceremony involving the worship of ancestral spirits.",
            "pos": "noun",
            "sent1": "The entire village participated in the sacred katcinas ceremony to honor their forefathers.",
            "sent2": "The chanting echoed through the canyon during the traditional katcinas ritual.",
            "sent3": "The playful dog interrupted the solemn katcinas ceremony, causing a moment of laughter.",
            "sent4": "As the sun set, the glow of the fire illuminated the faces of the worshippers in the katcinas ceremony.",
            "sent5": "The intricate details of the masks worn during the katcinas ceremony held deep symbolic meanings."
        }
    ]
}