{
    "term": "kati",
    "meanings": [
        {
            "definition": "A unit of currency in Bangladesh, equal to one hundredth of a taka.",
            "pos": "noun",
            "sent1": "In Bangladesh, you can buy small items with just one kati.",
            "sent2": "I exchanged ten takas for one hundred katis at the market.",
            "sent3": "The kati rolled away, causing a funny chase around the market stalls.",
            "sent4": "Her savings were like a pile of colorful katis, each representing a small wish.",
            "sent5": "The sound of katis clinking together filled the air as people made purchases."
        },
        {
            "definition": "A type of traditional Finnish knife.",
            "pos": "noun",
            "sent1": "The sharp kati was used to carve intricate designs on wood.",
            "sent2": "He always kept his trusty kati in a leather sheath on his belt.",
            "sent3": "The chef playfully juggled the kati, pretending it was a circus act.",
            "sent4": "Her words cut through the tension like a swift kati through butter.",
            "sent5": "The kati gleamed under the sunlight, reflecting its craftsmanship."
        },
        {
            "definition": "A type of traditional Indian waistband.",
            "pos": "noun",
            "sent1": "The dancer's colorful kati swayed with her graceful movements.",
            "sent2": "She carefully wrapped the embroidered kati around her waist.",
            "sent3": "The mischievous puppy ran off with the dancer's kati, thinking it was a toy.",
            "sent4": "Her kati held the memories of festivals and celebrations close to her.",
            "sent5": "The intricate patterns on the kati added elegance to her traditional attire."
        },
        {
            "definition": "A type of traditional African basket.",
            "pos": "noun",
            "sent1": "The villagers carried their harvest in woven katis on their heads.",
            "sent2": "She placed the freshly picked fruits in the large kati by the door.",
            "sent3": "The mischievous monkey tried to hide in the kati, thinking it was a cozy nest.",
            "sent4": "The kati symbolized unity as it held the community's offerings.",
            "sent5": "The intricate weaving of the kati showcased the skill of the local artisans."
        }
    ]
}