{
    "term": "kavakavas",
    "meanings": [
        {
            "definition": "A type of plant native to the Pacific Islands.",
            "pos": "noun",
            "sent1": "The kavakavas plant has green leaves.",
            "sent2": "People in the Pacific Islands cherish the kavakavas plant.",
            "sent3": "I saw a monkey swinging from a kavakavas tree!",
            "sent4": "Her love for gardening bloomed like a kavakavas plant.",
            "sent5": "The kavakavas plant's vibrant colors brightened the garden."
        },
        {
            "definition": "The dried root of the kavakavas plant used for medicinal purposes.",
            "pos": "noun",
            "sent1": "Grandma brewed tea with kavakavas roots.",
            "sent2": "The kavakavas root is known for its healing properties.",
            "sent3": "The doctor prescribed kavakavas root for a speedy recovery.",
            "sent4": "Hope sprouted in her heart like a kavakavas root.",
            "sent5": "The aroma of kavakavas root filled the room with comfort."
        },
        {
            "definition": "A traditional drink made from the kavakavas plant.",
            "pos": "noun",
            "sent1": "The villagers enjoyed a refreshing kavakavas beverage.",
            "sent2": "The kavakavas drink is a favorite during celebrations.",
            "sent3": "She spilled kavakavas drink on her dress at the party!",
            "sent4": "His laughter bubbled up like a glass of kavakavas drink.",
            "sent5": "The kavakavas drink danced on their taste buds with joy."
        },
        {
            "definition": "The act of preparing or consuming kavakavas.",
            "pos": "noun",
            "sent1": "The kavakavas ceremony united the community.",
            "sent2": "Families gathered for the annual kavakavas feast.",
            "sent3": "The children played pretend kavakavas party in the backyard.",
            "sent4": "Her words were a sweet kavakavas to his ears.",
            "sent5": "The aroma of kavakavas filled the air, signaling the start of the festival."
        }
    ]
}