{
    "term": "kedges",
    "meanings": [
        {
            "definition": "A small anchor used for warping or kedging a ship.",
            "pos": "noun",
            "sent1": "The sailors used kedges to help the ship stay in place during the storm.",
            "sent2": "The captain instructed the crew to lower the kedges to secure the ship in the harbor.",
            "sent3": "The mischievous seagull tried to steal one of the kedges, thinking it was a shiny toy.",
            "sent4": "The kedges held onto the ocean floor like loyal guardians, keeping the ship safe.",
            "sent5": "The shiny kedges gleamed in the sunlight, a small but essential part of the ship's equipment."
        },
        {
            "definition": "To move a ship by means of a kedge.",
            "pos": "verb",
            "sent1": "The sailors had to kedges the ship closer to the shore carefully.",
            "sent2": "The crew decided to kedges the vessel to a better position for fishing.",
            "sent3": "The ship's cat seemed to think it could kedges the whole ship by pushing against the mast.",
            "sent4": "The idea of using teamwork to kedges the ship forward inspired the crew.",
            "sent5": "With a steady pull, they managed to kedges the heavy ship through the narrow channel."
        },
        {
            "definition": "A small anchor used for warping or kedging a ship.",
            "pos": "noun",
            "sent1": "The old kedges had weathered many storms and still held strong.",
            "sent2": "Each kedges was carefully inspected before being used to secure the ship.",
            "sent3": "The captain joked that the kedges were like tiny superheroes, saving the ship when needed.",
            "sent4": "The kedges clung to the seabed like loyal companions, never letting go.",
            "sent5": "In times of trouble, the crew knew they could rely on the trusty kedges to keep them safe."
        }
    ]
}