{
    "term": "kedge",
    "meanings": [
        {
            "definition": "A small anchor used for warping or kedging a ship.",
            "pos": "noun",
            "sent1": "The sailors threw the kedge overboard to help the ship stay in place.",
            "sent2": "The kedge was essential for keeping the ship steady in the strong currents.",
            "sent3": "The mischievous seagull tried to steal the kedge, thinking it was a shiny treasure.",
            "sent4": "The kedge, like a loyal friend, held onto the ship tightly in the stormy sea.",
            "sent5": "The shiny kedge sparkled in the sunlight, a beacon of safety for the sailors."
        },
        {
            "definition": "To move a ship by means of a kedge.",
            "pos": "verb",
            "sent1": "The sailors had to kedge the ship closer to shore using the small anchor.",
            "sent2": "They decided to kedge the vessel to a safer location away from the rocky coast.",
            "sent3": "With a playful spirit, the crew pretended to kedge the ship across the calm waters.",
            "sent4": "The ship seemed to kedge through time, moving slowly but steadily towards its destination.",
            "sent5": "The captain's orders were clear: kedge the ship to avoid the treacherous reef ahead."
        },
        {
            "definition": "A small anchor used for warping or kedging a ship.",
            "pos": "noun",
            "sent1": "The old kedge had weathered many storms and still served its purpose faithfully.",
            "sent2": "The sailors relied on the kedge to keep the ship from drifting off course.",
            "sent3": "In a comical mishap, the kedge got stuck on a passing dolphin's fin.",
            "sent4": "The kedge, like a steadfast companion, never failed to keep the ship secure.",
            "sent5": "The shiny kedge gleamed in the moonlight, a silent guardian of the vessel."
        },
        {
            "definition": "To move a ship by means of a kedge.",
            "pos": "verb",
            "sent1": "The crew had to kedge the ship out of the shallow waters to deeper sea.",
            "sent2": "They planned to kedge the vessel to a more favorable position for fishing.",
            "sent3": "In a whimsical moment, the sailors pretended to kedge the ship across the calm bay.",
            "sent4": "The ship seemed to kedge through the waves, propelled by the small anchor.",
            "sent5": "The urgent command was given: kedge the ship quickly to avoid the approaching storm."
        }
    ]
}