{
    "term": "keen",
    "meanings": [
        {
            "definition": "Sharp or penetrating in character or quality.",
            "pos": "adjective",
            "sent1": "The keen wind cut through my jacket.",
            "sent2": "She has a keen interest in learning new things.",
            "sent3": "The keen cat spotted the mouse from afar.",
            "sent4": "His keen eyes noticed every detail in the painting.",
            "sent5": "The keen smell of fresh bread filled the room."
        },
        {
            "definition": "Eager or enthusiastic.",
            "pos": "adjective",
            "sent1": "I am keen to start my new job.",
            "sent2": "The children were keen to explore the new playground.",
            "sent3": "The puppy was keen to play fetch with the ball.",
            "sent4": "Her keen anticipation for the concert was palpable.",
            "sent5": "The students were keen to participate in the science experiment."
        },
        {
            "definition": "Having a sharp edge or point.",
            "pos": "adjective",
            "sent1": "The keen knife sliced through the bread effortlessly.",
            "sent2": "Be careful with that keen blade; it's very sharp.",
            "sent3": "The keen pencil drew precise lines on the paper.",
            "sent4": "The keen thorn pricked my finger as I reached for the rose.",
            "sent5": "The keen scissors neatly trimmed the edges of the paper."
        },
        {
            "definition": "Intense or strong.",
            "pos": "adjective",
            "sent1": "She felt a keen sense of loss after her pet passed away.",
            "sent2": "The team had a keen determination to win the championship.",
            "sent3": "The keen flavor of the chili made my eyes water.",
            "sent4": "His keen desire for success drove him to work hard.",
            "sent5": "The keen pain in his leg made it difficult to walk."
        }
    ]
}