{
    "term": "kenosis",
    "meanings": [
        {
            "definition": "The act of emptying or self-emptying",
            "pos": "noun",
            "sent1": "Her kenosis in giving away all her toys to the less fortunate children was truly admirable.",
            "sent2": "The monk's kenosis of worldly possessions allowed him to focus on spiritual growth.",
            "sent3": "In a surprising act of kenosis, the wealthy businessman donated his entire fortune to charity.",
            "sent4": "The artist's kenosis of colors on the canvas created a sense of depth and emotion.",
            "sent5": "The teacher's kenosis of knowledge to her students transformed their understanding of the subject."
        },
        {
            "definition": "A theological concept of self-emptying or self-sacrifice, particularly in reference to Jesus Christ",
            "pos": "noun",
            "sent1": "The story of Jesus's kenosis by sacrificing himself for humanity is a central theme in Christianity.",
            "sent2": "The idea of kenosis in Christianity emphasizes the importance of selflessness and compassion.",
            "sent3": "The play depicted a humorous version of kenosis where the characters kept giving away silly things.",
            "sent4": "Her love for animals was a kenosis, always putting their needs above her own.",
            "sent5": "The soldier's kenosis on the battlefield showed his unwavering dedication to his comrades."
        },
        {
            "definition": "The process of humbling oneself or relinquishing power or control",
            "pos": "noun",
            "sent1": "His kenosis in admitting his mistake and apologizing showed true humility.",
            "sent2": "The CEO's kenosis in stepping down from his position surprised everyone in the company.",
            "sent3": "The comedy movie portrayed a character's hilarious struggle with kenosis in a position of authority.",
            "sent4": "The politician's kenosis of power paved the way for a more inclusive and collaborative government.",
            "sent5": "The athlete's kenosis of control over his training regimen led to a breakthrough in performance."
        }
    ]
}