{
    "term": "kep",
    "meanings": [
        {
            "definition": "To catch or seize",
            "pos": "verb",
            "sent1": "I kep the ball during the game.",
            "sent2": "She quickly kep the opportunity to learn new skills.",
            "sent3": "The cat tried to kep the elusive mouse but failed comically.",
            "sent4": "His words kep my attention like a magnet.",
            "sent5": "The strong gust of wind kep the kite soaring high in the sky."
        },
        {
            "definition": "A small, low dam or weir",
            "pos": "noun",
            "sent1": "The beavers built a kep to control the water flow.",
            "sent2": "The fishermen gathered near the kep to catch fish.",
            "sent3": "The ducks swam playfully near the kep in the stream.",
            "sent4": "The kep created a peaceful ripple in the stream.",
            "sent5": "The kep prevented flooding in the valley during heavy rains."
        },
        {
            "definition": "A type of Scottish cap",
            "pos": "noun",
            "sent1": "He wore a traditional kep during the Highland festival.",
            "sent2": "The plaid kep added a touch of Scottish flair to his outfit.",
            "sent3": "The mischievous child hid a toy under his kep.",
            "sent4": "The kep perched jauntily on his head like a crown.",
            "sent5": "The old man's kep had a feather tucked in the band."
        },
        {
            "definition": "A unit of currency in Laos",
            "pos": "noun",
            "sent1": "She exchanged dollars for Laotian keps at the market.",
            "sent2": "The souvenir shop accepted both US dollars and keps.",
            "sent3": "He saved up his keps to buy a special gift for his mother.",
            "sent4": "The shiny kep coins jingled in his pocket.",
            "sent5": "The street vendor's prices were displayed in both keps and baht."
        }
    ]
}