{
    "term": "kerma",
    "meanings": [
        {
            "definition": "A unit of energy absorbed from ionizing radiation",
            "pos": "noun",
            "sent1": "The doctor explained that the kerma measured the energy absorbed by the body.",
            "sent2": "Radiation therapy uses kerma to target cancer cells.",
            "sent3": "The kerma from the X-ray machine seemed to give the teddy bear superpowers.",
            "sent4": "Her enthusiasm for learning was like a kerma, energizing everyone around her.",
            "sent5": "The kerma of the sun's rays warmed the earth on a cold winter day."
        },
        {
            "definition": "A type of Middle Eastern dessert made from sweetened cream and pastry",
            "pos": "noun",
            "sent1": "The bakery's specialty was their delicious kerma filled with cream.",
            "sent2": "During the festival, families enjoyed sharing plates of kerma after dinner.",
            "sent3": "She accidentally dropped the kerma on her brother's head, creating a sticky situation.",
            "sent4": "The kerma was a sweet cloud of happiness in her mouth.",
            "sent5": "The aroma of freshly baked kerma filled the kitchen with warmth and sweetness."
        },
        {
            "definition": "A city in Sudan",
            "pos": "noun",
            "sent1": "Travelers often visit Kerma to explore its rich history and culture.",
            "sent2": "The bustling markets of Kerma were filled with colorful fabrics and spices.",
            "sent3": "In Kerma, the locals welcomed visitors with open arms and big smiles.",
            "sent4": "The ancient ruins of Kerma whispered stories of the past to curious ears.",
            "sent5": "The sunset painted the sky above Kerma in a palette of warm colors."
        },
        {
            "definition": "A type of radiation dose measurement in medical imaging",
            "pos": "noun",
            "sent1": "The technician adjusted the machine to calculate the kerma for the patient's scan.",
            "sent2": "Doctors rely on accurate kerma measurements to ensure safe radiation levels.",
            "sent3": "The kerma reading on the monitor made the patient feel a bit nervous.",
            "sent4": "The kerma dose was precisely tailored to target the affected area.",
            "sent5": "Understanding the kerma value is crucial for effective treatment planning in medical imaging."
        }
    ]
}