{
    "term": "kerne",
    "meanings": [
        {
            "definition": "A group of Irish foot soldiers.",
            "pos": "noun",
            "sent1": "The kerne marched bravely into battle.",
            "sent2": "The kerne were known for their fierce fighting skills.",
            "sent3": "The kerne decided to have a dance-off instead of a battle.",
            "sent4": "The kerne's unity was as strong as a family bond.",
            "sent5": "The colorful uniforms of the kerne made them easy to spot on the battlefield."
        },
        {
            "definition": "A type of medieval infantryman.",
            "pos": "noun",
            "sent1": "In the medieval times, the kerne protected the castle.",
            "sent2": "The kerne wielded swords and shields in battle.",
            "sent3": "The kerne tried to juggle their weapons for entertainment.",
            "sent4": "The kerne's loyalty was unbreakable like steel.",
            "sent5": "The kerne's battle cries echoed through the valley."
        },
        {
            "definition": "To harden or form into a kernel.",
            "pos": "verb",
            "sent1": "She used heat to kerne the metal into a strong blade.",
            "sent2": "The potter carefully kerne the clay into a perfect shape.",
            "sent3": "He tried to kerne the ice cream by leaving it out in the sun.",
            "sent4": "Her determination kerne her resolve like steel.",
            "sent5": "The sculptor's hands skillfully kerne the marble into a masterpiece."
        },
        {
            "definition": "The inner part of a seed or nut.",
            "pos": "noun",
            "sent1": "She found a worm inside the kerne of the apple.",
            "sent2": "The chef carefully removed the kerne from the walnut.",
            "sent3": "The squirrel mistook the kerne for a precious gem.",
            "sent4": "The kerne of the sunflower held the promise of new life.",
            "sent5": "The kerne's hidden potential was waiting to sprout into something beautiful."
        }
    ]
}