{
    "term": "kests",
    "meanings": [
        {
            "definition": "A plural noun meaning a type of bird of prey.",
            "pos": "noun",
            "sent1": "The kests soared high in the sky, searching for their next meal.",
            "sent2": "I spotted a group of kests perched on the tree branches.",
            "sent3": "The mischievous squirrel tried to mimic the kests' hunting techniques.",
            "sent4": "Her eyes were as sharp as a kests' when she spotted the hidden treasure.",
            "sent5": "The kests' feathers glistened in the sunlight as they circled above."
        },
        {
            "definition": "A verb meaning to throw or cast something forcefully.",
            "pos": "noun",
            "sent1": "He used all his strength to kests the ball across the field.",
            "sent2": "She kests the stone into the pond, creating ripples on the surface.",
            "sent3": "The chef decided to kests the dough into the air for a fun twist.",
            "sent4": "The angry player kests his racket in frustration after losing the match.",
            "sent5": "With a swift motion, she kests the paper airplane into the air, watching it glide away.",
            "sent6": "Kests the dice onto the board and see where they land.",
            "sent7": "The magician will kests the cards into the audience for a thrilling trick."
        },
        {
            "definition": "An adjective meaning strong or forceful.",
            "pos": "adjective",
            "sent1": "The kests winds blew fiercely, bending the trees in their path.",
            "sent2": "She showed a kests determination to finish the challenging puzzle.",
            "sent3": "The kests storm rattled the windows with its powerful gusts.",
            "sent4": "His kests voice echoed through the empty hallways, commanding attention.",
            "sent5": "The team's kests defense prevented the opponents from scoring any goals."
        }
    ]
}