{
    "term": "kevel",
    "meanings": [
        {
            "definition": "A strong wooden pin used for securing ropes on a ship.",
            "pos": "noun",
            "sent1": "The sailor hammered the kevel into the deck to hold the ropes in place.",
            "sent2": "The kevel was firmly in place, keeping the ship's ropes secure.",
            "sent3": "The mischievous seagull perched on the kevel, pretending to be the ship's lookout.",
            "sent4": "The kevel stood tall like a loyal guardian, protecting the ship's ropes from unruly waves.",
            "sent5": "The worn-out kevel bore the marks of countless battles with the sea, a testament to its strength."
        },
        {
            "definition": "To fasten or secure with a kevel.",
            "pos": "verb",
            "sent1": "He carefully keveled the rope to the dock, ensuring the boat wouldn't drift away.",
            "sent2": "She keveled the sail to the mast before setting off on the voyage.",
            "sent3": "The children playfully keveled their jump ropes to the fence, creating a makeshift obstacle course.",
            "sent4": "His words keveled her heart, anchoring her emotions to his every promise.",
            "sent5": "The melody of the song keveled itself to her memory, becoming an everlasting tune in her mind."
        },
        {
            "definition": "A small anchor used for mooring boats.",
            "pos": "noun",
            "sent1": "The kevel kept the rowboat steady in the gentle currents of the harbor.",
            "sent2": "She tossed the kevel overboard, watching it sink to the sandy bottom.",
            "sent3": "The mischievous otter played with the kevel, mistaking it for a shiny toy.",
            "sent4": "The kevel held onto the boat like a loyal friend, never letting go in times of need.",
            "sent5": "The golden kevel gleamed in the sunlight, a beacon of safety for the moored boats."
        }
    ]
}