{
    "term": "keyboards",
    "meanings": [
        {
            "definition": "A set of keys or buttons on a musical instrument or computer that are used to play or input data.",
            "pos": "noun",
            "sent1": "The pianist's fingers danced across the keyboards, creating beautiful melodies.",
            "sent2": "I spilled coffee on my keyboard and now some keys are sticky.",
            "sent3": "The cat walked across the piano keyboards, creating a unique composition.",
            "sent4": "Her fingers moved swiftly on the keyboard, like a skilled magician casting spells.",
            "sent5": "The keyboards on the organ gleamed under the stage lights, inviting the musician to play."
        },
        {
            "definition": "The physical layout of keys on a musical instrument or computer.",
            "pos": "noun",
            "sent1": "The ergonomic keyboard design helped reduce wrist strain during long typing sessions.",
            "sent2": "The keyboard on my laptop is smaller than the one on my desktop computer.",
            "sent3": "The musician admired the intricate design of the piano keyboard, each key a work of art.",
            "sent4": "The keyboard layout resembled a maze, with each key leading to a different function.",
            "sent5": "The keys on the keyboard were color-coded for easy identification and use."
        },
        {
            "definition": "To type or input data using a keyboard.",
            "pos": "verb",
            "sent1": "She keyboards quickly, her fingers flying over the keys with precision.",
            "sent2": "I need to keyboard this report before the deadline.",
            "sent3": "He joked that he could keyboard blindfolded, but no one believed him.",
            "sent4": "She keyboarded her thoughts onto the screen, letting her ideas flow freely.",
            "sent5": "The writer keyboarded late into the night, crafting a masterpiece on the digital canvas."
        }
    ]
}