{
    "term": "khors",
    "meanings": [
        {
            "definition": "A unit of currency in Iran.",
            "pos": "noun",
            "sent1": "In Iran, you can buy many things with just a few khors.",
            "sent2": "I exchanged my dollars for khors at the bank.",
            "sent3": "The shopkeeper only accepted khors, no other currency!",
            "sent4": "Her smile was worth more than a thousand khors.",
            "sent5": "The shiny khors jingled in his pocket."
        },
        {
            "definition": "A unit of land measurement in Iran.",
            "pos": "noun",
            "sent1": "The farm was measured in khors, stretching as far as the eye could see.",
            "sent2": "The land was divided into smaller plots, each one equal to ten khors.",
            "sent3": "He claimed his backyard was a thousand khors wide, but it was just a small patch of grass.",
            "sent4": "The fields of wheat extended for many khors, a golden sea under the sun.",
            "sent5": "The ancient map showed the kingdom's borders in khors."
        },
        {
            "definition": "A type of ancient Persian warrior.",
            "pos": "noun",
            "sent1": "The khors fought bravely in battle, their swords flashing in the sun.",
            "sent2": "Legends spoke of the fearless khors who defended their kingdom.",
            "sent3": "The children played pretend, pretending to be mighty khors protecting their village.",
            "sent4": "His determination in the face of danger made him a true khors.",
            "sent5": "The ancient tapestries depicted the khors in their shining armor."
        },
        {
            "definition": "A type of ancient Persian cavalry.",
            "pos": "noun",
            "sent1": "The khors rode swiftly across the battlefield, their horses thundering.",
            "sent2": "The king's army included a regiment of skilled khors on horseback.",
            "sent3": "The villagers cheered as the khors galloped into town, bringing news from afar.",
            "sent4": "Their unity and speed made the khors a formidable force.",
            "sent5": "The sound of hooves announced the arrival of the khors."
        }
    ]
}