{
    "term": "kibbi",
    "meanings": [
        {
            "definition": "A Middle Eastern dish made of bulgur, minced onions, and finely ground lean meat.",
            "pos": "noun",
            "sent1": "My mom cooked delicious kibbi for dinner last night.",
            "sent2": "In the Middle East, kibbi is a popular dish for special occasions.",
            "sent3": "I accidentally dropped the kibbi on the floor, and my dog thought it was a new toy.",
            "sent4": "The kibbi was like a flavor explosion in my mouth, with each bite bursting with savory goodness.",
            "sent5": "The aroma of the freshly baked kibbi filled the kitchen, making everyone's mouth water."
        },
        {
            "definition": "To shape or form into small balls or patties.",
            "pos": "verb",
            "sent1": "I carefully kibbied the mixture into bite-sized portions before frying them.",
            "sent2": "She likes to kibbi the dough into perfect round shapes for the cookies.",
            "sent3": "The children giggled as they tried to kibbi the playdough into different animal shapes.",
            "sent4": "His words seemed to kibbi into a beautiful poem that touched everyone's hearts.",
            "sent5": "The sculptor skillfully kibbied the clay into a stunning sculpture of a horse."
        },
        {
            "definition": "A small, round, deep-fried croquette made of bulgur and minced lamb.",
            "pos": "noun",
            "sent1": "The kibbi croquettes at the restaurant were crispy on the outside and tender inside.",
            "sent2": "I always order kibbi croquettes as an appetizer when dining at the Lebanese restaurant.",
            "sent3": "The kibbi croquette rolled off the plate and bounced on the floor, much to everyone's surprise.",
            "sent4": "Her eyes widened in delight as she bit into the kibbi croquette, savoring the rich flavors.",
            "sent5": "The kibbi croquette was like a golden nugget of deliciousness, a perfect blend of textures and tastes."
        }
    ]
}