{
    "term": "kicker",
    "meanings": [
        {
            "definition": "A person or thing that kicks.",
            "pos": "noun",
            "sent1": "The little boy was the best kicker in his soccer team.",
            "sent2": "The horse was a strong kicker when it felt threatened.",
            "sent3": "The robot kicker accidentally kicked the ball into the wrong goal.",
            "sent4": "The wind was a powerful kicker, sending leaves flying everywhere.",
            "sent5": "The kangaroo's powerful hind legs made it a skilled kicker."
        },
        {
            "definition": "A sudden, surprising event or piece of information.",
            "pos": "noun",
            "sent1": "The unexpected rainstorm was a real kicker during the picnic.",
            "sent2": "Finding out about the surprise party was a great kicker for her birthday.",
            "sent3": "The sudden cancellation of the flight was a real kicker for the travelers.",
            "sent4": "The last-minute goal was the kicker that won the game for the underdog team.",
            "sent5": "The plot twist in the movie was a real kicker that left everyone shocked."
        },
        {
            "definition": "A device for starting an engine by kicking a pedal.",
            "pos": "noun",
            "sent1": "The old motorcycle required a strong kicker to start the engine.",
            "sent2": "He used the kicker on his scooter to start it up and ride to work.",
            "sent3": "The vintage car's kicker was rusty and needed a hard kick to work.",
            "sent4": "The mechanic fixed the broken kicker on the lawnmower with a new part.",
            "sent5": "She struggled to use the kicker on the dirt bike to get it running smoothly."
        },
        {
            "definition": "A player responsible for kicking the ball in sports like football or soccer.",
            "pos": "noun",
            "sent1": "The team's best kicker scored the winning goal in the final match.",
            "sent2": "The soccer coach trained the kicker to improve their accuracy and power.",
            "sent3": "The football kicker's shoe flew off mid-kick, causing laughter on the field.",
            "sent4": "The star kicker's powerful kick sent the ball soaring into the net.",
            "sent5": "The young kicker practiced diligently to become the team's top scorer."
        }
    ]
}