{
    "term": "kickboard",
    "meanings": [
        {
            "definition": "A buoyant board used for support while swimming.",
            "pos": "noun",
            "sent1": "During swimming lessons, the children practiced floating with a kickboard.",
            "sent2": "The lifeguard handed the kickboard to the beginner swimmer to help them stay afloat.",
            "sent3": "The playful seal at the zoo tried to balance on the kickboard in the pool.",
            "sent4": "Her ideas were like a kickboard, keeping her afloat in the sea of creativity.",
            "sent5": "The bright orange kickboard bobbed gently on the calm water."
        },
        {
            "definition": "A board with a handle used for kicking in water.",
            "pos": "noun",
            "sent1": "The swimmer held onto the kickboard while practicing kicking drills.",
            "sent2": "At the pool, kids enjoy racing each other while holding onto their kickboards.",
            "sent3": "The mischievous duck tried to paddle across the pond using a kickboard.",
            "sent4": "Her determination was a kickboard, propelling her forward through life's challenges.",
            "sent5": "The colorful kickboard glided effortlessly through the clear blue water."
        },
        {
            "definition": "A board used for support while kicking in swimming.",
            "pos": "noun",
            "sent1": "The swim coach demonstrated the proper way to use a kickboard for kicking practice.",
            "sent2": "During the synchronized swimming routine, the team gracefully moved in unison with their kickboards.",
            "sent3": "The penguin at the aquarium comically tried to balance on the kickboard in the pool.",
            "sent4": "His optimism acted as a kickboard, helping him stay afloat in challenging times.",
            "sent5": "The sturdy kickboard provided reliable support as the swimmer kicked through the water."
        }
    ]
}