{
    "term": "kindle",
    "meanings": [
        {
            "definition": "To start a fire",
            "pos": "verb",
            "sent1": "I used a match to kindle the campfire.",
            "sent2": "She carefully added dry leaves to kindle the flames.",
            "sent3": "The little boy tried to kindle a fire using a magnifying glass.",
            "sent4": "His words were like sparks that kindled a passion within her.",
            "sent5": "The ancient ritual was meant to kindle the sacred flame."
        },
        {
            "definition": "To arouse or inspire",
            "pos": "verb",
            "sent1": "The teacher's story kindled curiosity in the students.",
            "sent2": "The beautiful artwork kindled a sense of creativity in her.",
            "sent3": "The unexpected compliment managed to kindle a smile on her face.",
            "sent4": "His speech was so powerful that it kindled a revolution.",
            "sent5": "The breathtaking view from the mountaintop kindled a sense of wonder in him."
        },
        {
            "definition": "To become ignited",
            "pos": "verb",
            "sent1": "The dry leaves quickly kindled in the scorching sun.",
            "sent2": "The spark finally caused the dry wood to kindle.",
            "sent3": "The fireworks display caused the night sky to kindle with colors.",
            "sent4": "The anger in his eyes kindled as he heard the insult.",
            "sent5": "The old fireplace took a while to kindle, but then it burned brightly."
        },
        {
            "definition": "To light or set on fire",
            "pos": "verb",
            "sent1": "She used a match to kindle the candle on the table.",
            "sent2": "The arsonist intended to kindle chaos in the city.",
            "sent3": "The chef needed to kindle the stove to start cooking.",
            "sent4": "The dry grass was easy to kindle with just a spark.",
            "sent5": "The ancient torch was used to kindle the ceremonial fire."
        }
    ]
}