{
    "term": "kinged",
    "meanings": [
        {
            "definition": "To make someone a king.",
            "pos": "verb",
            "sent1": "The queen kinged her son, making him the ruler of the kingdom.",
            "sent2": "The council kinged the nobleman, crowning him as the new monarch.",
            "sent3": "The magician kinged a frog, turning it into a majestic ruler of the pond.",
            "sent4": "With a wave of her wand, the fairy kinged the humble farmer, granting him a kingdom of his own.",
            "sent5": "In the ancient legend, the sword kinged the worthy warrior, bestowing upon him the crown of leadership."
        },
        {
            "definition": "To be made a king.",
            "pos": "verb",
            "sent1": "After years of training, the young prince was finally kinged and took his place on the throne.",
            "sent2": "In the fairy tale, the poor orphan was unexpectedly kinged and became the ruler of the land.",
            "sent3": "The cat dreamt of being kinged and ruling over all the mice in the house.",
            "sent4": "The magical amulet kinged the chosen one, fulfilling the ancient prophecy.",
            "sent5": "The crown magically kinged the rightful heir, marking the beginning of a new era."
        },
        {
            "definition": "Having the status or power of a king.",
            "pos": "adjective",
            "sent1": "The kinged knight rode proudly through the kingdom, displaying his noble status.",
            "sent2": "The kinged ruler made wise decisions for his people, showing his kingly power.",
            "sent3": "The kinged cat lounged on the velvet cushion, enjoying its regal position in the household.",
            "sent4": "The kinged lion roared with authority, asserting its dominance over the savannah.",
            "sent5": "The kinged queen graciously welcomed foreign dignitaries, embodying royal elegance and grace."
        }
    ]
}