{
    "term": "kismats",
    "meanings": [
        {
            "definition": "Fate or destiny",
            "pos": "noun",
            "sent1": "Some believe in the power of kismats to shape their lives.",
            "sent2": "Her kismats led her to unexpected opportunities.",
            "sent3": "His kismats seemed to have a mischievous sense of humor.",
            "sent4": "The tangled web of kismats intertwined their paths.",
            "sent5": "The concept of kismats is deeply ingrained in their culture."
        },
        {
            "definition": "Luck or fortune",
            "pos": "noun",
            "sent1": "Good kismats smiled upon him during the game.",
            "sent2": "She attributed her success to favorable kismats.",
            "sent3": "Finding a four-leaf clover felt like a stroke of kismats.",
            "sent4": "Their kismats seemed to change with the phases of the moon.",
            "sent5": "The kismats of winning the lottery are slim, but not impossible."
        },
        {
            "definition": "A predetermined course of events",
            "pos": "noun",
            "sent1": "Their kismats seemed to be leading them towards a shared goal.",
            "sent2": "The prophecy foretold the kismats of the kingdom.",
            "sent3": "The kismats of the story were written in the stars.",
            "sent4": "They felt like mere players in the grand theater of kismats.",
            "sent5": "The kismats of history unfolded before their eyes."
        },
        {
            "definition": "A person's lot in life",
            "pos": "noun",
            "sent1": "Despite his humble beginnings, he accepted his kismats with grace.",
            "sent2": "She worked hard to improve her kismats and create a better future.",
            "sent3": "His kismats were like a puzzle waiting to be solved.",
            "sent4": "The rich tapestry of kismats wove together their stories.",
            "sent5": "They embraced their kismats, knowing they could shape their own destiny."
        }
    ]
}