{
    "term": "kiteboarding",
    "meanings": [
        {
            "definition": "The sport of riding on a small surfboard while being pulled by a large kite.",
            "pos": "noun",
            "sent1": "Kiteboarding is a fun water sport that combines surfing and flying kites.",
            "sent2": "Many people enjoy kiteboarding at the beach during windy days.",
            "sent3": "When I tried kiteboarding for the first time, I felt like a superhero being propelled by the wind.",
            "sent4": "Her passion for kiteboarding soared as high as the kites in the sky.",
            "sent5": "The colorful kites dancing in the air made kiteboarding look like a magical experience."
        },
        {
            "definition": "The act of engaging in the sport of kiteboarding.",
            "pos": "noun",
            "sent1": "His favorite part of the weekend is the adrenaline rush he gets from kiteboarding.",
            "sent2": "Kiteboarding requires skill and balance to stay upright on the board.",
            "sent3": "After a long week of work, he finds solace in the freedom of kiteboarding on the open water.",
            "sent4": "The thrill of kiteboarding is like riding the wind itself.",
            "sent5": "The sound of waves crashing adds to the excitement of kiteboarding along the coast."
        },
        {
            "definition": "A person who participates in the sport of kiteboarding.",
            "pos": "noun",
            "sent1": "As a kiteboarding enthusiast, she always looks forward to the next windy day.",
            "sent2": "The kiteboarding community is supportive and welcoming to newcomers.",
            "sent3": "The kiteboarding champion proudly displayed their trophy at the event.",
            "sent4": "Being a kiteboarding pro requires dedication and practice.",
            "sent5": "The experienced kiteboarding instructor guided beginners with patience and encouragement."
        }
    ]
}