{
    "term": "klezmorim",
    "meanings": [
        {
            "definition": "Jewish musicians who play traditional Eastern European music.",
            "pos": "noun",
            "sent1": "The klezmorim performed at the synagogue during the holiday.",
            "sent2": "I enjoy listening to the klezmorim play their instruments.",
            "sent3": "The klezmorim decided to start a band called 'Matzo Melodies'.",
            "sent4": "The sound of the klezmorim's music filled the air like a joyful dance.",
            "sent5": "The klezmorim's melodies echoed through the streets, bringing smiles to everyone."
        },
        {
            "definition": "A group of klezmer musicians performing at a wedding.",
            "pos": "noun",
            "sent1": "The klezmorim played beautiful music at the wedding ceremony.",
            "sent2": "Guests danced joyfully to the tunes of the klezmorim.",
            "sent3": "The klezmorim accidentally played the wedding march backwards.",
            "sent4": "The presence of the klezmorim added a touch of tradition to the modern wedding.",
            "sent5": "The bride and groom thanked the klezmorim for making their day special with music."
        },
        {
            "definition": "The klezmer band played lively music at the festival.",
            "pos": "noun",
            "sent1": "Everyone clapped and cheered as the klezmorim performed on stage.",
            "sent2": "The festival atmosphere was vibrant with the sounds of the klezmorim.",
            "sent3": "The klezmorim's music was so lively that even the birds started dancing.",
            "sent4": "The energy of the klezmorim's performance was contagious, spreading joy to all.",
            "sent5": "The festival organizers praised the klezmorim for their fantastic show."
        },
        {
            "definition": "The klezmorim entertained the guests with their energetic performance.",
            "pos": "noun",
            "sent1": "The klezmorim's music brought smiles to the faces of the audience.",
            "sent2": "The guests clapped along to the rhythm of the klezmorim's music.",
            "sent3": "The klezmorim's energetic performance even made the shyest guest dance.",
            "sent4": "The joy in the room grew as the klezmorim continued to play.",
            "sent5": "The guests couldn't resist tapping their feet to the klezmorim's lively tunes."
        }
    ]
}