{
    "term": "knelled",
    "meanings": [
        {
            "definition": "To ring a bell slowly and solemnly for a funeral or death.",
            "pos": "verb",
            "sent1": "The church bell knelled sadly as the funeral procession passed by.",
            "sent2": "The town knelled the bell to mark the passing of a beloved community member.",
            "sent3": "The bell knelled so loudly that even the birds stopped chirping.",
            "sent4": "The somber toll of the knelled bell echoed through the silent cemetery.",
            "sent5": "The haunting sound of the knelled bell lingered in the air, a melancholy reminder of loss."
        },
        {
            "definition": "To sound a mournful bell.",
            "pos": "verb",
            "sent1": "As the sun set, the distant church knelled, filling the evening with a mournful melody.",
            "sent2": "The old bell tower knelled every evening, its mournful tone drifting across the village.",
            "sent3": "The knelled bell seemed to sing a sorrowful song to the moon above.",
            "sent4": "The knelled bell's melancholic tune wrapped around the town like a heavy shroud.",
            "sent5": "The mournful knelled bell resonated through the valley, touching every heart with its sorrowful sound."
        },
        {
            "definition": "To toll a bell mournfully.",
            "pos": "verb",
            "sent1": "In the distance, a bell knelled mournfully, signaling the end of a day.",
            "sent2": "The ancient bell knelled mournfully, its sound carrying the weight of centuries.",
            "sent3": "The knelled bell's mournful toll seemed to harmonize with the weeping clouds above.",
            "sent4": "As the storm approached, the bell knelled mournfully, warning of the impending rain.",
            "sent5": "The mournful knelled bell's toll echoed through the valley, a solemn reminder of the passage of time."
        }
    ]
}