{
    "term": "knickerbocker",
    "meanings": [
        {
            "definition": "A New Yorker",
            "pos": "noun",
            "sent1": "The knickerbocker enjoyed a hot dog at the baseball game.",
            "sent2": "Many people dream of living in the bustling city like a knickerbocker.",
            "sent3": "Why did the knickerbocker bring a slice of pizza to the Statue of Liberty?",
            "sent4": "In the crowded subway, the knickerbocker stood out like a bright light.",
            "sent5": "The knickerbocker's accent was unmistakably New York."
        },
        {
            "definition": "A type of trousers gathered at the knee or calf",
            "pos": "noun",
            "sent1": "The young boy wore knickerbocker pants to the party.",
            "sent2": "In the old photograph, the men were dressed in knickerbockers.",
            "sent3": "The knickerbocker pants made him look like a character from a history book.",
            "sent4": "Her knickerbockers flapped in the wind as she rode her bike.",
            "sent5": "The golfer's knickerbockers added a touch of vintage charm to his outfit."
        },
        {
            "definition": "A type of apple",
            "pos": "noun",
            "sent1": "The knickerbocker apple tree bore delicious fruit every fall.",
            "sent2": "She baked a knickerbocker apple pie for the family dinner.",
            "sent3": "The knickerbocker apple was so juicy that it dripped down his chin.",
            "sent4": "The scent of the knickerbocker apple filled the kitchen with sweetness.",
            "sent5": "Eating a fresh knickerbocker apple was a delightful experience."
        },
        {
            "definition": "A type of beer",
            "pos": "noun",
            "sent1": "The brewery introduced a new knickerbocker beer to the market.",
            "sent2": "At the pub, friends enjoyed a cold glass of knickerbocker together.",
            "sent3": "The knickerbocker beer had a unique flavor that kept customers coming back.",
            "sent4": "The bartender recommended the knickerbocker beer to anyone who visited.",
            "sent5": "The frothy head of the knickerbocker beer looked inviting in the glass."
        }
    ]
}