{
    "term": "knockout",
    "meanings": [
        {
            "definition": "A blow that renders a person unconscious.",
            "pos": "noun",
            "sent1": "The boxer delivered a knockout punch to his opponent.",
            "sent2": "The knockout in the boxing match was unexpected.",
            "sent3": "The knockout punch made the boxer take an unplanned nap.",
            "sent4": "Her singing was a knockout, leaving the audience in awe.",
            "sent5": "The knockout blow left him lying on the mat, motionless."
        },
        {
            "definition": "A person or thing that is very attractive or impressive.",
            "pos": "noun",
            "sent1": "She looked like a knockout in her elegant dress.",
            "sent2": "The new sports car was a real knockout.",
            "sent3": "The dessert was a knockout, everyone wanted seconds.",
            "sent4": "His knockout smile charmed everyone at the party.",
            "sent5": "The sunset over the ocean was a knockout sight to behold."
        },
        {
            "definition": "To strike a person unconscious.",
            "pos": "verb",
            "sent1": "The boxer tried to knockout his opponent with a powerful punch.",
            "sent2": "He managed to knockout the intruder with a swift hit.",
            "sent3": "She joked that she could knockout anyone in a pillow fight.",
            "sent4": "The sudden realization seemed to knockout his senses.",
            "sent5": "The loud noise seemed to knockout his ability to focus."
        },
        {
            "definition": "To defeat an opponent decisively.",
            "pos": "verb",
            "sent1": "The team was determined to knockout their rivals in the final game.",
            "sent2": "The chess grandmaster managed to knockout all his opponents.",
            "sent3": "The debate champion could knockout any argument with ease.",
            "sent4": "Her brilliant strategy was enough to knockout the competition.",
            "sent5": "The new technology could knockout the old ways of doing things."
        }
    ]
}