{
    "term": "knockers",
    "meanings": [
        {
            "definition": "A person or thing that knocks.",
            "pos": "noun",
            "sent1": "The little boy was the best knockers in the game of hide and seek.",
            "sent2": "The knockers on the door were loud and clear, announcing the arrival of a visitor.",
            "sent3": "The knockers on the door seemed to have a mind of their own, tapping away at odd times.",
            "sent4": "Her knockers on the door echoed through the empty hallway, creating an eerie atmosphere.",
            "sent5": "The knockers on the door were so rusty that they squeaked with every tap."
        },
        {
            "definition": "A pair of metal rings or handles on a door that can be used for knocking.",
            "pos": "noun",
            "sent1": "The shiny knockers on the front door added a touch of elegance to the house.",
            "sent2": "She gripped the knockers firmly and rapped on the door to get the attention of the residents.",
            "sent3": "The knockers on the door gleamed in the sunlight, almost like they were winking at passersby.",
            "sent4": "The knockers on the door were like guardians, protecting the house from unwanted visitors.",
            "sent5": "With a gentle touch, she used the knockers on the door to announce her presence."
        },
        {
            "definition": "A woman's breasts.",
            "pos": "noun",
            "sent1": "She felt self-conscious about her knockers, always trying to hide them under loose clothing.",
            "sent2": "The magazine cover featured a model with perfectly shaped knockers, setting unrealistic beauty standards.",
            "sent3": "She joked with her friends about her knockers, making light of societal beauty norms.",
            "sent4": "In the mirror, she admired her knockers, appreciating their natural curves and uniqueness.",
            "sent5": "The dress accentuated her knockers, drawing attention to her feminine silhouette."
        }
    ]
}