{
    "term": "knocked",
    "meanings": [
        {
            "definition": "To strike a surface noisily to attract attention",
            "pos": "verb",
            "sent1": "She knocked on the door to let them know she had arrived.",
            "sent2": "He knocked on the window to get the cat's attention.",
            "sent3": "The squirrel knocked on the tree trunk, hoping for a response.",
            "sent4": "The rain knocked on the roof, creating a soothing rhythm.",
            "sent5": "The teacher knocked on the board to quiet the class."
        },
        {
            "definition": "To hit something with a quick, sharp blow",
            "pos": "verb",
            "sent1": "He knocked the ball out of the park with a powerful swing.",
            "sent2": "She knocked the vase off the table by accident.",
            "sent3": "The wind knocked the leaves off the tree in a playful dance.",
            "sent4": "The boxer knocked his opponent down with a single punch.",
            "sent5": "The hammer knocked the nail into the wood effortlessly."
        },
        {
            "definition": "To make a loud noise by hitting something",
            "pos": "verb",
            "sent1": "The thunder knocked loudly, startling the children.",
            "sent2": "The fireworks knocked in the distance, lighting up the sky.",
            "sent3": "The drum knocked rhythmically, setting the beat for the song.",
            "sent4": "The waves knocked against the shore, creating a calming sound.",
            "sent5": "The door knocked loudly in the silent house, echoing through the halls."
        },
        {
            "definition": "To criticize or find fault with someone or something",
            "pos": "verb",
            "sent1": "She knocked his idea without considering its potential.",
            "sent2": "He knocked her performance, not realizing the effort she put in.",
            "sent3": "The cat knocked the dog's attempt at stealth, revealing its location.",
            "sent4": "The review knocked the restaurant's service, but praised the food.",
            "sent5": "The judge knocked the lawyer's argument, pointing out its flaws."
        }
    ]
}