{
    "term": "knockabout",
    "meanings": [
        {
            "definition": "A knockabout is a small, sturdy boat used for fishing or pleasure.",
            "pos": "noun",
            "sent1": "We enjoyed a peaceful day on the knockabout, fishing in the calm waters.",
            "sent2": "The knockabout gently rocked on the waves as we cast our lines.",
            "sent3": "The knockabout bobbed up and down, making the fisherman's task a bit challenging.",
            "sent4": "The knockabout sailed smoothly through the water, a reliable vessel for any angler.",
            "sent5": "The knockabout's wooden deck creaked softly under our feet as we relaxed in the sun."
        },
        {
            "definition": "Knockabout can refer to a type of comedy characterized by physical humor and slapstick.",
            "pos": "noun",
            "sent1": "The knockabout at the circus had everyone laughing with their silly antics.",
            "sent2": "The knockabout's exaggerated movements and funny faces had the audience in stitches.",
            "sent3": "The knockabout performers tripped and stumbled, creating a hilarious scene.",
            "sent4": "The knockabout comedy duo juggled and tumbled with perfect timing and coordination.",
            "sent5": "The knockabout routine ended with a pie in the face, a classic gag loved by all."
        },
        {
            "definition": "Knockabout can also mean rough or casual in manner or style.",
            "pos": "adjective",
            "sent1": "His knockabout attire of jeans and a t-shirt suited the laid-back party perfectly.",
            "sent2": "The knockabout group of friends enjoyed a carefree day at the beach.",
            "sent3": "She adopted a knockabout attitude, shrugging off any worries or stress.",
            "sent4": "The knockabout appearance of the old barn gave it a charming, rustic feel.",
            "sent5": "The knockabout way he spoke, with slang and jokes, made everyone feel at ease."
        }
    ]
}