{
    "term": "knock",
    "meanings": [
        {
            "definition": "To strike a surface with a sharp blow",
            "pos": "verb",
            "sent1": "I knock on the door to let them know I am here.",
            "sent2": "She likes to knock on the table to get attention.",
            "sent3": "The cat tried to knock the vase off the shelf.",
            "sent4": "The wind seemed to knock against the window all night.",
            "sent5": "The woodpecker's beak can knock loudly on trees."
        },
        {
            "definition": "A sharp blow or sound made by striking",
            "pos": "noun",
            "sent1": "The knock on the door startled me.",
            "sent2": "I heard a loud knock coming from the wall.",
            "sent3": "The knock of the hammer echoed through the room.",
            "sent4": "The knock of the clock marked each passing hour.",
            "sent5": "The knock of the ball against the wall was rhythmic."
        },
        {
            "definition": "To criticize or find fault with",
            "pos": "verb",
            "sent1": "She would always knock his ideas without listening.",
            "sent2": "It's not nice to knock someone's efforts without reason.",
            "sent3": "He would knock every movie he watched, no matter what.",
            "sent4": "Don't knock her cooking skills until you try her food.",
            "sent5": "It's easy to knock others down, but harder to lift them up."
        },
        {
            "definition": "To seek entrance by striking on a door or surface",
            "pos": "verb",
            "sent1": "I knock on the door before entering a room.",
            "sent2": "He would knock on the window to get her attention.",
            "sent3": "The squirrel tried to knock on the bird feeder for food.",
            "sent4": "The waves knock gently on the shore, seeking entry.",
            "sent5": "The wind can knock on the walls of the house during a storm."
        }
    ]
}