{
    "term": "knops",
    "meanings": [
        {
            "definition": "A decorative knob or boss, especially on furniture or architecture.",
            "pos": "noun",
            "sent1": "The dresser was adorned with shiny knops that sparkled in the sunlight.",
            "sent2": "She gently turned the knops on the cabinet to open its hidden compartment.",
            "sent3": "The mischievous kitten mistook the knops on the table for toys and batted at them playfully.",
            "sent4": "The old castle's doors were studded with knops that seemed to guard its secrets.",
            "sent5": "The intricate design of the chandelier included delicate knops that added elegance to the room."
        },
        {
            "definition": "A rounded protuberance or ornament.",
            "pos": "noun",
            "sent1": "The tree was full of colorful knops that stood out against the green leaves.",
            "sent2": "The jeweler carefully placed a small knops on the necklace to enhance its beauty.",
            "sent3": "The children collected smooth knops from the beach to use in their art project.",
            "sent4": "The artist sculpted a statue with intricate knops that symbolized growth and prosperity.",
            "sent5": "The cake was decorated with edible knops that added a touch of whimsy to the dessert."
        },
        {
            "definition": "A knob or bud on a plant.",
            "pos": "noun",
            "sent1": "The rose bush had vibrant knops that were about to bloom into beautiful flowers.",
            "sent2": "She carefully pruned the knops on the tomato plant to encourage healthy growth.",
            "sent3": "The gardener excitedly noticed new knops forming on the orchid plant.",
            "sent4": "The sunflower's knops swayed gently in the breeze, promising a bright bloom soon.",
            "sent5": "The herbalist harvested the fragrant knops from the lavender plant for use in aromatherapy."
        }
    ]
}