{
    "term": "knot",
    "meanings": [
        {
            "definition": "A fastening made by tying a piece of string, rope, or something similar",
            "pos": "noun",
            "sent1": "She tied a knot in the rope to secure the boat.",
            "sent2": "The boy learned how to tie a knot in his shoelaces.",
            "sent3": "The mischievous squirrel tied a knot in the garden hose.",
            "sent4": "The bond between them was as strong as a sailor's knot.",
            "sent5": "The intricate knot held the package together tightly."
        },
        {
            "definition": "A tangled or twisted mass",
            "pos": "noun",
            "sent1": "The branches formed a knot in the middle of the path.",
            "sent2": "She tried to comb out the knot in her hair gently.",
            "sent3": "The yarn created a colorful knot on the floor.",
            "sent4": "The traffic jam was a knot of cars on the highway.",
            "sent5": "The puzzle pieces were a confusing knot of shapes."
        },
        {
            "definition": "A unit of speed equal to one nautical mile per hour",
            "pos": "noun",
            "sent1": "The boat was sailing at a speed of ten knots.",
            "sent2": "The captain announced that they were moving at five knots.",
            "sent3": "The race car zoomed past at an incredible knot.",
            "sent4": "The wind pushed the sailboat forward at a steady knot.",
            "sent5": "The jet flew through the sky at a breathtaking knot."
        },
        {
            "definition": "A small, hard lump in a piece of wood",
            "pos": "noun",
            "sent1": "He noticed a knot in the wooden table he was sanding.",
            "sent2": "The carpenter carefully avoided the knot in the plank.",
            "sent3": "The tree stump had a large, rough knot on its surface.",
            "sent4": "The old tree had a gnarled knot in its trunk.",
            "sent5": "The woodworker smoothed out the knot in the board."
        }
    ]
}