{
    "term": "knuckleballs",
    "meanings": [
        {
            "definition": "A pitch thrown in baseball that moves erratically due to the lack of spin.",
            "pos": "noun",
            "sent1": "The pitcher surprised everyone with his knuckleballs during the game.",
            "sent2": "The batter struggled to hit the knuckleballs thrown by the pitcher.",
            "sent3": "The knuckleballs danced in the air, confusing the batter completely.",
            "sent4": "The knuckleballs were like mischievous sprites playing tricks on the batters.",
            "sent5": "The knuckleballs fluttered like leaves in the wind, making it impossible to predict their path."
        },
        {
            "definition": "The act of throwing a knuckleball pitch.",
            "pos": "noun",
            "sent1": "His knuckleballs were the highlight of the game.",
            "sent2": "The coach praised his flawless knuckleballs during practice.",
            "sent3": "The player's knuckleballs were so precise, they seemed to have a mind of their own.",
            "sent4": "His knuckleballs cut through the air like sharp knives, leaving batters bewildered.",
            "sent5": "The sound of his knuckleballs whizzing past the batters was music to the team's ears."
        },
        {
            "definition": "A baseball pitch that is difficult to hit due to its unpredictable movement.",
            "pos": "noun",
            "sent1": "The batter swung and missed at the knuckleballs thrown by the pitcher.",
            "sent2": "The knuckleballs floated towards the plate, making it hard for the batter to connect.",
            "sent3": "The knuckleballs seemed to have a secret dance routine, evading the bat effortlessly.",
            "sent4": "The knuckleballs twisted and turned like a rollercoaster, leaving the batters dizzy.",
            "sent5": "The pitcher's knuckleballs were like elusive ghosts, haunting the batters' dreams."
        }
    ]
}