{
    "term": "ko",
    "meanings": [
        {
            "definition": "Knockout",
            "pos": "noun",
            "sent1": "The boxer delivered a powerful punch, resulting in a quick ko.",
            "sent2": "The audience cheered as the knockout was declared in the boxing match.",
            "sent3": "After the knockout, the boxer woke up feeling confused but victorious.",
            "sent4": "The knockout hit him like a ton of bricks, leaving him dazed and defeated.",
            "sent5": "The knockout was so sudden and brutal, it echoed through the arena."
        },
        {
            "definition": "Kilometer",
            "pos": "noun",
            "sent1": "She ran for a kilometer without stopping.",
            "sent2": "The sign indicated that the next town was only a kilometer away.",
            "sent3": "It took him a kilometer of walking to reach the store.",
            "sent4": "The kilometer seemed longer when he was tired and hungry.",
            "sent5": "The kilometer marker showed she was halfway through her run."
        },
        {
            "definition": "Commanding officer",
            "pos": "noun",
            "sent1": "The commanding officer gave orders to the troops.",
            "sent2": "The commanding officer led the soldiers into battle.",
            "sent3": "The commanding officer's hat always seemed too big for his head.",
            "sent4": "The commanding officer's presence on the field inspired confidence in the soldiers.",
            "sent5": "The commanding officer's voice boomed across the training ground."
        },
        {
            "definition": "Korean War",
            "pos": "noun",
            "sent1": "My grandfather fought in the Korean War.",
            "sent2": "The history book detailed the events of the Korean War.",
            "sent3": "The Korean War left a lasting impact on the country.",
            "sent4": "The Korean War veterans shared their stories of bravery and sacrifice.",
            "sent5": "The Korean War memorial stood as a reminder of the past conflicts."
        },
        {
            "definition": "Knockout (boxing)",
            "pos": "noun",
            "sent1": "The boxer aimed for a knockout with every punch.",
            "sent2": "The knockout in the final round secured his victory.",
            "sent3": "The knockout punch was so powerful, it ended the match instantly.",
            "sent4": "The knockout punch landed with precision, knocking his opponent out cold.",
            "sent5": "The crowd erupted in cheers as the knockout was announced."
        }
    ]
}