{
    "term": "koka",
    "meanings": [
        {
            "definition": "A type of plant native to South America, known for its leaves which are used to make cocaine.",
            "pos": "noun",
            "sent1": "The koka plant grows in warm climates.",
            "sent2": "People extract cocaine from the koka leaves.",
            "sent3": "The koka plant must be handled carefully due to its powerful properties.",
            "sent4": "The koka plant's leaves hold a secret power within.",
            "sent5": "The green koka leaves hide a potent substance inside."
        },
        {
            "definition": "To cook by boiling in water.",
            "pos": "verb",
            "sent1": "I will koka the vegetables for dinner.",
            "sent2": "She likes to koka pasta for a quick meal.",
            "sent3": "Let's koka some eggs for breakfast!",
            "sent4": "The chef will koka the soup until it's just right.",
            "sent5": "Koka the rice until it is soft and fluffy."
        },
        {
            "definition": "A type of Japanese noodle made from wheat flour.",
            "pos": "noun",
            "sent1": "I enjoy eating koka noodles with soy sauce.",
            "sent2": "Koka noodles are a popular choice in Japanese cuisine.",
            "sent3": "The koka noodles slurped loudly in the quiet restaurant.",
            "sent4": "The steam rising from the koka noodles was inviting.",
            "sent5": "The aroma of the koka noodles filled the kitchen."
        },
        {
            "definition": "A type of traditional Finnish bread.",
            "pos": "noun",
            "sent1": "The koka bread is a staple in Finnish households.",
            "sent2": "Grandma bakes delicious koka bread every Sunday.",
            "sent3": "The koka bread was so fresh that it melted in my mouth.",
            "sent4": "The warm koka bread reminded me of childhood memories.",
            "sent5": "The smell of koka bread baking in the oven is irresistible."
        }
    ]
}