{
    "term": "kormas",
    "meanings": [
        {
            "definition": "A type of Indian curry dish typically made with meat or vegetables in a spiced sauce.",
            "pos": "noun",
            "sent1": "For dinner, we enjoyed a delicious kormas with chicken and fragrant spices.",
            "sent2": "The restaurant's specialty is their flavorful kormas with tender lamb.",
            "sent3": "At the party, everyone raved about the kormas, asking for the recipe.",
            "sent4": "The aroma of the simmering kormas filled the kitchen, enticing everyone.",
            "sent5": "The kormas was so tasty that it left a lasting impression on our taste buds."
        },
        {
            "definition": "The act of preparing or cooking kormas.",
            "pos": "noun",
            "sent1": "She learned the art of kormas from her grandmother, who taught her the secret spices.",
            "sent2": "The kormas requires patience and skill to achieve the perfect balance of flavors.",
            "sent3": "His passion for kormas led him to experiment with new ingredients and techniques.",
            "sent4": "The kitchen was filled with the delightful aroma of kormas being cooked to perfection.",
            "sent5": "The process of making kormas became a cherished tradition in their family."
        },
        {
            "definition": "A person who specializes in making kormas.",
            "pos": "noun",
            "sent1": "The renowned kormas chef shared his signature recipe with the eager students.",
            "sent2": "She became a sought-after kormas expert known for her unique culinary creations.",
            "sent3": "The kormas master impressed everyone with his innovative twists on traditional recipes.",
            "sent4": "In the culinary world, he was recognized as a kormas connoisseur with exceptional skills.",
            "sent5": "The talented kormas specialist was invited to showcase his dishes at a prestigious food festival."
        }
    ]
}