{
    "term": "koro",
    "meanings": [
        {
            "definition": "A Maori ceremonial house",
            "pos": "noun",
            "sent1": "The koro was beautifully decorated with traditional Maori carvings.",
            "sent2": "We visited the koro to learn about Maori culture and traditions.",
            "sent3": "During the ceremony, the koro suddenly started dancing, much to everyone's surprise.",
            "sent4": "The koro stood tall and proud, symbolizing the unity of the Maori community.",
            "sent5": "The intricate carvings on the koro told stories of ancient legends and heroes."
        },
        {
            "definition": "A type of Japanese pottery",
            "pos": "noun",
            "sent1": "She carefully placed the delicate koro on the shelf, admiring its craftsmanship.",
            "sent2": "The koro was passed down through generations as a cherished family heirloom.",
            "sent3": "The koro rolled off the table and miraculously didn't break, much to everyone's relief.",
            "sent4": "The koro's glaze shimmered in the sunlight, reflecting a rainbow of colors.",
            "sent5": "The koro was used to hold incense during traditional Japanese ceremonies."
        },
        {
            "definition": "A type of mental disorder characterized by a fear of losing one's genitals",
            "pos": "noun",
            "sent1": "His irrational fear of the koro led him to avoid any situation where he might lose his genitals.",
            "sent2": "The therapist helped him overcome his koro by addressing his underlying anxieties.",
            "sent3": "In a strange twist of events, his pet cat developed a case of koro, fearing its tail would disappear.",
            "sent4": "The concept of koro in his mind was like a shadow that haunted his every thought.",
            "sent5": "The koro made him believe that his body was betraying him, causing immense distress."
        }
    ]
}