{
    "term": "kors",
    "meanings": [
        {
            "definition": "A unit of currency in Estonia.",
            "pos": "noun",
            "sent1": "In Estonia, you can buy many things with just one kors.",
            "sent2": "The price of the item was 5 kors.",
            "sent3": "I accidentally paid with a kors instead of a euro!",
            "sent4": "Her smile was worth more than a thousand kors.",
            "sent5": "The shiny kors sparkled in the sunlight."
        },
        {
            "definition": "A unit of weight in Turkey.",
            "pos": "noun",
            "sent1": "The recipe called for two kors of flour.",
            "sent2": "The scale showed the meat weighed 3 kors.",
            "sent3": "I tried to lift the heavy bag of potatoes, but it felt like a ton of kors!",
            "sent4": "His burden was as heavy as a kors on his shoulders.",
            "sent5": "The kors on the scale tipped in favor of the customer."
        },
        {
            "definition": "A type of seaweed.",
            "pos": "noun",
            "sent1": "The beach was covered in colorful kors.",
            "sent2": "The fish loved to hide among the kors in the ocean.",
            "sent3": "I pretended to have a seaweed mustache using the kors.",
            "sent4": "The kors swayed gently with the current, like a dance in the sea.",
            "sent5": "The salty air was filled with the scent of fresh kors."
        },
        {
            "definition": "A surname.",
            "pos": "noun",
            "sent1": "Mr. and Mrs. Kors arrived at the party.",
            "sent2": "The Kors family reunion was a joyous occasion.",
            "sent3": "I thought Kors was a famous fashion designer, but it turns out it's just a surname!",
            "sent4": "The name Kors echoed through the halls of the old mansion.",
            "sent5": "Kors was written in elegant script on the family crest."
        }
    ]
}