{
    "term": "kraft",
    "meanings": [
        {
            "definition": "Strength or power",
            "pos": "noun",
            "sent1": "Her kraft in lifting heavy boxes impressed everyone at the gym.",
            "sent2": "The superhero's kraft allowed him to lift cars effortlessly.",
            "sent3": "The tiny ant showed incredible kraft by carrying a large crumb on its back.",
            "sent4": "His kraft of persuasion was so strong that he could convince anyone to do anything.",
            "sent5": "The kraft of the waterfall as it crashed down the rocks was truly awe-inspiring."
        },
        {
            "definition": "A type of strong, brown paper used for packaging",
            "pos": "noun",
            "sent1": "She wrapped the fragile vase in kraft to protect it during shipping.",
            "sent2": "The company used kraft to wrap the gifts for their customers.",
            "sent3": "The cat played with the kraft paper, turning it into a fun toy.",
            "sent4": "The kraft paper crinkled as she wrapped the present, adding a rustic touch.",
            "sent5": "The kraft packaging kept the delicate items safe during transit."
        },
        {
            "definition": "A brand name for a type of processed cheese",
            "pos": "noun",
            "sent1": "She made a delicious sandwich with kraft slices of cheese.",
            "sent2": "The children enjoyed their grilled cheese sandwiches made with kraft.",
            "sent3": "The mouse snuck into the kitchen to nibble on the kraft cheese left out.",
            "sent4": "The kraft cheese melted perfectly on top of the hot burger patty.",
            "sent5": "The creamy kraft cheese added a rich flavor to the macaroni."
        },
        {
            "definition": "A brand name for a type of macaroni and cheese product",
            "pos": "noun",
            "sent1": "For a quick meal, she prepared a bowl of kraft macaroni and cheese.",
            "sent2": "The kids loved the cheesy goodness of kraft macaroni and cheese.",
            "sent3": "He surprised his roommate with a warm bowl of kraft mac and cheese.",
            "sent4": "The comforting aroma of kraft macaroni and cheese filled the kitchen.",
            "sent5": "The creamy kraft mac and cheese was the perfect comfort food on a rainy day."
        }
    ]
}