{
    "term": "krans",
    "meanings": [
        {
            "definition": "A steep cliff or rock face.",
            "pos": "noun",
            "sent1": "The hikers carefully climbed the krans to reach the top of the mountain.",
            "sent2": "The birds nested on the krans, enjoying the view of the valley below.",
            "sent3": "The adventurous squirrel decided to bungee jump off the krans for fun.",
            "sent4": "The krans stood tall like a giant wall, separating the two valleys.",
            "sent5": "The setting sun cast a golden glow on the krans, creating a breathtaking sight."
        },
        {
            "definition": "A type of South African plant with colorful flowers.",
            "pos": "noun",
            "sent1": "The garden was filled with vibrant krans, attracting butterflies and bees.",
            "sent2": "The krans swayed gently in the breeze, displaying its beautiful blooms.",
            "sent3": "The mischievous rabbits played hide-and-seek among the krans, blending in with the petals.",
            "sent4": "Her laughter echoed through the field as she danced around the krans, a burst of color in the green landscape.",
            "sent5": "The sweet fragrance of the krans filled the air, signaling the arrival of spring."
        },
        {
            "definition": "A type of traditional South African bread.",
            "pos": "noun",
            "sent1": "The aroma of freshly baked krans filled the kitchen, making everyone's mouth water.",
            "sent2": "The family gathered around the table, eager to taste the warm krans with butter.",
            "sent3": "The mischievous dog stole a piece of krans from the table when no one was looking.",
            "sent4": "The krans was passed down through generations, a symbol of unity and tradition.",
            "sent5": "The golden crust of the krans crackled as it was broken apart, revealing the soft interior."
        }
    ]
}