{
    "term": "kreuzer",
    "meanings": [
        {
            "definition": "A former Austrian coin",
            "pos": "noun",
            "sent1": "In the past, people in Austria used the kreuzer to buy things.",
            "sent2": "The kreuzer was a coin that was commonly used in Austria long ago.",
            "sent3": "Why did the old kreuzer refuse to roll down the hill? It didn't want to change hands!",
            "sent4": "The memories of the kreuzer jingled in his pocket, reminding him of simpler times.",
            "sent5": "The shiny kreuzer sparkled in the sunlight, a piece of history in his hand."
        },
        {
            "definition": "A small silver coin used in Germany",
            "pos": "noun",
            "sent1": "The small kreuzer was easy to lose because of its size.",
            "sent2": "People in Germany would often use the kreuzer for small purchases.",
            "sent3": "Why did the kreuzer go to school? To get some change for recess!",
            "sent4": "The kreuzer gleamed like a tiny moon in the palm of his hand.",
            "sent5": "She collected kreuzers in a jar, each one a tiny piece of history."
        },
        {
            "definition": "A monetary unit of the Czech Republic",
            "pos": "noun",
            "sent1": "In the Czech Republic, the kreuzer is an important part of their currency.",
            "sent2": "How many kreuzers do you need to buy a loaf of bread in the Czech Republic?",
            "sent3": "The kreuzer walked into the bank, hoping to make some change.",
            "sent4": "His dreams were made of kreuzers, each one a step closer to his goal.",
            "sent5": "The kreuzer clinked against the others in his pocket, a symphony of wealth."
        },
        {
            "definition": "A type of currency in various European countries",
            "pos": "noun",
            "sent1": "The kreuzer was used as currency in different European countries.",
            "sent2": "Travelers needed to exchange their money for kreuzers before their trip.",
            "sent3": "Why did the kreuzer break up with the dollar? It wanted a change in scenery!",
            "sent4": "The kreuzer was a bridge between nations, passing from hand to hand.",
            "sent5": "He held the kreuzer tightly, a piece of Europe in the palm of his hand."
        }
    ]
}