{
    "term": "kuru",
    "meanings": [
        {
            "definition": "A fatal neurodegenerative disease found in certain tribes of Papua New Guinea.",
            "pos": "noun",
            "sent1": "The villagers were scared of kuru spreading through their community.",
            "sent2": "Doctors studied the symptoms of kuru to understand its effects.",
            "sent3": "The monkeys in the jungle joked about catching kuru from each other.",
            "sent4": "The darkness of kuru enveloped the minds of those affected.",
            "sent5": "The word 'kuru' echoed through the village, a dreaded whisper of doom.",
            "sent6": "In the remote village, kuru was a constant fear among the people."
        },
        {
            "definition": "A type of prion disease.",
            "pos": "noun",
            "sent1": "Scientists researched the origins of kuru to learn more about prion diseases.",
            "sent2": "The doctor diagnosed the patient with a rare case of kuru.",
            "sent3": "The children at school giggled, calling the strange illness 'kuru-buru'.",
            "sent4": "The kuru of misinformation spread faster than any virus.",
            "sent5": "The lab was filled with samples of kuru, a puzzle waiting to be solved.",
            "sent6": "The textbook explained the characteristics of kuru in simple terms."
        },
        {
            "definition": "A contagious disease affecting the brain.",
            "pos": "noun",
            "sent1": "The outbreak of kuru caused panic in the village.",
            "sent2": "The doctors worked tirelessly to contain the spread of kuru.",
            "sent3": "The rumor mill in town exaggerated stories of kuru jumping from person to person.",
            "sent4": "The fear of kuru lurked in every shadow, unseen but felt.",
            "sent5": "The effects of kuru on the brain were devastating, leaving no room for hope.",
            "sent6": "The news warned about the dangers of kuru, urging caution among the population."
        }
    ]
}