{
    "term": "kwaito",
    "meanings": [
        {
            "definition": "A style of music originating in South Africa, characterized by a mixture of house music, hip hop, and traditional African sounds.",
            "pos": "noun",
            "sent1": "The radio played kwaito all night long, filling the air with lively beats.",
            "sent2": "People in the neighborhood love to dance to kwaito music during parties.",
            "sent3": "At the family gathering, Grandma surprised everyone by busting out some kwaito dance moves.",
            "sent4": "The kwaito music flowed through the streets like a river of rhythm.",
            "sent5": "The kwaito concert was so energetic that it felt like the music was alive."
        },
        {
            "definition": "A person who performs or produces kwaito music.",
            "pos": "noun",
            "sent1": "The kwaito artist released a new album that topped the charts.",
            "sent2": "Fans eagerly awaited the arrival of their favorite kwaito singer for a live performance.",
            "sent3": "The kwaito musician's quirky fashion sense always made headlines.",
            "sent4": "She was known as the queen of kwaito, ruling the music scene with her powerful voice.",
            "sent5": "The kwaito producer worked tirelessly in the studio to create catchy tunes."
        },
        {
            "definition": "To dance or move in a manner associated with kwaito music.",
            "pos": "verb",
            "sent1": "The crowd started to kwaito as soon as the DJ played the familiar beat.",
            "sent2": "She kwaitoed gracefully, matching the rhythm with her every step.",
            "sent3": "The kids decided to kwaito their way through the school talent show.",
            "sent4": "His feet seemed to kwaito effortlessly, as if they had a mind of their own.",
            "sent5": "The dance floor was alive with people kwaitoing to the infectious music."
        }
    ]
}