{
    "term": "ky",
    "meanings": [
        {
            "definition": "A unit of weight equal to 1000 pounds.",
            "pos": "noun",
            "sent1": "The farmer loaded the truck with a heavy ky of potatoes.",
            "sent2": "The shipping company charged extra for packages over one ky.",
            "sent3": "The gym owner joked that lifting a ky of feathers would be easy.",
            "sent4": "Her love for books weighed as much as a ky of gold.",
            "sent5": "The ky of bricks pressed down on the scale, showing its immense weight."
        },
        {
            "definition": "A unit of weight equal to 2.20462 pounds.",
            "pos": "noun",
            "sent1": "The grocery store sold a ky of apples at a discounted price.",
            "sent2": "She measured the flour for the recipe using a ky scale.",
            "sent3": "Carrying a ky of sugar felt like lifting a mountain for the child.",
            "sent4": "His words had the weight of a ky, impacting everyone who heard them.",
            "sent5": "The ky of rice was just enough to feed the entire family for a week."
        },
        {
            "definition": "A unit of weight equal to 32,000 grains.",
            "pos": "noun",
            "sent1": "The jeweler carefully measured a ky of gold dust for the necklace.",
            "sent2": "The ancient measurement system used a ky as a standard unit.",
            "sent3": "The chef sprinkled a ky of salt into the boiling water.",
            "sent4": "Her patience was as fine as a ky of sand, never running out.",
            "sent5": "The ky of sugar grains sparkled like tiny diamonds in the sunlight."
        },
        {
            "definition": "A unit of weight equal to 1/2 of a koku.",
            "pos": "noun",
            "sent1": "The merchant traded a ky of rice for a ky of silk.",
            "sent2": "In the old days, a ky of wheat was considered a valuable commodity.",
            "sent3": "The baker used a ky of flour to bake a giant cake for the festival.",
            "sent4": "His kindness was a ky of treasure, rare and precious.",
            "sent5": "The ky of spices filled the air with a rich, aromatic scent."
        }
    ]
}