{
    "term": "kyanise",
    "meanings": [
        {
            "definition": "To color or dye with a shade of blue.",
            "pos": "verb",
            "sent1": "She decided to kyanise her old dress to give it a fresh look.",
            "sent2": "The artist used a special technique to kyanise the canvas and create a beautiful painting.",
            "sent3": "The fashion designer accidentally kyanised her white shirt, turning it into a unique shade of blue.",
            "sent4": "The sky seemed to kyanise as the sun set, painting the horizon with hues of blue and orange.",
            "sent5": "The dye kyanised the fabric so perfectly that it looked like a piece of the sky had been captured in the dress."
        },
        {
            "definition": "To treat with a solution of potassium cyanide.",
            "pos": "verb",
            "sent1": "The forensic scientist had to kyanise the evidence to extract crucial information.",
            "sent2": "In some cases, criminals have been known to kyanise objects to erase any traces of their involvement.",
            "sent3": "The detective jokingly suggested they should kyanise the suspect's coffee to get a confession.",
            "sent4": "The idea of using potassium cyanide to kyanise the metal seemed like a dangerous but effective solution.",
            "sent5": "The jeweler carefully kyanised the gold to achieve the perfect shine, following the traditional method passed down for generations."
        },
        {
            "definition": "To become blue or cyan in color.",
            "pos": "verb",
            "sent1": "The clear water started to kyanise as the sun's reflection danced on its surface.",
            "sent2": "Over time, the metal will naturally kyanise due to exposure to the elements.",
            "sent3": "The once green leaves began to kyanise in the autumn breeze, signaling the change of season.",
            "sent4": "Her eyes seemed to kyanise with emotion as she listened to the heartfelt story.",
            "sent5": "The flower petals slowly started to kyanise, transforming from pink to a delicate shade of blue under the moonlight."
        }
    ]
}