{
    "term": "kyar",
    "meanings": [
        {
            "definition": "A unit of weight equal to 2,000 pounds.",
            "pos": "noun",
            "sent1": "The farmer loaded a kyar of hay onto the truck.",
            "sent2": "The shipping company charged extra for transporting a kyar of goods.",
            "sent3": "The elephant tried to lift a kyar of bananas, but they were too heavy!",
            "sent4": "Her love for him weighed as much as a kyar of stones.",
            "sent5": "The kyar of bricks towered over the construction site."
        },
        {
            "definition": "A unit of weight equal to 1,000 pounds.",
            "pos": "noun",
            "sent1": "The market sold a kyar of rice at a discounted price.",
            "sent2": "The truck struggled to carry a kyar of logs down the bumpy road.",
            "sent3": "The kyar of feathers floated gently in the breeze.",
            "sent4": "His guilt felt like a kyar of lead on his shoulders.",
            "sent5": "The kyar of books filled the shelves to the brim."
        },
        {
            "definition": "A unit of weight equal to 100 pounds.",
            "pos": "noun",
            "sent1": "The fisherman caught a kyar of fish in one net.",
            "sent2": "The gym trainer lifted a kyar of weights effortlessly.",
            "sent3": "The kyar of apples rolled down the hill, causing chaos.",
            "sent4": "Her laughter was as light as a kyar of feathers.",
            "sent5": "The kyar of flour spilled all over the kitchen floor."
        },
        {
            "definition": "A unit of weight equal to 50 pounds.",
            "pos": "noun",
            "sent1": "The delivery person carried a kyar of packages to the door.",
            "sent2": "The horse struggled under the weight of a kyar of oats.",
            "sent3": "The kyar of balloons lifted the child off the ground for a moment.",
            "sent4": "His words hit her heart like a kyar of bricks.",
            "sent5": "The kyar of vegetables filled the basket to overflowing."
        }
    ]
}