{
    "term": "kything",
    "meanings": [
        {
            "definition": "To communicate with someone mentally or spiritually, especially when apart.",
            "pos": "verb",
            "sent1": "I felt like I was kything with my best friend even though she was miles away.",
            "sent2": "She enjoys kything with her ancestors during meditation sessions.",
            "sent3": "The psychic claimed she could kything with aliens from outer space.",
            "sent4": "As the sun set, the old man felt as if he was kything with the universe itself.",
            "sent5": "The bond between the twins was so strong that they could kything without speaking a word."
        },
        {
            "definition": "The act of telepathic communication between individuals.",
            "pos": "noun",
            "sent1": "Telepathy is often described as a form of kything between minds.",
            "sent2": "The twins had a special kything that allowed them to understand each other without words.",
            "sent3": "The scientist's experiment on kything between animals and humans was quite intriguing.",
            "sent4": "In the world of fantasy novels, kything is a common ability among magical creatures.",
            "sent5": "The psychic claimed to have a natural talent for kything with spirits from the other side."
        },
        {
            "definition": "A form of spiritual connection or communion.",
            "pos": "noun",
            "sent1": "The monks practiced kything with nature to feel closer to the divine.",
            "sent2": "During the ceremony, the shaman experienced a deep kything with the spirits of the forest.",
            "sent3": "The children giggled as they pretended to be kything with the friendly ghosts in the attic.",
            "sent4": "The artist's painting captured the essence of kything between humans and the cosmos.",
            "sent5": "In times of solitude, she found solace in the kything she felt with her inner self."
        }
    ]
}