{
    "term": "labelable",
    "meanings": [
        {
            "definition": "Capable of being labeled.",
            "pos": "adjective",
            "sent1": "The blank CDs were labelable, so we could easily organize our music collection.",
            "sent2": "The new storage boxes were labelable, making it simple to identify what was inside.",
            "sent3": "I found a labelable marker and decided to tag all my notebooks with funny quotes.",
            "sent4": "Her memory was like a labelable file cabinet, neatly storing every detail of her past.",
            "sent5": "The labelable stickers were so bright and colorful, they made everything look more cheerful."
        },
        {
            "definition": "Able to have a label attached.",
            "pos": "adjective",
            "sent1": "The toy bins were labelable, allowing us to easily categorize the different playthings.",
            "sent2": "The folders were labelable, so we could mark them with different colors for each subject.",
            "sent3": "I discovered a labelable tape dispenser and went on a labeling spree around the office.",
            "sent4": "His personality was like a labelable map, showing clear directions to his true self.",
            "sent5": "The labelable tags were so sticky, they stayed attached no matter what."
        },
        {
            "definition": "Suitable for labeling.",
            "pos": "adjective",
            "sent1": "The smooth surface of the jars was labelable, making it easy to stick on the price tags.",
            "sent2": "The boxes were labelable, allowing us to mark them with important information.",
            "sent3": "I bought a labelable printer and started labeling everything in sight, much to my cat's confusion.",
            "sent4": "Her heart was like a labelable canvas, ready to be filled with love and memories.",
            "sent5": "The labelable stickers were so versatile, they could be used for any labeling need."
        }
    ]
}