{
    "term": "labour",
    "meanings": [
        {
            "definition": "Work, especially hard physical work",
            "pos": "noun",
            "sent1": "Farming requires a lot of labour in the fields.",
            "sent2": "Construction workers put in long hours of labour every day.",
            "sent3": "The ants showed impressive teamwork in their labour to build the anthill.",
            "sent4": "Her dedication to her craft was evident in the meticulous labour she put into each piece.",
            "sent5": "The miners' faces were covered in sweat and dirt after a hard day's labour underground."
        },
        {
            "definition": "The process of childbirth",
            "pos": "noun",
            "sent1": "The expectant mother was in labour for several hours before giving birth.",
            "sent2": "The midwife assisted the woman during her labour in the delivery room.",
            "sent3": "The comedy movie had a scene where the man comically panicked during his wife's labour.",
            "sent4": "The miracle of life unfolds during the intense labour of childbirth.",
            "sent5": "The hospital staff was well-prepared to handle any complications during labour."
        },
        {
            "definition": "To work hard",
            "pos": "verb",
            "sent1": "She had to labour all night to finish the project on time.",
            "sent2": "The students laboured over their homework assignments until late in the evening.",
            "sent3": "Despite the rain, the team continued to labour on the construction site.",
            "sent4": "The artist laboured over every brushstroke to perfect the painting.",
            "sent5": "He laboured tirelessly to provide for his family and achieve his dreams."
        },
        {
            "definition": "To give birth to a child",
            "pos": "verb",
            "sent1": "The mother laboured for hours before finally delivering a healthy baby.",
            "sent2": "The doctor assisted the woman as she laboured to bring her child into the world.",
            "sent3": "The mare laboured in the stable, preparing to give birth to a foal.",
            "sent4": "The queen laboured to ensure the safe arrival of the future heir to the throne.",
            "sent5": "The mother's strength shone through as she laboured through the pains of childbirth."
        }
    ]
}