{
    "term": "labouring",
    "meanings": [
        {
            "definition": "Working hard physically or mentally",
            "pos": "adjective",
            "sent1": "The labouring student stayed up late to finish the project.",
            "sent2": "She admired her father's labouring efforts to provide for the family.",
            "sent3": "The squirrel made a labouring attempt to reach the acorn on the high branch.",
            "sent4": "The old car made a labouring climb up the steep hill.",
            "sent5": "The labouring ant tirelessly carried food back to its nest."
        },
        {
            "definition": "Engaged in manual or industrial work",
            "pos": "adjective",
            "sent1": "The labouring workers toiled under the hot sun all day.",
            "sent2": "The factory was filled with the sound of labouring machinery.",
            "sent3": "The chef's labouring hands swiftly prepared the delicious meal.",
            "sent4": "The labouring bees buzzed around the blooming flowers.",
            "sent5": "The labouring farmer harvested the ripe crops in the field."
        },
        {
            "definition": "Showing signs of effort or strain",
            "pos": "adjective",
            "sent1": "Her labouring breaths indicated she had been running for a while.",
            "sent2": "The labouring hiker struggled to climb the steep mountain trail.",
            "sent3": "The cat made a labouring attempt to catch the elusive mouse.",
            "sent4": "The labouring engine sputtered before finally starting.",
            "sent5": "His labouring voice revealed his exhaustion after the long speech."
        },
        {
            "definition": "Moving or progressing with difficulty",
            "pos": "adjective",
            "sent1": "The labouring ship battled against the strong waves in the storm.",
            "sent2": "The labouring turtle slowly made its way across the sandy beach.",
            "sent3": "The labouring snail inched its way along the garden path.",
            "sent4": "The labouring caterpillar struggled to climb the tall plant.",
            "sent5": "The labouring train chugged along the tracks, delayed by the snow."
        }
    ]
}