{
    "term": "labyrinthian",
    "meanings": [
        {
            "definition": "Complicated and confusing, like a labyrinth.",
            "pos": "adjective",
            "sent1": "The labyrinthian puzzle was too difficult for the young children to solve.",
            "sent2": "The city streets were so labyrinthian that even the locals sometimes got lost.",
            "sent3": "Trying to untangle the labyrinthian mess of wires behind the TV was a comical challenge.",
            "sent4": "Her thoughts were a labyrinthian maze, making it hard for her to focus on one thing.",
            "sent5": "The labyrinthian path through the forest was filled with twists and turns, making it an adventure to navigate."
        },
        {
            "definition": "Resembling or characteristic of a labyrinth.",
            "pos": "adjective",
            "sent1": "The old mansion had a labyrinthian layout with hidden rooms and secret passages.",
            "sent2": "The garden was labyrinthian, with hedges forming intricate patterns that confused visitors.",
            "sent3": "The labyrinthian design of the cake made it look like a delicious maze.",
            "sent4": "His mind was a labyrinthian network of thoughts, each leading to a different idea.",
            "sent5": "The labyrinthian patterns on the ancient vase told a story of lost civilizations and forgotten myths."
        },
        {
            "definition": "Involving or resembling a maze.",
            "pos": "adjective",
            "sent1": "The labyrinthian cornfield was a challenge for anyone trying to find their way out.",
            "sent2": "The underground tunnels were labyrinthian, making it easy to get lost in the darkness.",
            "sent3": "The labyrinthian mirror maze at the carnival was a fun and dizzying experience.",
            "sent4": "Navigating the labyrinthian hallways of the old castle felt like a journey through time.",
            "sent5": "The labyrinthian path of the river twisted and turned through the valley, creating a scenic route for hikers."
        }
    ]
}