{
    "term": "laccoliths",
    "meanings": [
        {
            "definition": "A mass of igneous rock intruded between sedimentary strata.",
            "pos": "noun",
            "sent1": "The laccoliths formed when molten rock pushed up between layers of rock.",
            "sent2": "Geologists study laccoliths to understand how different rock layers interact.",
            "sent3": "The laccoliths decided to squeeze in between the sedimentary rocks for a cozy nap.",
            "sent4": "The laccoliths rose like mighty mountains amidst the flat sedimentary plains.",
            "sent5": "The laccoliths, like pancakes stacked on top of each other, created a unique geological feature."
        },
        {
            "definition": "A dome-shaped body of igneous rock between layers of sedimentary rock.",
            "pos": "noun",
            "sent1": "We hiked to the top of the laccoliths and enjoyed the view of the surrounding landscape.",
            "sent2": "The laccoliths in the valley were a striking contrast to the flat sedimentary rocks around them.",
            "sent3": "The laccoliths felt like giant bubbles trapped beneath the earth's surface.",
            "sent4": "The laccoliths loomed over the horizon, casting shadows on the sedimentary layers below.",
            "sent5": "The laccoliths resembled smooth domes rising from the ground, like nature's own sculptures."
        },
        {
            "definition": "A type of volcanic intrusion.",
            "pos": "noun",
            "sent1": "The eruption created a new laccoliths in the volcanic region.",
            "sent2": "Scientists monitored the formation of laccoliths to better understand volcanic activity.",
            "sent3": "The laccoliths bubbled up from beneath the earth's surface like a surprise party.",
            "sent4": "The laccoliths erupted with force, reshaping the landscape around them.",
            "sent5": "The laccoliths glowed red-hot, a fiery reminder of the earth's powerful forces."
        }
    ]
}