{
    "term": "laced",
    "meanings": [
        {
            "definition": "Fastened or tied with a lace or laces.",
            "pos": "adjective",
            "sent1": "Her laced shoes were perfect for the party.",
            "sent2": "The dress had laced details that added elegance.",
            "sent3": "He felt like a prince in his laced-up boots.",
            "sent4": "The sky was laced with streaks of pink at sunset.",
            "sent5": "The aroma of freshly laced flowers filled the room."
        },
        {
            "definition": "Intoxicated by alcohol or drugs.",
            "pos": "adjective",
            "sent1": "She stumbled around, clearly laced from the strong drink.",
            "sent2": "The partygoers were rowdy and laced with excitement.",
            "sent3": "The cat looked laced after eating too much catnip.",
            "sent4": "The music seemed laced with magic, making everyone dance.",
            "sent5": "His words were laced with slurred speech, indicating his state."
        },
        {
            "definition": "Adorned or trimmed with lace.",
            "pos": "adjective",
            "sent1": "The laced curtains added a touch of elegance to the room.",
            "sent2": "Her wedding gown was beautifully laced with intricate patterns.",
            "sent3": "The cake was laced with delicate lace designs made of icing.",
            "sent4": "The table was laced with a lace tablecloth for the special dinner.",
            "sent5": "The room was laced with lace doilies on every surface."
        },
        {
            "definition": "Infused or mixed with a substance.",
            "pos": "adjective",
            "sent1": "The soup was laced with a hint of exotic spices.",
            "sent2": "The drink was laced with a strong dose of caffeine.",
            "sent3": "The air was laced with the scent of freshly baked bread.",
            "sent4": "The conversation was laced with tension after the argument.",
            "sent5": "The atmosphere was laced with anticipation before the big reveal."
        }
    ]
}