{
    "term": "lahal",
    "meanings": [
        {
            "definition": "A traditional Native American game involving a hoop and stick.",
            "pos": "noun",
            "sent1": "During the festival, the children played a game of lahal with great joy.",
            "sent2": "The elders taught the young ones how to play lahal in the old-fashioned way.",
            "sent3": "The sound of laughter filled the air as they played lahal in the meadow.",
            "sent4": "In the ancient times, lahal was seen as a test of skill and agility.",
            "sent5": "The rhythmic clatter of the stick against the hoop echoed through the village during the lahal game."
        },
        {
            "definition": "A type of ceremonial dance performed by the Nez Perce tribe.",
            "pos": "noun",
            "sent1": "The Nez Perce tribe gathered around the fire to perform the sacred lahal dance.",
            "sent2": "The rhythmic movements of the dancers during the lahal were mesmerizing.",
            "sent3": "The lahal dance told the story of the tribe's history and traditions.",
            "sent4": "The spirits of their ancestors were said to join the dancers during the lahal ceremony.",
            "sent5": "The entire village came together to witness the powerful energy of the lahal dance."
        },
        {
            "definition": "A type of song or chant used in Native American ceremonies.",
            "pos": "noun",
            "sent1": "The haunting melody of the lahal echoed through the forest during the ceremony.",
            "sent2": "The elders sang the ancient lahal to honor the spirits of the land.",
            "sent3": "The children giggled as they tried to mimic the sounds of the lahal chant.",
            "sent4": "The rhythmic beat of the drums accompanied the sacred lahal song.",
            "sent5": "The sound of the lahal chant carried the prayers of the tribe to the heavens."
        }
    ]
}