{
    "term": "laid",
    "meanings": [
        {
            "definition": "past tense of lay",
            "pos": "verb",
            "sent1": "Yesterday, I laid the book on the table.",
            "sent2": "She laid the blanket over the sleeping child.",
            "sent3": "The hen laid her eggs in the cozy nest.",
            "sent4": "The foundation of trust was laid between them.",
            "sent5": "He carefully laid out the tools before starting the project."
        },
        {
            "definition": "set down",
            "pos": "verb",
            "sent1": "The teacher laid the chalk on the blackboard.",
            "sent2": "He laid the groceries on the kitchen counter.",
            "sent3": "She laid the cards on the table for the game.",
            "sent4": "The sun laid its warm rays on the garden.",
            "sent5": "The cat laid the mouse gently on the floor."
        },
        {
            "definition": "placed in a particular position",
            "pos": "adjective",
            "sent1": "The laid table was ready for dinner.",
            "sent2": "The laid bricks formed a sturdy wall.",
            "sent3": "The laid out plan was executed perfectly.",
            "sent4": "The laid foundation ensured a stable structure.",
            "sent5": "The laid path led through the peaceful garden."
        },
        {
            "definition": "past participle of lay",
            "pos": "adjective",
            "sent1": "The laid carpet added warmth to the room.",
            "sent2": "The laid tiles created a beautiful mosaic.",
            "sent3": "The laid out puzzle was challenging to complete.",
            "sent4": "The laid groundwork made the project easier.",
            "sent5": "The laid foundation supported the entire building."
        },
        {
            "definition": "having eggs deposited or fertilized",
            "pos": "adjective",
            "sent1": "The laid nest was full of eggs.",
            "sent2": "The laid hen was protective of her nest.",
            "sent3": "The laid eggs were carefully incubated.",
            "sent4": "The laid chicks hatched in the warm nest.",
            "sent5": "The laid nest was a sign of new life on the farm."
        }
    ]
}