{
    "term": "lame",
    "meanings": [
        {
            "definition": "(adjective) unable to walk normally due to injury or disability",
            "pos": "adjective",
            "sent1": "The injured dog had a lame leg and couldn't run like the others.",
            "sent2": "She felt lame after spraining her ankle and had to use crutches.",
            "sent3": "It was lame but funny to see the cat try to walk with a tiny shoe on its paw.",
            "sent4": "The old car's engine sputtered and coughed, making it as lame as a wounded bird.",
            "sent5": "The image of the limping horse was so vivid, it stayed in my mind all day."
        },
        {
            "definition": "(verb) to make someone or something unable to move normally",
            "pos": "verb",
            "sent1": "He tried to lame the horse by tying its legs together, but it broke free.",
            "sent2": "The slippery floor could lame anyone who isn't careful while walking.",
            "sent3": "She jokingly threatened to lame her brother's toy robot by removing its batteries.",
            "sent4": "The heavy snowfall lamed the branches of the tree, making them bend under the weight.",
            "sent5": "The magician cast a spell to lame the villain's movements during the duel."
        },
        {
            "definition": "(noun) a person who is unable to walk normally due to injury or disability",
            "pos": "noun",
            "sent1": "The rescue team helped the lame reach safety during the flood.",
            "sent2": "The charity organization provided support for the lames in the community.",
            "sent3": "The group of friends affectionately called themselves 'The Lames' because they all had injuries.",
            "sent4": "In the story, the hero was saved by a wise old lame who guided him through the forest.",
            "sent5": "The school organized a fundraiser to assist the lames in getting mobility aids."
        }
    ]
}