{
    "term": "lamina",
    "meanings": [
        {
            "definition": "A thin layer or plate",
            "pos": "noun",
            "sent1": "The scientist studied the lamina under the microscope.",
            "sent2": "She carefully peeled off a lamina of paint from the wall.",
            "sent3": "The lamina decided to take a nap on the shelf.",
            "sent4": "Her thoughts were like a delicate lamina, easily shattered.",
            "sent5": "The lamina shimmered in the sunlight, reflecting its thinness."
        },
        {
            "definition": "A thin, flat scale or layer, such as a leaf or bone",
            "pos": "noun",
            "sent1": "The fish's lamina glistened in the water as it swam.",
            "sent2": "He found a lamina of ice covering the pond in the morning.",
            "sent3": "The lamina on the tree waved in the breeze like a tiny flag.",
            "sent4": "Her patience was as thin as a lamina, easily broken.",
            "sent5": "The lamina of dust on the bookshelf showed it hadn't been cleaned in a while."
        },
        {
            "definition": "A thin sheet of metal or plastic",
            "pos": "noun",
            "sent1": "The artist carefully cut a lamina of gold for the jewelry.",
            "sent2": "He wrapped the fragile item in a protective lamina of plastic.",
            "sent3": "The lamina of foil danced in the wind like a shiny ribbon.",
            "sent4": "Her smile was as bright as a lamina of silver in the moonlight.",
            "sent5": "The lamina of metal reflected the city lights, creating a beautiful pattern."
        },
        {
            "definition": "The blade of a leaf or petal",
            "pos": "noun",
            "sent1": "The lamina of the rose petal was delicate and soft.",
            "sent2": "She admired the intricate patterns on the lamina of the leaf.",
            "sent3": "The lamina of the flower petal tickled her nose when she smelled it.",
            "sent4": "His words cut through her like a sharp lamina of a leaf.",
            "sent5": "The lamina of the leaf curled gracefully as it dried in the sun."
        }
    ]
}