{
    "term": "lancewood",
    "meanings": [
        {
            "definition": "A tree of the genus Oxandra, native to the West Indies and Central America, with hard, durable wood.",
            "pos": "noun",
            "sent1": "The lancewood stood tall in the forest, its sturdy trunk reaching towards the sky.",
            "sent2": "The furniture maker selected lancewood for its strength and resilience.",
            "sent3": "When the mischievous squirrel tried to climb the lancewood, it quickly realized the tree was too tough to grip.",
            "sent4": "Her determination was like a lancewood, unyielding in the face of challenges.",
            "sent5": "The lancewood's wood was so tough, it seemed almost indestructible."
        },
        {
            "definition": "The wood of the lancewood tree, used for making tool handles and other items.",
            "pos": "noun",
            "sent1": "Craftsmen carved the handle of the hammer from lancewood for its durability.",
            "sent2": "The artisan polished the lancewood to a smooth finish before crafting it into a walking stick.",
            "sent3": "The mischievous cat batted at the small piece of lancewood, mistaking it for a toy.",
            "sent4": "Her words were as sharp and precise as a lancewood blade.",
            "sent5": "The scent of freshly cut lancewood filled the workshop, a reminder of the tree's strength."
        },
        {
            "definition": "A spear or lance made from the wood of the lancewood tree.",
            "pos": "noun",
            "sent1": "The warrior wielded a lancewood spear, ready for battle.",
            "sent2": "Hunters in the tribe crafted their hunting tools from lancewood for its sharpness.",
            "sent3": "The children played pretend, using sticks of lancewood as swords in their imaginary duel.",
            "sent4": "His words were like a lancewood spear, piercing through the silence of the room.",
            "sent5": "The glint of the lancewood lance caught the sunlight, a deadly beauty in the warrior's hand."
        }
    ]
}