{
    "term": "landaulet",
    "meanings": [
        {
            "definition": "A type of car with a folding roof over the rear seats.",
            "pos": "noun",
            "sent1": "The royal family arrived in a luxurious landaulet for the parade.",
            "sent2": "The chauffeur drove the landaulet with elegance through the city streets.",
            "sent3": "The landaulet's roof decided to take a break and refused to fold back up!",
            "sent4": "The landaulet's roof, like a giant hand, sheltered the passengers from the rain.",
            "sent5": "The landaulet's roof unfolded like a magical canopy, revealing the sky above."
        },
        {
            "definition": "A vehicle with a convertible top over the rear passenger area.",
            "pos": "noun",
            "sent1": "The landaulet's top smoothly retracted, allowing the sun to shine in.",
            "sent2": "The landaulet's convertible top provided a refreshing breeze for the passengers.",
            "sent3": "The mischievous squirrel decided to ride on the landaulet's convertible top for a joyride.",
            "sent4": "The convertible top of the landaulet danced in the wind like a flag of freedom.",
            "sent5": "The convertible top of the landaulet transformed the vehicle into a cozy open-air retreat."
        },
        {
            "definition": "A car with a retractable roof for the back seats.",
            "pos": "noun",
            "sent1": "The landaulet's retractable roof smoothly slid back, revealing the starry night sky.",
            "sent2": "The family enjoyed a picnic in the park, shielded by the landaulet's retractable roof.",
            "sent3": "The mischievous cat decided to climb onto the landaulet's retractable roof for a nap.",
            "sent4": "The retractable roof of the landaulet acted like a protective shield against the elements.",
            "sent5": "The retractable roof of the landaulet created a cozy nook for stargazing on summer nights."
        }
    ]
}