{
    "term": "landau",
    "meanings": [
        {
            "definition": "A horse-drawn carriage with a folding hood.",
            "pos": "noun",
            "sent1": "The landau trotted down the cobblestone street, its hood protecting the passengers from the rain.",
            "sent2": "The royal family arrived at the palace in a luxurious landau, waving to the cheering crowd.",
            "sent3": "The landau driver accidentally left the hood open, and a curious bird decided to take a ride.",
            "sent4": "The landau stood out among the modern cars, like a piece of history rolling through the bustling city.",
            "sent5": "The landau's hood creaked as it was unfolded, revealing the elegant interior within."
        },
        {
            "definition": "A type of automobile body with a folding hood over the rear seats.",
            "pos": "noun",
            "sent1": "The vintage car collector proudly displayed his rare landau at the exhibition.",
            "sent2": "The landau's hood smoothly folded back, allowing the passengers to enjoy the open air.",
            "sent3": "The landau's hood got stuck halfway, creating a comical sight for onlookers.",
            "sent4": "The landau's design was reminiscent of a time when elegance and style were paramount in automobiles.",
            "sent5": "The landau's hood added a touch of sophistication to the classic car's appearance."
        },
        {
            "definition": "A light four-wheeled carriage with a folding top, seating for two inside and a seat on the outside for the driver.",
            "pos": "noun",
            "sent1": "The couple took a romantic ride in the landau, enjoying the scenic countryside views.",
            "sent2": "The landau's folding top provided shade as the driver guided the carriage through the park.",
            "sent3": "The landau's seat for the driver was so high that it felt like riding on a throne.",
            "sent4": "The landau's folding top transformed the carriage into a cozy retreat from the sun.",
            "sent5": "The landau's design allowed for a leisurely ride, with the driver perched high above the passengers."
        }
    ]
}