{
    "term": "lanes",
    "meanings": [
        {
            "definition": "A narrow road or way between walls, hedges, fences, or houses.",
            "pos": "noun",
            "sent1": "The lanes in the old town were so narrow that only one car could pass through at a time.",
            "sent2": "The bike path followed the lanes between the tall hedges, providing a scenic route for cyclists.",
            "sent3": "Trying to drive a large truck through those tiny lanes would be like fitting a whale through a keyhole.",
            "sent4": "Her thoughts traveled down the lanes of memory, each one leading to a different moment in her past.",
            "sent5": "The lanes were like threads weaving through the fabric of the neighborhood, connecting one house to another."
        },
        {
            "definition": "A strip of land along which a narrow road or path runs.",
            "pos": "noun",
            "sent1": "The lanes of grass on either side of the road added a touch of green to the landscape.",
            "sent2": "The hiking trail followed the lanes of the river, offering a peaceful walk in nature.",
            "sent3": "The cat loved to walk along the lanes of the garden, pretending to be on a grand adventure.",
            "sent4": "The lanes of sunlight peeking through the trees created a magical path in the forest.",
            "sent5": "The lanes of sand on the beach led to the water, inviting people to take a refreshing swim."
        },
        {
            "definition": "A division of a road marked off with painted lines for the use of a single line of vehicles.",
            "pos": "noun",
            "sent1": "The lanes on the highway helped organize the flow of traffic, preventing chaos.",
            "sent2": "Drivers should always stay in their designated lanes to ensure safety on the road.",
            "sent3": "The lanes on the racetrack were like colorful ribbons guiding the cars to the finish line.",
            "sent4": "In the game of life, we each have our own lanes to follow, leading us to different destinations.",
            "sent5": "The lanes of the road were like pathways for cars, each one leading to a different destination."
        }
    ]
}