{
    "term": "languor",
    "meanings": [
        {
            "definition": "the state or feeling, often pleasant, of tiredness or inertia",
            "pos": "noun",
            "sent1": "After a long day of playing outside, the children felt a sense of languor as they sat down to rest.",
            "sent2": "The cat stretched out in the sun, basking in the languor of a lazy afternoon.",
            "sent3": "The sloth's languor was so extreme that even the snail passed it by with a chuckle.",
            "sent4": "The town seemed to be enveloped in a languor, as if time itself had slowed down to a crawl.",
            "sent5": "The languor of the summer heat weighed heavily on the small village, making even the birds drowsy."
        },
        {
            "definition": "a lack of energy or vitality",
            "pos": "noun",
            "sent1": "The illness left him with a deep sense of languor, unable to muster the strength to get out of bed.",
            "sent2": "The old battery showed signs of languor, struggling to power the flashlight.",
            "sent3": "The marathon runner's sudden languor surprised everyone, as he had been leading the race.",
            "sent4": "The dark clouds seemed to bring a languor over the usually bustling city, draining it of its usual vigor.",
            "sent5": "The languor in the room was palpable, as if the very air was heavy with exhaustion."
        },
        {
            "definition": "a feeling of calmness or relaxation",
            "pos": "noun",
            "sent1": "As she floated in the warm pool, a sense of languor washed over her, melting away all stress.",
            "sent2": "The gentle music filled the room with a soothing languor, lulling everyone into a peaceful state.",
            "sent3": "The cat's languor was contagious, spreading to all who watched its serene demeanor.",
            "sent4": "The sunset painted the sky with hues of languor, casting a tranquil spell over the landscape.",
            "sent5": "The spa's scented candles created an atmosphere of languor, inviting guests to unwind and relax."
        }
    ]
}