{
    "term": "languishing",
    "meanings": [
        {
            "definition": "To be or become weak or feeble",
            "pos": "verb",
            "sent1": "After being sick for a week, he was languishing in bed, unable to get up.",
            "sent2": "The flower was languishing in the heat without enough water to thrive.",
            "sent3": "The old car languishing in the garage looked like it needed a good tune-up.",
            "sent4": "Her dreams of becoming a professional dancer were languishing as she struggled with a knee injury.",
            "sent5": "The abandoned puppy was languishing in the shelter, waiting for someone to adopt him."
        },
        {
            "definition": "To suffer from being forced to remain in an unpleasant place or situation",
            "pos": "verb",
            "sent1": "The prisoners were languishing in their cells, longing for freedom.",
            "sent2": "She felt like she was languishing in a boring job with no opportunities for growth.",
            "sent3": "The cat languishing in the empty box seemed to be enjoying its makeshift bed.",
            "sent4": "The students were languishing in the hot classroom, waiting for the broken AC to be fixed.",
            "sent5": "The explorers found themselves languishing in the dense jungle, surrounded by unknown dangers."
        },
        {
            "definition": "To be neglected or ignored",
            "pos": "verb",
            "sent1": "The old books were languishing on the dusty shelves, forgotten by everyone.",
            "sent2": "The garden was languishing without proper care, with weeds taking over.",
            "sent3": "The toy left languishing in the corner was eventually discovered by a curious child.",
            "sent4": "Her talents were languishing in obscurity until she was given a chance to showcase them.",
            "sent5": "The historic building was languishing in disrepair until a group of volunteers decided to restore it."
        }
    ]
}