{
    "term": "languishments",
    "meanings": [
        {
            "definition": "The state or feeling of being weak or lacking vitality.",
            "pos": "noun",
            "sent1": "Her languishments after the flu made her stay in bed all day.",
            "sent2": "The patient's languishments were evident in her pale complexion and tired eyes.",
            "sent3": "Despite his languishments, he tried to muster the energy to go for a short walk.",
            "sent4": "The plant's languishments were like a wilting flower in the scorching sun.",
            "sent5": "The kitten's languishments for attention were adorable as it followed its owner around the house."
        },
        {
            "definition": "A longing or desire for something unattainable.",
            "pos": "noun",
            "sent1": "His languishments for the stars were endless as he gazed up at the night sky.",
            "sent2": "She felt a deep sense of languishments for the childhood friend she had lost touch with.",
            "sent3": "His languishments for a pet dragon were amusing to his friends who knew it was impossible.",
            "sent4": "Her languishments for the past were like chasing a ghost that could never be caught.",
            "sent5": "The character's languishments for true love were portrayed beautifully in the novel."
        },
        {
            "definition": "The act of languishing or becoming weak.",
            "pos": "noun",
            "sent1": "The plant's languishments were due to lack of sunlight and water.",
            "sent2": "The prisoner's languishments in the dark cell were unbearable.",
            "sent3": "The car's languishments after years of neglect were finally addressed with a tune-up.",
            "sent4": "The city's languishments in the face of economic downturn were concerning to its residents.",
            "sent5": "The athlete's languishments in performance were noticeable after an injury."
        }
    ]
}