{
    "term": "langlaufs",
    "meanings": [
        {
            "definition": "Langlaufs (noun): a type of ski with a long, narrow design for cross-country skiing.",
            "pos": "noun",
            "sent1": "During the winter, many people enjoy gliding on langlaufs through snowy forests.",
            "sent2": "She rented a pair of langlaufs to explore the scenic trails in the mountains.",
            "sent3": "The langlaufs leaned against the cabin, looking like sleek arrows ready to fly.",
            "sent4": "His langlaufs cut through the fresh powder like a sharp knife through butter.",
            "sent5": "The langlaufs whispered softly as they slid effortlessly over the snow-covered terrain."
        },
        {
            "definition": "Langlaufs (verb): to ski using langlaufs.",
            "pos": "verb",
            "sent1": "They decided to langlaufs along the winding path to enjoy the winter scenery.",
            "sent2": "I learned how to langlaufs last year and now I can't get enough of it.",
            "sent3": "She langlaufs gracefully, her movements fluid and controlled.",
            "sent4": "The skier langlaufed with such speed that it seemed like she was flying over the snow.",
            "sent5": "As the sun set, they continued to langlaufs under the pink and orange sky."
        },
        {
            "definition": "Langlaufs (adjective): relating to or characteristic of langlaufs.",
            "pos": "adjective",
            "sent1": "The langlaufs equipment was neatly arranged by the door, ready for their adventure.",
            "sent2": "The langlaufs trails were marked with colorful flags for the upcoming race.",
            "sent3": "He had a langlaufs hat that kept his head warm during the cold ski trip.",
            "sent4": "Her langlaufs gloves were bright red, standing out against the white snow.",
            "sent5": "The langlaufs lodge was cozy, with a fire crackling in the stone fireplace."
        }
    ]
}