{
    "term": "lanterns",
    "meanings": [
        {
            "definition": "A portable or stationary source of light, often enclosed in a protective case with transparent sides.",
            "pos": "noun",
            "sent1": "During the camping trip, we carried lanterns to light up the dark forest.",
            "sent2": "The lanterns glowed softly, casting a warm light around the room.",
            "sent3": "As the lanterns flickered, the shadows danced playfully on the walls.",
            "sent4": "Her smile lit up the room like a lantern in the night.",
            "sent5": "The lanterns swayed gently in the evening breeze, creating a magical atmosphere."
        },
        {
            "definition": "A structure with open or enclosed sides used to house a light source for illumination.",
            "pos": "noun",
            "sent1": "The garden had beautiful lanterns hanging from the trees, lighting up the pathway.",
            "sent2": "The old lighthouse had large lanterns that guided ships safely to shore.",
            "sent3": "The lanterns in the park seemed to gossip with each other as people passed by.",
            "sent4": "His eyes were like lanterns, shining brightly with excitement.",
            "sent5": "The lanterns on the porch created a cozy ambiance for the evening gathering."
        },
        {
            "definition": "A decorative or functional light fixture typically used outdoors.",
            "pos": "noun",
            "sent1": "The lanterns lining the garden path added a touch of elegance to the outdoor space.",
            "sent2": "During the summer nights, the lanterns illuminated the backyard for late gatherings.",
            "sent3": "The mischievous raccoon knocked over the lanterns, causing a comical chaos.",
            "sent4": "Her laughter echoed through the night, brightening the darkness like lanterns.",
            "sent5": "The flickering lanterns created a mesmerizing pattern of light and shadow on the patio."
        }
    ]
}