{
    "term": "laparoscopic",
    "meanings": [
        {
            "definition": "of or relating to a laparoscope",
            "pos": "adjective",
            "sent1": "The doctor used a laparoscopic tool to perform the surgery.",
            "sent2": "The laparoscopic examination helped the medical team see inside the patient's body.",
            "sent3": "The laparoscopic device felt like a tiny camera exploring the inside of the patient.",
            "sent4": "Her mind was a laparoscopic lens, zooming in on the smallest details of the problem.",
            "sent5": "The laparoscopic view revealed the hidden secrets of the body with precision."
        },
        {
            "definition": "a surgical procedure using a laparoscope",
            "pos": "noun",
            "sent1": "During the laparoscopic, the surgeon inserted the tiny camera into the patient's abdomen.",
            "sent2": "The laparoscopic went smoothly, and the patient recovered quickly.",
            "sent3": "The laparoscopic was like a mini adventure for the medical team, exploring the patient's insides.",
            "sent4": "In the world of surgery, the laparoscopic was a revolutionary tool, changing the way operations were done.",
            "sent5": "The laparoscopic revealed a whole new world inside the patient, guiding the surgeon's hands with precision."
        },
        {
            "definition": "a type of minimally invasive surgery involving a laparoscope",
            "pos": "noun",
            "sent1": "The laparoscopic was preferred by many patients due to its less invasive nature.",
            "sent2": "The doctor recommended the laparoscopic for its quick recovery time.",
            "sent3": "The laparoscopic surgery felt like a high-tech solution to the medical problem.",
            "sent4": "Her smile was as bright as the light from the laparoscopic during the surgery.",
            "sent5": "The laparoscopic procedure left a small scar but a big impact on the patient's health."
        }
    ]
}