{
    "term": "lapidary",
    "meanings": [
        {
            "definition": "A person who cuts, polishes, or engraves precious stones.",
            "pos": "noun",
            "sent1": "The skilled lapidary carefully shaped the diamond into a beautiful necklace.",
            "sent2": "The lapidary at the jewelry store is known for creating stunning gemstone rings.",
            "sent3": "The lapidary joked that they had so many gems to cut, they felt like a human jewelry-making machine.",
            "sent4": "Her precision in cutting the gem was so sharp, it was as if she were a lapidary sculptor.",
            "sent5": "The lapidary's hands moved with such grace and expertise, turning rough stones into works of art."
        },
        {
            "definition": "Of or relating to the cutting, polishing, or engraving of precious stones.",
            "pos": "adjective",
            "sent1": "The lapidary tools gleamed under the bright lights of the workshop.",
            "sent2": "The lapidary techniques used by the artisan enhanced the beauty of the gemstone.",
            "sent3": "The lapidary workshop had a magical aura, filled with sparkling gem dust.",
            "sent4": "Her eyes sparkled with a lapidary precision as she examined the flawless diamond.",
            "sent5": "The lapidary artistry transformed the dull rock into a dazzling gemstone."
        },
        {
            "definition": "A place where precious stones are cut, polished, or engraved.",
            "pos": "noun",
            "sent1": "The family visited the lapidary to watch the gem cutting process.",
            "sent2": "The lapidary was filled with the sound of grinding wheels and polishing cloths.",
            "sent3": "The lapidary shop was a treasure trove of colorful gemstones waiting to be shaped.",
            "sent4": "The lapidary sparkled in the sunlight, inviting visitors to explore its wonders.",
            "sent5": "The lapidary's walls echoed with the hum of machines transforming rough stones into treasures."
        }
    ]
}