{
    "term": "lapidarian",
    "meanings": [
        {
            "definition": "Of or relating to stone carving.",
            "pos": "adjective",
            "sent1": "The lapidarian artist skillfully chiseled intricate designs into the marble.",
            "sent2": "The museum displayed various lapidarian sculptures created by talented artisans.",
            "sent3": "The lapidarian craftsman accidentally dropped his hammer on his foot while working on a statue.",
            "sent4": "Her lapidarian precision in shaping the granite resulted in a masterpiece admired by all.",
            "sent5": "The lapidarian techniques passed down through generations ensured the preservation of ancient stone monuments."
        },
        {
            "definition": "A person who carves stones.",
            "pos": "noun",
            "sent1": "The skilled lapidarian carefully sculpted the marble into a beautiful statue.",
            "sent2": "The lapidarian's workshop was filled with tools for shaping various types of stones.",
            "sent3": "The young lapidarian apprentice eagerly learned the art of stone carving from the master sculptor.",
            "sent4": "The lapidarian's hands were rough and calloused from years of working with hard stones.",
            "sent5": "Visitors marveled at the talent of the lapidarian as he transformed a rough block of granite into a detailed sculpture."
        },
        {
            "definition": "A tool used for stone carving.",
            "pos": "noun",
            "sent1": "The lapidarian carefully selected the chisel to begin shaping the marble block.",
            "sent2": "The lapidarian's toolbox contained a variety of specialized tools for different stone carving techniques.",
            "sent3": "The lapidarian's favorite tool, a sharp pick, was passed down from his grandfather.",
            "sent4": "The lapidarian's hammer echoed through the workshop as he worked on the intricate details of the sculpture.",
            "sent5": "The lapidarian's chisel, worn from years of use, still held the magic of transforming stone into art."
        }
    ]
}