{
    "term": "lashing",
    "meanings": [
        {
            "definition": "A violent beating or striking, especially with a whip or stick.",
            "pos": "noun",
            "sent1": "The pirate received a harsh lashing for disobeying the captain.",
            "sent2": "The horse winced at the lashing of the rider's whip.",
            "sent3": "During the play, the character comically exaggerated the lashing scene, causing laughter in the audience.",
            "sent4": "The storm unleashed a lashing of rain upon the town, flooding the streets.",
            "sent5": "The memory of the lashing haunted him, making him flinch at the sound of a whip cracking."
        },
        {
            "definition": "A length of cord or rope used for binding or securing objects.",
            "pos": "noun",
            "sent1": "He tied the boxes together with a sturdy lashing to prevent them from falling.",
            "sent2": "The sailor expertly secured the sail with a tight lashing.",
            "sent3": "The children pretended the lashing was a magical rope that could grant wishes.",
            "sent4": "The lashing held the raft together, ensuring they stayed afloat in the rough waters.",
            "sent5": "She practiced her knot-tying skills by making intricate lashings with different ropes."
        },
        {
            "definition": "A sudden outburst of anger or emotion.",
            "pos": "noun",
            "sent1": "His lashing of frustration surprised everyone in the room.",
            "sent2": "She couldn't control her lashing of tears when she heard the sad news.",
            "sent3": "The toddler's lashing of tantrum over not getting a toy was both amusing and exhausting for the parents.",
            "sent4": "The lashing of excitement among the fans grew as the team scored the winning goal.",
            "sent5": "The lashing of fear gripped her heart as she watched the horror movie alone in the dark."
        }
    ]
}