{
    "term": "lathered",
    "meanings": [
        {
            "definition": "Covered in soap foam",
            "pos": "adjective",
            "sent1": "After playing in the bubbles, the kids were lathered in soap foam.",
            "sent2": "The dog shook off the water, leaving itself lathered in soap foam.",
            "sent3": "The clown slipped on a banana peel and ended up lathered in soap foam from head to toe.",
            "sent4": "The car wash was so intense that the vehicles emerged lathered in soap foam like fluffy clouds.",
            "sent5": "The chef's apron was accidentally lathered in soap foam, making it look like a snowy mountain."
        },
        {
            "definition": "To become covered in soap foam",
            "pos": "verb",
            "sent1": "As the water splashed, the puppy lathered up in soap foam.",
            "sent2": "She giggled as she lathered herself in soap foam during the bubble bath.",
            "sent3": "The mischievous cat managed to lather the entire room in soap foam while playing with the soap dispenser.",
            "sent4": "The car wash machine lathered the vehicle in soap foam, making it sparkle like a diamond.",
            "sent5": "The children squealed with delight as they lathered each other in soap foam during the water fight."
        },
        {
            "definition": "To whip or beat vigorously",
            "pos": "verb",
            "sent1": "The baker lathered the cream vigorously to create a fluffy topping for the cake.",
            "sent2": "He lathered the eggs and sugar together until they were light and fluffy.",
            "sent3": "The drummer lathered the drums with such intensity that the audience was left in awe.",
            "sent4": "The storm lathered the trees with rain, making them sway vigorously in the wind.",
            "sent5": "She lathered the mixture with precision, ensuring the perfect consistency for the recipe."
        }
    ]
}