{
    "term": "leached",
    "meanings": [
        {
            "definition": "To remove substances from soil or other material by the action of water percolating through it.",
            "pos": "verb",
            "sent1": "After the rain, the water leached the nutrients from the soil.",
            "sent2": "The heavy rain leached the minerals from the rocks over time.",
            "sent3": "The mischievous squirrel tried to leach all the flavor from the tea by dipping its acorn in it.",
            "sent4": "Her kindness leached into every corner of the community, spreading warmth and joy.",
            "sent5": "The relentless waves leached the color from the old beach house, leaving it a pale gray."
        },
        {
            "definition": "To dissolve out soluble constituents from (ashes, soil, etc.) by percolation.",
            "pos": "verb",
            "sent1": "The rain leached the ashes, leaving behind a dark stain on the ground.",
            "sent2": "Over time, the acidic water leached the minerals from the soil, making it infertile.",
            "sent3": "The chef accidentally leached all the flavor from the soup, making it taste like plain water.",
            "sent4": "His words leached the confidence from her, leaving her feeling insecure.",
            "sent5": "The toxic chemicals leached into the river, causing harm to the aquatic life."
        },
        {
            "definition": "To remove or extract a substance from a substance by washing with a solvent.",
            "pos": "verb",
            "sent1": "She used a special detergent to leach the stubborn stains from the fabric.",
            "sent2": "The process of leaching salt from seawater requires advanced technology.",
            "sent3": "The magician tried to leach the color from the scarf, but it remained vibrant.",
            "sent4": "His charisma seemed to leach all the attention from the room, making him the center of focus.",
            "sent5": "The artist used a technique to leach the dye from the fabric, creating a beautiful pattern."
        }
    ]
}