{
    "term": "leaching",
    "meanings": [
        {
            "definition": "To remove soluble or harmful substances from a material by the action of a liquid.",
            "pos": "verb",
            "sent1": "After heavy rain, the water started leaching the nutrients from the soil.",
            "sent2": "The factory's waste was leaching into the nearby river, causing pollution.",
            "sent3": "The mischievous cat seemed to enjoy leaching the color from my favorite shirt.",
            "sent4": "Her words had a way of leaching the joy out of any celebration.",
            "sent5": "The leaky roof was slowly leaching the warmth from the cozy room."
        },
        {
            "definition": "The process of extracting substances from a material by the action of a liquid.",
            "pos": "noun",
            "sent1": "The leaching of minerals from the rocks created colorful patterns on the surface.",
            "sent2": "The leaching of chemicals from the plastic container altered the taste of the drink.",
            "sent3": "The magician's trick involved the mysterious leaching of ink from a playing card.",
            "sent4": "The artist used a unique technique of leaching to create a stunning watercolor painting.",
            "sent5": "The gradual leaching of flavors from the tea leaves made the brew more aromatic."
        },
        {
            "definition": "The act of draining away from soil or rock.",
            "pos": "noun",
            "sent1": "The heavy rain caused leaching of nutrients from the garden soil.",
            "sent2": "The constant leaching of minerals from the rocks formed intricate patterns.",
            "sent3": "The leaching of colors from the painting gave it a surreal appearance.",
            "sent4": "The emotional leaching from the sad movie left the audience in tears.",
            "sent5": "The slow leaching of water from the dam weakened its structure over time."
        }
    ]
}