{
    "term": "leading",
    "meanings": [
        {
            "definition": "Showing the way",
            "pos": "adjective",
            "sent1": "The leading car had bright headlights to show the way.",
            "sent2": "The tour guide was leading the group through the forest.",
            "sent3": "The leading duck in the pond was wearing a tiny captain's hat.",
            "sent4": "Her smile was like a leading beacon in the dark room.",
            "sent5": "The leading star in the sky guided the lost travelers."
        },
        {
            "definition": "In the first position",
            "pos": "adverb",
            "sent1": "He crossed the finish line leading in the race.",
            "sent2": "The team started leading and maintained their position throughout the game.",
            "sent3": "The cat sprinted leading through the obstacle course.",
            "sent4": "The river flowed leading down the mountain, carving its path.",
            "sent5": "The melody began leading in the musical composition."
        },
        {
            "definition": "Guiding or directing",
            "pos": "adjective",
            "sent1": "The leading lighthouse helped ships navigate safely.",
            "sent2": "The leading teacher directed the students in the science experiment.",
            "sent3": "The leading squirrel in the park was giving directions to other animals.",
            "sent4": "Her leading hand gestures guided the dancers on stage.",
            "sent5": "The leading signpost pointed travelers in the right direction."
        },
        {
            "definition": "Most important or influential",
            "pos": "adjective",
            "sent1": "The leading scientist made groundbreaking discoveries.",
            "sent2": "The leading actor stole the show with their performance.",
            "sent3": "The leading cake at the party was the most delicious.",
            "sent4": "Her leading opinion swayed the group's decision.",
            "sent5": "The leading character in the story had the most impact."
        },
        {
            "definition": "Ahead of others in a race or competition",
            "pos": "adjective",
            "sent1": "The leading runner crossed the finish line first.",
            "sent2": "The leading team scored the winning goal in the match.",
            "sent3": "The leading horse in the race wore a tiny crown on its head.",
            "sent4": "Her leading speed on the track left her competitors behind.",
            "sent5": "The leading cyclist pedaled furiously towards the finish line."
        }
    ]
}