{
    "term": "lead",
    "meanings": [
        {
            "definition": "To guide or direct",
            "pos": "verb",
            "sent1": "I will lead the tour group through the museum.",
            "sent2": "She will lead the team to victory with her skills.",
            "sent3": "The duckling tried to lead the other animals, thinking it was the boss.",
            "sent4": "Her bright smile will lead you to the right path.",
            "sent5": "The lighthouse's beam of light will lead ships safely to shore."
        },
        {
            "definition": "A heavy metal",
            "pos": "noun",
            "sent1": "The toy soldier was made of lead.",
            "sent2": "The roof was damaged by the weight of the lead.",
            "sent3": "The lead sinker made the fishing line sink quickly.",
            "sent4": "His heart felt heavy as if made of lead.",
            "sent5": "The artist used lead to create a sculpture of a lion."
        },
        {
            "definition": "The first position in a competition",
            "pos": "noun",
            "sent1": "She took the lead in the race right from the start.",
            "sent2": "The team fought hard to maintain their lead in the game.",
            "sent3": "The lead runner was so fast, it seemed like he had wings.",
            "sent4": "His lead in the competition was unbreakable.",
            "sent5": "The lead singer of the band captivated the audience with her voice."
        },
        {
            "definition": "A thin strip of metal used in stained glass",
            "pos": "noun",
            "sent1": "The stained glass window was adorned with lead strips.",
            "sent2": "She carefully soldered the lead to hold the glass pieces together.",
            "sent3": "The lead strip added a beautiful outline to the artwork.",
            "sent4": "The intricate design required precise placement of the lead strips.",
            "sent5": "The lead lining gave the stained glass a classic look."
        },
        {
            "definition": "To be in charge or command",
            "pos": "verb",
            "sent1": "He will lead the project team to success.",
            "sent2": "The captain will lead the crew through the storm.",
            "sent3": "The teacher will lead the class in a fun science experiment.",
            "sent4": "Her confidence will lead the team to victory.",
            "sent5": "The general will lead the troops into battle."
        }
    ]
}