{
    "term": "lean",
    "meanings": [
        {
            "definition": "To incline or bend from a vertical position",
            "pos": "verb",
            "sent1": "She had to lean against the wall to catch her breath.",
            "sent2": "The tower started to lean slightly after the earthquake.",
            "sent3": "The tree seemed to lean over as if trying to listen to the conversation below.",
            "sent4": "His decision to lean towards a career in music surprised everyone.",
            "sent5": "The old house leaned towards the river, its foundation worn away by time."
        },
        {
            "definition": "To rely or depend on",
            "pos": "verb",
            "sent1": "I lean on my friends for support during tough times.",
            "sent2": "She knew she could always lean on her sister for help.",
            "sent3": "The team had to lean heavily on their captain for guidance.",
            "sent4": "In times of need, we often lean on our faith for strength.",
            "sent5": "He had to lean on his experience to make the right decision."
        },
        {
            "definition": "Lacking in richness, fullness, or strength",
            "pos": "adjective",
            "sent1": "The soup had a lean flavor, needing more seasoning.",
            "sent2": "The budget was lean this year, so we had to cut back on expenses.",
            "sent3": "The story felt a bit lean without enough details to engage the reader.",
            "sent4": "The lean harvest meant there would be less food for the winter.",
            "sent5": "His lean muscles showed the result of his hard work at the gym."
        },
        {
            "definition": "To be in a position that is not perpendicular to the ground",
            "pos": "verb",
            "sent1": "The tower seemed to lean towards the setting sun.",
            "sent2": "The old fence started to lean to one side due to strong winds.",
            "sent3": "The tired hiker had to lean forward to keep walking up the steep hill.",
            "sent4": "The tree began to lean over the fence, creating a natural archway.",
            "sent5": "The building appeared to lean slightly, giving it a unique and quirky look."
        }
    ]
}