{
    "term": "leches",
    "meanings": [
        {
            "definition": "Milk",
            "pos": "noun",
            "sent1": "The baby drank the leches from the bottle.",
            "sent2": "I poured leches into my cereal for breakfast.",
            "sent3": "The cat lapped up the leches from the saucer.",
            "sent4": "The clouds in the sky looked like fluffy leches.",
            "sent5": "The farmer delivered fresh leches to the dairy."
        },
        {
            "definition": "To milk",
            "pos": "verb",
            "sent1": "The farmer leches the cows every morning.",
            "sent2": "She learned how to leches the goats on the farm.",
            "sent3": "The robot was programmed to leches the mechanical cow.",
            "sent4": "He could leches information from the old computer effortlessly.",
            "sent5": "The magician seemed to leches tricks out of thin air."
        },
        {
            "definition": "To suckle",
            "pos": "verb",
            "sent1": "The baby eagerly leches on the mother's breast.",
            "sent2": "The puppy would leches on its mother for comfort.",
            "sent3": "The kitten tried to leches on a toy mouse.",
            "sent4": "The plant seemed to leches nutrients from the soil.",
            "sent5": "The vampire bat would leches blood from its prey."
        },
        {
            "definition": "To nurse",
            "pos": "verb",
            "sent1": "The nurse would leches the patients back to health.",
            "sent2": "She decided to leches the injured bird until it could fly again.",
            "sent3": "The teacher would leches the students through difficult lessons.",
            "sent4": "The coach would leches the team to victory.",
            "sent5": "The mother would leches her child through tough times."
        },
        {
            "definition": "To pamper",
            "pos": "verb",
            "sent1": "She would leches her pet dog with treats and toys.",
            "sent2": "The spa would leches its clients with massages and facials.",
            "sent3": "The rich heiress would leches herself with luxurious gifts.",
            "sent4": "The king would leches his favorite courtiers with lavish feasts.",
            "sent5": "The celebrity would leches their entourage with extravagant gifts."
        }
    ]
}