{
    "term": "lefte",
    "meanings": [
        {
            "definition": "To go away from; depart from",
            "pos": "verb",
            "sent1": "She lefte the party early to catch the last bus home.",
            "sent2": "The train lefte the station right on time.",
            "sent3": "He lefte the meeting abruptly, forgetting his briefcase.",
            "sent4": "The sun lefte the sky, painting it with hues of orange and pink.",
            "sent5": "The bird lefte its nest, soaring into the clear blue sky."
        },
        {
            "definition": "To remain as a residue; remain",
            "pos": "verb",
            "sent1": "After the rain, puddles lefte on the sidewalk.",
            "sent2": "A faint scent lefte in the room after she sprayed perfume.",
            "sent3": "The taste of chocolate lefte on his tongue, making him crave more.",
            "sent4": "Memories of the past lefte in her mind, bringing a smile to her face.",
            "sent5": "The warmth of the sun lefte on her skin, comforting and gentle."
        },
        {
            "definition": "To put or keep in a safe or convenient place",
            "pos": "verb",
            "sent1": "She lefte her keys on the table by the door.",
            "sent2": "He lefte his phone charging overnight on the nightstand.",
            "sent3": "The cat lefte her favorite toy under the bed as a surprise.",
            "sent4": "The treasure was lefte hidden in the old chest for generations.",
            "sent5": "He lefte a note on the fridge to remind himself of the appointment."
        },
        {
            "definition": "To cause to remain as a residue; leave behind",
            "pos": "verb",
            "sent1": "The storm lefte a trail of destruction in its wake.",
            "sent2": "His words lefte a lasting impact on her heart.",
            "sent3": "The chef lefte a sprinkle of herbs on top for added flavor.",
            "sent4": "The artist lefte a signature in the corner of the painting.",
            "sent5": "The explorer lefte footprints in the sand, marking his journey."
        }
    ]
}