{
    "term": "leftism",
    "meanings": [
        {
            "definition": "The political ideology advocating for social equality and government intervention in the economy.",
            "pos": "noun",
            "sent1": "Leftism aims for fairness and government involvement in the economy.",
            "sent2": "Many people support leftism for its focus on social equality.",
            "sent3": "The comedy show joked about a world where leftism meant everyone had to wear the same color socks.",
            "sent4": "In the painting, the artist used different shades of blue to represent the various aspects of leftism.",
            "sent5": "The textbook vividly described leftism as a movement towards equal opportunities for all."
        },
        {
            "definition": "The belief in progressive social policies and reforms.",
            "pos": "noun",
            "sent1": "Leftism involves believing in progress and social policy changes.",
            "sent2": "Her strong leftism led her to advocate for better healthcare for all.",
            "sent3": "At the party, they playfully debated whose leftism was more progressive.",
            "sent4": "The novel portrayed leftism as a river flowing towards a brighter future.",
            "sent5": "The documentary highlighted the impact of leftism on society's development."
        },
        {
            "definition": "The promotion of leftist political views and policies.",
            "pos": "noun",
            "sent1": "Leftism involves promoting leftist views and policies.",
            "sent2": "The organization's main goal is the spread of leftism in politics.",
            "sent3": "During the debate, they humorously argued about the best way to promote leftism.",
            "sent4": "Her speech was a powerful call to action for the advancement of leftism.",
            "sent5": "The movie depicted the struggles faced by activists fighting for leftism."
        }
    ]
}