{
    "term": "legators",
    "meanings": [
        {
            "definition": "A person who bequeaths personal property by will.",
            "pos": "noun",
            "sent1": "My grandmother was a generous legator, leaving each of us a special gift in her will.",
            "sent2": "The legators of the estate distributed the family heirlooms according to the will.",
            "sent3": "The legators decided to play a game where they pretended to be passing on imaginary treasures.",
            "sent4": "The legators' wills were like maps, guiding their loved ones to their final gifts.",
            "sent5": "The legators' bequests were like colorful threads weaving through the tapestry of family history."
        },
        {
            "definition": "A person who leaves a legacy or bequest.",
            "pos": "noun",
            "sent1": "The community remembered the legators for their generous donations to the local school.",
            "sent2": "Legators often plan ahead to ensure their loved ones are taken care of after they're gone.",
            "sent3": "The legators' bequests were like surprise gifts waiting to be unwrapped by the recipients.",
            "sent4": "The legacy of the legators shone brightly in the hearts of those they helped.",
            "sent5": "The town celebrated the legators' memory with a beautiful memorial garden."
        },
        {
            "definition": "A person who makes a bequest or will.",
            "pos": "noun",
            "sent1": "The lawyer helped the legators draft their wills to ensure their wishes were clear.",
            "sent2": "Legators carefully consider who will inherit their belongings when they are no longer here.",
            "sent3": "The legators joked that they were like modern-day treasure hunters, leaving clues in their wills.",
            "sent4": "The legators' bequests were like whispers of love carried on the wind.",
            "sent5": "The legators' wills were like time capsules, preserving their memories for future generations."
        }
    ]
}