{
    "term": "legalism",
    "meanings": [
        {
            "definition": "Excessive adherence to law or formula.",
            "pos": "noun",
            "sent1": "His legalism made him follow every rule to the letter.",
            "sent2": "The company's legalism led to strict policies for all employees.",
            "sent3": "The legalism of always wearing matching socks became a running joke among his friends.",
            "sent4": "Her legalism in following recipes precisely resulted in delicious meals every time.",
            "sent5": "The legalism of checking the door three times before leaving became a comforting ritual for him."
        },
        {
            "definition": "The doctrine that salvation is gained through good works.",
            "pos": "noun",
            "sent1": "Their belief in legalism meant they focused on doing good deeds to earn their place in heaven.",
            "sent2": "Legalism teaches that one must perform acts of kindness to achieve salvation.",
            "sent3": "The legalism of volunteering at the animal shelter every weekend brought joy to her heart.",
            "sent4": "In the legalism of charity work, they found fulfillment and purpose.",
            "sent5": "The legalism of helping others became a way of life for him."
        },
        {
            "definition": "Strict adherence to the law, especially the letter rather than the spirit.",
            "pos": "noun",
            "sent1": "The legalism of following speed limits to the exact number frustrated some drivers.",
            "sent2": "In their legalism, they never missed a deadline, no matter the circumstances.",
            "sent3": "The legalism of always using turn signals even in an empty parking lot amused her friends.",
            "sent4": "His legalism in punctuality made him the first one at every meeting.",
            "sent5": "The legalism of reading every contract word for word saved him from many pitfalls."
        }
    ]
}