{
    "term": "legated",
    "meanings": [
        {
            "definition": "To delegate or assign authority or power to someone.",
            "pos": "verb",
            "sent1": "She legated the task of organizing the event to her assistant.",
            "sent2": "The manager legated the responsibility of training new employees to the senior staff.",
            "sent3": "He legated the decision-making power to his pet cat, causing chaos in the office.",
            "sent4": "The CEO legated the company's future direction to a magic eight ball.",
            "sent5": "The teacher legated the role of class monitor to the most responsible student."
        },
        {
            "definition": "To bequeath or leave something in a will.",
            "pos": "verb",
            "sent1": "She legated her antique jewelry collection to her granddaughter.",
            "sent2": "The wealthy philanthropist legated a significant portion of his estate to charity.",
            "sent3": "He legated his favorite hat to his best friend, knowing it would be cherished.",
            "sent4": "The author legated his unpublished manuscripts to a literary foundation for preservation.",
            "sent5": "The old lady legated her secret cookie recipe to her neighbor before moving away."
        },
        {
            "definition": "To send as a representative or ambassador.",
            "pos": "verb",
            "sent1": "The president legated the diplomat to negotiate peace talks with the neighboring country.",
            "sent2": "The tribe legated their chief to attend the council meeting on their behalf.",
            "sent3": "He legated his mischievous brother as the family representative at the school meeting.",
            "sent4": "The company legated their top salesperson to represent them at the international conference.",
            "sent5": "The captain legated the first mate to welcome the visiting dignitaries aboard the ship."
        }
    ]
}