{
    "term": "legerdemain",
    "meanings": [
        {
            "definition": "Skillful use of one's hands when performing magic tricks.",
            "pos": "noun",
            "sent1": "The magician's legerdemain amazed the audience with his disappearing act.",
            "sent2": "She learned the art of legerdemain to entertain children at birthday parties.",
            "sent3": "The clown tried to use legerdemain to juggle invisible balls, but everyone saw through his act.",
            "sent4": "His legerdemain with cards was so smooth, it seemed like the cards were dancing in his hands.",
            "sent5": "The master's legerdemain made it seem like objects were vanishing into thin air."
        },
        {
            "definition": "Deception or trickery, especially involving sleight of hand.",
            "pos": "noun",
            "sent1": "The thief's legerdemain allowed him to pickpocket without anyone noticing.",
            "sent2": "She saw through his legerdemain and caught him trying to cheat at cards.",
            "sent3": "The salesman's legerdemain with words convinced customers to buy products they didn't need.",
            "sent4": "His legerdemain in negotiations made it seem like he was giving more than he actually was.",
            "sent5": "The politician's legerdemain with promises fooled many into voting for him."
        },
        {
            "definition": "Clever manipulation or trickery to achieve a desired result.",
            "pos": "noun",
            "sent1": "The student used legerdemain to make it seem like he had studied all night for the test.",
            "sent2": "Her legerdemain in getting out of trouble always left her classmates in awe.",
            "sent3": "The chef's legerdemain in the kitchen made it seem like he could turn any ingredient into a gourmet dish.",
            "sent4": "His legerdemain in solving problems made him the go-to person in the office.",
            "sent5": "The coach's legerdemain in motivating the team led them to victory against all odds."
        }
    ]
}