{
    "term": "legend",
    "meanings": [
        {
            "definition": "A traditional story sometimes popularly regarded as historical but unauthenticated.",
            "pos": "noun",
            "sent1": "The children loved listening to the old legend about the brave knight.",
            "sent2": "The legend of King Arthur is known by many people around the world.",
            "sent3": "Grandpa always tells the same legend, but we never get tired of hearing it.",
            "sent4": "The legend of the Loch Ness Monster continues to intrigue people to this day.",
            "sent5": "The legend of Robin Hood stealing from the rich to give to the poor is a classic tale of heroism."
        },
        {
            "definition": "An extremely famous or notorious person, especially in a particular field.",
            "pos": "noun",
            "sent1": "Michael Jordan is a basketball legend known for his incredible skills.",
            "sent2": "The music industry has many legends who have left a lasting impact.",
            "sent3": "The legendary chef prepared a meal fit for a king.",
            "sent4": "She became a legend in the fashion world with her innovative designs.",
            "sent5": "Legends like Albert Einstein have shaped our understanding of the universe."
        },
        {
            "definition": "An inscription, especially on a coin or medal.",
            "pos": "noun",
            "sent1": "The ancient coin had a small legend engraved on its surface.",
            "sent2": "The legend on the medal commemorated the soldier's bravery.",
            "sent3": "The legend on the coin was so tiny, I needed a magnifying glass to read it.",
            "sent4": "The intricate legend on the ancient artifact told a story of a forgotten civilization.",
            "sent5": "The legend on the ring held a secret message only the wearer could decipher."
        },
        {
            "definition": "A key to the symbols and color codes on a map.",
            "pos": "noun",
            "sent1": "Make sure to refer to the legend to understand the map's symbols.",
            "sent2": "The legend on the map explained what each color represented.",
            "sent3": "Without the legend, the map would be confusing to read.",
            "sent4": "The legend on the pirate's map led to buried treasure.",
            "sent5": "The detailed legend on the hiking trail map guided us through the forest."
        }
    ]
}