{
    "term": "legitimisms",
    "meanings": [
        {
            "definition": "Belief in or adherence to the principles of legitimacy.",
            "pos": "noun",
            "sent1": "Her strong legitimisms guided her actions in always following the rules.",
            "sent2": "The country's history is filled with legitimisms that shaped its laws and customs.",
            "sent3": "He took his legitimisms so seriously that he wouldn't even jaywalk.",
            "sent4": "In the family, the grandmother's legitimisms were the foundation that held everyone together.",
            "sent5": "The teacher's legitimisms were like a compass, always pointing towards what was right."
        },
        {
            "definition": "The doctrine that a government's authority is derived from a legitimate source.",
            "pos": "noun",
            "sent1": "The legitimisms of the constitution ensure the government's power comes from the people.",
            "sent2": "Citizens' understanding of legitimisms helps them trust the government's decisions.",
            "sent3": "The cat's legitimisms over the household were comically portrayed in the children's story.",
            "sent4": "The legitimisms of democracy are like the roots of a tree, providing stability and nourishment.",
            "sent5": "The king's legitimisms were like a crown, symbolizing his rightful rule over the land."
        },
        {
            "definition": "The practice or system of recognizing and respecting established authority or tradition.",
            "pos": "noun",
            "sent1": "The school's legitimisms included following the principal's instructions without question.",
            "sent2": "In some cultures, legitimisms dictate strict adherence to traditional ceremonies.",
            "sent3": "The dog's legitimisms towards the mailman were always met with wagging tails.",
            "sent4": "The legitimisms of the past are like a map, guiding us through the present.",
            "sent5": "The town's legitimisms were like a shield, protecting its values from outside influence."
        }
    ]
}