{
    "term": "legong",
    "meanings": [
        {
            "definition": "A traditional Balinese dance characterized by intricate finger movements and expressive facial expressions.",
            "pos": "noun",
            "sent1": "During the festival, the villagers performed a beautiful legong to honor their ancestors.",
            "sent2": "The legong was filled with graceful movements and storytelling gestures.",
            "sent3": "The mischievous monkey tried to imitate the legong dancer's hand movements but ended up tangled in vines.",
            "sent4": "Her emotions flowed like a legong, each expression a note in the dance of her life.",
            "sent5": "The legong dance painted a vivid picture of love and loss, leaving the audience mesmerized."
        },
        {
            "definition": "A type of Indonesian dance performed by young girls.",
            "pos": "noun",
            "sent1": "The young girls practiced the legong tirelessly, perfecting their steps and gestures.",
            "sent2": "In the village square, the legong captivated the audience with its youthful energy.",
            "sent3": "The mischievous cat tried to join the legong performance, leaping and twirling around the dancers.",
            "sent4": "Her laughter was like a legong, light and joyful, filling the room with happiness.",
            "sent5": "The legong of the young dancers was a burst of color and movement, a celebration of youth and tradition."
        },
        {
            "definition": "A type of Balinese music often used in traditional dance performances.",
            "pos": "noun",
            "sent1": "The melodic tones of the legong accompanied the dancers, setting the mood for the performance.",
            "sent2": "The rhythmic beats of the legong echoed through the temple courtyard, inviting everyone to dance.",
            "sent3": "The playful monkeys in the forest seemed to dance to the legong playing in the distance.",
            "sent4": "The legong music wrapped around her like a warm embrace, guiding her movements with its melody.",
            "sent5": "The enchanting sounds of the legong transported the listeners to a world of magic and tradition."
        }
    ]
}