{
    "term": "leke",
    "meanings": [
        {
            "definition": "To allow a substance to escape through a hole or crack.",
            "pos": "verb",
            "sent1": "The water began to leke from the pipe, creating a small puddle.",
            "sent2": "Be careful not to leke any paint on the floor while painting the walls.",
            "sent3": "The juice seemed to leke out of the container faster than expected.",
            "sent4": "Her secrets started to leke out during the conversation, surprising everyone.",
            "sent5": "The dam was about to leke, causing panic among the villagers."
        },
        {
            "definition": "A small opening or crack that allows a substance to escape.",
            "pos": "noun",
            "sent1": "There was a tiny leke in the roof, letting in drops of rain.",
            "sent2": "The plumber fixed the leke in the pipe to stop the water from dripping.",
            "sent3": "The detective found a leke in the suspect's alibi, leading to a breakthrough in the case.",
            "sent4": "The old boat had a leke that needed constant patching to stay afloat.",
            "sent5": "The scientist discovered a hidden leke in the theory, changing the course of research."
        },
        {
            "definition": "To play or engage in a game or sport.",
            "pos": "verb",
            "sent1": "Children love to leke in the park, running around and laughing.",
            "sent2": "During recess, the students would leke together in the schoolyard.",
            "sent3": "The cats decided to leke with a ball of yarn, causing a mess in the living room.",
            "sent4": "The siblings would leke hide-and-seek every evening before dinner.",
            "sent5": "The team was excited to leke against their rivals in the championship match."
        },
        {
            "definition": "A small, shallow container for holding liquid.",
            "pos": "noun",
            "sent1": "She poured the milk into a leke before serving it to the guests.",
            "sent2": "The bartender grabbed a leke to mix the cocktail for the customer.",
            "sent3": "The chef used a leke to measure the oil for the recipe.",
            "sent4": "The hiker carried a leke of water to stay hydrated during the trek.",
            "sent5": "The artist dipped the brush into the leke of paint to start the masterpiece."
        }
    ]
}