{
    "term": "leng",
    "meanings": [
        {
            "definition": "A unit of measurement equal to 45 inches.",
            "pos": "noun",
            "sent1": "She measured the fabric using a leng to ensure it was the right size.",
            "sent2": "The carpenter used a leng to cut the wood accurately.",
            "sent3": "The leng of the room was just enough to fit the new furniture comfortably.",
            "sent4": "His patience was like a leng, always precise and unwavering.",
            "sent5": "The leng of the journey seemed never-ending under the scorching sun."
        },
        {
            "definition": "To extend or stretch out.",
            "pos": "verb",
            "sent1": "He tried to leng his arms to reach the top shelf.",
            "sent2": "The cat likes to leng out on the warm windowsill.",
            "sent3": "She decided to leng the meeting to allow for more discussion.",
            "sent4": "The vines seemed to leng endlessly across the garden.",
            "sent5": "The magician's hands seemed to leng magically as he performed his tricks."
        },
        {
            "definition": "To make something longer in length.",
            "pos": "verb",
            "sent1": "She wanted to leng her hair for a new look.",
            "sent2": "The tailor had to leng the dress to fit the customer perfectly.",
            "sent3": "He accidentally tried to leng the rope, making it too long for the task.",
            "sent4": "The artist decided to leng the painting to capture more detail.",
            "sent5": "The chef had to leng the cooking time to ensure the dish was fully cooked."
        },
        {
            "definition": "The state of being long in distance or duration.",
            "pos": "noun",
            "sent1": "The leng of the river made it perfect for a leisurely boat ride.",
            "sent2": "The leng of the movie surprised everyone with its epic storytelling.",
            "sent3": "His explanation seemed to go on for a leng, losing the audience's interest.",
            "sent4": "The winter nights felt like a never-ending leng of darkness.",
            "sent5": "The leng of the friendship was evident in their shared memories and experiences."
        }
    ]
}