{
    "term": "letterboxing",
    "meanings": [
        {
            "definition": "A hobby or outdoor activity involving the search for hidden containers using clues and a stamp.",
            "pos": "noun",
            "sent1": "Letterboxing is a fun adventure game where you follow clues to find hidden boxes.",
            "sent2": "People enjoy letterboxing because it combines hiking with a treasure hunt.",
            "sent3": "The family had a blast letterboxing in the forest, searching for the secret containers.",
            "sent4": "In a way, letterboxing is like a real-life puzzle waiting to be solved.",
            "sent5": "The excitement of letterboxing lies in the thrill of discovery and exploration."
        },
        {
            "definition": "The practice of placing a stamp in a hidden container for others to find.",
            "pos": "noun",
            "sent1": "After creating a unique stamp, she carefully placed it in the letterboxing box.",
            "sent2": "Letterboxing enthusiasts often leave creative stamps for fellow adventurers to discover.",
            "sent3": "The mischievous squirrel thought it would be funny to hide acorns in the letterboxing containers.",
            "sent4": "The idea of letterboxing is like leaving a surprise gift for strangers to stumble upon.",
            "sent5": "The hidden stamp adds an element of mystery and delight to the letterboxing experience."
        },
        {
            "definition": "The act of creating and exchanging hand-carved rubber stamps.",
            "pos": "noun",
            "sent1": "She spent hours perfecting her letterboxing stamp, carving intricate designs into rubber.",
            "sent2": "Letterboxing artists take pride in their skill of crafting unique stamps for trading.",
            "sent3": "The letterboxing group organized a stamp-carving party to share techniques and ideas.",
            "sent4": "To them, letterboxing is not just a hobby but a creative outlet for artistic expression.",
            "sent5": "The beauty of letterboxing lies in the intricate details of each hand-carved stamp."
        }
    ]
}