{
    "term": "letterboxings",
    "meanings": [
        {
            "definition": "The activity or hobby of searching for hidden containers using clues and a stamp, typically done outdoors.",
            "pos": "noun",
            "sent1": "During our nature hike, we enjoyed some letterboxings by following the clues to find hidden containers.",
            "sent2": "Families often engage in letterboxings together as a fun outdoor activity.",
            "sent3": "The letterboxings adventure turned into a friendly competition to see who could find the most containers.",
            "sent4": "In the world of letterboxings, each hidden container holds a small treasure waiting to be discovered.",
            "sent5": "The thrill of letterboxings lies in the excitement of uncovering hidden gems in nature."
        },
        {
            "definition": "The containers hidden in various locations for participants to find and stamp with their personal stamp.",
            "pos": "noun",
            "sent1": "The letterboxings we found in the park were cleverly hidden under rocks and behind trees.",
            "sent2": "Participants in the event eagerly searched for the letterboxings to collect stamps.",
            "sent3": "The group of friends made a pact to split the treasures found in the letterboxings equally.",
            "sent4": "The letterboxings scattered around the city were like hidden gems waiting to be discovered.",
            "sent5": "Stamping our personal mark on the letterboxings felt like leaving a piece of ourselves behind."
        },
        {
            "definition": "The act of placing a letterbox in a hidden location for others to find and stamp.",
            "pos": "noun",
            "sent1": "As a hobby, she enjoyed the letterboxings of creating intricate hiding spots for others to find.",
            "sent2": "The thrill of letterboxings for him was in the art of crafting clever hiding spots.",
            "sent3": "He decided to prank his friends by placing fake letterboxings in unexpected locations.",
            "sent4": "Her letterboxings were like little surprises waiting to be stumbled upon by curious adventurers.",
            "sent5": "The joy of letterboxings for her was in imagining the excitement of those who would find her hidden treasures."
        }
    ]
}