{
    "term": "lev",
    "meanings": [
        {
            "definition": "To lift or raise up.",
            "pos": "verb",
            "sent1": "She used all her strength to lev the heavy box onto the shelf.",
            "sent2": "The construction workers had to lev the beams to the top floor of the building.",
            "sent3": "The magician tried to lev the table with a wave of his wand, but it didn't work.",
            "sent4": "His words seemed to lev her spirits, lifting her out of her sadness.",
            "sent5": "The crane operator skillfully used the controls to lev the container off the truck."
        },
        {
            "definition": "A unit of currency in Bulgaria.",
            "pos": "noun",
            "sent1": "She exchanged her dollars for Bulgarian levs before her trip.",
            "sent2": "The price of the souvenir was ten levs at the market.",
            "sent3": "He found a lucky lev on the ground and decided to keep it for good luck.",
            "sent4": "In Bulgaria, you can buy a lot with just a few levs.",
            "sent5": "The beggar was grateful for any spare levs people could give him."
        },
        {
            "definition": "A unit of currency in Moldova.",
            "pos": "noun",
            "sent1": "The shopkeeper accepted both euros and Moldovan levs as payment.",
            "sent2": "The cost of the meal was twenty Moldovan levs.",
            "sent3": "She accidentally dropped her last lev down the drain and couldn't retrieve it.",
            "sent4": "The value of the Moldovan lev has remained stable over the years.",
            "sent5": "He saved up all his levs to buy a special gift for his mother."
        },
        {
            "definition": "A unit of currency in Romania.",
            "pos": "noun",
            "sent1": "The street vendor quoted the price in Romanian levs to the tourists.",
            "sent2": "The taxi driver's fare was thirty Romanian levs for the short ride.",
            "sent3": "She found an old coin that turned out to be a rare Romanian lev.",
            "sent4": "The market was bustling with vendors selling goods for levs.",
            "sent5": "The children pooled their levs together to buy a present for their teacher."
        }
    ]
}