{
    "term": "levamisole",
    "meanings": [
        {
            "definition": "Levamisole: a medication used to treat parasitic worm infections in humans and animals.",
            "pos": "noun",
            "sent1": "The veterinarian prescribed levamisole to help the sick dog.",
            "sent2": "The doctor recommended levamisole to cure the worm infection.",
            "sent3": "The farmer accidentally mistook levamisole for sugar and fed it to the chickens!",
            "sent4": "Levamisole acted like a warrior, fighting off the invading worms in the body.",
            "sent5": "The bright orange color of levamisole made it easy to spot in the medicine cabinet."
        },
        {
            "definition": "Levamisole: a chemical compound with anthelmintic properties.",
            "pos": "noun",
            "sent1": "Scientists studied the effects of levamisole on worm populations.",
            "sent2": "The lab technician mixed levamisole with other chemicals for the experiment.",
            "sent3": "The students accidentally spilled levamisole in the chemistry lab, causing a strange reaction.",
            "sent4": "Levamisole was like a superhero, swooping in to save the day by eliminating the worms.",
            "sent5": "The distinct smell of levamisole lingered in the air after the experiment."
        },
        {
            "definition": "Levamisole: a drug that stimulates the immune system.",
            "pos": "noun",
            "sent1": "The doctor prescribed levamisole to boost the patient's immune response.",
            "sent2": "Athletes sometimes misuse levamisole to enhance their performance.",
            "sent3": "The comedian joked that levamisole was the secret ingredient in his 'immune-boosting' smoothie.",
            "sent4": "Levamisole was like a cheerleader, rallying the immune system to fight off infections.",
            "sent5": "The sudden burst of energy after taking levamisole surprised the patient."
        }
    ]
}