{
    "term": "leva",
    "meanings": [
        {
            "definition": "The currency of Bulgaria.",
            "pos": "noun",
            "sent1": "In Bulgaria, you can use leva to buy souvenirs.",
            "sent2": "I exchanged my dollars for leva at the bank.",
            "sent3": "The leva in my wallet seems to be multiplying!",
            "sent4": "Her smile was like a handful of shiny leva.",
            "sent5": "The vendor's call for leva echoed through the market."
        },
        {
            "definition": "To lift or raise.",
            "pos": "verb",
            "sent1": "I leva the heavy box onto the shelf.",
            "sent2": "Can you help me leva this table to the other side of the room?",
            "sent3": "The magician used his wand to leva the rabbit into the hat.",
            "sent4": "She could almost feel the wind leva her up into the sky.",
            "sent5": "With a mighty effort, he managed to leva the boulder off the ground."
        },
        {
            "definition": "A unit of currency in Albania.",
            "pos": "noun",
            "sent1": "In Albania, you can use leva to pay for your meal.",
            "sent2": "The shopkeeper only accepted leva as payment.",
            "sent3": "The leva jingled in his pocket as he walked down the street.",
            "sent4": "Her laughter was like the sound of leva falling from the sky.",
            "sent5": "The beggar's eyes lit up when he saw the leva in the donation box."
        },
        {
            "definition": "A type of currency in Croatia.",
            "pos": "noun",
            "sent1": "The market was bustling with people exchanging euros for leva.",
            "sent2": "She saved up all her leva for a special occasion.",
            "sent3": "The leva in his wallet seemed to disappear faster than he could earn them.",
            "sent4": "The sun shone on the leva, making them sparkle like jewels.",
            "sent5": "The old man's stories were worth more than all the leva in the world."
        },
        {
            "definition": "A monetary unit in Belarus.",
            "pos": "noun",
            "sent1": "The exchange rate for leva to dollars was favorable.",
            "sent2": "He counted his leva carefully before making the purchase.",
            "sent3": "The leva in the piggy bank were a mix of coins and bills.",
            "sent4": "Her dreams were filled with leva floating in the air like confetti.",
            "sent5": "The sound of leva clinking together was music to his ears."
        }
    ]
}