{
    "term": "levellers",
    "meanings": [
        {
            "definition": "A person or group advocating for social equality and the redistribution of wealth.",
            "pos": "noun",
            "sent1": "The levellers in our community work hard to ensure everyone has equal opportunities.",
            "sent2": "The levellers believe in fairness and want to make sure everyone has a chance to succeed.",
            "sent3": "The levellers organized a bake sale to raise funds for those in need, showing their commitment to equality.",
            "sent4": "Her kindness and generosity made her a true leveller among her peers.",
            "sent5": "The levellers' passion for justice inspired others to join their cause."
        },
        {
            "definition": "A tool or device used to make a surface flat or even.",
            "pos": "noun",
            "sent1": "The carpenter used a leveller to ensure the table was perfectly flat.",
            "sent2": "The leveller helped smooth out the bumps in the road for a safer drive.",
            "sent3": "The leveller made the job of fixing the floor much easier and quicker.",
            "sent4": "With the leveller in hand, the construction worker leveled the ground effortlessly.",
            "sent5": "The leveller's precision was crucial in creating a smooth surface for the tiles."
        },
        {
            "definition": "A political movement in 17th century England seeking to abolish the monarchy and establish a republic.",
            "pos": "noun",
            "sent1": "The levellers fought bravely for their vision of a republic where all voices were heard.",
            "sent2": "During the 17th century, the levellers challenged the existing political system.",
            "sent3": "The levellers' demand for change shook the foundations of the monarchy.",
            "sent4": "Their ideas spread like wildfire, igniting a revolution led by the levellers.",
            "sent5": "The levellers' determination to create a republic inspired generations to come."
        }
    ]
}