{
    "term": "leve",
    "meanings": [
        {
            "definition": "To rise or lift up",
            "pos": "verb",
            "sent1": "The balloon will leve into the sky.",
            "sent2": "I always leve my hand when I know the answer.",
            "sent3": "The cat tried to leve itself onto the high shelf.",
            "sent4": "Her spirits began to leve as she received good news.",
            "sent5": "The sun's rays leve over the horizon, bringing a new day."
        },
        {
            "definition": "A natural or artificial embankment or wall to prevent flooding",
            "pos": "noun",
            "sent1": "The leve protected the town from the river's overflow.",
            "sent2": "The workers reinforced the leve to withstand the storm.",
            "sent3": "The ducks waddled along the top of the leve.",
            "sent4": "The leve stood strong against the rushing water.",
            "sent5": "Children played near the leve, enjoying the view of the river."
        },
        {
            "definition": "To abandon or forsake",
            "pos": "verb",
            "sent1": "He decided to leve his old habits behind.",
            "sent2": "She couldn't bear to leve her loyal dog.",
            "sent3": "The pirate threatened to leve the crew on the deserted island.",
            "sent4": "The idea to leve his dream job haunted him.",
            "sent5": "The decision to leve his family tore him apart."
        },
        {
            "definition": "To decrease in intensity or force",
            "pos": "verb",
            "sent1": "The storm began to leve as the winds calmed.",
            "sent2": "His anger would leve as quickly as it came.",
            "sent3": "The music gradually started to leve in volume.",
            "sent4": "The pain in her knee would leve after resting.",
            "sent5": "The tension in the room seemed to leve, creating a peaceful atmosphere."
        }
    ]
}