{
    "term": "levitations",
    "meanings": [
        {
            "definition": "The act of rising or floating in the air without any physical support.",
            "pos": "noun",
            "sent1": "During the magic show, the magician performed incredible levitations that amazed the audience.",
            "sent2": "Levitations are often seen in fantasy movies where characters possess magical powers.",
            "sent3": "The levitations of the balloons at the party made it seem like they had a mind of their own.",
            "sent4": "Her levitations on the dance floor made her appear as light as a feather.",
            "sent5": "The levitations of the kite in the strong wind were a sight to behold."
        },
        {
            "definition": "The ability to defy gravity and hover above the ground.",
            "pos": "noun",
            "sent1": "The superhero's levitations allowed him to soar through the sky with ease.",
            "sent2": "Levitations in science fiction stories often involve advanced technology or superhuman abilities.",
            "sent3": "The levitations of the toy helicopter made the children giggle with delight.",
            "sent4": "Her levitations on the swing made her feel like she could touch the clouds.",
            "sent5": "The levitations of the hot air balloon created a sense of wonder in the onlookers."
        },
        {
            "definition": "A supernatural phenomenon where a person or object is lifted into the air by unseen forces.",
            "pos": "noun",
            "sent1": "The ghostly levitations in the haunted house sent shivers down the visitors' spines.",
            "sent2": "Levitations in folklore often involve spirits or otherworldly beings.",
            "sent3": "The levitations of the leaves in the wind made it seem like nature had a playful side.",
            "sent4": "Her levitations during meditation made her feel connected to the spiritual realm.",
            "sent5": "The levitations of the feather in the breeze were like a dance choreographed by the wind."
        }
    ]
}