{
    "term": "lexigrams",
    "meanings": [
        {
            "definition": "A symbol or character representing a word or phrase.",
            "pos": "noun",
            "sent1": "In the game, players use lexigrams to guess the hidden words.",
            "sent2": "The ancient civilization used lexigrams to record important information.",
            "sent3": "The detective cracked the case by deciphering the mysterious lexigrams left at the crime scene.",
            "sent4": "Her eyes scanned the lexigrams on the page, searching for a clue to the hidden message.",
            "sent5": "The artist created a beautiful mural using colorful lexigrams to tell a story."
        },
        {
            "definition": "A method of communication using symbols or characters.",
            "pos": "noun",
            "sent1": "Children with autism often benefit from using lexigrams to communicate their needs.",
            "sent2": "The ancient civilization developed a complex system of lexigrams for long-distance communication.",
            "sent3": "The aliens communicated with the humans using strange lexigrams that glowed in the dark.",
            "sent4": "His music was like a lexigram, conveying emotions without the need for words.",
            "sent5": "The teacher used simple lexigrams to help the students understand the new concept."
        },
        {
            "definition": "A system of symbols used to represent language.",
            "pos": "noun",
            "sent1": "The lexigrams in the book were so intricate that it took hours to decode them.",
            "sent2": "The researchers developed a new lexigram system to assist in cross-cultural communication.",
            "sent3": "The magician's lexigram cards seemed ordinary, but they held a secret message for the audience.",
            "sent4": "Her mind was a jumble of lexigrams, each representing a different aspect of her life.",
            "sent5": "The lexigram chart helped the students learn the foreign language more quickly."
        }
    ]
}