{
    "term": "lexicon",
    "meanings": [
        {
            "definition": "A dictionary or vocabulary of a language.",
            "pos": "noun",
            "sent1": "My sister always carries a small lexicon in her bag to help her with unfamiliar words.",
            "sent2": "The English lexicon contains thousands of words that are constantly evolving.",
            "sent3": "When the cat knocked over the bookshelf, it created a lexicon of chaos on the floor.",
            "sent4": "Her mind was a vast lexicon, storing every word she had ever encountered.",
            "sent5": "The lexicon of the forest whispered secrets in the wind."
        },
        {
            "definition": "The vocabulary of a person, language, or branch of knowledge.",
            "pos": "noun",
            "sent1": "His lexicon of computer terms was impressive, allowing him to troubleshoot any issue.",
            "sent2": "Learning a new language involves expanding your lexicon and mastering grammar rules.",
            "sent3": "The chef's lexicon of flavors and spices was like a symphony in every dish.",
            "sent4": "Her lexicon of emotions was vast, ranging from joy to sorrow.",
            "sent5": "The lexicon of the scientist was filled with complex equations and theories."
        },
        {
            "definition": "The words used in a particular language or by a particular person or group.",
            "pos": "noun",
            "sent1": "The lexicon of teenage slang is constantly changing, making it hard for parents to keep up.",
            "sent2": "In legal documents, a precise lexicon is crucial to avoid misunderstandings.",
            "sent3": "The comedian's lexicon of jokes never failed to make the audience burst into laughter.",
            "sent4": "His lexicon of excuses was running thin, and he knew he had to come clean.",
            "sent5": "The lexicon of the poet painted vivid images in the reader's mind."
        }
    ]
}