{
    "term": "liberalise",
    "meanings": [
        {
            "definition": "To make more liberal or free",
            "pos": "verb",
            "sent1": "The government decided to liberalise trade policies to allow more businesses to thrive.",
            "sent2": "Countries often liberalise their laws to encourage economic growth.",
            "sent3": "The strict teacher decided to liberalise her rules for just one day, causing chaos in the classroom.",
            "sent4": "She felt like she needed to liberalise her mind from the constraints of society's expectations.",
            "sent5": "The fresh air and open fields seemed to liberalise his spirit, making him feel alive."
        },
        {
            "definition": "To relax restrictions or controls",
            "pos": "verb",
            "sent1": "The company decided to liberalise its dress code, allowing employees to wear casual attire.",
            "sent2": "During the summer, some schools liberalise their homework policies to give students a break.",
            "sent3": "The strict librarian decided to liberalise the borrowing limits, much to the delight of the book lovers.",
            "sent4": "As the music played, she felt the tension in her shoulders liberalise, allowing her to relax completely.",
            "sent5": "The warm bath helped to liberalise his muscles after a long day of hard work."
        },
        {
            "definition": "To become more open or tolerant",
            "pos": "verb",
            "sent1": "After traveling to different countries, she started to liberalise her views on cultural differences.",
            "sent2": "As people interact with diverse communities, they often liberalise their perspectives on the world.",
            "sent3": "The grumpy old man surprisingly began to liberalise his opinions on modern technology after his granddaughter explained it to him.",
            "sent4": "Her heart began to liberalise towards forgiveness as she realized the importance of letting go of grudges.",
            "sent5": "The peaceful garden seemed to liberalise her mind, allowing her to see beauty in simplicity."
        }
    ]
}