{
    "term": "libelled",
    "meanings": [
        {
            "definition": "Defamed or slandered",
            "pos": "verb",
            "sent1": "The newspaper libelled the politician by spreading lies about him.",
            "sent2": "She was libelled by her jealous coworker who spread false rumors about her.",
            "sent3": "The comedian joked that his cat libelled him by telling the dog he was a scaredy-cat.",
            "sent4": "The internet trolls libelled the celebrity, painting her as a villain to their followers.",
            "sent5": "The villain in the movie libelled the hero, turning the whole town against him."
        },
        {
            "definition": "Accused of a crime or wrongdoing",
            "pos": "adjective",
            "sent1": "The libelled man protested his innocence, claiming he was framed.",
            "sent2": "The libelled student faced harsh judgment from his classmates after the false accusation.",
            "sent3": "The libelled cake was accused of being too sweet for the party, causing a dessert dilemma.",
            "sent4": "The libelled car sat in the garage, unjustly labeled as unreliable by its previous owner.",
            "sent5": "The libelled painting was mistaken for a forgery, tarnishing its artist's reputation."
        },
        {
            "definition": "Made a false statement about someone to damage their reputation",
            "pos": "verb",
            "sent1": "The rival company libelled our brand in an attempt to steal our customers.",
            "sent2": "He libelled his ex-girlfriend online, spreading malicious lies to hurt her image.",
            "sent3": "The mischievous parrot libelled its owner by repeating made-up stories to the neighbors.",
            "sent4": "The tabloid magazine libelled the actor, causing a public outcry against their false claims.",
            "sent5": "The vengeful neighbor libelled the gardener, accusing him of stealing plants to ruin his business."
        }
    ]
}