{
    "term": "libertarianism",
    "meanings": [
        {
            "definition": "A political philosophy advocating for minimal government intervention in personal and economic matters.",
            "pos": "noun",
            "sent1": "Libertarianism values limited government involvement in people's lives.",
            "sent2": "Many people support libertarianism because they want less government control.",
            "sent3": "At the comedy show, the comedian joked that libertarianism means the government should just stay out of everyone's business.",
            "sent4": "In the world of ideas, libertarianism stands tall as a beacon of personal freedom.",
            "sent5": "The concept of libertarianism is like a refreshing breeze of independence."
        },
        {
            "definition": "The belief in individual freedom and autonomy.",
            "pos": "noun",
            "sent1": "For some, libertarianism means the right to make their own choices without interference.",
            "sent2": "Libertarianism emphasizes the importance of personal liberty.",
            "sent3": "The cat's insistence on choosing its own nap spot is a display of libertarianism.",
            "sent4": "In a world of constraints, libertarianism shines as a symbol of self-determination.",
            "sent5": "The essence of libertarianism is like a bright light guiding one's path to freedom."
        },
        {
            "definition": "The promotion of free markets and limited government control.",
            "pos": "noun",
            "sent1": "Libertarianism supports the idea of open markets and minimal government influence.",
            "sent2": "In libertarianism, the focus is on letting the market operate freely.",
            "sent3": "The bakery's decision to set its prices independently is a small act of libertarianism.",
            "sent4": "Amidst regulations, libertarianism stands as a champion of economic freedom.",
            "sent5": "The spirit of libertarianism is like a river flowing unhindered by unnecessary restrictions."
        }
    ]
}