{
    "term": "libertarians",
    "meanings": [
        {
            "definition": "A person who advocates for individual liberty and limited government intervention.",
            "pos": "noun",
            "sent1": "Libertarians believe in personal freedom and less government control.",
            "sent2": "Many libertarians argue for more individual rights and less government involvement.",
            "sent3": "Why did the libertarians bring a copy of the Constitution to the protest? To show their dedication to freedom!",
            "sent4": "In a world full of rules, libertarians are like wildflowers, blooming freely and independently.",
            "sent5": "The image of libertarians standing up for their beliefs is as powerful as a roaring lion."
        },
        {
            "definition": "Belonging to or characteristic of libertarians.",
            "pos": "adjective",
            "sent1": "Her libertarian views shaped her political opinions.",
            "sent2": "The libertarian candidate's speech resonated with many voters.",
            "sent3": "It was a libertarian picnic, with everyone bringing their own food and drinks.",
            "sent4": "The libertarian spirit in the room was like a gentle breeze, refreshing and invigorating.",
            "sent5": "The painting captured the essence of libertarian ideals, vibrant and full of life."
        },
        {
            "definition": "A member or supporter of the Libertarian Party.",
            "pos": "noun",
            "sent1": "She proudly wore her Libertarian Party pin to the rally.",
            "sent2": "Many libertarians gathered to discuss the party's platform.",
            "sent3": "Why did the libertarian bring a cake to the meeting? To sweeten the political discussions!",
            "sent4": "The libertarians in the room were a united force, standing together for their beliefs.",
            "sent5": "The passion of libertarians for their party is like a flame, burning brightly and unwavering."
        }
    ]
}