{
    "term": "licentious",
    "meanings": [
        {
            "definition": "Lacking moral discipline or ignoring legal restraint, especially in sexual conduct.",
            "pos": "adjective",
            "sent1": "The licentious behavior of the unruly teenagers shocked the community.",
            "sent2": "Her licentious actions at the party were frowned upon by the guests.",
            "sent3": "The licentious cat kept sneaking into the neighbor's yard to chase birds.",
            "sent4": "The storm's licentious winds tore through the town, leaving destruction in their wake.",
            "sent5": "The movie depicted a licentious character whose actions led to his downfall."
        },
        {
            "definition": "Marked by disregard for strict rules of correctness.",
            "pos": "adjective",
            "sent1": "The artist's licentious style challenged traditional norms in the art world.",
            "sent2": "His licentious speech offended many at the formal event.",
            "sent3": "The licentious clock refused to keep accurate time, always running fast or slow.",
            "sent4": "The licentious dance performance pushed boundaries and shocked the audience.",
            "sent5": "The licentious design of the building stood out among the surrounding structures."
        },
        {
            "definition": "Promiscuous and unprincipled in sexual matters.",
            "pos": "adjective",
            "sent1": "The gossip magazines often portrayed celebrities as licentious individuals.",
            "sent2": "The novel's protagonist was known for his licentious relationships with multiple partners.",
            "sent3": "The licentious flower garden seemed to bloom with no regard for order or design.",
            "sent4": "The licentious river meandered freely through the countryside, changing its course unpredictably.",
            "sent5": "The licentious behavior of the characters added drama to the soap opera storyline."
        }
    ]
}