{
    "term": "liches",
    "meanings": [
        {
            "definition": "A corpse.",
            "pos": "noun",
            "sent1": "The graveyard was filled with liches of those who had passed away.",
            "sent2": "The detective examined the liches found at the crime scene.",
            "sent3": "The spooky haunted house was rumored to be haunted by liches of the past residents.",
            "sent4": "The abandoned battlefield was silent, with liches of fallen soldiers scattered around.",
            "sent5": "In the horror movie, the liches rose from their graves to seek revenge."
        },
        {
            "definition": "A ghost or spirit.",
            "pos": "noun",
            "sent1": "The old castle was said to be haunted by friendly liches.",
            "sent2": "The children told stories of liches wandering the forest at night.",
            "sent3": "The liches in the attic were known for playing pranks on unsuspecting visitors.",
            "sent4": "The eerie mist in the graveyard seemed to conceal the liches moving about.",
            "sent5": "The folklore spoke of liches appearing to guide lost travelers to safety."
        },
        {
            "definition": "A dead body or corpse.",
            "pos": "noun",
            "sent1": "The morgue was filled with liches awaiting examination.",
            "sent2": "The ancient tomb was discovered to hold liches preserved by time.",
            "sent3": "The horror movie featured liches rising from their graves to terrorize the town.",
            "sent4": "The battlefield was littered with liches of fallen warriors, frozen in time.",
            "sent5": "The medical students studied the anatomy of liches to understand decomposition."
        },
        {
            "definition": "A specter or ghost.",
            "pos": "noun",
            "sent1": "The haunted mansion was rumored to be home to vengeful liches.",
            "sent2": "The folklore spoke of liches appearing on moonless nights.",
            "sent3": "The liches in the story were mischievous spirits causing chaos in the village.",
            "sent4": "The chilling wind carried whispers of liches haunting the old graveyard.",
            "sent5": "The psychic claimed to communicate with liches from the other side."
        }
    ]
}