{
    "term": "lien",
    "meanings": [
        {
            "definition": "A legal right to keep possession of property belonging to another person until a debt owed by that person is discharged.",
            "pos": "noun",
            "sent1": "The lien on the car allowed the bank to keep it until the loan was paid off.",
            "sent2": "The lien on the house ensured that the homeowner settled their debt.",
            "sent3": "The lien on the bicycle made it seem like the bank was a bike collector.",
            "sent4": "The lien on the property was like a lock, securing the debt until it was unlocked.",
            "sent5": "The lien on the jewelry sparkled like a reminder of the unpaid debt."
        },
        {
            "definition": "A claim or charge on property for payment of a debt or obligation.",
            "pos": "noun",
            "sent1": "The lien on the land was a reminder of the money owed.",
            "sent2": "The lien on the business was a way to ensure the debt was settled.",
            "sent3": "The lien on the boat made it feel like it was on loan from the bank.",
            "sent4": "The lien on the artwork was like a price tag waiting to be paid.",
            "sent5": "The lien on the furniture was a weight on the shoulders of the debtor."
        },
        {
            "definition": "A security interest granted over an item of property to secure the payment of a debt or performance of some other obligation.",
            "pos": "noun",
            "sent1": "The lien on the computer was a guarantee for the money borrowed.",
            "sent2": "The lien on the equipment was a safeguard for the lender.",
            "sent3": "The lien on the guitar made it feel like a rockstar's borrowed instrument.",
            "sent4": "The lien on the vehicle was like a seatbelt ensuring the debt was paid.",
            "sent5": "The lien on the watch was a ticking reminder of the obligation to be fulfilled."
        }
    ]
}