{
    "term": "liens",
    "meanings": [
        {
            "definition": "A right to keep possession of property belonging to another person until a debt owed by that person is discharged.",
            "pos": "noun",
            "sent1": "The mechanic had a liens on the car until the repair bill was paid.",
            "sent2": "The bank placed a liens on the house as collateral for the loan.",
            "sent3": "The liens on the bicycle made it feel like it was on loan from the repair shop.",
            "sent4": "Her gaze held onto him like a liens, not letting go until he settled his debt.",
            "sent5": "The liens on the antique vase were like chains, binding it to the creditor until the debt was settled."
        },
        {
            "definition": "A legal claim or charge on property as security for a debt or obligation.",
            "pos": "noun",
            "sent1": "The bank filed liens on the property to secure the outstanding debt.",
            "sent2": "The liens on the car ensured that the loan would be repaid.",
            "sent3": "The liens on the house were like a security guard, protecting it from debtors.",
            "sent4": "The liens on the jewelry box were a fortress, guarding it against financial risks.",
            "sent5": "The liens on the land were a shield, defending it from unpaid debts."
        },
        {
            "definition": "A legal right or interest that a creditor has in another's property, lasting usually until a debt or duty that it secures is satisfied.",
            "pos": "noun",
            "sent1": "The liens on the artwork gave the creditor a legal right over it.",
            "sent2": "The liens on the boat represented the creditor's interest in it.",
            "sent3": "The liens on the laptop were like a friendly reminder to pay off the debt.",
            "sent4": "The liens on the necklace were a silent partner, waiting for the debt to be cleared.",
            "sent5": "The liens on the car were a watchful eye, ensuring the debt was settled in time."
        }
    ]
}