{
    "term": "life",
    "meanings": [
        {
            "definition": "The condition that distinguishes animals and plants from inorganic matter, including the capacity for growth, reproduction, functional activity, and continual change preceding death.",
            "pos": "noun",
            "sent1": "In the forest, the circle of life continues with new plants growing and animals reproducing.",
            "sent2": "She cherished the simple life of her pet cat, finding joy in its playful activities.",
            "sent3": "The idea of a talking tree came to life in the children's storybook.",
            "sent4": "His passion for music brought new life to the old, abandoned building.",
            "sent5": "The vibrant colors of the sunset painted the sky with the beauty of life."
        },
        {
            "definition": "The existence of an individual human being or animal.",
            "pos": "noun",
            "sent1": "Every life is precious and unique, contributing to the diversity of our world.",
            "sent2": "The veterinarian cared for the injured dog, saving its life with skillful treatment.",
            "sent3": "The life of a detective seemed thrilling in movies, but in reality, it was mostly paperwork.",
            "sent4": "Her laughter filled the room, bringing life to the dull atmosphere.",
            "sent5": "The life of a butterfly is short but filled with grace and beauty."
        },
        {
            "definition": "The period between the birth and death of a living thing.",
            "pos": "noun",
            "sent1": "The cycle of life includes birth, growth, reproduction, and eventually death.",
            "sent2": "He reflected on the milestones in his life, from childhood to old age.",
            "sent3": "The life of a balloon at a party is always short-lived but brings joy to many.",
            "sent4": "Her smile lit up the room, adding brightness to the dullness of everyday life.",
            "sent5": "The changing seasons remind us of the continuous cycle of life in nature."
        },
        {
            "definition": "The state of being alive.",
            "pos": "noun",
            "sent1": "The doctor checked for vital signs to confirm the patient's life.",
            "sent2": "The buzzing of bees indicated the presence of life in the garden.",
            "sent3": "The life of a battery depends on how often it is used and recharged.",
            "sent4": "Her eyes sparkled with life as she talked about her favorite hobby.",
            "sent5": "The chirping of birds in the morning signaled the start of a new day full of life."
        }
    ]
}