{
    "term": "lifers",
    "meanings": [
        {
            "definition": "A person serving a life sentence in prison.",
            "pos": "noun",
            "sent1": "The lifers in the prison yard played cards together every afternoon.",
            "sent2": "The judge sentenced the criminal to join the lifers in jail for the rest of his life.",
            "sent3": "The lifers in the cell next door always argued about who had the best prison food.",
            "sent4": "The lifers behind bars dreamed of the outside world like a distant fantasy.",
            "sent5": "The lifers wore matching uniforms that marked them as prisoners for life."
        },
        {
            "definition": "A person who is sentenced to life imprisonment.",
            "pos": "noun",
            "sent1": "The lifers in the maximum-security prison were closely monitored by guards.",
            "sent2": "The lifers in the news story committed serious crimes and faced life behind bars.",
            "sent3": "The lifers joked about starting a book club in their cell to pass the time.",
            "sent4": "The lifers felt like caged birds with no hope of ever flying free again.",
            "sent5": "The lifers' families visited them regularly, bringing small comforts from the outside world."
        },
        {
            "definition": "A person who spends their entire life in a particular place or situation.",
            "pos": "noun",
            "sent1": "The lifers in the small town knew everyone's business and never left.",
            "sent2": "The lifers in the remote village were content with their simple way of life.",
            "sent3": "The lifers at the retirement home enjoyed daily walks in the garden.",
            "sent4": "The lifers in the mountains felt like they were part of the landscape itself.",
            "sent5": "The lifers in the office cubicles dreamed of exploring the world beyond their desks."
        }
    ]
}