{
    "term": "lifter",
    "meanings": [
        {
            "definition": "A person or thing that lifts.",
            "pos": "noun",
            "sent1": "The lifter easily picked up the box.",
            "sent2": "The lifter at the gym lifted heavy weights.",
            "sent3": "The little robot wanted to be a lifter and help move things around.",
            "sent4": "Her smile was like a lifter, lifting the spirits of everyone around her.",
            "sent5": "The crane was a powerful lifter, hoisting heavy loads effortlessly."
        },
        {
            "definition": "A weightlifter.",
            "pos": "noun",
            "sent1": "The lifter trained hard to compete in the weightlifting competition.",
            "sent2": "The lifter lifted the barbell with ease.",
            "sent3": "The lifter accidentally lifted the wrong weight and surprised everyone.",
            "sent4": "His determination was a lifter, pushing him to lift heavier weights.",
            "sent5": "The lifter's muscles bulged as he lifted the heavy weights."
        },
        {
            "definition": "A device used for lifting heavy objects.",
            "pos": "noun",
            "sent1": "The lifter in the warehouse helped move the heavy crates.",
            "sent2": "The lifter smoothly raised the car for maintenance.",
            "sent3": "The lifter beeped happily as it lifted the furniture effortlessly.",
            "sent4": "The lifter hummed as it lifted the piano to the top floor.",
            "sent5": "The lifter's hydraulic system made it a reliable tool for lifting."
        },
        {
            "definition": "A thief.",
            "pos": "noun",
            "sent1": "The lifter stole the jewels from the museum.",
            "sent2": "The lifter was caught red-handed with the stolen goods.",
            "sent3": "The lifter tried to lift the wallet from the pocket but failed.",
            "sent4": "The lifter's cunning ways made them a successful thief.",
            "sent5": "The lifter's swift hands made them a notorious thief in the city."
        }
    ]
}