{
    "term": "lift",
    "meanings": [
        {
            "definition": "To raise to a higher position",
            "pos": "verb",
            "sent1": "She used her strong arms to lift the heavy box onto the shelf.",
            "sent2": "Can you help me lift this table to the other side of the room?",
            "sent3": "The little girl tried to lift her pet cat, but it was too chubby to move!",
            "sent4": "His encouraging words were like a gentle breeze that lifted her spirits.",
            "sent5": "The hot air balloon slowly began to lift off the ground, carrying its passengers into the sky."
        },
        {
            "definition": "A ride in a vehicle",
            "pos": "noun",
            "sent1": "We took a lift in our friend's car to get to the party on time.",
            "sent2": "The elevator in the building provided a quick lift to the top floor.",
            "sent3": "The lift in the amusement park was so fast, it felt like a thrilling rollercoaster ride!",
            "sent4": "The lift on the ski slope was a welcome break after a long day of skiing.",
            "sent5": "The helicopter gave us a breathtaking lift over the city, revealing a stunning view from above."
        },
        {
            "definition": "An upward force on an object",
            "pos": "noun",
            "sent1": "The helium balloon experienced a lift as it floated up into the sky.",
            "sent2": "The kite soared high in the air, carried by the lift of the wind.",
            "sent3": "The bird's wings caught the lift of the air, allowing it to glide effortlessly.",
            "sent4": "The rocket's engines provided the necessary lift for it to break free from Earth's gravity.",
            "sent5": "The hot air rising from the ground created a natural lift for the glider to ascend."
        },
        {
            "definition": "To steal",
            "pos": "verb",
            "sent1": "The thief tried to lift the wallet from the unsuspecting man's pocket.",
            "sent2": "She caught the shoplifter trying to lift a necklace from the jewelry store.",
            "sent3": "In the movie, the clever cat burglar managed to lift the priceless diamond without getting caught.",
            "sent4": "The pickpocket skillfully lifted the phone from the distracted tourist's bag.",
            "sent5": "The magician's trick involved him seemingly lifting a watch from an audience member's wrist."
        },
        {
            "definition": "A platform or compartment in a building for moving people or goods between floors",
            "pos": "noun",
            "sent1": "We waited for the lift to arrive so we could go up to the tenth floor.",
            "sent2": "The cargo lift in the warehouse made it easy to transport heavy boxes.",
            "sent3": "The lift operator greeted each passenger with a smile as they entered the elevator.",
            "sent4": "The glass lift offered a panoramic view of the city as it ascended to the rooftop.",
            "sent5": "The service lift was used by the hotel staff to deliver fresh linens to each floor efficiently."
        }
    ]
}