{
    "term": "lifted",
    "meanings": [
        {
            "definition": "To raise or elevate to a higher position.",
            "pos": "verb",
            "sent1": "She lifted the heavy box onto the shelf.",
            "sent2": "The crane lifted the car effortlessly.",
            "sent3": "He lifted his spirits by listening to his favorite song.",
            "sent4": "Her smile lifted the gloomy atmosphere in the room.",
            "sent5": "The sun lifted above the horizon, signaling a new day."
        },
        {
            "definition": "To steal or take without permission.",
            "pos": "verb",
            "sent1": "The thief lifted the wallet from the unsuspecting man.",
            "sent2": "She lifted a candy bar from the store without paying.",
            "sent3": "The mischievous raccoon lifted the picnic basket when no one was looking.",
            "sent4": "The magician lifted the watch from the volunteer's wrist without them noticing.",
            "sent5": "The pickpocket skillfully lifted the keys from the distracted tourist."
        },
        {
            "definition": "To improve or enhance.",
            "pos": "verb",
            "sent1": "Adding fresh herbs lifted the flavor of the dish.",
            "sent2": "The new paint color lifted the appearance of the room.",
            "sent3": "A good night's sleep can lift your mood for the whole day.",
            "sent4": "The motivational speech lifted the team's morale before the big game.",
            "sent5": "The uplifting music lifted everyone's spirits at the concert."
        },
        {
            "definition": "To feel elated or uplifted.",
            "pos": "verb",
            "sent1": "She lifted with joy when she received the good news.",
            "sent2": "The children's laughter lifted his heart.",
            "sent3": "Winning the competition lifted his confidence to new heights.",
            "sent4": "The unexpected compliment lifted her spirits instantly.",
            "sent5": "The beautiful sunset view lifted his soul and filled him with peace."
        }
    ]
}