{
    "term": "lifters",
    "meanings": [
        {
            "definition": "A person or thing that lifts or raises something.",
            "pos": "noun",
            "sent1": "The strong lifters at the gym helped me with my heavy boxes.",
            "sent2": "The crane was a powerful lifter, hoisting the heavy cargo effortlessly.",
            "sent3": "The lifters in the superhero movie could raise buildings with ease.",
            "sent4": "Her positive words were lifters, lifting the spirits of everyone around her.",
            "sent5": "The lifters in the construction site were like giants, effortlessly moving heavy beams."
        },
        {
            "definition": "A weightlifter or someone who lifts weights.",
            "pos": "noun",
            "sent1": "The champion lifter broke a new record at the weightlifting competition.",
            "sent2": "Weightlifters train hard to become strong lifters and win competitions.",
            "sent3": "The weightlifter's pet cat was also a lifter, lifting small toys with its paws.",
            "sent4": "Her determination was a lifter, helping her overcome any obstacles in her path.",
            "sent5": "The lifter's muscles bulged as he effortlessly lifted the heavy barbell."
        },
        {
            "definition": "A device used for lifting heavy objects.",
            "pos": "noun",
            "sent1": "The hydraulic lifter smoothly raised the car for maintenance.",
            "sent2": "The lifter in the garage made it easy to lift heavy engines.",
            "sent3": "The lifter in the warehouse had a mind of its own, lifting boxes when no one was looking.",
            "sent4": "The lifter in the factory worked tirelessly, lifting heavy loads day in and day out.",
            "sent5": "The lifter's mechanism was so efficient, it could lift tons of weight effortlessly."
        },
        {
            "definition": "A component in an engine that raises the valves.",
            "pos": "noun",
            "sent1": "The mechanic adjusted the lifters in the engine to improve performance.",
            "sent2": "The lifter in the car engine ensured smooth operation of the valves.",
            "sent3": "The mischievous gremlin in the engine liked to play with the lifters, causing the valves to malfunction.",
            "sent4": "The lifter in the engine was like a conductor, orchestrating the movement of the valves.",
            "sent5": "The lifter's role in the engine was crucial, ensuring proper airflow and combustion."
        }
    ]
}