{
    "term": "ligan",
    "meanings": [
        {
            "definition": "A person who is skilled in deception or manipulation.",
            "pos": "noun",
            "sent1": "The ligan was able to trick everyone with their clever lies.",
            "sent2": "She was known as the neighborhood ligan for always finding a way to get what she wanted.",
            "sent3": "The ligan managed to convince the cat that the toy mouse was real.",
            "sent4": "His smooth talking made him a ligan in the world of sales.",
            "sent5": "Beware of the ligan who can make you believe anything they say."
        },
        {
            "definition": "To deceive or trick someone.",
            "pos": "verb",
            "sent1": "He tried to ligan his way out of trouble by making up a story.",
            "sent2": "The magician used sleight of hand to ligan the audience during the show.",
            "sent3": "She decided to ligan her friends by pretending to be a famous celebrity.",
            "sent4": "The scam artist would ligan unsuspecting victims out of their money.",
            "sent5": "The fox used its cunning to ligan the rabbit into coming closer."
        },
        {
            "definition": "A rope or cord used for fastening or securing something.",
            "pos": "noun",
            "sent1": "The sailor grabbed the ligan to tie the boat to the dock.",
            "sent2": "She always carried a sturdy ligan in her backpack for emergencies.",
            "sent3": "The mischievous kitten played with the ligan, thinking it was a toy.",
            "sent4": "The mountaineer relied on the ligan to keep them safe during the climb.",
            "sent5": "The cowboy skillfully handled the ligan to secure the gate shut."
        },
        {
            "definition": "To fasten or secure something with a rope or cord.",
            "pos": "verb",
            "sent1": "He needed to ligan the boxes together to prevent them from falling.",
            "sent2": "She decided to ligan the tent to the tree to keep it from blowing away.",
            "sent3": "The chef had to ligan the cabinets closed to prevent the ingredients from spilling.",
            "sent4": "The explorer had to ligan the supplies tightly to the pack animal.",
            "sent5": "The gardener used the ligan to tie the plants to stakes for support."
        }
    ]
}