{
    "term": "lightering",
    "meanings": [
        {
            "definition": "The act of transferring cargo from one vessel to another",
            "pos": "noun",
            "sent1": "The lightering of goods between ships is essential for efficient transport.",
            "sent2": "The lightering operation was completed smoothly, ensuring the cargo reached its destination on time.",
            "sent3": "During the lightering process, the crew realized they had accidentally swapped the cargo with a shipment of rubber ducks!",
            "sent4": "The lightering of responsibilities from one team member to another helped balance the workload effectively.",
            "sent5": "In the busy port, the lightering of containers created a mesmerizing dance of cranes and ships."
        },
        {
            "definition": "The process of lightening a ship by removing some of its cargo",
            "pos": "noun",
            "sent1": "After the lightering, the ship was able to navigate through the shallow waters more easily.",
            "sent2": "The captain decided on lightering to ensure the safety of the vessel during the storm.",
            "sent3": "During the lightering operation, the crew accidentally dropped a crate of bananas into the sea!",
            "sent4": "The lightering of excess weight made the ship feel as light as a feather on the waves.",
            "sent5": "The lightering process revealed hidden compartments in the ship, much to everyone's surprise."
        },
        {
            "definition": "The practice of using smaller boats to transport goods to and from larger ships",
            "pos": "noun",
            "sent1": "The lightering of supplies from the main ship to the shore was done swiftly by the skilled crew.",
            "sent2": "Lightering is a common sight in busy harbors where large vessels cannot dock directly.",
            "sent3": "During the lightering operation, the crew had a friendly race to see who could transport the most goods in one trip.",
            "sent4": "The lightering boats moved gracefully between the ships like busy worker bees in a hive.",
            "sent5": "The lightering of goods at sea resembled a carefully choreographed ballet, with each boat playing its part perfectly."
        }
    ]
}