{
    "term": "light",
    "meanings": [
        {
            "definition": "The natural agent that stimulates sight and makes things visible.",
            "pos": "noun",
            "sent1": "The soft light of the moon illuminated the path through the forest.",
            "sent2": "The room was filled with light from the bright morning sun.",
            "sent3": "Why did the light refuse to play hide and seek? Because it always shines!",
            "sent4": "Her smile was like a light in the darkness, bringing warmth and joy to all around her.",
            "sent5": "The lighthouse beam cut through the fog, guiding ships safely to shore."
        },
        {
            "definition": "The brightness that comes from the sun, fire, or a lamp.",
            "pos": "noun",
            "sent1": "The flickering light of the campfire danced in the night sky.",
            "sent2": "She turned on the light to brighten up the room.",
            "sent3": "Why did the light bulb go to school? To get brighter!",
            "sent4": "The light of dawn painted the sky in hues of pink and orange.",
            "sent5": "The streetlights cast a warm glow on the quiet street."
        },
        {
            "definition": "To illuminate a space.",
            "pos": "verb",
            "sent1": "She used a flashlight to light up the dark basement.",
            "sent2": "The candles were lit to light the room during the power outage.",
            "sent3": "Why did the matchstick break up with the candle? It couldn't handle the flame!",
            "sent4": "His words were able to light up her face with a smile.",
            "sent5": "The fireworks lit up the night sky with bursts of color."
        },
        {
            "definition": "Not heavy; easy to lift or carry.",
            "pos": "adjective",
            "sent1": "The light bag was comfortable to carry on the hike.",
            "sent2": "She chose the lightest suitcase for her travels.",
            "sent3": "Why did the feather challenge the rock to a race? Because it was feeling light on its feet!",
            "sent4": "His heart felt light as a feather after he forgave his friend.",
            "sent5": "The balloon floated effortlessly in the light breeze."
        }
    ]
}