{
    "term": "lighters",
    "meanings": [
        {
            "definition": "A device used to produce a flame for lighting cigarettes or candles.",
            "pos": "noun",
            "sent1": "I always carry my lighters with me to light up candles during power outages.",
            "sent2": "She reached for the lighters on the table to light her cigarette.",
            "sent3": "The lighters in his pocket were like tiny fire starters waiting to be used.",
            "sent4": "Her collection of lighters was a colorful array of flame creators.",
            "sent5": "The lighters flickered to life, illuminating the dark room with a warm glow."
        },
        {
            "definition": "A person or thing that ignites or kindles something.",
            "pos": "noun",
            "sent1": "He was the lighters of creativity in our group, always sparking new ideas.",
            "sent2": "The sun is the ultimate lighters of life on Earth, providing warmth and light.",
            "sent3": "The chef was a master lighters, turning simple ingredients into gourmet dishes.",
            "sent4": "Her smile was the lighters that brightened up his gloomy day.",
            "sent5": "Music has always been a powerful lighters of emotions, stirring hearts and souls."
        },
        {
            "definition": "A ship or aircraft used to transfer cargo to and from larger vessels.",
            "pos": "noun",
            "sent1": "The lighters docked next to the massive cargo ship, ready to unload its goods.",
            "sent2": "The lighters efficiently transported supplies between the shore and the larger vessel.",
            "sent3": "The lighters bobbed on the waves, a tiny helper to the huge ships in the harbor.",
            "sent4": "The lighters buzzed with activity as workers loaded and unloaded cargo.",
            "sent5": "The lighters navigated through the busy port, a vital link in the transportation chain."
        }
    ]
}