{
    "term": "lights",
    "meanings": [
        {
            "definition": "Something that makes things visible or affords illumination.",
            "pos": "noun",
            "sent1": "The room was dark until I turned on the lights.",
            "sent2": "The streetlights came on as the sun set.",
            "sent3": "The lights in the theater flickered, adding to the suspense of the play.",
            "sent4": "Her smile lit up the room like a string of twinkling lights.",
            "sent5": "The lights of the city at night were like a blanket of stars."
        },
        {
            "definition": "A source of light, especially a lamp, a lantern, or an electric lighting fixture.",
            "pos": "noun",
            "sent1": "Grandma's antique lights added a cozy glow to the room.",
            "sent2": "The lighthouse beacon guided ships safely to shore.",
            "sent3": "The camping trip was saved by the portable lights we brought along.",
            "sent4": "The chandelier in the ballroom sparkled like a cascade of crystal lights.",
            "sent5": "The lights on the Christmas tree twinkled merrily in the living room."
        },
        {
            "definition": "The sensation produced by stimulation of the visual receptors in the eyes.",
            "pos": "noun",
            "sent1": "The bright lights of the city dazzled her eyes.",
            "sent2": "The flashing lights of the police car caught everyone's attention.",
            "sent3": "The disco lights made the dance floor feel like a magical place.",
            "sent4": "Her eyes sparkled with excitement under the stage lights.",
            "sent5": "The lights of the fireworks display painted the night sky with color."
        },
        {
            "definition": "The lungs, especially of sheep, pigs, etc., used as food, typically prepared for cooking by smoking.",
            "pos": "noun",
            "sent1": "The chef prepared a delicious dish using smoked lights.",
            "sent2": "The traditional recipe called for seasoning the lights with herbs.",
            "sent3": "The unique flavor of the lights surprised the dinner guests.",
            "sent4": "The aroma of the smoked lights filled the kitchen with a savory scent.",
            "sent5": "The tender lights melted in your mouth with each bite."
        }
    ]
}