{
    "term": "ligne",
    "meanings": [
        {
            "definition": "A unit of measurement equal to 1/12 of an inch",
            "pos": "noun",
            "sent1": "She measured the fabric using a ligne to ensure accuracy.",
            "sent2": "The ruler had markings in inches, centimeters, and lignes.",
            "sent3": "The tailor accidentally cut the cloth at the wrong ligne, making the dress too short.",
            "sent4": "The ligne on the ruler seemed to stretch longer as she focused intently on it.",
            "sent5": "The precision of the ligne measurement was crucial for the carpenter's project."
        },
        {
            "definition": "A line or stroke in drawing or engraving",
            "pos": "noun",
            "sent1": "The artist carefully added a ligne to define the edge of the painting.",
            "sent2": "The calligrapher's work was admired for its intricate lignes and curves.",
            "sent3": "The cat left a ligne of muddy paw prints across the clean floor.",
            "sent4": "Her words cut through his defenses like a sharp ligne on a canvas.",
            "sent5": "The ligne in the sketch brought life and movement to the otherwise still image."
        },
        {
            "definition": "A type of French fishing line",
            "pos": "noun",
            "sent1": "The fisherman cast his ligne into the sparkling waters of the lake.",
            "sent2": "The old man's favorite pastime was repairing his fishing lignes by the dock.",
            "sent3": "The mischievous seagull swooped down and stole the ligne from the angler's hand.",
            "sent4": "The ligne danced in the wind as the fisherman reeled in his catch.",
            "sent5": "The strength of the ligne was tested by the weight of the struggling fish."
        },
        {
            "definition": "A type of French currency in the 18th century",
            "pos": "noun",
            "sent1": "In the historical market, traders exchanged goods for lignes and livres.",
            "sent2": "The wealthy merchant displayed his collection of rare lignes in a velvet pouch.",
            "sent3": "The pickpocket's eyes gleamed at the sight of the ligne purse left unattended.",
            "sent4": "The value of the ligne fluctuated greatly during times of war and peace.",
            "sent5": "The intricate designs on the lignes reflected the artistry of the era."
        }
    ]
}