{
    "term": "like",
    "meanings": [
        {
            "definition": "Having similar characteristics or qualities to something else.",
            "pos": "adjective",
            "sent1": "The two flowers look like each other.",
            "sent2": "She picked a dress she liked for the party.",
            "sent3": "It's funny how the twins are so much alike.",
            "sent4": "The sunset painted the sky in colors like a masterpiece.",
            "sent5": "The puzzle pieces fit together perfectly, just like twins."
        },
        {
            "definition": "Enjoying or finding something agreeable.",
            "pos": "adjective",
            "sent1": "He felt like a kid again on the rollercoaster.",
            "sent2": "The children were happy playing in the park, just like the adults.",
            "sent3": "Eating ice cream on a cold day may seem strange, but it tastes like happiness.",
            "sent4": "Her laughter was like music to his ears.",
            "sent5": "The warm sun on her face felt like a gentle hug."
        },
        {
            "definition": "In the manner of; as if.",
            "pos": "adverb",
            "sent1": "She ran like the wind to catch the bus.",
            "sent2": "The cat moved stealthily, like a ninja.",
            "sent3": "He danced around the room like a graceful swan.",
            "sent4": "The news spread like wildfire through the small town.",
            "sent5": "The leaves rustled in the wind like whispers in the night."
        },
        {
            "definition": "To feel attraction or affection towards someone.",
            "pos": "verb",
            "sent1": "She really likes her new friend from school.",
            "sent2": "He likes to spend time with his grandparents.",
            "sent3": "The puppy likes to follow its owner everywhere.",
            "sent4": "The cat likes to curl up on the warm blanket.",
            "sent5": "The baby likes to giggle when tickled."
        },
        {
            "definition": "To use 'like' as a preposition to indicate similarity.",
            "pos": "verb",
            "sent1": "She dresses like a movie star for the event.",
            "sent2": "He acts like a superhero when playing with his toys.",
            "sent3": "The clouds look like fluffy cotton candy in the sky.",
            "sent4": "The waves crash against the shore like a fierce beast.",
            "sent5": "The mountain range stretches out like a sleeping giant."
        }
    ]
}