{
    "term": "limey",
    "meanings": [
        {
            "definition": "A British person",
            "pos": "noun",
            "sent1": "The limey greeted me with a smile.",
            "sent2": "I met a limey at the store yesterday.",
            "sent3": "Why did the limey bring a teapot to the party?",
            "sent4": "The limey stood out in a sea of faces.",
            "sent5": "The limey's accent was charming and distinct."
        },
        {
            "definition": "Containing or resembling lime",
            "pos": "adjective",
            "sent1": "The limey drink had a tangy taste.",
            "sent2": "The walls were painted in a limey shade.",
            "sent3": "The limey-colored car looked like a giant lime.",
            "sent4": "Her limey personality brightened up the room.",
            "sent5": "The limey scent filled the air with freshness."
        },
        {
            "definition": "A type of citrus fruit",
            "pos": "noun",
            "sent1": "She squeezed a limey over the fish.",
            "sent2": "The cocktail was garnished with a limey wedge.",
            "sent3": "The limey rolled off the kitchen counter and onto the floor.",
            "sent4": "The tangy juice of the limey tickled my taste buds.",
            "sent5": "The limey added a zesty kick to the dish."
        },
        {
            "definition": "A type of mortar made from lime and sand",
            "pos": "noun",
            "sent1": "The builders mixed the limey for the construction.",
            "sent2": "The old walls were repaired using limey.",
            "sent3": "The limey crumbled under the weight of the bricks.",
            "sent4": "The smell of fresh limey filled the air at the construction site.",
            "sent5": "The limey held the bricks together firmly."
        },
        {
            "definition": "A type of greenish-yellow color",
            "pos": "noun",
            "sent1": "Her dress was a vibrant limey.",
            "sent2": "The walls were painted in a soft limey hue.",
            "sent3": "The limey paint brightened up the room instantly.",
            "sent4": "The limey glow of the sunset painted the sky.",
            "sent5": "The limey color reminded me of fresh lemons."
        }
    ]
}