{
    "term": "limes",
    "meanings": [
        {
            "definition": "A small, round green citrus fruit.",
            "pos": "noun",
            "sent1": "I love to eat limes with my tacos.",
            "sent2": "The recipe calls for a squeeze of fresh limes.",
            "sent3": "Why did the lemon go to the party with the lime? Because they make a great pair of fruits!",
            "sent4": "Her bright green dress was as vibrant as a basket of limes.",
            "sent5": "The scent of freshly cut limes filled the kitchen with a refreshing aroma."
        },
        {
            "definition": "A type of tree that produces limes.",
            "pos": "noun",
            "sent1": "The limes on the tree were ripe and ready to be picked.",
            "sent2": "The farmer planted a new lime tree in the orchard.",
            "sent3": "Why did the orange tree want to be friends with the lime tree? Because they both liked to branch out!",
            "sent4": "The lime tree stood tall in the garden, bearing fruit like a generous host.",
            "sent5": "The leaves of the lime tree rustled in the breeze, creating a soothing sound."
        },
        {
            "definition": "A greenish-yellow color.",
            "pos": "noun",
            "sent1": "She painted her room in a lovely shade of limes.",
            "sent2": "The artist mixed yellow and green to create a beautiful lime color.",
            "sent3": "Why did the traffic light turn limes instead of red? It wanted to be more refreshing!",
            "sent4": "The sunset painted the sky in hues of limes and oranges.",
            "sent5": "The fields were bathed in the soft light of the setting sun, casting a lime glow over everything."
        },
        {
            "definition": "A hard, white substance used in building.",
            "pos": "noun",
            "sent1": "The sculptor carved intricate designs into the limes.",
            "sent2": "The architect chose limes for the elegant pillars of the building.",
            "sent3": "Why did the marble statue want to be friends with the limes? Because they were both rock solid!",
            "sent4": "The palace was adorned with limes that gleamed like polished ivory.",
            "sent5": "The steps of the grand staircase were made of limes, adding a touch of sophistication to the entrance."
        }
    ]
}