{
    "term": "lime",
    "meanings": [
        {
            "definition": "A small, green citrus fruit",
            "pos": "noun",
            "sent1": "I love the tangy taste of lime in my drink.",
            "sent2": "She squeezed some lime juice over the salad for extra flavor.",
            "sent3": "The lime rolled off the table and onto the floor, causing a funny chase.",
            "sent4": "Her eyes sparkled like the vibrant green of a lime in the sunlight.",
            "sent5": "The scent of fresh lime filled the kitchen, making my mouth water."
        },
        {
            "definition": "A white, alkaline substance used in building materials",
            "pos": "noun",
            "sent1": "The workers mixed the lime with water to create a strong mortar.",
            "sent2": "The ancient Romans used lime in their construction projects.",
            "sent3": "The mischievous kids drew smiley faces on the bags of lime.",
            "sent4": "The walls glowed with a pale hue, reminiscent of the color of lime.",
            "sent5": "The dust from the lime powder settled on their clothes, leaving a chalky residue."
        },
        {
            "definition": "A type of tree that produces small, green citrus fruits",
            "pos": "noun",
            "sent1": "The lime tree in our backyard is full of ripe fruits.",
            "sent2": "The fragrance of the blossoming lime tree filled the garden.",
            "sent3": "The squirrels played hide-and-seek among the branches of the lime tree.",
            "sent4": "The leaves of the lime tree danced in the gentle breeze, casting dappled shadows.",
            "sent5": "The ripe limes hung from the branches like little green ornaments."
        },
        {
            "definition": "A bright green color",
            "pos": "noun",
            "sent1": "Her dress was a vibrant lime green that caught everyone's attention.",
            "sent2": "The artist mixed yellow and green to create the perfect shade of lime.",
            "sent3": "The lime of the grass in the park seemed to glow under the setting sun.",
            "sent4": "His eyes sparkled with a hint of lime, reflecting his excitement.",
            "sent5": "The room was painted in a refreshing lime color, brightening up the space."
        },
        {
            "definition": "To treat with lime or a lime mixture",
            "pos": "verb",
            "sent1": "The farmer decided to lime the soil before planting the crops.",
            "sent2": "She carefully limed the walls to protect them from moisture.",
            "sent3": "The chef limed the fish to enhance its flavor before grilling.",
            "sent4": "The gardener limed the trees to prevent pests from damaging them.",
            "sent5": "He limed the wooden fence to give it a weather-resistant finish."
        }
    ]
}