{
    "term": "line",
    "meanings": [
        {
            "definition": "A long, narrow mark or band.",
            "pos": "noun",
            "sent1": "I drew a straight line on the paper.",
            "sent2": "The line for the bus was very long.",
            "sent3": "The line of ants marching across the floor was like a tiny parade.",
            "sent4": "Her smile was as bright as a line of sunshine breaking through the clouds.",
            "sent5": "The line etched into the rock was a permanent reminder of the ancient civilization."
        },
        {
            "definition": "A row of people or things.",
            "pos": "noun",
            "sent1": "The students stood in a line to board the school bus.",
            "sent2": "The line of trees along the path provided shade from the sun.",
            "sent3": "The line of ducks waddling behind their mother was a comical sight.",
            "sent4": "The stars in the sky formed a perfect line across the horizon.",
            "sent5": "The line of books on the shelf stretched from one end to the other."
        },
        {
            "definition": "A direction or course of movement.",
            "pos": "noun",
            "sent1": "Follow the line on the map to reach the treasure.",
            "sent2": "The line of cars moved slowly through the traffic jam.",
            "sent3": "The line of dancers swirled gracefully across the dance floor.",
            "sent4": "The line of birds in the sky pointed towards the setting sun.",
            "sent5": "The line of ants marched steadily towards their anthill."
        },
        {
            "definition": "A connected series of people or things.",
            "pos": "noun",
            "sent1": "The line of dominoes fell one after the other.",
            "sent2": "The line of events led to a surprising conclusion.",
            "sent3": "The line of cars stretched for miles on the highway.",
            "sent4": "The line of notes in the melody created a beautiful harmony.",
            "sent5": "The line of footprints in the sand showed the path taken by the hikers."
        },
        {
            "definition": "A boundary or limit.",
            "pos": "noun",
            "sent1": "The fence marked the line between our yard and the neighbor's.",
            "sent2": "The finish line of the race was just ahead.",
            "sent3": "The line between right and wrong can sometimes be blurry.",
            "sent4": "The line of the horizon seemed to merge sky and sea into one.",
            "sent5": "The line where the colors meet creates a beautiful gradient in the painting."
        }
    ]
}