{
    "term": "linstocks",
    "meanings": [
        {
            "definition": "A wooden support for holding fire-making materials",
            "pos": "noun",
            "sent1": "The scout gathered dry leaves and twigs to place on the linstocks for starting the campfire.",
            "sent2": "The linstocks were neatly arranged next to the fireplace for easy access.",
            "sent3": "The squirrel mistook the linstocks for a cozy bed and tried to nest in them.",
            "sent4": "Her creativity was like linstocks, always ready to ignite a spark of inspiration.",
            "sent5": "The linstocks stood tall, ready to serve their purpose in lighting up the night."
        },
        {
            "definition": "A type of gun carriage used in the 17th century",
            "pos": "noun",
            "sent1": "The soldiers wheeled the heavy linstocks into position for the upcoming battle.",
            "sent2": "The linstocks were essential for transporting the cannons across rough terrain.",
            "sent3": "The children played pretend, using sticks as linstocks for their imaginary cannons.",
            "sent4": "In the museum, the linstocks were displayed alongside the antique firearms.",
            "sent5": "The linstocks creaked as they rolled, echoing the history of battles fought long ago."
        },
        {
            "definition": "To load a gun with linstocks",
            "pos": "verb",
            "sent1": "The soldier carefully linstocks the cannon before aiming at the target.",
            "sent2": "She quickly linstocks the rifle, preparing for the shooting competition.",
            "sent3": "The pirate captain jokingly linstocks his water gun before the playful water fight.",
            "sent4": "He linstocks the toy bow with an arrow, pretending to be an archer in the backyard.",
            "sent5": "With precision, she linstocks the paintball gun, ready to splatter colors in the game."
        }
    ]
}