{
    "term": "lionised",
    "meanings": [
        {
            "definition": "To treat someone as a celebrity or idol.",
            "pos": "verb",
            "sent1": "At the party, the guests lionised the famous actor, asking for autographs and photos.",
            "sent2": "The singer was lionised by fans wherever she went, with people clamoring to get a glimpse of her.",
            "sent3": "The little girl lionised her pet hamster, dressing it up in tiny outfits and showing it off to her friends.",
            "sent4": "The local hero was lionised by the community, his name becoming synonymous with bravery and selflessness.",
            "sent5": "The teacher lionised the student who won the science fair, praising their hard work and dedication."
        },
        {
            "definition": "To give someone a lot of attention and admiration.",
            "pos": "verb",
            "sent1": "The artist was lionised by art critics for his unique style and creativity.",
            "sent2": "The young actress was lionised by the media, with magazines featuring her on their covers.",
            "sent3": "The cat lionised the new scratching post, spending hours sharpening its claws on it.",
            "sent4": "The chef was lionised by food enthusiasts for his innovative dishes and culinary skills.",
            "sent5": "The athlete was lionised by sports fans for his record-breaking performances on the field."
        },
        {
            "definition": "To make someone famous or well-known.",
            "pos": "verb",
            "sent1": "The reality show lionised its contestants, turning them into household names overnight.",
            "sent2": "The viral video lionised the young musician, propelling her to stardom in a matter of days.",
            "sent3": "The toddler lionised his favorite toy, carrying it everywhere and showing it to everyone he met.",
            "sent4": "The company's marketing campaign lionised their new product, attracting a large customer base.",
            "sent5": "The author was lionised by readers around the world, with her books becoming bestsellers in multiple countries."
        }
    ]
}