{
    "term": "lionizers",
    "meanings": [
        {
            "definition": "those who admire or worship someone or something.",
            "pos": "noun",
            "sent1": "The lionizers gathered outside the actor's house, hoping for a glimpse of their favorite star.",
            "sent2": "She became one of the lionizers after meeting the famous singer in person.",
            "sent3": "The lionizers cheered loudly at the concert, showing their love for the band.",
            "sent4": "Her friends jokingly called themselves the lionizers of the local coffee shop owner.",
            "sent5": "The lionizers' devotion to the author was unmatched, with some even traveling long distances to attend book signings."
        },
        {
            "definition": "to treat someone as a celebrity or idol.",
            "pos": "verb",
            "sent1": "The media often lionizers famous athletes, putting them on a pedestal.",
            "sent2": "She lionizers her favorite actress by collecting all her movies and posters.",
            "sent3": "He lionizers his pet cat, treating it like royalty in the house.",
            "sent4": "The company lionizers its CEO, praising every decision he makes.",
            "sent5": "The teacher lionizers students who show dedication and hard work in their studies."
        },
        {
            "definition": "the act of praising or glorifying someone excessively.",
            "pos": "noun",
            "sent1": "The lionizers of the singer flooded social media with compliments and adoration.",
            "sent2": "Her constant lionizers of the politician made some people question her judgment.",
            "sent3": "The lionizers at the award ceremony went overboard with their loud cheers and applause.",
            "sent4": "The artist's work received lionizers from critics and fans alike.",
            "sent5": "The lionizers of the chef's cooking show eagerly awaited each new episode, ready to shower him with praise."
        }
    ]
}