{
    "term": "lipos",
    "meanings": [
        {
            "definition": "A combining form meaning \"fat\" or \"fatty.\"",
            "pos": "noun",
            "sent1": "The doctor explained that \"lipos\" is used in medical terms to refer to fat.",
            "sent2": "When cooking, it's important to consider the amount of \"lipos\" in the ingredients.",
            "sent3": "I accidentally spilled some \"lipos\" from the frying pan, creating a greasy mess.",
            "sent4": "Her cheeks were so full, they resembled \"lipos\" balloons ready to burst.",
            "sent5": "The overflowing plate of food was a testament to the abundance of \"lipos\" in the meal."
        },
        {
            "definition": "A surgical procedure to remove excess fat from the body.",
            "pos": "noun",
            "sent1": "After the \"lipos\" surgery, she felt lighter and more confident.",
            "sent2": "Many people opt for \"lipos\" to achieve their desired body shape.",
            "sent3": "The comedian joked that he needed a \"lipos\" session after the holiday feasting.",
            "sent4": "The city skyline underwent a \"lipos\" procedure, removing the excess buildings.",
            "sent5": "The before-and-after photos showcased the dramatic results of the \"lipos\" operation."
        },
        {
            "definition": "A type of lipid molecule.",
            "pos": "noun",
            "sent1": "The scientist studied the structure of the \"lipos\" molecule under the microscope.",
            "sent2": "In biology class, we learned about the role of \"lipos\" in cellular membranes.",
            "sent3": "The detective identified the suspect by analyzing the traces of \"lipos\" found at the crime scene.",
            "sent4": "The river was described as a flowing stream of \"lipos\" molecules, essential for life.",
            "sent5": "Under the UV light, the \"lipos\" molecules emitted a faint glow, revealing their presence."
        }
    ]
}