{
    "term": "liquations",
    "meanings": [
        {
            "definition": "The process of melting or purifying a substance by heating it.",
            "pos": "noun",
            "sent1": "During the chemistry experiment, we observed the liquations of the solid into a liquid state.",
            "sent2": "The blacksmith used liquations to extract pure metal from the ore.",
            "sent3": "The liquations of the chocolate in the microwave turned it into a gooey mess!",
            "sent4": "Her anger bubbled up inside her like the liquations of a volcano.",
            "sent5": "The liquations of the ice cream under the hot sun created a sticky puddle on the sidewalk."
        },
        {
            "definition": "The act of separating metals from their ores by heating them to a liquid state.",
            "pos": "noun",
            "sent1": "Miners use liquations to extract valuable metals from rocks.",
            "sent2": "The ancient alchemists believed in the power of liquations to reveal the hidden properties of metals.",
            "sent3": "The liquations of the gold from the ore sparkled like magic in the firelight.",
            "sent4": "Her tears flowed freely, like the liquations of precious metals in a furnace.",
            "sent5": "The liquations of the silver ore produced a gleaming pool of molten metal."
        },
        {
            "definition": "The act of becoming liquid or melting.",
            "pos": "noun",
            "sent1": "The liquations of the ice cream cone made it a messy treat to enjoy.",
            "sent2": "In the summer heat, the liquations of the popsicle were a welcome refreshment.",
            "sent3": "The liquations of the candle wax created colorful patterns as it dripped down the side.",
            "sent4": "His heart felt like it was undergoing liquations as he watched her walk away.",
            "sent5": "The liquations of the snow under the warm sun turned the landscape into a watery wonderland."
        }
    ]
}