{
    "term": "lis",
    "meanings": [
        {
            "definition": "A small, narrow strip of fabric or ribbon",
            "pos": "noun",
            "sent1": "She tied a colorful lis around the gift box.",
            "sent2": "The tailor used a delicate lis to embellish the dress.",
            "sent3": "The lis fluttered in the wind like a tiny flag.",
            "sent4": "Her hair was adorned with a lis, adding a touch of elegance.",
            "sent5": "The lis shimmered under the sunlight, catching everyone's eye."
        },
        {
            "definition": "A list or catalogue, especially of names or items",
            "pos": "noun",
            "sent1": "He checked the lis to see if his name was included.",
            "sent2": "The teacher handed out a lis of homework assignments.",
            "sent3": "The lis of ingredients for the recipe seemed never-ending.",
            "sent4": "Her mind was like a lis, filled with memories of the past.",
            "sent5": "The lis on the bulletin board helped everyone stay organized."
        },
        {
            "definition": "A type of medieval coin",
            "pos": "noun",
            "sent1": "The merchant exchanged goods for a shiny lis.",
            "sent2": "Collectors sought after the rare lis for their collections.",
            "sent3": "He found a lis buried in the backyard, a hidden treasure.",
            "sent4": "The lis gleamed in the candlelight, revealing its ancient origins.",
            "sent5": "The lis was passed down through generations, a symbol of wealth."
        },
        {
            "definition": "A genus of plants in the lily family",
            "pos": "noun",
            "sent1": "The lis in the garden bloomed with vibrant colors.",
            "sent2": "She carefully tended to the lis, ensuring they thrived.",
            "sent3": "The lis swayed gracefully in the gentle breeze.",
            "sent4": "The lis symbolized purity and beauty in many cultures.",
            "sent5": "The fragrance of the lis filled the air, creating a peaceful atmosphere."
        }
    ]
}