{
    "term": "little",
    "meanings": [
        {
            "definition": "Small in size",
            "pos": "adjective",
            "sent1": "The puppy was very little compared to the big dog.",
            "sent2": "She wore a little dress to the party.",
            "sent3": "The little mouse tried to reach the cheese on the table.",
            "sent4": "In the vast forest, the little flower stood out like a tiny jewel.",
            "sent5": "The little toy car fit perfectly in his pocket."
        },
        {
            "definition": "Not much",
            "pos": "adverb",
            "sent1": "He ate very little of his dinner.",
            "sent2": "There is little time left before the movie starts.",
            "sent3": "The squirrel found little nuts to store for winter.",
            "sent4": "She had little patience for waiting in line.",
            "sent5": "The teacher had little doubt about the student's success."
        },
        {
            "definition": "Young",
            "pos": "adjective",
            "sent1": "The little chick just hatched from its egg.",
            "sent2": "The little boy played happily in the park.",
            "sent3": "The little kitten purred as it cuddled with its owner.",
            "sent4": "The little ducklings followed their mother closely.",
            "sent5": "The little plant grew quickly in the sunlight."
        },
        {
            "definition": "Slightly",
            "pos": "adverb",
            "sent1": "She was little nervous before her presentation.",
            "sent2": "The music was a little too loud for his liking.",
            "sent3": "He felt a little chilly in the cool breeze.",
            "sent4": "The cake was a little dry but still tasty.",
            "sent5": "The room was a little messy after the party."
        },
        {
            "definition": "Short period of time",
            "pos": "noun",
            "sent1": "I'll be back in a little while.",
            "sent2": "Wait here for a little longer.",
            "sent3": "He took a little break from studying to relax.",
            "sent4": "She needed a little time to think about the decision.",
            "sent5": "The meeting will only take a little bit of your day."
        }
    ]
}