{
    "term": "lively",
    "meanings": [
        {
            "definition": "Full of life and energy",
            "pos": "adjective",
            "sent1": "The puppy was so lively, always running and playing.",
            "sent2": "The children at the party were very lively, laughing and dancing.",
            "sent3": "The lively squirrel kept darting around the yard, entertaining everyone.",
            "sent4": "Her lively imagination painted colorful pictures in her mind.",
            "sent5": "The lively music filled the room, making everyone want to dance."
        },
        {
            "definition": "Quick and active",
            "pos": "adjective",
            "sent1": "The squirrel was so lively, darting from tree to tree.",
            "sent2": "The athlete was very lively on the field, moving swiftly and decisively.",
            "sent3": "The lively rabbit outran all the other animals in the race.",
            "sent4": "His lively mind processed information at lightning speed.",
            "sent5": "The lively wind rustled the leaves, creating a sense of urgency."
        },
        {
            "definition": "Bright and vivid",
            "pos": "adjective",
            "sent1": "The painting was so lively, with vibrant colors that popped.",
            "sent2": "The flowers in the garden looked lively under the bright sun.",
            "sent3": "Her lively dress caught everyone's attention with its bold patterns.",
            "sent4": "The lively sunset painted the sky in hues of orange and pink.",
            "sent5": "The lively rainbow arched across the sky, bringing joy to all who saw it."
        },
        {
            "definition": "Brisk and animated",
            "pos": "adjective",
            "sent1": "The conversation was so lively, with everyone talking and laughing.",
            "sent2": "The market was bustling with lively activity, people buying and selling.",
            "sent3": "The lively debate kept the audience engaged and entertained.",
            "sent4": "Her lively gestures emphasized her passionate speech.",
            "sent5": "The lively crowd cheered as the parade passed by, full of excitement."
        }
    ]
}