{
    "term": "livery",
    "meanings": [
        {
            "definition": "A distinctive uniform worn by a servant or official.",
            "pos": "noun",
            "sent1": "The servant proudly wore his livery to show he worked for the noble family.",
            "sent2": "The hotel staff all wore matching livery to look professional.",
            "sent3": "The livery of the butler made him look like a fancy penguin.",
            "sent4": "The livery of the security guards made them seem like knights protecting the castle.",
            "sent5": "The bright red livery of the doorman made him easily recognizable from afar."
        },
        {
            "definition": "The identifying colors or design of a company or organization.",
            "pos": "noun",
            "sent1": "The company's livery featured a bold logo on a blue background.",
            "sent2": "The airline's livery on the planes made them easy to spot on the runway.",
            "sent3": "The livery of the delivery trucks made them look like giant moving rainbows.",
            "sent4": "The livery of the school buses was so bright that they could be seen from miles away.",
            "sent5": "The livery of the restaurant chain included a cheerful mascot on all their packaging."
        },
        {
            "definition": "The feeding, stabling, and care of horses for pay.",
            "pos": "noun",
            "sent1": "The stable offered livery services for horse owners who needed a place to keep their animals.",
            "sent2": "The livery of the horses at the ranch was top-notch, ensuring they were always healthy and happy.",
            "sent3": "The livery of the horses at the farm was so good that they seemed to prance with joy.",
            "sent4": "The livery of the racehorses was so luxurious that they seemed like pampered celebrities.",
            "sent5": "The livery of the carriage horses was impeccable, making them the envy of all other stables."
        }
    ]
}