{
    "term": "living",
    "meanings": [
        {
            "definition": "Alive",
            "pos": "adjective",
            "sent1": "The plants in the garden are living and growing.",
            "sent2": "I saw a living bird flying in the sky.",
            "sent3": "The living flowers seemed to dance in the gentle breeze.",
            "sent4": "Her smile was so bright and full of life, it was like a living sunbeam.",
            "sent5": "The living trees whispered secrets to each other in the forest."
        },
        {
            "definition": "Inhabited",
            "pos": "adjective",
            "sent1": "The living house was filled with laughter and joy.",
            "sent2": "The living room was cozy and welcoming.",
            "sent3": "The living neighborhood was always bustling with activity.",
            "sent4": "The living city streets hummed with the energy of its inhabitants.",
            "sent5": "The living community thrived with diverse cultures and traditions."
        },
        {
            "definition": "Active",
            "pos": "adjective",
            "sent1": "The living ants scurried around in search of food.",
            "sent2": "The living children played happily in the park.",
            "sent3": "The living clock seemed to tick faster when I was bored.",
            "sent4": "The living river rushed past, never stopping for a moment.",
            "sent5": "The living wind whispered secrets as it danced through the trees."
        },
        {
            "definition": "Currently existing",
            "pos": "adjective",
            "sent1": "The living moment was filled with anticipation and excitement.",
            "sent2": "The living memory of that day still lingers in my mind.",
            "sent3": "The living project is due tomorrow, and I haven't started yet.",
            "sent4": "The living stars twinkled brightly in the night sky.",
            "sent5": "The living opportunity knocked on his door unexpectedly."
        },
        {
            "definition": "The condition of being alive",
            "pos": "noun",
            "sent1": "The miracle of living is a precious gift we should cherish.",
            "sent2": "The doctor studied the signs of living in the patient's body.",
            "sent3": "The celebration of living was marked with laughter and music.",
            "sent4": "The essence of living is to experience each moment fully.",
            "sent5": "The beauty of living is found in the simplest of things around us."
        }
    ]
}