{
    "term": "loaden",
    "meanings": [
        {
            "definition": "To put a load on or in (a means of conveyance or a vehicle)",
            "pos": "verb",
            "sent1": "I will loaden the truck with boxes for the delivery.",
            "sent2": "The workers loaden the van with tools for the job.",
            "sent3": "It was quite a sight to see the tiny car loaden with all those balloons.",
            "sent4": "Her responsibilities loaden her like heavy bricks on a fragile shelf.",
            "sent5": "The weight of the world seemed to loaden on his shoulders as he carried the burden of his family's expectations."
        },
        {
            "definition": "To put a load on or in (a container)",
            "pos": "verb",
            "sent1": "Please loaden the box carefully to avoid damaging the fragile items inside.",
            "sent2": "She loaden the basket with fresh fruits from the market.",
            "sent3": "The kids giggled as they tried to loaden the bucket with sand without spilling any.",
            "sent4": "His heart felt loaden with love for his family, overflowing like a full container.",
            "sent5": "The anticipation loaden her with excitement as she opened the mysterious container."
        },
        {
            "definition": "To put a load on or in (a gun)",
            "pos": "verb",
            "sent1": "The soldier carefully loaden the rifle before heading into battle.",
            "sent2": "Hunters must always remember to loaden their guns safely.",
            "sent3": "He jokingly asked his friend to loaden the toy gun with imaginary bullets.",
            "sent4": "His words were like bullets loaden in a gun, ready to fire at any moment.",
            "sent5": "The tension in the room loaden the atmosphere like a loaded gun, waiting to go off."
        },
        {
            "definition": "To put a load on or in (a ship)",
            "pos": "verb",
            "sent1": "The crew worked together to loaden the cargo onto the ship before departure.",
            "sent2": "They loaden the supplies onto the ship for the long journey ahead.",
            "sent3": "The pirates tried to loaden their stolen goods onto the ship quickly before being caught.",
            "sent4": "The memories of the voyage loaden the old sailor's heart with nostalgia.",
            "sent5": "The storm threatened to loaden the ship with waves as high as mountains."
        },
        {
            "definition": "To put a load on or in (a cart)",
            "pos": "verb",
            "sent1": "The farmer loaden the cart with hay to feed the animals.",
            "sent2": "Children love to help loaden the cart with pumpkins during harvest time.",
            "sent3": "The clown tried to loaden the cart with oversized props, causing laughter from the audience.",
            "sent4": "His worries loaden the cart of his mind, making it hard to move forward.",
            "sent5": "The cart creaked under the weight of the loaden goods, struggling to keep moving."
        }
    ]
}