{
    "term": "load",
    "meanings": [
        {
            "definition": "A heavy or bulky thing that is being carried or is about to be carried.",
            "pos": "noun",
            "sent1": "The truck struggled under the heavy load of bricks.",
            "sent2": "The workers unloaded the truck filled with a heavy load of supplies.",
            "sent3": "The load of laundry seemed to have multiplied overnight!",
            "sent4": "Her responsibilities felt like an overwhelming load on her shoulders.",
            "sent5": "The load of books threatened to topple over."
        },
        {
            "definition": "The amount of work to be done or the amount of work that a person or machine can do.",
            "pos": "noun",
            "sent1": "The students had a heavy load of homework to complete.",
            "sent2": "The machine was designed to handle a large load of tasks efficiently.",
            "sent3": "The load of paperwork on his desk never seemed to decrease.",
            "sent4": "The load of responsibilities on her plate was immense.",
            "sent5": "The load of assignments felt never-ending."
        },
        {
            "definition": "A quantity of something that can be carried at one time.",
            "pos": "noun",
            "sent1": "The truck was filled with a large load of fresh produce.",
            "sent2": "She carried a small load of groceries in her arms.",
            "sent3": "The load of apples in the basket looked tempting.",
            "sent4": "The load of presents for the party was carefully wrapped.",
            "sent5": "The load of firewood was neatly stacked by the fireplace."
        },
        {
            "definition": "A weight or force that is supported by something.",
            "pos": "noun",
            "sent1": "The bridge was designed to withstand a heavy load of traffic.",
            "sent2": "The beam supported the load of the roof without any issues.",
            "sent3": "The load of books on the shelf made it sag slightly.",
            "sent4": "The load of snow on the roof caused it to creak under the weight.",
            "sent5": "The load of dishes in the dishwasher clinked softly as it ran."
        }
    ]
}