{
    "term": "loaded",
    "meanings": [
        {
            "definition": "Containing a load or cargo.",
            "pos": "adjective",
            "sent1": "The truck was loaded with boxes for delivery.",
            "sent2": "The ship was loaded with supplies for the long journey.",
            "sent3": "The car looked funny with all the toys loaded in the back.",
            "sent4": "Her backpack was like a loaded treasure chest ready for an adventure.",
            "sent5": "The plane was so loaded with passengers that it felt like a crowded bus."
        },
        {
            "definition": "Filled or equipped with ammunition.",
            "pos": "adjective",
            "sent1": "The soldier carried a loaded gun into battle.",
            "sent2": "The hunter always makes sure his rifle is loaded before going hunting.",
            "sent3": "The toy gun looked silly with its loaded foam darts.",
            "sent4": "Her words were like a loaded weapon, ready to strike at any moment.",
            "sent5": "The pirate ship was loaded with cannons, ready for a sea battle."
        },
        {
            "definition": "Drunk or intoxicated.",
            "pos": "adjective",
            "sent1": "After the party, he stumbled out, completely loaded.",
            "sent2": "She regretted getting loaded at the bar last night.",
            "sent3": "The cat looked like it was loaded on catnip, running around crazily.",
            "sent4": "His laughter echoed through the room, sounding like a loaded hyena.",
            "sent5": "The clown at the circus acted like he was loaded with happiness."
        },
        {
            "definition": "Having a lot of money or resources.",
            "pos": "adjective",
            "sent1": "The businessman was loaded with cash after the successful deal.",
            "sent2": "The company was loaded with talented employees.",
            "sent3": "The garden was loaded with colorful flowers, a true sight to see.",
            "sent4": "Her mind was like a loaded library, full of knowledge and wisdom.",
            "sent5": "The treasure chest was so loaded with gold that it sparkled in the sunlight."
        }
    ]
}