{
    "term": "lobstick",
    "meanings": [
        {
            "definition": "A tree with a broken top used as a landmark or boundary marker.",
            "pos": "noun",
            "sent1": "The lobstick stood tall in the forest, guiding travelers on their journey.",
            "sent2": "The old lobstick by the river helped the locals know where the property line was.",
            "sent3": "The lobstick and its crooked top seemed to wave at passersby, playing its role as a marker.",
            "sent4": "Like a proud sentinel, the lobstick watched over the land with its broken crown.",
            "sent5": "The lobstick's jagged peak made it unmistakable among the other trees."
        },
        {
            "definition": "To mark or designate with a lobstick.",
            "pos": "verb",
            "sent1": "He would lobstick the path to ensure no one got lost in the dense woods.",
            "sent2": "The surveyor lobsticked the boundaries of the new park with precision.",
            "sent3": "She lobsticks the area with colorful flags, making it look like a festive celebration.",
            "sent4": "In his dream, he lobsticked the sky with stars to create a celestial map.",
            "sent5": "The artist lobsticks the canvas with bold strokes, creating a masterpiece."
        },
        {
            "definition": "A stick or pole used in the game of lacrosse.",
            "pos": "noun",
            "sent1": "The player swiftly passed the lobstick to his teammate for a quick goal.",
            "sent2": "She practiced her aim by hitting the ball with the lobstick into the net.",
            "sent3": "During the game, the lobstick became an extension of the player's arm, guiding every move.",
            "sent4": "The lobstick danced across the field, weaving through defenders like a skilled performer.",
            "sent5": "With a flick of the lobstick, the ball soared through the air towards the goal."
        }
    ]
}