{
    "term": "locators",
    "meanings": [
        {
            "definition": "A person or thing that locates.",
            "pos": "noun",
            "sent1": "The locators in the search party found the lost hiker.",
            "sent2": "The GPS device is a type of locators that helps us find our way.",
            "sent3": "The detective's trusty dog was his loyal locator in solving mysteries.",
            "sent4": "Her intuition acted as a reliable locator, guiding her to the right decisions.",
            "sent5": "The treasure map had hidden clues that acted as locators to the buried gold."
        },
        {
            "definition": "A device or mechanism used to determine the location of something.",
            "pos": "noun",
            "sent1": "The radar system is a powerful locators for tracking airplanes.",
            "sent2": "The metal detector is a handy locators for finding lost jewelry at the beach.",
            "sent3": "The curious cat treated the moving laser pointer as a mysterious locator.",
            "sent4": "The compass needle always points north, serving as a reliable locator in the wilderness.",
            "sent5": "The telescope's lens acted as a precise locator, allowing astronomers to observe distant stars."
        },
        {
            "definition": "A symbol or code used to identify a specific location or item.",
            "pos": "noun",
            "sent1": "The barcode on the product serves as a unique locators for inventory management.",
            "sent2": "The address written on the envelope acts as a crucial locators for mail delivery.",
            "sent3": "The secret handshake between friends was their playful locator for recognizing each other.",
            "sent4": "The special symbol on the map was the key locator for finding the hidden treasure.",
            "sent5": "The license plate number on the car acted as a distinct locator for law enforcement."
        }
    ]
}