{
    "term": "lockdown",
    "meanings": [
        {
            "definition": "A state of isolation or restricted access as a security measure.",
            "pos": "noun",
            "sent1": "During the lockdown, no one was allowed to enter or leave the building.",
            "sent2": "The school went into lockdown when there was a security threat.",
            "sent3": "The lockdown turned the office into a quiet and empty place.",
            "sent4": "The lockdown on the bank vault was so secure, even the toughest safecracker couldn't break it.",
            "sent5": "The lockdown made the area feel like a ghost town, with no one around."
        },
        {
            "definition": "The act of confining prisoners to their cells, typically as a security measure.",
            "pos": "noun",
            "sent1": "The lockdown in the prison was necessary to maintain order among the inmates.",
            "sent2": "The lockdown of the cell block prevented any escape attempts by the prisoners.",
            "sent3": "During the lockdown, the prisoners had to spend more time in their cells than usual.",
            "sent4": "The lockdown of the jail cells was like putting a lid on a boiling pot.",
            "sent5": "The lockdown of the prison cells made the inmates feel trapped and restless."
        },
        {
            "definition": "A temporary restriction on the movement of people or vehicles in a specific area.",
            "pos": "noun",
            "sent1": "The lockdown of the city streets was due to the parade taking place.",
            "sent2": "During the lockdown, traffic was redirected to alternative routes.",
            "sent3": "The lockdown of the road caused a traffic jam that lasted for hours.",
            "sent4": "The lockdown of the neighborhood made it feel like a quiet and peaceful oasis.",
            "sent5": "The lockdown of the area made it difficult for residents to go about their daily routines."
        }
    ]
}