{
    "term": "locks",
    "meanings": [
        {
            "definition": "A device for securing a door, lid, or container",
            "pos": "noun",
            "sent1": "The locks on the door kept it closed and safe.",
            "sent2": "She used the locks on her suitcase to keep her belongings secure.",
            "sent3": "The mischievous cat figured out how to open the locks on the treat jar.",
            "sent4": "His heart had many locks, but she held the key to unlock them all.",
            "sent5": "The old rusty locks on the treasure chest hinted at hidden riches within."
        },
        {
            "definition": "A mechanism for keeping a wheel or other moving part in place",
            "pos": "noun",
            "sent1": "The locks on the bicycle wheel prevented it from rolling away.",
            "sent2": "The engineer designed a new system of locks to secure the gears in place.",
            "sent3": "The locks on the clock kept it ticking accurately without any delays.",
            "sent4": "Her determination was the key that unlocked the locks holding back progress.",
            "sent5": "The locks on the conveyor belt ensured smooth and steady movement of goods."
        },
        {
            "definition": "A tress of hair twisted together or plaited",
            "pos": "noun",
            "sent1": "Her long locks cascaded down her back in a beautiful braid.",
            "sent2": "The princess adorned her locks with ribbons and flowers for the ball.",
            "sent3": "The mischievous wind played with her locks, creating a tangled mess.",
            "sent4": "Her locks shone in the sunlight like strands of spun gold.",
            "sent5": "The stylist expertly weaved her locks into an intricate hairstyle for the event."
        },
        {
            "definition": "A section of a canal or river with gates and sluices for raising and lowering boats",
            "pos": "noun",
            "sent1": "The locks along the river helped ships navigate through changes in water levels.",
            "sent2": "Boats waited patiently in line to pass through the locks of the canal.",
            "sent3": "The locks were like giant water elevators for the boats to travel up and down.",
            "sent4": "Navigating through the locks was a fascinating experience for the tourists on board.",
            "sent5": "The ancient locks were a marvel of engineering, allowing seamless passage for vessels."
        }
    ]
}