{
    "term": "locoism",
    "meanings": [
        {
            "definition": "The quality or state of being crazy or insane.",
            "pos": "noun",
            "sent1": "Her constant talking to imaginary friends showed a clear locoism.",
            "sent2": "The man's wild gestures and nonsensical ramblings were signs of locoism.",
            "sent3": "The locoism of wearing a winter coat in the middle of summer made everyone chuckle.",
            "sent4": "His sudden outburst of laughter in the silent library was a locoism that caught everyone's attention.",
            "sent5": "The locoism of believing in talking animals was both amusing and concerning.",
            "sent6": "Despite his locoism, she found his quirky behavior endearing.",
            "sent7": "The teacher tried to understand the student's locoism, but it was beyond comprehension.",
            "sent8": "The locoism of wearing mismatched socks to a formal event raised a few eyebrows.",
            "sent9": "The locoism of singing loudly in the shower at 3 am annoyed his roommates.",
            "sent10": "His locoism became more apparent as he started talking to inanimate objects."
        },
        {
            "definition": "A belief or behavior that is considered strange or irrational.",
            "pos": "noun",
            "sent1": "Her superstition about black cats crossing her path was a classic locoism.",
            "sent2": "The conspiracy theories he believed in were a prime example of locoism.",
            "sent3": "His locoism of thinking that umbrellas bring bad luck was both amusing and puzzling.",
            "sent4": "The locoism of avoiding cracks on the sidewalk to prevent bad luck seemed extreme to others.",
            "sent5": "The town's belief in ghosts haunting the old mansion was a widespread locoism.",
            "sent6": "Despite his locoism, she found his quirky behavior endearing.",
            "sent7": "The teacher tried to understand the student's locoism, but it was beyond comprehension.",
            "sent8": "The locoism of wearing mismatched socks to a formal event raised a few eyebrows.",
            "sent9": "The locoism of singing loudly in the shower at 3 am annoyed his roommates.",
            "sent10": "His locoism became more apparent as he started talking to inanimate objects."
        }
    ]
}