{
    "term": "loco",
    "meanings": [
        {
            "definition": "Crazy or insane",
            "pos": "adjective",
            "sent1": "She acted really loco when she thought her socks were talking to her.",
            "sent2": "The man's behavior became increasingly loco as the night went on.",
            "sent3": "The loco squirrel kept trying to steal the cat's food.",
            "sent4": "His idea to jump off the roof was absolutely loco.",
            "sent5": "The loco laughter echoed through the empty halls."
        },
        {
            "definition": "A locomotive or railway engine",
            "pos": "noun",
            "sent1": "The loco chugged along the tracks, pulling the heavy cargo behind it.",
            "sent2": "The old steam loco was a marvel of engineering in its time.",
            "sent3": "The tiny toy loco raced around the miniature railway.",
            "sent4": "The loco's whistle pierced the quiet countryside.",
            "sent5": "The shiny loco gleamed in the sunlight at the station."
        },
        {
            "definition": "A plant of the pea family, with brightly colored flowers",
            "pos": "noun",
            "sent1": "The garden was filled with beautiful loco flowers in shades of pink and purple.",
            "sent2": "The loco plant attracted butterflies with its vibrant blooms.",
            "sent3": "The loco blossoms swayed gently in the breeze.",
            "sent4": "The loco plant added a pop of color to the garden.",
            "sent5": "The sweet scent of the loco flowers filled the air."
        },
        {
            "definition": "A Spanish or Latin American dance or song",
            "pos": "noun",
            "sent1": "The dancers moved gracefully to the rhythm of the lively loco music.",
            "sent2": "The loco was a popular dance at the fiesta.",
            "sent3": "The loco song had everyone clapping and singing along.",
            "sent4": "The loco dance floor was crowded with enthusiastic dancers.",
            "sent5": "The festive loco music set the mood for the celebration."
        }
    ]
}