{
    "term": "locofoco",
    "meanings": [
        {
            "definition": "A type of friction match that can be ignited by striking on any rough surface.",
            "pos": "noun",
            "sent1": "I lit the candle using a locofoco from the box.",
            "sent2": "The locofoco ignited easily when I struck it against the wall.",
            "sent3": "Don't forget to pack the locofoco for our camping trip!",
            "sent4": "Her determination was like a locofoco, once ignited, it couldn't be stopped.",
            "sent5": "The locofoco sparked brightly, lighting up the room."
        },
        {
            "definition": "A member of a radical group of Democrats in New York in the 1830s and 1840s.",
            "pos": "noun",
            "sent1": "The locofoco spoke passionately at the political rally.",
            "sent2": "Many historians study the locofocos and their impact on politics.",
            "sent3": "The locofoco wore a top hat to the protest, adding to his eccentric image.",
            "sent4": "She stood out in the crowd like a locofoco among traditional politicians.",
            "sent5": "The locofoco's ideas burned brightly in the minds of the people.",
            "sent6": "In the 1830s, the locofocos fought for their beliefs in New York.",
            "sent7": "The locofoco's speeches were always filled with passion and conviction."
        },
        {
            "definition": "A person who is considered eccentric or crazy.",
            "pos": "noun",
            "sent1": "The old man down the street is known as the neighborhood locofoco.",
            "sent2": "Some people find her artistic choices to be quite locofoco.",
            "sent3": "He's a bit of a locofoco, always coming up with wild ideas.",
            "sent4": "Her laugh echoed through the room, sounding like a locofoco's cackle.",
            "sent5": "The locofoco danced in the rain, not caring what others thought."
        }
    ]
}