{
    "term": "lodes",
    "meanings": [
        {
            "definition": "A rich source or supply",
            "pos": "noun",
            "sent1": "The treasure chest was a lodes of gold coins.",
            "sent2": "The farmer's market was a lodes of fresh fruits and vegetables.",
            "sent3": "The birthday party was a lodes of fun with games and cake.",
            "sent4": "Her smile was a lodes of warmth on a cold winter day.",
            "sent5": "The library was a lodes of knowledge with books on every subject."
        },
        {
            "definition": "A vein of metal ore in the earth",
            "pos": "noun",
            "sent1": "The miners discovered a lodes of silver deep underground.",
            "sent2": "The geologist studied the lodes of copper in the rock formations.",
            "sent3": "The pirate's map led them to a lodes of hidden treasure.",
            "sent4": "The artist's brush revealed a lodes of colors in the landscape.",
            "sent5": "The jeweler found a lodes of precious gems in the rough stones."
        },
        {
            "definition": "To load or burden",
            "pos": "verb",
            "sent1": "She lodes the groceries into the car after shopping.",
            "sent2": "The workers lodes the boxes onto the truck for delivery.",
            "sent3": "He lodes his backpack with books for school.",
            "sent4": "The movers lodes the furniture carefully onto the moving truck.",
            "sent5": "The chef lodes the plates with delicious food for the customers."
        },
        {
            "definition": "To put a load on or in",
            "pos": "verb",
            "sent1": "He lodes the laundry into the washing machine.",
            "sent2": "She lodes the camera with film before taking pictures.",
            "sent3": "The hiker lodes his backpack with supplies for the trail.",
            "sent4": "The worker lodes the truck with tools for the job.",
            "sent5": "The teacher lodes the students' minds with knowledge and wisdom."
        }
    ]
}