{
    "term": "loft",
    "meanings": [
        {
            "definition": "A room or space directly under the roof of a house or other building, used for storage or living space.",
            "pos": "noun",
            "sent1": "The loft in our house is filled with old books and toys.",
            "sent2": "The cat climbed up to the loft to take a nap in the sun.",
            "sent3": "I accidentally locked myself in the loft while looking for decorations.",
            "sent4": "Her dreams soared high like a kite in the loft of her mind.",
            "sent5": "The musty smell of the loft lingered in the air."
        },
        {
            "definition": "A gallery or upper level in a church or hall.",
            "pos": "noun",
            "sent1": "The choir sang beautifully from the loft above the congregation.",
            "sent2": "The stained glass windows illuminated the church loft.",
            "sent3": "The mischievous child hid in the church loft during the service.",
            "sent4": "The echoes of prayers filled the empty church loft.",
            "sent5": "The view from the church loft was breathtaking."
        },
        {
            "definition": "To propel, hit, or throw something high into the air.",
            "pos": "verb",
            "sent1": "He used all his strength to loft the ball over the fence.",
            "sent2": "The baseball player lofted the ball into the outfield for a home run.",
            "sent3": "She accidentally lofted her hat onto the roof while waving to her friend.",
            "sent4": "The magician lofted the bird into the sky, amazing the audience.",
            "sent5": "The kite lofted gracefully in the wind, dancing among the clouds."
        },
        {
            "definition": "To store something in a loft.",
            "pos": "verb",
            "sent1": "We decided to loft the holiday decorations in the attic.",
            "sent2": "She lofted her winter clothes in the attic for easy access.",
            "sent3": "He lofted the old furniture in the loft to make space in the living room.",
            "sent4": "The farmer lofted the hay in the barn to keep it dry.",
            "sent5": "The family lofted their suitcases in the attic before going on vacation."
        },
        {
            "definition": "To hit a ball high into the air.",
            "pos": "verb",
            "sent1": "The golfer lofted the ball over the water hazard onto the green.",
            "sent2": "She lofted the tennis ball over the net with precision.",
            "sent3": "He lofted the basketball into the hoop from half-court.",
            "sent4": "The soccer player lofted the ball into the penalty area for a header.",
            "sent5": "The quarterback lofted a perfect pass to the receiver in the end zone."
        }
    ]
}