{
    "term": "logorrheic",
    "meanings": [
        {
            "definition": "Excessively talkative or wordy",
            "pos": "adjective",
            "sent1": "She is known for being logorrheic during meetings, often dominating the conversation.",
            "sent2": "The logorrheic speaker went on and on, making it hard for others to get a word in.",
            "sent3": "His logorrheic tendencies made even the most patient listeners start to fidget in their seats.",
            "sent4": "The logorrheic nature of the politician's speeches left the audience feeling overwhelmed by words.",
            "sent5": "The logorrheic professor's lectures seemed to never end, leaving students exhausted."
        },
        {
            "definition": "Characterized by excessive use of words",
            "pos": "adjective",
            "sent1": "The logorrheic writer filled every page with unnecessary details, making the story drag on.",
            "sent2": "Her logorrheic writing style made it difficult for readers to grasp the main point of the article.",
            "sent3": "The logorrheic advertisement tried to cram too much information into a small space.",
            "sent4": "The logorrheic email was so long that most recipients didn't bother reading it all.",
            "sent5": "The logorrheic description of the painting left visitors more confused than enlightened."
        },
        {
            "definition": "Tending to talk at great length",
            "pos": "adjective",
            "sent1": "The logorrheic professor could turn a simple question into a lengthy discussion.",
            "sent2": "She had a logorrheic tendency that often led to her stories becoming never-ending sagas.",
            "sent3": "His logorrheic storytelling style made bedtime stories last well past midnight.",
            "sent4": "The logorrheic presenter managed to turn a 10-minute talk into an hour-long lecture.",
            "sent5": "The logorrheic neighbor could talk for hours about the most mundane topics."
        }
    ]
}