{
    "term": "longjumping",
    "meanings": [
        {
            "definition": "The act of jumping as far as possible in one leap.",
            "pos": "noun",
            "sent1": "Longjumping requires strength and agility to leap a great distance.",
            "sent2": "The athlete's longjumping technique was flawless, allowing them to soar through the air.",
            "sent3": "During the longjumping competition, the crowd cheered loudly for each participant.",
            "sent4": "Her determination in longjumping was like a bird spreading its wings and taking flight.",
            "sent5": "The longjumping event at the school carnival was the highlight of the day."
        },
        {
            "definition": "A sport in which athletes compete to jump the farthest distance.",
            "pos": "noun",
            "sent1": "In longjumping, athletes strive to outdo each other by leaping the farthest.",
            "sent2": "The longjumping competition at the Olympics was intense and exciting.",
            "sent3": "The longjumping team practiced diligently to improve their chances of winning.",
            "sent4": "His dedication to longjumping was like a flame burning brightly in the night.",
            "sent5": "The longjumping pit was marked with colorful flags for the upcoming tournament."
        },
        {
            "definition": "To participate in the sport of longjumping.",
            "pos": "verb",
            "sent1": "She loves longjumping and trains every day to improve her skills.",
            "sent2": "Athletes from around the world will gather to longjump at the championship.",
            "sent3": "The cat seemed to be longjumping as it leaped from one rooftop to another.",
            "sent4": "His passion for longjumping was evident in the way he approached each practice session.",
            "sent5": "The children pretended they were longjumping over imaginary obstacles in the park."
        }
    ]
}