{
    "term": "looksisms",
    "meanings": [
        {
            "definition": "Discrimination or prejudice based on physical appearance.",
            "pos": "noun",
            "sent1": "The looksisms in the workplace can make some employees feel inferior.",
            "sent2": "She experienced looksisms when she was not chosen for the job because of her appearance.",
            "sent3": "The looksisms in the schoolyard were evident when the popular kids only played with the 'pretty' students.",
            "sent4": "The looksisms in society can be as damaging as any other form of discrimination.",
            "sent5": "The looksisms she faced growing up shaped her self-esteem and confidence."
        },
        {
            "definition": "The belief that physical attractiveness is the most important quality in a person.",
            "pos": "noun",
            "sent1": "His looksisms made him prioritize appearance over personality in relationships.",
            "sent2": "The looksisms in the fashion industry can have a negative impact on self-esteem.",
            "sent3": "She realized her looksisms when she caught herself judging others solely on their looks.",
            "sent4": "The looksisms in the media can create unrealistic beauty standards.",
            "sent5": "Her looksisms blinded her from seeing the true beauty within people."
        },
        {
            "definition": "The act of judging someone solely based on their looks.",
            "pos": "noun",
            "sent1": "Her looksisms led her to make assumptions about people before getting to know them.",
            "sent2": "He faced looksisms when he was overlooked for promotions due to his appearance.",
            "sent3": "The looksisms in the dating world can prevent genuine connections from forming.",
            "sent4": "Looksisms can prevent individuals from showcasing their true talents and abilities.",
            "sent5": "She learned to look beyond looksisms and appreciate people for who they truly are."
        }
    ]
}