{
    "term": "lookists",
    "meanings": [
        {
            "definition": "A person who discriminates against others based on their appearance.",
            "pos": "noun",
            "sent1": "The lookists at school only hang out with people who dress a certain way.",
            "sent2": "The lookists in the office always judge others by their clothes.",
            "sent3": "The lookists at the party only talked to people who wore expensive brands.",
            "sent4": "Being a lookist is like wearing glasses that only see what someone is wearing.",
            "sent5": "The lookists in the group made fun of anyone who didn't fit their style."
        },
        {
            "definition": "The belief that appearance is the most important factor in judging others.",
            "pos": "noun",
            "sent1": "Her lookists made her think that only pretty people could be successful.",
            "sent2": "The lookists in the fashion industry prioritize looks over talent.",
            "sent3": "The lookists in the movie industry only cast actors based on their looks.",
            "sent4": "Having a lookist mindset is like seeing the world through a beauty filter.",
            "sent5": "The lookists in the group always comment on people's outfits before anything else."
        },
        {
            "definition": "The act of judging or treating others unfairly based on their physical appearance.",
            "pos": "noun",
            "sent1": "The lookists in the school cafeteria made fun of students who didn't dress like them.",
            "sent2": "Being a lookist leads to unfair treatment of those who don't fit the mold.",
            "sent3": "The lookists in the group only invited people who fit their idea of beauty.",
            "sent4": "Lookists see people as mannequins to be judged solely on their appearance.",
            "sent5": "The lookists in the class whispered and pointed at anyone who looked different."
        }
    ]
}