{
    "term": "lookism",
    "meanings": [
        {
            "definition": "Discrimination or prejudice based on physical appearance.",
            "pos": "noun",
            "sent1": "Some people experience lookism when they are judged solely on how they look.",
            "sent2": "Lookism can lead to unfair treatment based on someone's appearance.",
            "sent3": "At the silly costume party, there was a playful discussion about lookism and its impact.",
            "sent4": "In the world of fashion, lookism reigns supreme, dictating who gets opportunities.",
            "sent5": "The concept of lookism is like a cloud that hovers over many social interactions."
        },
        {
            "definition": "The belief that physical attractiveness is the most important quality in a person.",
            "pos": "noun",
            "sent1": "Some individuals hold onto lookism, thinking beauty is everything.",
            "sent2": "Lookism can influence how people perceive the value of others.",
            "sent3": "During the conversation, his extreme lookism made everyone chuckle.",
            "sent4": "Her obsession with lookism turned her life into a constant beauty contest.",
            "sent5": "The idea of lookism is like a bright light that blinds people to other qualities."
        },
        {
            "definition": "The practice of favoring individuals who are perceived as attractive.",
            "pos": "noun",
            "sent1": "Lookism in the workplace can sometimes lead to unfair promotions.",
            "sent2": "Some companies unknowingly engage in lookism when hiring new employees.",
            "sent3": "At the talent show, the judges' obvious lookism created a humorous atmosphere.",
            "sent4": "In the world of entertainment, lookism often determines who gets the spotlight.",
            "sent5": "The impact of lookism is like a magnet that draws attention to certain individuals."
        }
    ]
}