{
    "term": "looksism",
    "meanings": [
        {
            "definition": "Discrimination or prejudice based on physical appearance.",
            "pos": "noun",
            "sent1": "Looksism can lead to unfair treatment of people based on how they look.",
            "sent2": "In some workplaces, looksism can affect who gets hired or promoted.",
            "sent3": "I heard a joke about looksism: Why did the mirror go to therapy? Because it couldn't handle the looksism!",
            "sent4": "The fashion industry's obsession with looksism is like a dark cloud over diversity and inclusion.",
            "sent5": "The impact of looksism on self-esteem can be devastating for many individuals."
        },
        {
            "definition": "The belief that physical attractiveness is the most important quality in a person.",
            "pos": "noun",
            "sent1": "Looksism can make people think that beauty is more important than anything else.",
            "sent2": "Some people struggle with self-worth due to the pressure of looksism.",
            "sent3": "I once overheard a conversation about looksism: 'Beauty is subjective, but looksism is real.'",
            "sent4": "The media often perpetuates looksism by promoting unrealistic beauty standards.",
            "sent5": "The toxic nature of looksism can harm individuals both mentally and emotionally."
        },
        {
            "definition": "The practice of favoring individuals who are perceived as attractive in social or professional settings.",
            "pos": "noun",
            "sent1": "Looksism can create an unfair advantage for those deemed attractive in certain situations.",
            "sent2": "Some people may experience looksism when trying to make connections in social circles.",
            "sent3": "I once witnessed looksism in action at a party: The most attractive person got all the attention.",
            "sent4": "Looksism in the workplace can sometimes overshadow qualifications and skills.",
            "sent5": "The impact of looksism on social dynamics can be subtle yet significant."
        }
    ]
}