{
    "term": "looky",
    "meanings": [
        {
            "definition": "To use one's eyes to see something",
            "pos": "verb",
            "sent1": "I looky at the beautiful flowers in the garden.",
            "sent2": "She likes to looky at the stars in the night sky.",
            "sent3": "The detective had to looky carefully for clues at the crime scene.",
            "sent4": "The artist looked at the blank canvas, envisioning her masterpiece.",
            "sent5": "Looky closely to find the hidden treasure in the old map."
        },
        {
            "definition": "An act of looking or a glance",
            "pos": "noun",
            "sent1": "He gave a quick looky around the room before entering.",
            "sent2": "She caught a looky of the mysterious figure in the shadows.",
            "sent3": "The cat's curious looky at the bird outside made everyone laugh.",
            "sent4": "The teacher's stern looky silenced the noisy classroom.",
            "sent5": "A looky at the mirror revealed a big smile on her face."
        },
        {
            "definition": "Appearing or seeming to be",
            "pos": "adjective",
            "sent1": "The looky clouds in the sky signaled an incoming storm.",
            "sent2": "The old house had a spooky looky in the moonlight.",
            "sent3": "The cake had a delicious looky that made everyone's mouth water.",
            "sent4": "Her new dress had a shiny looky that caught everyone's attention.",
            "sent5": "The mysterious package had a suspicious looky about it."
        },
        {
            "definition": "A person who looks or watches",
            "pos": "noun",
            "sent1": "The looky at the park noticed the children playing happily.",
            "sent2": "She was known as the best looky in the neighborhood.",
            "sent3": "The little looky at the zoo was fascinated by the animals.",
            "sent4": "The security guard was a vigilant looky, always on the watch.",
            "sent5": "The wise old looky shared stories of the past with the young ones."
        }
    ]
}