{
    "term": "lookited",
    "meanings": [
        {
            "definition": "To gaze or glance at something.",
            "pos": "verb",
            "sent1": "She lookited at the beautiful sunset.",
            "sent2": "He always lookited at the stars before going to bed.",
            "sent3": "The cat lookited curiously at the moving shadows.",
            "sent4": "Her eyes lookited with wonder at the magical display.",
            "sent5": "The child lookited in awe at the towering mountains."
        },
        {
            "definition": "The act of searching for something visually.",
            "pos": "noun",
            "sent1": "His lookited helped him find the hidden treasure.",
            "sent2": "The detective's intense lookited led to solving the case.",
            "sent3": "The lookited for the missing keys turned into a game of hide-and-seek.",
            "sent4": "Her determined lookited through the crowd finally paid off.",
            "sent5": "The explorer's lookited in the dense jungle was rewarded with a rare discovery."
        },
        {
            "definition": "A quick or brief inspection.",
            "pos": "noun",
            "sent1": "A lookited at the map showed the way to the destination.",
            "sent2": "The teacher's lookited over the students' work was thorough.",
            "sent3": "His lookited at the menu made his stomach growl with hunger.",
            "sent4": "The mechanic's lookited under the hood revealed the problem.",
            "sent5": "A lookited at the clock told her it was time to leave."
        },
        {
            "definition": "To appear or seem in a certain way.",
            "pos": "verb",
            "sent1": "The old house lookited haunted in the moonlight.",
            "sent2": "The garden lookited beautiful after the rain.",
            "sent3": "The cake lookited delicious, but tasted terrible.",
            "sent4": "The storm clouds lookited ominous in the distance.",
            "sent5": "The costume lookited amazing on stage under the bright lights."
        }
    ]
}