{
    "term": "loop",
    "meanings": [
        {
            "definition": "A shape produced by a curve that bends around and crosses itself.",
            "pos": "noun",
            "sent1": "The roller coaster had a big loop that made everyone scream with excitement.",
            "sent2": "She tied a loop in the ribbon to make a pretty bow on the gift.",
            "sent3": "The cat chased its tail in a loop, thinking it had found a new friend.",
            "sent4": "His thoughts were stuck in a loop, replaying the same memories over and over.",
            "sent5": "The loop of the necklace sparkled in the sunlight, catching everyone's eye."
        },
        {
            "definition": "A length of thread, rope, or similar material, doubled or crossing itself, typically used for fastening or binding.",
            "pos": "noun",
            "sent1": "She made a loop with the rope to secure the boat to the dock.",
            "sent2": "The tailor used a loop of thread to stitch the button back onto the shirt.",
            "sent3": "The magician pulled a never-ending loop of scarves out of his hat, amazing the audience.",
            "sent4": "Her necklace was a loop of pearls, symbolizing eternity and grace.",
            "sent5": "The loop of yarn slipped off the needle, causing her to start knitting again."
        },
        {
            "definition": "A structure, series, or process that is repeated or can be repeated.",
            "pos": "noun",
            "sent1": "The computer program had a loop that repeated the same task until it was done.",
            "sent2": "The dance routine had a fun loop that the dancers performed in perfect synchronization.",
            "sent3": "The joke he told was so funny that it got stuck in a loop, making everyone laugh again and again.",
            "sent4": "Her daily routine felt like a loop, starting with breakfast and ending with bedtime.",
            "sent5": "The song had a catchy loop that kept playing in her head all day long."
        }
    ]
}