{
    "term": "loose",
    "meanings": [
        {
            "definition": "Not firmly or tightly fixed in place",
            "pos": "adjective",
            "sent1": "The loose tooth wiggled when she touched it.",
            "sent2": "The shirt was loose on him, hanging off his shoulders.",
            "sent3": "The loose lid on the jar kept popping off unexpectedly.",
            "sent4": "Her loose hair flowed behind her like a golden waterfall.",
            "sent5": "The loose floorboard creaked under their weight."
        },
        {
            "definition": "Not fitting tightly",
            "pos": "adjective",
            "sent1": "The loose pants kept slipping down his hips.",
            "sent2": "She tied the loose knot, knowing it would come undone easily.",
            "sent3": "The loose socks made her slide around the polished floor.",
            "sent4": "The loose grip on the rope caused it to slip from his hands.",
            "sent5": "The loose belt hung loosely around his waist."
        },
        {
            "definition": "Not strict or exact",
            "pos": "adjective",
            "sent1": "The teacher gave loose guidelines for the project.",
            "sent2": "His loose interpretation of the rules often got him in trouble.",
            "sent3": "The loose schedule allowed for spontaneous adventures.",
            "sent4": "Her loose definition of 'clean' left much to be desired.",
            "sent5": "The loose definition of success varied from person to person."
        },
        {
            "definition": "Free from restraint or confinement",
            "pos": "adjective",
            "sent1": "The loose bird soared high in the open sky.",
            "sent2": "The horse ran loose in the wide, open field.",
            "sent3": "The loose cat explored the neighborhood freely.",
            "sent4": "The loose prisoner finally tasted freedom after years behind bars.",
            "sent5": "The loose kite danced in the wind, untethered and joyful."
        }
    ]
}