{
    "term": "lordship",
    "meanings": [
        {
            "definition": "The state or quality of being a lord.",
            "pos": "noun",
            "sent1": "In the story, the character's lordship was evident through his grand castle.",
            "sent2": "The king's lordship over the land was unquestioned by his subjects.",
            "sent3": "The duck claimed lordship over the pond, much to the amusement of the other animals.",
            "sent4": "Her lordship of the dance floor was unmatched, gliding effortlessly with each step.",
            "sent5": "The lordship of the forest was bestowed upon the wise old owl, who watched over all creatures."
        },
        {
            "definition": "The authority or power of a lord.",
            "pos": "noun",
            "sent1": "The knight respected the lord's lordship and followed his commands without question.",
            "sent2": "The lord's lordship allowed him to make important decisions for the kingdom.",
            "sent3": "The cat asserted its lordship over the house by claiming the comfiest spot on the couch.",
            "sent4": "His lordship in the courtroom was evident as he delivered a fair judgment.",
            "sent5": "The lordship of the sea belonged to Poseidon, who controlled the waves with his trident."
        },
        {
            "definition": "The title or dignity of a lord.",
            "pos": "noun",
            "sent1": "The ceremony marked the bestowal of his lordship upon the humble farmer.",
            "sent2": "The lordship's elegant attire and regal demeanor commanded respect from all who met him.",
            "sent3": "The squirrel humorously declared lordship over the nut stash, much to the confusion of the other animals.",
            "sent4": "Her lordship of the court was evident as she presided over the legal proceedings with grace.",
            "sent5": "The lordship of the skies belonged to the majestic eagle, soaring high above the treetops."
        }
    ]
}