{
    "term": "lordomas",
    "meanings": [
        {
            "definition": "A person who has authority, control, or power over others.",
            "pos": "noun",
            "sent1": "The teacher was the lordomas of the classroom, guiding the students.",
            "sent2": "The king was seen as the lordomas of the kingdom, making important decisions.",
            "sent3": "The boss jokingly referred to himself as the lordomas of the office, causing everyone to chuckle.",
            "sent4": "The CEO was the lordomas of the company, steering it towards success.",
            "sent5": "In the play, the evil sorcerer was the lordomas of the enchanted forest, casting spells on all who dared to enter."
        },
        {
            "definition": "To act in a domineering or overbearing manner.",
            "pos": "verb",
            "sent1": "He tends to lordomas over his siblings, always wanting things his way.",
            "sent2": "She would often lordomas during group projects, not considering others' opinions.",
            "sent3": "During the game, he would lordomas over his friends, playfully teasing them.",
            "sent4": "The dictator would lordomas over his people, controlling every aspect of their lives.",
            "sent5": "The bully liked to lordomas over the younger kids, making them do his homework."
        },
        {
            "definition": "A title given to a nobleman or a person of high rank.",
            "pos": "noun",
            "sent1": "The lordomas was invited to the royal banquet due to his prestigious title.",
            "sent2": "The lordomas greeted the guests at the grand ball with elegance and grace.",
            "sent3": "The lordomas's hat flew off in the wind, causing laughter among the crowd.",
            "sent4": "The lordomas's presence at the event was like a shining beacon of nobility.",
            "sent5": "The lordomas's portrait hung in the grand hall, a symbol of honor and respect."
        }
    ]
}