{
    "term": "lordlike",
    "meanings": [
        {
            "definition": "Resembling or characteristic of a lord.",
            "pos": "adjective",
            "sent1": "The king's robe was so lordlike, with its rich colors and intricate designs.",
            "sent2": "The grand castle had a lordlike presence that commanded respect from all who approached.",
            "sent3": "The cat strutted around the house in a lordlike manner, as if it owned the place.",
            "sent4": "Her elegant and graceful movements on the dance floor were truly lordlike.",
            "sent5": "The old tree stood tall and proud, its branches spreading out in a lordlike fashion."
        },
        {
            "definition": "Having the qualities or characteristics of a lord.",
            "pos": "adjective",
            "sent1": "His deep voice and confident demeanor were very lordlike.",
            "sent2": "The knight's armor gleamed in the sunlight, giving him a lordlike appearance.",
            "sent3": "The toddler tried to act lordlike, pretending to give orders to his toys.",
            "sent4": "The mountain peak rose majestically, looking lordlike against the clear blue sky.",
            "sent5": "The old man's wisdom and authority made him seem truly lordlike in the eyes of the villagers."
        },
        {
            "definition": "Acting in a manner befitting a lord.",
            "pos": "adjective",
            "sent1": "She greeted her guests with a lordlike grace and hospitality.",
            "sent2": "The CEO conducted the meeting with a calm and lordlike demeanor.",
            "sent3": "The dog sat on the couch in a lordlike pose, as if it were the master of the house.",
            "sent4": "The actor portrayed the king with such lordlike presence that the audience was captivated.",
            "sent5": "The teacher's patient and understanding attitude was truly lordlike, earning the respect of all her students."
        }
    ]
}