{
    "term": "loric",
    "meanings": [
        {
            "definition": "A protective covering or armor",
            "pos": "noun",
            "sent1": "The knight wore a loric to shield himself in battle.",
            "sent2": "The ancient warriors crafted lorics from strong metal.",
            "sent3": "The loric gleamed in the sunlight, making the knight look like a shining star.",
            "sent4": "Her kindness was her loric, protecting her from the harshness of the world.",
            "sent5": "The dragon's scales formed a loric that was impenetrable."
        },
        {
            "definition": "A type of scale or plate",
            "pos": "noun",
            "sent1": "The fish had colorful lorics covering its body.",
            "sent2": "The armor was made of overlapping lorics for maximum protection.",
            "sent3": "The lorics on the dragon's back shimmered in the moonlight.",
            "sent4": "The lorics of the turtle were like a natural shield against predators.",
            "sent5": "The lorics of the beetle were hard and smooth, like tiny shields."
        },
        {
            "definition": "A piece of armor for the upper body",
            "pos": "noun",
            "sent1": "The knight's loric was beautifully crafted and adorned with intricate designs.",
            "sent2": "She fastened the loric tightly around her chest before heading into battle.",
            "sent3": "The loric felt heavy on his shoulders, but he knew it was necessary for protection.",
            "sent4": "The loric clanked as the knight walked, announcing his presence on the battlefield.",
            "sent5": "The shiny loric reflected the fire's glow, creating a mesmerizing sight."
        },
        {
            "definition": "A protective layer or shell",
            "pos": "noun",
            "sent1": "The turtle retreated into its loric to stay safe from predators.",
            "sent2": "The insect's loric was hard and durable, providing excellent defense.",
            "sent3": "The loric of the seed protected it until it was ready to sprout.",
            "sent4": "The castle was like a giant loric, guarding the kingdom within.",
            "sent5": "The thick loric of the armadillo kept it safe from harm."
        }
    ]
}