{
    "term": "losing",
    "meanings": [
        {
            "definition": "Failing to win",
            "pos": "adjective",
            "sent1": "The losing team felt disappointed after the game.",
            "sent2": "She was on the losing side of the competition.",
            "sent3": "The losing team decided to practice harder for the next match.",
            "sent4": "The losing streak seemed never-ending for the struggling team.",
            "sent5": "The losing team's coach encouraged them to keep trying their best."
        },
        {
            "definition": "Suffering loss",
            "pos": "verb",
            "sent1": "He is losing his favorite toy.",
            "sent2": "The company is losing money due to poor sales.",
            "sent3": "She felt like she was losing her mind trying to solve the puzzle.",
            "sent4": "Losing a loved one can be a heartbreaking experience.",
            "sent5": "The hiker was losing hope of finding a way back to the trail."
        },
        {
            "definition": "Not able to find",
            "pos": "adjective",
            "sent1": "The losing key was finally found under the couch.",
            "sent2": "She was looking for her losing earring everywhere.",
            "sent3": "The losing sock mysteriously disappeared in the laundry.",
            "sent4": "The losing book was hiding behind the bookshelf all along.",
            "sent5": "The losing pen rolled off the desk and got lost in the clutter."
        },
        {
            "definition": "Becoming separated from",
            "pos": "verb",
            "sent1": "The hikers risked losing their group in the dense forest.",
            "sent2": "The balloon slipped from her hand, losing it in the sky.",
            "sent3": "The child was scared of losing his parents in the crowded mall.",
            "sent4": "The ship faced the danger of losing sight of the shore in the storm.",
            "sent5": "The astronaut worried about losing contact with the space station during the mission."
        }
    ]
}