{
    "term": "loto",
    "meanings": [
        {
            "definition": "A game of chance in which players match numbers on their cards to numbers drawn randomly",
            "pos": "noun",
            "sent1": "During the loto game, I matched all the numbers on my card!",
            "sent2": "Let's play loto tonight and see if we can win some prizes.",
            "sent3": "At the loto game, my lucky number was 7, and I won a small prize.",
            "sent4": "Winning the loto felt like finding a hidden treasure in a sea of numbers.",
            "sent5": "The excitement of playing loto is like a rollercoaster ride of luck and chance."
        },
        {
            "definition": "A type of flower with large, showy blooms",
            "pos": "noun",
            "sent1": "The garden was filled with beautiful loto flowers in full bloom.",
            "sent2": "I love how vibrant and colorful loto flowers are in the spring.",
            "sent3": "The bees buzzed happily around the loto flowers, enjoying their nectar.",
            "sent4": "The loto flowers stood out in the garden like stars in the night sky.",
            "sent5": "The fragrance of the loto flower is as sweet as a summer breeze."
        },
        {
            "definition": "A type of dance originating in the Dominican Republic",
            "pos": "noun",
            "sent1": "The dancers moved gracefully to the rhythm of the lively loto music.",
            "sent2": "Let's learn the energetic loto dance for the upcoming party.",
            "sent3": "Watching the loto dance made me want to join in and twirl around.",
            "sent4": "The loto dance is like a joyful celebration of music and movement.",
            "sent5": "The infectious beat of the loto dance swept everyone off their feet."
        },
        {
            "definition": "A type of fabric made from linen fibers",
            "pos": "noun",
            "sent1": "She wore a lovely dress made of soft loto fabric to the event.",
            "sent2": "The curtains in the room were crafted from delicate loto material.",
            "sent3": "The loto fabric felt cool and comfortable against my skin on a hot day.",
            "sent4": "The loto fabric draped elegantly, adding a touch of sophistication to the room.",
            "sent5": "The smooth texture of loto fabric is as soothing as a gentle breeze."
        }
    ]
}