{
    "term": "lottery",
    "meanings": [
        {
            "definition": "A game of chance in which players purchase tickets and a winner is selected at random.",
            "pos": "noun",
            "sent1": "My grandma won the lottery and bought a new car.",
            "sent2": "The lottery winner was overjoyed with their unexpected luck.",
            "sent3": "The cat seemed to think chasing the laser pointer was like playing a lottery.",
            "sent4": "Life sometimes feels like a lottery where we never know what we'll get.",
            "sent5": "The excitement of winning the lottery made her heart race with anticipation."
        },
        {
            "definition": "A system of raising money by selling numbered tickets and awarding prizes to the holders of numbers drawn at random.",
            "pos": "noun",
            "sent1": "The school fundraiser used a lottery to raise funds for new books.",
            "sent2": "The charity event's lottery drew a large crowd eager to win prizes.",
            "sent3": "The office decided to settle the dispute by drawing names from a hat like a lottery.",
            "sent4": "In a way, life's opportunities can be seen as a lottery where luck plays a big role.",
            "sent5": "The excitement of waiting for the lottery results kept everyone on edge."
        },
        {
            "definition": "A process or event that is or seems to be determined by chance.",
            "pos": "noun",
            "sent1": "The weather in this city is like a lottery, you never know what to expect.",
            "sent2": "Life can sometimes feel like a lottery with unexpected twists and turns.",
            "sent3": "Trying to predict the stock market is like playing a risky lottery.",
            "sent4": "Love can be a lottery, where you take a chance and hope for the best.",
            "sent5": "The outcome of the meeting felt like a lottery, with everyone holding their breath."
        }
    ]
}