{
    "term": "lovingnesses",
    "meanings": [
        {
            "definition": "The quality or state of being loving.",
            "pos": "noun",
            "sent1": "Her lovingnesses towards her family were evident in the way she always put their needs first.",
            "sent2": "The lovingnesses shown by the couple towards each other warmed the hearts of those around them.",
            "sent3": "The lovingnesses of the puppy towards its favorite toy was adorable to watch.",
            "sent4": "The lovingnesses in her voice made even the toughest hearts melt.",
            "sent5": "The lovingnesses in the air during the holiday season was palpable and heartwarming."
        },
        {
            "definition": "Acts or expressions of love.",
            "pos": "noun",
            "sent1": "Their lovingnesses were displayed through small gestures like holding hands and sharing smiles.",
            "sent2": "The lovingnesses exchanged between the siblings were genuine and heartwarming.",
            "sent3": "The lovingnesses in the form of surprise gifts made her birthday extra special.",
            "sent4": "The lovingnesses in the air on Valentine's Day was contagious and filled the room with warmth.",
            "sent5": "The lovingnesses in their eyes spoke volumes about their deep connection and affection."
        },
        {
            "definition": "Affection or tenderness towards others.",
            "pos": "noun",
            "sent1": "His lovingnesses towards his friends was evident in the way he always supported and encouraged them.",
            "sent2": "The lovingnesses she showed towards animals made her a favorite at the shelter.",
            "sent3": "The lovingnesses in her hugs were so comforting that everyone wanted one.",
            "sent4": "The lovingnesses in her smile could brighten even the gloomiest of days.",
            "sent5": "The lovingnesses in her actions spoke louder than words, showing her true caring nature."
        }
    ]
}