{
    "term": "lows",
    "meanings": [
        {
            "definition": "A point or level below which a quantity or condition is not allowed to fall.",
            "pos": "noun",
            "sent1": "The teacher set the lows for the test scores to ensure everyone did their best.",
            "sent2": "The lows of the temperature in winter can be quite challenging for plants.",
            "sent3": "Feeling sad when you reach the lows in your mood is normal, but remember, it will pass.",
            "sent4": "During tough times, it's important to remember that even at the lows, there is always a way up.",
            "sent5": "The lows of the ocean can be mysterious and full of undiscovered creatures."
        },
        {
            "definition": "A state of depression or low spirits.",
            "pos": "noun",
            "sent1": "She experienced deep lows after losing her pet, but her friends helped her through.",
            "sent2": "The lows of loneliness can be overwhelming, but reaching out for support can make a difference.",
            "sent3": "Even in the lows of a sad movie, there can be moments of laughter and joy.",
            "sent4": "His heart felt heavy with the lows of sorrow, but he knew brighter days would come.",
            "sent5": "The lows of despair can feel endless, but there is always a glimmer of hope to hold on to."
        },
        {
            "definition": "The part of a wave that is below the average level.",
            "pos": "noun",
            "sent1": "Surfers enjoy riding the highs and lows of the waves, feeling the rush of each crest.",
            "sent2": "The lows of the wave can be tricky to navigate, requiring skill and balance.",
            "sent3": "The lows of the wave seemed to whisper secrets of the deep ocean to the surfer.",
            "sent4": "As the wave reached its lows, the surfer prepared to catch the next thrilling crest.",
            "sent5": "The lows of the wave crashed gently on the shore, leaving a trail of foamy bubbles."
        }
    ]
}