{
    "term": "loxed",
    "meanings": [
        {
            "definition": "To have been caught in a trap or snare.",
            "pos": "verb",
            "sent1": "The rabbit got loxed in the hunter's trap.",
            "sent2": "The spider loxed its prey in the web.",
            "sent3": "The mischievous raccoon got loxed in the garbage can lid.",
            "sent4": "Her shoelaces loxed together, causing her to trip.",
            "sent5": "The fisherman's net loxed a variety of sea creatures."
        },
        {
            "definition": "To have been entangled or involved in a difficult situation.",
            "pos": "verb",
            "sent1": "She felt loxed in a web of lies.",
            "sent2": "The hiker loxed in a maze of trails in the forest.",
            "sent3": "The detective got loxed in a complex case.",
            "sent4": "His thoughts were loxed in a web of confusion.",
            "sent5": "The students were loxed in a challenging math problem."
        },
        {
            "definition": "To have been secured or fastened in place.",
            "pos": "verb",
            "sent1": "The gate loxed shut to keep the dog inside.",
            "sent2": "The lock loxed the door securely.",
            "sent3": "The lid of the jar loxed tightly, making it hard to open.",
            "sent4": "The seatbelt loxed in place to keep the passenger safe.",
            "sent5": "The anchor loxed the boat to the dock."
        },
        {
            "definition": "To have been fixed or positioned firmly.",
            "pos": "verb",
            "sent1": "The sign was loxed in the ground to show the way.",
            "sent2": "The tree was loxed in the soil, standing tall.",
            "sent3": "The shelf was loxed securely to the wall.",
            "sent4": "The flagpole was loxed in the concrete base.",
            "sent5": "The statue was loxed in the center of the park."
        },
        {
            "definition": "To have been tangled or twisted together.",
            "pos": "verb",
            "sent1": "The wires loxed together, causing a short circuit.",
            "sent2": "The vines loxed around the tree trunk.",
            "sent3": "Her hair loxed in knots after a windy day.",
            "sent4": "The threads loxed in a tangled mess.",
            "sent5": "The ropes loxed together, creating a strong bond."
        }
    ]
}