{
    "term": "lubrication",
    "meanings": [
        {
            "definition": "The act of applying a substance to reduce friction between surfaces.",
            "pos": "noun",
            "sent1": "Proper lubrication of the gears ensures they move smoothly without causing damage.",
            "sent2": "Regular lubrication of the bike chain helps it last longer and perform better.",
            "sent3": "The robot demanded extra lubrication for its squeaky joints, or it threatened to go on strike.",
            "sent4": "In the world of relationships, trust acts as the lubrication that keeps everything running smoothly.",
            "sent5": "The car engine roared to life thanks to the perfect lubrication of its parts."
        },
        {
            "definition": "The process of making something slippery or smooth.",
            "pos": "noun",
            "sent1": "The lubrication of the slide made it extra fun for the kids at the playground.",
            "sent2": "The lubrication of the door hinges made them silent as a whisper.",
            "sent3": "The chef's secret to a perfect omelette was the right amount of butter for lubrication.",
            "sent4": "Laughter acted as the social lubrication that eased the tension in the room.",
            "sent5": "The skater glided effortlessly on the ice rink, thanks to the perfect lubrication of her skates."
        },
        {
            "definition": "The state of being lubricated.",
            "pos": "noun",
            "sent1": "The smooth lubrication of the engine indicated it was well-maintained.",
            "sent2": "The proper lubrication of the joints allowed for easy movement.",
            "sent3": "The excessive lubrication of the pan caused the eggs to slide right off.",
            "sent4": "His charm served as the social lubrication that helped him make friends easily.",
            "sent5": "The bicycle chain's lack of lubrication led to a squeaky and inefficient ride."
        }
    ]
}