{
    "term": "lucky",
    "meanings": [
        {
            "definition": "Having good fortune or success by chance.",
            "pos": "adjective",
            "sent1": "She felt lucky to find a penny on the sidewalk.",
            "sent2": "He considered himself lucky to win the raffle.",
            "sent3": "The lucky cat statue brought good fortune to the shop owner.",
            "sent4": "Her lucky charm seemed to attract success wherever she went.",
            "sent5": "The lucky horseshoe symbolized good fortune in the old tales."
        },
        {
            "definition": "Fortunate or successful.",
            "pos": "adjective",
            "sent1": "The lucky student received a scholarship for college.",
            "sent2": "They were lucky to have such supportive friends.",
            "sent3": "It was lucky that the rain stopped just in time for the picnic.",
            "sent4": "The lucky break in his career changed his life forever.",
            "sent5": "She felt lucky to be part of such a wonderful team."
        },
        {
            "definition": "Bringing good luck.",
            "pos": "adjective",
            "sent1": "The lucky penny she carried always brought her good luck.",
            "sent2": "Wearing her lucky socks, she aced the exam.",
            "sent3": "The lucky charm on his keychain protected him from harm.",
            "sent4": "The lucky bamboo plant in the office was believed to bring prosperity.",
            "sent5": "Finding a four-leaf clover is considered a lucky omen."
        },
        {
            "definition": "Happening by chance.",
            "pos": "adjective",
            "sent1": "It was lucky that they bumped into each other at the store.",
            "sent2": "The lucky encounter led to a lifelong friendship.",
            "sent3": "By a lucky coincidence, they both chose the same restaurant.",
            "sent4": "The lucky timing of the bus arrival saved him from being late.",
            "sent5": "She made a lucky guess and won the game."
        }
    ]
}