{
    "term": "lump",
    "meanings": [
        {
            "definition": "A small mass of matter of irregular shape",
            "pos": "noun",
            "sent1": "She found a lump of clay in the garden.",
            "sent2": "The lump of sugar dissolved in the hot tea.",
            "sent3": "The cat played with the lump of yarn, thinking it was a mouse.",
            "sent4": "The lump in her throat made it hard to speak.",
            "sent5": "He felt the lump of ice cream melt in his hand."
        },
        {
            "definition": "A swelling or growth",
            "pos": "noun",
            "sent1": "The lump on his arm turned out to be a harmless cyst.",
            "sent2": "The lump on the tree indicated a termite infestation.",
            "sent3": "She joked that the lump on her head was a new fashion accessory.",
            "sent4": "The lump of dough rose beautifully in the warm kitchen.",
            "sent5": "The lump in the carpet made it difficult to walk smoothly."
        },
        {
            "definition": "To group together in an indiscriminate manner",
            "pos": "verb",
            "sent1": "She would lump all the toys together in one box.",
            "sent2": "Don't lump all the books on the shelf; organize them by genre.",
            "sent3": "He would often lump his socks with his shirts in the laundry.",
            "sent4": "The teacher would lump all the students into one big group for the activity.",
            "sent5": "It's easier to lump all the ingredients for the salad in one bowl."
        },
        {
            "definition": "To move heavily and awkwardly",
            "pos": "verb",
            "sent1": "The tired hiker would lump along the trail.",
            "sent2": "The elephant would lump through the dense forest.",
            "sent3": "She would lump around the house in her oversized slippers.",
            "sent4": "The old car would lump down the bumpy road.",
            "sent5": "The heavy suitcase made her lump up the stairs slowly."
        }
    ]
}