{
    "term": "lunacy",
    "meanings": [
        {
            "definition": "The state of being mentally ill, especially severely.",
            "pos": "noun",
            "sent1": "Her uncle's constant ramblings about conspiracy theories were a clear sign of lunacy.",
            "sent2": "The hospital specialized in treating individuals suffering from severe lunacy.",
            "sent3": "During the play, the character's sudden belief that they were a famous historical figure was a hilarious display of lunacy.",
            "sent4": "The decision to invest all their savings in a get-rich-quick scheme seemed like pure lunacy in hindsight.",
            "sent5": "The artist's abstract paintings were often dismissed as lunacy by traditional art critics."
        },
        {
            "definition": "Foolish or senseless behavior.",
            "pos": "noun",
            "sent1": "His reckless driving was a perfect example of lunacy on the roads.",
            "sent2": "Ignoring the weather warnings and going for a swim during a storm was sheer lunacy.",
            "sent3": "The comedian's silly jokes brought moments of light lunacy to the audience.",
            "sent4": "The company's decision to launch a new product without any market research was a move bordering on lunacy.",
            "sent5": "The children's game of jumping off the swings mid-air was a display of youthful lunacy."
        },
        {
            "definition": "Extreme foolishness or irrationality.",
            "pos": "noun",
            "sent1": "The dictator's policies led the country into a state of economic lunacy.",
            "sent2": "Investing all their money in a pyramid scheme was an act of financial lunacy.",
            "sent3": "The idea of building a snowman in the middle of summer was met with laughter at its sheer lunacy.",
            "sent4": "The politician's promise to lower taxes while increasing spending was seen as political lunacy.",
            "sent5": "The explorer's decision to venture into the desert without water was a tale of survival lunacy."
        }
    ]
}