{
    "term": "lunar",
    "meanings": [
        {
            "definition": "Relating to the moon.",
            "pos": "adjective",
            "sent1": "The sky was filled with a beautiful lunar glow.",
            "sent2": "The lunar cycle affects the tides on Earth.",
            "sent3": "The lunar light made the night seem magical.",
            "sent4": "Her face had a lunar quality, pale and serene.",
            "sent5": "The lunar landscape was barren and mysterious."
        },
        {
            "definition": "Resembling the moon.",
            "pos": "adjective",
            "sent1": "The round, glowing lamp had a lunar appearance.",
            "sent2": "The artist painted a lunar scene with craters and shadows.",
            "sent3": "The cake's frosting looked oddly lunar under the dim light.",
            "sent4": "Her face, with its pale complexion, was lunar-like.",
            "sent5": "The mirror reflected a lunar image of the full moon."
        },
        {
            "definition": "Measured by the moon.",
            "pos": "adjective",
            "sent1": "The ancient calendar was based on lunar cycles.",
            "sent2": "The festival's timing followed a lunar calendar.",
            "sent3": "The farmer planted crops according to the lunar phases.",
            "sent4": "The tide predictions were based on lunar calculations.",
            "sent5": "The religious ceremonies were aligned with lunar events."
        },
        {
            "definition": "Occurring or taking place during the moon's period of visibility in the sky.",
            "pos": "adjective",
            "sent1": "The lunar eclipse was a rare celestial event.",
            "sent2": "The werewolf transformation happened during the lunar phase.",
            "sent3": "The lunar party was a fun way to celebrate the full moon.",
            "sent4": "The lunar rainbow appeared as a magical arch in the sky.",
            "sent5": "The lunar festival attracted visitors from all over."
        }
    ]
}