{
    "term": "lunier",
    "meanings": [
        {
            "definition": "Of or relating to the moon.",
            "pos": "adjective",
            "sent1": "The night sky was filled with a beautiful, lunier glow.",
            "sent2": "The lunier landscape cast a soft light over the dark forest.",
            "sent3": "The lunier night made the stars seem to dance in the sky.",
            "sent4": "Her smile was as bright and lunier as the full moon.",
            "sent5": "The lunier phases of the moon fascinated the young astronomer."
        },
        {
            "definition": "Resembling the moon in shape or appearance.",
            "pos": "adjective",
            "sent1": "The round, lunier lanterns lit up the garden path.",
            "sent2": "The cake was decorated with lunier icing that sparkled in the light.",
            "sent3": "The lunier clouds in the sky looked like fluffy cotton candy.",
            "sent4": "Her face glowed with a lunier radiance than the moon itself.",
            "sent5": "The lunier reflection on the lake created a magical atmosphere."
        },
        {
            "definition": "Characteristic of or affected by the moon.",
            "pos": "adjective",
            "sent1": "The lunier tides brought in a bounty of fresh seafood.",
            "sent2": "Her mood became lunier as the full moon approached.",
            "sent3": "The lunier nights always made him feel more creative.",
            "sent4": "The lunier energy in the air seemed to spark new ideas.",
            "sent5": "The lunier nights were perfect for stargazing and storytelling."
        },
        {
            "definition": "A person who is mentally ill or unstable.",
            "pos": "noun",
            "sent1": "The lunier wandered the streets muttering to himself.",
            "sent2": "The asylum housed many luniers who needed care and support.",
            "sent3": "The lunier believed he could talk to the moon and receive guidance.",
            "sent4": "The artist painted a portrait of the lunier under the moonlight.",
            "sent5": "The villagers were kind to the lunier, offering food and shelter."
        }
    ]
}