{
    "term": "lurking",
    "meanings": [
        {
            "definition": "To lie or wait in concealment, as a person in ambush; remain in or around a place secretly or furtively.",
            "pos": "verb",
            "sent1": "The cat was lurking behind the bushes, waiting to pounce on the unsuspecting bird.",
            "sent2": "The detective was lurking in the shadows, keeping a close eye on the suspect.",
            "sent3": "The mischievous elf was lurking near the cookie jar, hoping to snatch a treat.",
            "sent4": "Danger was always lurking in the dark alleyways of the city.",
            "sent5": "The sense of danger lurking in the forest made her heart race."
        },
        {
            "definition": "To go furtively; slink; steal.",
            "pos": "verb",
            "sent1": "The thief was lurking around the corner, waiting for the perfect moment to strike.",
            "sent2": "The fox was lurking near the henhouse, planning its next stealthy move.",
            "sent3": "The raccoon was lurking around the campsite, looking for any scraps of food to snatch.",
            "sent4": "The feeling of guilt was always lurking in the back of his mind after he stole the candy.",
            "sent5": "The temptation to lurk in the shadows and steal was strong for the sneaky cat burglar."
        },
        {
            "definition": "To exist unobserved or unsuspected.",
            "pos": "verb",
            "sent1": "Doubt was always lurking in the back of her mind, making her question everything.",
            "sent2": "The truth was lurking just beneath the surface, waiting to be revealed.",
            "sent3": "The answer to the riddle was lurking in the old dusty book on the shelf.",
            "sent4": "The potential for greatness was lurking within him, waiting to be unleashed.",
            "sent5": "The magic of the unknown was lurking in the air, creating an aura of mystery."
        }
    ]
}