{
    "term": "lush",
    "meanings": [
        {
            "definition": "(adjective) Characterized by luxuriousness or opulence.",
            "pos": "adjective",
            "sent1": "The hotel room was lush with velvet curtains and golden chandeliers.",
            "sent2": "She wore a lush gown to the royal ball, adorned with shimmering jewels.",
            "sent3": "The lush dessert buffet tempted everyone with its decadent treats.",
            "sent4": "Her lush lifestyle was the envy of all her friends, surrounded by extravagance.",
            "sent5": "The garden party was a lush affair, filled with elegant decorations and fine cuisine."
        },
        {
            "definition": "(noun) A person who enjoys indulging in luxury or excess.",
            "pos": "noun",
            "sent1": "The lush loved to pamper themselves with spa treatments and designer clothes.",
            "sent2": "She was known as the office lush for always splurging on expensive lunches.",
            "sent3": "The lush in the group always picked the fanciest restaurants for dinner.",
            "sent4": "Being a lush, he never hesitated to order the most expensive bottle of wine.",
            "sent5": "The lush's Instagram was filled with photos of lavish vacations and gourmet meals."
        },
        {
            "definition": "(verb) To thrive or grow abundantly.",
            "pos": "verb",
            "sent1": "The plants lush in the sunlight, reaching towards the sky with vibrant leaves.",
            "sent2": "After the rain, the fields lush with green crops, promising a bountiful harvest.",
            "sent3": "The garden seemed to lush overnight, surprising the gardener with its rapid growth.",
            "sent4": "Nature has a way of lush in unexpected places, reclaiming abandoned buildings with greenery.",
            "sent5": "In the fertile valley, crops lush abundantly, providing sustenance for the community."
        }
    ]
}