{
    "term": "lustier",
    "meanings": [
        {
            "definition": "Full of vigor and energy",
            "pos": "adjective",
            "sent1": "The puppy was the lustier of the two, always bounding around with excitement.",
            "sent2": "After a good night's sleep, she felt much lustier and ready to tackle the day.",
            "sent3": "The old car seemed jealous of the lustier new model parked next to it.",
            "sent4": "Her laughter was like a gust of wind, lustier than the gentle breeze of a whisper.",
            "sent5": "The sun's rays grew lustier as they broke through the clouds, warming everything in their path."
        },
        {
            "definition": "Having a strong sexual desire",
            "pos": "adjective",
            "sent1": "The romance novel was filled with characters who were always feeling lustier than usual.",
            "sent2": "As the night progressed, the atmosphere became lustier, filled with desire and anticipation.",
            "sent3": "The love potion worked a little too well, making everyone in the town act lustier than ever before.",
            "sent4": "The flames of passion burned lustier in their hearts, igniting a fierce desire for each other.",
            "sent5": "The sultry music at the club made her feel even lustier, lost in the rhythm and allure of the night."
        },
        {
            "definition": "More lively or vigorous than something else",
            "pos": "adjective",
            "sent1": "The children's laughter grew lustier as they played in the park, their joy infectious.",
            "sent2": "The vibrant colors of the sunset made it appear even lustier compared to the dull morning sky.",
            "sent3": "The competition between the two teams became even lustier as they fought for the championship title.",
            "sent4": "Her voice rang out lustier than the rest, capturing everyone's attention with its power.",
            "sent5": "The aroma of freshly baked bread wafted through the air, making the bakery seem even lustier than usual."
        }
    ]
}