{
    "term": "lyings",
    "meanings": [
        {
            "definition": "The act of telling lies.",
            "pos": "noun",
            "sent1": "Her lyings were discovered when the truth came out.",
            "sent2": "I can't trust him anymore after all his lyings.",
            "sent3": "His lyings about finishing his homework were quite creative.",
            "sent4": "The web of lyings he spun eventually unraveled.",
            "sent5": "The consequences of her lyings were severe."
        },
        {
            "definition": "A false statement made with intent to deceive.",
            "pos": "noun",
            "sent1": "The politician's lyings were exposed by the media.",
            "sent2": "She was hurt by the lyings spread about her.",
            "sent3": "His lyings about being a secret agent were quite amusing.",
            "sent4": "The lyings of the con artist fooled many people.",
            "sent5": "The web of lyings he spun eventually unraveled."
        },
        {
            "definition": "The position or manner in which something lies.",
            "pos": "noun",
            "sent1": "The lyings of the books on the shelf were neat.",
            "sent2": "The detective carefully examined the lyings of the evidence.",
            "sent3": "The lyings of the puzzle pieces made it challenging to solve.",
            "sent4": "The lyings of the land indicated a possible landslide.",
            "sent5": "The precise lyings of the keys on the table caught her eye."
        },
        {
            "definition": "The act of reclining or resting in a horizontal position.",
            "pos": "noun",
            "sent1": "After a long day, she enjoyed the lyings on her comfortable bed.",
            "sent2": "The doctor recommended proper lyings to alleviate back pain.",
            "sent3": "His favorite lyings spot was the hammock in the backyard.",
            "sent4": "The cat's graceful lyings on the windowsill were a sight to behold.",
            "sent5": "The lyings on the beach under the sun felt relaxing."
        }
    ]
}