{
    "term": "lymphadenitis",
    "meanings": [
        {
            "definition": "Inflammation of the lymph nodes.",
            "pos": "noun",
            "sent1": "Lymphadenitis can cause swelling and pain in the lymph nodes.",
            "sent2": "The doctor diagnosed the patient with lymphadenitis after feeling the swollen glands.",
            "sent3": "When the lymph nodes throw a party and get too inflamed, that's lymphadenitis!",
            "sent4": "Her lymphadenitis was like a traffic jam in the body, causing discomfort and blockage.",
            "sent5": "The image of angry, red lymph nodes helped her remember what lymphadenitis meant."
        },
        {
            "definition": "Swelling and tenderness of the lymph nodes.",
            "pos": "noun",
            "sent1": "The lymphadenitis made it painful for him to turn his neck.",
            "sent2": "After the infection, she experienced lymphadenitis in her armpits.",
            "sent3": "The tender lymph nodes whispered to each other, 'Let's be swollen today, lymphadenitis party!'",
            "sent4": "Her lymphadenitis felt like carrying heavy balloons under her skin, sensitive and bulging.",
            "sent5": "The lymphadenitis felt like tiny, sore marbles under her touch, reminding her of the inflammation."
        },
        {
            "definition": "Enlargement of the lymph nodes due to infection.",
            "pos": "noun",
            "sent1": "The doctor explained that the lymphadenitis was a result of the bacterial infection.",
            "sent2": "The swollen lymph nodes indicated lymphadenitis caused by the virus.",
            "sent3": "The infection turned the lymph nodes into party balloons, causing lymphadenitis!",
            "sent4": "His lymphadenitis was like a garden blooming with swollen lymph node flowers.",
            "sent5": "The infection spread, making the lymph nodes grow like balloons, a clear sign of lymphadenitis."
        }
    ]
}