{
    "term": "lymphogranulomatosis",
    "meanings": [
        {
            "definition": "A type of cancer affecting the lymphatic system.",
            "pos": "noun",
            "sent1": "Lymphogranulomatosis can be a serious illness that requires medical treatment.",
            "sent2": "Doctors are studying new treatments for lymphogranulomatosis.",
            "sent3": "When Bob heard he had lymphogranulomatosis, he joked that he must have caught it from a lymph node.",
            "sent4": "Her battle with lymphogranulomatosis was like fighting an invisible enemy.",
            "sent5": "The word 'lymphogranulomatosis' sounded scary, like a monster hiding in the body."
        },
        {
            "definition": "Characterized by the formation of granulomas in the lymph nodes.",
            "pos": "adjective",
            "sent1": "The patient's lymphogranulomatosis condition required regular monitoring.",
            "sent2": "The doctor explained that the swelling was due to lymphogranulomatosis.",
            "sent3": "Despite the odd name, lymphogranulomatosis made the lymph nodes swell like balloons.",
            "sent4": "Her lymphogranulomatosis diagnosis felt like a puzzle with missing pieces.",
            "sent5": "The lymphogranulomatosis growth was slow but persistent, like a quiet invader."
        },
        {
            "definition": "Also known as Hodgkin's disease.",
            "pos": "noun",
            "sent1": "Lymphogranulomatosis, or Hodgkin's disease, can be treated effectively if detected early.",
            "sent2": "The doctor discussed the symptoms of lymphogranulomatosis, also called Hodgkin's disease.",
            "sent3": "When she learned she had lymphogranulomatosis, she thought, 'Well, at least it has a fancy name like Hodgkin's disease.'",
            "sent4": "His battle with lymphogranulomatosis, or Hodgkin's disease, was like facing a known foe.",
            "sent5": "The term 'lymphogranulomatosis' was a mouthful, but Hodgkin's disease sounded more familiar and less intimidating."
        }
    ]
}