{
    "term": "lyricising",
    "meanings": [
        {
            "definition": "To write lyrics.",
            "pos": "verb",
            "sent1": "She enjoys lyricising songs for her friends.",
            "sent2": "The musician spent hours lyricising a new tune.",
            "sent3": "While lyricising a poem, she accidentally rhymed 'cat' with 'bat'.",
            "sent4": "His heart lyricising emotions onto the paper.",
            "sent5": "The poet's pen danced lyricising tales of love and loss."
        },
        {
            "definition": "To compose lyrics.",
            "pos": "verb",
            "sent1": "He lyricising a beautiful melody for the choir.",
            "sent2": "The band members lyricising together for their next album.",
            "sent3": "Lyricising a song about pizza made her hungry.",
            "sent4": "Her mind lyricising a symphony of words and music.",
            "sent5": "The songwriter lyricising heartfelt words of encouragement."
        },
        {
            "definition": "To create lyrics.",
            "pos": "verb",
            "sent1": "They are lyricising a rap for the talent show.",
            "sent2": "The poet lyricising a sonnet about nature's beauty.",
            "sent3": "Lyricising a lullaby helped the baby fall asleep.",
            "sent4": "The artist lyricising a ballad of love and longing.",
            "sent5": "She was lyricising a catchy tune that stuck in everyone's head."
        },
        {
            "definition": "To put into words.",
            "pos": "verb",
            "sent1": "He had trouble lyricising his feelings after the breakup.",
            "sent2": "The author lyricising the protagonist's inner turmoil.",
            "sent3": "Lyricising his excitement, he shouted the news to everyone.",
            "sent4": "Her eyes lyricising the pain she couldn't express verbally.",
            "sent5": "The speech lyricising the hopes and dreams of a generation."
        },
        {
            "definition": "To express in verse.",
            "pos": "verb",
            "sent1": "She lyricising her love for nature through poetry.",
            "sent2": "The troubadour lyricising tales of knights and dragons.",
            "sent3": "Lyricising a haiku about rainbows brought a smile to her face.",
            "sent4": "His guitar lyricising the emotions he couldn't speak aloud.",
            "sent5": "The bard lyricising the history of the ancient kingdom."
        }
    ]
}