{
    "term": "macadamias",
    "meanings": [
        {
            "definition": "The hard-shelled nut of an Australian evergreen tree, typically used in baking and cooking.",
            "pos": "noun",
            "sent1": "I added crushed macadamias to the cookie dough for extra flavor.",
            "sent2": "My grandma's famous pie recipe calls for a generous sprinkle of macadamias on top.",
            "sent3": "The mischievous squirrel stole the macadamias from the picnic basket and hid them in the tree.",
            "sent4": "Her laughter was like the crack of a macadamia shell, unexpected and delightful.",
            "sent5": "The aroma of freshly baked bread mingled with the buttery richness of macadamias in the air."
        },
        {
            "definition": "A tree native to Australia that produces the macadamia nut.",
            "pos": "noun",
            "sent1": "The macadamias tree in the backyard provides shade during hot summer days.",
            "sent2": "The farmer carefully tended to the young macadamias saplings, ensuring a bountiful harvest.",
            "sent3": "The wise owl perched on the highest branch of the macadamias tree, surveying the forest below.",
            "sent4": "The branches of the macadamias tree reached out like welcoming arms to the weary travelers.",
            "sent5": "The rustling leaves of the macadamias tree whispered secrets of the land to those who listened."
        },
        {
            "definition": "A type of nut that is often roasted and eaten as a snack.",
            "pos": "noun",
            "sent1": "During the movie night, we enjoyed munching on salted macadamias.",
            "sent2": "The trail mix was a perfect blend of almonds, cashews, and crunchy macadamias.",
            "sent3": "The mischievous squirrel tried to swipe the last macadamias from the bowl but got caught in the act.",
            "sent4": "Her smile was as bright and warm as the golden hue of roasted macadamias.",
            "sent5": "The crunch of the macadamias echoed through the quiet room, signaling the end of the snack time."
        }
    ]
}