{
    "term": "macabrely",
    "meanings": [
        {
            "definition": "In a disturbing and horrifying manner.",
            "pos": "adverb",
            "sent1": "The haunted house was decorated macabrely with fake blood and skeletons.",
            "sent2": "The horror movie was macabrely thrilling, keeping the audience on the edge of their seats.",
            "sent3": "She jokingly suggested they decorate the party macabrely with spooky decorations.",
            "sent4": "The dark storm clouds gathered macabrely in the sky, foretelling a night of terror.",
            "sent5": "The eerie music played macabrely in the background, setting a chilling atmosphere."
        },
        {
            "definition": "In a way that suggests death or violence.",
            "pos": "adverb",
            "sent1": "The crime scene was macabrely marked with caution tape and police officers.",
            "sent2": "The artist's painting depicted a scene macabrely filled with shadows and mystery.",
            "sent3": "The children's play about pirates ended macabrely with a pretend sword fight.",
            "sent4": "The old graveyard stood macabrely silent under the pale moonlight.",
            "sent5": "The detective's findings pointed macabrely towards a sinister conclusion."
        },
        {
            "definition": "In a manner that is grim or gruesome.",
            "pos": "adverb",
            "sent1": "The abandoned house was macabrely silent, sending shivers down their spines.",
            "sent2": "The novel described the murder scene macabrely, leaving readers with a sense of dread.",
            "sent3": "The Halloween costume was macabrely realistic, causing a mix of fear and admiration.",
            "sent4": "The ancient ruins loomed macabrely in the mist, hiding dark secrets within.",
            "sent5": "The ghost story was told macabrely around the campfire, making everyone jump at every sound."
        }
    ]
}