{
    "term": "macron",
    "meanings": [
        {
            "definition": "A horizontal line used to indicate a long vowel sound in phonetics.",
            "pos": "noun",
            "sent1": "In phonetics, the macron above the letter shows that it is pronounced for a longer time.",
            "sent2": "The word 'bee' with a macron over the 'e' sounds like 'beee'.",
            "sent3": "The macron decided to take a nap on top of the letter, making it sound longer.",
            "sent4": "Her voice was like a macron, stretching the sound of each vowel in her words.",
            "sent5": "The teacher drew a macron over the vowel to emphasize the pronunciation."
        },
        {
            "definition": "A diacritical mark placed over a letter to indicate a long vowel sound in Latin.",
            "pos": "noun",
            "sent1": "In Latin, the macron over the 'a' changes its pronunciation to a long 'aah'.",
            "sent2": "When you see a macron over a letter in Latin, you know to elongate the sound.",
            "sent3": "The macron over the 'o' in Latin made it sound like a ghost saying 'boo'.",
            "sent4": "Her Latin pronunciation was so clear, each macron over the vowels seemed to sing.",
            "sent5": "The macron danced above the letter, making the vowel sound like a song."
        },
        {
            "definition": "A symbol used in mathematics to represent a constant value.",
            "pos": "noun",
            "sent1": "The equation included a macron to represent the fixed value of 'pi'.",
            "sent2": "When you see a macron in math, it means a number that doesn't change.",
            "sent3": "The macron in the math problem refused to budge from its place, always constant.",
            "sent4": "His determination was like a macron in the equation, unwavering and steady.",
            "sent5": "The macron in the formula stood out, symbolizing the unchanging value."
        }
    ]
}