{
    "term": "magmatic",
    "meanings": [
        {
            "definition": "Relating to or formed by magma.",
            "pos": "adjective",
            "sent1": "The volcano erupted with a magmatic explosion, spewing hot lava everywhere.",
            "sent2": "The geologist studied the magmatic rocks to understand the volcano's history.",
            "sent3": "The magmatic heat from the lava flow made the surrounding rocks sizzle like bacon.",
            "sent4": "Her passion for geology was as magmatic as the molten rock beneath the Earth's surface.",
            "sent5": "The magmatic nature of the volcano made it a dangerous but fascinating research subject."
        },
        {
            "definition": "Of or relating to the process of magma formation.",
            "pos": "adjective",
            "sent1": "The magmatic activity deep within the Earth created new layers of rock over time.",
            "sent2": "Scientists study the magmatic processes to predict volcanic eruptions.",
            "sent3": "The magmatic forces at work beneath the surface were like a hidden dance of elements.",
            "sent4": "The magmatic process of magma formation is a slow but powerful force of nature.",
            "sent5": "Understanding the magmatic origins of rocks helps us comprehend Earth's geological history."
        },
        {
            "definition": "Characterized by or produced from magma.",
            "pos": "adjective",
            "sent1": "The magmatic rocks were evidence of the volcano's past eruptions.",
            "sent2": "The heat from the magmatic activity warmed the surrounding area.",
            "sent3": "The magmatic materials cooled to form unique rock formations over time.",
            "sent4": "Her excitement was as magmatic as the molten lava flowing from the volcano.",
            "sent5": "The magmatic landscape was both beautiful and dangerous, showcasing the power of nature."
        }
    ]
}