{
    "term": "magnetics",
    "meanings": [
        {
            "definition": "The study of magnetic fields and their effects on objects.",
            "pos": "noun",
            "sent1": "In magnetics, scientists explore how magnets attract or repel each other.",
            "sent2": "The school library has many books on magnetics and electromagnetism.",
            "sent3": "The magnetics professor's office was filled with various magnetic toys and gadgets.",
            "sent4": "Her understanding of magnetics was like a compass always pointing her in the right direction.",
            "sent5": "The children's science fair project on magnetics amazed the judges."
        },
        {
            "definition": "The properties or behavior of magnetic materials.",
            "pos": "noun",
            "sent1": "The magnetics of the new alloy made it perfect for use in electronic devices.",
            "sent2": "The scientist studied the magnetics of different metals to see which ones were attracted to magnets.",
            "sent3": "The magnetics of the fridge magnet seemed to have a mind of its own, moving around mysteriously.",
            "sent4": "The magnetics of the situation drew them together like two opposite poles of a magnet.",
            "sent5": "Understanding the magnetics of the material helped them design a better magnetic levitation system."
        },
        {
            "definition": "The branch of science that deals with magnets and magnetic fields.",
            "pos": "noun",
            "sent1": "She decided to pursue a career in magnetics to learn more about the Earth's magnetic field.",
            "sent2": "The museum's exhibit on magnetics fascinated visitors of all ages.",
            "sent3": "The magnetics class had a field trip to a magnet factory to see magnets being made.",
            "sent4": "The magnetics department at the university was known for its groundbreaking research.",
            "sent5": "His passion for magnetics led him to invent a new type of magnetic compass."
        }
    ]
}