{
    "term": "magnanimous",
    "meanings": [
        {
            "definition": "Showing or suggesting a lofty and courageous spirit",
            "pos": "adjective",
            "sent1": "Her magnanimous gesture of donating all her birthday money to charity impressed everyone.",
            "sent2": "The king's magnanimous decision to pardon the rebel leader won him admiration from his subjects.",
            "sent3": "It was quite magnanimous of the cat to share its toy mouse with the new kitten.",
            "sent4": "The sun's magnanimous rays bathed the entire valley in golden light.",
            "sent5": "The teacher's magnanimous smile encouraged the shy student to speak up in class."
        },
        {
            "definition": "Generous in forgiving an insult or injury",
            "pos": "adjective",
            "sent1": "Despite the harsh words, she remained magnanimous and forgave her friend.",
            "sent2": "He was magnanimous enough to overlook the mistake and move forward positively.",
            "sent3": "The magnanimous cat forgave the dog for knocking over its food bowl.",
            "sent4": "Her magnanimous heart allowed her to let go of grudges easily.",
            "sent5": "The magnanimous act of forgiveness brought peace to their strained relationship."
        },
        {
            "definition": "Noble in mind; elevated in soul; exalted in principles",
            "pos": "adjective",
            "sent1": "The magnanimous leader always put the needs of his people above his own.",
            "sent2": "She had a magnanimous spirit that inspired those around her to be better.",
            "sent3": "It was quite magnanimous of the tree to provide shade for the weary travelers.",
            "sent4": "The magnanimous mountain stood tall, offering protection to the valley below.",
            "sent5": "His magnanimous ideals guided him to always do what was right, no matter the cost."
        }
    ]
}