{
    "term": "mahwa",
    "meanings": [
        {
            "definition": "A type of Indian fruit tree.",
            "pos": "noun",
            "sent1": "The mahwa tree in our garden produces delicious fruits.",
            "sent2": "The villagers gathered under the shade of the mahwa tree to enjoy the cool breeze.",
            "sent3": "The monkeys in the forest love to swing from the branches of the mahwa tree.",
            "sent4": "The mahwa tree stood tall and proud, its branches reaching towards the sky.",
            "sent5": "The sweet scent of the mahwa tree filled the air, attracting bees and butterflies."
        },
        {
            "definition": "A sweet, edible fruit from the mahwa tree.",
            "pos": "noun",
            "sent1": "The children happily picked mahwa fruits from the tree and enjoyed their juicy sweetness.",
            "sent2": "The market was bustling with vendors selling fresh mahwa fruits.",
            "sent3": "Grandma baked a delicious pie using the ripe mahwa fruits from the backyard.",
            "sent4": "The mahwa fruits glistened in the sunlight, tempting birds and squirrels alike.",
            "sent5": "The aroma of the ripe mahwa fruits wafted through the kitchen, making everyone's mouth water."
        },
        {
            "definition": "A type of alcoholic drink made from the flowers of the mahwa tree.",
            "pos": "noun",
            "sent1": "The villagers celebrated the harvest with glasses of mahwa, laughing and dancing under the moonlight.",
            "sent2": "The mahwa flowed freely at the festival, bringing joy and merriment to all.",
            "sent3": "The mischievous squirrel accidentally knocked over a bottle of mahwa, causing a sticky mess.",
            "sent4": "The golden hue of the mahwa shimmered in the candlelight, casting a warm glow on the faces of the revelers.",
            "sent5": "The sweet taste of mahwa lingered on their lips, a reminder of the festive night."
        }
    ]
}