{
    "term": "maiden",
    "meanings": [
        {
            "definition": "A young unmarried woman.",
            "pos": "noun",
            "sent1": "The maiden walked gracefully down the street.",
            "sent2": "The maiden helped her grandmother with the groceries.",
            "sent3": "The maiden giggled as she tripped over her own feet.",
            "sent4": "The maiden's laughter was as light and joyful as a summer breeze.",
            "sent5": "The image of the maiden's smile lingered in his mind long after she had gone."
        },
        {
            "definition": "A girl or young woman.",
            "pos": "noun",
            "sent1": "The little maiden played with her doll in the garden.",
            "sent2": "The kind maiden offered a hand to the lost child.",
            "sent3": "The maiden's eyes widened in surprise as the puppy licked her face.",
            "sent4": "The maiden's voice was as sweet as a songbird's melody.",
            "sent5": "The maiden's braids danced in the wind as she ran through the meadow."
        },
        {
            "definition": "A female virgin.",
            "pos": "noun",
            "sent1": "The village celebrated the maiden's upcoming wedding.",
            "sent2": "The maiden blushed at the mention of love and romance.",
            "sent3": "The maiden's purity was admired by all who knew her.",
            "sent4": "The maiden's innocence shone like a beacon in a world of darkness.",
            "sent5": "The maiden's heart beat with anticipation on her wedding day."
        },
        {
            "definition": "A first or earliest of its kind.",
            "pos": "noun",
            "sent1": "The maiden voyage of the ship was a great success.",
            "sent2": "The maiden edition of the book became a bestseller.",
            "sent3": "The maiden attempt at baking a cake ended in disaster.",
            "sent4": "The maiden flight of the plane was met with cheers and applause.",
            "sent5": "The maiden performance of the play left the audience in awe."
        },
        {
            "definition": "A horse that has never won a race.",
            "pos": "noun",
            "sent1": "The jockey hoped his horse would break its maiden in the next race.",
            "sent2": "The stable prepared the maiden for its first competition.",
            "sent3": "The maiden stumbled at the starting line but quickly recovered.",
            "sent4": "The maiden's determination to win was evident in its eyes.",
            "sent5": "The crowd cheered as the maiden crossed the finish line for the first time."
        }
    ]
}