{
    "term": "maills",
    "meanings": [
        {
            "definition": "A type of armor consisting of metal rings linked together",
            "pos": "noun",
            "sent1": "The knight wore sturdy maills for protection in battle.",
            "sent2": "The maills clinked softly as the warrior moved.",
            "sent3": "The shiny maills made the knight look like a walking metal curtain.",
            "sent4": "The maills were like a shield of interlocking circles around the warrior.",
            "sent5": "The maills shimmered in the sunlight, a beautiful yet formidable sight."
        },
        {
            "definition": "To send something through the mail",
            "pos": "verb",
            "sent1": "I will maills the package to you tomorrow.",
            "sent2": "She maills her letters every Friday without fail.",
            "sent3": "He decided to maills a surprise gift to his friend overseas.",
            "sent4": "The postman maills hundreds of letters each day, rain or shine.",
            "sent5": "Remember to maills the invitation before the deadline to ensure timely delivery."
        },
        {
            "definition": "A collection of letters or parcels to be delivered",
            "pos": "noun",
            "sent1": "The post office received a large maills for distribution.",
            "sent2": "The maills was overflowing with holiday greetings.",
            "sent3": "The maills contained birthday cards, bills, and a magazine subscription.",
            "sent4": "She sorted through the maills, looking for the important letter.",
            "sent5": "The maills on the doorstep brought a smile to her face, knowing she was remembered."
        },
        {
            "definition": "A type of medieval weapon consisting of a spiked ball on a chain",
            "pos": "noun",
            "sent1": "The warrior swung the maills with precision, striking his target.",
            "sent2": "The maills whirled through the air before hitting the enemy.",
            "sent3": "In the battle, the maills became a deadly dance of destruction.",
            "sent4": "The maills crashed against the enemy's shield, causing a loud clang.",
            "sent5": "The maills was a fearsome weapon, capable of inflicting serious damage in combat."
        }
    ]
}