{
    "term": "mailes",
    "meanings": [
        {
            "definition": "A unit of distance equal to 5,280 feet.",
            "pos": "noun",
            "sent1": "I walked many mailes to reach the mountain top.",
            "sent2": "The marathon was 26 mailes long.",
            "sent3": "The snail traveled at a slow pace, covering only a few mailes in a day.",
            "sent4": "Her love for him spanned countless mailes, never wavering.",
            "sent5": "The road stretched out for mailes, disappearing into the horizon."
        },
        {
            "definition": "A type of armor made of interlinked metal rings.",
            "pos": "noun",
            "sent1": "The knight wore a suit of mailes for protection in battle.",
            "sent2": "The museum displayed ancient mailes worn by warriors.",
            "sent3": "The cat played with the mailes, thinking they were shiny toys.",
            "sent4": "His loyalty was his mailes, shielding him from harm.",
            "sent5": "The mailes clinked softly as the knight moved, a sound of strength."
        },
        {
            "definition": "To send or transport by mail.",
            "pos": "verb",
            "sent1": "She mailes letters to her pen pal every week.",
            "sent2": "The company mailes out invoices to its customers regularly.",
            "sent3": "He mailes his jokes to friends, making them laugh from afar.",
            "sent4": "The memories mailes to her heart, bringing warmth in solitude.",
            "sent5": "The postman mailes packages with care, ensuring safe delivery."
        },
        {
            "definition": "To send or transport by a postal system.",
            "pos": "verb",
            "sent1": "They mailes gifts to their family during the holidays.",
            "sent2": "The office mailes important documents to clients worldwide.",
            "sent3": "He mailes his artwork to galleries for exhibitions.",
            "sent4": "Her words mailes across the miles, reaching him in a heartbeat.",
            "sent5": "The love letter mailes swiftly, carrying emotions in its folds."
        }
    ]
}