{
    "term": "maintains",
    "meanings": [
        {
            "definition": "To keep in existence or continuance; preserve",
            "pos": "verb",
            "sent1": "She maintains her friendship with kindness and care.",
            "sent2": "The old lighthouse maintains its charm despite the years.",
            "sent3": "The magical spell maintains the castle hidden from view.",
            "sent4": "His dedication maintains the balance of nature in the forest.",
            "sent5": "The ancient tradition maintains the spirit of the village alive."
        },
        {
            "definition": "To keep in a certain condition or position",
            "pos": "verb",
            "sent1": "He maintains his room tidy and organized.",
            "sent2": "Regular exercise helps to maintain good health.",
            "sent3": "The clown maintains a funny pose for hours.",
            "sent4": "The strong winds maintain the kite high in the sky.",
            "sent5": "A smile can maintain a positive atmosphere in the room."
        },
        {
            "definition": "To affirm or assert",
            "pos": "verb",
            "sent1": "She maintains that honesty is the best policy.",
            "sent2": "The scientist maintains his theory despite criticism.",
            "sent3": "The detective maintains the suspect's innocence.",
            "sent4": "The teacher maintains that practice leads to improvement.",
            "sent5": "He maintains his innocence in the face of accusations."
        },
        {
            "definition": "To support or defend against opposition",
            "pos": "verb",
            "sent1": "The wall maintains the roof against the strong winds.",
            "sent2": "The lawyer maintains the client's innocence in court.",
            "sent3": "The superhero maintains peace in the city against villains.",
            "sent4": "The shield maintains the soldier safe from enemy attacks.",
            "sent5": "The community maintains unity to stand strong against challenges."
        }
    ]
}