{
    "term": "make",
    "meanings": [
        {
            "definition": "To create or produce something.",
            "pos": "verb",
            "sent1": "I will make a cake for the party.",
            "sent2": "She likes to make drawings with colorful markers.",
            "sent3": "Let's make a deal: I'll wash the dishes if you dry them.",
            "sent4": "Her smile could make the sun jealous.",
            "sent5": "The artist's brushstrokes make the painting come alive."
        },
        {
            "definition": "To cause something to happen.",
            "pos": "verb",
            "sent1": "Eating too much candy can make you sick.",
            "sent2": "The loud noise made the dog bark.",
            "sent3": "His funny jokes always make everyone laugh.",
            "sent4": "Her determination made the impossible possible.",
            "sent5": "The storm clouds make the sky look ominous."
        },
        {
            "definition": "To form or shape something.",
            "pos": "verb",
            "sent1": "She will make a snowman in the yard.",
            "sent2": "The potter used clay to make a beautiful vase.",
            "sent3": "Let's make a heart shape with our hands for the photo.",
            "sent4": "His words make a bridge between two hearts.",
            "sent5": "The sculptor's hands make magic out of marble."
        },
        {
            "definition": "To achieve or earn something.",
            "pos": "verb",
            "sent1": "Studying hard will make you successful.",
            "sent2": "He worked overtime to make extra money.",
            "sent3": "Her dedication will make her dreams come true.",
            "sent4": "His efforts make him a valuable team member.",
            "sent5": "The athlete's training regimen will make him a champion."
        },
        {
            "definition": "To force someone to do something.",
            "pos": "verb",
            "sent1": "The teacher will make the students stay after class.",
            "sent2": "The robber made the cashier open the safe.",
            "sent3": "His parents will make him apologize for his mistake.",
            "sent4": "The dictator's orders make the citizens live in fear.",
            "sent5": "The hypnotist can make people do strange things."
        }
    ]
}