{
    "term": "mal",
    "meanings": [
        {
            "definition": "Bad or harmful",
            "pos": "adjective",
            "sent1": "The storm caused mal damage to the houses in the neighborhood.",
            "sent2": "Eating too much candy can be mal for your teeth.",
            "sent3": "It was mal luck that I forgot my umbrella on such a rainy day.",
            "sent4": "The mal smell coming from the kitchen indicated something was burning.",
            "sent5": "The mal effects of pollution on the environment are evident."
        },
        {
            "definition": "Ill or sick",
            "pos": "adjective",
            "sent1": "After eating the expired food, he felt mal and had to stay in bed.",
            "sent2": "The mal child was taken to the doctor for a check-up.",
            "sent3": "Despite feeling mal, she tried to keep a positive attitude.",
            "sent4": "The mal cat curled up in a warm spot to rest.",
            "sent5": "His mal appearance worried his friends."
        },
        {
            "definition": "Incorrect or faulty",
            "pos": "adjective",
            "sent1": "The mal information in the report led to confusion among the team.",
            "sent2": "The mal clock showed the wrong time.",
            "sent3": "The mal directions caused them to get lost in the city.",
            "sent4": "The mal wiring in the house needed urgent repair.",
            "sent5": "Her mal calculations resulted in the wrong answer."
        },
        {
            "definition": "Evil or wicked",
            "pos": "adjective",
            "sent1": "The villain's plan was full of mal intentions to harm the hero.",
            "sent2": "The witch cast a spell with mal magic to curse the kingdom.",
            "sent3": "The mal queen plotted to take over the kingdom and rule with an iron fist.",
            "sent4": "The mal spirit haunted the old mansion, scaring anyone who dared to enter.",
            "sent5": "The mal deeds of the pirate captain were known far and wide."
        }
    ]
}