{
    "term": "mala",
    "meanings": [
        {
            "definition": "Evil or harmful in nature",
            "pos": "adjective",
            "sent1": "The witch cast a mala spell on the village, causing chaos.",
            "sent2": "The dark forest was filled with mala creatures lurking in the shadows.",
            "sent3": "The mischievous cat had a mala glint in its eyes as it knocked over the vase.",
            "sent4": "The storm brought a mala wind that uprooted trees and scattered debris.",
            "sent5": "The villain's mala laughter echoed through the empty halls, sending shivers down spines."
        },
        {
            "definition": "A type of prayer beads used in Hinduism and Buddhism",
            "pos": "noun",
            "sent1": "During meditation, she held the mala in her hands, focusing on each bead.",
            "sent2": "The monk's mala was intricately crafted with colorful beads and a tassel.",
            "sent3": "As she prayed with the mala, a sense of calm washed over her troubled mind.",
            "sent4": "The mala slipped from his fingers, the beads scattering on the temple floor like whispers.",
            "sent5": "Each bead of the mala represented a mantra, guiding her thoughts towards peace and serenity."
        },
        {
            "definition": "A type of dish in Filipino cuisine made with ground pork and vegetables",
            "pos": "noun",
            "sent1": "The aroma of the sizzling mala filled the kitchen, making mouths water.",
            "sent2": "At the family gathering, everyone enjoyed the flavorful mala served with rice.",
            "sent3": "Grandma's secret ingredient in her mala was a pinch of love and a dash of nostalgia.",
            "sent4": "The sizzling mala in the pan danced with colors and fragrances, tempting all who passed by.",
            "sent5": "The mala dish was a symphony of flavors, each bite a harmonious blend of spices and textures."
        }
    ]
}