{
    "term": "malignant",
    "meanings": [
        {
            "definition": "Evil in nature or effect",
            "pos": "adjective",
            "sent1": "The witch cast a malignant spell on the village, causing crops to wither and animals to fall ill.",
            "sent2": "The malignant presence in the haunted house sent shivers down the spines of those who dared to enter.",
            "sent3": "The cartoon villain had a malignant laugh that made even the hero chuckle.",
            "sent4": "The storm clouds gathered in a malignant formation, ready to unleash their fury upon the land.",
            "sent5": "The malignant shadow crept across the room, filling it with a sense of dread."
        },
        {
            "definition": "Harmful or dangerous",
            "pos": "adjective",
            "sent1": "The doctor warned the patient about the malignant effects of smoking on their health.",
            "sent2": "The spider's bite contained a malignant venom that could paralyze its prey.",
            "sent3": "Leaving the campfire unattended was a malignant mistake that led to a forest fire.",
            "sent4": "The malignant chemicals in the water polluted the river, causing harm to the ecosystem.",
            "sent5": "The hiker avoided the path through the woods, knowing it was filled with malignant creatures."
        },
        {
            "definition": "Showing intense ill will or hatred",
            "pos": "adjective",
            "sent1": "The malignant glare from the rival team's captain made it clear they were not here to make friends.",
            "sent2": "Her malignant words cut deep, leaving a lasting emotional scar on those who heard them.",
            "sent3": "The two cats exchanged a malignant stare before engaging in a fierce battle for dominance.",
            "sent4": "The politician's malignant campaign against his opponent turned the election into a bitter feud.",
            "sent5": "The malignant rivalry between the two families had lasted for generations, fueled by old grudges."
        }
    ]
}