{
    "term": "malignance",
    "meanings": [
        {
            "definition": "The quality or state of being malign or evil.",
            "pos": "noun",
            "sent1": "The town was filled with a sense of malignance after the dark wizard's arrival.",
            "sent2": "The villain's eyes gleamed with malignance as he plotted his next evil deed.",
            "sent3": "The mischievous cat's playful antics had a hint of malignance, making everyone laugh.",
            "sent4": "The storm clouds gathered with a sense of malignance, ready to unleash their fury.",
            "sent5": "The haunted house exuded an aura of malignance, sending shivers down visitors' spines."
        },
        {
            "definition": "The tendency to do harm or cause suffering.",
            "pos": "noun",
            "sent1": "The wild animal showed a clear malignance towards anyone who came near its territory.",
            "sent2": "The dictator ruled with a sense of malignance, oppressing his people at every turn.",
            "sent3": "The mischievous child's pranks had a touch of malignance, causing harmless chaos.",
            "sent4": "The virus spread with a silent malignance, affecting more and more individuals.",
            "sent5": "The dark forest seemed to whisper with a hidden malignance, warning travelers to stay away."
        },
        {
            "definition": "A malignant tumor or growth.",
            "pos": "noun",
            "sent1": "The doctor discovered a malignance in the patient's lung during the routine check-up.",
            "sent2": "The biopsy confirmed the presence of malignance in the tissue sample.",
            "sent3": "The garden weed grew with a stubborn malignance, refusing to be uprooted easily.",
            "sent4": "The shadow on the X-ray revealed the telltale signs of malignance in the bone.",
            "sent5": "The surgeon successfully removed the malignance, bringing relief to the worried family."
        }
    ]
}