{
    "term": "maligning",
    "meanings": [
        {
            "definition": "To speak harmful untruths about; speak evil of; slander; defame.",
            "pos": "verb",
            "sent1": "She was caught maligning her classmate by spreading lies about her.",
            "sent2": "The politician was accused of maligning his opponent during the debate.",
            "sent3": "The parrot started maligning the cat, making up stories about its adventures.",
            "sent4": "The dark clouds seemed to be maligning the sunny sky, threatening a storm.",
            "sent5": "The rumor about the haunted house was so maligning that no one dared to visit."
        },
        {
            "definition": "To speak harmful untruths; slander.",
            "pos": "verb",
            "sent1": "He kept maligning his ex-girlfriend, spreading false rumors about her.",
            "sent2": "The tabloids are known for maligning celebrities with sensational stories.",
            "sent3": "The mischievous child enjoyed maligning his little sister to get her in trouble.",
            "sent4": "The bitter wind seemed to be maligning the fragile flowers, bending them over.",
            "sent5": "The online trolls were busy maligning the author's work, leaving negative reviews everywhere."
        },
        {
            "definition": "To make evil or harmful statements about someone.",
            "pos": "verb",
            "sent1": "The bully was constantly maligning his classmates, making them feel small.",
            "sent2": "The jealous coworker was maligning her colleague to the boss, hoping for a promotion.",
            "sent3": "The comedian was jokingly maligning his own cooking skills during the show.",
            "sent4": "The graffiti on the wall seemed to be maligning the city's reputation, drawing negative attention.",
            "sent5": "The fake news article was maligning the scientist's research, causing confusion among readers."
        }
    ]
}