{
    "term": "mallet",
    "meanings": [
        {
            "definition": "A hammer with a large head, typically made of wood or rubber, used for striking a surface.",
            "pos": "noun",
            "sent1": "The carpenter used a mallet to drive the nail into the wood.",
            "sent2": "She picked up the mallet and began to pound the steak for dinner.",
            "sent3": "The mischievous squirrel mistook the mallet for a nut and tried to crack it open.",
            "sent4": "His words hit her heart like a heavy mallet, leaving a lasting impact.",
            "sent5": "The sound of the mallet hitting the gong echoed through the room."
        },
        {
            "definition": "A small wooden hammer used in croquet or polo.",
            "pos": "noun",
            "sent1": "During the game, she skillfully swung the mallet to hit the ball through the hoop.",
            "sent2": "The children giggled as they played with the colorful mallets in the backyard.",
            "sent3": "The tiny mouse tried to lift the mallet, thinking it was a giant cheese wheel.",
            "sent4": "Her determination was a mallet, smashing through any obstacles in her path.",
            "sent5": "The mallet's smooth handle felt comfortable in her grip as she aimed for the target."
        },
        {
            "definition": "A tool resembling a hammer but with a large head and a short handle, used for shaping metal.",
            "pos": "noun",
            "sent1": "The blacksmith carefully wielded the mallet to shape the red-hot metal into a horseshoe.",
            "sent2": "The sculptor used a mallet and chisel to carve intricate designs into the marble.",
            "sent3": "The clumsy magician accidentally turned his wand into a mallet during the trick.",
            "sent4": "Her laughter was a gentle mallet, shaping his rough edges into a smile.",
            "sent5": "The rhythmic sound of the mallet on the anvil filled the workshop with music."
        }
    ]
}