{
    "term": "malnutritions",
    "meanings": [
        {
            "definition": "Lack of proper nutrition or inadequate food intake.",
            "pos": "noun",
            "sent1": "The malnutritions of the children in the village were evident from their pale skin and weak bodies.",
            "sent2": "The doctor explained that the malnutritions were causing the child's slow growth and development.",
            "sent3": "The malnutritions in the school cafeteria made the students joke about the mystery meat served for lunch.",
            "sent4": "The malnutritions in the community were like a dark cloud overshadowing their health and well-being.",
            "sent5": "The severity of malnutritions in the region was a wake-up call for the authorities to take action."
        },
        {
            "definition": "Poor nourishment resulting from an unbalanced diet.",
            "pos": "noun",
            "sent1": "Her constant snacking on junk food led to malnutritions that affected her overall health.",
            "sent2": "The doctor advised the patient to eat a variety of foods to avoid malnutritions.",
            "sent3": "The malnutritions caused by his love for sugary drinks made him reconsider his beverage choices.",
            "sent4": "The impact of malnutritions on her energy levels was like trying to run on an empty tank.",
            "sent5": "The consequences of malnutritions were a clear sign that dietary changes were necessary."
        },
        {
            "definition": "The state of being poorly nourished or undernourished.",
            "pos": "noun",
            "sent1": "The malnutritions of the elderly woman were a result of living alone and skipping meals.",
            "sent2": "The doctor recommended supplements to combat the malnutritions affecting the patient.",
            "sent3": "His refusal to eat vegetables led to malnutritions that surprised his friends.",
            "sent4": "The cycle of malnutritions seemed never-ending for those living in poverty.",
            "sent5": "The visible signs of malnutritions prompted a community effort to provide nutritious meals."
        }
    ]
}