{
    "term": "mammae",
    "meanings": [
        {
            "definition": "The milk-secreting organ of female mammals.",
            "pos": "noun",
            "sent1": "The mammae of a cat provide nourishment for her kittens.",
            "sent2": "The mother cat's mammae are full of milk for her babies.",
            "sent3": "The playful kittens enjoy batting at their mother's mammae.",
            "sent4": "Her love flowed like milk from her mammae, nurturing all around her.",
            "sent5": "The mammae of the cow were udderly impressive in size."
        },
        {
            "definition": "A milk-secreting organ of female mammals.",
            "pos": "noun",
            "sent1": "The mammae of a dog are essential for feeding her puppies.",
            "sent2": "The puppy eagerly suckled on its mother's mammae.",
            "sent3": "The dog's mammae were ticklish, making her squirm when the puppies nursed.",
            "sent4": "Her generosity flowed from her heart to her mammae, providing for all in need.",
            "sent5": "The mammae of the rabbit were soft and warm, comforting the little ones."
        },
        {
            "definition": "The milk-secreting organ of a female mammal.",
            "pos": "noun",
            "sent1": "The mammae of the squirrel are vital for the survival of her babies.",
            "sent2": "The squirrel's mammae were swollen with milk for her young.",
            "sent3": "The mischievous squirrel used her mammae to distract the other animals.",
            "sent4": "Her compassion poured out like milk from her mammae, nurturing those in need.",
            "sent5": "The mammae of the squirrel were a symbol of motherly care in the forest."
        },
        {
            "definition": "A milk-secreting organ of a female mammal.",
            "pos": "noun",
            "sent1": "The mammae of the deer provide sustenance for their fawns.",
            "sent2": "The fawn nuzzled against its mother's mammae for milk.",
            "sent3": "The deer's mammae jiggled as she ran through the meadow.",
            "sent4": "Her kindness flowed like milk from her mammae, nurturing all creatures.",
            "sent5": "The mammae of the deer were a source of life and comfort in the woods."
        }
    ]
}