{
    "term": "mammitis",
    "meanings": [
        {
            "definition": "Inflammation of the mammary gland.",
            "pos": "noun",
            "sent1": "The vet diagnosed the cow with mammitis after noticing redness and swelling in the udder.",
            "sent2": "She experienced mammitis after giving birth, causing discomfort and tenderness in her breast.",
            "sent3": "The farmer joked that the cow's mammitis made her udder look like a balloon animal.",
            "sent4": "The mammitis in the dairy cow's udder was like a storm brewing, causing pain and distress.",
            "sent5": "The image of the inflamed mammary gland with mammitis was hard to forget."
        },
        {
            "definition": "A condition characterized by swelling and pain in the breast.",
            "pos": "noun",
            "sent1": "Her mammitis caused her breast to become red, swollen, and tender to the touch.",
            "sent2": "The doctor prescribed medication to alleviate the symptoms of mammitis in her breast.",
            "sent3": "She tried to lighten the mood by saying her mammitis made her feel like she had a hot water bottle strapped to her chest.",
            "sent4": "The mammitis felt like a heavy weight pressing down on her chest, making every movement painful.",
            "sent5": "The throbbing pain of mammitis in her breast made it hard for her to focus on anything else."
        },
        {
            "definition": "An infection of the breast tissue.",
            "pos": "noun",
            "sent1": "The doctor confirmed that the redness and warmth in her breast were signs of mammitis.",
            "sent2": "Mammitis can be treated with antibiotics to clear the infection in the breast tissue.",
            "sent3": "She compared her mammitis to a tiny army attacking her breast tissue, causing chaos and discomfort.",
            "sent4": "The infection spread quickly, turning her mammitis into a serious health concern for her breast tissue.",
            "sent5": "The throbbing pain of mammitis in her breast tissue was a constant reminder of the infection."
        }
    ]
}