{
    "term": "mandrel",
    "meanings": [
        {
            "definition": "a shaft or bar that holds or turns a workpiece in a lathe or other machine tool",
            "pos": "noun",
            "sent1": "The mandrel spun the metal piece smoothly in the lathe.",
            "sent2": "The machinist inserted the mandrel to secure the workpiece in place.",
            "sent3": "The mandrel decided to take a break from spinning metal and try pottery instead.",
            "sent4": "Her determination was like a sturdy mandrel, holding everything together in her life.",
            "sent5": "The mandrel's role was crucial, ensuring the workpiece was accurately shaped."
        },
        {
            "definition": "a tool used for shaping, forming, or finishing cylindrical objects",
            "pos": "noun",
            "sent1": "The craftsman used the mandrel to shape the metal rod into a perfect circle.",
            "sent2": "A mandrel is essential for creating precise cylindrical forms in metalworking.",
            "sent3": "The mandrel joked with the hammer, saying, 'I shape, you pound!'",
            "sent4": "His precision in woodworking was like that of a skilled mandrel, refining every detail.",
            "sent5": "The mandrel's smooth surface ensured the cylindrical objects were perfectly finished."
        },
        {
            "definition": "a spindle used to support a workpiece in a lathe",
            "pos": "noun",
            "sent1": "The mandrel provided stability for the workpiece as it rotated in the lathe.",
            "sent2": "In woodworking, a mandrel is crucial for holding the workpiece securely.",
            "sent3": "The mandrel challenged the lathe to a spinning contest and won by a thread.",
            "sent4": "She leaned on her friends like a reliable mandrel, supporting her through tough times.",
            "sent5": "The mandrel's role as a spindle ensured the workpiece was perfectly supported during turning."
        }
    ]
}