{
    "term": "manis",
    "meanings": [
        {
            "definition": "A mammal of the order Pholidota, having a body covered with horny overlapping scales and a long snout.",
            "pos": "noun",
            "sent1": "The manis moved slowly through the forest, its scales glinting in the sunlight.",
            "sent2": "I learned about the manis in my science class and found them fascinating creatures.",
            "sent3": "The manis tried to wear a coat made of leaves, thinking it could blend in better with the trees.",
            "sent4": "Her determination was as tough as the scales of a manis, never giving up on her goals.",
            "sent5": "The manis's snout twitched as it sniffed the air, searching for ants to eat."
        },
        {
            "definition": "A genus of mammals in the family Manidae, including the pangolins.",
            "pos": "noun",
            "sent1": "The manis genus is known for its unique characteristics that set it apart from other mammals.",
            "sent2": "Scientists study the manis genus to understand more about the diversity of wildlife.",
            "sent3": "At the zoo, the manis genus put on a fashion show with their stylish scales.",
            "sent4": "The manis genus symbolizes resilience and adaptability in the animal kingdom.",
            "sent5": "Children were excited to see the manis genus up close during their field trip."
        },
        {
            "definition": "A type of anteater found in Southeast Asia, also known as a scaly anteater.",
            "pos": "noun",
            "sent1": "The manis in the zoo curled up into a ball when it felt threatened.",
            "sent2": "Tourists were thrilled to catch a glimpse of the manis during their jungle trek.",
            "sent3": "The manis decided to take up painting, using its scales to create unique patterns.",
            "sent4": "Her love for nature was as strong as the bond between a mother manis and her offspring.",
            "sent5": "The manis's long snout was perfectly adapted for reaching into narrow crevices for food."
        }
    ]
}