{
    "term": "manoeuver",
    "meanings": [
        {
            "definition": "a planned movement or series of moves",
            "pos": "noun",
            "sent1": "The military commander ordered a clever manoeuver to outsmart the enemy.",
            "sent2": "The dancers executed a flawless manoeuver during the performance.",
            "sent3": "The cat's sneaky manoeuver to steal the fish from the table was caught on camera.",
            "sent4": "Her manoeuver to navigate through the crowded room was like a graceful dance.",
            "sent5": "The quarterback's winning manoeuver in the final seconds of the game amazed the crowd."
        },
        {
            "definition": "to move skillfully or carefully",
            "pos": "verb",
            "sent1": "She had to manoeuver the large box through the narrow doorway.",
            "sent2": "The skilled driver manoeuvered through heavy traffic with ease.",
            "sent3": "The chef had to manoeuver the hot pan without burning himself.",
            "sent4": "He had to manoeuver his way through the maze of obstacles in the dark.",
            "sent5": "The acrobat expertly manoeuvered through the challenging obstacle course."
        },
        {
            "definition": "a skillful or strategic action",
            "pos": "noun",
            "sent1": "Her clever manoeuver in the negotiation secured a great deal for her company.",
            "sent2": "The chess player's winning manoeuver surprised his opponent.",
            "sent3": "The comedian's witty manoeuver had the audience laughing uncontrollably.",
            "sent4": "The detective's brilliant manoeuver solved the mysterious case.",
            "sent5": "The politician's strategic manoeuver gained him support from unexpected quarters."
        },
        {
            "definition": "to manipulate or manage with skill",
            "pos": "verb",
            "sent1": "He tried to manoeuver the conversation away from the sensitive topic.",
            "sent2": "The magician deftly manoeuvered the cards to perform a stunning trick.",
            "sent3": "She had to manoeuver the situation carefully to avoid any misunderstandings.",
            "sent4": "The coach manoeuvered the team to victory with his clever tactics.",
            "sent5": "The artist skillfully manoeuvered the brush to create a masterpiece on canvas."
        }
    ]
}