{
    "term": "manoeuvre",
    "meanings": [
        {
            "definition": "a movement or series of moves requiring skill and care",
            "pos": "noun",
            "sent1": "The ballet dancer's graceful manoeuvre captivated the audience.",
            "sent2": "The military commander planned a complex manoeuvre to outsmart the enemy.",
            "sent3": "The cat's sneaky manoeuvre to steal the fish from the table amused the family.",
            "sent4": "Her clever manoeuvre in the negotiation room secured the deal.",
            "sent5": "The acrobat's daring manoeuvre left everyone in awe."
        },
        {
            "definition": "a planned and controlled movement or series of movements",
            "pos": "noun",
            "sent1": "The synchronized swimmers executed a flawless manoeuvre in the pool.",
            "sent2": "The pilot performed a precise manoeuvre to land the plane safely.",
            "sent3": "The robot's programmed manoeuvre to clean the house impressed the owners.",
            "sent4": "The chess player's strategic manoeuvre checkmated the opponent.",
            "sent5": "The synchronized dance group's intricate manoeuvre amazed the audience."
        },
        {
            "definition": "to move skillfully or carefully",
            "pos": "verb",
            "sent1": "She had to manoeuvre through the crowded market to reach the other side.",
            "sent2": "The athlete manoeuvred past the defenders to score a goal.",
            "sent3": "The squirrel deftly manoeuvred around the branches to find the perfect nut.",
            "sent4": "He manoeuvred the boat expertly through the narrow canal.",
            "sent5": "The driver manoeuvred the car smoothly into the parking spot."
        },
        {
            "definition": "to manipulate or manage in a skillful manner",
            "pos": "verb",
            "sent1": "The politician tried to manoeuvre public opinion in his favor.",
            "sent2": "She deftly manoeuvred the conversation away from the sensitive topic.",
            "sent3": "The magician's trick was to manoeuvre the cards without anyone noticing.",
            "sent4": "He manoeuvred his way into getting the promotion at work.",
            "sent5": "The coach manoeuvred the team to victory with clever tactics."
        }
    ]
}