{
    "term": "maomao",
    "meanings": [
        {
            "definition": "A type of fish found in New Zealand waters.",
            "pos": "noun",
            "sent1": "I saw a maomao swimming gracefully in the ocean.",
            "sent2": "The maomao is a colorful fish with shiny scales.",
            "sent3": "The maomao fish decided to throw a party in the coral reef.",
            "sent4": "The maomao fish danced in the water like a shimmering jewel.",
            "sent5": "The maomao fish's scales sparkled under the sunlight."
        },
        {
            "definition": "A type of Chinese dumpling.",
            "pos": "noun",
            "sent1": "I love eating maomao with soy sauce.",
            "sent2": "The maomao dumplings were steaming hot and delicious.",
            "sent3": "The maomao dumplings jumped out of the steamer and started singing.",
            "sent4": "The maomao dumplings were like little pockets of happiness.",
            "sent5": "The aroma of the maomao dumplings filled the room."
        },
        {
            "definition": "A type of red algae.",
            "pos": "noun",
            "sent1": "The maomao algae added a pop of color to the ocean floor.",
            "sent2": "Scientists studied the unique properties of maomao algae.",
            "sent3": "The maomao algae threw a tiny party with other sea creatures.",
            "sent4": "The maomao algae swayed gently with the ocean currents.",
            "sent5": "The maomao algae glowed like a tiny lantern in the dark sea."
        },
        {
            "definition": "A type of bird native to New Zealand.",
            "pos": "noun",
            "sent1": "The maomao bird chirped a cheerful tune in the forest.",
            "sent2": "Maomao birds have beautiful plumage and melodious songs.",
            "sent3": "The maomao bird challenged the other birds to a singing contest.",
            "sent4": "The maomao bird soared through the sky with grace and elegance.",
            "sent5": "The colorful maomao bird stood out among the green foliage."
        }
    ]
}