{
    "term": "maraud",
    "meanings": [
        {
            "definition": "To roam or go around in search of things to steal or people to attack.",
            "pos": "verb",
            "sent1": "The bandits would maraud through the forest looking for valuables.",
            "sent2": "Pirates often marauded along the coast, taking whatever they pleased.",
            "sent3": "The mischievous raccoon decided to maraud through the picnic area, looking for snacks.",
            "sent4": "The storm clouds seemed to maraud across the sky, threatening to unleash their fury.",
            "sent5": "The wolves would silently maraud through the snow-covered woods, hunting for prey."
        },
        {
            "definition": "To raid and plunder.",
            "pos": "verb",
            "sent1": "The barbarians would often maraud villages, taking all they could carry.",
            "sent2": "The Vikings were known to maraud coastal towns, leaving destruction in their wake.",
            "sent3": "The children playfully pretended to maraud the toy store, grabbing all the toys they could find.",
            "sent4": "The locusts seemed to maraud through the fields, devouring everything in their path.",
            "sent5": "The thieves planned to maraud the museum, stealing priceless artifacts under the cover of night."
        },
        {
            "definition": "A person who roams around in search of things to steal or people to attack.",
            "pos": "noun",
            "sent1": "The maraud was spotted sneaking around the marketplace, eyeing the merchants' goods.",
            "sent2": "Legends spoke of a fearsome maraud who terrorized the countryside.",
            "sent3": "The little boy dressed up as a maraud for Halloween, carrying a toy sword and eye patch.",
            "sent4": "The maraud of the sea was feared by all sailors who crossed its path.",
            "sent5": "The cunning maraud knew all the secret paths through the forest, making it impossible to catch."
        }
    ]
}