{
    "term": "mara",
    "meanings": [
        {
            "definition": "A large, herbivorous mammal native to South America.",
            "pos": "noun",
            "sent1": "The mara grazed peacefully in the grassy meadow.",
            "sent2": "I saw a mara at the zoo last weekend.",
            "sent3": "The mara decided to join the local wildlife party.",
            "sent4": "Her presence was like a mara, gentle yet powerful.",
            "sent5": "The mara's long ears twitched as it listened for danger."
        },
        {
            "definition": "A bitter and aromatic South American herb used in cooking.",
            "pos": "noun",
            "sent1": "The mara added a unique flavor to the stew.",
            "sent2": "The recipe called for a pinch of mara.",
            "sent3": "The mara herb danced in the pot, releasing its fragrance.",
            "sent4": "The mara transformed the dish into a culinary masterpiece.",
            "sent5": "The aroma of mara filled the kitchen, making mouths water."
        },
        {
            "definition": "A type of shrub or tree found in arid regions.",
            "pos": "noun",
            "sent1": "The mara provided shade in the desert.",
            "sent2": "The mara tree stood tall against the harsh sun.",
            "sent3": "The mara bush whispered secrets to the passing wind.",
            "sent4": "The mara's branches reached out like welcoming arms.",
            "sent5": "Under the mara's canopy, travelers found respite from the heat."
        },
        {
            "definition": "A term used in the Philippines to refer to a ghost or spirit.",
            "pos": "noun",
            "sent1": "The mara haunted the old house on the hill.",
            "sent2": "Local legends spoke of the mara's restless spirit.",
            "sent3": "The mischievous mara played pranks on unsuspecting villagers.",
            "sent4": "The mara's presence sent shivers down their spines.",
            "sent5": "In the moonlight, the mara appeared ethereal and mysterious."
        }
    ]
}