{
    "term": "marantas",
    "meanings": [
        {
            "definition": "Marantas: a genus of tropical American plants commonly known as prayer plants.",
            "pos": "noun",
            "sent1": "I love how marantas move their leaves throughout the day, resembling hands in prayer.",
            "sent2": "In the garden, the marantas added a touch of greenery and tranquility.",
            "sent3": "The marantas in the greenhouse seemed to be having a conversation with each other.",
            "sent4": "The marantas in the room danced gracefully under the sunlight, as if in a silent performance.",
            "sent5": "The vibrant colors of the marantas made them stand out among the other plants."
        },
        {
            "definition": "Marantas: the plural form of maranta, a type of plant.",
            "pos": "noun",
            "sent1": "The marantas in the botanical garden were a sight to behold.",
            "sent2": "We planted marantas in our backyard to create a lush green corner.",
            "sent3": "The marantas in the pot seemed to be gossiping about the other plants.",
            "sent4": "The marantas in the forest stood tall and proud, a symbol of nature's beauty.",
            "sent5": "The delicate leaves of the marantas swayed gently in the breeze, like a natural dance."
        },
        {
            "definition": "Marantas: belonging to the genus Maranta.",
            "pos": "noun",
            "sent1": "The marantas in the exhibit were carefully labeled with their scientific names.",
            "sent2": "Each of the marantas in the collection had unique patterns on their leaves.",
            "sent3": "The marantas in the greenhouse seemed to be showing off their intricate designs.",
            "sent4": "The marantas in the garden were like pieces of art scattered among the flowers.",
            "sent5": "The marantas in the conservatory thrived in the controlled environment, showcasing their beauty."
        }
    ]
}