{
    "term": "marginalize",
    "meanings": [
        {
            "definition": "Treat (a person, group, or concept) as insignificant or peripheral.",
            "pos": "verb",
            "sent1": "Some people try to marginalize others by not including them in activities.",
            "sent2": "It is not right to marginalize someone just because they are different.",
            "sent3": "At the party, they tried to marginalize the new student, but he ended up having the most fun.",
            "sent4": "Her loud voice tends to marginalize the opinions of others in the group.",
            "sent5": "The teacher's constant praise helped to marginalize the shy student's fears of speaking up."
        },
        {
            "definition": "Make (someone) feel isolated or unimportant.",
            "pos": "verb",
            "sent1": "Bullying can marginalize a person and make them feel alone.",
            "sent2": "She didn't mean to marginalize her friend by forgetting to invite her to the party.",
            "sent3": "The cat's refusal to play with the dog seemed to marginalize him in the pet community.",
            "sent4": "The dark clouds seemed to marginalize the sun, casting a shadow over the whole town.",
            "sent5": "The boss's constant criticism started to marginalize the employee, making him doubt his abilities."
        },
        {
            "definition": "Exclude or ignore (someone) from a group or society.",
            "pos": "verb",
            "sent1": "It is hurtful to marginalize others by leaving them out of important discussions.",
            "sent2": "She felt marginalized when her classmates purposely ignored her during lunch.",
            "sent3": "The mischievous squirrel seemed to marginalize the birds by stealing all the birdseed.",
            "sent4": "The loud music at the party seemed to marginalize those who preferred quiet conversations.",
            "sent5": "The strict rules of the club started to marginalize members who couldn't attend every meeting."
        }
    ]
}