{
    "term": "marginalizations",
    "meanings": [
        {
            "definition": "The act of treating a person or group as insignificant or peripheral.",
            "pos": "noun",
            "sent1": "The teacher's constant marginalizations of the quiet students in class were noticeable.",
            "sent2": "Systemic marginalizations based on race have long-lasting effects on communities.",
            "sent3": "The penguin's marginalizations of the smallest fish in the group led to a comical underwater chase.",
            "sent4": "In the forest, the tall trees' marginalizations of the smaller plants created a stark contrast in size.",
            "sent5": "The movie vividly portrayed the harsh reality of societal marginalizations through powerful storytelling."
        },
        {
            "definition": "The process of relegating someone to a lower social standing.",
            "pos": "noun",
            "sent1": "The company's marginalizations of employees from certain backgrounds were unfair.",
            "sent2": "Historically, marginalizations have been used to maintain power dynamics.",
            "sent3": "The cat's marginalizations of the new kitten were met with playful resistance.",
            "sent4": "The storm's marginalizations of the weaker structures highlighted their vulnerability.",
            "sent5": "The novel described the protagonist's journey through various marginalizations with empathy and insight."
        },
        {
            "definition": "The state of being excluded or pushed to the edges of society.",
            "pos": "noun",
            "sent1": "The student felt the weight of societal marginalizations due to their unique beliefs.",
            "sent2": "Economic marginalizations can lead to cycles of poverty in certain communities.",
            "sent3": "The squirrel's marginalizations from the group led to a humorous adventure in the park.",
            "sent4": "The river's marginalizations of the surrounding land shaped the landscape over time.",
            "sent5": "Through art, the artist expressed the pain of experiencing societal marginalizations in a powerful way."
        }
    ]
}