{
    "term": "marginalization",
    "meanings": [
        {
            "definition": "The act of treating a person or group as insignificant or peripheral.",
            "pos": "noun",
            "sent1": "The teacher's constant marginalization of the quiet students in class was unfair.",
            "sent2": "The marginalization of certain ethnic groups in society is a serious issue that needs to be addressed.",
            "sent3": "During the game, the ball felt the marginalization of being kicked out of bounds.",
            "sent4": "In the world of nature, the weaker animals often face the harsh reality of marginalization by predators.",
            "sent5": "The novel vividly portrayed the emotional impact of marginalization on the main character."
        },
        {
            "definition": "The process of relegating someone to a lower social standing.",
            "pos": "noun",
            "sent1": "The company's policy of marginalization based on appearance led to discrimination.",
            "sent2": "Historically, marginalization has been used as a tool to maintain power dynamics.",
            "sent3": "At the costume party, the superhero felt the marginalization of being mistaken for a sidekick.",
            "sent4": "In the schoolyard, the bullies' actions resulted in the marginalization of the new student.",
            "sent5": "The documentary highlighted the long-term effects of social marginalization on individuals."
        },
        {
            "definition": "The state of being pushed to the edges or margins of society.",
            "pos": "noun",
            "sent1": "The artist felt the marginalization of their work in the art community.",
            "sent2": "Economic policies can lead to the marginalization of certain populations within a country.",
            "sent3": "During the family gathering, the youngest sibling joked about the marginalization of the middle child.",
            "sent4": "In the bustling city, the old bookstore faced the constant threat of marginalization by digital platforms.",
            "sent5": "The photograph captured the stark reality of urban marginalization in the neglected neighborhood."
        }
    ]
}