{
    "term": "mariposas",
    "meanings": [
        {
            "definition": "butterflies",
            "pos": "noun",
            "sent1": "The garden was filled with beautiful mariposas fluttering around.",
            "sent2": "I saw a group of mariposas flying gracefully in the meadow.",
            "sent3": "The mariposas danced in the air, painting the sky with their colors.",
            "sent4": "Her dress was adorned with mariposas, making her look like a fairy.",
            "sent5": "The mariposas landed on the flowers, adding a touch of magic to the garden."
        },
        {
            "definition": "fluttering insects",
            "pos": "noun",
            "sent1": "The mariposas floated gently in the breeze, their wings shimmering.",
            "sent2": "Children giggled as they chased the colorful mariposas in the park.",
            "sent3": "The mariposas played hide and seek among the leaves, teasing the children.",
            "sent4": "The field was alive with the sound of mariposas fluttering around.",
            "sent5": "The mariposas seemed to be whispering secrets as they fluttered by."
        },
        {
            "definition": "a type of insect with colorful wings",
            "pos": "noun",
            "sent1": "In the exhibit, we saw mariposas of all sizes and colors.",
            "sent2": "The mariposas landed on the flowers, their wings a vibrant display.",
            "sent3": "The children were amazed by the mariposas, each one more beautiful than the last.",
            "sent4": "The mariposas seemed to be dancing in the sunlight, their wings a rainbow of hues.",
            "sent5": "The garden was a kaleidoscope of colors with the mariposas fluttering around."
        },
        {
            "definition": "symbols of transformation and beauty",
            "pos": "noun",
            "sent1": "The mariposas emerging from their cocoons were a symbol of hope and change.",
            "sent2": "In many cultures, mariposas are seen as symbols of rebirth and renewal.",
            "sent3": "The mariposas seemed to be whispering secrets as they fluttered by.",
            "sent4": "The mariposas' journey from caterpillar to butterfly symbolizes transformation.",
            "sent5": "The mariposas' delicate wings are a testament to the beauty of nature."
        }
    ]
}