{
    "term": "markas",
    "meanings": [
        {
            "definition": "A visible impression or trace on a surface.",
            "pos": "noun",
            "sent1": "I found a markas on the table where the cup was placed.",
            "sent2": "The artist left a markas of their handprint on the canvas.",
            "sent3": "The mischievous cat left a markas of its paw prints on the freshly mopped floor.",
            "sent4": "The markas of history can be seen in the ancient ruins of the city.",
            "sent5": "The markas of the car's tire tracks showed where it had been parked."
        },
        {
            "definition": "A symbol or sign used to represent something.",
            "pos": "noun",
            "sent1": "In the story, the sword served as a markas of bravery.",
            "sent2": "The dove is often seen as a markas of peace.",
            "sent3": "The crown worn by the king was a markas of his royal status.",
            "sent4": "The flag acted as a markas of the country's identity.",
            "sent5": "The heart shape is a common markas of love and affection."
        },
        {
            "definition": "To indicate or make note of something.",
            "pos": "verb",
            "sent1": "Please markas the important points in the text with a highlighter.",
            "sent2": "She used a sticky note to markas the page where she left off reading.",
            "sent3": "The teacher asked the students to markas the errors in their essays.",
            "sent4": "The map will help us markas the locations of the different landmarks.",
            "sent5": "I need to markas the dates of the upcoming meetings on my calendar."
        },
        {
            "definition": "A grade or score given for academic work.",
            "pos": "noun",
            "sent1": "She received a high markas on her science project.",
            "sent2": "The students eagerly awaited their test markas.",
            "sent3": "His markas on the exam reflected his hard work and preparation.",
            "sent4": "The markas on the essay indicated a thorough understanding of the topic.",
            "sent5": "The markas on the report card showed steady improvement throughout the semester."
        },
        {
            "definition": "A target or goal to aim for.",
            "pos": "noun",
            "sent1": "The championship trophy was their ultimate markas.",
            "sent2": "Setting a new personal record became her markas in the race.",
            "sent3": "The team saw winning the tournament as their markas for the season.",
            "sent4": "The successful completion of the project was their markas for the month.",
            "sent5": "The promotion at work became his markas for the year."
        }
    ]
}