{
    "term": "marka",
    "meanings": [
        {
            "definition": "A unit of currency in Bosnia and Herzegovina.",
            "pos": "noun",
            "sent1": "In Bosnia and Herzegovina, you can buy many things with just one marka.",
            "sent2": "I exchanged my dollars for Bosnian marka at the bank.",
            "sent3": "The marka in my pocket whispered, 'Spend me wisely.'",
            "sent4": "Her smile was like a shiny marka, brightening up the room.",
            "sent5": "The marka jingled happily in the vendor's hand."
        },
        {
            "definition": "A visible impression or trace on something.",
            "pos": "noun",
            "sent1": "The muddy marka on the carpet showed where the dog had been.",
            "sent2": "She left a marka on the wet cement with her shoe.",
            "sent3": "The marka on the paper looked like a tiny footprint.",
            "sent4": "His words left a marka on her heart that would never fade.",
            "sent5": "The marka of the pen lingered on the page."
        },
        {
            "definition": "A symbol or sign used to represent something.",
            "pos": "noun",
            "sent1": "The red rose was a marka of love and passion.",
            "sent2": "In some cultures, the owl is considered a marka of wisdom.",
            "sent3": "The marka of the dove symbolized peace and harmony.",
            "sent4": "Her laughter was a marka of joy in the room.",
            "sent5": "The marka of the cross held deep meaning for the community."
        },
        {
            "definition": "To make a visible impression on something.",
            "pos": "verb",
            "sent1": "She used a hammer to marka her initials on the tree trunk.",
            "sent2": "The artist carefully marked the canvas with his signature.",
            "sent3": "The cat tried to marka its territory on the new rug.",
            "sent4": "His words seemed to marka her soul with understanding.",
            "sent5": "The storm's fury marked the landscape with destruction."
        },
        {
            "definition": "To indicate or show something.",
            "pos": "verb",
            "sent1": "The map will marka the location of the hidden treasure.",
            "sent2": "His expression marked his disappointment clearly.",
            "sent3": "The compass needle seemed to marka a mysterious direction.",
            "sent4": "The clock's ticking marked the passing of time.",
            "sent5": "The teacher's smile marked her approval of the students' hard work."
        }
    ]
}