{
    "term": "marks",
    "meanings": [
        {
            "definition": "A visible impression or stain on a surface.",
            "pos": "noun",
            "sent1": "The muddy marks on the floor showed where the dog had been.",
            "sent2": "She carefully wiped the marks off the mirror with a cloth.",
            "sent3": "The cake had marks of chocolate frosting all over it, making it look like a messy masterpiece.",
            "sent4": "The old building bore marks of time with its weathered walls and faded paint.",
            "sent5": "The bright red marks on the white paper stood out like a beacon."
        },
        {
            "definition": "A symbol or character used in writing or printing.",
            "pos": "noun",
            "sent1": "The letter 'A' is one of the marks in the English alphabet.",
            "sent2": "He made a few marks on the paper to indicate where to sign.",
            "sent3": "The mysterious marks on the ancient scroll seemed to tell a secret story.",
            "sent4": "Her smile left a mark on his heart that he couldn't forget.",
            "sent5": "The marks on the map showed the route to the hidden treasure."
        },
        {
            "definition": "A grade or score given for academic work.",
            "pos": "noun",
            "sent1": "She was proud of the high marks she received on her test.",
            "sent2": "The teacher wrote the marks in red ink at the top of the page.",
            "sent3": "His friends teased him about getting low marks on the math quiz.",
            "sent4": "The marks on her report card reflected her hard work throughout the semester.",
            "sent5": "He aimed to achieve top marks in all his subjects this year."
        },
        {
            "definition": "A sign or indication of something.",
            "pos": "noun",
            "sent1": "The dark clouds were marks of an approaching storm.",
            "sent2": "His sudden silence was a clear mark of his discomfort.",
            "sent3": "The loud laughter in the room was a mark of a joyful gathering.",
            "sent4": "The empty streets were a mark of the late hour.",
            "sent5": "The warm hug she received was a mark of their friendship."
        }
    ]
}