{
    "term": "marked",
    "meanings": [
        {
            "definition": "Having a visible sign or indication",
            "pos": "adjective",
            "sent1": "The map had a marked trail for hikers to follow.",
            "sent2": "Her excitement was marked by a big smile on her face.",
            "sent3": "The cat's marked interest in the moving laser pointer was amusing to watch.",
            "sent4": "The impact of the storm was marked by fallen trees and power outages.",
            "sent5": "The teacher's marked enthusiasm for science made the subject come alive for the students."
        },
        {
            "definition": "Clearly noticeable or evident",
            "pos": "adjective",
            "sent1": "The smell of fresh cookies was marked in the kitchen.",
            "sent2": "His disappointment was marked by a frown on his face.",
            "sent3": "The marked absence of birds in the park was quite unusual.",
            "sent4": "The impact of her words was marked by the silence that followed.",
            "sent5": "The marked improvement in her grades brought a smile to her face."
        },
        {
            "definition": "To make a visible impression on",
            "pos": "verb",
            "sent1": "She marked her initials on the tree trunk with a heart around them.",
            "sent2": "The accident marked the road with skid marks.",
            "sent3": "He marked his territory by placing a 'No Trespassing' sign.",
            "sent4": "The artist marked the canvas with bold strokes of color.",
            "sent5": "The memory of that day marked her heart forever."
        },
        {
            "definition": "To indicate or designate",
            "pos": "verb",
            "sent1": "Please mark the date of the meeting on your calendar.",
            "sent2": "The sign marked the entrance to the hiking trail.",
            "sent3": "His red shirt marked him as part of the volunteer team.",
            "sent4": "The bell ringing marked the end of the school day.",
            "sent5": "The trophy marked her achievement in the competition."
        },
        {
            "definition": "To set apart or distinguish",
            "pos": "verb",
            "sent1": "The special badge marked him as a VIP guest.",
            "sent2": "The unique design marked the product as a limited edition.",
            "sent3": "Her kindness marked her as a true friend.",
            "sent4": "The ancient ruins marked the historical significance of the area.",
            "sent5": "The rare flower marked the beauty of the garden."
        }
    ]
}