{
    "term": "mark",
    "meanings": [
        {
            "definition": "A visible impression or trace on a surface.",
            "pos": "noun",
            "sent1": "She found a small mark on the wall.",
            "sent2": "The teacher put a check mark next to the correct answer.",
            "sent3": "The detective followed the marks left by the suspect.",
            "sent4": "His kindness left a mark on her heart.",
            "sent5": "The mark on the tree showed where the squirrel had climbed."
        },
        {
            "definition": "A symbol or character used in writing or printing.",
            "pos": "noun",
            "sent1": "The book had a strange mark on the cover.",
            "sent2": "In English, the question mark is used to end a sentence.",
            "sent3": "The mark on the map indicated a hidden treasure.",
            "sent4": "Her smile was like a punctuation mark in his day.",
            "sent5": "The mark on the coin represented the country of origin."
        },
        {
            "definition": "A sign or indication of something.",
            "pos": "noun",
            "sent1": "Dark clouds were a mark of the coming storm.",
            "sent2": "His tired eyes were a clear mark of sleepless nights.",
            "sent3": "The sudden silence was a mark of their surprise.",
            "sent4": "Her laughter was a mark of her happiness.",
            "sent5": "The mark of a good leader is inspiring others to do their best."
        },
        {
            "definition": "A grade or score given for academic work.",
            "pos": "noun",
            "sent1": "She was proud of the high mark she received on the test.",
            "sent2": "The red mark on the paper indicated a mistake.",
            "sent3": "Getting a low mark on the project was a wake-up call for him.",
            "sent4": "His determination earned him a top mark in the class.",
            "sent5": "The mark on his report card reflected his hard work."
        },
        {
            "definition": "To make a visible impression on a surface.",
            "pos": "verb",
            "sent1": "He tried to mark his name on the tree with a knife.",
            "sent2": "The artist used a brush to mark the canvas with colors.",
            "sent3": "She wanted to mark her territory by planting flowers.",
            "sent4": "The sculptor marked the stone with intricate patterns.",
            "sent5": "The dog tried to mark its territory by urinating on the fence."
        }
    ]
}