{
    "term": "marmorean",
    "meanings": [
        {
            "definition": "Resembling or characteristic of marble.",
            "pos": "adjective",
            "sent1": "The marmorean statue in the museum looked so elegant and smooth.",
            "sent2": "The kitchen countertop was made of a marmorean material that sparkled in the sunlight.",
            "sent3": "The marmorean floors in the palace made the guests feel like they were walking on clouds.",
            "sent4": "Her skin had a marmorean glow that seemed to radiate from within.",
            "sent5": "The artist skillfully captured the marmorean texture of the sculpture, making it seem almost lifelike."
        },
        {
            "definition": "Made of or resembling marble.",
            "pos": "adjective",
            "sent1": "The marmorean columns outside the courthouse added a touch of grandeur to the building.",
            "sent2": "The table in the foyer was a beautiful marmorean piece that had been passed down for generations.",
            "sent3": "The chef's cake was so dense and heavy, it felt like biting into a marmorean rock.",
            "sent4": "Her voice had a marmorean quality, deep and resonant, captivating everyone in the room.",
            "sent5": "The moonlight cast a marmorean glow over the garden, turning it into a magical wonderland."
        },
        {
            "definition": "Having the qualities of marble.",
            "pos": "adjective",
            "sent1": "The marmorean texture of the fabric gave the dress a luxurious feel.",
            "sent2": "The artist used a marmorean paint to create a stunning mural on the wall.",
            "sent3": "The cake had a marmorean hardness that made it difficult to cut.",
            "sent4": "His words had a marmorean weight to them, leaving a lasting impact on the audience.",
            "sent5": "The sunlight filtering through the window created a marmorean pattern on the floor, adding a touch of elegance to the room."
        }
    ]
}