{
    "term": "marooning",
    "meanings": [
        {
            "definition": "Leave (someone) trapped and isolated in an inaccessible place, typically an island.",
            "pos": "verb",
            "sent1": "The pirates were marooning their enemies on the deserted island.",
            "sent2": "The captain decided to maroon the disobedient sailor on the small island.",
            "sent3": "After losing a bet, Jack jokingly suggested marooning his friend on the tiny island for a day.",
            "sent4": "The idea of marooning someone on an island felt like a cruel punishment.",
            "sent5": "The thought of being marooned on a deserted island sent shivers down his spine."
        },
        {
            "definition": "Abandon or leave (someone) in a place that is difficult to escape from.",
            "pos": "verb",
            "sent1": "The explorers were marooning their supplies in the cave for safekeeping.",
            "sent2": "She felt a pang of guilt as she considered marooning her pet cat in the attic during the storm.",
            "sent3": "The forgetful hiker accidentally ended up marooning himself on the mountain peak.",
            "sent4": "The idea of marooning the key to the treasure chest in the locked room seemed like a clever plan.",
            "sent5": "Marooning the lost puppy in the maze was the only way to ensure its safety."
        },
        {
            "definition": "To strand or abandon (someone) in a remote or desolate place.",
            "pos": "verb",
            "sent1": "The storm unexpectedly marooned the travelers in the mountain cabin.",
            "sent2": "The sinking ship marooned the crew on the deserted island.",
            "sent3": "The mischievous children pretended to maroon their friend in the backyard fort.",
            "sent4": "The broken-down car marooned the family in the middle of nowhere.",
            "sent5": "The blizzard threatened to maroon the group in the snow-covered valley."
        }
    ]
}