{
    "term": "martyrized",
    "meanings": [
        {
            "definition": "To make someone suffer greatly for their beliefs or principles.",
            "pos": "verb",
            "sent1": "The cruel ruler martyrized the innocent villagers for standing up for their rights.",
            "sent2": "The dictator martyrized those who dared to speak against his oppressive regime.",
            "sent3": "The mischievous children joked that their teacher martyrized them by giving extra homework.",
            "sent4": "The relentless heat in the desert seemed to martyrize the weary travelers on their journey.",
            "sent5": "The haunting memories of war martyrized his soul, leaving him scarred and broken."
        },
        {
            "definition": "To inflict suffering or death on someone for their beliefs.",
            "pos": "verb",
            "sent1": "The ruthless soldiers martyrized the rebels who fought for freedom.",
            "sent2": "The inquisitors would martyrize those who refused to renounce their faith.",
            "sent3": "The mischievous children joked that the strict librarian would martyrize them for returning books late.",
            "sent4": "The relentless storm seemed to martyrize the fragile ship, tossing it around like a toy.",
            "sent5": "The haunting memories of loss martyrized her heart, making it hard to find peace."
        },
        {
            "definition": "To be subjected to extreme suffering or death for a cause.",
            "pos": "verb",
            "sent1": "The brave activists willingly martyrized themselves for the sake of equality.",
            "sent2": "Throughout history, many have been martyrized for fighting against injustice.",
            "sent3": "The mischievous children joked that their pet goldfish martyrized itself by jumping out of the bowl.",
            "sent4": "The relentless illness seemed to martyrize her body, draining her strength day by day.",
            "sent5": "The haunting memories of betrayal martyrized her spirit, making it hard to trust again."
        }
    ]
}