{
    "term": "martyring",
    "meanings": [
        {
            "definition": "To kill someone for refusing to give up their beliefs.",
            "pos": "verb",
            "sent1": "The cruel ruler was martyring the brave rebel who stood firm in his beliefs.",
            "sent2": "The tyrant was martyring the innocent villagers who dared to speak out against him.",
            "sent3": "The evil king enjoyed martyring those who dared to oppose him, thinking he could crush their spirits.",
            "sent4": "The oppressive regime was martyring the voices of dissent, hoping to silence any opposition.",
            "sent5": "The ruthless dictator was martyring all who dared to challenge his authority, creating fear and obedience."
        },
        {
            "definition": "To inflict great pain or suffering on someone.",
            "pos": "verb",
            "sent1": "The bully was martyring the smaller kids on the playground, causing them immense pain.",
            "sent2": "The wicked witch was martyring the captured princess, making her endure unbearable suffering.",
            "sent3": "The mischievous cat was martyring the poor mouse, playing with it before finally catching it.",
            "sent4": "The relentless storm was martyring the old tree, bending its branches and tearing its leaves.",
            "sent5": "The illness was martyring the patient, making every movement a source of agony and torment."
        },
        {
            "definition": "To make someone a martyr.",
            "pos": "verb",
            "sent1": "The heroic sacrifice martyred the brave soldier, turning him into a symbol of courage.",
            "sent2": "The tragic event martyred the young activist, immortalizing her fight for justice.",
            "sent3": "The unexpected turn of events martyred the ordinary citizen, elevating him to a legendary status.",
            "sent4": "The selfless act of kindness martyred the generous philanthropist, forever remembered for her generosity.",
            "sent5": "The noble sacrifice martyred the humble teacher, inspiring generations with her dedication to education."
        }
    ]
}