{
    "term": "martinet",
    "meanings": [
        {
            "definition": "A strict disciplinarian or taskmaster.",
            "pos": "noun",
            "sent1": "The martinet at the school made sure all the students followed the rules.",
            "sent2": "The new manager was a real martinet, always checking everyone's work.",
            "sent3": "The martinet in charge of the office had a ruler to measure how straight the papers were aligned.",
            "sent4": "She was a martinet when it came to time management, never allowing a minute to be wasted.",
            "sent5": "The martinet's presence in the room was enough to make everyone sit up straight and pay attention."
        },
        {
            "definition": "A person who demands strict adherence to rules and regulations.",
            "pos": "noun",
            "sent1": "The martinet in the group project insisted on following the guidelines to the letter.",
            "sent2": "As a martinet, he expected everyone to be on time for the meeting.",
            "sent3": "The martinet of the family always made sure everyone finished their chores before dinner.",
            "sent4": "She was a martinet when it came to safety, always reminding others to wear their seat belts.",
            "sent5": "The martinet's insistence on punctuality was well-known among the team members."
        },
        {
            "definition": "To enforce strict discipline or obedience.",
            "pos": "verb",
            "sent1": "The coach would martinet the team into shape before the big game.",
            "sent2": "She had to martinet her dog to stop jumping on the furniture.",
            "sent3": "He tried to martinet the unruly class into silence, but it was a tough task.",
            "sent4": "The sergeant would martinet the recruits during training to prepare them for battle.",
            "sent5": "The teacher had to martinet the students to focus on their assignments."
        }
    ]
}