{
    "term": "martingales",
    "meanings": [
        {
            "definition": "A strap fastened to the girth of a horse's saddle, passing between the forelegs, and fastened to the bit or bridle.",
            "pos": "noun",
            "sent1": "The rider adjusted the martingales to ensure the saddle stayed in place.",
            "sent2": "The leather martingales were essential for keeping the saddle secure.",
            "sent3": "The mischievous horse tried to chew through the martingales, thinking they were a tasty snack.",
            "sent4": "The martingales acted like a safety belt for the saddle, preventing it from slipping.",
            "sent5": "The shiny martingales gleamed in the sunlight, adding elegance to the horse's gear."
        },
        {
            "definition": "A strap fastened around the neck of an animal, used to restrain or guide it.",
            "pos": "noun",
            "sent1": "The zookeeper gently adjusted the martingales on the lion to lead it back to its enclosure.",
            "sent2": "The martingales helped the trainer control the movements of the elephant.",
            "sent3": "The mischievous monkey managed to slip out of the martingales and climb up a tree.",
            "sent4": "The martingales around the dog's neck were like invisible hands guiding its path.",
            "sent5": "The martingales on the llama were colorful and made it easy to spot in the crowd."
        },
        {
            "definition": "A gambling system in which the bettor doubles the stake after each losing bet.",
            "pos": "noun",
            "sent1": "The risky gambler decided to try out martingales in the casino.",
            "sent2": "Using martingales in gambling can lead to significant losses if not careful.",
            "sent3": "The martingales strategy seemed foolproof until luck turned its back on the player.",
            "sent4": "The allure of martingales in betting was tempting but often led to disappointment.",
            "sent5": "The concept of martingales in gambling was both intriguing and dangerous for novice players."
        }
    ]
}