{
    "term": "martyrizing",
    "meanings": [
        {
            "definition": "To make someone a martyr.",
            "pos": "verb",
            "sent1": "She was martyrizing the hero in her story, making him a symbol of sacrifice.",
            "sent2": "The ancient ruler was known for martyrizing those who opposed his rule.",
            "sent3": "The children were martyrizing their favorite superhero, pretending he sacrificed himself for the greater good.",
            "sent4": "The artist was martyrizing the fallen soldier in his painting, capturing his bravery and sacrifice.",
            "sent5": "The poet's words were martyrizing the freedom fighter, immortalizing his courage for generations to come."
        },
        {
            "definition": "To inflict suffering or death upon someone for their beliefs.",
            "pos": "verb",
            "sent1": "The villain was martyrizing the innocent civilians, punishing them for their defiance.",
            "sent2": "In the dark ages, rulers often resorted to martyrizing those who challenged their authority.",
            "sent3": "The mischievous cat was martyrizing the poor mouse, playing with it before the final pounce.",
            "sent4": "The disease was martyrizing the patient, slowly draining their strength and will to fight.",
            "sent5": "The oppressive regime was martyrizing the dissidents, silencing their voices with violence and fear."
        },
        {
            "definition": "To cause someone to suffer greatly for a cause.",
            "pos": "verb",
            "sent1": "The intense training was martyrizing the athletes, pushing them to their limits for victory.",
            "sent2": "The activist was martyrizing herself for the rights of the marginalized communities.",
            "sent3": "The stubborn weather was martyrizing the farmers, ruining their crops with relentless storms.",
            "sent4": "The relentless workload was martyrizing the employees, draining them of energy and motivation.",
            "sent5": "The endless war was martyrizing the civilians, forcing them to endure hardships beyond imagination."
        }
    ]
}