{
    "term": "mashers",
    "meanings": [
        {
            "definition": "A person who mashes or crushes food.",
            "pos": "noun",
            "sent1": "The masher in the kitchen loves to crush fruits for smoothies.",
            "sent2": "The chef used the masher to crush the garlic for the pasta sauce.",
            "sent3": "The little masher in the family enjoys squishing berries for jam.",
            "sent4": "She was a masher of hearts, breaking them with her careless words.",
            "sent5": "The masher's hands were always busy turning fruits into delicious purees."
        },
        {
            "definition": "A kitchen utensil used for mashing.",
            "pos": "noun",
            "sent1": "The metal masher helped turn the potatoes into creamy mash.",
            "sent2": "Mom used the masher to crush the cooked carrots for the baby.",
            "sent3": "The masher sat patiently in the drawer, waiting for its next task.",
            "sent4": "The masher worked its magic, transforming the lumps into smooth puree.",
            "sent5": "The old wooden masher had been in the family for generations, a symbol of home-cooked meals."
        },
        {
            "definition": "A tool for mashing potatoes.",
            "pos": "noun",
            "sent1": "The potato masher made quick work of the boiled spuds.",
            "sent2": "Grandma's favorite masher had a comfortable grip for easy mashing.",
            "sent3": "The masher danced in the pot, turning the potatoes into fluffy clouds.",
            "sent4": "The masher's handle was worn from years of hearty meals being prepared.",
            "sent5": "The shiny new masher gleamed in the kitchen, ready for its first potato mashing adventure."
        },
        {
            "definition": "A device for mashing ingredients together.",
            "pos": "noun",
            "sent1": "The avocado masher blended the ingredients into a creamy guacamole.",
            "sent2": "The masher attachment on the hand blender was perfect for making sauces.",
            "sent3": "The masher and bowl worked together like a team, creating a delicious paste.",
            "sent4": "The masher mixed the flavors together, creating a harmonious blend.",
            "sent5": "The masher's design allowed for easy mixing and mashing of various ingredients."
        }
    ]
}