{
    "term": "mashgiah",
    "meanings": [
        {
            "definition": "A person who supervises the kashrut of a kitchen or food establishment.",
            "pos": "noun",
            "sent1": "The mashgiah ensures the food is prepared according to religious rules.",
            "sent2": "The restaurant hired a mashgiah to oversee the kitchen's adherence to dietary laws.",
            "sent3": "The mashgiah caught a sneaky potato trying to hide in the non-kosher section.",
            "sent4": "She was like a diligent mashgiah, carefully examining every ingredient that entered the kitchen.",
            "sent5": "The mashgiah's watchful eyes were like a shield protecting the kitchen's kashrut."
        },
        {
            "definition": "The act of overseeing or monitoring the adherence to religious dietary laws.",
            "pos": "noun",
            "sent1": "His mashgiah involved regular checks to ensure compliance with dietary rules.",
            "sent2": "The mashgiah of the event made sure all the food met the religious standards.",
            "sent3": "The mashgiah's job seemed like a tasty puzzle of keeping everything kosher.",
            "sent4": "The mashgiah's role was akin to a guardian angel watching over the kitchen's kashrut.",
            "sent5": "The importance of the mashgiah's duty was as clear as the blue sky on a sunny day."
        },
        {
            "definition": "To inspect or check for compliance with religious dietary laws.",
            "pos": "verb",
            "sent1": "She would mashgiah the ingredients before allowing them into the kitchen.",
            "sent2": "The rabbi asked him to mashgiah the food preparation process.",
            "sent3": "He decided to mashgiah the fridge to make sure no forbidden foods were hiding.",
            "sent4": "The mashgiahed kitchen gleamed with the purity of adherence to dietary laws.",
            "sent5": "Before the event, they meticulously mashgiahed every corner of the food area."
        }
    ]
}