{
    "term": "mashie",
    "meanings": [
        {
            "definition": "A golf club with a lofted face, used for hitting medium-length shots.",
            "pos": "noun",
            "sent1": "He swung the mashie and sent the golf ball flying through the air.",
            "sent2": "The golfer carefully selected his mashie for the next shot on the fairway.",
            "sent3": "The mashie whispered to the other clubs, 'I'm the best at hitting medium-length shots!'",
            "sent4": "Her trusty mashie was like a magic wand, guiding the ball exactly where she wanted.",
            "sent5": "With a swift swing of the mashie, he scored a hole-in-one on the tricky par 3."
        },
        {
            "definition": "A mixture of ingredients, typically potatoes and milk, beaten or crushed together.",
            "pos": "noun",
            "sent1": "Grandma's creamy mashie was everyone's favorite side dish at Thanksgiving.",
            "sent2": "The chef prepared a delicious mashie of potatoes and butter for the dinner party.",
            "sent3": "The mischievous toddler giggled as he squished the mashie between his fingers.",
            "sent4": "The warm aroma of the mashie filled the kitchen, making mouths water.",
            "sent5": "The secret to the perfect mashie is to slowly add warm milk while mashing the potatoes."
        },
        {
            "definition": "To crush or grind something into a soft mass.",
            "pos": "verb",
            "sent1": "She used a fork to mashie the ripe avocados into guacamole.",
            "sent2": "The baker needed to mashie the nuts into a fine powder for the cake.",
            "sent3": "The kids decided to mashie the playdough into funny shapes and figures.",
            "sent4": "The old stone mortar and pestle were perfect for mashieing herbs and spices.",
            "sent5": "The weightlifter's strong hands could easily mashie the heavy clay into pottery."
        }
    ]
}