{
    "term": "masker",
    "meanings": [
        {
            "definition": "One who wears a mask.",
            "pos": "noun",
            "sent1": "The masker at the party looked mysterious.",
            "sent2": "The doctor put on a masker before entering the operating room.",
            "sent3": "The masker at the masquerade ball kept everyone guessing.",
            "sent4": "The masker of emotions hid his true feelings well.",
            "sent5": "The masker's disguise was so convincing that no one recognized them."
        },
        {
            "definition": "A device worn over the nose and mouth to protect against harmful particles.",
            "pos": "noun",
            "sent1": "The masker shielded the worker from dust and fumes.",
            "sent2": "The masker is an essential tool for healthcare workers during a pandemic.",
            "sent3": "The masker made the wearer feel like a superhero fighting invisible enemies.",
            "sent4": "The masker of safety kept the wearer breathing clean air.",
            "sent5": "The masker's filtration system blocked out harmful particles effectively."
        },
        {
            "definition": "A person who conceals their identity.",
            "pos": "noun",
            "sent1": "The mysterious masker slipped through the crowd unnoticed.",
            "sent2": "The vigilante was known as the masker of justice.",
            "sent3": "The mischievous masker played pranks without revealing their face.",
            "sent4": "The masker of secrets never revealed their true self.",
            "sent5": "The masker's hidden identity added an air of intrigue to the story."
        },
        {
            "definition": "To cover or hide something.",
            "pos": "verb",
            "sent1": "She tried to masker her disappointment with a smile.",
            "sent2": "The artist used colors to masker the imperfections of the canvas.",
            "sent3": "He attempted to masker his fear by acting brave.",
            "sent4": "The politician's words were meant to masker the truth.",
            "sent5": "The scent of flowers couldn't masker the foul odor in the room."
        }
    ]
}