{
    "term": "masqueraded",
    "meanings": [
        {
            "definition": "To disguise oneself",
            "pos": "verb",
            "sent1": "During the game of hide-and-seek, Sarah masqueraded behind the tree to avoid being found.",
            "sent2": "The spy masqueraded as a waiter to gather information without being noticed.",
            "sent3": "At the costume party, Tom masqueraded as a superhero, much to the amusement of his friends.",
            "sent4": "Her smile masqueraded the sadness in her eyes, fooling everyone around her.",
            "sent5": "The chameleon masqueraded as a leaf, blending perfectly into its surroundings."
        },
        {
            "definition": "To pretend to be someone or something else",
            "pos": "verb",
            "sent1": "The young boy masqueraded as a detective, solving imaginary mysteries in the backyard.",
            "sent2": "She masqueraded her fear with a brave face, not wanting to show her vulnerability.",
            "sent3": "The cat masqueraded as a lion in the mirror, amusing itself with its reflection.",
            "sent4": "His arrogance masqueraded his insecurity, hiding the true emotions beneath the surface.",
            "sent5": "The actor masqueraded as a villain on stage, captivating the audience with his performance."
        },
        {
            "definition": "To wear a mask or costume for a disguise",
            "pos": "verb",
            "sent1": "During Halloween, children masqueraded as ghosts and witches, roaming the neighborhood for treats.",
            "sent2": "The masqueraded ball was a grand event where guests wore elaborate masks and costumes.",
            "sent3": "The dog masqueraded in a pirate costume, wagging its tail happily at the attention it received.",
            "sent4": "The shadows masqueraded the true identity of the figure lurking in the darkness.",
            "sent5": "The masqueraded dancer twirled gracefully on stage, captivating the audience with every move."
        }
    ]
}