{
    "term": "master",
    "meanings": [
        {
            "definition": "A person with the ability or power to control or use something.",
            "pos": "noun",
            "sent1": "The master of the house opened the door for the guests.",
            "sent2": "The teacher is the master of the classroom.",
            "sent3": "The master of the remote control lost it under the couch.",
            "sent4": "She is a master of persuasion, always getting what she wants.",
            "sent5": "The master of ceremonies welcomed everyone to the event."
        },
        {
            "definition": "A person who has complete control over something.",
            "pos": "noun",
            "sent1": "The cat is the master of the backyard, chasing away other animals.",
            "sent2": "The CEO is the master of the company's decisions.",
            "sent3": "The master of the TV remote refused to share it with anyone else.",
            "sent4": "The storm was the master of chaos, leaving destruction in its wake.",
            "sent5": "The master of the game strategized every move to win."
        },
        {
            "definition": "A skilled practitioner of a particular art or activity.",
            "pos": "noun",
            "sent1": "She is a master of baking delicious cakes.",
            "sent2": "The artist is a master of painting landscapes.",
            "sent3": "The master of the kitchen burned the toast again.",
            "sent4": "His fingers danced across the piano keys like a master musician.",
            "sent5": "The master of martial arts moved with grace and precision."
        },
        {
            "definition": "A person who employs others.",
            "pos": "noun",
            "sent1": "The master of the shop hired new employees for the busy season.",
            "sent2": "The manager is the master of the staff schedules.",
            "sent3": "The master of the office forgot to order more printer paper.",
            "sent4": "She became the master of a team of talented individuals.",
            "sent5": "The master of the construction site oversaw the building progress."
        }
    ]
}