{
    "term": "mateship",
    "meanings": [
        {
            "definition": "The state or quality of being a mate or companion.",
            "pos": "noun",
            "sent1": "In the forest, the squirrel found comfort in the mateship of other animals.",
            "sent2": "The mateship between the two siblings was evident in their constant laughter and shared secrets.",
            "sent3": "The mateship among the toys in the playroom made the children giggle with joy.",
            "sent4": "The mateship of the stars in the night sky seemed to create a beautiful pattern.",
            "sent5": "The mateship of the puzzle pieces fitting perfectly together brought a sense of completion."
        },
        {
            "definition": "The bond or friendship between mates.",
            "pos": "noun",
            "sent1": "The mateship between the two best friends was unbreakable.",
            "sent2": "The mateship of the teammates on the soccer field was evident in their coordinated plays.",
            "sent3": "The mateship between the books on the shelf made the library feel cozy.",
            "sent4": "The mateship of the flowers in the garden created a colorful display.",
            "sent5": "The mateship of the puzzle pieces fitting perfectly together brought a sense of completion."
        },
        {
            "definition": "The spirit of camaraderie and mutual support among friends.",
            "pos": "noun",
            "sent1": "During the camping trip, the mateship among the group helped them overcome challenges.",
            "sent2": "The mateship of the classmates was evident in their willingness to help each other with homework.",
            "sent3": "The mateship between the clouds in the sky made the sunset even more beautiful.",
            "sent4": "The mateship of the waves crashing against the shore created a soothing rhythm.",
            "sent5": "The mateship of the puzzle pieces fitting perfectly together brought a sense of completion."
        }
    ]
}