{
    "term": "maternalisms",
    "meanings": [
        {
            "definition": "Maternalisms: the quality or state of being maternal",
            "pos": "noun",
            "sent1": "Her maternalisms were evident in the way she cared for everyone around her.",
            "sent2": "The maternalisms of the lioness were on full display as she protected her cubs.",
            "sent3": "She joked that her maternalisms kicked in whenever she saw a stray kitten.",
            "sent4": "The garden's maternalisms, with its nurturing soil and sunlight, helped the flowers bloom beautifully.",
            "sent5": "The grandmother's maternalisms were like a warm hug on a cold day, comforting and reassuring."
        },
        {
            "definition": "Maternalisms: maternal behavior or characteristics",
            "pos": "noun",
            "sent1": "The cat's maternalisms were evident as she groomed her kittens with care.",
            "sent2": "Her maternalisms shone through as she comforted her friend in times of need.",
            "sent3": "The dog's maternalisms were so strong that she even adopted a litter of orphaned puppies.",
            "sent4": "The tree's maternalisms, providing shade and shelter to all creatures, were a symbol of nurturing.",
            "sent5": "The teacher's maternalisms extended beyond the classroom, offering support and guidance to her students."
        },
        {
            "definition": "Maternalisms: expressions or sayings typical of a mother",
            "pos": "noun",
            "sent1": "She often used maternalisms like 'eat your vegetables' to encourage healthy habits.",
            "sent2": "The maternalisms of 'be careful' and 'I love you' were constant in her daily interactions.",
            "sent3": "His friends teased him for using maternalisms like 'bundle up' even when it wasn't cold.",
            "sent4": "The maternalisms of 'take an umbrella' and 'call me when you get there' showed her caring nature.",
            "sent5": "The maternalisms of 'look both ways before crossing' and 'always wear your helmet' were ingrained in her children's minds."
        }
    ]
}