{
    "term": "mates",
    "meanings": [
        {
            "definition": "A person's friend or companion.",
            "pos": "noun",
            "sent1": "My schoolmates and I play together every day.",
            "sent2": "She is my best mate, and we do everything together.",
            "sent3": "My mates always make me laugh with their jokes.",
            "sent4": "We are like puzzle pieces, fitting together perfectly as mates.",
            "sent5": "Having loyal mates by your side can make life more enjoyable."
        },
        {
            "definition": "A pair of animals that breed together.",
            "pos": "noun",
            "sent1": "The lion mates were seen resting under the tree.",
            "sent2": "The bird mates built a nest together for their eggs.",
            "sent3": "The zookeeper joked that the penguin mates were the best-dressed couple.",
            "sent4": "The wolf mates howled in harmony under the full moon.",
            "sent5": "Observing the butterfly mates dance in the garden was a beautiful sight."
        },
        {
            "definition": "To join together as a pair.",
            "pos": "verb",
            "sent1": "The two teams will mate for the final round of the competition.",
            "sent2": "The socks mate perfectly, forming a complete pair.",
            "sent3": "The keys mated in the lock smoothly without any issues.",
            "sent4": "The colors on the painting seem to mate effortlessly, creating a stunning masterpiece.",
            "sent5": "The puzzle pieces mate together to reveal the hidden picture."
        },
        {
            "definition": "To match or fit together.",
            "pos": "verb",
            "sent1": "The shapes mate perfectly, completing the pattern.",
            "sent2": "The flavors of the dish mate well, creating a delicious combination.",
            "sent3": "The gears mated smoothly, allowing the machine to function perfectly.",
            "sent4": "The words and music mate beautifully in this song.",
            "sent5": "The pieces of the puzzle mate together seamlessly, forming a complete picture."
        }
    ]
}