{
    "term": "maternities",
    "meanings": [
        {
            "definition": "The state or quality of being a mother.",
            "pos": "noun",
            "sent1": "The love and care shown in maternities is truly special.",
            "sent2": "Her kindness and nurturing nature exemplify true maternities.",
            "sent3": "She joked that her cat showed more maternities than some human mothers.",
            "sent4": "The maternities of nature can be seen in the protective instincts of a mother bear.",
            "sent5": "The essence of maternities is beautifully captured in the bond between a mother and her child."
        },
        {
            "definition": "The period during which a woman is pregnant and gives birth to a child.",
            "pos": "noun",
            "sent1": "During the maternities, she experienced both joy and challenges.",
            "sent2": "The maternities of her pregnancy were filled with anticipation and excitement.",
            "sent3": "Her friends threw her a 'last day of maternities' party before the baby arrived.",
            "sent4": "The maternities felt like a journey of discovery and growth for her.",
            "sent5": "The maternities brought about a sense of wonder and amazement at the miracle of life."
        },
        {
            "definition": "A department in a hospital where women give birth and receive postnatal care.",
            "pos": "noun",
            "sent1": "The new maternities at the hospital are equipped with state-of-the-art facilities.",
            "sent2": "She visited the maternities to see her friend and the newborn baby.",
            "sent3": "The maternities staff celebrated the arrival of the first baby born in the new year.",
            "sent4": "In the busy maternities, the nurses worked tirelessly to ensure safe deliveries.",
            "sent5": "The atmosphere in the maternities was filled with warmth and support for new mothers."
        }
    ]
}