{
    "term": "matrons",
    "meanings": [
        {
            "definition": "A married woman, especially one who is mature and dignified.",
            "pos": "noun",
            "sent1": "The matrons in the neighborhood always gathered for tea and gossip.",
            "sent2": "The matrons of the village were respected for their wisdom and kindness.",
            "sent3": "The matrons at the bake sale were like queens overseeing their kingdom of pastries.",
            "sent4": "The matrons of the community stood tall like ancient trees, providing shade and comfort to all.",
            "sent5": "The image of the matrons in their elegant dresses was etched in the memories of the townspeople."
        },
        {
            "definition": "A woman in charge of domestic and medical arrangements at an institution.",
            "pos": "noun",
            "sent1": "The matrons at the hospital ensured that everything ran smoothly for the patients.",
            "sent2": "The matrons of the orphanage were like mothers to all the children under their care.",
            "sent3": "The matrons organizing the charity event were like conductors orchestrating a symphony of generosity.",
            "sent4": "The matrons of the nursing home were the pillars of strength and compassion for the residents.",
            "sent5": "The matrons overseeing the kitchen worked tirelessly to provide nutritious meals for everyone."
        },
        {
            "definition": "A woman serving as a guardian or protector.",
            "pos": "noun",
            "sent1": "The matrons of the castle kept a watchful eye on the young princess.",
            "sent2": "The matrons of the village were known for their fierce loyalty and unwavering courage.",
            "sent3": "The matrons guarding the ancient artifact were like fierce warriors protecting their treasure.",
            "sent4": "The matrons of the forest guided travelers safely through the enchanted woods.",
            "sent5": "The matrons of the sanctuary shielded the endangered animals from harm."
        }
    ]
}