{
    "term": "matrilineal",
    "meanings": [
        {
            "definition": "Based on or tracing descent through the maternal line.",
            "pos": "adjective",
            "sent1": "Their family followed a matrilineal tradition, where ancestry was traced through mothers.",
            "sent2": "The tribe's customs were matrilineal, passing down heritage through the female side.",
            "sent3": "In their matrilineal society, family reunions were always a maternal affair.",
            "sent4": "The matrilineal bond between mother and child was unbreakable, like an invisible thread connecting them.",
            "sent5": "The concept of matrilineal descent was as clear as looking through a glass window."
        },
        {
            "definition": "Inheriting or determining descent through the female line.",
            "pos": "adjective",
            "sent1": "She inherited the land through a matrilineal system, following her mother's lineage.",
            "sent2": "The royal family's succession was matrilineal, with queens passing the crown to their daughters.",
            "sent3": "The matrilineal inheritance rule led to some humorous family disputes over who got what.",
            "sent4": "The matrilineal connection felt like a river flowing from one generation to the next.",
            "sent5": "The idea of matrilineal descent stuck in her mind like a catchy tune."
        },
        {
            "definition": "Relating to or characteristic of a social system in which descent and inheritance are traced through the mother's line.",
            "pos": "adjective",
            "sent1": "Their culture was deeply rooted in matrilineal practices, honoring the maternal line.",
            "sent2": "The village had a matrilineal structure, with property passing from mother to daughter.",
            "sent3": "The matrilineal society made for some interesting family gatherings, with everyone knowing their lineage.",
            "sent4": "The matrilineal system was like a map guiding each individual back to their maternal roots.",
            "sent5": "The concept of matrilineal descent painted a vivid picture of interconnected families."
        }
    ]
}