{
    "term": "matronize",
    "meanings": [
        {
            "definition": "To treat as a matron or motherly figure.",
            "pos": "verb",
            "sent1": "She would often matronize the younger girls in the orphanage, offering them advice and comfort.",
            "sent2": "The elderly lady would matronize the neighborhood children, always ready with a kind word or a piece of candy.",
            "sent3": "The queen decided to matronize the stray kittens, providing them with a royal bed and meals fit for royalty.",
            "sent4": "The wise old owl seemed to matronize the forest, watching over all the creatures with a protective gaze.",
            "sent5": "The kind teacher would matronize her students, guiding them through their studies with care and patience."
        },
        {
            "definition": "To behave in a condescending or patronizing manner towards someone.",
            "pos": "verb",
            "sent1": "He would often matronize his younger brother, speaking to him as if he were a child.",
            "sent2": "The wealthy socialite would matronize the staff at the hotel, looking down on them with disdain.",
            "sent3": "The cat seemed to matronize the dog, always walking ahead with an air of superiority.",
            "sent4": "The politician would matronize his opponents, dismissing their ideas without consideration.",
            "sent5": "The boss would matronize his employees, belittling their efforts and contributions."
        },
        {
            "definition": "To support or sponsor something, typically in a maternal or protective way.",
            "pos": "verb",
            "sent1": "The generous donor would matronize the local charity, providing funds for their programs.",
            "sent2": "The community came together to matronize the new library, donating books and resources.",
            "sent3": "The company decided to matronize the arts festival, offering financial support and promotion.",
            "sent4": "The queen would matronize the explorers, funding their expeditions to unknown lands.",
            "sent5": "The teacher would matronize the school play, helping the students with costumes and props."
        }
    ]
}