{
    "term": "matt",
    "meanings": [
        {
            "definition": "Lacking luster or shine",
            "pos": "adjective",
            "sent1": "The old car had a matt finish that didn't reflect light.",
            "sent2": "She preferred the matt paint for her bedroom walls.",
            "sent3": "The magician's hat looked matt under the dim stage lights.",
            "sent4": "The moon cast a matt glow over the silent lake.",
            "sent5": "The matt sky signaled the arrival of a storm."
        },
        {
            "definition": "A flat piece of material used as a floor covering",
            "pos": "noun",
            "sent1": "The living room floor was covered with a soft matt.",
            "sent2": "She bought a new matt for the kitchen to match the decor.",
            "sent3": "The cat loved to scratch the matt in the hallway.",
            "sent4": "The matt in the classroom muffled the sound of footsteps.",
            "sent5": "The yoga studio had a comfortable matt for each student."
        },
        {
            "definition": "To cover with a flat piece of material",
            "pos": "verb",
            "sent1": "She decided to matt the table to protect it from spills.",
            "sent2": "He carefully matted the photo before framing it.",
            "sent3": "The artist wanted to matt the canvas for a unique effect.",
            "sent4": "They planned to matt the walls with a special fabric.",
            "sent5": "The decorator suggested to matt the chairs for a cozy look."
        },
        {
            "definition": "A male given name",
            "pos": "noun",
            "sent1": "Matt is a popular name for boys in many countries.",
            "sent2": "She has a cousin named Matt who lives in the city.",
            "sent3": "Matt's birthday party was a fun celebration with friends.",
            "sent4": "The teacher called out Matt's name during roll call.",
            "sent5": "Matt's dog ran happily to greet him at the door."
        }
    ]
}