{
    "term": "mattin",
    "meanings": [
        {
            "definition": "A type of coarse fabric",
            "pos": "noun",
            "sent1": "She sewed a dress using the rough mattin for a rustic look.",
            "sent2": "The mattin material was perfect for making sturdy bags.",
            "sent3": "The mattin fabric felt like a cozy blanket when used as a tablecloth.",
            "sent4": "The mattin draped over the chair like a protective shield.",
            "sent5": "The mattin texture reminded her of a bumpy road."
        },
        {
            "definition": "A type of bird",
            "pos": "noun",
            "sent1": "The colorful mattin chirped happily in the tree.",
            "sent2": "I spotted a mattin with vibrant feathers flying overhead.",
            "sent3": "The mischievous mattin stole crumbs from the picnic.",
            "sent4": "The mattin soared through the sky like a tiny rainbow.",
            "sent5": "The graceful mattin glided effortlessly on the breeze."
        },
        {
            "definition": "A type of prayer",
            "pos": "noun",
            "sent1": "She whispered a heartfelt mattin for peace and guidance.",
            "sent2": "Every evening, they gathered to recite the communal mattin.",
            "sent3": "The mattin brought solace to her troubled mind.",
            "sent4": "In times of need, the mattin was her silent companion.",
            "sent5": "The mattin prayer echoed softly in the empty church."
        },
        {
            "definition": "A type of song sung at dawn",
            "pos": "noun",
            "sent1": "The villagers sang a joyous mattin to welcome the sunrise.",
            "sent2": "The melodious mattin filled the valley with hope each morning.",
            "sent3": "The mattin echoed through the sleepy town, rousing everyone.",
            "sent4": "The mattin floated on the morning mist like a gentle breeze.",
            "sent5": "The haunting beauty of the mattin lingered in the early light."
        }
    ]
}