{
    "term": "maya",
    "meanings": [
        {
            "definition": "Illusion",
            "pos": "noun",
            "sent1": "The magician created a maya to trick the audience.",
            "sent2": "The mirage in the desert was just a maya.",
            "sent3": "The funhouse mirrors turned everything into a maya.",
            "sent4": "Her smile was like a maya, hiding her true feelings.",
            "sent5": "The dream felt so real, it was like a maya come to life."
        },
        {
            "definition": "Hindu goddess of illusion",
            "pos": "noun",
            "sent1": "In the story, Maya used her powers as a goddess of maya.",
            "sent2": "Devotees prayed to Maya for clarity amidst the maya of life.",
            "sent3": "Maya's illusions always brought a sense of wonder to the people.",
            "sent4": "Her beauty was like Maya's, captivating all who saw her.",
            "sent5": "The dance performance was mesmerizing, like a tribute to Maya herself."
        },
        {
            "definition": "Ancient civilization in Mesoamerica",
            "pos": "noun",
            "sent1": "Archaeologists study the ruins of the Maya civilization.",
            "sent2": "The temples of the Maya were grand and awe-inspiring.",
            "sent3": "Visiting the ancient Maya city felt like stepping back in time.",
            "sent4": "The legacy of the Maya civilization continues to fascinate historians.",
            "sent5": "The intricate artwork of the Maya people tells stories of their past."
        },
        {
            "definition": "Name for a girl in Spanish-speaking countries",
            "pos": "noun",
            "sent1": "Maya is a popular name for baby girls in Spain.",
            "sent2": "The teacher called on Maya to answer the question.",
            "sent3": "Maya's friends threw her a surprise birthday party.",
            "sent4": "The actress Maya captivated the audience with her performance.",
            "sent5": "Maya's laughter filled the room with joy and warmth."
        }
    ]
}