{
    "term": "mayflies",
    "meanings": [
        {
            "definition": "Insect with a short lifespan",
            "pos": "noun",
            "sent1": "Mayflies only live for a day or two.",
            "sent2": "I saw a swarm of mayflies near the river yesterday.",
            "sent3": "The mayflies had a party that lasted just a few hours.",
            "sent4": "The mayflies danced in the sunlight before disappearing.",
            "sent5": "The field was filled with mayflies, their lives fleeting like a whisper."
        },
        {
            "definition": "Group of insects known for their short adult life span",
            "pos": "noun",
            "sent1": "A group of mayflies gathered by the lake.",
            "sent2": "Scientists study the behavior of mayflies in the wild.",
            "sent3": "The mayflies threw a surprise party for their short-lived friend.",
            "sent4": "The mayflies' existence was as brief as a shooting star.",
            "sent5": "The sky darkened as the mayflies emerged, a fleeting spectacle of nature."
        },
        {
            "definition": "Larval stage of certain insects that live in water",
            "pos": "noun",
            "sent1": "The mayflies larvae wriggled in the pond.",
            "sent2": "Fish feed on mayflies in their larval stage.",
            "sent3": "The mayflies larvae practiced synchronized swimming.",
            "sent4": "The mayflies larvae transformed into graceful adults.",
            "sent5": "The pond teemed with mayflies larvae, a bustling underwater community."
        },
        {
            "definition": "Adult stage of certain insects that live for a short period of time",
            "pos": "noun",
            "sent1": "The adult mayflies fluttered gracefully in the air.",
            "sent2": "Mayflies adults mate quickly before perishing.",
            "sent3": "The adult mayflies threw a farewell party for themselves.",
            "sent4": "The mayflies adults lived life in fast-forward.",
            "sent5": "The air shimmered with the delicate dance of adult mayflies, a fleeting beauty."
        }
    ]
}