{
    "term": "meal",
    "meanings": [
        {
            "definition": "An occasion when food is eaten",
            "pos": "noun",
            "sent1": "After a long day of playing outside, the children enjoyed a delicious meal together.",
            "sent2": "Thanksgiving is a special meal where families gather to give thanks and eat turkey.",
            "sent3": "The meal was so tasty that even the picky eater couldn't resist taking a second helping.",
            "sent4": "The meal of victory was shared among the team after winning the championship game.",
            "sent5": "The aroma of the meal filled the entire house, making everyone's stomachs growl in anticipation."
        },
        {
            "definition": "The food eaten on such an occasion",
            "pos": "noun",
            "sent1": "The meal consisted of grilled chicken, rice, and vegetables.",
            "sent2": "She packed a healthy meal for lunch, including a sandwich and an apple.",
            "sent3": "The meal on the plate looked like a colorful work of art, almost too pretty to eat.",
            "sent4": "The meal served at the wedding reception was a delightful blend of flavors and textures.",
            "sent5": "The aroma of the meal wafted through the room, making everyone's mouths water in anticipation."
        },
        {
            "definition": "Ground or crushed grain used as food",
            "pos": "noun",
            "sent1": "The baker used fresh flour to prepare the meal for the bread.",
            "sent2": "In some cultures, cornmeal is a staple ingredient for many traditional dishes.",
            "sent3": "The meal was so finely ground that it created a smooth texture in the dish.",
            "sent4": "The ancient recipe called for a special type of meal that was hand-ground by the villagers.",
            "sent5": "The aroma of the freshly baked bread filled the kitchen, carrying the scent of the meal used in its making."
        }
    ]
}