{
    "term": "meaner",
    "meanings": [
        {
            "definition": "unkind or cruel",
            "pos": "adjective",
            "sent1": "The meaner bully took away the poor kid's lunch money.",
            "sent2": "The meaner comments made her feel sad and hurt.",
            "sent3": "The meaner teacher gave extra homework on a Friday.",
            "sent4": "The meaner storm clouds threatened to ruin the picnic.",
            "sent5": "The meaner behavior towards animals is never acceptable."
        },
        {
            "definition": "inferior in quality or value",
            "pos": "adjective",
            "sent1": "The meaner fabric tore easily compared to the others.",
            "sent2": "The meaner product broke after just a few uses.",
            "sent3": "The meaner gift was quickly forgotten by the recipient.",
            "sent4": "The meaner painting lacked the artist's usual skill and detail.",
            "sent5": "The meaner materials used in construction led to a weak structure."
        },
        {
            "definition": "having a stingy or miserly attitude",
            "pos": "adjective",
            "sent1": "The meaner old man refused to give any money to charity.",
            "sent2": "The meaner landlord refused to fix anything in the apartment.",
            "sent3": "The meaner Scrooge character hoarded all his wealth in the story.",
            "sent4": "The meaner businessman never tipped the waitstaff.",
            "sent5": "The meaner attitude towards sharing is not appreciated by others."
        },
        {
            "definition": "average in amount or quality",
            "pos": "adjective",
            "sent1": "The meaner performance was neither outstanding nor terrible.",
            "sent2": "The meaner grades were neither exceptional nor failing.",
            "sent3": "The meaner weather made it hard to decide what to wear.",
            "sent4": "The meaner meal at the restaurant was neither delicious nor awful.",
            "sent5": "The meaner level of noise in the room was neither too loud nor too quiet."
        }
    ]
}