{
    "term": "meaty",
    "meanings": [
        {
            "definition": "Full of substance or interest",
            "pos": "adjective",
            "sent1": "The book had a meaty plot that kept me engaged.",
            "sent2": "The documentary was very meaty, providing a lot of valuable information.",
            "sent3": "The meeting had a meaty discussion about important topics.",
            "sent4": "Her argument was so meaty that it left everyone speechless.",
            "sent5": "The teacher's explanation was so meaty that it clarified all my doubts."
        },
        {
            "definition": "Containing a lot of meat",
            "pos": "adjective",
            "sent1": "The pizza had a meaty topping of sausage and pepperoni.",
            "sent2": "The stew was delicious with its meaty chunks of beef.",
            "sent3": "The sandwich was so meaty that I could barely finish it.",
            "sent4": "The burger was so meaty that it satisfied my hunger completely.",
            "sent5": "The barbecue ribs were incredibly meaty and flavorful."
        },
        {
            "definition": "Having a lot of flesh",
            "pos": "adjective",
            "sent1": "The wrestler had a meaty physique that intimidated his opponents.",
            "sent2": "The butcher selected the most meaty cuts of pork for the customer.",
            "sent3": "The actor had to gain weight to look more meaty for the role.",
            "sent4": "The lioness had a meaty body, showing her strength and power.",
            "sent5": "The chef preferred using meaty fish like salmon for his dishes."
        },
        {
            "definition": "Rich in content or detail",
            "pos": "adjective",
            "sent1": "The report was meaty with all the necessary information for the project.",
            "sent2": "The article was so meaty that it covered every aspect of the issue.",
            "sent3": "The lecture was meaty, providing in-depth analysis of the topic.",
            "sent4": "The documentary was meaty, exploring various perspectives on the subject.",
            "sent5": "The novel was meaty, delving into complex characters and relationships."
        }
    ]
}