{
    "term": "medicalized",
    "meanings": [
        {
            "definition": "To treat or classify as a medical issue.",
            "pos": "verb",
            "sent1": "The school nurse medicalized the student's stomachache.",
            "sent2": "The doctor medicalized the patient's symptoms and prescribed medication.",
            "sent3": "The cat medicalized its owner's sneezing as a sign of affection.",
            "sent4": "The detective medicalized the crime scene, searching for clues like a doctor diagnosing a patient.",
            "sent5": "The teacher medicalized the student's lack of focus, suggesting a visit to the school nurse for help."
        },
        {
            "definition": "To apply medical principles or practices to something.",
            "pos": "verb",
            "sent1": "She medicalized her skincare routine by using products recommended by dermatologists.",
            "sent2": "The researcher medicalized the study by following strict ethical guidelines.",
            "sent3": "The chef medicalized the recipe, ensuring all ingredients were fresh and safe to eat.",
            "sent4": "The coach medicalized the training program, focusing on injury prevention and recovery.",
            "sent5": "The parent medicalized the child's bedtime routine, incorporating relaxation techniques for better sleep."
        },
        {
            "definition": "To make something medical in nature.",
            "pos": "verb",
            "sent1": "The marketing team medicalized the campaign by highlighting its health benefits.",
            "sent2": "The artist medicalized the painting, adding elements inspired by anatomy.",
            "sent3": "The gardener medicalized the garden, planting medicinal herbs and flowers.",
            "sent4": "The designer medicalized the clothing line, using antibacterial fabrics.",
            "sent5": "The writer medicalized the story, weaving in themes of illness and healing."
        }
    ]
}