{
    "term": "medicalization",
    "meanings": [
        {
            "definition": "The process of defining a problem or behavior as medical in nature and providing medical treatment for it.",
            "pos": "noun",
            "sent1": "The medicalization of mental health issues has led to increased access to therapy and medication.",
            "sent2": "The medicalization of obesity has resulted in the development of weight loss surgeries and medications.",
            "sent3": "The medicalization of a broken heart might involve prescribing chocolate as a remedy.",
            "sent4": "In a world of medicalization, even social problems are treated with a dose of pills and injections.",
            "sent5": "The medicalization of everyday struggles makes seeking help more acceptable and accessible."
        },
        {
            "definition": "The act of attributing medical characteristics to a non-medical issue.",
            "pos": "noun",
            "sent1": "Her medicalization of stress turned a normal emotion into a health concern.",
            "sent2": "The medicalization of aging can sometimes lead to unnecessary medical interventions.",
            "sent3": "The medicalization of a bad hair day could involve diagnosing it as a scalp condition.",
            "sent4": "His medicalization of a simple headache made him fear the worst possible outcome.",
            "sent5": "The medicalization of a minor inconvenience can sometimes create unnecessary anxiety."
        },
        {
            "definition": "The transformation of a social or human problem into a medical one.",
            "pos": "noun",
            "sent1": "The medicalization of poverty shifts the focus from social policies to medical interventions.",
            "sent2": "The medicalization of loneliness may lead to prescribing medications instead of addressing underlying causes.",
            "sent3": "The medicalization of a noisy neighbor could involve recommending earplugs as a solution.",
            "sent4": "Her medicalization of a disagreement turned a simple argument into a medical emergency.",
            "sent5": "The medicalization of a communication issue may result in unnecessary medical tests and treatments."
        }
    ]
}