{
    "term": "mediums",
    "meanings": [
        {
            "definition": "A substance or element through which something is transmitted or carried.",
            "pos": "noun",
            "sent1": "The air and water act as mediums for sound waves to travel through.",
            "sent2": "The internet serves as a medium for sharing information globally.",
            "sent3": "Using a banana peel as a medium to slide across the floor is both fun and slippery.",
            "sent4": "Her smile was a medium of warmth that spread joy to everyone around her.",
            "sent5": "The medium of light passing through the stained glass windows created a beautiful rainbow effect in the room."
        },
        {
            "definition": "A person claiming to be in contact with the spirits of the dead and to communicate between the dead and the living.",
            "pos": "noun",
            "sent1": "The medium claimed to see and speak with spirits during the seance.",
            "sent2": "People often seek mediums to connect with their deceased loved ones.",
            "sent3": "The medium jokingly asked the ghost for fashion advice from the afterlife.",
            "sent4": "Her grandmother was like a medium between the family's past and present, sharing stories of their ancestors.",
            "sent5": "The medium's eyes seemed to glow as she relayed messages from the other side with a sense of peace and comfort."
        },
        {
            "definition": "An agency or means of doing something.",
            "pos": "noun",
            "sent1": "The internet has become a popular medium for advertising products.",
            "sent2": "Books are a traditional medium for storytelling and sharing knowledge.",
            "sent3": "Using a spoon as a medium to eat soup is much easier than using chopsticks.",
            "sent4": "Laughter can be a powerful medium to break the ice in awkward situations.",
            "sent5": "Music serves as a universal medium that transcends language barriers and connects people from different cultures."
        }
    ]
}