{
    "term": "medicare",
    "meanings": [
        {
            "definition": "A federal health insurance program for people who are 65 or older",
            "pos": "noun",
            "sent1": "My grandparents rely on Medicare for their health insurance.",
            "sent2": "Many seniors benefit from enrolling in Medicare when they turn 65.",
            "sent3": "When Grandma said she was going to a Medicare party, I thought it was a celebration for insurance!",
            "sent4": "Medicare is like a safety net for older adults, ensuring they have access to healthcare.",
            "sent5": "The word 'Medicare' always reminds me of taking care of my health as I age."
        },
        {
            "definition": "The government program that provides health insurance to people who are disabled",
            "pos": "noun",
            "sent1": "Individuals with disabilities can receive support through Medicare.",
            "sent2": "Medicare offers essential health coverage to those who are unable to work due to disabilities.",
            "sent3": "I joked with my friend that his broken leg might qualify him for Medicare benefits!",
            "sent4": "For those with disabilities, Medicare is like a guardian angel for medical expenses.",
            "sent5": "The concept of Medicare ensures that everyone, regardless of ability, can access healthcare."
        },
        {
            "definition": "The federal program that provides health insurance to people with end-stage renal disease",
            "pos": "noun",
            "sent1": "Patients undergoing dialysis often rely on Medicare for financial assistance.",
            "sent2": "Medicare plays a crucial role in supporting individuals with end-stage renal disease.",
            "sent3": "I told my cousin with a kidney condition that he should look into Medicare for help!",
            "sent4": "To those with end-stage renal disease, Medicare is a lifeline for medical care.",
            "sent5": "The word 'Medicare' symbolizes hope and support for those battling severe kidney issues."
        }
    ]
}