{
    "term": "mediumships",
    "meanings": [
        {
            "definition": "The practice of communicating with the spirits of the dead.",
            "pos": "noun",
            "sent1": "During the seance, the mediumships were able to connect with departed souls.",
            "sent2": "She studied mediumships to help people find closure after losing loved ones.",
            "sent3": "The ghost at the party joked that his mediumships were better than the magician's tricks.",
            "sent4": "Her mediumships were like a bridge between the living and the deceased, spanning two worlds.",
            "sent5": "The mediumships of the old man were so powerful, they could bring tears to anyone's eyes."
        },
        {
            "definition": "The ability to act as a medium between the living and the dead.",
            "pos": "noun",
            "sent1": "His natural mediumships allowed him to relay messages from the other side.",
            "sent2": "The mediumships of the psychic were sought after for their accuracy.",
            "sent3": "The cat claimed to have mediumships and could communicate with ghostly mice.",
            "sent4": "Her mediumships were like a beacon in the darkness, guiding lost souls to peace.",
            "sent5": "The mediumships of the young girl were so pure, they brought comfort to grieving families."
        },
        {
            "definition": "The state of being a medium for spiritual communication.",
            "pos": "noun",
            "sent1": "In her dreams, she experienced a sense of mediumships, relaying messages from beyond.",
            "sent2": "The mediumships of the shaman were revered by the tribe for their wisdom.",
            "sent3": "The mediumships of the tree were so strong, it could whisper secrets to the wind.",
            "sent4": "His mediumships were like a mirror reflecting the unseen world back to the living.",
            "sent5": "The mediumships of the healer were so gentle, they soothed troubled souls with ease."
        }
    ]
}