{
    "term": "mees",
    "meanings": [
        {
            "definition": "A small, round, yellow fruit.",
            "pos": "noun",
            "sent1": "I picked a mees from the tree and took a bite.",
            "sent2": "The mees was juicy and sweet.",
            "sent3": "The mees rolled off the table and onto the floor, making a little mess.",
            "sent4": "The mees in the bowl looked like drops of sunshine.",
            "sent5": "The mees in the basket smelled fresh and inviting."
        },
        {
            "definition": "To make a mistake or error.",
            "pos": "verb",
            "sent1": "I meesed up the recipe by adding too much salt.",
            "sent2": "She always meeses when she rushes through her work.",
            "sent3": "He meesed by wearing mismatched socks to the important meeting.",
            "sent4": "The comedian meesed up his punchline, making the audience laugh even harder.",
            "sent5": "Don't mees by forgetting your keys at home!"
        },
        {
            "definition": "A unit of measurement equal to 1,000 feet.",
            "pos": "noun",
            "sent1": "The hiking trail was marked every mees for easy navigation.",
            "sent2": "The construction project required measuring distances in mees.",
            "sent3": "The mees of cable needed for the job was carefully calculated.",
            "sent4": "The land surveyor used a mees wheel to measure the field.",
            "sent5": "The marathon course was exactly 26 mees long."
        },
        {
            "definition": "A type of bird known for its distinctive call.",
            "pos": "noun",
            "sent1": "The mees perched on the branch and sang a beautiful melody.",
            "sent2": "We woke up to the sound of the mees chirping outside our window.",
            "sent3": "The mees in the park seemed to be having a conversation with each other.",
            "sent4": "The mees' song echoed through the forest, filling the air with music.",
            "sent5": "The mees' call was so clear and melodious, it sounded like a flute."
        }
    ]
}