{
    "term": "megalomaniacal",
    "meanings": [
        {
            "definition": "Showing an excessive desire for power or control",
            "pos": "adjective",
            "sent1": "His megalomaniacal behavior at work made his colleagues uncomfortable.",
            "sent2": "The dictator's megalomaniacal tendencies led to the oppression of his people.",
            "sent3": "She joked that her cat had a megalomaniacal attitude, always demanding to be fed first.",
            "sent4": "The CEO's megalomaniacal leadership style crushed any dissenting opinions.",
            "sent5": "The villain's megalomaniacal plan to take over the world was finally foiled by the hero."
        },
        {
            "definition": "Characterized by delusions of grandeur",
            "pos": "adjective",
            "sent1": "The actor's megalomaniacal belief that he was the greatest star in Hollywood was comical.",
            "sent2": "Her megalomaniacal fantasies of becoming a famous singer were unrealistic.",
            "sent3": "The toddler's megalomaniacal idea that he could fly like a superhero made his parents smile.",
            "sent4": "The artist's megalomaniacal vision of creating a masterpiece surpassed all expectations.",
            "sent5": "The king's megalomaniacal dreams of building a golden palace were never realized."
        },
        {
            "definition": "Behaving in a narcissistic or self-centered manner",
            "pos": "adjective",
            "sent1": "His megalomaniacal attitude made it difficult for him to maintain friendships.",
            "sent2": "The celebrity's megalomaniacal behavior alienated many of her fans.",
            "sent3": "She found his megalomaniacal obsession with his appearance amusing.",
            "sent4": "The politician's megalomaniacal focus on himself overshadowed his policies.",
            "sent5": "Her megalomaniacal need for constant admiration drove her friends away."
        }
    ]
}