{
    "term": "megadyne",
    "meanings": [
        {
            "definition": "A unit of force equal to one million dynes.",
            "pos": "noun",
            "sent1": "The machine required a lot of megadynes to operate efficiently.",
            "sent2": "The scientist measured the force in megadynes to calculate the power of the engine.",
            "sent3": "The superhero's strength was so great that it could be measured in megadynes.",
            "sent4": "The megadyne of determination in her eyes was evident as she lifted the heavy weight effortlessly.",
            "sent5": "The impact of the collision was so strong that it felt like a million megadynes pushing against the wall."
        },
        {
            "definition": "A belt or band used to transmit power between a motor and machinery.",
            "pos": "noun",
            "sent1": "The mechanic replaced the worn-out megadyne to ensure smooth operation of the machine.",
            "sent2": "The factory's production line relied on the megadyne to transfer energy effectively.",
            "sent3": "The dancing robot's megadyne suddenly snapped, causing it to stop moving in the middle of the performance.",
            "sent4": "The megadyne of teamwork connected each member to the common goal like a well-oiled machine.",
            "sent5": "The megadyne hummed softly as it transferred power from the motor to the conveyor belt."
        },
        {
            "definition": "A type of surgical suture material.",
            "pos": "noun",
            "sent1": "The surgeon carefully selected the megadyne for stitching up the patient's wound.",
            "sent2": "The hospital always stocked up on different sizes of megadyne for various surgeries.",
            "sent3": "The mischievous cat played with the spool of megadyne, unraveling it all over the room.",
            "sent4": "Her words acted as a megadyne, stitching their broken relationship back together.",
            "sent5": "The megadyne glided smoothly through the skin, closing the incision with precision."
        }
    ]
}