{
    "term": "melena",
    "meanings": [
        {
            "definition": "Dark, tarry stool containing blood",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with melena after finding blood in their stool.",
            "sent2": "The nurse noticed melena in the patient's stool and immediately informed the doctor.",
            "sent3": "The detective suspected foul play when he found melena at the crime scene.",
            "sent4": "The dark clouds in the sky resembled the color of melena, foretelling a storm.",
            "sent5": "The melena in the toilet was a concerning sign of internal bleeding."
        },
        {
            "definition": "A symptom of gastrointestinal bleeding",
            "pos": "noun",
            "sent1": "The presence of melena indicated a serious issue in the patient's digestive system.",
            "sent2": "The doctor explained that melena is a common symptom of gastrointestinal bleeding.",
            "sent3": "The melena at the party made everyone uncomfortable as they tried to avoid the topic.",
            "sent4": "The city's financial crisis was a clear melena of the government's mismanagement.",
            "sent5": "The image of melena in the medical textbook helped students recognize the symptom easily."
        },
        {
            "definition": "A medical term for black, sticky feces containing blood",
            "pos": "noun",
            "sent1": "The nurse recorded the presence of melena in the patient's chart for the doctor to review.",
            "sent2": "The textbook defined melena as black, sticky feces that may indicate internal bleeding.",
            "sent3": "The comedian joked about melena in a way that made the audience laugh despite the topic.",
            "sent4": "The artist used melena as a symbol of hidden pain in their abstract painting.",
            "sent5": "The smell of melena in the room alerted the nurse to the patient's condition before even seeing them."
        }
    ]
}