{
    "term": "mendicant",
    "meanings": [
        {
            "definition": "A beggar",
            "pos": "noun",
            "sent1": "The mendicant sat on the sidewalk, hoping for kind donations.",
            "sent2": "The city streets were filled with mendicants asking for help.",
            "sent3": "The mendicant's hat overflowed with coins, making them smile gratefully.",
            "sent4": "In the world of the mendicant, every coin was a treasure beyond measure.",
            "sent5": "The image of the mendicant's outstretched hand stayed etched in my mind."
        },
        {
            "definition": "Asking for alms",
            "pos": "verb",
            "sent1": "She would mendicant at the church every Sunday for support.",
            "sent2": "The traveler would mendicant at each village he passed through.",
            "sent3": "He decided to mendicant at the office for some extra snacks.",
            "sent4": "The musician's performance seemed to mendicant for applause from the audience.",
            "sent5": "The child would mendicant for candy from his parents with a sweet smile."
        },
        {
            "definition": "Living on alms",
            "pos": "adjective",
            "sent1": "The mendicant monk led a simple life in the monastery.",
            "sent2": "Their mendicant lifestyle required them to rely on the generosity of others.",
            "sent3": "The mendicant community shared everything they had, creating a close bond.",
            "sent4": "In the quiet village, the mendicant family was known for their humility.",
            "sent5": "The mendicant existence brought them peace and contentment."
        },
        {
            "definition": "Relating to begging or alms-collecting",
            "pos": "adjective",
            "sent1": "The mendicant tradition had been passed down for generations.",
            "sent2": "The mendicant ceremony honored the act of giving and receiving.",
            "sent3": "Her wardrobe consisted of mendicant robes and simple sandals.",
            "sent4": "The mendicant rituals were performed with solemnity and grace.",
            "sent5": "The mendicant culture valued compassion and selflessness above all else."
        }
    ]
}