{
    "term": "meniscus",
    "meanings": [
        {
            "definition": "A curved upper surface of a liquid in a tube.",
            "pos": "noun",
            "sent1": "When you pour water into a test tube, you can see the meniscus at the top.",
            "sent2": "The scientist carefully observed the meniscus of the liquid in the graduated cylinder.",
            "sent3": "The meniscus in the glass tube looked like a tiny smiley face.",
            "sent4": "Her eyes were like the meniscus of a teardrop, reflecting the light in a beautiful curve.",
            "sent5": "The meniscus of the liquid seemed to dance as it swirled in the container."
        },
        {
            "definition": "A crescent-shaped fibrocartilage in the knee joint.",
            "pos": "noun",
            "sent1": "The doctor explained that the meniscus in his knee was torn and needed surgery.",
            "sent2": "Athletes often injure their meniscus while playing sports.",
            "sent3": "The comedian joked that his knee meniscus was his least favorite body part.",
            "sent4": "Her love for running was like a fragile meniscus, easily damaged but essential for movement.",
            "sent5": "The meniscus in his knee felt like a small cushion, protecting the joint during movement."
        },
        {
            "definition": "A lens that is concave on one side and convex on the other.",
            "pos": "noun",
            "sent1": "The optometrist recommended glasses with a meniscus lens for better vision.",
            "sent2": "Photographers often use meniscus lenses to create unique effects in their photos.",
            "sent3": "She accidentally dropped her meniscus lens, causing it to roll away like a tiny wheel.",
            "sent4": "The world through his eyes was like looking through a meniscus lens, distorted yet intriguing.",
            "sent5": "The artist painted a surreal scene using a meniscus lens to capture the dreamlike quality."
        }
    ]
}