{
    "term": "mercenarinesses",
    "meanings": [
        {
            "definition": "The quality or state of being motivated by financial gain or profit.",
            "pos": "noun",
            "sent1": "Her mercenarinesses led her to take on extra shifts to earn more money.",
            "sent2": "His mercenarinesses became evident when he chose the job with the highest salary.",
            "sent3": "The cat's mercenarinesses showed when it only played with the toy if given treats.",
            "sent4": "The politician's mercenarinesses shone through as he accepted bribes for favors.",
            "sent5": "The mercenarinesses of the dragon made it hoard gold in its lair."
        },
        {
            "definition": "The act of hiring oneself out for money or other reward.",
            "pos": "noun",
            "sent1": "In times of need, his mercenarinesses led him to offer his services for a fee.",
            "sent2": "The mercenarinesses of the mercenaries made them sought after in times of war.",
            "sent3": "The clown's mercenarinesses were evident when he asked for payment before performing.",
            "sent4": "Her mercenarinesses were like a business transaction, always seeking the best deal.",
            "sent5": "The mercenarinesses of the detective were well-known in the city."
        },
        {
            "definition": "The characteristic of being willing to do anything for money.",
            "pos": "noun",
            "sent1": "His mercenarinesses knew no bounds as he took on any job for the right price.",
            "sent2": "The mercenarinesses of the con artist were evident in their willingness to deceive for profit.",
            "sent3": "The squirrel's mercenarinesses were comical as it collected shiny objects for treats.",
            "sent4": "In the world of business, mercenarinesses can sometimes lead to unethical practices.",
            "sent5": "The mercenarinesses of the beggar were apparent as he begged for money on the street."
        }
    ]
}