{
    "term": "mercuries",
    "meanings": [
        {
            "definition": "A silver-white, poisonous metallic element, liquid at room temperature.",
            "pos": "noun",
            "sent1": "The scientist studied the properties of mercuries in the lab.",
            "sent2": "Mercuries are often used in thermometers due to their unique properties.",
            "sent3": "The mischievous cat knocked over the bottle of mercuries, causing a mess.",
            "sent4": "Her eyes sparkled like mercuries in the sunlight, mesmerizing everyone around her.",
            "sent5": "The spilled mercuries shimmered on the floor, reflecting the light in a captivating way."
        },
        {
            "definition": "A fleet-footed messenger of the gods in Roman mythology.",
            "pos": "noun",
            "sent1": "In the ancient tales, mercuries swiftly delivered messages between the gods.",
            "sent2": "Mercuries was known for his speed and agility in delivering important news.",
            "sent3": "The children playfully pretended to be mercuries, running around the garden with imaginary messages.",
            "sent4": "Her little brother ran like mercuries to bring her the news of their parents' arrival.",
            "sent5": "The messenger ran through the streets like mercuries, his sandals barely touching the ground."
        },
        {
            "definition": "A type of thermometer containing mercury as the liquid component.",
            "pos": "noun",
            "sent1": "The nurse checked the patient's temperature using a mercuries thermometer.",
            "sent2": "Mercuries thermometers are being replaced by digital ones in modern hospitals.",
            "sent3": "The clumsy scientist accidentally broke the mercuries thermometer, causing a small mercury spill.",
            "sent4": "The old mercuries thermometer glinted in the sunlight, a relic of medical history.",
            "sent5": "The antique shop displayed a collection of mercuries thermometers, showcasing the evolution of medical tools."
        }
    ]
}