{
    "term": "mercurials",
    "meanings": [
        {
            "definition": "Subject to sudden or unpredictable changes in mood or behavior.",
            "pos": "adjective",
            "sent1": "Her mercurials nature made it hard to predict how she would react to any situation.",
            "sent2": "The weather in spring can be quite mercurials, changing from sunny to rainy in a matter of minutes.",
            "sent3": "His mercurials behavior at the party kept everyone on their toes, never knowing what he would do next.",
            "sent4": "The mercurials market made it difficult for investors to make long-term plans.",
            "sent5": "The mercurials nature of the cat made it a challenge to train."
        },
        {
            "definition": "A type of medication used to treat fungal infections.",
            "pos": "noun",
            "sent1": "The doctor prescribed a course of mercurials to clear up the fungal infection.",
            "sent2": "She bought some mercurials from the pharmacy to help with her skin condition.",
            "sent3": "The mercurials worked wonders on his athlete's foot, clearing it up in just a few days.",
            "sent4": "The mercurials had a strong smell, but it was worth it for the relief they provided.",
            "sent5": "After using the mercurials for a week, the infection was completely gone."
        },
        {
            "definition": "A type of athletic shoe with cleats for traction on grass or turf.",
            "pos": "noun",
            "sent1": "He wore his new mercurials for the soccer game to get better grip on the field.",
            "sent2": "The team's coach recommended getting mercurials for better performance during matches.",
            "sent3": "The mercurials left marks on the grass field, showing how effective they were.",
            "sent4": "The players felt more confident wearing the mercurials during the game.",
            "sent5": "The mercurials helped him run faster and make sharper turns on the field."
        }
    ]
}