{
    "term": "mercurial",
    "meanings": [
        {
            "definition": "Subject to sudden or unpredictable changes in mood or mind.",
            "pos": "adjective",
            "sent1": "Her mercurial nature made it hard to predict how she would react to any situation.",
            "sent2": "The weather in spring can be quite mercurial, changing from sunny to rainy in a matter of minutes.",
            "sent3": "His mercurial behavior at the party kept everyone on their toes, never knowing what he would do next.",
            "sent4": "The stock market can be as mercurial as a lightning strike, shifting dramatically in a short period of time.",
            "sent5": "The mercurial artist's mood swings were as unpredictable as the changing colors of a chameleon."
        },
        {
            "definition": "Relating to or characteristic of the god Mercury.",
            "pos": "adjective",
            "sent1": "The ancient statue depicted Mercury in a mercurial pose, ready to deliver messages swiftly.",
            "sent2": "The messenger's mercurial speed allowed him to travel great distances in a short time.",
            "sent3": "The mercurial messenger always arrived just in time, as if he had a magical sense of timing.",
            "sent4": "Her dance was as mercurial as the movements of Mercury himself, graceful and swift.",
            "sent5": "The mercurial wings of the messenger god shimmered in the sunlight, reflecting his divine speed."
        },
        {
            "definition": "Containing or relating to the element mercury.",
            "pos": "adjective",
            "sent1": "The old thermometer contained mercurial liquid that expanded and contracted with temperature changes.",
            "sent2": "The scientist studied the mercurial properties of the element in the lab.",
            "sent3": "The mercurial substance was carefully handled due to its toxic nature.",
            "sent4": "The mercurial metal flowed like a river when heated, showing its unique properties.",
            "sent5": "The mercurial vapor rose from the spilled element, shimmering in the dim light of the room."
        }
    ]
}