{
    "term": "merks",
    "meanings": [
        {
            "definition": "A unit of currency in Scotland",
            "pos": "noun",
            "sent1": "In Scotland, people use merks to buy things.",
            "sent2": "I exchanged my merks for goods at the market.",
            "sent3": "The shopkeeper only accepts merks, no other currency!",
            "sent4": "Her smile was like a handful of shiny merks, brightening up the room.",
            "sent5": "The sound of merks clinking together is music to my ears."
        },
        {
            "definition": "Marks or signs used to indicate ownership or authenticity",
            "pos": "noun",
            "sent1": "The artist's merks were found on the bottom corner of the painting.",
            "sent2": "The merks on the document proved its legitimacy.",
            "sent3": "The detective followed the trail of merks to solve the mystery.",
            "sent4": "Her laughter left merks of joy in everyone's hearts.",
            "sent5": "The old book was filled with mysterious merks, hinting at its age and value."
        },
        {
            "definition": "A type of medieval coin",
            "pos": "noun",
            "sent1": "The museum displayed ancient merks from the medieval era.",
            "sent2": "Collectors sought after rare merks to add to their coin collections.",
            "sent3": "The knight paid for his armor with a handful of shiny merks.",
            "sent4": "The merks gleamed in the sunlight, a glimpse of history in his palm.",
            "sent5": "The merchant's pouch jingled with the weight of the medieval merks."
        },
        {
            "definition": "To mark or distinguish with a symbol or sign",
            "pos": "verb",
            "sent1": "She merks her books with colorful stickers to identify them easily.",
            "sent2": "The artist merks each painting with her unique signature.",
            "sent3": "He merks his territory by planting flags in the ground.",
            "sent4": "The memories of that day are merked in my mind forever.",
            "sent5": "The ancient tree was merked with symbols of wisdom and strength."
        }
    ]
}