{
    "term": "mesomorphic",
    "meanings": [
        {
            "definition": "Having a muscular or athletic build.",
            "pos": "adjective",
            "sent1": "The wrestler had a mesomorphic physique that made him stand out in the ring.",
            "sent2": "She admired the mesomorphic bodies of the athletes competing in the race.",
            "sent3": "The mesomorphic weightlifter tried to squeeze into the tiny car, causing everyone to chuckle.",
            "sent4": "His mesomorphic strength was like a fortress, impenetrable and powerful.",
            "sent5": "The mesomorphic man's muscles rippled like waves as he lifted the heavy weights."
        },
        {
            "definition": "Of or relating to a body type characterized by a muscular build.",
            "pos": "adjective",
            "sent1": "The gym was filled with mesomorphic individuals working hard to maintain their strong bodies.",
            "sent2": "Her mesomorphic frame allowed her to excel in sports requiring physical strength.",
            "sent3": "The mesomorphic cat strutted around the room as if it owned the place.",
            "sent4": "The mountain stood tall and mesomorphic against the horizon, a symbol of strength and endurance.",
            "sent5": "The mesomorphic tree trunk seemed unbreakable, standing firm against the storm."
        },
        {
            "definition": "A person with a mesomorphic body type.",
            "pos": "noun",
            "sent1": "The mesomorphic won the bodybuilding competition with ease, showcasing their powerful physique.",
            "sent2": "He was known in the gym as the ultimate mesomorphic, inspiring others with his strength.",
            "sent3": "The mesomorphic at the party was the life of the event, entertaining everyone with their feats of strength.",
            "sent4": "She was a mesomorphic force to be reckoned with on the field, dominating the game effortlessly.",
            "sent5": "The mesomorphic stood out in the crowd, their muscular form drawing admiring glances from onlookers."
        }
    ]
}