{
    "term": "messaline",
    "meanings": [
        {
            "definition": "A lightweight fabric with a satin weave",
            "pos": "noun",
            "sent1": "She chose a beautiful messaline gown for the party.",
            "sent2": "The bride wore a stunning messaline dress on her wedding day.",
            "sent3": "The magician pulled a messaline scarf out of his hat.",
            "sent4": "Her words flowed like a smooth messaline fabric.",
            "sent5": "The sunlight shimmered on the delicate messaline material."
        },
        {
            "definition": "A type of dress fabric",
            "pos": "noun",
            "sent1": "The designer used messaline to create the elegant dress.",
            "sent2": "The boutique displayed a variety of messaline dresses.",
            "sent3": "The cat played with a piece of messaline fabric like a toy.",
            "sent4": "Her laughter was as light and airy as messaline.",
            "sent5": "The messaline dress flowed gracefully as she walked."
        },
        {
            "definition": "A type of silk fabric",
            "pos": "noun",
            "sent1": "The luxurious messaline silk felt smooth against her skin.",
            "sent2": "The tailor recommended using messaline silk for the gown.",
            "sent3": "The mischievous kitten tangled itself in the messaline silk.",
            "sent4": "Her voice was as soft as a whisper in messaline silk.",
            "sent5": "The messaline silk glowed in the candlelight."
        },
        {
            "definition": "A type of fabric used for evening gowns",
            "pos": "noun",
            "sent1": "The actress looked stunning in her messaline evening gown.",
            "sent2": "Messaline fabric is a popular choice for elegant evening wear.",
            "sent3": "The puppy chewed on a corner of the messaline evening gown.",
            "sent4": "Her dreams were woven with threads of shimmering messaline.",
            "sent5": "The moonlight danced on the flowing messaline gown."
        }
    ]
}