{
    "term": "metalise",
    "meanings": [
        {
            "definition": "To convert into metal.",
            "pos": "verb",
            "sent1": "I watched the blacksmith metalise the iron bar into a shiny sword.",
            "sent2": "The factory uses a special machine to metalise the raw materials into usable products.",
            "sent3": "The magician tried to metalise a coin into gold but ended up with a silver coin instead.",
            "sent4": "Her smile seemed to metalise the room, brightening up everyone's mood.",
            "sent5": "The sun's rays seemed to metalise the ocean, turning it into a shimmering sheet of silver."
        },
        {
            "definition": "To coat or cover with metal.",
            "pos": "verb",
            "sent1": "The artist decided to metalise the sculpture to give it a unique and shiny finish.",
            "sent2": "The workers carefully metalise the car parts to protect them from rusting.",
            "sent3": "I accidentally metalised my keys with paint, making them look like metal.",
            "sent4": "The moonlight seemed to metalise the trees, casting a silvery glow over the forest.",
            "sent5": "The chef used edible silver to metalise the dessert, making it look like a piece of art."
        },
        {
            "definition": "To give a metallic quality or appearance to.",
            "pos": "verb",
            "sent1": "The new paint color will metalise the walls, giving them a modern and sleek look.",
            "sent2": "The jewelry designer used a special technique to metalise the beads, making them shine like metal.",
            "sent3": "The robot's voice sounded like it was metalised, adding a futuristic touch to the presentation.",
            "sent4": "Her laughter seemed to metalise the air, filling the room with a joyful metallic sound.",
            "sent5": "The storm clouds seemed to metalise the sky, turning it into a dark and ominous metallic canvas."
        }
    ]
}