{
    "term": "metalworking",
    "meanings": [
        {
            "definition": "The process of shaping and manipulating metal to create objects or structures.",
            "pos": "noun",
            "sent1": "Metalworking requires skill and precision to shape metal into useful items.",
            "sent2": "My grandfather enjoys metalworking in his workshop, creating beautiful sculptures.",
            "sent3": "After a long day of metalworking, the blacksmith's arms felt like they were made of metal.",
            "sent4": "Her mind was a workshop of ideas, metalworking thoughts into intricate designs.",
            "sent5": "The sparks flying from the metalworking process illuminated the dark workshop."
        },
        {
            "definition": "The act of working with metal to form or repair items.",
            "pos": "noun",
            "sent1": "Metalworking is essential for fixing broken tools and creating new ones.",
            "sent2": "The artist's metalworking skills were evident in the detailed jewelry she crafted.",
            "sent3": "The robot claimed to be a master of metalworking, but its creations always fell apart.",
            "sent4": "His words were like metalworking tools, shaping the opinions of those around him.",
            "sent5": "The rhythmic sound of hammering filled the air as the metalworking continued."
        },
        {
            "definition": "The craft or trade of creating objects from metal.",
            "pos": "noun",
            "sent1": "Metalworking has been a respected craft for centuries, producing both art and tools.",
            "sent2": "The apprentice learned the secrets of metalworking from the experienced blacksmith.",
            "sent3": "The metalworking market was booming, with artisans showcasing their latest creations.",
            "sent4": "Her laughter tinkled like the sound of metalworking, bringing joy to all who heard.",
            "sent5": "The metalworking guild held a competition to showcase the best creations of the year."
        }
    ]
}