{
    "term": "metasomatic",
    "meanings": [
        {
            "definition": "Involving or resulting from metasomatism.",
            "pos": "adjective",
            "sent1": "The metasomatic changes in the rock were caused by chemical reactions.",
            "sent2": "The geologist studied the metasomatic alterations in the mineral composition.",
            "sent3": "The classroom had a metasomatic makeover when the students redecorated it with new posters.",
            "sent4": "Her wardrobe underwent a metasomatic transformation after she discovered a new fashion style.",
            "sent5": "The garden underwent a metasomatic change as different flowers were planted, creating a colorful display."
        },
        {
            "definition": "Characterized by metasomatism.",
            "pos": "adjective",
            "sent1": "The metasomatic nature of the process was evident in the altered minerals.",
            "sent2": "The metasomatic rocks displayed clear signs of chemical replacement.",
            "sent3": "The cat's metasomatic behavior of moving its toys around the house amused the family.",
            "sent4": "The city's skyline had a metasomatic appearance as new skyscrapers were built.",
            "sent5": "The artist's painting had a metasomatic quality, with layers of colors blending seamlessly."
        },
        {
            "definition": "Relating to the process of metasomatism.",
            "pos": "adjective",
            "sent1": "The geologist's metasomatic research focused on the changes in mineral composition.",
            "sent2": "The textbook provided detailed information on metasomatic processes in rocks.",
            "sent3": "The chef's metasomatic approach to cooking involved experimenting with new ingredients.",
            "sent4": "The city's development plan had a metasomatic strategy to revitalize the downtown area.",
            "sent5": "The scientist's metasomatic experiments led to groundbreaking discoveries in the field of chemistry."
        }
    ]
}