{
    "term": "metepa",
    "meanings": [
        {
            "definition": "A type of plant native to South America.",
            "pos": "noun",
            "sent1": "The metepa grew tall in the rainforest.",
            "sent2": "I saw a beautiful metepa in the botanical garden.",
            "sent3": "The monkeys enjoyed swinging from the metepa branches.",
            "sent4": "The metepa stood like a green giant in the jungle.",
            "sent5": "The vibrant colors of the metepa leaves caught my eye."
        },
        {
            "definition": "To engage in a specific type of dance.",
            "pos": "verb",
            "sent1": "We metepa around the fire at the festival.",
            "sent2": "She loves to metepa to the rhythm of the drums.",
            "sent3": "The children giggled as they tried to metepa together.",
            "sent4": "The flames seemed to metepa in the darkness.",
            "sent5": "The dancers gracefully metepa across the stage."
        },
        {
            "definition": "A traditional dish made with corn and meat.",
            "pos": "noun",
            "sent1": "Grandma's metepa was always a hit at family gatherings.",
            "sent2": "I can't wait to taste the delicious metepa at the restaurant.",
            "sent3": "The chef added a unique twist to the classic metepa recipe.",
            "sent4": "The aroma of the simmering metepa filled the kitchen.",
            "sent5": "The steaming hot metepa warmed my soul on a cold day."
        },
        {
            "definition": "A type of fabric used in clothing.",
            "pos": "noun",
            "sent1": "The dress was made of a soft metepa material.",
            "sent2": "She admired the intricate patterns on the metepa fabric.",
            "sent3": "The metepa cloth felt smooth against her skin.",
            "sent4": "Her eyes sparkled in the shimmering metepa gown.",
            "sent5": "The metepa scarf added a pop of color to her outfit."
        }
    ]
}