{
    "term": "methotrexate",
    "meanings": [
        {
            "definition": "A drug used to treat certain types of cancer and autoimmune diseases.",
            "pos": "noun",
            "sent1": "The doctor prescribed methotrexate to help fight the cancer cells.",
            "sent2": "She takes methotrexate regularly to manage her autoimmune condition.",
            "sent3": "When the methotrexate kicked in, the cancer cells were in for a surprise!",
            "sent4": "Methotrexate acted like a warrior, battling the cancer cells with determination.",
            "sent5": "The methotrexate pill was like a superhero fighting off the evil cancer invaders."
        },
        {
            "definition": "The generic name for a medication commonly prescribed for rheumatoid arthritis.",
            "pos": "noun",
            "sent1": "My grandmother relies on methotrexate to ease her rheumatoid arthritis symptoms.",
            "sent2": "Doctors often recommend methotrexate as a first-line treatment for rheumatoid arthritis.",
            "sent3": "The methotrexate bottle seemed to wink at her, promising relief from the joint pain.",
            "sent4": "Methotrexate was like a soothing balm for her aching joints.",
            "sent5": "The methotrexate tablets were her trusted companions in the battle against arthritis."
        },
        {
            "definition": "A chemotherapy drug that works by interfering with the growth of cancer cells.",
            "pos": "noun",
            "sent1": "The oncologist explained how methotrexate targets and stops cancer cell growth.",
            "sent2": "Patients undergoing chemotherapy often receive methotrexate to combat cancer.",
            "sent3": "The cancer cells were no match for the cunning methotrexate.",
            "sent4": "Methotrexate was like a silent assassin, halting the cancer cells' progress.",
            "sent5": "The methotrexate infusion was a powerful weapon against the relentless cancer cells."
        }
    ]
}