{
    "term": "metronidazole",
    "meanings": [
        {
            "definition": "A synthetic antibacterial and antiprotozoal agent used to treat various infections.",
            "pos": "noun",
            "sent1": "The doctor prescribed metronidazole to fight off the infection.",
            "sent2": "I picked up my metronidazole prescription from the pharmacy.",
            "sent3": "The bacteria were no match for the mighty metronidazole!",
            "sent4": "Metronidazole acted like a superhero, battling the harmful invaders in my body.",
            "sent5": "The metronidazole pill was my weapon against the illness, like a tiny soldier fighting a big war."
        },
        {
            "definition": "The generic name for a medication commonly sold under the brand name Flagyl.",
            "pos": "noun",
            "sent1": "My doctor recommended metronidazole for my infection.",
            "sent2": "I asked the pharmacist for the generic metronidazole instead of the brand name.",
            "sent3": "I felt like a detective choosing between the mysterious metronidazole and the well-known Flagyl.",
            "sent4": "Metronidazole was like a secret identity, hiding behind the famous Flagyl.",
            "sent5": "The word metronidazole sounded like a magic spell that could cure any ailment."
        },
        {
            "definition": "A drug that is effective against anaerobic bacteria and certain parasites.",
            "pos": "noun",
            "sent1": "The vet prescribed metronidazole to treat the parasite in my pet's stomach.",
            "sent2": "Metronidazole is known for its ability to combat anaerobic bacteria.",
            "sent3": "The anaerobic bacteria were no match for the powerful metronidazole!",
            "sent4": "Metronidazole worked like a shield, protecting against harmful parasites.",
            "sent5": "The metronidazole treatment cleared the infection, leaving no trace of the harmful bacteria."
        }
    ]
}