{
    "term": "metric",
    "meanings": [
        {
            "definition": "A system of measurement based on the meter, gram, and liter as units of length, weight, and capacity.",
            "pos": "noun",
            "sent1": "In science class, we learned about the metric system and how it helps us measure things accurately.",
            "sent2": "The ruler we used to measure the length of the table was in metric units like centimeters and meters.",
            "sent3": "I tried to measure the height of my cat using the metric system, but she kept moving around!",
            "sent4": "The precision of the metric system is like a skilled artist painting with fine brushes.",
            "sent5": "Using the metric system makes converting units much easier and less confusing."
        },
        {
            "definition": "Relating to or using the metric system of measurement.",
            "pos": "adjective",
            "sent1": "The scientist preferred using metric measurements for accuracy in his experiments.",
            "sent2": "The road signs in Europe often display speed limits in metric units like kilometers per hour.",
            "sent3": "My friend joked that my love for metric measurements made me a 'metric maniac'!",
            "sent4": "Her precision in baking was like a chef following a strict metric recipe.",
            "sent5": "The carpenter's work was so precise, it seemed to follow a perfect metric pattern."
        },
        {
            "definition": "A standard for measuring or evaluating something.",
            "pos": "noun",
            "sent1": "The company set a new metric for customer satisfaction to improve their services.",
            "sent2": "In sports, coaches often use metrics like time and distance to track athletes' progress.",
            "sent3": "The comedian's metric for a successful show was the number of laughs he received.",
            "sent4": "Her kindness was a metric for measuring the warmth of her heart.",
            "sent5": "The success of the project was measured by a clear metric of completed tasks."
        }
    ]
}