{
    "term": "metros",
    "meanings": [
        {
            "definition": "The basic unit of length in the metric system, equal to 100 centimeters.",
            "pos": "noun",
            "sent1": "I measured the table using metros and found it to be two units long.",
            "sent2": "The teacher explained that a meter consists of 100 centimeters, which are called metros.",
            "sent3": "The cat thought the string was a fun toy, not realizing it was actually two metros long.",
            "sent4": "Her patience was as long as a line of metros stretching across the room.",
            "sent5": "The sunlight illuminated the room, revealing the length of the table in clear metros."
        },
        {
            "definition": "The underground railway system in a city.",
            "pos": "noun",
            "sent1": "During rush hour, the metros were crowded with commuters heading to work.",
            "sent2": "She preferred taking the metros to avoid traffic jams on the roads.",
            "sent3": "The mouse was thrilled to explore the underground metros, thinking it was a maze of tunnels.",
            "sent4": "The metros were like veins running through the city, connecting different neighborhoods.",
            "sent5": "The sound of the approaching metros echoed through the station, signaling the arrival of the train."
        },
        {
            "definition": "The basic unit of length in the metric system, equal to 1000 meters.",
            "pos": "noun",
            "sent1": "The marathon runner completed 42.195 kilometers, which is equivalent to 42,195 metros.",
            "sent2": "Scientists use metros to measure vast distances in space.",
            "sent3": "The ant mistakenly thought the length of the stick was only a few metros.",
            "sent4": "His determination to finish the race was as long as a road of metros.",
            "sent5": "The mountain climber estimated the peak to be several thousand metros above sea level."
        }
    ]
}