{
    "term": "mickeys",
    "meanings": [
        {
            "definition": "A small, round, flat disc used in certain card games.",
            "pos": "noun",
            "sent1": "During the game, players use mickeys to keep track of their points.",
            "sent2": "I found a box of mickeys in the attic, perfect for playing card games.",
            "sent3": "Tom accidentally dropped all the mickeys on the floor, causing a commotion.",
            "sent4": "Her eyes sparkled like shiny mickeys as she collected them from the table.",
            "sent5": "The sound of mickeys clinking together filled the room as they shuffled the deck."
        },
        {
            "definition": "A slang term for a type of alcoholic beverage, typically a small bottle of liquor.",
            "pos": "noun",
            "sent1": "At the party, they passed around mickeys of whiskey for everyone to enjoy.",
            "sent2": "He always carries a mickey of vodka in his pocket for emergencies.",
            "sent3": "Sarah giggled after taking a sip from the mickey, feeling the warmth spread.",
            "sent4": "The mickey of rum was like a tiny treasure chest waiting to be opened.",
            "sent5": "The bartender poured a shot from the mickey with a steady hand, expertly measuring."
        },
        {
            "definition": "A slang term for a type of drug that causes unconsciousness or amnesia.",
            "pos": "noun",
            "sent1": "The criminal slipped a mickey into the victim's drink to knock them out.",
            "sent2": "She woke up with no memory of the night before, suspecting a mickey had been involved.",
            "sent3": "The detective found a hidden stash of mickeys in the suspect's apartment.",
            "sent4": "The mickey acted like a magic potion, erasing all memories of the event.",
            "sent5": "The sinister villain always carried a mickey to use on unsuspecting victims."
        },
        {
            "definition": "A slang term for a type of prank or practical joke.",
            "pos": "noun",
            "sent1": "The group of friends planned to pull a mickey on their teacher during class.",
            "sent2": "He couldn't stop laughing after the hilarious mickey they played on him.",
            "sent3": "The classic mickey involved a whoopee cushion and lots of laughter.",
            "sent4": "Their friendship grew stronger after the mickey they pulled on each other.",
            "sent5": "The mischievous grin on his face hinted at the upcoming mickey he had planned."
        }
    ]
}