{
    "term": "micky",
    "meanings": [
        {
            "definition": "A slang term for a drug that is slipped into someone's drink without their knowledge",
            "pos": "noun",
            "sent1": "She was worried someone might slip a micky into her drink at the party.",
            "sent2": "He found a micky in his drink and knew something was wrong.",
            "sent3": "The friends planned a micky prank on April Fools' Day.",
            "sent4": "The idea of a micky in her drink felt like a betrayal.",
            "sent5": "The micky in the drink turned the night into a nightmare.",
            "sent6": "After hearing about the micky incident, she became more cautious at parties."
        },
        {
            "definition": "A slang term for a type of alcoholic beverage, typically a small bottle",
            "pos": "noun",
            "sent1": "He grabbed a micky of whiskey for the camping trip.",
            "sent2": "She enjoyed sipping on a micky of rum by the fireplace.",
            "sent3": "The tiny micky of vodka looked cute on the shelf.",
            "sent4": "The micky of tequila was like a little treasure in the liquor cabinet.",
            "sent5": "The micky of gin added a touch of elegance to the party.",
            "sent6": "They shared a micky of brandy to celebrate their success."
        },
        {
            "definition": "A slang term for a type of prank or practical joke, often involving deception or trickery.",
            "pos": "noun",
            "sent1": "The kids played a micky on their teacher by hiding his chalk.",
            "sent2": "She fell for the classic micky of the fake spider on her desk.",
            "sent3": "The micky they pulled on him was harmless but hilarious.",
            "sent4": "The micky they played on her was a clever way to lighten the mood.",
            "sent5": "The micky they planned for the party involved a fake ghost scare.",
            "sent6": "He decided to pull a micky on his sister by hiding her favorite toy."
        }
    ]
}