{
    "term": "mickey",
    "meanings": [
        {
            "definition": "A small bottle of alcohol",
            "pos": "noun",
            "sent1": "I found a mickey of whiskey in the cabinet.",
            "sent2": "The bartender poured a shot from the mickey of vodka.",
            "sent3": "At the party, someone brought a mickey of rum as a gift.",
            "sent4": "The mickey of tequila hit me harder than I expected.",
            "sent5": "The mickey of gin was so tiny, it looked like a toy bottle."
        },
        {
            "definition": "A type of prank or practical joke",
            "pos": "noun",
            "sent1": "Tommy played a mickey on his sister by hiding her toy.",
            "sent2": "The class clown pulled a mickey on the teacher by switching the chairs.",
            "sent3": "The mickey they pulled on me was actually quite funny.",
            "sent4": "Their prank was a real mickey that caught everyone off guard.",
            "sent5": "The mickey they planned was so clever, it made everyone laugh."
        },
        {
            "definition": "A type of computer mouse",
            "pos": "noun",
            "sent1": "I need to buy a new mickey for my laptop.",
            "sent2": "The wireless mickey makes it easier to navigate the screen.",
            "sent3": "The mickey on my computer stopped working, so I had to use the touchpad.",
            "sent4": "The mickey with extra buttons helped me work faster.",
            "sent5": "The mickey with the red light looked cool on the desk."
        },
        {
            "definition": "A type of drug cocktail used to incapacitate someone",
            "pos": "noun",
            "sent1": "The criminal used a mickey to drug his victim.",
            "sent2": "The detective found evidence of a mickey in the suspect's bag.",
            "sent3": "The mickey they used in the movie plot was quite elaborate.",
            "sent4": "The villain's plan involved slipping a mickey into the hero's drink.",
            "sent5": "The spy had to be careful not to fall for the enemy's mickey."
        }
    ]
}