{
    "term": "microprism",
    "meanings": [
        {
            "definition": "A small prism used in photography to aid in focusing.",
            "pos": "noun",
            "sent1": "The photographer adjusted the microprism to sharpen the image.",
            "sent2": "The microprism helped the photographer focus the camera on the subject.",
            "sent3": "When the microprism started glowing, the photographer knew it was time to capture the perfect shot.",
            "sent4": "Her eyes were like a microprism, reflecting every detail of the scene before her.",
            "sent5": "The tiny microprism made the picture crystal clear, like looking through a window."
        },
        {
            "definition": "A tiny, geometrically shaped crystal used in microscopy.",
            "pos": "noun",
            "sent1": "Under the microscope, the microprism revealed intricate details of the specimen.",
            "sent2": "Scientists use a microprism to magnify small objects for closer examination.",
            "sent3": "The mischievous scientist accidentally dropped the microprism into the petri dish, creating a sparkly mess.",
            "sent4": "The microprism acted like a magnifying glass, bringing the tiniest features into focus.",
            "sent5": "Through the microprism, the world of the unseen became visible and fascinating."
        },
        {
            "definition": "A small, transparent prism used in optical instruments.",
            "pos": "noun",
            "sent1": "The telescope's microprism enhanced the clarity of distant stars in the night sky.",
            "sent2": "Opticians often use a microprism to improve the precision of their instruments.",
            "sent3": "As the light passed through the microprism, it created a beautiful rainbow effect.",
            "sent4": "Her eyes viewed the world through a microprism, seeing beauty in every angle.",
            "sent5": "The microprism in the binoculars made the landscape appear closer and more vibrant."
        }
    ]
}