{
    "term": "midrange",
    "meanings": [
        {
            "definition": "The middle part of a range or scale.",
            "pos": "noun",
            "sent1": "In music, the midrange is where most vocals and instruments are heard clearly.",
            "sent2": "The midrange of the mountain was covered in lush greenery.",
            "sent3": "The midrange of the rainbow seemed to be the most colorful section.",
            "sent4": "Her voice was like the midrange of a piano, neither too high nor too low.",
            "sent5": "The midrange of the painting drew the viewer's attention with its vibrant colors."
        },
        {
            "definition": "A speaker or driver designed to reproduce sounds in the middle frequency range.",
            "pos": "noun",
            "sent1": "The midrange speaker enhanced the clarity of the vocals in the song.",
            "sent2": "When setting up the sound system, make sure to adjust the midrange properly.",
            "sent3": "The midrange speaker cracked a joke during the concert, surprising everyone.",
            "sent4": "Her laughter was like a midrange note, filling the room with warmth.",
            "sent5": "The midrange driver delivered crisp sound quality for the entire audience to enjoy."
        },
        {
            "definition": "A value that is halfway between the minimum and maximum values in a set of data.",
            "pos": "noun",
            "sent1": "The midrange of the dataset helped in understanding the overall distribution.",
            "sent2": "Calculating the midrange is a simple way to get a rough estimate of the data spread.",
            "sent3": "The midrange of the temperature readings was surprisingly consistent throughout the week.",
            "sent4": "Her mood swung like the midrange of a pendulum, never reaching extremes.",
            "sent5": "The midrange of the speedometer indicated a steady and safe driving pace."
        }
    ]
}