{
    "term": "mifepristone",
    "meanings": [
        {
            "definition": "A synthetic steroid compound used as an abortifacient in combination with misoprostol.",
            "pos": "noun",
            "sent1": "The doctor prescribed mifepristone to help end the pregnancy.",
            "sent2": "After taking mifepristone, the woman experienced the termination of her pregnancy.",
            "sent3": "The mifepristone pill worked like magic to stop the baby from growing.",
            "sent4": "Her decision to take mifepristone was like pressing a button to halt the pregnancy.",
            "sent5": "The effects of mifepristone were swift and decisive in ending the pregnancy."
        },
        {
            "definition": "A medication that blocks the effects of progesterone, leading to the termination of pregnancy.",
            "pos": "noun",
            "sent1": "The nurse explained how mifepristone stops the hormone that keeps the pregnancy going.",
            "sent2": "Using mifepristone can prevent the body from supporting the pregnancy.",
            "sent3": "It's as if mifepristone puts a lock on the pregnancy hormone, stopping it in its tracks.",
            "sent4": "The mifepristone medication acts like a shield against the pregnancy hormone.",
            "sent5": "The doctor described mifepristone as a key player in ending the pregnancy."
        },
        {
            "definition": "A drug used to induce abortion in early pregnancy.",
            "pos": "noun",
            "sent1": "The clinic provided mifepristone to help with the early abortion process.",
            "sent2": "Mifepristone is commonly used to start the abortion procedure in the first trimester.",
            "sent3": "The mifepristone pill kickstarts the abortion process smoothly.",
            "sent4": "Using mifepristone is like opening the door to the abortion process.",
            "sent5": "The effects of mifepristone are crucial in initiating the abortion in early pregnancy."
        }
    ]
}