{
    "term": "mig",
    "meanings": [
        {
            "definition": "A small amount or quantity",
            "pos": "noun",
            "sent1": "She only needed a mig of sugar for the recipe.",
            "sent2": "He poured a mig of milk into his coffee.",
            "sent3": "The tiny ant carried a mig of food on its back.",
            "sent4": "Her smile brightened just a mig when she saw the surprise.",
            "sent5": "The mig of courage he had left pushed him to take the leap."
        },
        {
            "definition": "A type of aircraft",
            "pos": "noun",
            "sent1": "The military base displayed a powerful mig during the air show.",
            "sent2": "The pilot flew the mig smoothly through the clouds.",
            "sent3": "The noisy mig startled the birds in the sky.",
            "sent4": "The mig soared gracefully like a bird in flight.",
            "sent5": "The mig's engines roared as it took off into the sky."
        },
        {
            "definition": "A type of welding torch",
            "pos": "noun",
            "sent1": "The welder used a mig to join the metal pieces together.",
            "sent2": "The bright light from the mig illuminated the workshop.",
            "sent3": "The hissing sound of the mig filled the air as the welder worked.",
            "sent4": "The mig's flame danced like a fiery dragon's breath.",
            "sent5": "The welder's skilled hands controlled the mig with precision."
        },
        {
            "definition": "A type of beer mug",
            "pos": "noun",
            "sent1": "He raised the mig filled with ale in a toast.",
            "sent2": "The bartender served the customer a cold beer in a mig.",
            "sent3": "The clinking of migs echoed in the lively pub.",
            "sent4": "The intricate design on the mig sparkled under the pub lights.",
            "sent5": "The foam on the beer in the mig looked like a fluffy cloud."
        }
    ]
}