{
    "term": "miliarias",
    "meanings": [
        {
            "definition": "A skin condition characterized by small red bumps or blisters caused by excessive sweating.",
            "pos": "noun",
            "sent1": "After playing sports all day, he developed miliarias on his chest from sweating too much.",
            "sent2": "The doctor diagnosed her with miliarias after noticing the red bumps on her arms.",
            "sent3": "The miliarias on his back made him feel like a human strawberry patch.",
            "sent4": "Her miliarias were like tiny volcanoes erupting on her skin.",
            "sent5": "The miliarias looked like a constellation of red stars on her body."
        },
        {
            "definition": "A unit of length equal to one thousandth of an inch.",
            "pos": "noun",
            "sent1": "The jeweler needed to measure the gem with a miliarias to ensure precision.",
            "sent2": "The fabric was so delicate that it was measured in miliarias to get the exact length.",
            "sent3": "Using a miliarias ruler, she carefully marked the tiny measurements on the paper.",
            "sent4": "The miliarias measurement was crucial for the watchmaker to assemble the intricate timepiece.",
            "sent5": "The miliarias distance was too small to see without a magnifying glass."
        },
        {
            "definition": "A Roman measure of distance equivalent to one thousand paces.",
            "pos": "noun",
            "sent1": "The soldiers marched for a miliarias before reaching the next camp.",
            "sent2": "The ancient road was marked with miliarias to guide travelers on their journey.",
            "sent3": "The miliarias marker was a welcome sight for the weary travelers.",
            "sent4": "The miliarias distance seemed never-ending under the scorching sun.",
            "sent5": "The miliarias distance felt like a test of endurance for the Roman legionnaires."
        }
    ]
}