{
    "term": "militaristic",
    "meanings": [
        {
            "definition": "Relating to or characteristic of a military or armed forces.",
            "pos": "adjective",
            "sent1": "The country's militaristic approach to defense involves strict training for all soldiers.",
            "sent2": "The militaristic uniforms worn by the troops displayed a sense of discipline and order.",
            "sent3": "The militaristic penguins marched in perfect formation, ready for their daily fishing mission.",
            "sent4": "Her militaristic leadership style kept the team focused and organized like a well-oiled machine.",
            "sent5": "The sound of boots echoing in the hallway created a militaristic atmosphere in the academy."
        },
        {
            "definition": "Advocating or supporting a strong military presence or policy.",
            "pos": "adjective",
            "sent1": "The politician's militaristic speeches called for increased defense spending and troop deployment.",
            "sent2": "The militaristic government implemented strict laws to maintain a powerful military force.",
            "sent3": "The militaristic cat demanded daily patrols around the house to protect against imaginary threats.",
            "sent4": "Her militaristic stance on national security made her a formidable opponent in the election.",
            "sent5": "The militaristic banners fluttered proudly in the wind, symbolizing strength and unity."
        },
        {
            "definition": "Displaying or promoting a militaristic attitude or mindset.",
            "pos": "adjective",
            "sent1": "The militaristic video game glorified war and combat, appealing to fans of action.",
            "sent2": "His militaristic behavior in the office made it clear that he valued discipline and order above all.",
            "sent3": "The militaristic squirrel stockpiled acorns in preparation for a fictional winter war.",
            "sent4": "Her militaristic approach to problem-solving involved strategic thinking and decisive action.",
            "sent5": "The militaristic posters in the recruitment office depicted soldiers as heroes of the nation."
        }
    ]
}