{
    "term": "milpas",
    "meanings": [
        {
            "definition": "A field of corn or other crops",
            "pos": "noun",
            "sent1": "The farmer tended to his milpas, ensuring the corn grew tall and healthy.",
            "sent2": "The milpas stretched out as far as the eye could see, filled with rows of golden corn.",
            "sent3": "The mischievous raccoon snuck into the milpas and nibbled on the ripe corn, leaving a trail of husks behind.",
            "sent4": "The milpas were a sea of green, swaying gently in the breeze like a vast, living carpet.",
            "sent5": "Walking through the milpas felt like being surrounded by a maze of towering cornstalks."
        },
        {
            "definition": "A type of agricultural system used in Mesoamerica",
            "pos": "noun",
            "sent1": "The ancient civilization thrived thanks to their innovative milpas, which sustained their population.",
            "sent2": "Milpas were the backbone of the agricultural practices in Mesoamerica, providing food and resources.",
            "sent3": "The neighboring tribes marveled at the efficiency of the milpas, each plant thriving in harmony with the others.",
            "sent4": "The milpas were like a well-oiled machine, each crop playing a crucial role in the system's success.",
            "sent5": "The milpas buzzed with activity, farmers working tirelessly to maintain the delicate balance of the ecosystem."
        },
        {
            "definition": "A traditional farming method used by indigenous peoples in Central America",
            "pos": "noun",
            "sent1": "Generations of families passed down the knowledge of milpas farming, preserving their cultural heritage.",
            "sent2": "The indigenous community relied on milpas farming for sustenance and connection to the land.",
            "sent3": "Children learned the art of milpas farming through stories and hands-on experience in the fields.",
            "sent4": "The milpas were a symbol of resilience, thriving against all odds in the changing landscape.",
            "sent5": "The aroma of the milpas lingered in the air, a comforting reminder of the cycle of life and growth."
        }
    ]
}