{
    "term": "mineralised",
    "meanings": [
        {
            "definition": "Convert (organic matter) into a mineral substance.",
            "pos": "verb",
            "sent1": "The ancient bones were mineralised over time, turning into hard rock.",
            "sent2": "The fallen leaves mineralised into rich soil, perfect for growing plants.",
            "sent3": "The old tree stump was surprised to find itself mineralised into a sparkling crystal.",
            "sent4": "Her memories slowly mineralised into precious gems in the caverns of her mind.",
            "sent5": "The once soft petals mineralised into beautiful, shimmering stones."
        },
        {
            "definition": "Impregnate or supply with minerals.",
            "pos": "verb",
            "sent1": "The mineralised water from the spring provided essential nutrients to the plants.",
            "sent2": "The geologist carefully mineralised the rock samples for analysis in the lab.",
            "sent3": "The chef's secret ingredient was a mineralised salt that enhanced the flavor of the dish.",
            "sent4": "The ancient civilization used special rituals to mineralise their weapons for strength in battle.",
            "sent5": "The mineralised lotion promised to nourish and revitalize the skin."
        },
        {
            "definition": "Become impregnated with minerals.",
            "pos": "verb",
            "sent1": "The soil mineralised quickly after the volcanic eruption, enriching the land.",
            "sent2": "The wooden shipwreck slowly mineralised underwater, becoming a habitat for marine life.",
            "sent3": "The old mine shaft mineralised over time, creating a glittering underground wonderland.",
            "sent4": "The abandoned building mineralised with moss and lichen, blending into the natural surroundings.",
            "sent5": "The fossilised dinosaur bones mineralised in the ancient riverbed, preserving them for millions of years."
        }
    ]
}