{
    "term": "mined",
    "meanings": [
        {
            "definition": "Extracted from the earth",
            "pos": "adjective",
            "sent1": "The shiny mineral was found in a mined cave.",
            "sent2": "The miners discovered a rich vein in the mined mountain.",
            "sent3": "The squirrel made a cozy nest in the mined burrow.",
            "sent4": "Her eyes sparkled like the gems in a mined treasure chest.",
            "sent5": "The landscape was transformed by the mined minerals, creating a beautiful sight."
        },
        {
            "definition": "Deliberately search for valuable resources",
            "pos": "verb",
            "sent1": "The explorers mined the area for hidden treasures.",
            "sent2": "They decided to mine the riverbed for gold.",
            "sent3": "The kids pretended to mine for candy in the backyard.",
            "sent4": "She mined the library for information on ancient civilizations.",
            "sent5": "The detective carefully mined the suspect's alibi for any inconsistencies."
        },
        {
            "definition": "Laid explosive mines in an area",
            "pos": "verb",
            "sent1": "The soldiers mined the field to protect their base.",
            "sent2": "The enemy troops planned to mine the road ahead.",
            "sent3": "The prankster thought it would be funny to mine the backyard with fake explosives.",
            "sent4": "The villain's plan was to mine the bridge and cause chaos.",
            "sent5": "The action movie featured a thrilling scene where the hero had to defuse the mined area before time ran out."
        },
        {
            "definition": "Carefully examined for information",
            "pos": "adjective",
            "sent1": "The mined data revealed interesting patterns.",
            "sent2": "The researchers presented their findings from the mined documents.",
            "sent3": "The detective's mined report helped solve the case.",
            "sent4": "Her mined notes were essential for the presentation.",
            "sent5": "The mined book contained hidden secrets waiting to be discovered."
        }
    ]
}