{
    "term": "mineralising",
    "meanings": [
        {
            "definition": "convert into a mineral substance",
            "pos": "verb",
            "sent1": "The heat and pressure were mineralising the rock.",
            "sent2": "Over time, the organic matter mineralises into fossils.",
            "sent3": "The magic potion was so powerful that it started mineralising everything it touched!",
            "sent4": "Her love for him was slowly mineralising his heart of stone.",
            "sent5": "The artist's brushstrokes mineralised the canvas with vibrant colors."
        },
        {
            "definition": "undergo mineralisation",
            "pos": "verb",
            "sent1": "The buried bones were mineralising in the soil.",
            "sent2": "The plant roots mineralise the nutrients from the soil.",
            "sent3": "The old pirate ship seemed to be mineralising into the ocean floor.",
            "sent4": "As time passed, the memories mineralised into a treasure trove of experiences.",
            "sent5": "The ancient ruins were slowly mineralising under the layers of dust."
        },
        {
            "definition": "cause to form a mineral",
            "pos": "verb",
            "sent1": "The volcanic activity mineralised the surrounding rocks.",
            "sent2": "The chemical reaction mineralises the elements into crystals.",
            "sent3": "The mischievous gnome decided to mineralise the garden gnome statues for fun.",
            "sent4": "Her laughter seemed to mineralise the room with joy.",
            "sent5": "The alchemist's experiment successfully mineralised the liquid into a precious gem."
        },
        {
            "definition": "become a mineral",
            "pos": "verb",
            "sent1": "Over time, the organic matter mineralises and becomes part of the earth.",
            "sent2": "The ancient tree stump mineralised into a beautiful fossil.",
            "sent3": "The superhero's cape seemed to mineralise into an indestructible material.",
            "sent4": "His determination mineralised into a solid resolve to achieve his goals.",
            "sent5": "The once molten lava mineralised into a stunning rock formation."
        }
    ]
}