{
    "term": "mingier",
    "meanings": [
        {
            "definition": "Miserly or stingy in giving or spending",
            "pos": "adjective",
            "sent1": "He is known for being mingier than anyone else in our group when it comes to sharing snacks.",
            "sent2": "The rich man became even mingier after losing a significant amount of money in the stock market.",
            "sent3": "Despite his mingier nature, he surprised us all by donating a large sum to the charity event.",
            "sent4": "Her mingier attitude towards lending money made her friends hesitant to ask for help.",
            "sent5": "The old miser's mingier ways only became more pronounced as he grew older."
        },
        {
            "definition": "Lacking generosity or willingness to spend money",
            "pos": "adjective",
            "sent1": "She became even mingier with her compliments after the argument with her friend.",
            "sent2": "The company's mingier approach to employee benefits led to a decrease in morale.",
            "sent3": "His mingier behavior at the restaurant made the waiter wonder if he was unhappy with the service.",
            "sent4": "The mingier attitude of the landlord made the tenants hesitant to ask for repairs.",
            "sent5": "The mingier attitude of the boss resulted in lower motivation among the employees."
        },
        {
            "definition": "Inferior in quality or size",
            "pos": "adjective",
            "sent1": "The mingier fabric used for the cheaper shirts made them less durable.",
            "sent2": "The mingier model of the car lacked the advanced features of the higher-end version.",
            "sent3": "Despite being mingier in size, the tiny house had a cozy and charming feel.",
            "sent4": "The mingier paint job on the house resulted in a less vibrant appearance.",
            "sent5": "The mingier screen resolution on the budget phone made it difficult to read text clearly."
        }
    ]
}