{
    "term": "mining",
    "meanings": [
        {
            "definition": "The process or industry of extracting minerals from the earth.",
            "pos": "noun",
            "sent1": "Mining requires digging deep into the ground to find valuable minerals.",
            "sent2": "The mining company invested in new equipment to extract gold from the mine.",
            "sent3": "During the mining operation, the workers found a hidden gemstone in the soil.",
            "sent4": "Her exploration of the old library felt like mining for forgotten knowledge.",
            "sent5": "The sound of pickaxes echoed through the mine, a symphony of hard work and determination."
        },
        {
            "definition": "The act of searching for valuable materials in a place.",
            "pos": "noun",
            "sent1": "The miner's job involves careful mining of the riverbed for precious stones.",
            "sent2": "After hours of mining, she finally discovered a rare fossil in the rock.",
            "sent3": "The children went mining in the backyard for hidden treasures during the game.",
            "sent4": "His eyes were like skilled miners, always searching for the truth in every situation.",
            "sent5": "The detective's investigation felt like mining for clues in a complex case."
        },
        {
            "definition": "The act of laying explosive mines.",
            "pos": "noun",
            "sent1": "The soldiers were trained in the art of mining to protect their territory.",
            "sent2": "The military unit strategically placed mines along the border for defense.",
            "sent3": "The prankster thought it would be funny to go mining in the backyard with fake explosives.",
            "sent4": "His words were like mines, ready to explode and cause chaos in the conversation.",
            "sent5": "The tension in the room was palpable, each word spoken felt like a carefully placed mine."
        }
    ]
}