{
    "term": "miniature",
    "meanings": [
        {
            "definition": "A very small painting, especially a portrait, on ivory or vellum.",
            "pos": "noun",
            "sent1": "The artist created a beautiful miniature of a flower on a tiny canvas.",
            "sent2": "She treasured the miniature portrait of her grandmother that fit in the palm of her hand.",
            "sent3": "The miniature painting of a cat wearing a top hat brought a smile to everyone's face.",
            "sent4": "Her love for him was like a miniature, delicate and intricate, capturing every detail of her feelings.",
            "sent5": "The miniature of the sunset was so lifelike, it seemed to glow with its own light."
        },
        {
            "definition": "A greatly reduced or abridged form or copy.",
            "pos": "noun",
            "sent1": "The tiny book was a miniature of the original, perfect for carrying in a pocket.",
            "sent2": "He made a miniature of the map to show only the main roads and landmarks.",
            "sent3": "The miniature of the play was a hilarious summary that had everyone laughing.",
            "sent4": "His explanation was like a miniature of the whole story, capturing the essence in a few words.",
            "sent5": "The miniature of the sculpture was so detailed, it looked like a tiny version of the real thing."
        },
        {
            "definition": "A small portrait or other painting.",
            "pos": "noun",
            "sent1": "She admired the miniature of the castle hanging on the wall, painted with intricate detail.",
            "sent2": "The artist specialized in creating miniatures of famous landmarks around the world.",
            "sent3": "The miniature of the ocean scene transported viewers to a peaceful seaside retreat.",
            "sent4": "Her smile in the miniature captured her joy in a small but powerful way.",
            "sent5": "The miniature of the forest was so realistic, it felt like you could step into the painting."
        }
    ]
}