{
    "term": "minister",
    "meanings": [
        {
            "definition": "A member of the clergy who conducts religious services.",
            "pos": "noun",
            "sent1": "The kind minister led the church service on Sunday.",
            "sent2": "The minister delivered a powerful sermon to the congregation.",
            "sent3": "The minister joked that even angels need a day off from singing.",
            "sent4": "Her words were like a minister of hope in the midst of despair.",
            "sent5": "The minister's voice echoed through the chapel, filling it with peace."
        },
        {
            "definition": "A high-ranking government official.",
            "pos": "noun",
            "sent1": "The prime minister addressed the nation on television.",
            "sent2": "The foreign minister met with diplomats from other countries.",
            "sent3": "The minister of finance accidentally wore mismatched socks to the meeting.",
            "sent4": "She was a minister of change, reshaping policies for the better.",
            "sent5": "The minister's decisions carried the weight of the entire government."
        },
        {
            "definition": "To attend to the needs of someone or something.",
            "pos": "verb",
            "sent1": "She would minister to the injured animals at the shelter.",
            "sent2": "The nurse rushed to minister to the patient in pain.",
            "sent3": "He tried to minister to his friend's broken heart with kind words.",
            "sent4": "Her soothing voice seemed to minister to the troubled souls in the room.",
            "sent5": "The warm soup seemed to minister to his cold body after being out in the snow."
        },
        {
            "definition": "To administer or dispense something, such as a sacrament or medication.",
            "pos": "verb",
            "sent1": "The doctor will minister the necessary medication to the patient.",
            "sent2": "She carefully ministered the sacrament to each member of the congregation.",
            "sent3": "The robot was programmed to minister the correct amount of oil to the machines.",
            "sent4": "Her hands seemed to minister healing to those she touched.",
            "sent5": "The rain seemed to minister life to the parched earth, bringing forth greenery."
        }
    ]
}