{
    "term": "mino",
    "meanings": [
        {
            "definition": "A small fish often used as bait",
            "pos": "noun",
            "sent1": "I caught a mino to use as bait for fishing.",
            "sent2": "The mino swam swiftly in the water.",
            "sent3": "The mino thought it was clever to outsmart the fishermen.",
            "sent4": "Her ideas were like minos in a vast ocean of thoughts.",
            "sent5": "The glimmering mino in the bucket caught my eye immediately."
        },
        {
            "definition": "A type of Japanese noodle",
            "pos": "noun",
            "sent1": "I ordered a bowl of mino noodles for lunch.",
            "sent2": "The mino noodles were served with a flavorful broth.",
            "sent3": "The chef playfully juggled the mino noodles in the air.",
            "sent4": "The steam rising from the mino noodles created a dreamy atmosphere.",
            "sent5": "The aroma of the mino noodles filled the room with warmth and comfort."
        },
        {
            "definition": "A person who is small in stature",
            "pos": "noun",
            "sent1": "The mino stood out in the crowd due to their height.",
            "sent2": "She was the shortest mino in the class.",
            "sent3": "The mino tried to reach the top shelf but couldn't quite make it.",
            "sent4": "In the land of giants, he was a mino among titans.",
            "sent5": "The tiny mino had a big heart full of kindness and courage."
        },
        {
            "definition": "To diminish or reduce in size or importance",
            "pos": "verb",
            "sent1": "The company decided to mino their workforce to cut costs.",
            "sent2": "Over time, the impact of his words began to mino.",
            "sent3": "She tried to mino the pile of laundry, but it seemed to grow instead.",
            "sent4": "The storm threatened to mino the entire village in its path.",
            "sent5": "The artist used shadows to mino the intensity of the painting."
        }
    ]
}