{
    "term": "minos",
    "meanings": [
        {
            "definition": "A legendary king of Crete, son of Zeus and Europa, who ordered Daedalus to build the Labyrinth.",
            "pos": "noun",
            "sent1": "In the story, Minos was a powerful ruler of Crete.",
            "sent2": "People still talk about the wise decisions made by Minos in ancient tales.",
            "sent3": "Minos, the legendary king, once challenged a clever inventor to build an impossible maze.",
            "sent4": "The authority of Minos was as unyielding as the stone walls of the Labyrinth.",
            "sent5": "The name Minos echoes through history as a symbol of leadership and strength."
        },
        {
            "definition": "A large, tropical fish with a compressed body and long dorsal and anal fins.",
            "pos": "noun",
            "sent1": "The minos swam gracefully through the clear waters of the reef.",
            "sent2": "Fishermen were excited to catch a rare minos during their expedition.",
            "sent3": "The minos fish was known for its vibrant colors and sleek appearance.",
            "sent4": "The minos moved through the ocean like a colorful arrow, swift and agile.",
            "sent5": "Children at the aquarium marveled at the beauty of the minos swimming in the tank."
        },
        {
            "definition": "A unit of currency in Greece, equal to one hundredth of a drachma.",
            "pos": "noun",
            "sent1": "The merchant exchanged his drachma for several minos coins.",
            "sent2": "The minos was a convenient denomination for everyday transactions.",
            "sent3": "In ancient Greece, a minos could buy a loaf of bread or a small trinket.",
            "sent4": "The minos jingled in the traveler's pouch, a reminder of his time in Greece.",
            "sent5": "The minos coin gleamed in the sunlight, a tiny piece of history in the palm of his hand."
        }
    ]
}