{
    "term": "mis",
    "meanings": [
        {
            "definition": "Badly or wrongly",
            "pos": "adverb",
            "sent1": "She misjudged the distance and fell.",
            "sent2": "He often misplaces his keys.",
            "sent3": "The mischievous cat knocked over the vase.",
            "sent4": "The misaligned wheels caused the car to shake.",
            "sent5": "The teacher explained the concept so clearly that it was impossible to misunderstand."
        },
        {
            "definition": "Incorrectly",
            "pos": "adverb",
            "sent1": "The student misread the instructions and got confused.",
            "sent2": "She typed the email address incorrectly.",
            "sent3": "The mischievous squirrel stole all the nuts from the bird feeder.",
            "sent4": "The clock tower struck twelve times, but it was miscounted by the listeners.",
            "sent5": "The detective misinterpreted the evidence and accused the wrong person."
        },
        {
            "definition": "Ill or badly",
            "pos": "adverb",
            "sent1": "He felt miserable and missed school.",
            "sent2": "She sang the song off-key and sounded terrible.",
            "sent3": "The misbehaving puppy chewed on the shoes.",
            "sent4": "The storm hit the town and caused a lot of damage.",
            "sent5": "The injured bird flew with a misshapen wing."
        },
        {
            "definition": "Hate or hatred",
            "pos": "noun",
            "sent1": "His mis for his rival was evident in his actions.",
            "sent2": "The mis between the two families had lasted for generations.",
            "sent3": "The mis in the air was palpable during the argument.",
            "sent4": "The mis in his heart consumed him with bitterness.",
            "sent5": "The mis in her eyes was unmistakable as she glared at him."
        },
        {
            "definition": "Wrong or wrongly",
            "pos": "adverb",
            "sent1": "She misinterpreted his words and got upset.",
            "sent2": "The directions given were misleadingly written.",
            "sent3": "The misbehaving child was scolded by the teacher.",
            "sent4": "The misaligned shelves made the whole bookcase unstable.",
            "sent5": "The mismanaged project resulted in chaos and confusion."
        }
    ]
}