{
    "term": "misbrand",
    "meanings": [
        {
            "definition": "To label incorrectly or deceptively.",
            "pos": "verb",
            "sent1": "The company tried to misbrand their products to make them seem healthier than they actually were.",
            "sent2": "It is illegal to misbrand food items with false information on the labels.",
            "sent3": "The chef accidentally misbranded the expiration date on the milk carton, causing confusion in the kitchen.",
            "sent4": "Her attempt to misbrand her mediocre artwork as a masterpiece fooled no one.",
            "sent5": "The consequences of a company's decision to misbrand their products can be severe."
        },
        {
            "definition": "To give a false or misleading description of a product.",
            "pos": "verb",
            "sent1": "The advertisement misbrands the new phone as the fastest on the market.",
            "sent2": "Consumers can file complaints if they believe a company is misbranding their products.",
            "sent3": "The comedian joked that the magician would misbrand a rock as a diamond to impress the audience.",
            "sent4": "The politician's attempt to misbrand his opponent's policies backfired.",
            "sent5": "The company faced a lawsuit for continuously misbranding their supplements as a cure-all."
        },
        {
            "definition": "The act of mislabeling or misrepresenting a product.",
            "pos": "noun",
            "sent1": "The misbrand of the toy led to a product recall due to safety concerns.",
            "sent2": "Customers were disappointed by the misbrand of the clothing item, as it did not match the online description.",
            "sent3": "The misbrand of the car model as 'fuel-efficient' turned out to be a marketing gimmick.",
            "sent4": "The misbrand of the software as 'user-friendly' left many users frustrated with its complexity.",
            "sent5": "The misbrand of the medication caused confusion among patients, leading to incorrect dosages."
        }
    ]
}