{
    "term": "mischarge",
    "meanings": [
        {
            "definition": "To discharge improperly or incorrectly.",
            "pos": "verb",
            "sent1": "He mischarged the batteries and they stopped working.",
            "sent2": "The cashier mischarged the customer for the groceries.",
            "sent3": "The robot mischarged the instructions and started dancing instead of cleaning.",
            "sent4": "Her mischarged emotions spilled out uncontrollably.",
            "sent5": "The chef mischarged the recipe, creating a surprisingly delicious dish."
        },
        {
            "definition": "To release or unload incorrectly.",
            "pos": "verb",
            "sent1": "The truck driver mischarged the cargo, causing it to fall off.",
            "sent2": "She mischarged the balloons, and they flew away before the party.",
            "sent3": "The magician mischarged the trick, making the rabbit disappear forever.",
            "sent4": "The mischarged words slipped out before he could stop them.",
            "sent5": "The mischarged confetti showered down on the wrong person."
        },
        {
            "definition": "To fire a weapon accidentally.",
            "pos": "verb",
            "sent1": "The soldier mischarged his gun during training.",
            "sent2": "She mischarged the rifle and startled everyone at the shooting range.",
            "sent3": "The mischarged shot hit the target, surprising even the shooter.",
            "sent4": "The mischarged bullet whizzed past harmlessly.",
            "sent5": "He mischarged the pistol, causing a loud bang in the quiet room."
        },
        {
            "definition": "To fail to fulfill a duty or responsibility.",
            "pos": "verb",
            "sent1": "He mischarged his promise to help and left his friend stranded.",
            "sent2": "The employee mischarged his task, leading to a delay in the project.",
            "sent3": "The mischarged assignment resulted in a comedy of errors.",
            "sent4": "She mischarged her role as team captain, causing chaos on the field.",
            "sent5": "The mischarged commitment left a trail of disappointed faces."
        }
    ]
}