{
    "term": "misogyny",
    "meanings": [
        {
            "definition": "Hatred or dislike of women.",
            "pos": "noun",
            "sent1": "Her speech was filled with misogyny, showing her deep hatred towards women.",
            "sent2": "The misogynist's actions clearly displayed his misogyny towards women.",
            "sent3": "The comedy skit humorously portrayed a character struggling with his irrational misogyny.",
            "sent4": "The dark cloud of misogyny loomed over the workplace, affecting the female employees.",
            "sent5": "The history books are stained with the ugly mark of misogyny, a reminder of past injustices."
        },
        {
            "definition": "Prejudice against women.",
            "pos": "noun",
            "sent1": "The unfair treatment of women in the workplace was a clear example of misogyny.",
            "sent2": "Her experiences with misogyny in society left her feeling marginalized and discriminated against.",
            "sent3": "The children's book subtly addressed the issue of misogyny through a clever storyline.",
            "sent4": "The shadow of misogyny cast a dark cloud over the progress towards gender equality.",
            "sent5": "The artist's painting depicted the destructive force of misogyny in a powerful and moving way."
        },
        {
            "definition": "Dislike or prejudice against women.",
            "pos": "noun",
            "sent1": "The comedian's jokes were laced with misogyny, making many uncomfortable.",
            "sent2": "The pervasive misogyny in the media perpetuates harmful stereotypes about women.",
            "sent3": "The sitcom humorously tackled the issue of misogyny in a light-hearted manner.",
            "sent4": "The stain of misogyny tainted the reputation of the company, leading to public outrage.",
            "sent5": "The film highlighted the destructive impact of misogyny on women's lives, sparking important conversations."
        }
    ]
}