{
    "term": "misrated",
    "meanings": [
        {
            "definition": "To incorrectly assess or evaluate the worth or value of something.",
            "pos": "verb",
            "sent1": "She misrated the movie, thinking it was boring when it was actually exciting.",
            "sent2": "The teacher misrated the student's essay, giving it a lower grade than it deserved.",
            "sent3": "He misrated the new restaurant, believing it was terrible just because of one bad dish.",
            "sent4": "The detective misrated the suspect's innocence, leading to a wrongful arrest.",
            "sent5": "The weather forecast misrated the storm's intensity, causing unexpected damage."
        },
        {
            "definition": "To give a lower or higher rating than deserved.",
            "pos": "verb",
            "sent1": "The critic misrated the book, giving it a higher score than it truly earned.",
            "sent2": "They misrated the hotel, awarding it only one star despite its excellent service.",
            "sent3": "The judge misrated the talent show performance, unfairly favoring one contestant.",
            "sent4": "The app misrated the restaurant, suggesting it was top-rated when it had poor reviews.",
            "sent5": "The customer misrated the product, believing it was overpriced when it was actually a great deal."
        },
        {
            "definition": "To judge or classify inaccurately.",
            "pos": "verb",
            "sent1": "She misrated the situation, assuming it was dangerous when it was completely safe.",
            "sent2": "The manager misrated the employee's skills, underestimating their true abilities.",
            "sent3": "He misrated the quiz difficulty, thinking it was easy until he saw the questions.",
            "sent4": "The historian misrated the artifact's age, mistakenly dating it to a different era.",
            "sent5": "The artist misrated the art piece, believing it was amateurish when it was actually profound."
        }
    ]
}