{
    "term": "missa",
    "meanings": [
        {
            "definition": "A Roman Catholic Mass",
            "pos": "noun",
            "sent1": "Every Sunday, we attend the missa at our local church.",
            "sent2": "The missa is a sacred ceremony in the Catholic faith.",
            "sent3": "During the missa, the priest accidentally dropped the chalice, causing a moment of surprise.",
            "sent4": "The missa enveloped the congregation in a sense of peace and unity.",
            "sent5": "The missa echoed through the grand cathedral, filling the air with solemnity."
        },
        {
            "definition": "A form of the Mass used in the Roman Catholic Church",
            "pos": "noun",
            "sent1": "The traditional missa includes prayers and hymns.",
            "sent2": "In the missa, the priest leads the congregation in worship.",
            "sent3": "During the missa, the choir sang with great enthusiasm.",
            "sent4": "The missa followed a specific order of rituals and readings.",
            "sent5": "Attending the missa is a way to connect with the divine."
        },
        {
            "definition": "A musical setting of the Mass",
            "pos": "noun",
            "sent1": "The choir performed a beautiful missa composed by Mozart.",
            "sent2": "The missa included intricate harmonies and melodies.",
            "sent3": "The missa was so uplifting that it brought tears to the eyes of the audience.",
            "sent4": "Listening to the missa felt like being transported to a higher realm.",
            "sent5": "The missa resonated with the listeners, stirring their souls with its beauty."
        },
        {
            "definition": "A female given name",
            "pos": "noun",
            "sent1": "Missa is a lovely name for a baby girl.",
            "sent2": "Her name, Missa, has a musical ring to it.",
            "sent3": "Missa giggled when she heard her name being called out in class.",
            "sent4": "The name Missa carries a sense of grace and elegance.",
            "sent5": "Missa's presence lit up the room with warmth and kindness."
        }
    ]
}