{
    "term": "mission",
    "meanings": [
        {
            "definition": "An important assignment carried out for political, religious, or commercial purposes.",
            "pos": "noun",
            "sent1": "The team's mission was to deliver food to those in need.",
            "sent2": "The soldiers were on a dangerous mission to rescue hostages.",
            "sent3": "The cat's mission to catch the elusive red dot ended in a playful chase.",
            "sent4": "Her mission to spread kindness was like planting seeds of goodwill.",
            "sent5": "The astronaut's mission to explore Mars captured the world's imagination."
        },
        {
            "definition": "A group of people sent on a specific task, especially one sent by a religious organization.",
            "pos": "noun",
            "sent1": "The church's mission traveled to help rebuild homes after the hurricane.",
            "sent2": "The medical mission provided free healthcare to underserved communities.",
            "sent3": "The mission of penguins waddling to find food looked like a cute parade.",
            "sent4": "Their mission to spread joy was like a band playing cheerful tunes.",
            "sent5": "The scout troop's mission to clean up the park made a positive impact on the environment."
        },
        {
            "definition": "A building or group of buildings used by a religious group for worship and other activities.",
            "pos": "noun",
            "sent1": "The mission in the village served as a place of prayer and community gatherings.",
            "sent2": "The historic mission was a beautiful example of Spanish colonial architecture.",
            "sent3": "The mission's bell tower rang out a cheerful tune every morning.",
            "sent4": "The mission's walls held stories of faith and devotion within their ancient stones.",
            "sent5": "Visiting the mission felt like stepping back in time to a peaceful era of contemplation."
        }
    ]
}