{
    "term": "mistress",
    "meanings": [
        {
            "definition": "A woman in a position of authority or control over others.",
            "pos": "noun",
            "sent1": "The teacher was the mistress of the classroom, guiding her students with care.",
            "sent2": "The queen was the mistress of the kingdom, making important decisions for her people.",
            "sent3": "The mistress of the house, Mrs. Smith, ruled over her family with kindness and wisdom.",
            "sent4": "In the play, the evil sorceress was portrayed as the mistress of dark magic.",
            "sent5": "The CEO was the mistress of the company, leading it to great success."
        },
        {
            "definition": "A woman who has a sexual relationship with a married man.",
            "pos": "noun",
            "sent1": "The scandal erupted when the mistress of the businessman revealed their affair.",
            "sent2": "The movie depicted the complicated relationship between the married man and his mistress.",
            "sent3": "In the soap opera, the mistress of the wealthy tycoon caused quite a stir in the town.",
            "sent4": "The novel's plot twist revealed the identity of the mysterious mistress of the protagonist.",
            "sent5": "The gossip magazine exposed the affair between the celebrity and his mistress."
        },
        {
            "definition": "A woman who is skilled in a particular subject or activity.",
            "pos": "noun",
            "sent1": "She was a mistress of painting, creating beautiful artworks with ease.",
            "sent2": "The chef was a mistress of culinary arts, delighting customers with her dishes.",
            "sent3": "The mistress of chess, she defeated all opponents with strategic moves.",
            "sent4": "As a mistress of music, she could play multiple instruments with grace and talent.",
            "sent5": "The scientist was a mistress of her field, conducting groundbreaking research."
        }
    ]
}