{
    "term": "misted",
    "meanings": [
        {
            "definition": "Covered with mist",
            "pos": "adjective",
            "sent1": "The mountain was misted in the early morning, creating a magical atmosphere.",
            "sent2": "The misted forest looked mysterious and enchanting.",
            "sent3": "The misted landscape made it hard to see clearly, like looking through a frosted window.",
            "sent4": "Her eyes had a misted look, as if lost in a dream.",
            "sent5": "The misted air felt cool and refreshing on my skin."
        },
        {
            "definition": "To cover with mist",
            "pos": "verb",
            "sent1": "She misted the plants to keep them hydrated.",
            "sent2": "The waterfall misted the rocks below, creating a beautiful rainbow.",
            "sent3": "He misted his face with water to cool down after the run.",
            "sent4": "The chef misted the vegetables with olive oil before roasting them.",
            "sent5": "The ocean misted the air, leaving a salty taste on our lips."
        },
        {
            "definition": "A fine spray of liquid",
            "pos": "noun",
            "sent1": "The gardener used a misted to water the delicate flowers.",
            "sent2": "The misted from the fountain felt refreshing on a hot day.",
            "sent3": "She accidentally walked into the misted from the sprinkler and got soaked.",
            "sent4": "The misted of perfume lingered in the air long after she left.",
            "sent5": "The misted of paint settled on the canvas, creating a soft effect."
        },
        {
            "definition": "To become covered with mist",
            "pos": "verb",
            "sent1": "As the sun set, the valley misted over, shrouding everything in a soft haze.",
            "sent2": "The mirror misted up after a hot shower.",
            "sent3": "The windows misted over from the warm breath of the children inside.",
            "sent4": "Her glasses misted over when she stepped into the warm house from the cold outside.",
            "sent5": "The lake misted over as the cool evening air descended."
        }
    ]
}