{
    "term": "miter",
    "meanings": [
        {
            "definition": "A joint made at a 45-degree angle for joining two pieces of wood.",
            "pos": "noun",
            "sent1": "Dad used a miter to connect the wooden pieces for the birdhouse.",
            "sent2": "The carpenter carefully crafted a miter to join the table legs.",
            "sent3": "The miter in the fence made the squirrel's escape easier.",
            "sent4": "The miter of friendship between them was unbreakable.",
            "sent5": "She marveled at the precision of the miter in the picture frame."
        },
        {
            "definition": "A headdress worn by bishops and other clergy.",
            "pos": "noun",
            "sent1": "The bishop's miter was adorned with intricate designs.",
            "sent2": "The clergyman adjusted his miter before the ceremony.",
            "sent3": "The playful kitten tried to play with the bishop's miter.",
            "sent4": "The miter on the bishop's head symbolized his authority.",
            "sent5": "The sunlight glinted off the golden threads of the miter."
        },
        {
            "definition": "To join two pieces of wood at a 45-degree angle.",
            "pos": "verb",
            "sent1": "He will miter the frame for the mirror in the bathroom.",
            "sent2": "She learned how to miter corners for the bookshelf she was building.",
            "sent3": "The magician tried to miter the wands together for his trick.",
            "sent4": "Their skills combined to miter a beautiful wooden archway.",
            "sent5": "Mitering the edges of the door made it fit perfectly into the frame."
        },
        {
            "definition": "A tool used for measuring and marking angles.",
            "pos": "noun",
            "sent1": "The carpenter reached for his trusty miter to check the angle.",
            "sent2": "She borrowed the miter from the workshop to measure the slope.",
            "sent3": "The mischievous squirrel ran off with the carpenter's miter.",
            "sent4": "The miter's accuracy helped in creating precise cuts for the project.",
            "sent5": "The miter's markings were clear and easy to read for the apprentice."
        }
    ]
}