{
    "term": "mither",
    "meanings": [
        {
            "definition": "To pester or bother someone with complaints or requests.",
            "pos": "verb",
            "sent1": "Please don't mither me about doing your chores.",
            "sent2": "She always mithers her brother to play with her.",
            "sent3": "The cat continued to mither the owner for more treats.",
            "sent4": "The rain continued to mither the farmers with its constant downpour.",
            "sent5": "The persistent mosquito would not stop mithering me all night."
        },
        {
            "definition": "A person who is constantly complaining or worrying.",
            "pos": "noun",
            "sent1": "My aunt is such a mither when it comes to family gatherings.",
            "sent2": "The old man down the street is known as the neighborhood mither.",
            "sent3": "The little mither in the office always finds something to complain about.",
            "sent4": "She felt like a mither trapped in a cycle of negativity.",
            "sent5": "The mither at the store always has something to grumble about."
        },
        {
            "definition": "To fuss or worry unnecessarily.",
            "pos": "verb",
            "sent1": "Stop mithering over every little detail; it will be fine.",
            "sent2": "She tends to mither about things that are out of her control.",
            "sent3": "The child continued to mither over which toy to pick.",
            "sent4": "The student began to mither about the upcoming test.",
            "sent5": "The bride started to mither about the weather on her wedding day."
        },
        {
            "definition": "To make a fuss or bother about something.",
            "pos": "verb",
            "sent1": "Don't mither over the spilled milk; accidents happen.",
            "sent2": "She tends to mither over every decision, big or small.",
            "sent3": "The manager began to mither about the upcoming project deadline.",
            "sent4": "The child started to mither about not getting the toy he wanted.",
            "sent5": "The customer began to mither about the service at the restaurant."
        }
    ]
}