{
    "term": "mobile",
    "meanings": [
        {
            "definition": "Capable of moving or being moved easily.",
            "pos": "adjective",
            "sent1": "The toy car is very mobile and can be pushed around effortlessly.",
            "sent2": "The robot vacuum cleaner is designed to be mobile and navigate through the house smoothly.",
            "sent3": "The mobile puppy kept running around the yard, making everyone laugh.",
            "sent4": "Her mobile fingers swiftly typed out the message on the phone.",
            "sent5": "The mobile clouds drifted across the sky, changing shapes constantly."
        },
        {
            "definition": "A decorative structure that is suspended so as to turn freely in the air.",
            "pos": "noun",
            "sent1": "The baby's crib had a colorful mobile hanging above it.",
            "sent2": "The mobile in the nursery spun gently, captivating the infant's attention.",
            "sent3": "The mobile in the park twisted and twirled in the breeze, creating a mesmerizing display.",
            "sent4": "The mobile of birds hung from the ceiling, their wings flapping gracefully.",
            "sent5": "The mobile of paper airplanes danced in the air, casting shadows on the walls."
        },
        {
            "definition": "A type of sculpture consisting of shapes cut from sheet metal or other material and designed to move when touched by air currents.",
            "pos": "noun",
            "sent1": "The artist created a beautiful mobile with metal pieces that shimmered in the sunlight.",
            "sent2": "The mobile in the art gallery swayed gently as visitors walked by.",
            "sent3": "The mobile in the garden tinkled softly as the wind played with its delicate pieces.",
            "sent4": "The mobile of fish sculptures seemed to swim in the air, creating a magical illusion.",
            "sent5": "The mobile of stars and moons rotated gracefully, casting a celestial glow in the room."
        }
    ]
}