{
    "term": "mobiles",
    "meanings": [
        {
            "definition": "Capable of moving or being moved easily.",
            "pos": "adjective",
            "sent1": "The toy cars were very mobiles, zooming around the room effortlessly.",
            "sent2": "The athlete was incredibly mobiles, able to run, jump, and dodge with agility.",
            "sent3": "The squirrel was so mobiles, it could quickly climb up and down the tree.",
            "sent4": "Her ideas were as mobiles as butterflies, flitting from one topic to another.",
            "sent5": "The wind was so mobiles, changing direction constantly and rustling the leaves."
        },
        {
            "definition": "A decorative structure hung from the ceiling and able to move freely.",
            "pos": "noun",
            "sent1": "The nursery had colorful mobiles hanging above the crib, spinning gently in the breeze.",
            "sent2": "The mobiles in the art gallery swayed gracefully, catching the light and casting shadows.",
            "sent3": "The mobiles in the classroom danced playfully whenever a student opened the door.",
            "sent4": "The mobiles in the garden twisted and turned, creating mesmerizing patterns in the air.",
            "sent5": "The mobiles in the shop window sparkled and twirled, attracting passersby with their beauty."
        },
        {
            "definition": "A type of sculpture made of shapes that move in the air.",
            "pos": "noun",
            "sent1": "The artist created a stunning mobiles with geometric shapes that spun gently in the gallery.",
            "sent2": "The mobiles in the park swirled and twirled, reflecting the sunlight in a mesmerizing display.",
            "sent3": "The mobiles at the art fair seemed to dance with joy as the wind caught their delicate forms.",
            "sent4": "The mobiles in the museum appeared to float as if defying gravity, captivating all who passed by.",
            "sent5": "The mobiles in the garden whispered secrets to the breeze, their movements telling stories of the artist's vision."
        }
    ]
}