{
    "term": "mobilizer",
    "meanings": [
        {
            "definition": "A person or thing that mobilizes.",
            "pos": "noun",
            "sent1": "The community mobilizer organized a charity event to help those in need.",
            "sent2": "The team captain was a great mobilizer, always motivating his teammates to do their best.",
            "sent3": "The superhero's secret power was to be a mobilizer, bringing people together to fight evil.",
            "sent4": "Her words acted as a mobilizer, inspiring everyone to work towards a common goal.",
            "sent5": "The mobilizer's presence at the protest energized the crowd to demand change."
        },
        {
            "definition": "A device or mechanism that facilitates movement or operation.",
            "pos": "noun",
            "sent1": "The wheelchair ramp was a helpful mobilizer for people with disabilities.",
            "sent2": "The key was the mobilizer that started the car's engine.",
            "sent3": "The robot vacuum cleaner was a quirky mobilizer, zipping around the house cleaning up messes.",
            "sent4": "The conveyor belt acted as a mobilizer, efficiently moving products along the assembly line.",
            "sent5": "The escalator was a convenient mobilizer, carrying people effortlessly between floors."
        },
        {
            "definition": "An organization or group that promotes or encourages action or change.",
            "pos": "noun",
            "sent1": "The environmental mobilizer raised awareness about recycling in the community.",
            "sent2": "The youth group was a powerful mobilizer for social justice causes.",
            "sent3": "The book club was a fun mobilizer, bringing book lovers together for lively discussions.",
            "sent4": "The charity organization served as a mobilizer, uniting volunteers to help those in need.",
            "sent5": "The music festival was a vibrant mobilizer, inspiring attendees to support local artists."
        }
    ]
}