{
    "term": "moble",
    "meanings": [
        {
            "definition": "Capable of being moved or easily moved.",
            "pos": "adjective",
            "sent1": "The small toy car was very moble, able to glide effortlessly across the floor.",
            "sent2": "The lightweight suitcase was designed to be moble for travelers on the go.",
            "sent3": "The moble puppy kept running around the house, making it hard to catch.",
            "sent4": "Her ideas were so moble, constantly changing and evolving with each new inspiration.",
            "sent5": "The dancer's movements were incredibly moble, flowing gracefully from one pose to another."
        },
        {
            "definition": "A piece of furniture that can be easily moved.",
            "pos": "noun",
            "sent1": "The office had a moble with wheels, making it convenient to rearrange the room.",
            "sent2": "She bought a new moble for her living room, allowing her to change the layout whenever she wanted.",
            "sent3": "The moble in the bedroom seemed to have a mind of its own, sliding across the floor when no one was looking.",
            "sent4": "His ideas were like a moble, shifting and adapting to different situations effortlessly.",
            "sent5": "The antique moble in the corner of the room added a touch of elegance to the space."
        },
        {
            "definition": "A mobile phone or device.",
            "pos": "noun",
            "sent1": "She always carries her moble with her, never wanting to miss an important call.",
            "sent2": "The latest moble on the market has a high-resolution screen and advanced features.",
            "sent3": "The moble rang loudly during the meeting, causing everyone to turn and look.",
            "sent4": "His mind was like a constantly buzzing moble, filled with notifications and alerts.",
            "sent5": "The moble allowed him to stay connected to his friends and family no matter where he traveled."
        }
    ]
}