{
    "term": "mockup",
    "meanings": [
        {
            "definition": "A model or replica of a machine or structure for instructional or experimental purposes.",
            "pos": "noun",
            "sent1": "The students built a mockup of a volcano for their science project.",
            "sent2": "The engineers created a mockup of the new bridge design to test its stability.",
            "sent3": "The mockup of the robot made everyone laugh with its oversized head.",
            "sent4": "Her mockup of the solar system was so detailed, it looked like the real thing.",
            "sent5": "The mockup of the car was so accurate that it fooled many people at first glance."
        },
        {
            "definition": "A full-sized model of a design or device used for testing or demonstration.",
            "pos": "noun",
            "sent1": "The company built a mockup of the new phone to showcase its features.",
            "sent2": "The mockup of the airplane interior allowed passengers to see the layout before boarding.",
            "sent3": "The mockup of the house was so big that it barely fit through the door.",
            "sent4": "His mockup of the roller coaster was so realistic, it felt like you were actually riding it.",
            "sent5": "The mockup of the boat was so detailed that it even had tiny oars and life jackets."
        },
        {
            "definition": "A preliminary version of a product or design used for visualization or feedback.",
            "pos": "noun",
            "sent1": "The designer presented a mockup of the website layout to the client.",
            "sent2": "The mockup of the packaging helped the team decide on the final design.",
            "sent3": "The mockup of the dress made the mannequin look like a fashion model.",
            "sent4": "His mockup of the app interface was like a blueprint for the developers.",
            "sent5": "The mockup of the logo was so eye-catching that it immediately caught everyone's attention."
        }
    ]
}