{
    "term": "modally",
    "meanings": [
        {
            "definition": "In a manner relating to mode or form",
            "pos": "adverb",
            "sent1": "She dressed modally for the occasion, wearing a sleek black dress.",
            "sent2": "The artist modally arranged the furniture in the room to create a harmonious atmosphere.",
            "sent3": "The cake was modally decorated with colorful sprinkles, making it look like a work of art.",
            "sent4": "The garden was modally landscaped, with carefully trimmed hedges and neatly arranged flower beds.",
            "sent5": "The house was modally designed, with clean lines and a minimalist aesthetic."
        },
        {
            "definition": "In a manner relating to a musical mode",
            "pos": "adverb",
            "sent1": "The musician played modally, capturing the essence of the traditional folk song.",
            "sent2": "The band modally performed the jazz piece, improvising with skill and creativity.",
            "sent3": "The melody drifted modally through the air, enchanting all who heard it.",
            "sent4": "The song was modally sung, evoking a sense of nostalgia and longing.",
            "sent5": "The music flowed modally, transporting the listeners to a different time and place."
        },
        {
            "definition": "In a manner relating to a statistical mode",
            "pos": "adverb",
            "sent1": "The data was modally distributed, with one clear peak in the frequency chart.",
            "sent2": "The survey results were modally clustered around a specific response, indicating a common trend.",
            "sent3": "The test scores were modally grouped in the middle range, showing a typical performance level.",
            "sent4": "The population was modally distributed by age, with the highest number of individuals in the middle age group.",
            "sent5": "The values were modally concentrated in a narrow range, highlighting a central tendency in the data."
        }
    ]
}