{
    "term": "modernist",
    "meanings": [
        {
            "definition": "A person who follows or practices modernism.",
            "pos": "noun",
            "sent1": "The young artist was a modernist, always experimenting with new techniques.",
            "sent2": "She admired the modernist painters for their bold and innovative approach.",
            "sent3": "The modernist walked into a museum and tried to paint on the walls, thinking it was part of the exhibit.",
            "sent4": "In a world of traditionalists, he stood out like a modernist masterpiece.",
            "sent5": "The modernist's studio was filled with vibrant colors and abstract shapes, reflecting his avant-garde style."
        },
        {
            "definition": "Relating to or characteristic of modernism.",
            "pos": "adjective",
            "sent1": "Her modernist approach to architecture incorporated sleek lines and minimalistic design.",
            "sent2": "The furniture in the room had a modernist look, with clean angles and neutral colors.",
            "sent3": "The modernist cat refused to sleep in a regular bed, preferring a futuristic pod instead.",
            "sent4": "His mind was a modernist landscape, constantly evolving and pushing boundaries.",
            "sent5": "The modernist building stood out in the cityscape, with its innovative design and use of materials."
        },
        {
            "definition": "A style or movement in art, literature, or music that breaks with traditional forms and values.",
            "pos": "noun",
            "sent1": "The modernist movement in literature challenged conventional storytelling techniques.",
            "sent2": "She was drawn to the modernist art scene for its rebellious spirit and creativity.",
            "sent3": "The modernist party featured avant-garde music and unconventional dance performances.",
            "sent4": "His poetry was a modernist symphony of words, breaking free from rhyme and meter.",
            "sent5": "The modernist novel shook the literary world with its unconventional structure and bold themes."
        }
    ]
}