{
    "term": "modest",
    "meanings": [
        {
            "definition": "Having or showing a moderate or humble estimate of one's merits, importance, etc.; free from vanity, egotism, boastfulness, or great pretensions.",
            "pos": "adjective",
            "sent1": "She wore a modest dress to the party, not wanting to draw too much attention.",
            "sent2": "The modest house on the corner had a small garden in front.",
            "sent3": "His modest request for a second piece of cake was met with laughter from the guests.",
            "sent4": "The modest sun peeked through the clouds, casting a gentle glow over the meadow.",
            "sent5": "In the modest light of dawn, the city slowly woke up to a new day."
        },
        {
            "definition": "Limited or moderate in amount, extent, etc.",
            "pos": "adjective",
            "sent1": "She had a modest collection of stamps from different countries.",
            "sent2": "The restaurant offered a modest selection of desserts on their menu.",
            "sent3": "His modest savings allowed him to take a short vacation to the beach.",
            "sent4": "The modest rainfall was just enough to water the plants in the garden.",
            "sent5": "The modest crowd gathered in the park for the outdoor concert."
        },
        {
            "definition": "Not extreme in conduct, opinion, amount, etc.",
            "pos": "adjective",
            "sent1": "Her modest reaction to the news surprised everyone in the room.",
            "sent2": "The team celebrated their victory in a modest manner, without any grand gestures.",
            "sent3": "His modest score on the test was still higher than the class average.",
            "sent4": "The modest increase in temperature made the day more comfortable for outdoor activities.",
            "sent5": "The modest applause at the end of the performance reflected the audience's appreciation."
        }
    ]
}