{
    "term": "modulus",
    "meanings": [
        {
            "definition": "A quantity or coefficient expressing the measure of some property or quality.",
            "pos": "noun",
            "sent1": "The modulus of the temperature indicates how hot or cold it is.",
            "sent2": "She measured the modulus of the fabric to determine its strength.",
            "sent3": "The modulus of his excitement was off the charts when he saw the surprise party.",
            "sent4": "Her kindness had a modulus that radiated warmth to everyone around her.",
            "sent5": "The modulus of his determination was unwavering, propelling him towards his goals."
        },
        {
            "definition": "A number by which two given numbers can be divided to yield the same remainder.",
            "pos": "noun",
            "sent1": "The modulus of 5 and 3 is 2 because they leave the same remainder when divided.",
            "sent2": "In modular arithmetic, the modulus is crucial for finding patterns in remainders.",
            "sent3": "The modulus of their friendship was evident as they always had each other's backs.",
            "sent4": "The modulus acted as a bridge between the two numbers, connecting them through their remainders.",
            "sent5": "Using the modulus helped simplify the division process and find common factors."
        },
        {
            "definition": "The absolute value of a complex number.",
            "pos": "noun",
            "sent1": "Calculating the modulus of a complex number involves finding its distance from the origin.",
            "sent2": "The modulus of the complex number 3 + 4i is 5, representing its magnitude.",
            "sent3": "The modulus of the imaginary part added an interesting twist to the mathematical equation.",
            "sent4": "Her love for mathematics had a modulus that extended beyond real numbers into the complex realm.",
            "sent5": "The modulus of the complex number was like a compass pointing towards its magnitude and direction."
        }
    ]
}