{
    "term": "moguled",
    "meanings": [
        {
            "definition": "Covered in or consisting of moguls.",
            "pos": "adjective",
            "sent1": "The moguled terrain made skiing challenging.",
            "sent2": "The mountain had a moguled surface that was difficult to navigate.",
            "sent3": "The moguled landscape looked like a bumpy carpet.",
            "sent4": "Her face was moguled with freckles, like stars in the night sky.",
            "sent5": "The moguled field resembled a quilt of hills and valleys."
        },
        {
            "definition": "Having or resembling moguls.",
            "pos": "adjective",
            "sent1": "The moguled path was uneven and rocky.",
            "sent2": "His moguled jacket made him look like a famous skier.",
            "sent3": "The moguled cake had bumps of frosting all over.",
            "sent4": "Her moguled hair was styled in waves and curls.",
            "sent5": "The moguled clouds in the sky looked like giant cotton balls."
        },
        {
            "definition": "To create moguls on (a ski slope).",
            "pos": "verb",
            "sent1": "The ski resort moguled the slope for advanced skiers.",
            "sent2": "They moguled the hill to add excitement to the run.",
            "sent3": "The ski team moguled the slope to prepare for the competition.",
            "sent4": "The workers moguled the snow to create a challenging course.",
            "sent5": "The crew moguled the slope overnight for the upcoming event."
        },
        {
            "definition": "To travel over moguls.",
            "pos": "verb",
            "sent1": "The skier moguled down the steep slope with skill.",
            "sent2": "She moguled through the bumps on the trail effortlessly.",
            "sent3": "The athlete moguled over the uneven terrain like a pro.",
            "sent4": "He moguled his way down the mountain, enjoying the challenge.",
            "sent5": "They moguled across the moguls, feeling the thrill of the ride."
        }
    ]
}