{
    "term": "mojos",
    "meanings": [
        {
            "definition": "A magic charm or spell.",
            "pos": "noun",
            "sent1": "She believed in the power of mojos to protect her from harm.",
            "sent2": "The wizard cast a spell using ancient mojos.",
            "sent3": "The mojos worked like a charm, making her smile.",
            "sent4": "His mojos were so strong, they could bend reality itself.",
            "sent5": "The mojos glowed with an otherworldly light, enchanting all who saw them."
        },
        {
            "definition": "Personal magnetism or charm.",
            "pos": "noun",
            "sent1": "Her mojos drew people to her like a magnet.",
            "sent2": "He had a natural charm and mojos that captivated everyone.",
            "sent3": "His mojos were so strong, even the grumpiest person couldn't resist.",
            "sent4": "She exuded mojos that lit up the room wherever she went.",
            "sent5": "The mojos in his smile were infectious, spreading joy to all around him."
        },
        {
            "definition": "A sauce or marinade used in Latin American cuisine.",
            "pos": "noun",
            "sent1": "The chef prepared a delicious dish with his secret mojos.",
            "sent2": "The mojos added a burst of flavor to the traditional recipe.",
            "sent3": "She accidentally spilled the mojos all over the kitchen, creating a saucy mess.",
            "sent4": "The mojos infused the dish with a spicy kick that left everyone wanting more.",
            "sent5": "The aroma of the mojos filled the kitchen, making everyone's mouth water."
        },
        {
            "definition": "A feeling of confidence or enthusiasm.",
            "pos": "noun",
            "sent1": "She faced the challenge with renewed mojos, ready to conquer it.",
            "sent2": "His mojos lifted his spirits and gave him the courage to speak up.",
            "sent3": "The team's mojos were at an all-time high after their recent success.",
            "sent4": "Her mojos fueled her determination to achieve her goals.",
            "sent5": "The mojos in the air buzzed with excitement, filling everyone with energy."
        }
    ]
}