{
    "term": "monkeying",
    "meanings": [
        {
            "definition": "To play or tamper with something in a careless or mischievous way.",
            "pos": "verb",
            "sent1": "The children were monkeying with the remote control, causing it to malfunction.",
            "sent2": "Stop monkeying with the buttons on the computer; you might break it.",
            "sent3": "She was caught monkeying with the settings on her friend's phone as a prank.",
            "sent4": "The curious cat was monkeying with the dangling cords, trying to unravel them.",
            "sent5": "The mischievous squirrel was monkeying with the bird feeder, causing seeds to scatter everywhere."
        },
        {
            "definition": "To behave in a silly or playful manner.",
            "pos": "verb",
            "sent1": "The clown was monkeying around, making everyone laugh with his antics.",
            "sent2": "During recess, the kids enjoy monkeying around on the playground equipment.",
            "sent3": "The siblings were monkeying around, pretending to be superheroes saving the day.",
            "sent4": "The comedian loves monkeying around on stage, entertaining the audience with jokes.",
            "sent5": "The puppies were monkeying around in the yard, chasing each other in circles."
        },
        {
            "definition": "To meddle or interfere with something.",
            "pos": "verb",
            "sent1": "He was caught monkeying with the experiment, changing variables without permission.",
            "sent2": "She always ends up monkeying with the TV settings, causing confusion for others.",
            "sent3": "The curious toddler was monkeying with the puzzle pieces, trying to fit them together.",
            "sent4": "The spy was monkeying with the security system, trying to gain unauthorized access.",
            "sent5": "The students were monkeying with the classroom decorations, rearranging them for fun."
        }
    ]
}