{
    "term": "monomaniacal",
    "meanings": [
        {
            "definition": "Possessed by a single idea or obsession.",
            "pos": "adjective",
            "sent1": "Her monomaniacal focus on winning the game made her practice tirelessly.",
            "sent2": "The detective's monomaniacal pursuit of the criminal led to his capture.",
            "sent3": "His monomaniacal love for pizza was evident by the stacks of pizza boxes in his room.",
            "sent4": "The artist's monomaniacal dedication to perfection transformed his work into a masterpiece.",
            "sent5": "The monomaniacal scientist spent years researching a single theory, never wavering in his belief."
        },
        {
            "definition": "Characterized by an excessive focus on one particular thing.",
            "pos": "adjective",
            "sent1": "The monomaniacal student only cared about getting the highest grades in class.",
            "sent2": "Her monomaniacal attention to detail ensured that every project she worked on was flawless.",
            "sent3": "The monomaniacal gardener spent hours tending to his prized rose garden.",
            "sent4": "The monomaniacal chef obsessed over creating the perfect dish, experimenting with flavors endlessly.",
            "sent5": "His monomaniacal dedication to his craft made him a master in his field."
        },
        {
            "definition": "Showing an extreme preoccupation with a single subject.",
            "pos": "adjective",
            "sent1": "The monomaniacal fan knew every detail about his favorite band, from their first album to their latest tour.",
            "sent2": "Her monomaniacal interest in astronomy led her to spend nights stargazing and studying the cosmos.",
            "sent3": "The monomaniacal bookworm could spend hours lost in a single novel, oblivious to the world around him.",
            "sent4": "The monomaniacal athlete focused solely on improving his performance, training rigorously every day.",
            "sent5": "His monomaniacal dedication to his research project impressed his professors and peers alike."
        }
    ]
}