{
    "term": "monochromator",
    "meanings": [
        {
            "definition": "A device that transmits light of a single wavelength.",
            "pos": "noun",
            "sent1": "The scientist used a monochromator to study the specific color of light.",
            "sent2": "The monochromator helped filter out all but the red light for the experiment.",
            "sent3": "The monochromator decided to only let the green light pass through, ignoring the rest.",
            "sent4": "Her focus was like a monochromator, honing in on the exact wavelength she needed.",
            "sent5": "The monochromator acted like a gatekeeper, allowing only the chosen light to enter."
        },
        {
            "definition": "A device that separates light into its component wavelengths.",
            "pos": "noun",
            "sent1": "The monochromator split the light into its different colors for analysis.",
            "sent2": "Researchers used the monochromator to break down the light spectrum into individual wavelengths.",
            "sent3": "The monochromator played the role of a prism, revealing the hidden colors within the light.",
            "sent4": "His mind worked like a monochromator, dissecting each aspect of the problem into its components.",
            "sent5": "The monochromator functioned as a rainbow maker, showcasing the full spectrum of light."
        },
        {
            "definition": "A device used in spectroscopy to isolate a narrow band of wavelengths.",
            "pos": "noun",
            "sent1": "The monochromator helped in pinpointing the exact range of wavelengths needed for the analysis.",
            "sent2": "In the lab, the monochromator was crucial for selecting the specific wavelengths to study.",
            "sent3": "The monochromator decided to focus only on a tiny slice of the light spectrum.",
            "sent4": "Her precision was like that of a monochromator, capturing only the narrow wavelengths required.",
            "sent5": "The monochromator acted as a filter, screening out all but the desired narrow band of light."
        }
    ]
}