{
    "term": "monochord",
    "meanings": [
        {
            "definition": "A musical instrument consisting of a single string stretched over a sound box.",
            "pos": "noun",
            "sent1": "The musician plucked the monochord gently, producing a soft sound.",
            "sent2": "She learned to play the monochord by following simple instructions.",
            "sent3": "The monochord string broke, causing a comical twang during the performance.",
            "sent4": "His voice resonated like a monochord, striking a deep chord within the audience.",
            "sent5": "The monochord's melody echoed through the room, captivating everyone.",
            "sent6": "With a single string, the monochord created beautiful music.",
            "sent7": "The monochord's sound filled the room with harmony.",
            "sent8": "During the concert, the monochord's notes blended seamlessly with the orchestra.",
            "sent9": "The monochord's simplicity belied its ability to produce complex melodies.",
            "sent10": "As she played the monochord, its resonance enveloped the listeners."
        },
        {
            "definition": "A mathematical and musical instrument used to demonstrate the relationship between musical intervals.",
            "pos": "noun",
            "sent1": "The monochord helped students visualize the connection between musical notes.",
            "sent2": "Using the monochord, he explained the concept of musical intervals clearly.",
            "sent3": "In the classroom, the monochord became the center of a fun math and music lesson.",
            "sent4": "The monochord served as a bridge between theory and practice in music education.",
            "sent5": "Through the monochord, the students grasped the harmony between different notes.",
            "sent6": "With the monochord, the teacher illustrated the harmony between musical tones.",
            "sent7": "The monochord's simplicity made it a valuable tool for understanding musical relationships.",
            "sent8": "During the experiment, the monochord revealed the mathematical precision behind music.",
            "sent9": "The monochord's design allowed for easy exploration of musical intervals.",
            "sent10": "As they studied the monochord, the students unlocked the secrets of musical harmony."
        }
    ]
}