{
    "term": "monohybrids",
    "meanings": [
        {
            "definition": "A monohybrid is an organism that is heterozygous with respect to a single gene of interest.",
            "pos": "noun",
            "sent1": "In the science experiment, we studied monohybrids to understand how traits are inherited.",
            "sent2": "Farmers breed monohybrids to create plants with specific characteristics.",
            "sent3": "The monohybrids at the genetic conference were the talk of the town.",
            "sent4": "Her garden was a field of monohybrids, each one unique and special.",
            "sent5": "The concept of monohybrids stuck in my mind like a catchy tune."
        },
        {
            "definition": "Monohybrids are the result of a cross between two individuals with different alleles for a single gene.",
            "pos": "noun",
            "sent1": "The offspring of the mating pair were monohybrids with a mix of traits.",
            "sent2": "Geneticists study monohybrids to understand how genetic traits are passed down.",
            "sent3": "The monohybrids in the lab were quite the genetic puzzle.",
            "sent4": "The field of monohybrids bloomed with diversity and potential.",
            "sent5": "The monohybrids in the experiment were like a genetic treasure trove waiting to be explored."
        },
        {
            "definition": "Monohybrids exhibit a single trait that is determined by a single gene.",
            "pos": "noun",
            "sent1": "The monohybrids in the study all displayed the same physical characteristic.",
            "sent2": "Scientists use monohybrids to study the effects of specific genes on traits.",
            "sent3": "The monohybrids in the genetics lab were quite the sight to see.",
            "sent4": "The field of monohybrids was a canvas of genetic art waiting to be discovered.",
            "sent5": "The concept of monohybrids was as clear as day after the biology lesson."
        }
    ]
}