{
    "term": "monogyny",
    "meanings": [
        {
            "definition": "The practice or condition of having only one wife at a time.",
            "pos": "noun",
            "sent1": "In some cultures, monogyny is the norm, with a man having only one wife.",
            "sent2": "Monogyny is when a person is committed to one spouse throughout their life.",
            "sent3": "John joked that his monogyny made him an expert in remembering anniversaries.",
            "sent4": "The concept of monogyny can be compared to a solitary tree standing tall amidst a vast forest.",
            "sent5": "The simplicity of monogyny ensures a deep and lasting connection between partners."
        },
        {
            "definition": "The state of being monogynous.",
            "pos": "noun",
            "sent1": "Monogyny reflects a strong bond between partners who choose to be exclusive.",
            "sent2": "The monogyny of the couple was evident in their unwavering commitment to each other.",
            "sent3": "The monogyny of the penguins in the documentary was both heartwarming and fascinating.",
            "sent4": "The monogyny of the swans symbolized loyalty and devotion in the animal kingdom.",
            "sent5": "The purity of their monogyny shone brightly in a world of fleeting relationships."
        },
        {
            "definition": "The custom of marrying only once in a lifetime.",
            "pos": "noun",
            "sent1": "For some, monogyny means finding a lifelong partner and sticking with them.",
            "sent2": "Monogyny is a tradition that values commitment and fidelity above all.",
            "sent3": "The village celebrated the couple's monogyny with a grand feast and dance.",
            "sent4": "In a world of multiple marriages, their monogyny was a rare and precious gem.",
            "sent5": "The concept of monogyny echoes through generations, honoring the bond of marriage."
        }
    ]
}