{
    "term": "montmorillonites",
    "meanings": [
        {
            "definition": "A type of clay mineral known for its swelling properties.",
            "pos": "noun",
            "sent1": "Montmorillonites can absorb water and expand.",
            "sent2": "The geologist studied the montmorillonites found in the soil.",
            "sent3": "The montmorillonites at the construction site seemed to grow bigger after the rain.",
            "sent4": "Her curiosity was like montmorillonites, always expanding to learn more.",
            "sent5": "The artist molded the clay as easily as shaping montmorillonites."
        },
        {
            "definition": "A group of minerals belonging to the smectite group.",
            "pos": "noun",
            "sent1": "Miners discovered a new vein of montmorillonites in the quarry.",
            "sent2": "The scientist classified the minerals into montmorillonites and non-montmorillonites.",
            "sent3": "The montmorillonites in the rock formation stood out like a colorful group of friends.",
            "sent4": "The unity among the team was as strong as the bond between different montmorillonites.",
            "sent5": "The collection of montmorillonites sparkled in the sunlight, each unique in its own way."
        },
        {
            "definition": "A natural clay material used in various industrial applications.",
            "pos": "noun",
            "sent1": "The factory workers molded the montmorillonites into different shapes for production.",
            "sent2": "Montmorillonites are essential in creating ceramics and drilling muds.",
            "sent3": "The montmorillonites in the workshop seemed to have a mind of their own, shaping themselves into useful tools.",
            "sent4": "The versatility of montmorillonites in industry is like having a Swiss Army knife for materials.",
            "sent5": "The company relied on montmorillonites for their strength and adaptability in manufacturing processes."
        }
    ]
}