{
    "term": "monte",
    "meanings": [
        {
            "definition": "A gambling card game",
            "pos": "noun",
            "sent1": "During the family game night, we played monte with a deck of cards.",
            "sent2": "The group of friends gathered around the table to enjoy a game of monte.",
            "sent3": "In the casino, the dealer accidentally shuffled the monte cards into the wrong order.",
            "sent4": "Her luck seemed to change as if she held all the aces in a game of monte.",
            "sent5": "The excitement in the room was palpable as the final round of monte began."
        },
        {
            "definition": "A mountain or hill",
            "pos": "noun",
            "sent1": "The family decided to go hiking up the monte for a picnic at the top.",
            "sent2": "The monte was covered in a blanket of snow, creating a picturesque scene.",
            "sent3": "The children rolled down the grassy slopes of the monte, laughing joyfully.",
            "sent4": "The sun setting behind the monte painted the sky in shades of pink and orange.",
            "sent5": "From the peak of the monte, the entire valley could be seen stretching out below."
        },
        {
            "definition": "A Spanish or Latin American dance",
            "pos": "noun",
            "sent1": "The dancers moved gracefully across the dance floor, performing the monte.",
            "sent2": "The lively music filled the room as couples twirled in the monte.",
            "sent3": "She practiced the monte steps in front of the mirror, trying to perfect her technique.",
            "sent4": "The monte was a crowd favorite at the cultural festival, captivating the audience.",
            "sent5": "The rhythmic beats of the monte echoed through the streets during the celebration."
        },
        {
            "definition": "A type of stew or soup in Spanish cuisine",
            "pos": "noun",
            "sent1": "The aroma of the monte filled the kitchen, making everyone hungry.",
            "sent2": "The chef prepared a delicious monte using fresh vegetables and herbs.",
            "sent3": "As the monte simmered on the stove, its flavors melded together beautifully.",
            "sent4": "The warmth of the monte was comforting on a cold winter evening.",
            "sent5": "The secret ingredient in her famous monte was a pinch of saffron for added flavor."
        }
    ]
}