{
    "term": "monteiths",
    "meanings": [
        {
            "definition": "A large bowl used for cooling wine glasses.",
            "pos": "noun",
            "sent1": "The elegant monteiths were filled with ice to keep the wine glasses cool.",
            "sent2": "At the party, the host brought out the monteiths to chill the wine glasses.",
            "sent3": "The mischievous cat decided the monteiths were perfect for a nap instead of cooling glasses.",
            "sent4": "The monteiths stood like icy sentinels guarding the wine glasses.",
            "sent5": "The shimmering silver monteiths sparkled under the lights, inviting guests to enjoy a chilled drink."
        },
        {
            "definition": "A type of dessert made with fruit and cream.",
            "pos": "noun",
            "sent1": "The sweet monteiths were a hit at the party, with their creamy texture and fruity flavors.",
            "sent2": "After dinner, everyone enjoyed a serving of the delicious monteiths for dessert.",
            "sent3": "The mischievous child tried to sneak an extra portion of monteiths before dinner was over.",
            "sent4": "The monteiths were a heavenly blend of fruit and cream, like a dream in a bowl.",
            "sent5": "The colorful monteiths looked like a painting, tempting everyone to take a bite and savor the flavors."
        },
        {
            "definition": "A Scottish surname.",
            "pos": "noun",
            "sent1": "The monteiths family had a long history in the Scottish highlands.",
            "sent2": "When traveling in Scotland, you might come across someone with the surname Monteiths.",
            "sent3": "The mischievous Monteiths clan was known for their love of pranks and jokes.",
            "sent4": "The Monteiths surname carried with it a sense of pride and tradition.",
            "sent5": "In the old castle, the Monteiths crest was proudly displayed, symbolizing the family's heritage."
        }
    ]
}