{
    "term": "mooch",
    "meanings": [
        {
            "definition": "To ask for or obtain something without paying for it",
            "pos": "verb",
            "sent1": "She would often mooch snacks from her friends during lunchtime.",
            "sent2": "He decided to mooch some pencils from his classmates instead of buying his own.",
            "sent3": "The cat would mooch around the kitchen, hoping for a stray treat to fall.",
            "sent4": "The squirrel managed to mooch some nuts from the bird feeder without getting caught.",
            "sent5": "The student tried to mooch answers during the exam, but the teacher noticed and stopped it."
        },
        {
            "definition": "To wander around aimlessly",
            "pos": "verb",
            "sent1": "After finishing his homework, he liked to mooch around the neighborhood before dinner.",
            "sent2": "The lost puppy continued to mooch in circles, unsure of where to go.",
            "sent3": "The tourists decided to mooch through the city streets, taking in the sights.",
            "sent4": "The clouds seemed to mooch across the sky, moving slowly with no clear direction.",
            "sent5": "As the day ended, she would often mooch by the river, enjoying the peaceful view."
        },
        {
            "definition": "A person who frequently asks for or obtains things without paying for them",
            "pos": "noun",
            "sent1": "He was known as the office mooch, always borrowing supplies from others.",
            "sent2": "The family considered him the neighborhood mooch because he never brought anything to gatherings.",
            "sent3": "At the party, the mooch quickly made friends by asking for everyone's favorite snacks.",
            "sent4": "The little brother was the household mooch, constantly asking for his siblings' toys.",
            "sent5": "In every group, there is usually one designated mooch who relies on others for everything."
        }
    ]
}