{
    "term": "moonlights",
    "meanings": [
        {
            "definition": "Works at a job in addition to one's regular employment.",
            "pos": "noun",
            "sent1": "She juggles two jobs, her main one during the day and her moonlights at night.",
            "sent2": "The accountant's moonlights as a freelance writer keep her busy after hours.",
            "sent3": "His moonlights as a pizza delivery guy add some excitement to his routine.",
            "sent4": "The artist's moonlights in photography illuminate his creative side.",
            "sent5": "The nurse's moonlights at the hospital make her schedule hectic but fulfilling."
        },
        {
            "definition": "Engages in a second job or occupation, especially at night.",
            "pos": "verb",
            "sent1": "He moonlights as a bartender on weekends to earn extra money.",
            "sent2": "She moonlights as a tutor to help students with their studies outside of her regular job.",
            "sent3": "The actor moonlights as a voice-over artist for fun and extra income.",
            "sent4": "The musician moonlights in a band to explore different genres of music.",
            "sent5": "The teacher moonlights as a tour guide during school breaks for a change of pace."
        },
        {
            "definition": "Shines as a secondary source of light, typically at night.",
            "pos": "noun",
            "sent1": "The moonlights filtering through the window created a soft glow in the room.",
            "sent2": "The garden was bathed in moonlights, casting shadows of the trees on the ground.",
            "sent3": "The party decorations included fairy lights that mimicked moonlights for a magical touch.",
            "sent4": "The city skyline sparkled under the moonlights, creating a picturesque scene.",
            "sent5": "The lake shimmered under the moonlights, reflecting the beauty of the night sky."
        }
    ]
}