{
    "term": "mopsy",
    "meanings": [
        {
            "definition": "Covered in a thick, tangled mess of hair or fur.",
            "pos": "adjective",
            "sent1": "The stray dog had a mopsy coat that was full of knots.",
            "sent2": "The old teddy bear had a mopsy appearance with its shaggy fur.",
            "sent3": "Despite his efforts, the boy's attempt to brush the cat's mopsy fur only made it worse.",
            "sent4": "The overgrown garden looked like a mopsy jungle, wild and untamed.",
            "sent5": "The mopsy rug in the hallway was so tangled that it tripped everyone who walked on it."
        },
        {
            "definition": "A person or animal with a disheveled appearance.",
            "pos": "noun",
            "sent1": "The homeless man had the look of a mopsy with his unkempt hair and dirty clothes.",
            "sent2": "The rescue dog arrived at the shelter looking like a mopsy, in need of grooming.",
            "sent3": "The comedian's character on stage was a lovable mopsy, always getting into funny mishaps.",
            "sent4": "The forest after a storm was a mopsy of fallen branches and tangled undergrowth.",
            "sent5": "The toddler emerged from the playroom looking like a mopsy after playing with paint and glitter."
        },
        {
            "definition": "To clean or tidy up in a haphazard or careless manner.",
            "pos": "verb",
            "sent1": "She quickly mopsied the room before the guests arrived, throwing things into drawers.",
            "sent2": "The kids were supposed to mopsy their toys, but instead, they just shoved them under the bed.",
            "sent3": "He tried to mopsy the garage, but ended up mixing up all the tools in the process.",
            "sent4": "The wind seemed to mopsy the leaves around the yard, scattering them in all directions.",
            "sent5": "She decided to mopsy the closet, but in the end, everything was even more disorganized than before."
        }
    ]
}