{
    "term": "moralities",
    "meanings": [
        {
            "definition": "Principles concerning the distinction between right and wrong or good and bad behavior.",
            "pos": "noun",
            "sent1": "Teaching children about moralities helps them understand what is right and wrong.",
            "sent2": "She always tries to follow her moralities and do what she believes is right.",
            "sent3": "The movie characters faced a dilemma when their moralities were put to the test.",
            "sent4": "In the story, the villain's lack of moralities led to his downfall.",
            "sent5": "The moralities of the ancient civilization were passed down through generations."
        },
        {
            "definition": "The quality of being in accord with standards of right behavior.",
            "pos": "noun",
            "sent1": "His actions displayed a high level of moralities in his community.",
            "sent2": "The leader's moralities set a positive example for everyone to follow.",
            "sent3": "The cat's moralities were questioned when it stole food from the table.",
            "sent4": "The painting captured the essence of moralities through its vibrant colors.",
            "sent5": "She admired the artist's ability to convey moralities through their work."
        },
        {
            "definition": "A particular system of values and principles of conduct.",
            "pos": "noun",
            "sent1": "Different cultures may have varying moralities that shape their societies.",
            "sent2": "The company's moralities guide its employees in making ethical decisions.",
            "sent3": "The robot's malfunction caused it to act against its programmed moralities.",
            "sent4": "The moralities of the organization were reflected in its mission statement.",
            "sent5": "She found comfort in the shared moralities of her close-knit group of friends."
        }
    ]
}