{
    "term": "mortar",
    "meanings": [
        {
            "definition": "A mixture of sand, water, and cement used for building and repairing walls.",
            "pos": "noun",
            "sent1": "The workers mixed mortar to fix the cracked wall.",
            "sent2": "The mason carefully applied the mortar between the bricks.",
            "sent3": "The playful kitten jumped into the pile of fresh mortar and left tiny paw prints everywhere.",
            "sent4": "Her words acted as mortar, holding their friendship together through tough times.",
            "sent5": "The smell of freshly made mortar filled the air, signaling progress on the construction site."
        },
        {
            "definition": "A bowl-shaped vessel used for grinding substances into a fine powder.",
            "pos": "noun",
            "sent1": "She used a mortar to crush the herbs into a fragrant powder.",
            "sent2": "The pharmacist carefully ground the ingredients in the mortar to make medicine.",
            "sent3": "The chef accidentally dropped the mortar, causing a cloud of flour to cover the kitchen.",
            "sent4": "The mortar in her hands transformed the solid spices into a flavorful dust.",
            "sent5": "The ancient mortar held the history of countless healing remedies within its worn surface."
        },
        {
            "definition": "To attack or bombard with mortar fire.",
            "pos": "verb",
            "sent1": "The soldiers decided to mortar the enemy's position from a safe distance.",
            "sent2": "The artillery unit prepared to mortar the enemy's stronghold.",
            "sent3": "In the paintball game, they jokingly decided to mortar their opponents with colorful pellets.",
            "sent4": "His words seemed to mortar her heart, leaving it shattered and wounded.",
            "sent5": "The storm seemed to mortar the coastline with relentless waves, eroding the cliffs over time."
        }
    ]
}