{
    "term": "mortifiers",
    "meanings": [
        {
            "definition": "A person or thing that causes embarrassment or shame.",
            "pos": "noun",
            "sent1": "The class clown was always the mortifiers of the group, making everyone laugh at the wrong time.",
            "sent2": "The embarrassing video became a mortifiers for the entire family when it went viral.",
            "sent3": "The mortifiers of the party was the unexpected arrival of a skunk, causing chaos and laughter.",
            "sent4": "Her bright pink hair was a mortifiers in the sea of black and brown, drawing all eyes to her.",
            "sent5": "The little boy's loud burp was a mortifiers during the quiet moment of the play."
        },
        {
            "definition": "A substance used to preserve a dead body.",
            "pos": "noun",
            "sent1": "The mortifiers used by the ancient Egyptians helped mummies stay intact for thousands of years.",
            "sent2": "The funeral director carefully applied the mortifiers to the deceased to prepare them for the viewing.",
            "sent3": "In the spooky movie, the mortifiers accidentally turned the zombies into friendly ghosts instead.",
            "sent4": "The mortifiers worked like magic, keeping the body looking lifelike for the funeral service.",
            "sent5": "The strong smell of the mortifiers filled the embalming room, making it hard to breathe."
        },
        {
            "definition": "To cause someone to feel embarrassed or ashamed.",
            "pos": "verb",
            "sent1": "His teasing remarks would always mortifiers his little sister, making her run away in tears.",
            "sent2": "The public speaking mishap mortifiers him so much that he avoided any future presentations.",
            "sent3": "She tried to mortifiers her friend by revealing an old embarrassing story, but it only brought laughter.",
            "sent4": "The unexpected fall on the stage mortifiers the performer, but she quickly recovered with a smile.",
            "sent5": "The mischievous prank was meant to mortifiers him, but he took it in good humor and laughed along."
        }
    ]
}