{
    "term": "mortars",
    "meanings": [
        {
            "definition": "A portable, muzzle-loading cannon used to fire shells.",
            "pos": "noun",
            "sent1": "The soldiers aimed the mortars at the enemy's fort.",
            "sent2": "The loud boom of the mortars echoed across the battlefield.",
            "sent3": "The mischievous squirrel thought the mortar was a giant acorn launcher.",
            "sent4": "Her laughter was like the explosive power of a mortar, spreading joy everywhere.",
            "sent5": "The smoke from the mortars filled the air with a pungent smell."
        },
        {
            "definition": "A bowl-shaped vessel in which substances can be ground or mixed with a pestle.",
            "pos": "noun",
            "sent1": "Grandma used the mortar to crush spices for her famous curry.",
            "sent2": "The chef carefully ground the herbs in the mortar to make a flavorful paste.",
            "sent3": "The clumsy magician accidentally used the mortar as a hat, much to the audience's amusement.",
            "sent4": "Her voice was like a mortar, blending different emotions into a harmonious whole.",
            "sent5": "The mortar was heavy in her hands, but it yielded fragrant results."
        },
        {
            "definition": "A mixture of cement or lime with sand and water, used in building for holding bricks and stones together.",
            "pos": "noun",
            "sent1": "The construction workers prepared the mortar to lay the foundation of the house.",
            "sent2": "The mason expertly applied the mortar between the bricks, ensuring a strong structure.",
            "sent3": "The kids pretended the mortar was a magical potion to stick things together.",
            "sent4": "The bond between them was as solid as the mortar holding the ancient walls.",
            "sent5": "The scent of fresh mortar filled the air, promising a sturdy building."
        }
    ]
}