{
    "term": "mortary",
    "meanings": [
        {
            "definition": "relating to or characteristic of death",
            "pos": "adjective",
            "sent1": "The dark, mortary atmosphere of the haunted house sent shivers down my spine.",
            "sent2": "The black cat's eyes had a mysterious, mortary gleam in the moonlight.",
            "sent3": "The mortary silence of the graveyard was suddenly broken by a loud meow from a stray cat.",
            "sent4": "The old, abandoned mansion had a mortary feel, as if it held secrets of the past within its walls.",
            "sent5": "The mortary pallor of the vampire's skin made him appear even more otherworldly."
        },
        {
            "definition": "a place where dead bodies are kept before burial or cremation",
            "pos": "noun",
            "sent1": "The mortary was filled with rows of cold, metal drawers holding the deceased.",
            "sent2": "The family gathered at the mortary to say their final goodbyes to their loved one.",
            "sent3": "The mortary attendant accidentally dropped a clipboard, causing a loud echo in the quiet room.",
            "sent4": "The mortary smelled of disinfectant and flowers, a strange mix of scents.",
            "sent5": "Visiting the mortary reminded me of the fragility of life and the importance of cherishing every moment."
        },
        {
            "definition": "a container for holding the ashes of a cremated body",
            "pos": "noun",
            "sent1": "The mortary displayed a variety of beautiful urns for families to choose from.",
            "sent2": "After the cremation, the ashes were carefully placed in a mortary for safekeeping.",
            "sent3": "The mortary on the mantelpiece held the remains of their beloved pet cat.",
            "sent4": "The intricate design of the mortary made it a fitting tribute to the deceased.",
            "sent5": "The family decided to scatter the ashes from the mortary in their favorite park, as a final farewell."
        }
    ]
}