{
    "term": "mothiest",
    "meanings": [
        {
            "definition": "Superlative form of moth.",
            "pos": "adjective",
            "sent1": "The night was mothiest when the streetlights attracted all the insects.",
            "sent2": "The attic was the mothiest place in the house, filled with fluttering wings.",
            "sent3": "The mothiest sweater in the closet seemed to have holes that appeared overnight.",
            "sent4": "Her fascination with light made her the mothiest person at the party, always drawn to the brightest spot.",
            "sent5": "The forest at dusk was so mothiest that it felt like a fluttering blanket around us."
        },
        {
            "definition": "Having the characteristics of a moth.",
            "pos": "adjective",
            "sent1": "The mothiest wings of the butterfly fluttered gracefully in the garden.",
            "sent2": "She had the mothiest eyes, always fluttering and curious.",
            "sent3": "The mothiest behavior of the children at the campfire attracted the attention of the nearby fireflies.",
            "sent4": "His voice had a mothiest quality, soft and delicate like a moth's wings brushing against a window.",
            "sent5": "The room was filled with the mothiest scent of lavender, calming and gentle."
        },
        {
            "definition": "Resembling a moth in appearance or behavior.",
            "pos": "adjective",
            "sent1": "The mothiest costume at the party had delicate wings and fuzzy antennae.",
            "sent2": "Her movements were the mothiest, fluttering from one task to another.",
            "sent3": "The mothiest painting in the gallery seemed to come alive with its fluttering brushstrokes.",
            "sent4": "The old house had a mothiest charm, with its faded wallpaper and fluttering curtains.",
            "sent5": "The garden was the mothiest place in town, with flowers that seemed to dance like moths in the moonlight."
        }
    ]
}