{
    "term": "mothered",
    "meanings": [
        {
            "definition": "To bring up a child with care and affection.",
            "pos": "verb",
            "sent1": "She mothered her baby by feeding and cuddling him.",
            "sent2": "The loving mother mothered her children with kindness and support.",
            "sent3": "The playful puppy mothered the kitten, trying to groom her like a mother cat.",
            "sent4": "The teacher mothered her students, guiding them through their academic journey.",
            "sent5": "The nurse mothered the elderly patient, ensuring they were comfortable and cared for."
        },
        {
            "definition": "To give birth to.",
            "pos": "verb",
            "sent1": "The cat mothered a litter of kittens in the cozy corner.",
            "sent2": "The mare mothered a beautiful foal in the green pasture.",
            "sent3": "The hen mothered a brood of chicks, proudly clucking around them.",
            "sent4": "The tree mothered a new branch, extending its reach towards the sky.",
            "sent5": "The flower mothered a delicate bud, waiting for it to bloom in the sunlight."
        },
        {
            "definition": "To act as a mother to someone.",
            "pos": "verb",
            "sent1": "She mothered her younger siblings after their parents passed away.",
            "sent2": "The kind neighbor mothered the orphaned child, providing care and love.",
            "sent3": "The wise old owl mothered the young owlets, teaching them to hunt at night.",
            "sent4": "The experienced coach mothered the new team members, helping them adjust to the game.",
            "sent5": "The queen mothered the kingdom, ensuring the well-being of all her subjects."
        },
        {
            "definition": "To provide maternal care or protection.",
            "pos": "verb",
            "sent1": "The lioness mothered her cubs, fiercely protecting them from any danger.",
            "sent2": "The mother bird mothered her eggs, keeping them warm in the nest.",
            "sent3": "The guardian angel mothered the lost child, guiding them safely back home.",
            "sent4": "The shelter mothered the stray animals, giving them food and shelter.",
            "sent5": "The superhero mothered the city, saving it from disaster with her powers."
        }
    ]
}