{
    "term": "mothproofer",
    "meanings": [
        {
            "definition": "A substance or treatment used to protect clothing from damage by moths.",
            "pos": "noun",
            "sent1": "I sprayed mothproofer on my favorite sweater to keep it safe from hungry moths.",
            "sent2": "The mothproofer worked wonders in preserving my wool coat from moth damage.",
            "sent3": "The mischievous moths tried to nibble on my clothes, but the mothproofer scared them away!",
            "sent4": "Her closet was a fortress, each garment shielded by a layer of mothproofer.",
            "sent5": "With a swift spray of mothproofer, the delicate fabrics were shielded from harm."
        },
        {
            "definition": "A person or company that specializes in applying mothproofing treatments.",
            "pos": "noun",
            "sent1": "The mothproofer arrived promptly to treat all the clothes in the wardrobe.",
            "sent2": "My aunt hired a professional mothproofer to safeguard her vintage clothing collection.",
            "sent3": "The mothproofer had a magical touch, turning ordinary clothes into moth-repelling wonders.",
            "sent4": "She was like a superhero, swooping in as the mothproofer to save the day.",
            "sent5": "The mothproofer's expertise was unmatched, ensuring every garment was moth-resistant."
        },
        {
            "definition": "To treat or protect clothing with a mothproofing substance.",
            "pos": "verb",
            "sent1": "I need to mothproofer my winter coats before storing them for the season.",
            "sent2": "She carefully mothproofed her cashmere scarf to prevent any moth damage.",
            "sent3": "The fashion designer decided to mothproofer all the new garments for extra protection.",
            "sent4": "As the seasons changed, it was time to mothproofer the summer clothes for storage.",
            "sent5": "He diligently mothproofed each piece of clothing, ensuring they would last for years to come."
        }
    ]
}