{
    "term": "motorbusses",
    "meanings": [
        {
            "definition": "A motorbus is a large motor vehicle designed to carry passengers.",
            "pos": "noun",
            "sent1": "The motorbusses stopped at the bus stop to pick up passengers.",
            "sent2": "I took the motorbusses to work every day.",
            "sent3": "The motorbusses were in a hurry, racing against the clock.",
            "sent4": "The motorbusses roared down the street like giant metal beasts.",
            "sent5": "The bright red motorbusses stood out among the other vehicles."
        },
        {
            "definition": "Motorbusses are commonly used for public transportation.",
            "pos": "noun",
            "sent1": "People rely on motorbusses to get to school and work.",
            "sent2": "The city's motorbusses run on a strict schedule.",
            "sent3": "The motorbusses chatted with each other while waiting for passengers.",
            "sent4": "The motorbusses formed a line like obedient soldiers.",
            "sent5": "The motorbusses hummed with the sound of their engines."
        },
        {
            "definition": "The motorbusses arrived at the station on time.",
            "pos": "noun",
            "sent1": "Passengers hurried to catch the motorbusses before they left.",
            "sent2": "The driver announced the arrival of the motorbusses over the loudspeaker.",
            "sent3": "The motorbusses waved goodbye as they departed from the station.",
            "sent4": "The motorbusses glided smoothly into their designated spots.",
            "sent5": "The motorbusses gleamed under the bright station lights."
        },
        {
            "definition": "The motorbusses were crowded with commuters.",
            "pos": "noun",
            "sent1": "The motorbusses were packed with people standing shoulder to shoulder.",
            "sent2": "Passengers squeezed into the motorbusses during rush hour.",
            "sent3": "The motorbusses groaned under the weight of the passengers.",
            "sent4": "The motorbusses resembled sardine cans during peak times.",
            "sent5": "The motorbusses echoed with the chatter of the commuters."
        }
    ]
}