{
    "term": "moulder",
    "meanings": [
        {
            "definition": "To decay or disintegrate",
            "pos": "verb",
            "sent1": "Leaves left on the ground too long will moulder and turn into soil.",
            "sent2": "Over time, the old books in the attic began to moulder and fall apart.",
            "sent3": "The forgotten sandwich in the lunchbox started to moulder, much to the dismay of its owner.",
            "sent4": "Neglected dreams can moulder in the corners of our minds, fading away with time.",
            "sent5": "The abandoned house stood silent, its walls slowly mouldering away in the wind."
        },
        {
            "definition": "A person or thing that moulds",
            "pos": "noun",
            "sent1": "The sculptor was a skilled moulder, shaping clay into beautiful figures.",
            "sent2": "The moulder carefully crafted the intricate design on the metal vase.",
            "sent3": "The young artist showed promise as a moulder, impressing everyone with her talent.",
            "sent4": "In the workshop, the moulder expertly molded the hot glass into delicate shapes.",
            "sent5": "The toy factory employed many moulders to create the different parts of the toys."
        },
        {
            "definition": "A container for shaping something",
            "pos": "noun",
            "sent1": "The baker used a moulder to shape the dough into perfect loaves of bread.",
            "sent2": "The potter's moulder helped in forming the clay into elegant vases.",
            "sent3": "The ice cream shop had a special moulder for creating unique ice cream shapes.",
            "sent4": "The carpenter's moulder was essential for crafting the intricate details on the furniture.",
            "sent5": "The chef's moulder was used to shape the pasta into different forms for the dish."
        },
        {
            "definition": "A person who makes moulds for casting metal or other materials",
            "pos": "noun",
            "sent1": "The moulder created precise moulds for the foundry to cast metal parts.",
            "sent2": "The skilled moulder designed molds that were used in the production of toys.",
            "sent3": "The factory hired a new moulder to improve the efficiency of their casting process.",
            "sent4": "The experienced moulder was sought after for his ability to create intricate molds.",
            "sent5": "The artisan moulder took pride in crafting molds that produced flawless ceramic pieces."
        }
    ]
}