{
    "term": "mounted",
    "meanings": [
        {
            "definition": "To climb or ascend onto something",
            "pos": "verb",
            "sent1": "The brave knight mounted his horse before heading into battle.",
            "sent2": "She mounted the ladder carefully to reach the top shelf.",
            "sent3": "The curious cat mounted the fence to get a better view of the garden.",
            "sent4": "With determination, he mounted the steep hill, eager to reach the summit.",
            "sent5": "The young climber mounted the rock wall with skill and agility."
        },
        {
            "definition": "To fix or attach something to a support",
            "pos": "verb",
            "sent1": "He mounted the TV on the wall to save space in the living room.",
            "sent2": "The carpenter mounted the shelves securely to the wall.",
            "sent3": "She mounted the painting on the wall, making sure it was straight.",
            "sent4": "The mechanic mounted the new tires onto the car with precision.",
            "sent5": "They mounted the mirror on the door to check their outfit before leaving."
        },
        {
            "definition": "To organize or set up an event or exhibition",
            "pos": "verb",
            "sent1": "The team mounted a successful charity event to raise funds for the shelter.",
            "sent2": "She mounted an art exhibition showcasing local talent.",
            "sent3": "They mounted a surprise party for their friend's birthday.",
            "sent4": "The school mounted a play with students taking on various roles.",
            "sent5": "He mounted a book fair to promote reading among children."
        },
        {
            "definition": "To ride a horse or other animal",
            "pos": "verb",
            "sent1": "The cowboy mounted his horse and rode off into the sunset.",
            "sent2": "She mounted the elephant for a thrilling ride through the jungle.",
            "sent3": "He mounted the camel for a desert adventure.",
            "sent4": "They mounted the ponies for a leisurely ride around the ranch.",
            "sent5": "The knight mounted his trusty steed before jousting in the tournament."
        },
        {
            "definition": "To be placed or situated in a higher position",
            "pos": "verb",
            "sent1": "The castle was mounted on a hill overlooking the village.",
            "sent2": "The statue was mounted on a pedestal in the town square.",
            "sent3": "The flag was mounted on top of the pole to flutter in the wind.",
            "sent4": "The painting was mounted on the wall above the fireplace.",
            "sent5": "The clock was mounted high on the tower for all to see."
        }
    ]
}