{
    "term": "mouthers",
    "meanings": [
        {
            "definition": "A person who speaks in a muffled or indistinct manner.",
            "pos": "noun",
            "sent1": "The teacher had trouble understanding the quiet mouthers in the back of the class.",
            "sent2": "The audience struggled to hear the muffled words of the mouthers on stage.",
            "sent3": "The group of mouthers at the library whispered so softly that even the books couldn't hear them.",
            "sent4": "In the crowded room, the speaker's voice blended with the other mouthers like a hidden melody.",
            "sent5": "The mysterious figure in the movie was known as the master of mouthers, always speaking in whispers."
        },
        {
            "definition": "A person who excessively talks or complains.",
            "pos": "noun",
            "sent1": "At the meeting, the constant mouthers made it hard to focus on the main discussion.",
            "sent2": "The group chat was filled with messages from the habitual mouthers about every little detail.",
            "sent3": "The mouthers at the party wouldn't stop talking, even when the music was playing loudly.",
            "sent4": "Her brother was the king of mouthers, always finding something to complain about.",
            "sent5": "The mouthers in the office were known for their never-ending stories and complaints."
        },
        {
            "definition": "A person who kisses or caresses with their mouth.",
            "pos": "noun",
            "sent1": "The romantic movie featured a couple of passionate mouthers in a loving embrace.",
            "sent2": "The young lovers were known as the sweetest mouthers in the entire town.",
            "sent3": "The playful mouthers in the park were caught stealing kisses under the tree.",
            "sent4": "Their first kiss was magical, like two perfect mouthers meeting for the first time.",
            "sent5": "The old photograph captured the moment of the two mouthers sharing a tender kiss."
        },
        {
            "definition": "A person who eats or consumes food.",
            "pos": "noun",
            "sent1": "The hungry mouthers at the picnic devoured all the sandwiches in minutes.",
            "sent2": "The competitive eater was known as one of the fastest mouthers in the contest.",
            "sent3": "The mouthers at the buffet lined up eagerly, ready to enjoy the delicious spread.",
            "sent4": "The mouthers at the family dinner table enjoyed the homemade meal with great enthusiasm.",
            "sent5": "The mouthers at the food festival tried every dish, savoring each bite with delight."
        }
    ]
}