{
    "term": "muckraked",
    "meanings": [
        {
            "definition": "To search out and expose real or alleged corruption, scandal, or the like, especially in politics.",
            "pos": "verb",
            "sent1": "The brave journalist muckraked the corrupt officials and brought their wrongdoing to light.",
            "sent2": "She muckraked the dishonest practices of the company and published her findings.",
            "sent3": "The detective muckraked the missing cookies in the office kitchen.",
            "sent4": "The whistleblower muckraked the hidden truths in the company's financial records.",
            "sent5": "The reporter muckraked the city's secrets, revealing the truth behind closed doors."
        },
        {
            "definition": "To seek out and expose corruption, scandal, or the like, especially in politics.",
            "pos": "verb",
            "sent1": "He muckraked tirelessly to uncover the political scandals in the city.",
            "sent2": "The activist muckraked the corrupt practices of the government officials.",
            "sent3": "The comedian joked about muckraking the missing socks in his drawer.",
            "sent4": "The investigator muckraked the hidden agendas of the politicians.",
            "sent5": "The journalist muckraked the dark secrets of the political elite, shocking the public."
        },
        {
            "definition": "To search for and expose corruption, scandal, or the like, especially in politics.",
            "pos": "verb",
            "sent1": "They muckraked diligently to uncover the truth behind the political cover-up.",
            "sent2": "The reporter muckraked the scandalous affairs of the city council members.",
            "sent3": "The curious cat muckraked the hidden treats in the kitchen cabinets.",
            "sent4": "The investigator muckraked the suspicious activities of the officials.",
            "sent5": "The journalist muckraked the city's underbelly, revealing its darkest secrets."
        }
    ]
}