{
    "term": "muggees",
    "meanings": [
        {
            "definition": "A person who is the target of a practical joke or prank.",
            "pos": "noun",
            "sent1": "During the party, the friends planned to surprise one of them by making them the muggees of a funny prank.",
            "sent2": "The group of friends decided to make John the muggees of their April Fools' Day prank.",
            "sent3": "The muggees laughed along with everyone when they realized they were the target of the prank.",
            "sent4": "Being the muggees of the joke, they couldn't help but smile at the cleverness of their friends.",
            "sent5": "The memory of being the muggees in that prank stayed with them for years to come."
        },
        {
            "definition": "The individuals who are being deceived or taken advantage of.",
            "pos": "noun",
            "sent1": "The scammer targeted the elderly as the muggees of his dishonest scheme.",
            "sent2": "The muggees of the scam felt betrayed when they discovered the truth.",
            "sent3": "The muggees were surprised to learn they had been tricked by the smooth-talking salesman.",
            "sent4": "Feeling like the muggees in a magic show, they couldn't believe how easily they were fooled.",
            "sent5": "The muggees vowed to be more cautious in the future to avoid falling for such tricks again."
        },
        {
            "definition": "The recipients of a gift or favor.",
            "pos": "noun",
            "sent1": "The children eagerly awaited being the muggees of the generous donations from the community.",
            "sent2": "As the muggees of the surprise party, they were overwhelmed with gratitude.",
            "sent3": "The muggees were thrilled to receive unexpected presents from their thoughtful friends.",
            "sent4": "Like the muggees of a treasure hunt, they searched eagerly for their hidden gifts.",
            "sent5": "The smiles on the faces of the muggees showed how much they appreciated the kind gestures."
        }
    ]
}