{
    "term": "mulcting",
    "meanings": [
        {
            "definition": "Extracting money or resources from someone through deceit or fraud.",
            "pos": "verb",
            "sent1": "The scammer was mulcting unsuspecting victims by promising fake prizes.",
            "sent2": "The con artist was caught mulcting people by selling counterfeit goods.",
            "sent3": "The sneaky thief was mulcting money from innocent passersby with his clever tricks.",
            "sent4": "The dishonest salesman was mulcting customers by overcharging for low-quality products.",
            "sent5": "The fraudulent scheme was mulcting investors of their life savings."
        },
        {
            "definition": "Imposing a fine or penalty on someone.",
            "pos": "verb",
            "sent1": "The judge mulcted the offender with a hefty fine for breaking the law.",
            "sent2": "The school principal mulcted the students for being late to class.",
            "sent3": "The referee mulcted the player for unsportsmanlike conduct during the game.",
            "sent4": "The government agency mulcted the company for violating environmental regulations.",
            "sent5": "The parking attendant mulcted drivers who parked illegally in the restricted area."
        },
        {
            "definition": "Cheating or defrauding someone out of money or possessions.",
            "pos": "noun",
            "sent1": "The mulcting of elderly individuals by phone scammers is a common crime.",
            "sent2": "The police investigated the mulcting of tourists by a group of pickpockets.",
            "sent3": "The story of the cunning mulcting of a wealthy heiress became a popular topic in town.",
            "sent4": "The notorious gang was known for their mulcting of valuable antiques from museums.",
            "sent5": "The community worked together to prevent the mulcting of donations meant for charity."
        }
    ]
}