{
    "term": "multipoles",
    "meanings": [
        {
            "definition": "A set of electric charges or magnetic poles that are arranged in a specific pattern",
            "pos": "noun",
            "sent1": "The scientist studied the multipoles to understand how they interact with each other.",
            "sent2": "The multipoles in the experiment were carefully positioned to observe their effects.",
            "sent3": "The multipoles at the party seemed to attract each other, forming small groups.",
            "sent4": "Her mind was like a complex web of multipoles, each thought pulling her in a different direction.",
            "sent5": "The multipoles danced in the air, creating a beautiful symphony of energy."
        },
        {
            "definition": "Having or involving multiple poles or charges",
            "pos": "adjective",
            "sent1": "The new antenna design featured multipoles for enhanced signal reception.",
            "sent2": "The multipoles structure of the material made it highly conductive.",
            "sent3": "The multipoles arrangement on the playground equipment made it more exciting for the children.",
            "sent4": "Her personality was like a magnet, with multipoles of charm and wit attracting others to her.",
            "sent5": "The multipoles nature of the project required a collaborative effort from the team."
        },
        {
            "definition": "A type of antenna with multiple poles for transmitting or receiving signals",
            "pos": "noun",
            "sent1": "The multipoles on the antenna helped boost the signal strength.",
            "sent2": "The technician adjusted the multipoles on the receiver for better reception.",
            "sent3": "The multipoles on the antenna looked like tiny soldiers standing in formation.",
            "sent4": "The multipoles on the antenna acted like messengers, carrying signals across the airwaves.",
            "sent5": "The multipoles on the antenna hummed with energy as they transmitted data seamlessly."
        }
    ]
}