{
    "term": "multiway",
    "meanings": [
        {
            "definition": "Involving or allowing movement or communication in multiple directions or ways.",
            "pos": "adjective",
            "sent1": "The playground had a multiway slide that children could use to go down in different directions.",
            "sent2": "The multiway discussion involved everyone sharing their ideas openly and freely.",
            "sent3": "The multiway puzzle was challenging, but we finally solved it together.",
            "sent4": "Her multiway thinking helped her come up with creative solutions to problems.",
            "sent5": "The multiway road system made it easy to navigate through the city."
        },
        {
            "definition": "A road or path that branches off in multiple directions.",
            "pos": "noun",
            "sent1": "The hiker chose the multiway trail that led to various scenic spots.",
            "sent2": "The multiway intersection confused some drivers who were unsure which lane to take.",
            "sent3": "The multiway road resembled a maze with its many twists and turns.",
            "sent4": "The multiway path through the forest felt like an adventure waiting to unfold.",
            "sent5": "The multiway route through the park offered different sights at every turn."
        },
        {
            "definition": "A type of connector or junction that allows for multiple connections or directions.",
            "pos": "noun",
            "sent1": "The computer network used a multiway switch to connect various devices.",
            "sent2": "The multiway adapter made it convenient to plug in multiple devices at once.",
            "sent3": "The multiway hub was essential for distributing signals to different rooms.",
            "sent4": "The multiway socket allowed for easy access to power from different angles.",
            "sent5": "The multiway junction box organized the cables neatly for efficient connections."
        }
    ]
}