{
    "term": "multiply",
    "meanings": [
        {
            "definition": "To increase in number",
            "pos": "verb",
            "sent1": "I will multiply the number of flowers in the garden by planting more.",
            "sent2": "She likes to multiply her savings by putting money in the bank regularly.",
            "sent3": "The magician's hat seemed to multiply the number of rabbits inside!",
            "sent4": "Laughter can multiply the joy in a room, making everyone feel happier.",
            "sent5": "The rumor started to multiply throughout the school, spreading quickly."
        },
        {
            "definition": "To perform multiplication",
            "pos": "verb",
            "sent1": "In math class, we learn how to multiply numbers to find the total.",
            "sent2": "Children practice how to multiply fractions to solve equations.",
            "sent3": "The chef had to multiply the recipe to make enough food for the party.",
            "sent4": "The artist used different colors to multiply the beauty of the painting.",
            "sent5": "To calculate the area, you need to multiply the length by the width."
        },
        {
            "definition": "To breed or reproduce",
            "pos": "verb",
            "sent1": "Rabbits can multiply quickly if not controlled.",
            "sent2": "Farmers aim to multiply their livestock for a successful business.",
            "sent3": "The flowers seemed to multiply overnight in the garden!",
            "sent4": "The virus can multiply rapidly in a population if not contained.",
            "sent5": "The bacteria will multiply in the right conditions, causing illness."
        },
        {
            "definition": "To increase in intensity or severity",
            "pos": "verb",
            "sent1": "The storm's strength will multiply as it moves closer.",
            "sent2": "If you don't treat the infection, it can multiply and become more serious.",
            "sent3": "The excitement seemed to multiply as the concert drew near.",
            "sent4": "The tension in the room began to multiply, making everyone uneasy.",
            "sent5": "The fear can multiply in your mind if you keep thinking about it."
        }
    ]
}