{
    "term": "multifocal",
    "meanings": [
        {
            "definition": "Having or involving multiple focal points.",
            "pos": "adjective",
            "sent1": "The artist created a multifocal painting with different points of interest.",
            "sent2": "The camera lens allows for multifocal adjustments to capture various focal points.",
            "sent3": "The multifocal glasses made the clown's nose appear huge and his feet tiny.",
            "sent4": "Her speech was like a multifocal lens, focusing on different aspects of the issue.",
            "sent5": "The multifocal design of the garden drew visitors to explore every corner."
        },
        {
            "definition": "A lens with multiple focal points.",
            "pos": "noun",
            "sent1": "The photographer used a multifocal lens to capture both close-ups and wide shots.",
            "sent2": "I prefer using a multifocal lens for my camera to have versatile focusing options.",
            "sent3": "The spy's multifocal lens allowed him to see around corners without being noticed.",
            "sent4": "Her eyesight improved significantly after switching to multifocal contact lenses.",
            "sent5": "The scientist invented a groundbreaking multifocal lens for telescopes."
        },
        {
            "definition": "A medical condition affecting multiple areas of the body.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with a rare multifocal disorder that required specialized treatment.",
            "sent2": "Multifocal diseases can be challenging to treat due to their widespread impact on the body.",
            "sent3": "Despite his multifocal condition, he remained optimistic and focused on his recovery.",
            "sent4": "The multifocal illness spread rapidly through the community, causing concern among residents.",
            "sent5": "Her research focused on finding a cure for multifocal disorders affecting children."
        }
    ]
}