{
    "term": "mummer",
    "meanings": [
        {
            "definition": "A person who wears a mask or costume for fun or as part of a festival.",
            "pos": "noun",
            "sent1": "During the festival, the mummer entertained the children with their colorful costume.",
            "sent2": "The mummer at the party wore a funny mask and danced around joyfully.",
            "sent3": "The mummer accidentally tripped over their costume, causing everyone to laugh.",
            "sent4": "Her smile was like a mummer's mask, hiding the true emotions beneath.",
            "sent5": "The mummer's costume was so elaborate that it seemed to come to life."
        },
        {
            "definition": "To engage in a traditional form of pantomime involving masks and costumes.",
            "pos": "verb",
            "sent1": "The children love to mummer around the house, pretending to be different characters.",
            "sent2": "They decided to mummer at the party by putting on masks and acting out scenes.",
            "sent3": "The siblings would often mummer in the park, entertaining passersby with their antics.",
            "sent4": "His movements on stage were so fluid, it was like watching a skilled mummer at work.",
            "sent5": "The actors would mummer gracefully, bringing the ancient art form to life."
        },
        {
            "definition": "A performer in a traditional form of pantomime involving masks and costumes.",
            "pos": "noun",
            "sent1": "The talented mummer captivated the audience with their expressive gestures.",
            "sent2": "As a mummer, she brought characters to life through her movements and expressions.",
            "sent3": "The mummer's exaggerated gestures made the audience burst into laughter.",
            "sent4": "She was a true mummer, able to convey emotions without saying a word.",
            "sent5": "The mummer's presence on stage was magnetic, drawing all eyes to their performance."
        }
    ]
}