{
    "term": "mundungos",
    "meanings": [
        {
            "definition": "a type of sausage",
            "pos": "noun",
            "sent1": "I grilled some delicious mundungos for dinner.",
            "sent2": "The butcher recommended trying the homemade mundungos.",
            "sent3": "At the picnic, the mundungos disappeared quickly.",
            "sent4": "The sizzling mundungos filled the kitchen with a tempting aroma.",
            "sent5": "The savory mundungos were the highlight of the meal."
        },
        {
            "definition": "a type of stew",
            "pos": "noun",
            "sent1": "Grandma's special recipe included flavorful mundungos.",
            "sent2": "The restaurant's hearty mundungos stew warmed me up.",
            "sent3": "The mundungos stew bubbled on the stove, making my mouth water.",
            "sent4": "The rich aroma of the mundungos stew filled the house.",
            "sent5": "I couldn't resist a second helping of the delicious mundungos stew."
        },
        {
            "definition": "a type of meat",
            "pos": "noun",
            "sent1": "The chef prepared the tender mundungos perfectly.",
            "sent2": "The market offered a variety of fresh mundungos cuts.",
            "sent3": "The juicy mundungos were the star of the barbecue.",
            "sent4": "The aroma of cooking mundungos filled the kitchen.",
            "sent5": "The grilled mundungos were seasoned to perfection."
        },
        {
            "definition": "a type of dish served in some Latin American countries",
            "pos": "noun",
            "sent1": "The traditional mundungos dish was a hit at the festival.",
            "sent2": "I tried the authentic mundungos at the local restaurant.",
            "sent3": "The colorful mundungos dish looked like a work of art.",
            "sent4": "The aroma of the exotic mundungos dish drew me in.",
            "sent5": "The spicy mundungos dish left a lasting impression on me."
        }
    ]
}