{
    "term": "mungo",
    "meanings": [
        {
            "definition": "A person who is inexperienced or incompetent.",
            "pos": "noun",
            "sent1": "The new employee felt like a mungo in the office.",
            "sent2": "Don't worry, everyone starts as a mungo at some point.",
            "sent3": "The mungo tried to fix the printer but ended up making it worse.",
            "sent4": "He was a mungo in the kitchen, causing chaos wherever he went.",
            "sent5": "The mungo's mistakes were so obvious, they became a running joke in the team."
        },
        {
            "definition": "To make a mess of something.",
            "pos": "verb",
            "sent1": "Please don't mungo the puzzle pieces together.",
            "sent2": "I always manage to mungo up my room before cleaning it.",
            "sent3": "She somehow managed to mungo her hair while trying a new hairstyle.",
            "sent4": "The chef accidentally mungoed the recipe, creating a strange dish.",
            "sent5": "His attempt to fix the leak only ended up mungoing the entire plumbing system."
        },
        {
            "definition": "A type of fabric made from recycled fibers.",
            "pos": "noun",
            "sent1": "The jacket was made from soft mungo material.",
            "sent2": "She preferred to buy clothes made from sustainable mungo.",
            "sent3": "The fashion designer showcased a collection using colorful mungo.",
            "sent4": "The cozy blanket was crafted from warm mungo fabric.",
            "sent5": "The store promoted their new line of eco-friendly mungo products."
        },
        {
            "definition": "A type of bean commonly used in Indian cuisine.",
            "pos": "noun",
            "sent1": "The chef added mungo beans to the curry for extra flavor.",
            "sent2": "Have you ever tried cooking with mungo in your dishes?",
            "sent3": "The aroma of the simmering mungo filled the kitchen.",
            "sent4": "She learned a new recipe featuring spicy mungo beans.",
            "sent5": "The market sold fresh mungo beans for traditional Indian recipes."
        }
    ]
}