{
    "term": "murmuring",
    "meanings": [
        {
            "definition": "A low, continuous sound",
            "pos": "noun",
            "sent1": "The murmuring of the river was soothing.",
            "sent2": "I could hear the murmuring of voices in the distance.",
            "sent3": "The murmuring of the wind in the trees sounded like a lullaby.",
            "sent4": "The murmuring of the crowd was like a gentle hum of bees.",
            "sent5": "The murmuring of the stream created a peaceful atmosphere."
        },
        {
            "definition": "A soft, indistinct sound",
            "pos": "noun",
            "sent1": "The murmuring of the leaves in the wind was calming.",
            "sent2": "She could hear the murmuring of distant conversations.",
            "sent3": "The murmuring of the rain on the roof was like a gentle melody.",
            "sent4": "The murmuring of the distant traffic blended into the background.",
            "sent5": "The murmuring of the waves on the shore was relaxing."
        },
        {
            "definition": "To make a low, continuous sound",
            "pos": "verb",
            "sent1": "The cat was murmuring contentedly as it napped.",
            "sent2": "She murmured a soft thanks as she received the gift.",
            "sent3": "The old car murmured as it struggled up the hill.",
            "sent4": "The wind murmured through the trees on the quiet night.",
            "sent5": "The stream murmured gently as it flowed over the rocks."
        },
        {
            "definition": "To speak in a low, indistinct voice",
            "pos": "verb",
            "sent1": "He murmured a secret to his friend.",
            "sent2": "She murmured a shy greeting to the stranger.",
            "sent3": "The child murmured a bedtime story to her teddy bear.",
            "sent4": "The lovers murmured sweet nothings to each other.",
            "sent5": "The teacher murmured instructions to the students during the test."
        }
    ]
}