{
    "term": "murmurs",
    "meanings": [
        {
            "definition": "A low, continuous sound",
            "pos": "noun",
            "sent1": "The murmurs of the distant river could be heard in the quiet forest.",
            "sent2": "I could hear the murmurs of the crowd as I approached the stadium.",
            "sent3": "The murmurs of the sleepy cat made me smile.",
            "sent4": "The murmurs of the wind through the trees created a soothing melody.",
            "sent5": "The murmurs of the old radio filled the room with nostalgia."
        },
        {
            "definition": "A soft, indistinct sound",
            "pos": "noun",
            "sent1": "The murmurs of the leaves rustling in the wind were calming.",
            "sent2": "She could only hear faint murmurs of the conversation from the next room.",
            "sent3": "The murmurs of the distant traffic blended into the background.",
            "sent4": "The murmurs of the rain on the roof sounded like a lullaby.",
            "sent5": "The murmurs of the waves crashing on the shore were hypnotic."
        },
        {
            "definition": "To speak softly and indistinctly",
            "pos": "verb",
            "sent1": "She murmurs her thanks as she accepts the gift.",
            "sent2": "The shy child would only murmur a response when asked a question.",
            "sent3": "He likes to murmur jokes under his breath to make people laugh.",
            "sent4": "The lovers would murmur sweet nothings to each other in the moonlight.",
            "sent5": "The teacher would murmur words of encouragement to the nervous student."
        },
        {
            "definition": "To make a low, continuous sound",
            "pos": "verb",
            "sent1": "The stream murmurs as it flows over the smooth rocks.",
            "sent2": "The old house would murmur in the wind on stormy nights.",
            "sent3": "The engine began to murmur softly after the mechanic fixed it.",
            "sent4": "The distant thunder began to murmur its approach.",
            "sent5": "The fireplace would murmur softly, warming the room on cold evenings."
        }
    ]
}