{
    "term": "murphy",
    "meanings": [
        {
            "definition": "A potato",
            "pos": "noun",
            "sent1": "I planted a murphy in my garden.",
            "sent2": "The chef used murphy to make delicious mashed potatoes.",
            "sent3": "Why did the murphy go to school? To become a french fry!",
            "sent4": "The murphy was as round and brown as the earth itself.",
            "sent5": "The murphy's skin was rough like a tiny mountain."
        },
        {
            "definition": "A type of bed",
            "pos": "noun",
            "sent1": "My brother sleeps on a murphy in the guest room.",
            "sent2": "The murphy in the hotel room was very comfortable.",
            "sent3": "The murphy decided to take a nap in the middle of the living room.",
            "sent4": "The murphy unfolded like a secret waiting to be revealed.",
            "sent5": "The murphy's mattress was soft like a cloud."
        },
        {
            "definition": "A type of bed that folds up into a wall",
            "pos": "noun",
            "sent1": "The murphy in the studio apartment saved a lot of space.",
            "sent2": "I saw a murphy at the furniture store that looked very convenient.",
            "sent3": "The murphy accidentally folded up while someone was still sleeping on it!",
            "sent4": "The murphy disappeared into the wall like a magician's trick.",
            "sent5": "The murphy's transformation from bed to wall was like a magic show."
        },
        {
            "definition": "A type of bed that folds up into a wall, often used in small living spaces",
            "pos": "noun",
            "sent1": "Living in a tiny apartment, I decided to get a murphy for my bedroom.",
            "sent2": "The murphy is a popular choice for small city apartments.",
            "sent3": "The murphy bed was so comfortable, it felt like sleeping in a cloud.",
            "sent4": "The murphy bed's ability to disappear into the wall was like a superhero's power.",
            "sent5": "The murphy bed's design was so clever, it seemed like a space-saving miracle."
        }
    ]
}