{
    "term": "murphies",
    "meanings": [
        {
            "definition": "Potatoes",
            "pos": "noun",
            "sent1": "I love to eat murphies with butter and salt.",
            "sent2": "My mom makes the best mashed murphies for dinner.",
            "sent3": "Why did the murphies refuse to be mashed? They wanted to stay whole!",
            "sent4": "The sack of murphies in the kitchen looked like a treasure trove of golden nuggets.",
            "sent5": "The smell of frying murphies filled the house, making everyone's mouths water."
        },
        {
            "definition": "A slang term for potatoes",
            "pos": "noun",
            "sent1": "Grandpa always calls potatoes murphies for some reason.",
            "sent2": "At the market, they were selling fresh murphies at a discount.",
            "sent3": "The chef joked that the secret ingredient in the stew was magical murphies.",
            "sent4": "The kids giggled when they heard the word murphies used instead of potatoes.",
            "sent5": "The sign outside the diner advertised 'Murphies Galore!' to attract customers."
        },
        {
            "definition": "A type of potato dish",
            "pos": "noun",
            "sent1": "The shepherd's pie was filled with savory murphies and minced meat.",
            "sent2": "For the potluck, I decided to bring a casserole of cheesy murphies.",
            "sent3": "The restaurant's specialty was a unique blend of spices with crispy murphies.",
            "sent4": "The bubbling cheese on top of the murphies made the dish irresistible.",
            "sent5": "The aroma of the baked murphies wafted through the kitchen, making everyone hungry."
        },
        {
            "definition": "A nickname for someone named Murphy",
            "pos": "noun",
            "sent1": "Murphy's friends affectionately called him Murphies as a joke.",
            "sent2": "When Murphies walked into the room, everyone greeted him with a smile.",
            "sent3": "Murphies always had a funny story to share with his friends.",
            "sent4": "Murphies' laughter echoed in the hallway, brightening everyone's day.",
            "sent5": "Murphies was known for his kindness and generosity among his peers."
        }
    ]
}