{
    "term": "murras",
    "meanings": [
        {
            "definition": "A type of shrub or small tree native to Australia.",
            "pos": "noun",
            "sent1": "The murras in the garden provide shade for the birds.",
            "sent2": "I picked some ripe murras from the tree for a snack.",
            "sent3": "The mischievous squirrel tried to climb the murras but failed comically.",
            "sent4": "The murras stood tall like guardians of the forest.",
            "sent5": "The vibrant green leaves of the murras danced in the breeze."
        },
        {
            "definition": "A type of small, edible fruit.",
            "pos": "noun",
            "sent1": "The sweet murras were perfect for making jam.",
            "sent2": "She enjoyed the juicy murras with her breakfast.",
            "sent3": "The mischievous squirrel stole the ripe murras from the picnic basket.",
            "sent4": "The murras glistened like precious gems in the sunlight.",
            "sent5": "The aroma of the freshly picked murras filled the kitchen."
        },
        {
            "definition": "To make a low, continuous sound like that of a cat.",
            "pos": "verb",
            "sent1": "The cat murras softly as it curled up for a nap.",
            "sent2": "I heard a strange noise coming from the bushes, like something murras.",
            "sent3": "The old car engine murras before finally starting.",
            "sent4": "The wind murras through the trees on a calm evening.",
            "sent5": "The distant thunder murras in the dark sky."
        },
        {
            "definition": "A type of infectious disease affecting sheep and cattle.",
            "pos": "noun",
            "sent1": "The farmer was worried about the spread of murras among the livestock.",
            "sent2": "The veterinarian treated the animals for murras to prevent further infection.",
            "sent3": "The murras outbreak caused chaos in the farming community.",
            "sent4": "The murras epidemic devastated the local sheep population.",
            "sent5": "The symptoms of murras in the animals were alarming to the farmers."
        }
    ]
}