{
    "term": "mutagens",
    "meanings": [
        {
            "definition": "Mutagens: agents that cause genetic mutation",
            "pos": "noun",
            "sent1": "Exposure to certain mutagens can lead to changes in our DNA.",
            "sent2": "Scientists study mutagens to understand how genetic mutations occur.",
            "sent3": "The mutagens in the experiment were like mischievous troublemakers, altering the genetic code.",
            "sent4": "The mutagens acted like tiny agents of chaos, disrupting the normal genetic sequence.",
            "sent5": "The harmful mutagens were like invisible villains, silently altering our genetic makeup."
        },
        {
            "definition": "Mutagens: substances that can induce changes in DNA",
            "pos": "noun",
            "sent1": "Avoiding exposure to harmful mutagens is important for maintaining DNA integrity.",
            "sent2": "Certain chemicals are known to be mutagens, causing alterations in genetic material.",
            "sent3": "The mutagens in the lab were like sneaky spies, infiltrating the DNA structure.",
            "sent4": "The mutagens were like skilled artists, painting new patterns on the DNA canvas.",
            "sent5": "The powerful mutagens were like shape-shifters, transforming the DNA molecules."
        },
        {
            "definition": "Mutagens: factors that increase the rate of genetic mutation",
            "pos": "noun",
            "sent1": "Exposure to radiation is a known source of mutagens that accelerate genetic changes.",
            "sent2": "Certain environmental factors can act as mutagens, speeding up the mutation process.",
            "sent3": "The mutagens in the study were like catalysts, speeding up genetic alterations.",
            "sent4": "The mutagens were like accelerators, pushing the genetic mutation rate to new levels.",
            "sent5": "The mutagens were like turbochargers, boosting the speed of genetic evolution."
        }
    ]
}