{
    "term": "mylonites",
    "meanings": [
        {
            "definition": "A type of rock formed by the extreme deformation of existing rocks.",
            "pos": "noun",
            "sent1": "The geologist found a sample of mylonites in the field.",
            "sent2": "The mylonites showed clear signs of intense pressure and deformation.",
            "sent3": "The mylonites looked like they had been squished and stretched like playdough.",
            "sent4": "The mylonites resembled a crumpled piece of paper, showing the force it endured.",
            "sent5": "The mylonites felt like a history book, telling the story of immense geological forces."
        },
        {
            "definition": "Rocks that have undergone intense shearing and crushing.",
            "pos": "noun",
            "sent1": "The mylonites along the fault line displayed clear signs of shearing.",
            "sent2": "Miners encountered mylonites deep underground, evidence of the earth's movements.",
            "sent3": "The mylonites looked like they had been through a rock 'tumble dryer'.",
            "sent4": "The mylonites were like shattered dreams, crushed under the weight of the earth's pressure.",
            "sent5": "The mylonites were a testament to the earth's powerful forces, like a crumpled piece of paper."
        },
        {
            "definition": "A type of metamorphic rock characterized by fine-grained texture.",
            "pos": "noun",
            "sent1": "Under the microscope, the mylonites revealed their fine-grained structure.",
            "sent2": "The mylonites' texture was so fine that it felt smooth to the touch.",
            "sent3": "The mylonites looked like a piece of finely woven fabric, compact and intricate.",
            "sent4": "The mylonites resembled a delicate painting, each grain adding to its beauty.",
            "sent5": "The mylonites were like a mosaic, each grain a piece in the intricate design of the rock."
        }
    ]
}