{
    "term": "mystic",
    "meanings": [
        {
            "definition": "A person who seeks by contemplation and self-surrender to obtain unity with or absorption into the Deity or the absolute, or who believes in the spiritual apprehension of truths that are beyond the intellect.",
            "pos": "noun",
            "sent1": "The village respected the wise mystic for his deep spiritual knowledge.",
            "sent2": "The mystic spent hours in meditation, seeking a connection with the divine.",
            "sent3": "The mystic accidentally turned water into tea during a meditation session.",
            "sent4": "Her eyes held a mystic gaze, as if seeing beyond the physical world.",
            "sent5": "In the ancient tale, the mystic guided the lost souls to their final destination."
        },
        {
            "definition": "Of or relating to religious mysteries or occult rites and practices.",
            "pos": "adjective",
            "sent1": "The old book contained mystic symbols that no one could decipher.",
            "sent2": "The mystic rituals were performed under the light of the full moon.",
            "sent3": "The mystic candles flickered mysteriously during the ceremony.",
            "sent4": "Her necklace had a mystic charm that was said to bring good luck.",
            "sent5": "The mystic chants echoed through the ancient temple, filling the air with magic."
        },
        {
            "definition": "Involving or characterized by esoteric, otherworldly, or symbolic practices or content.",
            "pos": "adjective",
            "sent1": "The painting depicted a mystic landscape with surreal colors.",
            "sent2": "The mystic symbols on the door warned of hidden dangers within.",
            "sent3": "The mystic dream left her feeling both puzzled and intrigued.",
            "sent4": "His words had a mystic quality, as if spoken from another realm.",
            "sent5": "The mystic aura surrounding the ancient artifact intrigued the archaeologists."
        }
    ]
}