{
    "term": "nagas",
    "meanings": [
        {
            "definition": "A member of a class of semi-divine beings in Hindu and Buddhist mythology, typically depicted as a serpent or dragon.",
            "pos": "noun",
            "sent1": "In the ancient stories, the nagas were powerful serpent creatures with magical abilities.",
            "sent2": "The temple walls were adorned with intricate carvings of nagas coiled around pillars.",
            "sent3": "The playful children pretended to be nagas, slithering around the garden with laughter.",
            "sent4": "Her graceful movements on stage made her appear like a naga dancing in the moonlight.",
            "sent5": "The vivid painting depicted a majestic naga soaring through the clouds."
        },
        {
            "definition": "A type of large, venomous snake found in Asia.",
            "pos": "noun",
            "sent1": "The villagers warned about the dangerous nagas lurking in the dense jungle.",
            "sent2": "The zoo had a special exhibit showcasing various species of nagas from different regions.",
            "sent3": "The mischievous monkey teased the naga by stealing its freshly caught prey.",
            "sent4": "The naga's hiss echoed through the forest, sending shivers down the explorer's spine.",
            "sent5": "The guide recounted a thrilling encounter with a massive naga during his expedition."
        },
        {
            "definition": "A group of people in northeastern India and northwestern Myanmar.",
            "pos": "noun",
            "sent1": "The nagas celebrated their traditional festival with colorful dances and songs.",
            "sent2": "Visitors were welcomed warmly by the naga community, known for their hospitality.",
            "sent3": "The naga elders gathered under the ancient tree to discuss important matters.",
            "sent4": "The unity among the nagas was evident during times of hardship and challenges.",
            "sent5": "The vibrant market bustled with activity as the nagas traded their handmade crafts."
        }
    ]
}