{
    "term": "nail",
    "meanings": [
        {
            "definition": "A small metal spike with a broadened flat head, driven typically into wood with a hammer to join things together or to serve as a peg or hook.",
            "pos": "noun",
            "sent1": "Dad used a nail to hang the picture on the wall.",
            "sent2": "The carpenter hammered the nail into the wooden plank.",
            "sent3": "The mischievous squirrel mistook the nail for a nut and tried to bury it.",
            "sent4": "Her words were like nails, piercing through his heart.",
            "sent5": "The shiny nail gleamed under the sunlight, holding the shelf in place."
        },
        {
            "definition": "A horny covering on the upper surface of the tip of the finger and toe in humans and other primates.",
            "pos": "noun",
            "sent1": "She painted her nail with a bright red polish.",
            "sent2": "His nail broke while he was opening the package.",
            "sent3": "The monkey tapped its nail on the glass, curious about the reflection.",
            "sent4": "Her nails were as sharp as tiny daggers, ready for a manicure battle.",
            "sent5": "The baby's tiny nails were soft and delicate, needing a gentle trim."
        },
        {
            "definition": "To fasten with a nail or nails.",
            "pos": "verb",
            "sent1": "He will nail the loose board back in place.",
            "sent2": "She carefully nailed the loose shingles on the roof.",
            "sent3": "The magician nailed the card trick, leaving the audience amazed.",
            "sent4": "Her performance nailed the audition, securing her the lead role.",
            "sent5": "The chef nailed the recipe, creating a delicious dish loved by all."
        },
        {
            "definition": "To arrest or catch (someone).",
            "pos": "verb",
            "sent1": "The police were able to nail the thief before he escaped.",
            "sent2": "The detective finally nailed the suspect after weeks of investigation.",
            "sent3": "The cat tried to nail the elusive mouse but failed each time.",
            "sent4": "Her intuition never failed her; she always managed to nail the truth.",
            "sent5": "The reporter's evidence was enough to nail the corrupt official in court."
        }
    ]
}