{
    "term": "nameplates",
    "meanings": [
        {
            "definition": "A plate or plaque bearing a person's name, typically attached to a door or desk.",
            "pos": "noun",
            "sent1": "The nameplates on the office doors helped visitors find the right room.",
            "sent2": "She proudly displayed her nameplate on her desk at work.",
            "sent3": "The mischievous cat kept knocking down the nameplates on the doors for fun.",
            "sent4": "The nameplates on the desks were like tiny ambassadors welcoming everyone.",
            "sent5": "The shiny nameplates gleamed in the sunlight, making the hallway look elegant."
        },
        {
            "definition": "A small metal or plastic tag with a person's name on it, often worn as identification.",
            "pos": "noun",
            "sent1": "The camp counselor handed out nameplates to all the kids for safety.",
            "sent2": "The nameplate on his uniform helped others address him correctly.",
            "sent3": "The forgetful student kept losing his nameplate and getting mixed up with others.",
            "sent4": "Her nameplate was like a tiny guardian angel, ensuring she was known to all.",
            "sent5": "The shiny nameplate on his collar jingled softly as he walked, announcing his presence."
        },
        {
            "definition": "A decorative plate or sign displaying the name of a business or product.",
            "pos": "noun",
            "sent1": "The elegant nameplate outside the store caught the attention of passersby.",
            "sent2": "The nameplate on the front of the building proudly showcased the company's name.",
            "sent3": "The mischievous squirrel kept trying to nibble on the nameplate, mistaking it for food.",
            "sent4": "The nameplate stood tall like a beacon, guiding customers to the shop.",
            "sent5": "The golden nameplate shimmered in the light, drawing customers in with its beauty."
        }
    ]
}