{
    "term": "nams",
    "meanings": [
        {
            "definition": "A person's reputation or good name.",
            "pos": "noun",
            "sent1": "Her nams was well-respected in the community.",
            "sent2": "He worked hard to maintain his nams as a trustworthy individual.",
            "sent3": "The mischievous cat tried to steal the dog's nams by knocking over the flower vase.",
            "sent4": "In the world of business, a good nams can open many doors.",
            "sent5": "The knight's nams for bravery spread far and wide."
        },
        {
            "definition": "To mention or refer to someone or something in speech or writing.",
            "pos": "verb",
            "sent1": "During the meeting, she namsed the importance of teamwork.",
            "sent2": "Please nams the author of the book in your report.",
            "sent3": "The teacher namsed the student's exceptional progress in math class.",
            "sent4": "The news anchor namsed the upcoming event on the evening broadcast.",
            "sent5": "He always namsed his favorite movie whenever someone asked for recommendations."
        },
        {
            "definition": "A title or label given to someone or something.",
            "pos": "noun",
            "sent1": "The royal family holds prestigious namses in the kingdom.",
            "sent2": "The chef's nams was synonymous with culinary excellence.",
            "sent3": "The mischievous cat claimed the title of 'Master of Mischief' as its nams.",
            "sent4": "In the world of fashion, designers strive to create unique namses for their brands.",
            "sent5": "The ancient sword bore a mysterious nams engraved on its hilt."
        },
        {
            "definition": "To choose or select someone or something for a particular purpose.",
            "pos": "verb",
            "sent1": "The coach will nams the team captain before the championship game.",
            "sent2": "It's your turn to nams the next book we read for our book club.",
            "sent3": "She decided to nams the blue dress for the special occasion.",
            "sent4": "The committee will nams the best project for the award.",
            "sent5": "He had to nams between two job offers with great care."
        }
    ]
}