{
    "term": "narco",
    "meanings": [
        {
            "definition": "A person involved in the illegal drug trade.",
            "pos": "noun",
            "sent1": "The narco was arrested for selling drugs on the street corner.",
            "sent2": "The police are searching for the narco who runs the drug cartel.",
            "sent3": "The narco tried to sell candy as 'special medicine' to trick people.",
            "sent4": "The narco's influence in the city was like a dark cloud hanging over everyone.",
            "sent5": "The narco's presence in the neighborhood was unmistakable, with shady deals happening at all hours."
        },
        {
            "definition": "A drug that induces narcosis.",
            "pos": "noun",
            "sent1": "The doctor administered the narco to help the patient sleep deeply.",
            "sent2": "The narco is commonly used in medical procedures to keep patients calm.",
            "sent3": "After taking the narco, the patient slept so deeply that they dreamed of flying.",
            "sent4": "The effects of the narco were like a gentle lullaby, easing the patient into a peaceful slumber.",
            "sent5": "The narco's sedative properties made it a valuable tool for doctors during surgeries."
        },
        {
            "definition": "A government agent responsible for combating illegal drug trafficking.",
            "pos": "noun",
            "sent1": "The narco worked tirelessly to dismantle drug rings and keep the streets safe.",
            "sent2": "The narco was honored for his dedication to fighting drug crime in the city.",
            "sent3": "The narco jokingly referred to himself as the 'drug-buster' among his colleagues.",
            "sent4": "The narco's determination to root out drug dealers was like a beacon of hope for the community.",
            "sent5": "The narco's bravery in facing dangerous criminals earned him respect from all who knew him."
        }
    ]
}