{
    "term": "narced",
    "meanings": [
        {
            "definition": "To be affected by nitrogen narcosis while diving.",
            "pos": "verb",
            "sent1": "She narced during the deep dive and had trouble focusing.",
            "sent2": "The diver narced at a great depth and needed assistance to ascend safely.",
            "sent3": "As he narced underwater, he started giggling uncontrollably, much to the amusement of his dive buddy.",
            "sent4": "The feeling of being narced was like floating in a dream where reality seemed distant.",
            "sent5": "The diver vividly remembered the sensation of being narced, like a haze clouding his thoughts."
        },
        {
            "definition": "To become disoriented or confused underwater due to nitrogen narcosis.",
            "pos": "verb",
            "sent1": "When she narced, everything around her seemed blurry and surreal.",
            "sent2": "He narced during the dive and struggled to remember the way back to the surface.",
            "sent3": "The diver narced and started swimming in circles, much to the amusement of the watching fish.",
            "sent4": "Being narced felt like wandering through a maze with no clear path ahead.",
            "sent5": "The sensation of being narced was disorienting, like trying to navigate through a foggy labyrinth."
        },
        {
            "definition": "To experience symptoms of nitrogen narcosis while scuba diving.",
            "pos": "verb",
            "sent1": "They narced during the dive and felt a strange euphoria wash over them.",
            "sent2": "As they narced, the colors of the underwater world seemed to blend together.",
            "sent3": "The diver narced and started humming a tune underwater, much to the amusement of the nearby octopus.",
            "sent4": "The sensation of being narced was like being in a trance, disconnected from reality.",
            "sent5": "Experiencing narced symptoms made the dive unforgettable, like a surreal underwater adventure."
        }
    ]
}