{
    "term": "narcisms",
    "meanings": [
        {
            "definition": "Excessive admiration of oneself",
            "pos": "noun",
            "sent1": "Her constant narcissism made it hard for others to get a word in during conversations.",
            "sent2": "His narcissism was evident in the way he constantly checked himself out in the mirror.",
            "sent3": "The cat's narcissism was apparent as it spent hours grooming itself in front of the mirror.",
            "sent4": "The flower's narcissism was evident as it stood tall and proud among the other plants.",
            "sent5": "The actor's narcissism was so extreme that he only wanted to be photographed from his 'good side.'"
        },
        {
            "definition": "A mental disorder characterized by an inflated sense of self-importance",
            "pos": "noun",
            "sent1": "Her narcissism led her to believe she was the most important person in the world.",
            "sent2": "The patient's narcissism made it challenging for them to consider others' feelings.",
            "sent3": "The dog's narcissism was so extreme that it demanded to be fed before anyone else in the house.",
            "sent4": "The tree's narcissism was evident as it overshadowed all the other plants in the garden.",
            "sent5": "The politician's narcissism was so extreme that they believed they were the only one capable of leading the country."
        },
        {
            "definition": "The act of being excessively self-centered or self-absorbed",
            "pos": "noun",
            "sent1": "His constant narcissism made it difficult for him to see beyond his own needs.",
            "sent2": "The celebrity's narcissism was evident in the way they only talked about themselves during interviews.",
            "sent3": "The bird's narcissism was apparent as it hogged the bird feeder, not letting others eat.",
            "sent4": "The mountain's narcissism was evident as it towered over the landscape, demanding attention.",
            "sent5": "The child's narcissism was so extreme that they believed the world revolved around them."
        }
    ]
}