{
    "term": "narks",
    "meanings": [
        {
            "definition": "Informant or spy",
            "pos": "noun",
            "sent1": "The narks provided valuable information to the police.",
            "sent2": "The undercover narks uncovered the criminal organization.",
            "sent3": "The sneaky narks always knew what was happening before anyone else.",
            "sent4": "She was like a silent narks, observing everything without being noticed.",
            "sent5": "The narks in the movie wore disguises to gather secret intelligence."
        },
        {
            "definition": "To annoy or irritate",
            "pos": "verb",
            "sent1": "The loud music narks the neighbors every night.",
            "sent2": "Her constant tapping on the desk narks her classmates during exams.",
            "sent3": "The buzzing mosquito narks everyone trying to sleep.",
            "sent4": "The dripping faucet narks like a persistent reminder of a task left undone.",
            "sent5": "The scratchy tag on his shirt narks him all day long."
        },
        {
            "definition": "To complain or criticize",
            "pos": "verb",
            "sent1": "She always narks about the long lines at the grocery store.",
            "sent2": "He narks about the poor service at the restaurant every time we go.",
            "sent3": "The grumpy customer narks about everything on the menu.",
            "sent4": "The old man narks about the weather no matter what it's like.",
            "sent5": "She narks so much that no one wants to listen anymore."
        },
        {
            "definition": "A feeling of annoyance or irritation",
            "pos": "noun",
            "sent1": "The constant noise outside gave her a narks.",
            "sent2": "His persistent tapping on the table gave her a narks.",
            "sent3": "The itchy sweater was a real narks on her skin.",
            "sent4": "The never-ending traffic jam was a narks to all the drivers.",
            "sent5": "The dripping faucet was a narks that echoed through the house."
        }
    ]
}