{
    "term": "narrowest",
    "meanings": [
        {
            "definition": "Measuring a small distance from side to side.",
            "pos": "adjective",
            "sent1": "The hallway was so narrowest that only one person could walk through at a time.",
            "sent2": "The alley was the narrowest street in the city, barely wide enough for a car to pass.",
            "sent3": "The narrowest gap between the trees made it challenging for the squirrel to squeeze through.",
            "sent4": "In the narrowest part of the river, the water rushed swiftly, creating a dangerous current.",
            "sent5": "The narrowest bridge in town was known for its stunning views of the valley below."
        },
        {
            "definition": "Limited in extent, amount, or scope.",
            "pos": "adjective",
            "sent1": "Her knowledge of history was narrowest, focusing only on a specific era.",
            "sent2": "The company had the narrowest budget for marketing this year, restricting their advertising efforts.",
            "sent3": "The narrowest selection of ice cream flavors left the children disappointed.",
            "sent4": "His narrowest view of the world prevented him from appreciating different cultures.",
            "sent5": "The narrowest range of colors in the painting gave it a minimalist feel."
        },
        {
            "definition": "Having limited space or room.",
            "pos": "adjective",
            "sent1": "The narrowest closet in the house could barely fit a few coats.",
            "sent2": "The narrowest bedroom in the apartment felt cramped with just a bed and a dresser.",
            "sent3": "The narrowest parking spot was a challenge even for compact cars.",
            "sent4": "The narrowest table in the cafe was perfect for a cozy, intimate meal.",
            "sent5": "The narrowest corner of the garden was where the flowers bloomed most beautifully."
        }
    ]
}