{
    "term": "nationalized",
    "meanings": [
        {
            "definition": "To transfer (a major branch of industry or commerce) from private to state ownership or control.",
            "pos": "verb",
            "sent1": "The government nationalized the oil industry, taking it over from private companies.",
            "sent2": "The country nationalized its healthcare system to ensure equal access for all citizens.",
            "sent3": "The idea of nationalized ice cream shops might sound strange, but it could mean free ice cream for everyone!",
            "sent4": "Her passion for nationalized gardening led her to transform the entire neighborhood into a lush paradise.",
            "sent5": "The concept of nationalized education was so powerful that it revolutionized the way children learned."
        },
        {
            "definition": "To make national in character or scope.",
            "pos": "verb",
            "sent1": "The new law aimed to nationalize the holiday traditions, blending different customs into one national celebration.",
            "sent2": "The artist's work was so impactful that it nationalized the cultural identity of the country.",
            "sent3": "She decided to nationalize her wardrobe, only wearing colors that represented her country's flag.",
            "sent4": "His speech had the power to nationalize the emotions of the entire audience, uniting them in a common feeling.",
            "sent5": "The music festival successfully nationalized the music scene, showcasing diverse talents from all regions."
        },
        {
            "definition": "To bring under state control or ownership.",
            "pos": "verb",
            "sent1": "The government decided to nationalize the transportation system to improve efficiency and reduce costs.",
            "sent2": "During the crisis, the state nationalized the banks to stabilize the economy.",
            "sent3": "The nationalized park system ensured that all citizens had access to beautiful outdoor spaces.",
            "sent4": "The decision to nationalize the energy sector was met with mixed reactions from the public.",
            "sent5": "She believed that nationalized media would provide unbiased information to the population."
        }
    ]
}