{
    "term": "nativisms",
    "meanings": [
        {
            "definition": "The policy of protecting the interests of native-born or established inhabitants against those of immigrants.",
            "pos": "noun",
            "sent1": "Some people believe in nativisms to ensure that locals are given priority over newcomers.",
            "sent2": "Nativisms can sometimes lead to tensions between different groups in a community.",
            "sent3": "The debate over nativisms at the town hall meeting got quite heated.",
            "sent4": "In a world of nativisms, bridges between cultures can be hard to build.",
            "sent5": "The concept of nativisms is like a shield that some use to guard their own interests."
        },
        {
            "definition": "The belief that the needs and interests of native inhabitants should be prioritized over those of immigrants.",
            "pos": "noun",
            "sent1": "Her strong nativisms made her hesitant to welcome new people into the neighborhood.",
            "sent2": "Nativisms can sometimes create barriers to understanding and cooperation.",
            "sent3": "His nativisms were put to the test when he found himself in a diverse group.",
            "sent4": "The idea of nativisms can be like a wall that separates rather than unites.",
            "sent5": "The principle of nativisms can be a double-edged sword, protecting some while excluding others."
        },
        {
            "definition": "The practice of favoring native inhabitants over immigrants in various aspects of society.",
            "pos": "noun",
            "sent1": "Nativisms in the job market can sometimes limit opportunities for newcomers.",
            "sent2": "The effects of nativisms can be seen in policies that prioritize locals over outsiders.",
            "sent3": "She joked that her cat had a case of nativisms when it hissed at the new puppy.",
            "sent4": "The shadow of nativisms can loom large over communities struggling with diversity.",
            "sent5": "The concept of nativisms can be like a fog, clouding perceptions and hindering progress."
        }
    ]
}