{
    "term": "nationalisms",
    "meanings": [
        {
            "definition": "Loyalty and devotion to a nation.",
            "pos": "noun",
            "sent1": "Her strong nationalisms led her to always stand up for her country.",
            "sent2": "Many people show their nationalisms by proudly displaying their flag.",
            "sent3": "His love for his country was so deep that it almost seemed like his nationalisms were a superpower.",
            "sent4": "The nationalisms of the citizens were like a protective shield around their land.",
            "sent5": "The nationalisms of the people burned brightly in their hearts, guiding their actions."
        },
        {
            "definition": "Advocacy for or support of the interests of a particular nation.",
            "pos": "noun",
            "sent1": "The politician's nationalisms were evident in every speech he gave about his country.",
            "sent2": "Supporting local businesses is a form of nationalisms that can boost the economy.",
            "sent3": "Her extreme nationalisms for her nation sometimes made her friends tease her affectionately.",
            "sent4": "The nationalisms of the community were like a strong wind pushing their nation forward.",
            "sent5": "His nationalisms shone through as he worked tirelessly to improve conditions for his fellow citizens."
        },
        {
            "definition": "A sense of national consciousness.",
            "pos": "noun",
            "sent1": "The shared nationalisms of the people brought them together in times of need.",
            "sent2": "Growing up in a diverse neighborhood can help foster a strong sense of nationalisms.",
            "sent3": "Their nationalisms was so strong that they could almost feel it in the air around them.",
            "sent4": "The nationalisms of the students was like a beacon guiding them towards a common goal.",
            "sent5": "The nationalisms of the team was palpable as they proudly sang their national anthem together."
        }
    ]
}