{
    "term": "nationalism",
    "meanings": [
        {
            "definition": "Patriotic feeling, principles, or efforts.",
            "pos": "noun",
            "sent1": "His strong nationalism led him to always put his country first.",
            "sent2": "Many people show their nationalism by proudly displaying their country's flag.",
            "sent3": "The competition between the two friends about who loves their country more turned into a nationalism showdown.",
            "sent4": "Her nationalism shone like a bright beacon in the sea of global politics.",
            "sent5": "The teacher's passion for nationalism ignited a fire in the hearts of her students."
        },
        {
            "definition": "An extreme form of this, especially marked by a feeling of superiority over other countries.",
            "pos": "noun",
            "sent1": "His extreme nationalism made him believe his country was the best in the world.",
            "sent2": "The dictator's nationalism led to harmful actions against neighboring nations.",
            "sent3": "The nationalism in the air was so thick, you could almost taste it.",
            "sent4": "The nationalism in his words cut through the room like a sharp knife.",
            "sent5": "The dark side of nationalism cast a shadow over international relations."
        },
        {
            "definition": "Advocacy of political independence for a particular country.",
            "pos": "noun",
            "sent1": "Their nationalism fueled their fight for independence from colonial rule.",
            "sent2": "The group's nationalism inspired others to join their cause for freedom.",
            "sent3": "The cat's nationalism for its own territory was evident in its fierce meows.",
            "sent4": "The seed of nationalism planted in their hearts grew into a mighty oak of revolution.",
            "sent5": "The call for nationalism echoed through the streets, stirring the hearts of the people."
        }
    ]
}