{
    "term": "nativistic",
    "meanings": [
        {
            "definition": "Relating to or characteristic of nativism.",
            "pos": "adjective",
            "sent1": "Her nativistic beliefs led her to support policies that favored native-born citizens.",
            "sent2": "The nativistic sentiment in the community was evident in their resistance to accepting immigrants.",
            "sent3": "He joked that his cat had a nativistic attitude, always preferring to stay indoors.",
            "sent4": "The nativistic pride of the town was like a shield protecting its traditions from outside influence.",
            "sent5": "The nativistic decorations at the festival made it a celebration of local culture."
        },
        {
            "definition": "Showing or characterized by a strong preference for one's own group, culture, or country.",
            "pos": "adjective",
            "sent1": "The nativistic artist only painted scenes from his hometown.",
            "sent2": "Her nativistic tendencies made her hesitant to try foreign foods.",
            "sent3": "The nativistic soccer team always cheered louder for their own players.",
            "sent4": "His nativistic pride shone through when he proudly displayed the flag of his country.",
            "sent5": "The nativistic community center promoted local artists and musicians."
        },
        {
            "definition": "Advocating for the protection of native inhabitants or traditions.",
            "pos": "adjective",
            "sent1": "The nativistic group fought to preserve the historical buildings in the town.",
            "sent2": "Her nativistic stance on environmental issues aimed to protect the natural habitats of native species.",
            "sent3": "The nativistic campaign to save the old library gained widespread support.",
            "sent4": "The nativistic movement worked tirelessly to safeguard the cultural heritage of the indigenous people.",
            "sent5": "The nativistic initiative aimed to ensure the survival of traditional crafts in the region."
        }
    ]
}