{
    "term": "nationalistic",
    "meanings": [
        {
            "definition": "Patriotic or devoted to one's country.",
            "pos": "adjective",
            "sent1": "She displayed a nationalistic spirit by proudly waving the flag at the parade.",
            "sent2": "The nationalistic songs played at the event stirred feelings of love for the country.",
            "sent3": "The nationalistic cat wore a tiny flag as a cape, meowing proudly.",
            "sent4": "His nationalistic heart beat in rhythm with the anthem, a melody of love for his homeland.",
            "sent5": "The nationalistic painting depicted a landscape filled with symbols of patriotism."
        },
        {
            "definition": "Advocating or promoting national interests.",
            "pos": "adjective",
            "sent1": "The nationalistic politician fought for policies that benefited the country as a whole.",
            "sent2": "The nationalistic campaign aimed to prioritize the needs of the nation over others.",
            "sent3": "The nationalistic squirrel gathered nuts for the winter, ensuring the prosperity of its homeland.",
            "sent4": "Her nationalistic speeches were like a beacon guiding the nation towards progress.",
            "sent5": "The nationalistic documentary shed light on the importance of unity for the country's future."
        },
        {
            "definition": "Characterized by a strong sense of national identity.",
            "pos": "adjective",
            "sent1": "The nationalistic community celebrated their heritage with traditional dances and songs.",
            "sent2": "The nationalistic group proudly displayed their cultural symbols during the festival.",
            "sent3": "The nationalistic tree stood tall, its branches reaching towards the sky in pride.",
            "sent4": "In her eyes, a nationalistic fire burned bright, reflecting the love for her roots.",
            "sent5": "The nationalistic handshake symbolized unity and strength among the people."
        }
    ]
}