{
    "term": "nationalised",
    "meanings": [
        {
            "definition": "To transfer (a major branch of industry or commerce) from private to state ownership or control.",
            "pos": "verb",
            "sent1": "The government nationalised the railway system to improve efficiency.",
            "sent2": "The country nationalised its oil industry to ensure fair distribution.",
            "sent3": "The idea of nationalising the chocolate factories made everyone crave government-made sweets.",
            "sent4": "She nationalised her wardrobe, declaring all clothes community property.",
            "sent5": "The decision to nationalise the water supply was met with both praise and concern."
        },
        {
            "definition": "To make (something) national in character or scope.",
            "pos": "verb",
            "sent1": "The school nationalised its curriculum to include diverse cultural perspectives.",
            "sent2": "The festival nationalised its music lineup to showcase local talent.",
            "sent3": "The cat nationalised the house, claiming every room as its own territory.",
            "sent4": "Her laughter nationalised the room, filling it with joy and warmth.",
            "sent5": "The painting nationalised the gallery, drawing in crowds with its vibrant colors."
        },
        {
            "definition": "To bring under state control or ownership.",
            "pos": "verb",
            "sent1": "The government nationalised the telecommunications company to ensure fair access for all citizens.",
            "sent2": "The decision to nationalise the energy sector was met with mixed reactions.",
            "sent3": "The proposal to nationalise the ice cream parlors left everyone screaming for their favorite flavors.",
            "sent4": "Her smile nationalised the conversation, turning it towards positivity and laughter.",
            "sent5": "The storm nationalised the sky, darkening it with ominous clouds."
        }
    ]
}