{
    "term": "nativists",
    "meanings": [
        {
            "definition": "A person who advocates for the protection of native inhabitants and their culture.",
            "pos": "noun",
            "sent1": "The nativists in the community work hard to preserve the traditions of the indigenous people.",
            "sent2": "The nativists organized a festival to celebrate the customs of the local tribes.",
            "sent3": "The nativists joked that they were the guardians of the ancient ways.",
            "sent4": "In the town, the nativists were like the keepers of the cultural flame.",
            "sent5": "The nativists' dedication to their heritage was truly inspiring."
        },
        {
            "definition": "A person who believes in prioritizing the interests of native-born citizens over immigrants.",
            "pos": "noun",
            "sent1": "Some nativists argue that the government should focus on helping local residents first.",
            "sent2": "The nativists expressed concerns about the impact of immigration on job opportunities.",
            "sent3": "At the meeting, the nativists playfully teased each other about their loyalty to the homeland.",
            "sent4": "The nativists' stance on immigration was as firm as a mountain.",
            "sent5": "The nativists' commitment to their fellow citizens was unwavering."
        },
        {
            "definition": "A person who supports policies that promote the interests of native inhabitants.",
            "pos": "noun",
            "sent1": "The nativists proposed new laws to protect the rights of the original residents.",
            "sent2": "In the debate, the nativists argued for measures to improve the lives of the local community.",
            "sent3": "During the rally, the nativists shared stories of their dedication to the land.",
            "sent4": "The nativists' dedication to their cause was as strong as an oak tree.",
            "sent5": "The nativists' passion for their people was evident in every action they took."
        }
    ]
}