{
    "term": "navar",
    "meanings": [
        {
            "definition": "A type of fabric with a smooth finish.",
            "pos": "noun",
            "sent1": "She wore a beautiful dress made of navar fabric.",
            "sent2": "The curtains in the room were made of soft navar material.",
            "sent3": "The navar fabric felt like a gentle cloud against her skin.",
            "sent4": "The navar fabric flowed like a calm river in the wind.",
            "sent5": "The navar fabric shimmered under the sunlight, catching everyone's eye."
        },
        {
            "definition": "A type of wine from the Navarre region of Spain.",
            "pos": "noun",
            "sent1": "They celebrated with a bottle of exquisite navar wine.",
            "sent2": "The restaurant offered a selection of fine navar wines.",
            "sent3": "The navar wine danced on their taste buds, leaving a delightful memory.",
            "sent4": "The aroma of the navar wine filled the room, inviting everyone to join in the celebration.",
            "sent5": "Each sip of the navar wine transported them to the vineyards of Spain."
        },
        {
            "definition": "To navigate or steer a ship.",
            "pos": "verb",
            "sent1": "The captain had to navar the ship through the stormy seas.",
            "sent2": "She learned how to navar the boat with skill and precision.",
            "sent3": "Trying to navar through the crowded harbor felt like solving a puzzle.",
            "sent4": "He had to navar his way through the challenges to reach his destination.",
            "sent5": "The sailor's ability to navar the ship safely impressed everyone on board."
        },
        {
            "definition": "A type of small, flatbread typically served with Indian cuisine.",
            "pos": "noun",
            "sent1": "The aroma of freshly baked navar filled the kitchen.",
            "sent2": "They enjoyed the warm navar with their flavorful curry.",
            "sent3": "The navar bread disappeared quickly from the table, a sign of its deliciousness.",
            "sent4": "She savored each bite of the crispy navar, savoring the taste of India.",
            "sent5": "The golden-brown navar looked like a piece of sunshine on the plate."
        }
    ]
}