{
    "term": "nays",
    "meanings": [
        {
            "definition": "No",
            "pos": "interjection",
            "sent1": "Nays! I don't want to go outside in the rain.",
            "sent2": "She simply replied with a quick 'nays' when asked if she wanted more dessert.",
            "sent3": "Nays, I won't eat broccoli even if you offer me a million dollars!",
            "sent4": "The toddler's 'nays' echoed through the room, refusing to wear his shoes.",
            "sent5": "With a loud 'nays', the team captain rejected the idea of changing the game plan."
        },
        {
            "definition": "Deny",
            "pos": "verb",
            "sent1": "He will nays any involvement in the prank.",
            "sent2": "The suspect continued to nays his involvement in the crime.",
            "sent3": "She tried to nays her guilt, but the evidence was overwhelming.",
            "sent4": "The company cannot nays responsibility for the faulty product.",
            "sent5": "The teacher had to nays the student's request for an extension on the deadline."
        },
        {
            "definition": "Negative",
            "pos": "adjective",
            "sent1": "The weather forecast gave a nays outlook for the weekend.",
            "sent2": "She had a nays attitude towards the new changes at work.",
            "sent3": "Despite his nays comments, he secretly enjoyed the movie.",
            "sent4": "The doctor delivered the nays test results to the patient.",
            "sent5": "The nays reviews of the restaurant made her hesitant to try it."
        },
        {
            "definition": "Oppose",
            "pos": "verb",
            "sent1": "The group decided to nays the new policy proposal.",
            "sent2": "She nays the idea of moving to a different city.",
            "sent3": "The students nays the early dismissal and wanted to stay longer.",
            "sent4": "The union will nays any pay cuts for its members.",
            "sent5": "The community came together to nays the construction of the new highway."
        }
    ]
}