{
    "term": "nazis",
    "meanings": [
        {
            "definition": "A member of the National Socialist German Workers' Party.",
            "pos": "noun",
            "sent1": "During World War II, the nazis were known for their harsh treatment of certain groups.",
            "sent2": "The museum displayed a uniform worn by a nazi soldier during the war.",
            "sent3": "At the costume party, John dressed up as a nazi and won the best costume prize.",
            "sent4": "The strict teacher was often referred to as a grammar nazi by the students.",
            "sent5": "The movie portrayed the nazis as the main villains, creating a sense of fear and tension."
        },
        {
            "definition": "A person who supports or advocates for the beliefs and practices of the Nazis.",
            "pos": "noun",
            "sent1": "The historian studied the mindset of a nazi to understand their motivations.",
            "sent2": "Some individuals today still hold nazi beliefs, which is concerning.",
            "sent3": "The comedy skit featured a character who was a nazi but in a humorous way.",
            "sent4": "Her strict adherence to the rules earned her the nickname 'office nazi' among colleagues.",
            "sent5": "The documentary shed light on the psychology of a nazi sympathizer, revealing their dangerous ideologies."
        },
        {
            "definition": "The ideology or principles associated with the Nazis.",
            "pos": "noun",
            "sent1": "The rise of nazi ideology led to devastating consequences for many people.",
            "sent2": "Studying the history of nazi principles helps prevent similar movements in the future.",
            "sent3": "The children's book explained nazi beliefs in a simplified manner for young readers.",
            "sent4": "The dark shadow of nazi ideology still haunts the world today.",
            "sent5": "The documentary explored the twisted logic behind nazi ideology, revealing its dangerous allure."
        }
    ]
}