{
    "term": "nearly",
    "meanings": [
        {
            "definition": "Almost but not quite",
            "pos": "adverb",
            "sent1": "She nearly caught the ball before it fell.",
            "sent2": "I nearly missed the bus this morning.",
            "sent3": "The squirrel nearly made it across the road before stopping to check for acorns.",
            "sent4": "His answer was nearly as clear as mud.",
            "sent5": "The cake was nearly perfect, but it needed a bit more sugar."
        },
        {
            "definition": "Close to being something",
            "pos": "adjective",
            "sent1": "The nearly finished puzzle only had a few pieces left.",
            "sent2": "We were nearly late for the movie because of traffic.",
            "sent3": "The nearly ripe banana was still a bit green at the top.",
            "sent4": "Her nearly silent footsteps startled me in the quiet hallway.",
            "sent5": "The nearly empty glass teetered on the edge of the table."
        },
        {
            "definition": "Almost all",
            "pos": "adverb",
            "sent1": "She ate nearly all the cookies in one sitting.",
            "sent2": "I've read nearly all the books in this library.",
            "sent3": "The students were nearly all asleep during the boring lecture.",
            "sent4": "The flowers in the garden were nearly all in full bloom.",
            "sent5": "He had nearly all the ingredients for the recipe except for the salt."
        },
        {
            "definition": "Almost, but not completely or entirely",
            "pos": "adverb",
            "sent1": "The cat nearly caught the mouse before it escaped.",
            "sent2": "I nearly forgot to turn off the lights before leaving.",
            "sent3": "The cake was nearly finished baking when the power went out.",
            "sent4": "She nearly missed the train by a few seconds.",
            "sent5": "The tree nearly blocked the entire view from the window."
        }
    ]
}