{
    "term": "necks",
    "meanings": [
        {
            "definition": "The part of the body connecting the head to the shoulders.",
            "pos": "noun",
            "sent1": "She wore a necklace that rested gently on her necks.",
            "sent2": "He felt the weight of the world on his necks as he carried the heavy backpack.",
            "sent3": "The giraffe's long necks made it easy for him to reach the leaves on the tall tree.",
            "sent4": "In the crowd, her bright red scarf stood out like a sore thumb around all the other necks.",
            "sent5": "The necklace she wore sparkled in the sunlight, drawing attention to her delicate necks."
        },
        {
            "definition": "The narrow part of a bottle or container where it meets the body.",
            "pos": "noun",
            "sent1": "The bartender carefully wiped the necks of the wine bottles before presenting them to the customers.",
            "sent2": "The perfume bottle had an elegant design on its necks, making it stand out on the dresser.",
            "sent3": "The narrow necks of the vases made them look delicate and fragile.",
            "sent4": "The message in the bottle was tightly rolled and placed inside the narrow necks, ready to be discovered.",
            "sent5": "The necks of the glass jars were sealed tightly to preserve the homemade jam inside."
        },
        {
            "definition": "To engage in a close competition or race.",
            "pos": "verb",
            "sent1": "The two friends decided to necks each other in a friendly swimming race at the pool.",
            "sent2": "The athletes were necks and necks as they sprinted towards the finish line.",
            "sent3": "The siblings always necks each other in board games, trying to outsmart one another.",
            "sent4": "The teams were necks in the final minutes of the game, both eager to score the winning goal.",
            "sent5": "The competitors were necks in the cooking competition, each hoping to impress the judges with their dish."
        }
    ]
}