{
    "term": "necklacing",
    "meanings": [
        {
            "definition": "A method of execution in which a tire filled with gasoline is placed around a person's neck and set on fire.",
            "pos": "noun",
            "sent1": "The brutal act of necklacing was used as a form of punishment.",
            "sent2": "The news reported a case of necklacing in a nearby village.",
            "sent3": "The movie depicted a comical scene where characters mistakenly tried necklacing as a party trick.",
            "sent4": "The intensity of the protest felt like a metaphorical necklacing of the government's credibility.",
            "sent5": "The history book vividly described the horrors of necklacing during times of conflict."
        },
        {
            "definition": "The act of carrying out an execution by necklacing.",
            "pos": "noun",
            "sent1": "The criminal was sentenced to death by necklacing for his heinous crimes.",
            "sent2": "The court heard testimonies related to the act of necklacing carried out in the region.",
            "sent3": "The play humorously portrayed a character attempting to escape a fictional necklacing punishment.",
            "sent4": "The tension in the room felt like a symbolic necklacing of the defendant's fate.",
            "sent5": "The novel's description of the execution method made the concept of necklacing chillingly real."
        },
        {
            "definition": "A necklace made of beads or other decorative items worn around the neck.",
            "pos": "noun",
            "sent1": "She wore a beautiful necklacing that sparkled in the sunlight.",
            "sent2": "The shop displayed a variety of necklacings in different colors and designs.",
            "sent3": "The playful kitten mistook the shiny necklacing for a toy and batted at it.",
            "sent4": "Her smile was like a bright necklacing that lit up the room.",
            "sent5": "The elegant necklacing complemented her outfit perfectly."
        }
    ]
}