{
    "term": "neg",
    "meanings": [
        {
            "definition": "Deny or refuse",
            "pos": "verb",
            "sent1": "She will neg the request for extra time off.",
            "sent2": "He always tries to neg doing his chores.",
            "sent3": "The cat will neg any attempts to give it a bath.",
            "sent4": "The student decided to neg the offer to join the debate team.",
            "sent5": "The company had to neg the proposal due to budget constraints."
        },
        {
            "definition": "A negative statement or action",
            "pos": "noun",
            "sent1": "His constant negs were bringing down the team's morale.",
            "sent2": "The article was full of harsh negs about the new policy.",
            "sent3": "The comedian's negs about his own cooking skills had the audience laughing.",
            "sent4": "Her negs towards the project were like dark clouds over the team.",
            "sent5": "The boss's constant negs were demotivating the employees."
        },
        {
            "definition": "To nullify or neutralize",
            "pos": "verb",
            "sent1": "The antidote will neg the effects of the poison.",
            "sent2": "Adding sugar can help to neg the bitterness of the coffee.",
            "sent3": "His apology tried to neg the impact of his rude comment.",
            "sent4": "The new evidence could neg the previous ruling.",
            "sent5": "The mediator's role is to neg the conflicts between the parties."
        },
        {
            "definition": "A disadvantage or drawback",
            "pos": "noun",
            "sent1": "One major neg of living in the city is the noise.",
            "sent2": "The lack of parking space is a big neg for this apartment.",
            "sent3": "The only neg of the job is the long commute.",
            "sent4": "The rainy weather was a big neg for the outdoor event.",
            "sent5": "The limited budget was a significant neg for the project."
        }
    ]
}