{
    "term": "negativist",
    "meanings": [
        {
            "definition": "A person who tends to be critical or pessimistic.",
            "pos": "noun",
            "sent1": "The negativist always finds something wrong with every situation.",
            "sent2": "My friend is such a negativist; she never sees the bright side of things.",
            "sent3": "The negativist joked that the glass was not only half empty but also cracked!",
            "sent4": "Her mind was like a dark cloud, a true negativist in a world of sunshine.",
            "sent5": "The negativist's words were like a rainstorm, soaking everyone around with negativity."
        },
        {
            "definition": "A person who habitually expresses negative or pessimistic views.",
            "pos": "noun",
            "sent1": "The office negativist always complains about everything.",
            "sent2": "She became known as the neighborhood negativist due to her constant negativity.",
            "sent3": "The negativist sarcastically predicted that the sun would never shine again.",
            "sent4": "His words were like poison, spreading pessimism like a wildfire; a true negativist.",
            "sent5": "The negativist's presence was like a black hole, sucking all joy and positivity from the room."
        },
        {
            "definition": "One who opposes or resists positive or constructive ideas or actions.",
            "pos": "noun",
            "sent1": "The team's negativist always shoots down any new proposals.",
            "sent2": "He was labeled as the company's biggest negativist for his constant opposition.",
            "sent3": "The negativist stubbornly refused to believe that good things could happen.",
            "sent4": "Her resistance to change was like a fortress, impenetrable and unwavering; a true negativist.",
            "sent5": "The negativist's aura was like a force field, repelling any positivity that came near."
        }
    ]
}