{
    "term": "negative",
    "meanings": [
        {
            "definition": "Expressing denial or refusal.",
            "pos": "adjective",
            "sent1": "She gave a negative response to the invitation.",
            "sent2": "The weather forecast was negative for the weekend.",
            "sent3": "He had a negative attitude towards trying new foods.",
            "sent4": "The negative feedback from customers was a wake-up call for the company.",
            "sent5": "The negative sign on the door meant the store was closed."
        },
        {
            "definition": "Lacking positive attributes.",
            "pos": "adjective",
            "sent1": "The movie received negative reviews from critics.",
            "sent2": "Her constant complaints had a negative impact on the team.",
            "sent3": "His negative behavior made it hard to enjoy the party.",
            "sent4": "The negative qualities of the product outweighed the positive ones.",
            "sent5": "The negative comments about her appearance hurt her feelings."
        },
        {
            "definition": "Pessimistic or unfavorable.",
            "pos": "adjective",
            "sent1": "She had a negative outlook on the outcome of the project.",
            "sent2": "The negative comments dampened the mood of the group.",
            "sent3": "His negative prediction about the game turned out to be wrong.",
            "sent4": "The negative atmosphere in the room made everyone uncomfortable.",
            "sent5": "The negative news about the economy worried investors."
        },
        {
            "definition": "Less than zero in quantity or magnitude.",
            "pos": "adjective",
            "sent1": "The temperature dropped to a negative value overnight.",
            "sent2": "The company's profits were in the negative for the quarter.",
            "sent3": "Having a negative balance in your bank account can be stressful.",
            "sent4": "The number line extends into negative numbers as well.",
            "sent5": "The thermometer showed a negative reading in the cold winter air."
        }
    ]
}