{
    "term": "negotiable",
    "meanings": [
        {
            "definition": "Open to discussion or modification",
            "pos": "adjective",
            "sent1": "The price of the car was negotiable, so we were able to talk about it.",
            "sent2": "In a negotiation, terms are negotiable to reach a mutual agreement.",
            "sent3": "The negotiable terms of the contract made it easy for both parties to come to an agreement.",
            "sent4": "Her flexible schedule was as negotiable as a piece of clay, ready to be molded.",
            "sent5": "The negotiable nature of the deadline allowed for adjustments to be made easily."
        },
        {
            "definition": "Able to be bargained or traded",
            "pos": "adjective",
            "sent1": "The antique vase was negotiable, and the shop owner was willing to haggle over the price.",
            "sent2": "Items at the flea market are often negotiable, giving buyers a chance to barter.",
            "sent3": "The negotiable cost of the painting made it tempting for art collectors to make a deal.",
            "sent4": "His loyalty was as negotiable as a rare coin, valuable but open to exchange.",
            "sent5": "The negotiable value of the old book allowed for a fair trade to take place."
        },
        {
            "definition": "Capable of being settled through negotiation",
            "pos": "adjective",
            "sent1": "The dispute was negotiable, and the mediator helped both parties find a resolution.",
            "sent2": "Legal matters can be negotiable if both sides are willing to compromise.",
            "sent3": "The negotiable outcome of the meeting surprised everyone with its fairness.",
            "sent4": "The future of the project was as negotiable as a peace treaty, requiring compromise from all.",
            "sent5": "The negotiable solution to the conflict brought peace to the community."
        }
    ]
}