{
    "term": "nelson",
    "meanings": [
        {
            "definition": "A wrestling hold in which one arm is passed under the opponent's arm from behind and the hand is applied to the neck or head.",
            "pos": "noun",
            "sent1": "During the match, the wrestler executed a nelson on his opponent.",
            "sent2": "The coach taught the team how to perform a nelson correctly.",
            "sent3": "The nelson move looked funny when the wrestler accidentally tickled his opponent.",
            "sent4": "The nelson was like a gentle hug, but with a lot more strength behind it.",
            "sent5": "The audience gasped as the wrestler locked in the nelson, showcasing his skill."
        },
        {
            "definition": "A wrestling hold in which one arm is passed under the opponent's arm from behind and the hand is applied to the neck or head.",
            "pos": "noun",
            "sent1": "In the wrestling competition, the nelson move was a favorite among the athletes.",
            "sent2": "The nelson is a common technique used in wrestling matches.",
            "sent3": "The nelson hold made the audience burst into laughter when the opponent's hat fell off.",
            "sent4": "The nelson was a powerful tool in the wrestler's arsenal, like a secret weapon.",
            "sent5": "With precision, the wrestler executed the nelson, securing his victory."
        },
        {
            "definition": "A wrestling hold in which one arm is passed under the opponent's arm from behind and the hand is applied to the neck or head.",
            "pos": "noun",
            "sent1": "During practice, the coach demonstrated the nelson on a training dummy.",
            "sent2": "The nelson can be a strategic move to gain control in a wrestling match.",
            "sent3": "The wrestler's nelson move made the opponent stumble and do a funny dance.",
            "sent4": "The nelson was a lightning-fast maneuver, catching the opponent off guard.",
            "sent5": "With determination, the wrestler locked in the nelson, aiming for victory."
        }
    ]
}