{
    "term": "nephrostomes",
    "meanings": [
        {
            "definition": "A tubular structure in the excretory system of certain invertebrates.",
            "pos": "noun",
            "sent1": "The nephrostomes help in removing waste from the bodies of some animals.",
            "sent2": "Scientists study the nephrostomes to understand how waste is filtered in invertebrates.",
            "sent3": "The nephrostomes in the tiny creatures were like little cleaning tubes.",
            "sent4": "The nephrostomes acted as tiny straws sucking out impurities from the body.",
            "sent5": "The nephrostomes were like tiny vacuum cleaners, keeping the invertebrates clean inside."
        },
        {
            "definition": "A small opening in the body wall of certain invertebrates for excretion.",
            "pos": "noun",
            "sent1": "The nephrostomes release waste out of the invertebrates' bodies.",
            "sent2": "Careful observation revealed the nephrostomes as the exit points for waste.",
            "sent3": "The nephrostomes were like little doors opening to let out the trash.",
            "sent4": "Waste found its way out through the nephrostomes like a secret escape route.",
            "sent5": "The nephrostomes were the invertebrates' tiny garbage chutes, keeping them clean."
        },
        {
            "definition": "A structure in the excretory system of some invertebrates that filters waste from the body cavity.",
            "pos": "noun",
            "sent1": "The nephrostomes act as filters, cleaning the invertebrates' insides.",
            "sent2": "The function of nephrostomes is to purify the body cavity of invertebrates.",
            "sent3": "The nephrostomes were like the body's own little waste management team.",
            "sent4": "Waste had to pass through the nephrostomes like a strict checkpoint.",
            "sent5": "The nephrostomes were the guardians of cleanliness inside the invertebrates."
        }
    ]
}