{
    "term": "nephelometrically",
    "meanings": [
        {
            "definition": "In a manner relating to nephelometry.",
            "pos": "adverb",
            "sent1": "She observed the cloudiness of the water nephelometrically.",
            "sent2": "The scientist measured the turbidity of the liquid nephelometrically.",
            "sent3": "The cat watched the fish tank nephelometrically, curious about the floating particles.",
            "sent4": "Her mind was nephelometrically clear, unaffected by the distractions around her.",
            "sent5": "The light shone nephelometrically through the fog, creating an ethereal glow."
        },
        {
            "definition": "Using nephelometry to measure turbidity.",
            "pos": "adjective",
            "sent1": "The nephelometrically measured turbidity levels helped in water quality assessment.",
            "sent2": "The nephelometrically analyzed data provided insights into the sediment content.",
            "sent3": "The nephelometrically determined results surprised the researchers with their accuracy.",
            "sent4": "The nephelometrically calculated values guided the decision-making process.",
            "sent5": "The nephelometrically assessed samples revealed the pollution levels in the river."
        },
        {
            "definition": "By means of nephelometry.",
            "pos": "adverb",
            "sent1": "The results were obtained nephelometrically, ensuring precision in the measurements.",
            "sent2": "She conducted the experiment nephelometrically to avoid errors in the readings.",
            "sent3": "The team worked nephelometrically to complete the analysis before the deadline.",
            "sent4": "He approached the problem nephelometrically, using the most advanced techniques available.",
            "sent5": "The data was collected nephelometrically, guaranteeing reliable and consistent results."
        }
    ]
}