{
    "term": "nerviest",
    "meanings": [
        {
            "definition": "Showing courage or confidence",
            "pos": "adjective",
            "sent1": "She was the nerviest student in the class, always raising her hand to answer questions.",
            "sent2": "The nerviest explorer ventured into the unknown jungle without hesitation.",
            "sent3": "Despite her small size, she was the nerviest player on the soccer field, fearlessly taking on opponents twice her size.",
            "sent4": "In the nerviest move of the game, he attempted a risky pass that led to a winning goal.",
            "sent5": "His nerviest decision was to speak up against injustice, even when others remained silent."
        },
        {
            "definition": "Bold or audacious",
            "pos": "adjective",
            "sent1": "The nerviest fashion designer showcased daring and unconventional designs on the runway.",
            "sent2": "It was the nerviest plan they had ever come up with, but it paid off in the end.",
            "sent3": "The nerviest squirrel in the park stole a whole bag of peanuts from a picnic blanket.",
            "sent4": "Her nerviest choice of colors for the painting created a striking and memorable piece of art.",
            "sent5": "The nerviest decision of his life was to quit his job and start his own business from scratch."
        },
        {
            "definition": "Having or showing strong nerves",
            "pos": "adjective",
            "sent1": "The nerviest surgeon remained calm and focused during the complex operation.",
            "sent2": "Despite the loud noises, the nerviest dog in the neighborhood never flinched during thunderstorms.",
            "sent3": "The nerviest firefighter rushed into the burning building to save a trapped kitten.",
            "sent4": "Her nerviest moment came when she had to speak in front of a large audience, but she did it with confidence.",
            "sent5": "The nerviest pilot landed the plane safely despite facing engine failure mid-flight."
        }
    ]
}