{
    "term": "nerves",
    "meanings": [
        {
            "definition": "The bundles of fibers that transmit impulses between the brain and other parts of the body.",
            "pos": "noun",
            "sent1": "The doctor explained how the nerves carry messages from the brain.",
            "sent2": "She felt a tingling sensation as the nerves in her hand started to heal.",
            "sent3": "The nerves in the electrical wires seemed to have a mind of their own, causing flickering lights.",
            "sent4": "His words struck a nerve, making her realize the truth of his statement.",
            "sent5": "The dancer moved with such precision, as if every nerve in her body was perfectly in tune."
        },
        {
            "definition": "The ability to face danger or fear without showing it.",
            "pos": "noun",
            "sent1": "Despite the danger, he showed incredible nerves and remained calm.",
            "sent2": "Her nerves of steel helped her navigate through the challenging situation.",
            "sent3": "The nerves of the superhero never failed, even in the face of the most menacing villains.",
            "sent4": "Facing the roaring crowd, the singer gathered her nerves and belted out a flawless performance.",
            "sent5": "The nerves of the firefighter were tested as he entered the burning building to save lives."
        },
        {
            "definition": "A state of nervousness or agitation.",
            "pos": "noun",
            "sent1": "Her nerves were on edge as she waited for the exam results.",
            "sent2": "He tried to calm his nerves before the important presentation.",
            "sent3": "The nerves of the cat were evident as it anxiously paced back and forth.",
            "sent4": "The nerves in the room were palpable as everyone awaited the announcement.",
            "sent5": "The nerves of the detective were heightened as he approached the suspect for questioning."
        }
    ]
}