{
    "term": "netts",
    "meanings": [
        {
            "definition": "A type of fabric made of knotted threads",
            "pos": "noun",
            "sent1": "The dress was made of soft netts that flowed gracefully.",
            "sent2": "She bought a scarf made of delicate netts to keep her warm.",
            "sent3": "The netts on the curtains got tangled with the breeze, making them dance.",
            "sent4": "The spider's web glistened in the sunlight, resembling intricate netts.",
            "sent5": "The fisherman repaired his netts before heading out to sea."
        },
        {
            "definition": "A structure made of ropes or wires used for catching fish or birds",
            "pos": "noun",
            "sent1": "The fisherman carefully inspected his netts for any holes.",
            "sent2": "The bird got caught in the netts while trying to escape.",
            "sent3": "The netts swayed gently in the wind, waiting for their next catch.",
            "sent4": "The netts were set up early in the morning to trap the fish.",
            "sent5": "The netts were woven with precision to ensure a successful catch."
        },
        {
            "definition": "To catch or entangle in a net",
            "pos": "verb",
            "sent1": "He tried to netts the butterfly gently without harming its wings.",
            "sent2": "The spider quickly netts its prey in a sticky web.",
            "sent3": "She managed to netts the ball before it rolled away.",
            "sent4": "The detective was determined to netts the criminal and solve the case.",
            "sent5": "The magician's trick was to netts the audience's attention with his illusions."
        },
        {
            "definition": "Remaining after all deductions have been made",
            "pos": "adjective",
            "sent1": "The netts profit from the business was lower than expected.",
            "sent2": "After paying all the bills, she was left with a netts amount of money.",
            "sent3": "The netts balance in the account was enough to cover the expenses.",
            "sent4": "The netts weight of the package was lighter than anticipated.",
            "sent5": "The netts time left before the deadline was running out."
        }
    ]
}