{
    "term": "neuroticism",
    "meanings": [
        {
            "definition": "Excessive or irrational anxiety or obsession",
            "pos": "noun",
            "sent1": "Her neuroticism about germs led her to wash her hands repeatedly.",
            "sent2": "His neuroticism about being late made him always arrive early.",
            "sent3": "Bob's neuroticism about his pet goldfish's happiness reached new levels when he bought it a tiny crown.",
            "sent4": "The neuroticism in her mind was a tangled web of worries, trapping her in fear.",
            "sent5": "The shadow of neuroticism followed her like a persistent ghost, whispering doubts in her ear."
        },
        {
            "definition": "The tendency to experience negative emotions such as anxiety, depression, or anger",
            "pos": "noun",
            "sent1": "His neuroticism often resulted in bouts of intense sadness.",
            "sent2": "The neuroticism in the room was palpable, everyone on edge.",
            "sent3": "The neuroticism in the air was so thick you could almost taste it.",
            "sent4": "The storm of neuroticism within him raged like a tempest, darkening his thoughts.",
            "sent5": "The weight of neuroticism pressed down on her like a heavy blanket, suffocating joy."
        },
        {
            "definition": "A personality trait characterized by emotional instability and a tendency to worry or be easily stressed",
            "pos": "noun",
            "sent1": "Her neuroticism made it hard for her to relax and enjoy the moment.",
            "sent2": "The neuroticism in his voice was evident as he fretted over every detail.",
            "sent3": "The neuroticism in his behavior was like a dance of nerves, never still.",
            "sent4": "The garden of neuroticism in her mind was overgrown with anxious thoughts.",
            "sent5": "The colors of neuroticism painted her world in shades of worry, never bright."
        }
    ]
}