{
    "term": "neutralised",
    "meanings": [
        {
            "definition": "Make (something) ineffective by applying an opposite force or effect.",
            "pos": "verb",
            "sent1": "The superhero neutralised the villain's powers with a special device.",
            "sent2": "The antivirus software neutralised the threat posed by the malicious program.",
            "sent3": "The magician neutralised the dangerous spell by casting a counter-charm.",
            "sent4": "The scientist neutralised the acidity of the solution with a base compound.",
            "sent5": "The firefighter neutralised the spreading flames with a blast of water."
        },
        {
            "definition": "Treat (a substance) so as to remove its toxic or harmful properties.",
            "pos": "verb",
            "sent1": "The water treatment plant neutralised the pollutants before releasing the water back into the river.",
            "sent2": "The antidote neutralised the venom of the snake bite, saving the hiker's life.",
            "sent3": "The chef neutralised the bitterness of the dish by adding a hint of sweetness.",
            "sent4": "The doctor neutralised the acidity in the patient's stomach with an alkaline solution.",
            "sent5": "The gardener neutralised the soil's high acidity by adding lime to balance it."
        },
        {
            "definition": "Make (someone) unable to act in a particular way.",
            "pos": "verb",
            "sent1": "The hypnotist neutralised the volunteer's ability to speak during the performance.",
            "sent2": "The security guard neutralised the intruder by swiftly disarming him.",
            "sent3": "The comedian neutralised the heckler's disruptive comments with a clever comeback.",
            "sent4": "The referee neutralised the player's aggressive behavior by issuing a warning.",
            "sent5": "The teacher neutralised the student's defiance by calmly addressing the issue."
        }
    ]
}