{
    "term": "nibbed",
    "meanings": [
        {
            "definition": "Having a pointed or beak-like tip",
            "pos": "adjective",
            "sent1": "The bird had a nibbed beak that helped it catch fish easily.",
            "sent2": "The nibbed edge of the leaf made it look sharp and dangerous.",
            "sent3": "The nibbed pencil tip looked like a tiny bird's beak ready to peck.",
            "sent4": "Her nibbed nails were compared to the sharp talons of an eagle.",
            "sent5": "The nibbed arrowhead was perfect for piercing through thick armor."
        },
        {
            "definition": "Marked with a small indentation or notch",
            "pos": "adjective",
            "sent1": "The nibbed coin had a small dent on its surface.",
            "sent2": "The nibbed table had scratches and marks from years of use.",
            "sent3": "The nibbed phone case had a unique pattern of small notches.",
            "sent4": "Her nibbed bracelet had tiny indentations that caught the light.",
            "sent5": "The nibbed rock had grooves worn into it by the river's flow."
        },
        {
            "definition": "To bite or gnaw gently",
            "pos": "verb",
            "sent1": "The puppy nibbed on the toy bone playfully.",
            "sent2": "She nibbed on the corner of her sandwich while thinking.",
            "sent3": "The squirrel nibbed on the acorn before hiding it away.",
            "sent4": "He nibbed at the cookie, savoring each small bite.",
            "sent5": "The rabbit nibbed the carrot with delight, enjoying its crunch."
        },
        {
            "definition": "To write or draw with a pen or pencil",
            "pos": "verb",
            "sent1": "She nibbed her signature at the bottom of the contract.",
            "sent2": "He nibbed a quick sketch of the landscape during his break.",
            "sent3": "The artist nibbed a small doodle on the corner of the canvas.",
            "sent4": "They nibbed their initials on the tree trunk as a sign of friendship.",
            "sent5": "The student nibbed down notes quickly during the lecture."
        }
    ]
}