{
    "term": "nibblies",
    "meanings": [
        {
            "definition": "Small snacks or appetizers",
            "pos": "noun",
            "sent1": "At the party, the table was filled with delicious nibblies like mini sandwiches and cheese cubes.",
            "sent2": "She enjoyed the variety of nibblies at the picnic, especially the crispy vegetable sticks.",
            "sent3": "The kids giggled as they snuck extra nibblies from the plate when no one was looking.",
            "sent4": "The nibblies on the platter were like a colorful mosaic of flavors waiting to be explored.",
            "sent5": "The aroma of the freshly baked nibblies filled the room, making everyone's mouths water."
        },
        {
            "definition": "The act of eating small amounts of food",
            "pos": "noun",
            "sent1": "Her nibblies during the movie consisted of popcorn and chocolate.",
            "sent2": "He preferred to have his nibblies slowly throughout the day rather than big meals.",
            "sent3": "She joked that her constant nibblies were preparing her for a food-eating contest.",
            "sent4": "The nibblies disappeared from the plate as quickly as the sun sets in the evening.",
            "sent5": "The sound of nibblies being munched on filled the room with a comforting rhythm."
        },
        {
            "definition": "A feeling of hunger or desire for snacks",
            "pos": "noun",
            "sent1": "After playing outside all day, the kids had the nibblies and raided the pantry.",
            "sent2": "The smell of freshly baked cookies gave her the nibblies even though she just had dinner.",
            "sent3": "His stomach growled loudly, signaling the arrival of the nibblies.",
            "sent4": "The sight of the colorful candy aisle at the store always triggered her nibblies.",
            "sent5": "The nibblies hit him hard when he saw the delicious pastries in the bakery window."
        }
    ]
}