{
    "term": "nibbles",
    "meanings": [
        {
            "definition": "Small bites of food",
            "pos": "noun",
            "sent1": "I love to have some nibbles like cheese and crackers for a snack.",
            "sent2": "The party table was filled with delicious nibbles for everyone to enjoy.",
            "sent3": "The tiny mouse took tiny nibbles of the cheese, trying not to get caught.",
            "sent4": "The squirrel's nibbles on the acorn left behind a trail of small crumbs.",
            "sent5": "The colorful plate of nibbles looked like a work of art."
        },
        {
            "definition": "To eat in small bites",
            "pos": "verb",
            "sent1": "She nibbles on her sandwich slowly to savor each bite.",
            "sent2": "The rabbit nibbles on the carrot in the garden.",
            "sent3": "The child nibbles on the chocolate bar, trying not to make a mess.",
            "sent4": "The caterpillar nibbles on the leaf, leaving a pattern of holes behind.",
            "sent5": "The bird nibbles on the seed with delicate precision."
        },
        {
            "definition": "To gently bite or chew on",
            "pos": "verb",
            "sent1": "The puppy nibbles on the toy to soothe its teething gums.",
            "sent2": "She nibbles on her pencil while deep in thought.",
            "sent3": "The kitten nibbles on the yarn, thinking it's a fun game.",
            "sent4": "He nibbles on his lower lip when he's nervous.",
            "sent5": "The goat nibbles on the grass in the meadow."
        },
        {
            "definition": "To show small signs of interest or affection",
            "pos": "verb",
            "sent1": "The toddler nibbles on his mother's hand to show his love.",
            "sent2": "The cat nibbles on its owner's fingers as a sign of affection.",
            "sent3": "The puppy nibbles on the shoelaces to get attention.",
            "sent4": "She nibbles on her friend's ear playfully during the conversation.",
            "sent5": "The bird nibbles on the sleeve to get noticed."
        }
    ]
}