{
    "term": "nickelodeons",
    "meanings": [
        {
            "definition": "A small, inexpensive restaurant or cafe.",
            "pos": "noun",
            "sent1": "We decided to grab a quick bite at the nickelodeons down the street.",
            "sent2": "The nickelodeons in the neighborhood are known for their delicious pastries.",
            "sent3": "At the nickelodeons, the tiny tables made us feel like giants!",
            "sent4": "The cozy atmosphere of the nickelodeons was a comforting escape from the bustling city.",
            "sent5": "The aroma of freshly brewed coffee filled the nickelodeons, inviting us in."
        },
        {
            "definition": "A type of early movie theater.",
            "pos": "noun",
            "sent1": "Back in the day, people flocked to the nickelodeons to watch silent films.",
            "sent2": "The nickelodeons were a popular entertainment choice for families in the early 1900s.",
            "sent3": "The nickelodeons showcased black-and-white classics that still captivate audiences today.",
            "sent4": "In the nickelodeons, the flickering images on the screen transported viewers to different worlds.",
            "sent5": "The nickelodeons were filled with laughter and excitement as moviegoers enjoyed the latest films."
        },
        {
            "definition": "A jukebox or other type of coin-operated music player.",
            "pos": "noun",
            "sent1": "The nostalgic diner had a nickelodeons that played old tunes for the customers.",
            "sent2": "The nickelodeons in the corner of the room added a retro vibe to the bar.",
            "sent3": "When the nickelodeons started playing, everyone in the room tapped their feet to the beat.",
            "sent4": "The sound of the nickelodeons filled the air, creating a lively atmosphere in the pub.",
            "sent5": "The vintage nickelodeons was a hit among patrons who enjoyed a musical trip down memory lane."
        }
    ]
}