{
    "term": "nied",
    "meanings": [
        {
            "definition": "To refuse or deny oneself something",
            "pos": "verb",
            "sent1": "She nied herself dessert to stay healthy.",
            "sent2": "He always nies himself the pleasure of watching TV.",
            "sent3": "The cat nied itself the temptation of chasing the mouse.",
            "sent4": "The tree nied itself the luxury of blooming in winter.",
            "sent5": "The student nied himself distractions to focus on studying."
        },
        {
            "definition": "To refuse to do something",
            "pos": "verb",
            "sent1": "They nied to attend the party due to prior commitments.",
            "sent2": "She always nies to eat vegetables because she dislikes them.",
            "sent3": "The dog nied to fetch the ball and instead rolled in the grass.",
            "sent4": "The river nied to flow backwards against its natural course.",
            "sent5": "He nies to take shortcuts and always follows the rules."
        },
        {
            "definition": "To refuse to accept or believe",
            "pos": "verb",
            "sent1": "He nied the idea that aliens exist.",
            "sent2": "She always nies rumors without proper evidence.",
            "sent3": "The child nied the fact that Santa Claus is not real.",
            "sent4": "The scientist nies the theory of time travel as impossible.",
            "sent5": "They nies superstitions and rely on logic and reason."
        },
        {
            "definition": "To refuse to give or grant",
            "pos": "verb",
            "sent1": "The king nied the request for a pardon.",
            "sent2": "She nies permission for her children to play outside after dark.",
            "sent3": "The landlord nied the tenant's request for a pet in the apartment.",
            "sent4": "The company nies extra vacation days to employees during busy seasons.",
            "sent5": "He nies access to his personal diary to anyone else."
        }
    ]
}