{
    "term": "niggling",
    "meanings": [
        {
            "definition": "causing slight but persistent annoyance, discomfort, or anxiety",
            "pos": "adjective",
            "sent1": "The niggling pain in his back made it hard for him to sit comfortably.",
            "sent2": "She couldn't focus on her work due to the niggling worry about her upcoming presentation.",
            "sent3": "The niggling sound of a dripping tap in the quiet room was oddly amusing.",
            "sent4": "The niggling feeling of unease crept into her mind like a shadow in the night.",
            "sent5": "The niggling itch on his arm seemed to grow stronger with each passing minute."
        },
        {
            "definition": "to spend too much time and effort on minor details",
            "pos": "verb",
            "sent1": "He tends to niggling over every little decision, making the process longer than necessary.",
            "sent2": "Stop niggling and just pick a color for the walls already!",
            "sent3": "She niggled over the menu options for so long that her friends started teasing her.",
            "sent4": "Her perfectionism led her to niggling over the font size on the presentation slides.",
            "sent5": "The designer niggled over the placement of each element on the webpage, delaying the launch."
        },
        {
            "definition": "a small or insignificant amount",
            "pos": "noun",
            "sent1": "He only had a niggling of interest in the topic, not enough to pursue it further.",
            "sent2": "She felt a niggling of doubt about the accuracy of the information provided.",
            "sent3": "The niggling of spare change in his pocket was just enough for a cup of coffee.",
            "sent4": "A niggling of hope flickered in her heart despite the challenging circumstances.",
            "sent5": "The niggling of dust on the shelf caught her attention, prompting her to clean it immediately."
        }
    ]
}