{
    "term": "nimbus",
    "meanings": [
        {
            "definition": "A luminous cloud or a halo surrounding a supernatural being or a saint.",
            "pos": "noun",
            "sent1": "The nimbus around the angel glowed softly.",
            "sent2": "The nimbus above the saint's head shone brightly in the painting.",
            "sent3": "The nimbus seemed to follow the ghostly figure wherever it went.",
            "sent4": "Her kindness created a nimbus of positivity around her.",
            "sent5": "The nimbus of light around the fairy made her look even more magical."
        },
        {
            "definition": "A rain cloud.",
            "pos": "noun",
            "sent1": "The nimbus in the sky signaled an approaching storm.",
            "sent2": "Dark nimbus clouds gathered ominously overhead.",
            "sent3": "The nimbus decided to take a break from raining today.",
            "sent4": "The nimbus loomed like a giant shadow over the town.",
            "sent5": "The nimbus released its watery load, drenching everything below."
        },
        {
            "definition": "A bright cloud surrounding a deity when on earth.",
            "pos": "noun",
            "sent1": "The nimbus enveloped the god, making him appear even more divine.",
            "sent2": "The nimbus around the goddess glowed with a heavenly light.",
            "sent3": "The nimbus accidentally bumped into a mortal and apologized profusely.",
            "sent4": "The nimbus around the deity was like a beacon of hope for the people.",
            "sent5": "The nimbus around the deity seemed to radiate warmth and comfort."
        },
        {
            "definition": "A rain cloud.",
            "pos": "noun",
            "sent1": "The nimbus darkened the sky, foretelling a heavy downpour.",
            "sent2": "The nimbus released its rain in a gentle drizzle.",
            "sent3": "The nimbus cloud decided to play hide and seek with the sun.",
            "sent4": "The nimbus floated lazily across the horizon, carrying its payload of rain.",
            "sent5": "The nimbus burst open, showering the parched land with much-needed water."
        }
    ]
}