{
    "term": "nimbuses",
    "meanings": [
        {
            "definition": "A luminous cloud or a halo surrounding a supernatural being or a saint.",
            "pos": "noun",
            "sent1": "In the story, the angel was depicted with glowing nimbuses around its head.",
            "sent2": "The painting of the saint showed nimbuses shining brightly above his head.",
            "sent3": "The children imagined themselves with nimbuses around their heads, pretending to be magical beings.",
            "sent4": "Her kindness seemed to create a warm nimbus around her, making everyone feel at ease.",
            "sent5": "The nimbuses in the sky looked like golden halos, adding a mystical touch to the landscape."
        },
        {
            "definition": "A radiant light that appears around a person's head or body.",
            "pos": "noun",
            "sent1": "The photograph captured a beautiful nimbus of light surrounding the bride.",
            "sent2": "The artist painted the nimbus around the hero's head to symbolize his purity.",
            "sent3": "The nimbus around the cat's head in the photo made it look like a tiny angel.",
            "sent4": "Her laughter created a nimbus of joy that brightened up the room.",
            "sent5": "The nimbus of light around the tree in the painting gave it a magical aura."
        },
        {
            "definition": "A type of cloud that is characterized by a dark gray color and a ragged appearance.",
            "pos": "noun",
            "sent1": "The stormy nimbus in the sky signaled the approaching bad weather.",
            "sent2": "The nimbus hanging low over the city brought heavy rain and thunder.",
            "sent3": "The nimbus cloud looked like a giant monster ready to swallow the town.",
            "sent4": "The nimbus above the mountain seemed to brood ominously, casting a shadow over the valley.",
            "sent5": "The nimbus rolling in from the sea darkened the sky, creating a sense of foreboding."
        }
    ]
}