{
    "term": "nine",
    "meanings": [
        {
            "definition": "The number equivalent to the sum of one and eight.",
            "pos": "noun",
            "sent1": "I have nine fingers on my hands.",
            "sent2": "There are nine planets in our solar system.",
            "sent3": "Why did the cat bring me nine mice as a gift?",
            "sent4": "Her smile lit up the room like a bouquet of nine sunflowers.",
            "sent5": "The teacher asked us to count to nine in Spanish."
        },
        {
            "definition": "A set or group of nine people or things.",
            "pos": "noun",
            "sent1": "We need nine chairs for the meeting.",
            "sent2": "There were nine puppies in the litter.",
            "sent3": "The nine ducks waddled in a line behind their mother.",
            "sent4": "The team of nine players celebrated their victory.",
            "sent5": "She received a bouquet of nine roses on her birthday."
        },
        {
            "definition": "A playing card with nine pips.",
            "pos": "noun",
            "sent1": "In the game, the nine of hearts is a lucky card.",
            "sent2": "He drew the nine from the deck and placed it on the table.",
            "sent3": "The magician pulled out a giant nine of clubs from his hat.",
            "sent4": "The nine on the card seemed to glow with a mysterious light.",
            "sent5": "She won the round with a well-played nine of diamonds."
        },
        {
            "definition": "A size or measurement that is nine units long or wide.",
            "pos": "noun",
            "sent1": "The table was nine feet long.",
            "sent2": "She bought a rug that was nine inches wide.",
            "sent3": "The box was exactly nine centimeters tall.",
            "sent4": "The hallway stretched out for nine meters.",
            "sent5": "The garden fence was painted in nine different colors."
        }
    ]
}