{
    "term": "nip",
    "meanings": [
        {
            "definition": "A small bite or pinch",
            "pos": "noun",
            "sent1": "The kitten gave a gentle nip to my finger while playing.",
            "sent2": "I felt a quick nip on my arm from the crab at the beach.",
            "sent3": "The mischievous elf gave a playful nip to Santa's cookie.",
            "sent4": "The cold wind felt like a sharp nip on my cheeks.",
            "sent5": "The mosquito's nip left an itchy bump on my skin."
        },
        {
            "definition": "To bite or pinch quickly",
            "pos": "verb",
            "sent1": "The puppy likes to nip at my shoelaces during walks.",
            "sent2": "Be careful, some fish in the pond may nip your fingers.",
            "sent3": "I had to nip the thread with my teeth as I couldn't find scissors.",
            "sent4": "Her words seemed to nip at his heart, leaving him hurt.",
            "sent5": "The cold weather made the wind nip at our faces."
        },
        {
            "definition": "To cut off the tip of something",
            "pos": "verb",
            "sent1": "She had to nip the flower stems to fit them in the vase.",
            "sent2": "The tailor had to nip the fabric to make it fit perfectly.",
            "sent3": "I accidentally nipped the corner of the paper while cutting.",
            "sent4": "The chef had to nip the excess dough to make the perfect shape.",
            "sent5": "The gardener needed to nip the bushes to keep them neat."
        },
        {
            "definition": "To move quickly or sharply",
            "pos": "verb",
            "sent1": "The rabbit can nip across the field in seconds.",
            "sent2": "The squirrel can nip up the tree with ease.",
            "sent3": "I had to nip out for a quick errand before the meeting.",
            "sent4": "The sports car can nip through traffic effortlessly.",
            "sent5": "The wind can nip through the trees on a stormy night."
        }
    ]
}