{
    "term": "nipa",
    "meanings": [
        {
            "definition": "A type of palm tree native to Southeast Asia.",
            "pos": "noun",
            "sent1": "The nipa swayed gently in the breeze.",
            "sent2": "The nipa palm provided shade for the villagers.",
            "sent3": "The monkeys played hide-and-seek among the nipa trees.",
            "sent4": "The nipa trees stood tall like guardians of the forest.",
            "sent5": "The rustling of the nipa leaves created a soothing melody."
        },
        {
            "definition": "A thatched roof made from the leaves of the nipa palm.",
            "pos": "noun",
            "sent1": "The house had a sturdy nipa roof.",
            "sent2": "The nipa thatch protected the family from the rain.",
            "sent3": "The mischievous cat climbed onto the nipa roof and got stuck.",
            "sent4": "The nipa thatch glistened in the sunlight like a golden crown.",
            "sent5": "The scent of the nipa leaves wafted through the air after the rain."
        },
        {
            "definition": "To pinch or bite quickly.",
            "pos": "verb",
            "sent1": "Be careful, the crab might nipa your finger!",
            "sent2": "The toddler tried to nipa his brother during playtime.",
            "sent3": "The mischievous puppy loved to nipa at shoelaces.",
            "sent4": "Her sharp wit could nipa at your pride if you weren't careful.",
            "sent5": "The mosquito seemed to nipa at my skin all night long."
        },
        {
            "definition": "To move quickly or suddenly.",
            "pos": "verb",
            "sent1": "The cat can nipa across the room in a flash.",
            "sent2": "The squirrel nipa'd up the tree to escape the dog.",
            "sent3": "The magician made the coin nipa from hand to hand.",
            "sent4": "Time seemed to nipa away as they enjoyed the day together.",
            "sent5": "The car nipa'd past us on the highway, leaving a trail of dust."
        }
    ]
}