{
    "term": "nisus",
    "meanings": [
        {
            "definition": "A strong or urgent desire or impulse to strive or achieve something.",
            "pos": "noun",
            "sent1": "Her nisus to succeed in school was evident in her dedication to studying every night.",
            "sent2": "The athlete's nisus to win the race was fueled by his competitive spirit.",
            "sent3": "Despite his small size, the squirrel's nisus to reach the bird feeder led to some acrobatic attempts.",
            "sent4": "The nisus of the seed to grow into a mighty tree is a symbol of resilience in nature.",
            "sent5": "The student's nisus for knowledge was like a flame that could not be extinguished."
        },
        {
            "definition": "The effort or endeavor to attain a goal.",
            "pos": "noun",
            "sent1": "With great nisus, she worked tirelessly towards achieving her dream of becoming a doctor.",
            "sent2": "The team's collective nisus to win the championship was evident in their intense training sessions.",
            "sent3": "The puppy's nisus to catch its tail provided endless entertainment for the family.",
            "sent4": "The nisus of the river to carve through the mountains over centuries is a testament to its power.",
            "sent5": "The artist's nisus to create a masterpiece was fueled by passion and dedication."
        },
        {
            "definition": "The act of striving or exerting oneself.",
            "pos": "noun",
            "sent1": "His nisus during the marathon was visible in the sweat dripping down his face.",
            "sent2": "The student's nisus in completing the challenging assignment paid off with a top grade.",
            "sent3": "The toddler's nisus to climb the stairs on his own was met with cheers and applause.",
            "sent4": "The nisus of the wind to sway the trees created a mesmerizing dance in the forest.",
            "sent5": "The explorer's nisus to reach the summit of the mountain was fueled by determination and courage."
        }
    ]
}