{
    "term": "nitro",
    "meanings": [
        {
            "definition": "A prefix meaning relating to nitrogen",
            "pos": "noun",
            "sent1": "The scientist explained that the word 'nitrogen' comes from the prefix 'nitro'.",
            "sent2": "In chemistry class, we learned about the element nitrogen and its connection to the prefix 'nitro'.",
            "sent3": "When the teacher said 'nitro' was a prefix, the students imagined tiny nitrogen particles dancing around words.",
            "sent4": "The prefix 'nitro' is like a secret code that unlocks the nitrogen-related meanings of words.",
            "sent5": "The prefix 'nitro' is like a magic wand that sprinkles nitrogen-related powers onto words."
        },
        {
            "definition": "A type of explosive or propellant containing nitroglycerin",
            "pos": "noun",
            "sent1": "The soldiers carefully handled the nitro to avoid any accidents.",
            "sent2": "The demolition expert used nitro to safely bring down the old building.",
            "sent3": "The cartoon character mistakenly used nitro to blow up a birthday cake instead of candles.",
            "sent4": "The nitro in the action movie exploded with a deafening roar.",
            "sent5": "The nitro in the fireworks display lit up the night sky with brilliant colors."
        },
        {
            "definition": "A type of beer or coffee infused with nitrogen gas for a creamy texture",
            "pos": "noun",
            "sent1": "At the café, I ordered a nitro coffee for a smooth and creamy pick-me-up.",
            "sent2": "The bartender poured a nitro beer from the tap, creating a cascading effect.",
            "sent3": "The comedian joked that nitro drinks were like having a tiny barista in your cup.",
            "sent4": "The nitro-infused coffee was as smooth as silk on my taste buds.",
            "sent5": "The nitro beer poured like a cascading waterfall, delighting the customers."
        }
    ]
}