{
    "term": "nobbling",
    "meanings": [
        {
            "definition": "To disable or sabotage (someone or something)",
            "pos": "verb",
            "sent1": "The mischievous gnome was nobbling the garden gate, making it impossible to open.",
            "sent2": "The villain was caught nobbling the hero's car, causing it to break down on the highway.",
            "sent3": "The naughty squirrel was nobbling the bird feeder, preventing the birds from getting their seeds.",
            "sent4": "The hacker was nobbling the company's website, causing chaos for the users.",
            "sent5": "The gremlins were nobbling the machinery, leading to a series of malfunctions."
        },
        {
            "definition": "To bribe or corrupt (someone)",
            "pos": "verb",
            "sent1": "The shady businessman tried nobbling the politician with a briefcase full of cash.",
            "sent2": "The crime boss nobbled the witness to ensure they wouldn't testify in court.",
            "sent3": "The sneaky cat nobbled the dog with a treat, distracting it from chasing the squirrel.",
            "sent4": "The evil sorcerer nobbled the knight, turning him against his own kingdom.",
            "sent5": "The cunning fox nobbled the guard, allowing the other animals to sneak past."
        },
        {
            "definition": "To manipulate or influence (a situation) in a dishonest way",
            "pos": "verb",
            "sent1": "The con artist was nobbling the outcome of the game by cheating.",
            "sent2": "The spy nobbled the election by spreading false information about the candidates.",
            "sent3": "The trickster nobbled the magic show by secretly switching the props.",
            "sent4": "The scheming villain nobbled the negotiations, causing the deal to fall through.",
            "sent5": "The devious mastermind nobbled the competition, ensuring their own success."
        }
    ]
}