{
    "term": "node",
    "meanings": [
        {
            "definition": "A point at which lines or pathways intersect or branch off.",
            "pos": "noun",
            "sent1": "The map showed a node where the roads crossed.",
            "sent2": "The computer network had a central node for all data traffic.",
            "sent3": "The node in the maze was where all the paths met, making it easy to get lost.",
            "sent4": "Her house was a node of activity, with friends coming and going all day.",
            "sent5": "The node in the river where the currents converged created a whirlpool."
        },
        {
            "definition": "A central point or connection in a network.",
            "pos": "noun",
            "sent1": "The main server acted as the central node for the entire network.",
            "sent2": "The node of the internet connection was crucial for everyone to stay online.",
            "sent3": "The node of the social network was always buzzing with updates and messages.",
            "sent4": "Her laughter served as a node of joy that spread to everyone around her.",
            "sent5": "The node of the city's transportation system was the bustling train station."
        },
        {
            "definition": "A swelling or knob on a plant stem where leaves or branches originate.",
            "pos": "noun",
            "sent1": "The rose bush had a node where a new branch was starting to grow.",
            "sent2": "The gardener pruned the plant at the node to encourage new growth.",
            "sent3": "The node on the tree looked like a tiny green bump waiting to bloom.",
            "sent4": "The node on the vine was like a tiny bud of potential waiting to unfurl.",
            "sent5": "The node on the stem was where the plant's energy was focused for growth."
        },
        {
            "definition": "A small, rounded mass of tissue in the body.",
            "pos": "noun",
            "sent1": "The doctor felt a node in her neck and ordered further tests.",
            "sent2": "The lymph node was swollen due to the body fighting an infection.",
            "sent3": "The node in his arm felt like a small pea under the skin.",
            "sent4": "The node in her leg was a reminder of the injury she had sustained.",
            "sent5": "The node in his chest was a concern that needed to be monitored closely."
        }
    ]
}