{
    "term": "noh",
    "meanings": [
        {
            "definition": "A traditional Japanese form of theater involving music, dance, and drama.",
            "pos": "noun",
            "sent1": "The noh performance was filled with beautiful music and graceful dance.",
            "sent2": "She attended a noh play with her family during their visit to Japan.",
            "sent3": "The noh actors wore elaborate costumes that made them look like ancient warriors.",
            "sent4": "The noh stage seemed like a magical realm where stories came to life.",
            "sent5": "The haunting melodies of the noh flute lingered in the air long after the performance ended."
        },
        {
            "definition": "A type of classical Japanese musical drama.",
            "pos": "noun",
            "sent1": "The noh performance captivated the audience with its traditional music and storytelling.",
            "sent2": "He studied the history of noh theater as part of his research project.",
            "sent3": "The noh actors' movements were so precise, it was like watching a living painting.",
            "sent4": "The noh masks added an air of mystery and intrigue to the performance.",
            "sent5": "The noh drumbeats echoed through the theater, setting the rhythm for the entire play."
        },
        {
            "definition": "A type of Japanese theater that combines drama, music, and dance.",
            "pos": "noun",
            "sent1": "The noh play told a poignant story through a blend of music, dance, and acting.",
            "sent2": "She was mesmerized by the elegance and grace of the noh performers.",
            "sent3": "The noh theater was a feast for the senses, with its vibrant colors and enchanting melodies.",
            "sent4": "The noh performance transported the audience to a different era with its timeless themes.",
            "sent5": "The noh actors moved in perfect harmony, creating a mesmerizing spectacle on stage."
        }
    ]
}