{
    "term": "nonactive",
    "meanings": [
        {
            "definition": "Not engaging in physical activity.",
            "pos": "adjective",
            "sent1": "The cat is nonactive during the day, preferring to nap in the sun.",
            "sent2": "She felt nonactive after a long day at work and just wanted to relax on the couch.",
            "sent3": "The nonactive squirrel decided to take a break from gathering nuts and watch the other animals play.",
            "sent4": "The nonactive volcano seemed peaceful, but deep down, it was ready to erupt at any moment.",
            "sent5": "The nonactive bear in the zoo looked content lounging in the shade."
        },
        {
            "definition": "Not currently in use or operation.",
            "pos": "adjective",
            "sent1": "The nonactive computer had been sitting in the corner for months without being turned on.",
            "sent2": "The old factory had many nonactive machines that were once used for production.",
            "sent3": "The nonactive phone buzzed with notifications, but its screen remained dark and silent.",
            "sent4": "The nonactive fountain in the park was a reminder of better days when it used to flow with water.",
            "sent5": "The nonactive car in the garage needed a jump start to get back on the road."
        },
        {
            "definition": "Not participating or involved in a particular activity.",
            "pos": "adjective",
            "sent1": "The nonactive student sat quietly at the back of the class, not raising a hand to answer questions.",
            "sent2": "The nonactive member of the team rarely contributed to group projects.",
            "sent3": "The nonactive audience member yawned and checked their phone during the entire performance.",
            "sent4": "The nonactive player on the bench watched the game unfold without joining in the action.",
            "sent5": "The nonactive volunteer didn't show up for the event, leaving the organizers short-handed."
        }
    ]
}