{
    "term": "nonearnings",
    "meanings": [
        {
            "definition": "The amount of money earned from work or investments.",
            "pos": "noun",
            "sent1": "Her nonearnings from the part-time job helped her save for a new bike.",
            "sent2": "His nonearnings increased significantly after he started investing in the stock market.",
            "sent3": "The squirrel's nonearnings from collecting acorns were not enough to buy a cozy nest.",
            "sent4": "The nonearnings from her lemonade stand were like drops in a bucket compared to her father's salary.",
            "sent5": "The nonearnings from the bake sale were enough to cover the cost of ingredients and a little extra."
        },
        {
            "definition": "The act of not earning any income.",
            "pos": "noun",
            "sent1": "During the pandemic, many experienced nonearnings due to job losses.",
            "sent2": "She felt discouraged by the constant nonearnings despite her efforts to find a job.",
            "sent3": "The magician's nonearnings were a result of his disappearing act gone wrong.",
            "sent4": "The nonearnings from the charity event were unexpected but still impactful.",
            "sent5": "His nonearnings during the strike made him appreciate the value of hard work."
        },
        {
            "definition": "A lack of earnings or profits.",
            "pos": "noun",
            "sent1": "The company faced nonearnings for the third consecutive quarter.",
            "sent2": "The farmer struggled with nonearnings due to a poor harvest season.",
            "sent3": "The detective's nonearnings in solving the case led to a surprising twist.",
            "sent4": "The artist's nonearnings were a stark contrast to the success of his previous exhibitions.",
            "sent5": "The nonearnings in the small business were a temporary setback before a successful comeback."
        }
    ]
}