{
    "term": "nonleguminous",
    "meanings": [
        {
            "definition": "Not belonging to the legume family of plants.",
            "pos": "adjective",
            "sent1": "The farmer planted a variety of nonleguminous crops in the field.",
            "sent2": "The salad was nonleguminous, as it did not have any beans or peas.",
            "sent3": "The nonleguminous garden seemed to be in a competition with the neighboring legume patch.",
            "sent4": "Her nonleguminous personality stood out in a crowd of extroverted legume enthusiasts.",
            "sent5": "The nonleguminous trees swayed gently in the breeze, distinct from the legume plants nearby."
        },
        {
            "definition": "Not containing legumes.",
            "pos": "adjective",
            "sent1": "The soup was deliciously nonleguminous, perfect for those with bean allergies.",
            "sent2": "The bakery offered a variety of nonleguminous pastries for customers with dietary restrictions.",
            "sent3": "The nonleguminous stew surprised everyone with its rich flavor despite the absence of beans.",
            "sent4": "Her nonleguminous diet made her stand out among her legume-loving friends.",
            "sent5": "The nonleguminous dish was a hit at the potluck, pleasing even the legume enthusiasts."
        },
        {
            "definition": "Not related to legumes.",
            "pos": "adjective",
            "sent1": "The nonleguminous plant had vibrant flowers that attracted butterflies.",
            "sent2": "The nonleguminous soil was perfect for growing a variety of vegetables.",
            "sent3": "The nonleguminous conversation at the dinner table veered towards gardening tips.",
            "sent4": "Her nonleguminous interests included painting and hiking, far from the world of legumes.",
            "sent5": "The nonleguminous landscape was a refreshing change from the usual legume fields."
        }
    ]
}