{
    "term": "nonmarket",
    "meanings": [
        {
            "definition": "Not involving or related to the buying and selling of goods or services.",
            "pos": "adjective",
            "sent1": "The community center provides nonmarket services to residents for free.",
            "sent2": "Her artwork is a nonmarket product, created purely for personal enjoyment.",
            "sent3": "The nonmarket approach to friendship is simply caring for each other without expecting anything in return.",
            "sent4": "His nonmarket attitude towards life's challenges is refreshing, focusing on personal growth rather than competition.",
            "sent5": "The nonmarket relationship between the siblings was built on love and support, not transactions."
        },
        {
            "definition": "Not determined by or based on market forces.",
            "pos": "adjective",
            "sent1": "The decision to volunteer was a nonmarket choice, driven by compassion.",
            "sent2": "In a nonmarket economy, resources are allocated based on need rather than profit.",
            "sent3": "The nonmarket decision to adopt a pet brought joy and companionship to the family.",
            "sent4": "Her nonmarket perspective on success focused on personal fulfillment rather than external validation.",
            "sent5": "The nonmarket approach to education prioritizes learning for the sake of knowledge, not monetary gain."
        },
        {
            "definition": "Not available for purchase or sale in the marketplace.",
            "pos": "adjective",
            "sent1": "The antique vase was a nonmarket item, passed down through generations.",
            "sent2": "The rare flower species is nonmarket, existing only in remote forests.",
            "sent3": "The nonmarket treasure hidden in the attic turned out to be a valuable family heirloom.",
            "sent4": "His nonmarket collection of seashells held sentimental value beyond any price.",
            "sent5": "The nonmarket gemstone found in the riverbed was a unique natural wonder."
        }
    ]
}