{
    "term": "nonresistance",
    "meanings": [
        {
            "definition": "The act or practice of not resisting or fighting back.",
            "pos": "noun",
            "sent1": "Her nonresistance to the bully's taunts only encouraged more teasing.",
            "sent2": "The philosophy of nonresistance promotes peace and understanding.",
            "sent3": "The kitten's nonresistance to the playful puppy led to a fun game of chase.",
            "sent4": "In a world full of conflict, her nonresistance stood out like a beacon of hope.",
            "sent5": "The image of Gandhi's nonresistance in the face of adversity is truly inspiring."
        },
        {
            "definition": "The state of being passive or submissive in the face of opposition.",
            "pos": "noun",
            "sent1": "His nonresistance to authority often resulted in him being taken advantage of.",
            "sent2": "The nonresistance of the captured soldier surprised the enemy.",
            "sent3": "The nonresistance of the river to the rocks in its path created a peaceful flow.",
            "sent4": "She felt like a leaf in the wind, embracing nonresistance to the changing currents.",
            "sent5": "The nonresistance of the clouds to the wind's direction painted a serene sky."
        },
        {
            "definition": "A refusal to use force or violence in response to aggression.",
            "pos": "noun",
            "sent1": "The nonresistance of the pacifist was seen as a powerful form of protest.",
            "sent2": "Choosing nonresistance over retaliation requires great inner strength.",
            "sent3": "The nonresistance of the flower to the bee's pollination efforts was essential for reproduction.",
            "sent4": "His nonresistance to the temptation of anger showed his true character.",
            "sent5": "The nonresistance of the sand to the waves sculpted beautiful patterns on the shore."
        }
    ]
}