{
    "term": "norma",
    "meanings": [
        {
            "definition": "A standard or pattern",
            "pos": "noun",
            "sent1": "Following the norma in our community means being kind to others.",
            "sent2": "It is important to have a norma to guide our behavior.",
            "sent3": "When everyone follows the norma, things run smoothly.",
            "sent4": "The norma of honesty should be upheld in all situations.",
            "sent5": "The norma of respect should be practiced by everyone."
        },
        {
            "definition": "A principle of right action",
            "pos": "noun",
            "sent1": "Kindness is a norma that we should always strive to follow.",
            "sent2": "The norma of honesty is essential in building trust.",
            "sent3": "Following the norma of fairness leads to positive outcomes.",
            "sent4": "The norma of integrity should never be compromised.",
            "sent5": "The norma of compassion can make a big difference in someone's day."
        },
        {
            "definition": "A rule or guideline",
            "pos": "noun",
            "sent1": "The norma in our classroom is to raise your hand before speaking.",
            "sent2": "It's important to follow the norma of safety at all times.",
            "sent3": "Breaking the norma of waiting in line can cause chaos.",
            "sent4": "The norma of punctuality helps things run smoothly.",
            "sent5": "Following the norma of respect creates a positive environment."
        },
        {
            "definition": "A typical or average level",
            "pos": "noun",
            "sent1": "His performance was below the norma for this class.",
            "sent2": "The team's score was above the norma for this competition.",
            "sent3": "She always goes beyond the norma in her work.",
            "sent4": "The quality of this product is below the norma we expect.",
            "sent5": "Striving to exceed the norma can lead to great achievements."
        }
    ]
}