{
    "term": "nosiest",
    "meanings": [
        {
            "definition": "Showing too much curiosity about other people's affairs",
            "pos": "adjective",
            "sent1": "She is the nosiest person in our neighborhood, always asking about everyone's business.",
            "sent2": "My nosiest neighbor always peeks through the curtains to see what's happening outside.",
            "sent3": "The nosiest squirrel in the park kept trying to eavesdrop on the birds' conversations.",
            "sent4": "Her nosiest nature was like a magnifying glass, amplifying every detail of others' lives.",
            "sent5": "The nosiest cat in the house would sit by the window, observing the neighbors with intense interest."
        },
        {
            "definition": "Having a tendency to snoop or pry into others' business",
            "pos": "adjective",
            "sent1": "He is the nosiest student in class, always trying to read other people's notes.",
            "sent2": "The nosiest coworker is constantly listening in on private conversations.",
            "sent3": "The nosiest dog in the park kept digging up buried secrets.",
            "sent4": "Her nosiest behavior was like a detective, uncovering hidden information.",
            "sent5": "The nosiest journalist in town never missed a chance to investigate a juicy story."
        },
        {
            "definition": "Being excessively interested in the affairs of others",
            "pos": "adjective",
            "sent1": "She is the nosiest aunt, always wanting to know every detail of our lives.",
            "sent2": "The nosiest friend can't resist asking personal questions about everyone.",
            "sent3": "The nosiest parrot in the pet store repeated all the gossip it overheard.",
            "sent4": "His nosiest habit was like a magnet, attracting all the latest news to him.",
            "sent5": "The nosiest neighbor on the block knew more about everyone than they knew about themselves."
        }
    ]
}