{
    "term": "nosy",
    "meanings": [
        {
            "definition": "prying or inquisitive about the affairs of others",
            "pos": "adjective",
            "sent1": "The nosy neighbor always peeked through her curtains to see what was happening outside.",
            "sent2": "It's not polite to be nosy and ask too many personal questions.",
            "sent3": "The nosy squirrel kept watching the birds in the garden, hoping to learn their secrets.",
            "sent4": "Her nosy nature was like a magnifying glass, zooming in on everyone's business.",
            "sent5": "The nosy detective solved the mystery by asking too many questions."
        },
        {
            "definition": "showing too much curiosity about other people's affairs",
            "pos": "adjective",
            "sent1": "She was nosy and always wanted to know what others were up to.",
            "sent2": "The children were being nosy when they eavesdropped on the adults' conversation.",
            "sent3": "The nosy cat followed the guests around the house, trying to uncover their secrets.",
            "sent4": "His nosy behavior was like a bright spotlight shining on everyone's private matters.",
            "sent5": "The nosy reporter dug deep into the celebrity's personal life for a juicy story."
        },
        {
            "definition": "unduly curious about the affairs of others",
            "pos": "adjective",
            "sent1": "Being nosy can sometimes lead to misunderstandings and hurt feelings.",
            "sent2": "She was considered nosy because she always wanted to know everything about everyone.",
            "sent3": "The nosy puppy kept sniffing around the room, searching for hidden treasures.",
            "sent4": "His nosy attitude was like a loud alarm clock, waking everyone up to his prying ways.",
            "sent5": "The nosy student peeked over his classmate's shoulder to see the answers."
        }
    ]
}