{
    "term": "notched",
    "meanings": [
        {
            "definition": "Having a V-shaped cut or indentation",
            "pos": "adjective",
            "sent1": "The tree had a notched trunk from where the branch had been removed.",
            "sent2": "The old wooden fence had a notched design along the top.",
            "sent3": "The notched edge of the paper made it look like a tiny staircase.",
            "sent4": "Her notched smile revealed a mischievous secret.",
            "sent5": "The notched pattern on the fabric resembled a row of tiny teeth."
        },
        {
            "definition": "Marked with a series of small cuts or indentations",
            "pos": "adjective",
            "sent1": "The notched blade of the knife made slicing through the bread easier.",
            "sent2": "The ancient stone tablet was covered in notched symbols.",
            "sent3": "The notched surface of the table made it perfect for a game of tic-tac-toe.",
            "sent4": "His notched belt showed signs of frequent use.",
            "sent5": "The notched handle of the tool provided a better grip."
        },
        {
            "definition": "To make a V-shaped cut or indentation in",
            "pos": "verb",
            "sent1": "He carefully notched the wood before joining the pieces together.",
            "sent2": "The craftsman notched the metal rod to create a secure connection.",
            "sent3": "She playfully notched her initials into the tree trunk.",
            "sent4": "The sculptor notched away at the marble to reveal the hidden figure.",
            "sent5": "The tailor notched the fabric to mark where the buttons would go."
        },
        {
            "definition": "To score or achieve a point or goal",
            "pos": "verb",
            "sent1": "The team notched another victory in their winning streak.",
            "sent2": "She notched a high score in the video game after hours of practice.",
            "sent3": "He notched his first goal of the season with a powerful kick.",
            "sent4": "The singer notched a hit single with her latest release.",
            "sent5": "The student notched a perfect score on the challenging exam."
        }
    ]
}