{
    "term": "now",
    "meanings": [
        {
            "definition": "At the present time",
            "pos": "adverb",
            "sent1": "I am eating lunch now.",
            "sent2": "She is studying now for her exam.",
            "sent3": "The cat is sleeping now, dreaming of chasing mice.",
            "sent4": "The sun is setting now, painting the sky with hues of orange.",
            "sent5": "The clock strikes twelve, and now is the time for Cinderella to leave the ball."
        },
        {
            "definition": "At this moment",
            "pos": "adverb",
            "sent1": "Now, I am listening to music.",
            "sent2": "The baby is sleeping now in the crib.",
            "sent3": "The dog is barking now, trying to catch the mailman's attention.",
            "sent4": "The wind is howling now, echoing through the empty streets.",
            "sent5": "The rain is pouring down, and now is the perfect time to dance in it."
        },
        {
            "definition": "Immediately",
            "pos": "adverb",
            "sent1": "Please stop talking now.",
            "sent2": "He needs help now with his homework.",
            "sent3": "The teacher is shouting now, trying to get the students' attention.",
            "sent4": "The alarm is blaring now, signaling the start of the race.",
            "sent5": "The fire is spreading rapidly, and we need to act now to put it out."
        },
        {
            "definition": "Nowadays",
            "pos": "adverb",
            "sent1": "Kids nowadays spend a lot of time on their phones.",
            "sent2": "Now, people prefer to shop online rather than in stores.",
            "sent3": "Grandma says that kids nowadays have it easy with all the technology.",
            "sent4": "Nowadays, social media plays a big role in people's lives.",
            "sent5": "Nowadays, it's common to see people working remotely from home."
        },
        {
            "definition": "In the current situation",
            "pos": "adverb",
            "sent1": "We need to act now to solve this problem.",
            "sent2": "Now, we must come together to support each other.",
            "sent3": "The team is working hard now to meet the deadline.",
            "sent4": "Now, more than ever, we need to stay positive.",
            "sent5": "The company is facing challenges now, but we will overcome them together."
        }
    ]
}