{
    "term": "nucleonics",
    "meanings": [
        {
            "definition": "The branch of physics dealing with the behavior of atomic nuclei.",
            "pos": "noun",
            "sent1": "In nucleonics, scientists study how atomic nuclei behave.",
            "sent2": "She is conducting research in nucleonics to understand atomic nuclei better.",
            "sent3": "The professor's passion for nucleonics made him the nucleus of the department's activities.",
            "sent4": "The mysteries of atomic nuclei unfolded through the lens of nucleonics.",
            "sent5": "The textbook on nucleonics made the complex topic of atomic nuclei easier to grasp."
        },
        {
            "definition": "The study of the properties and behavior of atomic nuclei.",
            "pos": "noun",
            "sent1": "Students in nucleonics learn about the characteristics of atomic nuclei.",
            "sent2": "Understanding the behavior of atomic nuclei is a key aspect of nucleonics.",
            "sent3": "The playful robot mascot of the nucleonics class brought atomic nuclei to life.",
            "sent4": "Her mind was a universe where the stars were atomic nuclei, a realm of nucleonics.",
            "sent5": "The laboratory experiments in nucleonics revealed the secrets of atomic nuclei."
        },
        {
            "definition": "The science of nuclear energy and its applications.",
            "pos": "noun",
            "sent1": "Nucleonics explores the uses of nuclear energy in various fields.",
            "sent2": "The advancements in nucleonics have revolutionized the application of nuclear energy.",
            "sent3": "The comedy show about nucleonics had the audience splitting atoms with laughter.",
            "sent4": "Her enthusiasm for nucleonics was like a reactor core, radiating energy to all around her.",
            "sent5": "The documentary on nucleonics showcased the impact of nuclear energy on society."
        }
    ]
}