{
    "term": "nullities",
    "meanings": [
        {
            "definition": "The state or quality of being null or void.",
            "pos": "noun",
            "sent1": "The nullities of the abandoned house were evident from the broken windows and overgrown garden.",
            "sent2": "The contract was full of nullities, making it invalid in the eyes of the law.",
            "sent3": "The nullities of the old, dusty book made it a perfect prop for the haunted house.",
            "sent4": "Her dreams were filled with the nullities of her past, haunting her every night.",
            "sent5": "The nullities of the empty room echoed with a sense of abandonment and loneliness."
        },
        {
            "definition": "Something that is null or void.",
            "pos": "noun",
            "sent1": "The dusty attic was full of forgotten nullities from a bygone era.",
            "sent2": "The empty field was a vast expanse of nullities, devoid of any signs of life.",
            "sent3": "The box of broken toys held a collection of nullities waiting to be rediscovered.",
            "sent4": "Her heart felt like a void, aching with the nullities of lost love.",
            "sent5": "The abandoned factory was a graveyard of nullities, relics of a once-thriving industry."
        },
        {
            "definition": "A legal concept referring to something that is legally void or invalid.",
            "pos": "noun",
            "sent1": "The lawyer argued that the contract was filled with nullities, rendering it unenforceable.",
            "sent2": "The judge declared the will null and void due to the presence of multiple nullities.",
            "sent3": "The courtroom was filled with laughter when the witness accidentally referred to the evidence as nullities.",
            "sent4": "The legal battle revealed the nullities in the defendant's claims, weakening their case.",
            "sent5": "The nullities in the document were a glaring oversight that led to its rejection by the court."
        }
    ]
}