{
    "term": "number",
    "meanings": [
        {
            "definition": "A mathematical value or figure",
            "pos": "noun",
            "sent1": "I used a number to solve the math problem.",
            "sent2": "The teacher asked us to write down a number on the board.",
            "sent3": "The number of apples in the basket was so large, it looked like a mountain of fruit!",
            "sent4": "Her smile lit up the room like a bright number in a dark sky.",
            "sent5": "The number on the clock seemed to tick away the seconds like a tiny heartbeat."
        },
        {
            "definition": "A quantity or amount",
            "pos": "noun",
            "sent1": "There were a large number of people at the concert.",
            "sent2": "The number of books on the shelf was impressive.",
            "sent3": "The number of cookies in the jar kept mysteriously decreasing.",
            "sent4": "His kindness knew no bounds, like an infinite number of good deeds.",
            "sent5": "The number of stars in the sky at night was breathtaking."
        },
        {
            "definition": "To assign a number to something",
            "pos": "verb",
            "sent1": "I will number the pages of my report before submitting it.",
            "sent2": "She decided to number the boxes for easier identification.",
            "sent3": "The cat seemed to number the toys in order of preference.",
            "sent4": "His memories were carefully numbered in his mind like a library catalog.",
            "sent5": "She would number the days until her birthday with excitement."
        },
        {
            "definition": "To total or add up to a certain amount",
            "pos": "verb",
            "sent1": "The coins will number to ten dollars in total.",
            "sent2": "The votes will number up to decide the winner.",
            "sent3": "The candies began to number in her hand as she kept counting.",
            "sent4": "His achievements would number like stars in the sky, each one shining brightly.",
            "sent5": "The drops of rain would number together to form a soothing melody on the roof."
        }
    ]
}