{
    "term": "nur",
    "meanings": [
        {
            "definition": "A light or illumination",
            "pos": "noun",
            "sent1": "The nur from the lamp brightened the room.",
            "sent2": "The sun's nur shone through the window.",
            "sent3": "The nur from the fire danced merrily in the darkness.",
            "sent4": "Her smile was like a warm nur in a cold world.",
            "sent5": "The nur of the stars guided them home."
        },
        {
            "definition": "A source of spiritual enlightenment",
            "pos": "noun",
            "sent1": "The wise old man was a nur of wisdom to all.",
            "sent2": "The ancient book was a nur of knowledge.",
            "sent3": "His words were a nur of hope in times of despair.",
            "sent4": "The peaceful garden was a nur of tranquility.",
            "sent5": "The mountain top was a nur of serenity."
        },
        {
            "definition": "To feed and protect young children or animals",
            "pos": "verb",
            "sent1": "She would nur the kittens with care and love.",
            "sent2": "The mother bird would nur her chicks in the nest.",
            "sent3": "He tried to nur the stray puppy back to health.",
            "sent4": "The farmer would nur the lambs through the cold winter.",
            "sent5": "The kind lady would nur the orphaned children in the village."
        },
        {
            "definition": "To care for and encourage the growth or development of something",
            "pos": "verb",
            "sent1": "The teacher would nur her students to reach their full potential.",
            "sent2": "He decided to nur the small plant by watering it daily.",
            "sent3": "The coach would nur the young athletes to become champions.",
            "sent4": "She would nur her dreams until they became reality.",
            "sent5": "The community would nur the garden to bloom beautifully."
        }
    ]
}