{
    "term": "nurturant",
    "meanings": [
        {
            "definition": "Providing physical or emotional care and support.",
            "pos": "adjective",
            "sent1": "The mother's nurturing touch helped the baby feel safe and loved.",
            "sent2": "She is known for her nurturing nature, always ready to lend a helping hand.",
            "sent3": "The garden soil was so nurturant that even the smallest seeds grew into giant plants!",
            "sent4": "Her voice had a nurturant quality that made everyone feel comforted and understood.",
            "sent5": "The sun's warm rays felt like a nurturing embrace on the chilly morning."
        },
        {
            "definition": "Showing kindness and encouragement.",
            "pos": "adjective",
            "sent1": "His nurturant words lifted her spirits and gave her the courage to keep going.",
            "sent2": "The teacher's nurturant attitude created a positive learning environment in the classroom.",
            "sent3": "The puppy's wagging tail and playful antics were a nurturant display of affection.",
            "sent4": "The nurturant smile on her face made even the shyest student feel welcomed.",
            "sent5": "The gentle rain was a nurturant reminder of nature's constant care for the earth."
        },
        {
            "definition": "Acting as a caregiver or mentor.",
            "pos": "adjective",
            "sent1": "The nurturant nurse stayed by the patient's side, offering comfort and support.",
            "sent2": "As a nurturant coach, he guided his team with patience and understanding.",
            "sent3": "The wise old owl took on a nurturant role, teaching the young birds how to fly.",
            "sent4": "Her nurturant presence in the orphanage brought smiles to the children's faces.",
            "sent5": "The oak tree stood tall and nurturant, providing shade and shelter to all who sought it."
        }
    ]
}