{
    "term": "nut",
    "meanings": [
        {
            "definition": "A hard-shelled fruit or seed with an edible kernel.",
            "pos": "noun",
            "sent1": "I cracked open the nut to eat the tasty kernel inside.",
            "sent2": "She picked up a nut from the ground and cracked it open to find the seed inside.",
            "sent3": "The squirrel stored the nut in a secret spot for later, thinking it was a treasure.",
            "sent4": "Her ideas were like a nut, tough to crack but full of valuable insights.",
            "sent5": "The nut's hard shell protected the delicious kernel within, just like how some people hide their true feelings."
        },
        {
            "definition": "A small piece of metal with a hole through it, used with a bolt to fasten things together.",
            "pos": "noun",
            "sent1": "He tightened the nut onto the bolt to secure the shelf in place.",
            "sent2": "The nut and bolt were essential for assembling the furniture.",
            "sent3": "The nut rolled off the table and got lost under the couch, making it impossible to finish the project.",
            "sent4": "Their friendship was like a nut and bolt, always keeping each other grounded and connected.",
            "sent5": "The nut slid perfectly onto the bolt, fitting snugly and ensuring everything stayed in place."
        },
        {
            "definition": "A crazy or eccentric person.",
            "pos": "noun",
            "sent1": "The old man down the street is known as the neighborhood nut.",
            "sent2": "She thought her uncle was a bit of a nut with his wild stories.",
            "sent3": "The nut at the park danced around in a funny hat, entertaining everyone who passed by.",
            "sent4": "In a world full of bolts, be a nut - unique, essential, and a little bit eccentric.",
            "sent5": "The nut's quirky behavior made everyone smile, showing that sometimes being a little nutty is a good thing."
        }
    ]
}