{
    "term": "nutlet",
    "meanings": [
        {
            "definition": "A small nut",
            "pos": "noun",
            "sent1": "The squirrel cracked open the nutlet to get to the tasty insides.",
            "sent2": "I found a tiny nutlet under the oak tree in the park.",
            "sent3": "Why did the nutlet refuse to tell its secret? Because it was a little nutty!",
            "sent4": "Her ideas were like nutlets, small but packed with potential.",
            "sent5": "The nutlet gleamed in the sunlight, promising a delicious treat inside."
        },
        {
            "definition": "A small, hard seed",
            "pos": "noun",
            "sent1": "The farmer planted the nutlet in the soil, hoping it would grow into a strong plant.",
            "sent2": "The nutlet from the pine cone fell to the ground and waited for the right conditions to sprout.",
            "sent3": "Why did the nutlet refuse to jump? It was afraid it might crack under pressure!",
            "sent4": "In her mind, the idea was a tiny nutlet waiting to bloom into a grand vision.",
            "sent5": "The nutlet held the promise of new life, ready to burst forth when the time was right."
        },
        {
            "definition": "A small, hard fruit",
            "pos": "noun",
            "sent1": "The cherry tree bore a single red nutlet, a miniature version of its parent fruit.",
            "sent2": "She plucked a tiny nutlet from the strawberry plant and popped it into her mouth.",
            "sent3": "Why did the nutlet refuse to play hide and seek? It didn't want to be a small fruit!",
            "sent4": "The nutlet hung from the tree like a precious gem, waiting to be discovered.",
            "sent5": "The nutlet looked unassuming, but its flavor packed a delightful surprise."
        },
        {
            "definition": "A small, hard kernel",
            "pos": "noun",
            "sent1": "The chef carefully cracked the nutlet to extract the flavorful kernel inside.",
            "sent2": "I found a small nutlet with a hard kernel while walking in the woods.",
            "sent3": "Why did the nutlet refuse to join the orchestra? It didn't want to be a tough nut to crack!",
            "sent4": "Within the nutlet's hard shell lay a kernel of potential, waiting to be unleashed.",
            "sent5": "The nutlet's kernel held the essence of growth, ready to sprout into something magnificent."
        }
    ]
}