{
    "term": "nuts",
    "meanings": [
        {
            "definition": "A hard-shelled fruit or seed with an edible kernel.",
            "pos": "noun",
            "sent1": "I cracked open the nuts to get to the tasty kernel inside.",
            "sent2": "She enjoyed snacking on mixed nuts during the movie.",
            "sent3": "The squirrel went nuts collecting acorns for the winter.",
            "sent4": "The treasure chest was full of golden nuts waiting to be discovered.",
            "sent5": "The sound of cracking nuts echoed through the forest."
        },
        {
            "definition": "Crazy or mentally unstable.",
            "pos": "adjective",
            "sent1": "He seemed a bit nuts when he started talking to imaginary friends.",
            "sent2": "The idea of flying cars may sound nuts, but it could happen in the future.",
            "sent3": "The cat wearing a tiny hat looked absolutely nuts!",
            "sent4": "The stormy sea looked nuts with its wild waves crashing against the shore.",
            "sent5": "Her colorful outfit was so nuts that everyone turned to look."
        },
        {
            "definition": "A small piece of metal with a hole for a screw or bolt.",
            "pos": "noun",
            "sent1": "I need to find the right nuts to secure the shelf to the wall.",
            "sent2": "The mechanic used a wrench to tighten the nuts on the car's tire.",
            "sent3": "The shiny nuts rolled off the table and onto the floor.",
            "sent4": "The nuts gleamed under the bright workshop lights.",
            "sent5": "The nuts rattled in the toolbox as he searched for the correct size."
        },
        {
            "definition": "Enthusiastic or obsessed about something.",
            "pos": "adjective",
            "sent1": "She was nuts about collecting vintage stamps from around the world.",
            "sent2": "The fans went nuts when their favorite band took the stage.",
            "sent3": "His friends thought he was nuts for his love of extreme sports.",
            "sent4": "The crowd went nuts with excitement as the fireworks lit up the sky.",
            "sent5": "Her eyes sparkled with a nuts passion for painting."
        }
    ]
}