{
    "term": "nutty",
    "meanings": [
        {
            "definition": "Crazy or eccentric in behavior",
            "pos": "adjective",
            "sent1": "The squirrel in the park acted nutty, running in circles and chattering loudly.",
            "sent2": "Some people find it fun to be a little nutty and do unexpected things.",
            "sent3": "The nutty professor wore mismatched socks to his lecture, causing a few chuckles.",
            "sent4": "Her ideas were so nutty, they seemed to come from a different planet.",
            "sent5": "The nutty behavior of the clown made the children laugh uncontrollably."
        },
        {
            "definition": "Having a flavor or aroma resembling nuts",
            "pos": "adjective",
            "sent1": "The cake had a deliciously nutty taste, reminding me of almonds.",
            "sent2": "The cookies were nutty and crunchy, perfect for a snack.",
            "sent3": "The nutty scent of the candle filled the room with warmth and coziness.",
            "sent4": "Her perfume had a nutty undertone that lingered in the air.",
            "sent5": "The nutty flavor of the soup made it a comforting choice for dinner."
        },
        {
            "definition": "Containing nuts or nut flavor",
            "pos": "adjective",
            "sent1": "The nutty granola bar was a tasty and healthy snack.",
            "sent2": "She enjoyed the nutty taste of the trail mix on her hike.",
            "sent3": "The nutty ice cream was a hit at the summer party, with crunchy bits of almonds.",
            "sent4": "The nutty salad dressing added a unique twist to the fresh greens.",
            "sent5": "The nutty bread was a delightful combination of flavors and textures."
        },
        {
            "definition": "Covered in nuts or nut toppings",
            "pos": "adjective",
            "sent1": "The nutty brownie was topped with a generous amount of walnuts.",
            "sent2": "The ice cream sundae was extra special with a nutty topping.",
            "sent3": "The nutty pie had a crunchy crust filled with pecans and almonds.",
            "sent4": "The nutty cupcake was decorated with a swirl of peanut butter frosting.",
            "sent5": "The nutty fudge was a decadent treat with a sprinkling of hazelnuts."
        }
    ]
}