{
    "term": "nutting",
    "meanings": [
        {
            "definition": "The act of gathering nuts.",
            "pos": "noun",
            "sent1": "During the fall, we enjoy nutting in the forest to collect acorns.",
            "sent2": "She went nutting in the orchard and filled her basket with walnuts.",
            "sent3": "The squirrel went nutting in the park, but he kept dropping the nuts.",
            "sent4": "The children's laughter filled the air as they went nutting in the woods.",
            "sent5": "Nutting in the autumn sun, the family bonded over nature's treasures."
        },
        {
            "definition": "The act of hitting someone on the head.",
            "pos": "noun",
            "sent1": "He accidentally gave his friend a nutting while playing tag.",
            "sent2": "The playful nutting on the head made everyone laugh at the party.",
            "sent3": "The comedian's joke ended with a nutting on his own head for effect.",
            "sent4": "The cartoon character received a nutting from an anvil falling on his head.",
            "sent5": "The gentle nutting on the head was a sign of affection among siblings."
        },
        {
            "definition": "The act of tightening a nut.",
            "pos": "noun",
            "sent1": "The mechanic used a wrench for nutting the bolts securely in place.",
            "sent2": "She learned the proper technique for nutting the screws in the furniture.",
            "sent3": "The robot's job was nutting the metal pieces together on the assembly line.",
            "sent4": "The sound of nutting echoed in the garage as he fixed the car engine.",
            "sent5": "Precision is key when nutting the components to ensure stability."
        },
        {
            "definition": "The act of ejaculating.",
            "pos": "noun",
            "sent1": "The book described the process of nutting in a scientific manner.",
            "sent2": "He felt embarrassed after nutting unexpectedly during the presentation.",
            "sent3": "The comedian's joke about nutting made the audience burst into laughter.",
            "sent4": "The movie scene depicted a character nutting in a comical way.",
            "sent5": "The awkward moment of nutting was quickly forgotten amidst the jokes."
        }
    ]
}