{
    "term": "nyctalopias",
    "meanings": [
        {
            "definition": "Nyctalopias: a condition of the eye in which vision is better in dim light than in bright light",
            "pos": "noun",
            "sent1": "In the evening, her nyctalopias allowed her to see clearly when others struggled.",
            "sent2": "Owls have nyctalopias, enabling them to hunt effectively at night.",
            "sent3": "The cat's nyctalopias made it the perfect nighttime detective, solving mysteries under the moonlight.",
            "sent4": "His nyctalopias were like a superpower, turning darkness into his ally.",
            "sent5": "The firefighter's nyctalopias saved lives during power outages, guiding people to safety in the dark."
        },
        {
            "definition": "Nyctalopias: the ability to see in the dark or at night",
            "pos": "noun",
            "sent1": "With his nyctalopias, he navigated the forest easily during the moonless night.",
            "sent2": "Cats' nyctalopias make them excellent hunters in the darkness.",
            "sent3": "The thief envied the detective's nyctalopias, wishing he could see in the dark like a cat.",
            "sent4": "Her nyctalopias were like having night vision goggles, revealing secrets hidden in the shadows.",
            "sent5": "The explorer's nyctalopias were his greatest asset in the uncharted caves, illuminating the path ahead."
        },
        {
            "definition": "Nyctalopias: a person who has nyctalopia",
            "pos": "noun",
            "sent1": "As a nyctalopias, she felt at home in the darkness, where others feared to tread.",
            "sent2": "The superhero was a true nyctalopias, using his night vision to fight crime under the cover of darkness.",
            "sent3": "The nyctalopias chuckled at the irony of being more comfortable in the dark than in the light.",
            "sent4": "She was a nyctalopias in a world that preferred daylight, finding solace in the quiet of the night.",
            "sent5": "The nyctalopias' eyes sparkled like stars in the night sky, a testament to their affinity for darkness."
        }
    ]
}