{
    "term": "obelisms",
    "meanings": [
        {
            "definition": "A mark or symbol used to indicate a word or passage that is considered offensive or inappropriate.",
            "pos": "noun",
            "sent1": "In the book, the author used obelisms to show which words were not suitable for young readers.",
            "sent2": "The editor added obelisms to the manuscript to highlight the inappropriate language.",
            "sent3": "The teacher chuckled as she placed obelisms next to the swear words in the student's essay.",
            "sent4": "The obelisms in the text stood out like warning signs, guiding readers away from offensive content.",
            "sent5": "The obelisms glowed on the page, making the forbidden words impossible to miss."
        },
        {
            "definition": "The act of censoring or removing offensive language or content.",
            "pos": "noun",
            "sent1": "Obelisms are necessary to maintain a family-friendly environment in the library.",
            "sent2": "The obelisms in the newspaper article helped keep the readership appropriate for all ages.",
            "sent3": "The comedian joked about the strict obelisms in his script, ensuring a clean performance.",
            "sent4": "The obelisms of society shielded the public from harmful words and images.",
            "sent5": "The obelisms worked silently behind the scenes, protecting viewers from offensive material."
        },
        {
            "definition": "A form of censorship involving the use of obelisks.",
            "pos": "noun",
            "sent1": "The ancient civilization practiced obelisms by inscribing warnings on towering obelisks.",
            "sent2": "The museum displayed artifacts depicting the historical use of obelisms for censorship.",
            "sent3": "The movie portrayed a futuristic society where obelisms controlled the flow of information.",
            "sent4": "The obelisms loomed large over the city, dictating what could and could not be said.",
            "sent5": "The power of obelisms in the kingdom was evident in the silent streets devoid of controversial speech."
        }
    ]
}