{
    "term": "obesities",
    "meanings": [
        {
            "definition": "The state of being excessively overweight or fat.",
            "pos": "noun",
            "sent1": "The obesities of some animals can affect their ability to move easily.",
            "sent2": "Doctors are concerned about the rising obesities in children due to unhealthy eating habits.",
            "sent3": "The obesities of the giant teddy bear made it impossible to fit through the door.",
            "sent4": "The obesities of the city's budget were causing financial strain on its services.",
            "sent5": "The obesities of the clouds in the sky blocked out the sun, casting a shadow over the town."
        },
        {
            "definition": "Excessive accumulation of body fat.",
            "pos": "noun",
            "sent1": "She struggled with the obesities around her waistline and decided to start exercising.",
            "sent2": "The cat's obesities made it difficult for it to jump onto the high shelf.",
            "sent3": "The obesities of the snowman melted away under the warm sun.",
            "sent4": "The obesities of paperwork on his desk made it hard to find important documents.",
            "sent5": "The obesities of the suitcase made it challenging to lift onto the overhead compartment."
        },
        {
            "definition": "The condition of being obese.",
            "pos": "noun",
            "sent1": "Her doctor discussed the risks associated with her obesities and recommended a healthier diet.",
            "sent2": "The obesities of the population were a growing concern for public health officials.",
            "sent3": "The obesities of the traffic jam caused frustration among the drivers.",
            "sent4": "The obesities of the tree branches were bending under the weight of the snow.",
            "sent5": "The obesities of the backpack strained his shoulders during the long hike."
        }
    ]
}