{
    "term": "obias",
    "meanings": [
        {
            "definition": "A strong inclination or preference for one thing over another.",
            "pos": "noun",
            "sent1": "Her obias towards chocolate ice cream was evident as she always chose it over other flavors.",
            "sent2": "His obias for action movies made him the go-to person for movie recommendations.",
            "sent3": "Sarah's obias for napping in the afternoon sometimes led to her missing important meetings.",
            "sent4": "The cat's obias for sleeping in sunbeams made it the laziest pet in the house.",
            "sent5": "The child's obias for playing with building blocks was so strong that he spent hours creating different structures."
        },
        {
            "definition": "A tendency to believe that some people or ideas are better than others.",
            "pos": "noun",
            "sent1": "His obias towards certain political parties often led to heated debates with his friends.",
            "sent2": "The teacher's obias towards hardworking students sometimes made the class feel unfair.",
            "sent3": "The chef's obias towards organic ingredients made his dishes taste even better in his mind.",
            "sent4": "Her obias towards traditional values clashed with the modern world around her.",
            "sent5": "The manager's obias towards efficiency made the workplace run like a well-oiled machine."
        },
        {
            "definition": "To show a preference for something or someone.",
            "pos": "verb",
            "sent1": "She would obias her favorite singer by attending all of their concerts.",
            "sent2": "He tends to obias his morning routine by always starting with a cup of coffee.",
            "sent3": "The cat would obias the sunny spot on the windowsill for its naps.",
            "sent4": "The child obiased the blue crayon for his drawing of the sky.",
            "sent5": "The student obiased studying in the library for its quiet atmosphere."
        }
    ]
}