{
    "term": "obloquy",
    "meanings": [
        {
            "definition": "Strong public criticism or verbal abuse.",
            "pos": "noun",
            "sent1": "The politician faced obloquy from the media after his scandal was exposed.",
            "sent2": "The celebrity endured obloquy from the tabloids for her controversial actions.",
            "sent3": "The comedian joked that receiving obloquy from the press was like getting a daily dose of sour lemons.",
            "sent4": "The author's latest work received an unexpected wave of obloquy from literary critics.",
            "sent5": "The teacher used the concept of obloquy in class to explain the consequences of negative behavior."
        },
        {
            "definition": "Disgrace or public shame.",
            "pos": "noun",
            "sent1": "The criminal's actions brought obloquy upon his family.",
            "sent2": "The defeat in the championship game was a moment of obloquy for the team.",
            "sent3": "The cat's mischievous behavior led to a hilarious moment of obloquy at the vet's office.",
            "sent4": "The abandoned building stood as a symbol of obloquy in the once-thriving neighborhood.",
            "sent5": "The student's failure in the exam was a source of great obloquy among his peers."
        },
        {
            "definition": "To subject to strong public criticism or verbal abuse.",
            "pos": "verb",
            "sent1": "The journalist decided to obloquy the corrupt official in her latest article.",
            "sent2": "The online trolls constantly obloquy individuals for their differing opinions.",
            "sent3": "The prankster thought it would be funny to obloquy his friend during the comedy show.",
            "sent4": "The rival company tried to obloquy our product to gain a competitive edge.",
            "sent5": "The coach warned the players not to obloquy their opponents during the match."
        }
    ]
}