{
    "term": "obscene",
    "meanings": [
        {
            "definition": "Offensive to morality or decency; indecent.",
            "pos": "adjective",
            "sent1": "The movie contained obscene scenes that made many people uncomfortable.",
            "sent2": "The artist was criticized for creating obscene paintings that were deemed inappropriate for public display.",
            "sent3": "The comedian's joke about the obscene outfit worn by a clown had the audience bursting into laughter.",
            "sent4": "The stench coming from the dumpster was so obscene, it could be smelled from a mile away.",
            "sent5": "The graffiti on the wall was so obscene that it shocked even the most hardened city dwellers."
        },
        {
            "definition": "Repulsive; disgusting.",
            "pos": "adjective",
            "sent1": "The garbage left unattended for weeks emitted an obscene odor throughout the neighborhood.",
            "sent2": "The abandoned house was in an obscene state of disrepair, with broken windows and overgrown weeds.",
            "sent3": "The taste of the expired milk was so obscene that it made everyone gag.",
            "sent4": "The sight of the decaying fruit in the bowl was an obscene reminder of neglect.",
            "sent5": "The slimy texture of the spoiled food was truly obscene to the touch."
        },
        {
            "definition": "Abhorrent; detestable.",
            "pos": "adjective",
            "sent1": "The criminal's actions were so obscene that they shocked the entire community.",
            "sent2": "The dictator's regime was characterized by obscene acts of violence against innocent civilians.",
            "sent3": "The politician's corrupt behavior was so obscene that it led to his downfall.",
            "sent4": "The company's unethical practices were considered obscene by the public.",
            "sent5": "The level of pollution in the river was so obscene that it posed a serious threat to aquatic life."
        }
    ]
}