{
    "term": "obsession",
    "meanings": [
        {
            "definition": "The state of being obsessed with someone or something.",
            "pos": "noun",
            "sent1": "Her obsession with collecting stamps filled her with joy.",
            "sent2": "His obsession with football made him the star player of the team.",
            "sent3": "Sarah's obsession with unicorns led her to decorate her entire room with unicorn-themed items.",
            "sent4": "His obsession with success was like a fire burning inside him, driving him to achieve his goals.",
            "sent5": "The little girl's obsession with dinosaurs was so intense that she could name every species she saw."
        },
        {
            "definition": "An idea or thought that continually preoccupies or intrudes on a person's mind.",
            "pos": "noun",
            "sent1": "The obsession of winning the competition consumed his thoughts day and night.",
            "sent2": "Her obsession with finding the perfect gift for her friend made her search tirelessly.",
            "sent3": "John's obsession with finding the best pizza in town led him to try a new pizzeria every week.",
            "sent4": "The idea of traveling the world became an obsession that he couldn't shake off.",
            "sent5": "The obsession of becoming a famous singer drove her to practice singing every day."
        },
        {
            "definition": "A compulsive preoccupation with a fixed idea or an unwanted feeling or emotion, often accompanied by symptoms of anxiety.",
            "pos": "noun",
            "sent1": "His obsession with cleanliness made him wash his hands multiple times a day.",
            "sent2": "The obsession with germs caused her to carry hand sanitizer everywhere.",
            "sent3": "Mary's obsession with order made her rearrange her desk every morning.",
            "sent4": "The obsession with perfectionism created a constant sense of unease in her mind.",
            "sent5": "The obsession with being on time made him arrive at every meeting early."
        }
    ]
}