{
    "term": "obsessing",
    "meanings": [
        {
            "definition": "To preoccupy or fill the mind continually, intrusively, and to a troubling extent.",
            "pos": "verb",
            "sent1": "She couldn't stop obsessing over her upcoming exam, thinking about it all the time.",
            "sent2": "He was obsessing about his favorite TV show, eagerly waiting for the next episode.",
            "sent3": "The cat kept obsessing over the laser pointer, chasing it around the room endlessly.",
            "sent4": "Her fear of failure was obsessing her mind like a dark cloud, making it hard to focus.",
            "sent5": "The idea of winning the competition was obsessing her thoughts, driving her to practice harder."
        },
        {
            "definition": "To haunt or excessively preoccupy the mind of.",
            "pos": "verb",
            "sent1": "The memory of the accident kept obsessing her, causing nightmares every night.",
            "sent2": "The thought of losing her job was obsessing him, making it hard to sleep.",
            "sent3": "The idea of a ghost obsessing a house is just a silly story people tell.",
            "sent4": "His guilt was obsessing him like a shadow, following him wherever he went.",
            "sent5": "The mystery of the missing necklace was obsessing her mind, leading her to investigate."
        },
        {
            "definition": "To dominate or preoccupy the thoughts, feelings, or desires of.",
            "pos": "verb",
            "sent1": "The excitement of the upcoming trip was obsessing her mind, making it hard to focus on work.",
            "sent2": "The fear of rejection was obsessing him, preventing him from asking her out.",
            "sent3": "The idea of a talking dog obsessing a town would make a funny movie plot.",
            "sent4": "His love for music was obsessing his heart, filling him with joy every day.",
            "sent5": "The beauty of the painting was obsessing her senses, drawing her in with its vibrant colors."
        }
    ]
}