{
    "term": "obversely",
    "meanings": [
        {
            "definition": "In an obverse manner.",
            "pos": "adverb",
            "sent1": "She looked obversely at the mirror, trying to see her reflection from a different angle.",
            "sent2": "He held the coin obversely, examining the intricate design on the front.",
            "sent3": "The cat walked obversely around the room, pretending to be lost in thought.",
            "sent4": "The river flowed obversely, against the usual current, creating a mesmerizing sight.",
            "sent5": "The dancer moved obversely, gracefully twirling in the opposite direction."
        },
        {
            "definition": "With the opposite side facing forward.",
            "pos": "adverb",
            "sent1": "The badge was pinned obversely on his uniform, displaying the emblem prominently.",
            "sent2": "She wore the necklace obversely, showcasing the beautiful pendant to everyone.",
            "sent3": "The painting hung obversely on the wall, catching the eye of every visitor.",
            "sent4": "The flag fluttered obversely in the wind, revealing its vibrant colors to the crowd.",
            "sent5": "The book cover was placed obversely on the shelf, making it stand out among the others."
        },
        {
            "definition": "In a way that is opposite or contrary to something else.",
            "pos": "adverb",
            "sent1": "She obversely disagreed with his opinion, presenting a different perspective.",
            "sent2": "The siblings obversely approached the problem, each suggesting a contrasting solution.",
            "sent3": "The student obversely answered the question, surprising the teacher with a unique response.",
            "sent4": "The company obversely decided to invest in a new technology, diverging from their usual strategy.",
            "sent5": "The politician obversely campaigned for change, promising a different direction for the country."
        }
    ]
}