{
    "term": "occulters",
    "meanings": [
        {
            "definition": "Occulters: a person who practices occult arts or magic",
            "pos": "noun",
            "sent1": "The occulters gathered in the forest to perform their mysterious rituals.",
            "sent2": "She believed in the power of occulters to influence events through supernatural means.",
            "sent3": "The children dressed up as occulters for Halloween, casting spells on their friends for fun.",
            "sent4": "Her grandmother was like an occulter, weaving spells of protection around their home.",
            "sent5": "The old book was said to contain secrets known only to the ancient occulters."
        },
        {
            "definition": "Occulters: to hide or conceal something",
            "pos": "verb",
            "sent1": "He tried to occulter his true feelings, but his eyes gave him away.",
            "sent2": "The spy used a clever disguise to occulter his identity from the enemy.",
            "sent3": "The magician used sleight of hand to occulter the disappearance of the coin.",
            "sent4": "The dense fog began to occulter the view of the approaching ship.",
            "sent5": "She used a password to occulter the private files on her computer."
        },
        {
            "definition": "Occulters: a device used to block or obscure light",
            "pos": "noun",
            "sent1": "The photographer used an occulter to control the amount of light entering the camera.",
            "sent2": "The telescope was equipped with an occulter to reduce glare from the stars.",
            "sent3": "The classroom had special blinds with occulters to dim the sunlight during presentations.",
            "sent4": "The ancient temple had intricate designs incorporating occulters to create patterns of light and shadow.",
            "sent5": "The stage lighting technician adjusted the occulter to focus the spotlight on the lead actor."
        }
    ]
}