{
    "term": "octothorp",
    "meanings": [
        {
            "definition": "A symbol (#) used to indicate a number or pound weight.",
            "pos": "noun",
            "sent1": "I saw the octothorp on the sign, which meant the weight was 10 pounds.",
            "sent2": "The recipe called for two cups of flour, followed by an octothorp of sugar.",
            "sent3": "The octothorp on the scale seemed to be winking at me, as if saying, 'Guess the weight!'",
            "sent4": "The octothorp on the package was like a secret code, revealing the weight to those who understood.",
            "sent5": "The bright red octothorp on the label made it easy to spot the weight information."
        },
        {
            "definition": "A symbol (#) used in social media to tag topics or keywords.",
            "pos": "noun",
            "sent1": "She added an octothorp before the word to make it a hashtag on social media.",
            "sent2": "The octothorp in the tweet helped categorize the post under a specific topic.",
            "sent3": "The octothorp in the post was like a little flag, waving to attract attention to the topic.",
            "sent4": "The octothorp functioned as a spotlight, highlighting the keyword for everyone to see.",
            "sent5": "With a single octothorp, the post became part of a larger conversation online."
        },
        {
            "definition": "A symbol (#) used in telephony to indicate a button on a telephone keypad.",
            "pos": "noun",
            "sent1": "Press the octothorp on the keypad to confirm your selection.",
            "sent2": "The automated voice instructed to press the octothorp for more options.",
            "sent3": "The octothorp on the phone seemed to be the most popular button, always worn out.",
            "sent4": "The octothorp acted like a magic key, unlocking different functions on the phone.",
            "sent5": "The bright red octothorp stood out among the other buttons, making it easy to find."
        }
    ]
}