{
    "term": "office",
    "meanings": [
        {
            "definition": "A room or building where people work at desks",
            "pos": "noun",
            "sent1": "My dad's office has a big desk and a computer.",
            "sent2": "She went to the office to finish her work on time.",
            "sent3": "The office was so messy, it looked like a tornado hit it!",
            "sent4": "Her office was her sanctuary, a place of productivity and focus.",
            "sent5": "The office hummed with the sound of keyboards clicking and phones ringing."
        },
        {
            "definition": "A duty or function assigned to someone",
            "pos": "noun",
            "sent1": "His office was to make sure everyone arrived on time.",
            "sent2": "Completing the project on time was her office.",
            "sent3": "His office was to guard the secret recipe for the best cookies in town.",
            "sent4": "Her office as team captain was to lead by example.",
            "sent5": "The office of being a big brother meant always looking out for his little sister."
        },
        {
            "definition": "A position of authority or trust",
            "pos": "noun",
            "sent1": "She held the office of class president with pride.",
            "sent2": "The CEO's office was on the top floor of the building.",
            "sent3": "His office as the king's advisor was to give wise counsel.",
            "sent4": "In her office as the judge, she had to make fair decisions.",
            "sent5": "The office of being the eldest sibling meant setting a good example for the younger ones."
        },
        {
            "definition": "A service or duty performed for another",
            "pos": "noun",
            "sent1": "It was her office to help the elderly cross the street safely.",
            "sent2": "He saw it as his office to always lend a helping hand.",
            "sent3": "Her office as a volunteer was to bring joy to those in need.",
            "sent4": "In his office as a mentor, he guided many young minds to success.",
            "sent5": "The office of being a good friend meant being there through thick and thin."
        }
    ]
}