{
    "term": "olfactory",
    "meanings": [
        {
            "definition": "relating to the sense of smell",
            "pos": "adjective",
            "sent1": "The olfactory experience of freshly baked cookies filled the kitchen with a delightful aroma.",
            "sent2": "The olfactory nerves help us detect different scents in the air.",
            "sent3": "The olfactory senses were so sharp that they could smell a flower from miles away.",
            "sent4": "Her olfactory memory was so strong that the mere whiff of a certain perfume brought back vivid memories.",
            "sent5": "The olfactory sensation of the fragrant roses was so intense that it felt like a burst of happiness in her nose."
        },
        {
            "definition": "of or relating to the sense of smell",
            "pos": "adjective",
            "sent1": "The olfactory receptors in the nose help us distinguish between different odors.",
            "sent2": "Animals often rely on their olfactory abilities to find food and detect danger.",
            "sent3": "The olfactory sensitivity of the bloodhound made it the perfect detective dog.",
            "sent4": "The olfactory allure of the bakery drew customers in from blocks away.",
            "sent5": "The olfactory delight of the freshly brewed coffee made waking up early worth it."
        },
        {
            "definition": "pertaining to the sense of smell",
            "pos": "adjective",
            "sent1": "The olfactory perception of the skunk's spray was unmistakable and pungent.",
            "sent2": "The olfactory system is responsible for our ability to enjoy the aroma of flowers.",
            "sent3": "The olfactory investigation led the detective straight to the hidden stash of chocolate.",
            "sent4": "The olfactory symphony of the forest in springtime was a delight to the senses.",
            "sent5": "The olfactory magic of the bakery wafted through the neighborhood, tempting everyone to follow their noses."
        }
    ]
}