{
    "term": "ombres",
    "meanings": [
        {
            "definition": "A person who is skilled in the art of shading or shadowing.",
            "pos": "noun",
            "sent1": "The artist was known as an ombres for his ability to create depth in his drawings.",
            "sent2": "The ombres carefully added shadows to the portrait, bringing it to life.",
            "sent3": "At the art exhibition, the ombres played with light and dark to trick the viewers' eyes.",
            "sent4": "Her talent as an ombres transformed the flat canvas into a three-dimensional masterpiece.",
            "sent5": "The ombres' work cast a mysterious and captivating aura in the room."
        },
        {
            "definition": "A card game popular in the 17th and 18th centuries.",
            "pos": "noun",
            "sent1": "During the historical reenactment, the participants enjoyed a game of ombres.",
            "sent2": "In the olden days, people gathered around to play ombres for entertainment.",
            "sent3": "The ombres game night turned into a fierce competition among friends.",
            "sent4": "The sound of shuffling cards filled the room as they prepared for a round of ombres.",
            "sent5": "The rules of ombres were simple yet provided hours of fun for all."
        },
        {
            "definition": "A type of hairstyle where the hair is darker at the roots and gradually becomes lighter towards the ends.",
            "pos": "noun",
            "sent1": "She decided to try the ombres style, opting for a trendy look.",
            "sent2": "The salon offered various options for those interested in getting an ombres hairdo.",
            "sent3": "Her friends admired the ombres effect on her hair, giving her a chic appearance.",
            "sent4": "The transition from dark to light in the ombres hairstyle created a stunning contrast.",
            "sent5": "The ombres trend swept through the fashion world, captivating many with its unique charm."
        }
    ]
}