{
    "term": "omnipotent",
    "meanings": [
        {
            "definition": "Having unlimited power",
            "pos": "adjective",
            "sent1": "The wizard was omnipotent and could make anything happen with a wave of his wand.",
            "sent2": "The king believed he was omnipotent and could control everything in his kingdom.",
            "sent3": "The omnipotent superhero could lift buildings effortlessly, much to the amazement of the onlookers.",
            "sent4": "Her omnipotent influence over the group was evident as they all followed her lead without question.",
            "sent5": "The storm raged with an omnipotent force, tearing through the town without mercy."
        },
        {
            "definition": "All-powerful",
            "pos": "adjective",
            "sent1": "In the fairy tale, the omnipotent sorcerer could defeat any enemy with a single spell.",
            "sent2": "The ancient deity was believed to be omnipotent, capable of creating and destroying worlds.",
            "sent3": "The omnipotent cat ruled the neighborhood, demanding treats and attention from everyone.",
            "sent4": "His omnipotent presence in the boardroom made all the employees nervous, knowing he held their fate in his hands.",
            "sent5": "The sun's omnipotent rays warmed the earth, bringing life to all living creatures."
        },
        {
            "definition": "Able to do anything",
            "pos": "adjective",
            "sent1": "With his omnipotent abilities, the magician could make objects disappear and reappear at will.",
            "sent2": "The genie in the lamp was omnipotent, granting any wish that was asked of it.",
            "sent3": "The omnipotent chef could turn basic ingredients into gourmet dishes with a flick of his wrist.",
            "sent4": "Her omnipotent knowledge of the subject made her the go-to person for any questions or problems.",
            "sent5": "The artist's omnipotent creativity knew no bounds, leading to masterpieces that captivated all who saw them."
        }
    ]
}