{
    "term": "once",
    "meanings": [
        {
            "definition": "At one time in the past",
            "pos": "adverb",
            "sent1": "I visited the museum once.",
            "sent2": "She lived in that house once.",
            "sent3": "The old clock struck once and stopped.",
            "sent4": "The memory of that day lingered like a once-forgotten dream.",
            "sent5": "The once bustling street was now quiet and deserted."
        },
        {
            "definition": "At the same time",
            "pos": "adverb",
            "sent1": "The twins arrived at the party once.",
            "sent2": "They both spoke at once and confused everyone.",
            "sent3": "The two dancers moved as one, stepping once to the left and once to the right.",
            "sent4": "Their hearts beat once in perfect synchrony.",
            "sent5": "The once inseparable friends now rarely saw each other."
        },
        {
            "definition": "Formerly",
            "pos": "adverb",
            "sent1": "He was once a great singer.",
            "sent2": "The town was once a thriving community.",
            "sent3": "The once popular restaurant had lost its charm.",
            "sent4": "The once bright colors of the painting had faded with time.",
            "sent5": "She was once the queen of the stage, now retired and content."
        },
        {
            "definition": "As soon as",
            "pos": "conjunction",
            "sent1": "Once the bell rings, you can leave.",
            "sent2": "I will call you once I reach home.",
            "sent3": "Once the cake is ready, we can eat it!",
            "sent4": "Once the sun sets, the stars come out to play.",
            "sent5": "Once the storm passes, the sky clears up beautifully."
        },
        {
            "definition": "As soon as; if ever",
            "pos": "adverb",
            "sent1": "I will forgive you once you apologize.",
            "sent2": "Once you finish your homework, you can play outside.",
            "sent3": "Once you taste this dish, you'll never forget it.",
            "sent4": "Once you see the view from the top, you'll be amazed.",
            "sent5": "Once you hear her sing, you'll be captivated by her voice."
        },
        {
            "definition": "At the same time; simultaneously",
            "pos": "adverb",
            "sent1": "The dancers moved once, creating a beautiful harmony.",
            "sent2": "The musicians played their instruments once, creating a symphony.",
            "sent3": "The two friends laughed at the same joke once.",
            "sent4": "The birds chirped once, filling the air with music.",
            "sent5": "The once quiet room was now filled with laughter and chatter."
        }
    ]
}