{
    "term": "oncornavirus",
    "meanings": [
        {
            "definition": "A type of virus that can cause cancer in animals.",
            "pos": "noun",
            "sent1": "The oncornavirus was found in the animal's body, leading to the development of cancer.",
            "sent2": "Scientists are studying the oncornavirus to understand how it causes cancer in animals.",
            "sent3": "The oncornavirus decided to throw a party in the animal's cells, but it got out of control and caused chaos.",
            "sent4": "The oncornavirus crept into the cells like a silent intruder, slowly causing havoc and chaos.",
            "sent5": "The oncornavirus was like a sneaky thief, stealing the health of the animal's cells bit by bit."
        },
        {
            "definition": "A virus that infects cells and can lead to the development of tumors.",
            "pos": "noun",
            "sent1": "The oncornavirus infected the cells, causing them to grow uncontrollably and form tumors.",
            "sent2": "Doctors are researching ways to stop the oncornavirus from creating tumors in the body.",
            "sent3": "The oncornavirus thought it was a gardener planting seeds in the cells, but instead, it grew tumors.",
            "sent4": "Like a dark shadow, the oncornavirus loomed over the cells, nurturing the growth of deadly tumors.",
            "sent5": "The oncornavirus was like a sinister puppeteer, manipulating the cells to form dangerous tumors."
        },
        {
            "definition": "A group of viruses known to cause cancer in various species.",
            "pos": "noun",
            "sent1": "Scientists are studying different types of oncornaviruses to understand their role in causing cancer.",
            "sent2": "The oncornaviruses have been linked to cancer development in many different animals.",
            "sent3": "The oncornaviruses gathered for a conference on how to best cause cancer in various species.",
            "sent4": "Like a dark army, the oncornaviruses marched through different species, leaving a trail of cancer in their wake.",
            "sent5": "The oncornaviruses were like tiny villains, plotting to bring cancer to unsuspecting animals."
        }
    ]
}