{
    "term": "only",
    "meanings": [
        {
            "definition": "Alone in a category or class; sole",
            "pos": "adjective",
            "sent1": "The red apple was the only one left on the tree.",
            "sent2": "She was the only student in the class who knew the answer.",
            "sent3": "The lonely puppy was the only one without a playmate.",
            "sent4": "The lighthouse stood as the only beacon of hope in the storm.",
            "sent5": "The diamond was the only gem that sparkled in the dark cave."
        },
        {
            "definition": "Without others or anything further; exclusively",
            "pos": "adverb",
            "sent1": "She could only play with her toys in her room.",
            "sent2": "The store only sells organic fruits and vegetables.",
            "sent3": "He could only wear his superhero cape on weekends.",
            "sent4": "The magician could only perform his tricks in the evening.",
            "sent5": "The restaurant only serves breakfast until 11 AM."
        },
        {
            "definition": "No more than; just",
            "pos": "adverb",
            "sent1": "I only have one cookie left in the jar.",
            "sent2": "He can only stay for a few minutes before he has to leave.",
            "sent3": "She can only watch one episode of her favorite show tonight.",
            "sent4": "The teacher will only accept the homework if it's turned in on time.",
            "sent5": "The bus will only wait for a few more seconds before departing."
        },
        {
            "definition": "Merely or simply",
            "pos": "adverb",
            "sent1": "She only wanted a small piece of cake for dessert.",
            "sent2": "He only needed a few more minutes to finish his work.",
            "sent3": "The cat only meowed once before falling asleep.",
            "sent4": "The flower only bloomed for a short period in the spring.",
            "sent5": "The book only had a few pages left to read before it was finished."
        }
    ]
}