{
    "term": "op",
    "meanings": [
        {
            "definition": "A surgical procedure.",
            "pos": "noun",
            "sent1": "The doctor performed an op on the patient's knee.",
            "sent2": "The hospital had a busy day with many ops scheduled.",
            "sent3": "During the op, the surgeon accidentally dropped a tool.",
            "sent4": "The op was like a carefully choreographed dance in the operating room.",
            "sent5": "The success of the op depended on the skill of the medical team."
        },
        {
            "definition": "A style of music.",
            "pos": "noun",
            "sent1": "The band played a catchy op that got everyone dancing.",
            "sent2": "Jazz is known for its improvisational nature, a key feature of ops.",
            "sent3": "The op had a unique blend of classical and modern music.",
            "sent4": "Listening to the op was like taking a musical journey through time.",
            "sent5": "The op had a rhythm that was impossible not to move to."
        },
        {
            "definition": "A casual or informal job or task.",
            "pos": "noun",
            "sent1": "She took on a side op to earn some extra money.",
            "sent2": "Helping out at the event was just a simple op for him.",
            "sent3": "Running errands for the neighbor was a quick op for the day.",
            "sent4": "The op of babysitting turned out to be more challenging than expected.",
            "sent5": "Completing the op was a satisfying accomplishment for the team."
        },
        {
            "definition": "To work as a member of the crew on a ship.",
            "pos": "verb",
            "sent1": "He decided to op on a cargo ship for a year.",
            "sent2": "Oping on a cruise ship allows you to see many different places.",
            "sent3": "The captain asked him to op on the next voyage.",
            "sent4": "Oping on the ship gave him a sense of adventure and camaraderie.",
            "sent5": "Oping on the vessel was a unique experience that he would never forget."
        },
        {
            "definition": "To oppose or resist.",
            "pos": "verb",
            "sent1": "She didn't want to op the new company policy.",
            "sent2": "The protesters gathered to op the construction of the new building.",
            "sent3": "He always seemed to op any changes to the routine.",
            "sent4": "Oping against the current was a tough but necessary decision.",
            "sent5": "Oping against injustice was a cause she was passionate about."
        }
    ]
}