{
    "term": "open",
    "meanings": [
        {
            "definition": "Allowing access, passage, or a view through an empty space or passage",
            "pos": "adjective",
            "sent1": "The door was open, inviting guests inside.",
            "sent2": "The window was left open to let in fresh air.",
            "sent3": "The open gate led to a magical garden.",
            "sent4": "Her open heart welcomed everyone with warmth.",
            "sent5": "The open field stretched out endlessly under the blue sky."
        },
        {
            "definition": "Not closed or blocked up",
            "pos": "adjective",
            "sent1": "The book lay open on the table.",
            "sent2": "The umbrella was left open during the rain.",
            "sent3": "The open jar of cookies tempted the hungry dog.",
            "sent4": "His open eyes revealed his surprise.",
            "sent5": "The open road beckoned to the adventurous traveler."
        },
        {
            "definition": "Ready to receive or engage in",
            "pos": "adjective",
            "sent1": "She had an open mind to new ideas.",
            "sent2": "The store was open for business early in the morning.",
            "sent3": "His open arms welcomed her with a hug.",
            "sent4": "The open invitation to the party excited her.",
            "sent5": "The open attitude of the team fostered collaboration."
        },
        {
            "definition": "Not sealed or fastened",
            "pos": "adjective",
            "sent1": "The envelope was left open on the desk.",
            "sent2": "The bottle cap was not fully open.",
            "sent3": "The open box revealed its contents.",
            "sent4": "Her open backpack spilled out books and pencils.",
            "sent5": "The open lock swung freely in the wind."
        },
        {
            "definition": "Available for use or participation",
            "pos": "adjective",
            "sent1": "The position is open for applicants.",
            "sent2": "The registration for the event is still open.",
            "sent3": "The open seat at the table was waiting for a guest.",
            "sent4": "Her schedule was open for a meeting in the afternoon.",
            "sent5": "The open microphone awaited the next performer."
        }
    ]
}