{
    "term": "opened",
    "meanings": [
        {
            "definition": "Not closed or fastened",
            "pos": "adjective",
            "sent1": "The door was left opened all night.",
            "sent2": "The book lay opened on the table.",
            "sent3": "The opened window let in a mischievous breeze.",
            "sent4": "Her opened heart welcomed everyone with warmth.",
            "sent5": "The opened umbrella shielded her from the rain."
        },
        {
            "definition": "To make or become accessible or available",
            "pos": "verb",
            "sent1": "She opened the jar with a twist.",
            "sent2": "The store opened early for the sale.",
            "sent3": "He opened his mind to new ideas.",
            "sent4": "The key opened the mysterious chest.",
            "sent5": "The new bridge opened up a quicker route."
        },
        {
            "definition": "To begin or start",
            "pos": "verb",
            "sent1": "The show opened with a lively dance number.",
            "sent2": "They opened the meeting with a brief introduction.",
            "sent3": "He opened the race with a sprint.",
            "sent4": "The chef opened the meal with a flavorful appetizer.",
            "sent5": "The concert opened with a beautiful melody."
        },
        {
            "definition": "To unfold or spread out",
            "pos": "verb",
            "sent1": "She opened the map to find their location.",
            "sent2": "The flower opened its petals to the sun.",
            "sent3": "He opened the newspaper to the sports section.",
            "sent4": "The butterfly opened its wings to take flight.",
            "sent5": "The magician opened the deck of cards for his trick."
        },
        {
            "definition": "To disclose or reveal",
            "pos": "verb",
            "sent1": "The detective opened the case to the public.",
            "sent2": "The author opened up about her inspiration for the book.",
            "sent3": "The scientist opened the results of the experiment to scrutiny.",
            "sent4": "The artist opened his sketchbook to show his latest work.",
            "sent5": "The teacher opened the discussion to hear different opinions."
        }
    ]
}