{
    "term": "oppositions",
    "meanings": [
        {
            "definition": "The act of opposing or resisting something.",
            "pos": "noun",
            "sent1": "The football team faced strong oppositions during the championship game.",
            "sent2": "The oppositions to the new law were vocal and persistent.",
            "sent3": "The oppositions to eating vegetables were quickly silenced by the delicious stir-fry.",
            "sent4": "The dark clouds in the sky were in direct oppositions to the bright sun shining.",
            "sent5": "The student's oppositions to doing homework were evident in his reluctance to open his books."
        },
        {
            "definition": "A person or group that is against something.",
            "pos": "noun",
            "sent1": "The oppositions gathered outside the courthouse to protest the decision.",
            "sent2": "The political oppositions criticized the government's new policy.",
            "sent3": "The oppositions to early mornings were evident in the sleepy yawns of the students.",
            "sent4": "The oppositions stood firm like a wall against the proposed changes.",
            "sent5": "The loud cheers of the oppositions filled the room with their disapproval."
        },
        {
            "definition": "The state of being in conflict or disagreement with someone or something.",
            "pos": "noun",
            "sent1": "The siblings were in constant oppositions over who got to use the computer first.",
            "sent2": "The oppositions between the two countries led to a long-standing feud.",
            "sent3": "The oppositions between the cat and the dog made for entertaining family dynamics.",
            "sent4": "The oppositions in opinions created a tense atmosphere in the meeting room.",
            "sent5": "The teacher tried to mediate the oppositions between the students to promote harmony in the classroom."
        }
    ]
}