{
    "term": "opposition",
    "meanings": [
        {
            "definition": "Resistance or dissent",
            "pos": "noun",
            "sent1": "The students showed opposition to the new school rule.",
            "sent2": "The political parties were in opposition on the proposed law.",
            "sent3": "The cat's opposition to taking a bath was quite amusing.",
            "sent4": "The opposition between light and darkness symbolized the eternal struggle.",
            "sent5": "The loud cheers of the fans were in direct opposition to the silence of the losing team."
        },
        {
            "definition": "A person or group that opposes or competes with another",
            "pos": "noun",
            "sent1": "The opposition in the debate presented strong arguments.",
            "sent2": "The soccer team faced tough opposition in the championship match.",
            "sent3": "The opposition of the siblings in the game made everyone laugh.",
            "sent4": "The opposition between the two companies led to fierce competition.",
            "sent5": "The political opposition gained support from the public for their stance."
        },
        {
            "definition": "The action of opposing or resisting",
            "pos": "noun",
            "sent1": "Her opposition to the decision was clear from her expression.",
            "sent2": "The boxer's strong opposition in the ring impressed the crowd.",
            "sent3": "The toddler's cute opposition to bedtime routine was endearing.",
            "sent4": "The opposition against the new policy grew stronger each day.",
            "sent5": "The mountain climber faced tough opposition from the harsh weather conditions."
        },
        {
            "definition": "Contrasting or conflicting relationship between two things",
            "pos": "noun",
            "sent1": "The opposition of colors in the painting created a striking effect.",
            "sent2": "The opposition between hot and cold temperatures was noticeable.",
            "sent3": "The opposition of flavors in the dish made it unique.",
            "sent4": "The opposition of opinions led to a lively discussion.",
            "sent5": "The opposition of styles in the fashion show caught everyone's attention."
        }
    ]
}