{
    "term": "oppressed",
    "meanings": [
        {
            "definition": "Subject to harsh and authoritarian treatment.",
            "pos": "adjective",
            "sent1": "The oppressed people had to endure cruel rules imposed by the dictator.",
            "sent2": "The villagers felt oppressed by the strict new laws enforced by the mayor.",
            "sent3": "The cat looked at the dog with an oppressed expression when it stole its favorite toy.",
            "sent4": "Her dreams felt oppressed by the reality of her difficult circumstances.",
            "sent5": "The dark clouds seemed to hang heavily over the oppressed town, casting a gloomy shadow."
        },
        {
            "definition": "Weighed down by mental or emotional distress.",
            "pos": "adjective",
            "sent1": "She felt oppressed by the overwhelming sadness that engulfed her after the loss of her pet.",
            "sent2": "The students seemed oppressed by the stress of upcoming exams.",
            "sent3": "The little girl's teddy bear looked at her with an oppressed expression when she accidentally dropped it in the mud.",
            "sent4": "His heart felt oppressed by the weight of unspoken words between them.",
            "sent5": "The silence in the room was so heavy, it felt almost physically oppressive to the oppressed woman sitting there."
        },
        {
            "definition": "Kept down by unjust use of power.",
            "pos": "adjective",
            "sent1": "The oppressed workers were not allowed to voice their concerns without facing severe consequences.",
            "sent2": "The citizens felt oppressed by the corrupt government's constant abuse of power.",
            "sent3": "The little bird looked oppressed as it struggled to fly against the strong wind.",
            "sent4": "Her spirit felt oppressed by the constant suppression of her creativity.",
            "sent5": "The weight of the unfair treatment pressed down on the oppressed community, making it hard for them to rise up."
        }
    ]
}