{
    "term": "opprobrium",
    "meanings": [
        {
            "definition": "Harsh criticism or censure.",
            "pos": "noun",
            "sent1": "The teacher faced opprobrium from the students for being unfair in grading.",
            "sent2": "The politician's actions were met with opprobrium from the public.",
            "sent3": "The opprobrium from his friends for wearing mismatched socks made him laugh.",
            "sent4": "The artist's latest work received opprobrium from art critics, likening it to a child's scribbles.",
            "sent5": "The opprobrium he received for his rude behavior left a lasting impact on his reputation."
        },
        {
            "definition": "Disgrace or shame.",
            "pos": "noun",
            "sent1": "She felt a deep sense of opprobrium after being caught cheating on the test.",
            "sent2": "The family tried to hide the opprobrium of their son's criminal activities.",
            "sent3": "The opprobrium of forgetting her friend's birthday made her blush with embarrassment.",
            "sent4": "The once-respected company now faced opprobrium due to their involvement in a scandal.",
            "sent5": "The opprobrium of being late to the important meeting was evident on his face."
        },
        {
            "definition": "Public disgrace arising from shameful conduct.",
            "pos": "noun",
            "sent1": "The celebrity's opprobrium was all over the news after the scandal broke.",
            "sent2": "The company's CEO resigned in the face of opprobrium following the embezzlement scandal.",
            "sent3": "The opprobrium of tripping and spilling his drink at the party made him the center of attention.",
            "sent4": "The politician's opprobrium was like a dark cloud hanging over his chances of reelection.",
            "sent5": "The opprobrium of being caught lying about his qualifications tarnished his professional reputation."
        }
    ]
}