{
    "term": "orant",
    "meanings": [
        {
            "definition": "A person who prays with outstretched arms.",
            "pos": "noun",
            "sent1": "During the church service, the orant stood with outstretched arms in prayer.",
            "sent2": "The orant in the painting looked peaceful with arms raised in prayer.",
            "sent3": "The orant at the front of the congregation accidentally knocked over a candle with their outstretched arms.",
            "sent4": "She felt like an orant, reaching out to the heavens for guidance.",
            "sent5": "The orant's posture, arms outstretched, symbolized a deep connection to the divine."
        },
        {
            "definition": "Praying with outstretched arms.",
            "pos": "verb",
            "sent1": "She would orant every evening, seeking solace in her prayers.",
            "sent2": "The devout monk would orant daily, his arms lifted towards the sky.",
            "sent3": "The children giggled as they tried to orant like the adults, arms reaching as high as they could.",
            "sent4": "In times of need, she would orant fervently, hoping for divine intervention.",
            "sent5": "The entire village watched as the shaman oranted for rain, arms extended in a plea to the heavens."
        },
        {
            "definition": "A figure in early Christian art representing a person in prayer.",
            "pos": "noun",
            "sent1": "The orant depicted in the mosaic had a serene expression, arms lifted in prayer.",
            "sent2": "Visitors to the cathedral admired the intricate details of the orant sculptures.",
            "sent3": "The orant in the painting seemed to be whispering secrets to the heavens.",
            "sent4": "The orant's posture in the fresco mirrored the believer's own moments of prayer.",
            "sent5": "The orant figure in the stained glass window glowed with divine light, captivating all who gazed upon it."
        }
    ]
}