{
    "term": "orb",
    "meanings": [
        {
            "definition": "A spherical body",
            "pos": "noun",
            "sent1": "The crystal orb glowed softly in the dark room.",
            "sent2": "The orb of light floated gently above the water.",
            "sent3": "The mischievous cat batted the orb around the room playfully.",
            "sent4": "Her eyes were like orbs of deep, dark pools, drawing you in.",
            "sent5": "The orb of the sun dipped below the horizon, painting the sky in hues of orange and pink."
        },
        {
            "definition": "A celestial body",
            "pos": "noun",
            "sent1": "The telescope revealed a distant orb in the night sky.",
            "sent2": "The astronauts marveled at the beauty of the distant orbs in space.",
            "sent3": "The aliens traveled from their home planet to study Earth's unique orb.",
            "sent4": "The orb of the moon cast a silvery glow over the landscape.",
            "sent5": "The orb of the planet shone brightly in the vast expanse of the universe."
        },
        {
            "definition": "A globe or sphere",
            "pos": "noun",
            "sent1": "She held a small glass orb in her hand, admiring its clarity.",
            "sent2": "The orb of the world spun slowly on its axis.",
            "sent3": "The magician made the orb disappear and reappear in his other hand.",
            "sent4": "The orb of the snow globe contained a miniature winter wonderland.",
            "sent5": "The crystal orb refracted light in a beautiful display of colors."
        },
        {
            "definition": "To form into a sphere or circle",
            "pos": "verb",
            "sent1": "She tried to orb the clay into a perfect ball, but it kept flattening out.",
            "sent2": "The artist carefully orbed the molten glass into a delicate shape.",
            "sent3": "The children giggled as they attempted to orb their playdough into various shapes.",
            "sent4": "The chef expertly orbed the dough before placing it in the oven.",
            "sent5": "The sculptor used his hands to orb the clay into a smooth, round form."
        }
    ]
}