{
    "term": "orbs",
    "meanings": [
        {
            "definition": "A spherical body",
            "pos": "noun",
            "sent1": "The crystal ball displayed mysterious orbs inside.",
            "sent2": "The marbles rolled around, their colorful orbs shining.",
            "sent3": "The playful kitten batted at the orbs, thinking they were toys.",
            "sent4": "Her eyes were like orbs of deep, dark pools, drawing you in.",
            "sent5": "The glowing orbs in the night sky mesmerized the stargazers."
        },
        {
            "definition": "A globe",
            "pos": "noun",
            "sent1": "The world map showed all countries as colorful orbs.",
            "sent2": "She spun the globe, stopping it with her finger on a random spot.",
            "sent3": "The children played catch with an inflatable globe, calling it orbs.",
            "sent4": "His collection of antique globes looked like precious orbs on display.",
            "sent5": "The glass globe on the desk refracted light, creating shimmering orbs."
        },
        {
            "definition": "A celestial body",
            "pos": "noun",
            "sent1": "The telescope revealed distant orbs twinkling in the night sky.",
            "sent2": "A shooting star streaked past the glowing orb of the moon.",
            "sent3": "The aliens in the movie traveled from planet to planet in their orbs.",
            "sent4": "The comet appeared as a fiery orb blazing through the darkness.",
            "sent5": "The astronaut marveled at the beauty of the distant orbs during the spacewalk."
        },
        {
            "definition": "A circular object",
            "pos": "noun",
            "sent1": "She held the golden orb in her hand, feeling its smooth surface.",
            "sent2": "The wheel of the bicycle spun, its metal orbs reflecting sunlight.",
            "sent3": "The magician pulled colorful scarves out of his mysterious orb.",
            "sent4": "The crystal ball was a mystical orb that revealed secrets to the fortune teller.",
            "sent5": "The clock's ticking echoed in the room, each second marked by the moving orb of time."
        },
        {
            "definition": "A round shape",
            "pos": "noun",
            "sent1": "The full moon shone brightly, a perfect orb in the night sky.",
            "sent2": "The artist painted a large orb in the center of the canvas.",
            "sent3": "The snowball grew larger and larger, becoming a heavy orb in his hands.",
            "sent4": "The boulder at the top of the hill was a massive orb waiting to roll down.",
            "sent5": "The balloon floated gracefully, a colorful orb against the clear blue sky."
        }
    ]
}