{
    "term": "ordination",
    "meanings": [
        {
            "definition": "The act of ordaining or conferring holy orders.",
            "pos": "noun",
            "sent1": "The ordination of the new priest took place in the grand cathedral.",
            "sent2": "The bishop performed the ordination of the deacon with solemnity.",
            "sent3": "During the ordination ceremony, the priest accidentally tripped over his robe, causing a moment of laughter.",
            "sent4": "The ordination of the young monk symbolized a new beginning in the monastery.",
            "sent5": "The sunlight streaming through the stained glass windows during the ordination created a serene atmosphere."
        },
        {
            "definition": "The state of being ordained or consecrated for a religious office.",
            "pos": "noun",
            "sent1": "After his ordination, the pastor felt a deep sense of responsibility towards his congregation.",
            "sent2": "The ordination of the bishop was a significant event for the entire diocese.",
            "sent3": "The ordination of the new nun brought a sense of peace to the convent.",
            "sent4": "Her ordination marked the beginning of her spiritual journey as a dedicated nun.",
            "sent5": "The community gathered to witness the ordination of their beloved priest."
        },
        {
            "definition": "The ceremony or service of ordaining someone for a religious position.",
            "pos": "noun",
            "sent1": "The ordination was attended by many members of the church community.",
            "sent2": "The elaborate ordination ceremony lasted for several hours.",
            "sent3": "During the ordination service, the choir sang hymns of praise.",
            "sent4": "The ordination of the new bishop was a momentous occasion for the church.",
            "sent5": "The bells rang joyfully throughout the town to celebrate the ordination of the young priest."
        }
    ]
}