{
    "term": "organa",
    "meanings": [
        {
            "definition": "A musical instrument with multiple pipes sounded by compressed air.",
            "pos": "noun",
            "sent1": "The grand church had a beautiful organa that filled the air with music.",
            "sent2": "She played the organa at the concert, mesmerizing the audience with her talent.",
            "sent3": "The organa in the music room seemed to have a mind of its own, playing tunes at random times.",
            "sent4": "His voice was like an organa, resonating through the room with power and emotion.",
            "sent5": "The organa's melody echoed through the halls, creating a magical atmosphere."
        },
        {
            "definition": "A group of tissues in a living organism that have a specific function.",
            "pos": "noun",
            "sent1": "The heart is a vital organa that pumps blood throughout the body.",
            "sent2": "Doctors study the different organas in the body to understand how they work together.",
            "sent3": "The stomach organa grumbled loudly, demanding to be fed.",
            "sent4": "Her brain worked like a complex organa, processing thoughts and memories effortlessly.",
            "sent5": "Each organa in the body plays a unique role in maintaining health and balance."
        },
        {
            "definition": "The plural form of 'organum', a type of medieval music.",
            "pos": "noun",
            "sent1": "The choir sang beautiful organa during the medieval music festival.",
            "sent2": "Scholars studied the origins of organa to understand its significance in history.",
            "sent3": "The tavern echoed with the lively sounds of organa, transporting patrons to another era.",
            "sent4": "The organa of the past resonated with tales of love and valor, passed down through generations.",
            "sent5": "Listening to the haunting melodies of organa, one could feel the spirit of the medieval times."
        }
    ]
}