{
    "term": "orgia",
    "meanings": [
        {
            "definition": "A wild party or celebration involving excessive drinking and promiscuity.",
            "pos": "noun",
            "sent1": "Last night, the neighborhood had an orgia with loud music and people dancing wildly.",
            "sent2": "The orgia at the beach was filled with laughter, music, and people having a great time.",
            "sent3": "The orgia at the office party got a bit out of hand with everyone dancing on the tables.",
            "sent4": "The city streets turned into an orgia of celebration after the team won the championship.",
            "sent5": "The movie depicted an orgia where people were enjoying themselves without any worries."
        },
        {
            "definition": "A group of people engaging in unrestrained and uninhibited sexual activity.",
            "pos": "noun",
            "sent1": "In the movie, there was a scene showing an orgia in ancient Rome.",
            "sent2": "The scandalous rumors about the orgia at the mansion spread quickly through the town.",
            "sent3": "The comedy show had a hilarious skit about a mistaken orgia at a fancy dinner party.",
            "sent4": "The novel described the royal orgia that shocked the entire kingdom.",
            "sent5": "The painting captured the intensity of an orgia with its vivid colors and tangled bodies."
        },
        {
            "definition": "A frenzied or chaotic event or situation.",
            "pos": "noun",
            "sent1": "The storm created an orgia of swirling leaves and debris in the backyard.",
            "sent2": "The protest turned into an orgia of shouting and pushing as tensions rose.",
            "sent3": "The kitchen became an orgia of pots and pans clattering as dinner preparations went awry.",
            "sent4": "The market was an orgia of activity with vendors calling out and customers bustling around.",
            "sent5": "The classroom was an orgia of excitement as the students eagerly awaited the surprise guest."
        }
    ]
}