{
    "term": "orientation",
    "meanings": [
        {
            "definition": "The act or process of orienting or the state of being oriented.",
            "pos": "noun",
            "sent1": "During the orientation, the new students learned about the campus layout.",
            "sent2": "Her orientation towards problem-solving is very logical and systematic.",
            "sent3": "The confused squirrel had an orientation session on how to find its way back to the tree.",
            "sent4": "His orientation towards success is like a compass always pointing north.",
            "sent5": "The astronaut's orientation in space was crucial for a safe return to Earth."
        },
        {
            "definition": "A person's basic attitude, beliefs, or feelings in relation to a particular subject or issue.",
            "pos": "noun",
            "sent1": "His orientation towards teamwork is positive and encouraging.",
            "sent2": "She had an orientation that valued honesty above all else.",
            "sent3": "The cat's orientation towards the new catnip toy was one of curiosity and excitement.",
            "sent4": "Her orientation towards life was like a colorful painting, full of optimism and joy.",
            "sent5": "The child's orientation towards sharing made them a favorite playmate among friends."
        },
        {
            "definition": "The relative physical position or direction of something.",
            "pos": "noun",
            "sent1": "The map provided the orientation needed to reach the destination.",
            "sent2": "The orientation of the building allowed for maximum sunlight exposure.",
            "sent3": "The puppy's orientation towards the treat was comically off, leading to a playful chase.",
            "sent4": "The compass needle's orientation towards the north guided the hikers through the forest.",
            "sent5": "The ship captain's orientation at sea was impeccable, never losing track of the course."
        }
    ]
}