{
    "term": "ornithopters",
    "meanings": [
        {
            "definition": "A type of aircraft that flies by flapping its wings like a bird.",
            "pos": "noun",
            "sent1": "The ornithopters soared gracefully through the sky.",
            "sent2": "Scientists are studying ornithopters to improve aviation technology.",
            "sent3": "The ornithopters at the airshow amazed the audience with their lifelike movements.",
            "sent4": "Watching the ornithopters in flight felt like witnessing nature's own ballet.",
            "sent5": "Children marveled at the ornithopters, imagining themselves flying alongside them."
        },
        {
            "definition": "Machines designed to mimic the flight of birds by flapping their wings.",
            "pos": "noun",
            "sent1": "The ornithopters in the museum displayed intricate wing mechanisms.",
            "sent2": "Engineers are working on improving the efficiency of ornithopters.",
            "sent3": "The ornithopters in the park delighted visitors with their realistic movements.",
            "sent4": "The ornithopters in the movie looked like magical creatures come to life.",
            "sent5": "The ornithopters in the science fair amazed everyone with their lifelike flight."
        },
        {
            "definition": "Devices that achieve flight by imitating the wing movements of birds.",
            "pos": "noun",
            "sent1": "The ornithopters in the competition demonstrated impressive aerodynamics.",
            "sent2": "Researchers are studying the mechanics of ornithopters for future innovations.",
            "sent3": "The ornithopters in the garden provided a whimsical touch to the scenery.",
            "sent4": "The ornithopters in the storybook seemed to come alive with each page turn.",
            "sent5": "The ornithopters in the exhibit captivated visitors with their realistic flight patterns."
        }
    ]
}