{
    "term": "orphism",
    "meanings": [
        {
            "definition": "A movement in art characterized by abstract, geometric forms",
            "pos": "noun",
            "sent1": "The orphism of the painting created a sense of depth and movement.",
            "sent2": "Many artists in the early 20th century were influenced by orphism in their work.",
            "sent3": "The orphism of the sculpture made it look like it was dancing.",
            "sent4": "Her use of orphism in the artwork transformed the ordinary shapes into a mesmerizing display.",
            "sent5": "The vibrant colors and shapes of orphism in the painting captured everyone's attention."
        },
        {
            "definition": "A belief in the principles of Orpheus, especially in the power of music and poetry",
            "pos": "noun",
            "sent1": "The musician's orphism inspired many to appreciate the beauty of music.",
            "sent2": "In Greek mythology, Orpheus was known for his orphism and musical talents.",
            "sent3": "Her deep orphism in poetry led her to write heartfelt verses.",
            "sent4": "The orphism of his words enchanted all who listened to his poetry.",
            "sent5": "The power of orphism in music can evoke strong emotions in listeners."
        },
        {
            "definition": "A suffix denoting a particular doctrine, theory, or practice",
            "pos": "noun",
            "sent1": "The addition of orphism to the word changed its meaning completely.",
            "sent2": "In linguistic terms, orphism is used to indicate a specific set of beliefs.",
            "sent3": "The professor explained the concept of orphism in a clear and concise manner.",
            "sent4": "The orphism in the terminology helped categorize different types of theories.",
            "sent5": "Understanding the significance of orphism in language can enhance communication skills."
        }
    ]
}