{
    "term": "orreries",
    "meanings": [
        {
            "definition": "A mechanical model of the solar system",
            "pos": "noun",
            "sent1": "The orreries in the science museum showed how planets move around the sun.",
            "sent2": "She studied the orreries carefully to understand how the planets orbit the sun.",
            "sent3": "The orreries on the teacher's desk made the classroom look like a tiny solar system.",
            "sent4": "His mind was like a complex orreries, each thought a planet orbiting a central idea.",
            "sent5": "The intricate orreries fascinated the students with its moving planets and sun."
        },
        {
            "definition": "A device used to demonstrate the motion of planets",
            "pos": "noun",
            "sent1": "The orreries on display helped students visualize how planets move in space.",
            "sent2": "The scientist used the orreries to explain the orbits of different planets.",
            "sent3": "During the science fair, the orreries amazed everyone with their spinning planets.",
            "sent4": "Her explanation was like an orreries, each point circling around the main idea.",
            "sent5": "The orreries whirred softly, showing the dance of planets around the sun."
        },
        {
            "definition": "A type of astronomical instrument",
            "pos": "noun",
            "sent1": "The orreries in the observatory helped astronomers track the movement of celestial bodies.",
            "sent2": "The ancient orreries were used by astronomers to predict planetary positions.",
            "sent3": "The orreries at the science conference were the highlight of the event.",
            "sent4": "His thoughts spun like an orreries, each idea revolving around the concept of the universe.",
            "sent5": "The intricate orreries gleamed in the dim light, a symbol of mankind's curiosity about the cosmos."
        }
    ]
}