{
    "term": "orthostatic",
    "meanings": [
        {
            "definition": "relating to or caused by an upright or standing position",
            "pos": "adjective",
            "sent1": "The doctor explained that the orthostatic exercises would help improve my balance.",
            "sent2": "She felt dizzy when she stood up quickly, a common orthostatic reaction.",
            "sent3": "The penguin tried to be orthostatic like the flamingo, but it kept falling over.",
            "sent4": "His orthostatic posture made him seem taller and more confident.",
            "sent5": "The teacher demonstrated the orthostatic position by standing straight with feet together."
        },
        {
            "definition": "a sudden drop in blood pressure when standing up",
            "pos": "noun",
            "sent1": "After standing up too fast, she experienced an orthostatic episode.",
            "sent2": "Orthostatic can sometimes lead to fainting if not managed properly.",
            "sent3": "The orthostatic surprise caught her off guard during the meeting.",
            "sent4": "The doctor monitored his orthostatic closely to prevent any complications.",
            "sent5": "The nurse quickly responded to the patient's orthostatic symptoms to stabilize their condition."
        },
        {
            "definition": "a test to measure changes in blood pressure and heart rate when moving from lying down to standing up",
            "pos": "noun",
            "sent1": "The orthostatic revealed significant changes in his blood pressure readings.",
            "sent2": "Doctors often use orthostatic to assess cardiovascular health.",
            "sent3": "During the orthostatic, he tried not to giggle as the nurse took his measurements.",
            "sent4": "The results of the orthostatic helped the medical team understand his condition better.",
            "sent5": "She practiced deep breathing before the orthostatic to keep her heart rate steady."
        }
    ]
}