{
    "term": "ostensive",
    "meanings": [
        {
            "definition": "Directly or clearly demonstrative",
            "pos": "adjective",
            "sent1": "The teacher used an ostensive gesture to show the correct way to solve the math problem.",
            "sent2": "Her ostensive behavior made it easy for everyone to understand her intentions.",
            "sent3": "The cat's ostensive attempt to open the door by pawing at it was both cute and ineffective.",
            "sent4": "The storm clouds were an ostensive warning of the impending bad weather.",
            "sent5": "The bright red color of the stop sign was ostensive, ensuring drivers noticed it easily."
        },
        {
            "definition": "Serving as a demonstration or example",
            "pos": "adjective",
            "sent1": "The ostensive video tutorial helped me learn how to cook a new recipe.",
            "sent2": "The museum displayed an ostensive collection of ancient artifacts for visitors to admire.",
            "sent3": "His ostensive attempt at juggling ended with all the balls rolling away in different directions.",
            "sent4": "The old lighthouse served as an ostensive guide for ships navigating the rocky coast.",
            "sent5": "The detailed map was an ostensive tool for hikers to find their way through the forest."
        },
        {
            "definition": "Manifest or evident",
            "pos": "adjective",
            "sent1": "The joy on her face was ostensive, clearly showing her happiness.",
            "sent2": "The ostensive signs of spring were everywhere, from blooming flowers to chirping birds.",
            "sent3": "His ostensive excitement about the upcoming concert was contagious.",
            "sent4": "The ostensive smell of freshly baked cookies filled the kitchen, tempting everyone.",
            "sent5": "The ostensive footprints in the snow revealed the path the hiker had taken through the woods."
        }
    ]
}