{
    "term": "ould",
    "meanings": [
        {
            "definition": "Past tense of 'will'",
            "pos": "verb",
            "sent1": "Yesterday, I ould go to the park with my friends.",
            "sent2": "She ould finish her homework before dinner.",
            "sent3": "If I ould fly like a bird, I would visit all the countries in the world!",
            "sent4": "His determination ould move mountains.",
            "sent5": "The memory of her smile ould warm his heart on cold days."
        },
        {
            "definition": "Used to express possibility or ability",
            "pos": "adverb",
            "sent1": "I ould possibly finish the puzzle by tonight.",
            "sent2": "She ould easily lift the heavy box.",
            "sent3": "If I ould run as fast as a cheetah, I would win every race!",
            "sent4": "Her laughter ould brighten even the gloomiest days.",
            "sent5": "The idea of exploring the unknown ould excite him beyond measure."
        },
        {
            "definition": "A person's ancestors or family",
            "pos": "noun",
            "sent1": "My ould always tell the best stories about our family history.",
            "sent2": "She learned a lot about her ould during the family reunion.",
            "sent3": "The portrait of his ould hanging on the wall seemed to watch over the room.",
            "sent4": "The roots of the family tree ould stretch far and wide.",
            "sent5": "The traditions passed down from his ould were cherished and honored."
        },
        {
            "definition": "A type of grain or cereal crop",
            "pos": "noun",
            "sent1": "The farmer harvested the ripe ould from the fields.",
            "sent2": "She baked delicious bread using the finest ould.",
            "sent3": "The golden color of the ould fields shimmered in the sunlight.",
            "sent4": "The fields of ould swayed gently in the breeze like a sea of gold.",
            "sent5": "The aroma of freshly baked ould bread filled the kitchen with warmth."
        }
    ]
}