{
    "term": "out",
    "meanings": [
        {
            "definition": "Away from the inside or center",
            "pos": "adverb",
            "sent1": "The cat ran out of the house.",
            "sent2": "She went out to play in the yard.",
            "sent3": "The squirrel jumped out of the tree and surprised everyone.",
            "sent4": "The secret was finally out, and everyone knew.",
            "sent5": "The bright sun shone out from behind the clouds."
        },
        {
            "definition": "Not at home",
            "pos": "adverb",
            "sent1": "Mom is out running errands.",
            "sent2": "Dad is out at work all day.",
            "sent3": "The dog is out exploring the neighborhood again.",
            "sent4": "The truth is out there, but not at home.",
            "sent5": "The kids are out playing in the park with their friends."
        },
        {
            "definition": "In the open air",
            "pos": "adverb",
            "sent1": "They love to eat out on the patio.",
            "sent2": "Let's have a picnic out in the park.",
            "sent3": "The concert was held out in the field under the stars.",
            "sent4": "The kite soared out in the clear blue sky.",
            "sent5": "The flowers bloomed beautifully out in the garden."
        },
        {
            "definition": "Finished or completed",
            "pos": "adjective",
            "sent1": "The puzzle is finally out and ready to be framed.",
            "sent2": "The project is out, and it turned out great.",
            "sent3": "The book is out, and the ending was unexpected.",
            "sent4": "The painting is out, and it's a masterpiece.",
            "sent5": "The homework is out, and now it's time to relax."
        },
        {
            "definition": "Revealed or made public",
            "pos": "adjective",
            "sent1": "The truth is finally out, and there's no more hiding.",
            "sent2": "The secret is out, and everyone knows now.",
            "sent3": "The news is out, and it's spreading quickly.",
            "sent4": "The plan is out, and it's causing a stir.",
            "sent5": "The scandal is out, and it's all over the headlines."
        }
    ]
}