{
    "term": "outbark",
    "meanings": [
        {
            "definition": "To bark louder or more frequently than another dog.",
            "pos": "verb",
            "sent1": "The small dog tried to outbark the big dog in the park.",
            "sent2": "The neighbor's dog tends to outbark all the other dogs in the neighborhood.",
            "sent3": "The competition was fierce as each dog tried to outbark the others for the title of 'Loudest Pup'.",
            "sent4": "The enthusiastic puppy managed to outbark even the most vocal of the older dogs.",
            "sent5": "The echo of the dog's outbark reverberated through the quiet night."
        },
        {
            "definition": "To surpass in barking.",
            "pos": "verb",
            "sent1": "The energetic puppy always manages to outbark his siblings during playtime.",
            "sent2": "The champion barker was able to outbark all the other dogs at the competition.",
            "sent3": "It was a surprise to see the little dog outbark the big, intimidating ones at the park.",
            "sent4": "The determined dog would not stop until he could outbark every other dog in the neighborhood.",
            "sent5": "The loud outbark of the dog startled the birds nearby, causing them to fly away in a hurry."
        },
        {
            "definition": "To bark louder or more frequently than someone or something else.",
            "pos": "verb",
            "sent1": "The excited dog would always outbark whenever the doorbell rang.",
            "sent2": "The guard dog would outbark any intruders who dared to approach the house.",
            "sent3": "The mischievous squirrel seemed to enjoy trying to outbark the dogs from the safety of the tree.",
            "sent4": "The determined dog managed to outbark the noisy construction site next door.",
            "sent5": "The outbark of the dog was so loud that it could be heard from across the street."
        }
    ]
}