{
    "term": "outbar",
    "meanings": [
        {
            "definition": "To surpass in barring or excluding.",
            "pos": "verb",
            "sent1": "She managed to outbar all the other candidates from entering the competition.",
            "sent2": "The security guard had to outbar the intruder from accessing the restricted area.",
            "sent3": "The clever squirrel outbarred the birds from the bird feeder by building a better defense.",
            "sent4": "His determination to outbar any obstacles in his way was like a strong fortress.",
            "sent5": "The knight's shield was like a magical barrier, able to outbar any enemy attack."
        },
        {
            "definition": "To prevent from entering or gaining access.",
            "pos": "verb",
            "sent1": "The locked gate will outbar anyone without the key from entering the garden.",
            "sent2": "The bouncer had to outbar the underage individuals from entering the club.",
            "sent3": "The mischievous cat tried to outbar the dog from entering its favorite sleeping spot.",
            "sent4": "Her determination to outbar distractions was like wearing blinders to focus on her work.",
            "sent5": "The strong password was able to outbar any unauthorized users from accessing the account."
        },
        {
            "definition": "To shut out or exclude from a place or group.",
            "pos": "verb",
            "sent1": "The exclusive club would outbar anyone who did not meet their strict membership criteria.",
            "sent2": "The clique of friends decided to outbar the new student from joining their group.",
            "sent3": "The mischievous raccoon tried to outbar the other animals from entering its den.",
            "sent4": "His loud music outbarred any chance of hearing the approaching storm outside.",
            "sent5": "The high walls of the fortress outbarred any invaders from entering the kingdom."
        }
    ]
}