{
    "term": "outbrazened",
    "meanings": [
        {
            "definition": "To surpass in boldness or shamelessness.",
            "pos": "verb",
            "sent1": "She outbrazened all her classmates by speaking up in front of the whole school.",
            "sent2": "The thief outbrazened the security guards by walking out of the store with stolen goods.",
            "sent3": "The squirrel outbrazened the birds by stealing their food right in front of them.",
            "sent4": "The politician outbrazened his opponents by making outrageous claims during the debate.",
            "sent5": "The young artist outbrazened criticism and continued to showcase her unique style."
        },
        {
            "definition": "To act with audacity or defiance.",
            "pos": "verb",
            "sent1": "Despite the warnings, he outbrazened the rules and went swimming in the forbidden lake.",
            "sent2": "The protestors outbrazened the authorities by refusing to disperse from the public square.",
            "sent3": "The cat outbrazened the dog by stealing its favorite toy and parading around with it.",
            "sent4": "She outbrazened her fears and stood up to the bully in front of the whole school.",
            "sent5": "The young boy outbrazened his shyness and performed confidently in the school play."
        },
        {
            "definition": "To exhibit brazen behavior.",
            "pos": "verb",
            "sent1": "The celebrity outbrazened the paparazzi by posing for photos even after being asked to stop.",
            "sent2": "The student outbrazened the teacher by talking back in front of the whole class.",
            "sent3": "The raccoon outbrazened the homeowners by rummaging through the trash cans every night.",
            "sent4": "The toddler outbrazened his parents by throwing a tantrum in the middle of the store.",
            "sent5": "The politician outbrazened the public by denying any wrongdoing despite clear evidence."
        }
    ]
}