{
    "term": "outcharged",
    "meanings": [
        {
            "definition": "To charge more than the usual or proper amount.",
            "pos": "verb",
            "sent1": "The store outcharged me for the shirt, so I had to ask for a refund.",
            "sent2": "The mechanic outcharged for the simple repair, taking advantage of my lack of knowledge.",
            "sent3": "I felt outcharged when the ice cream vendor asked for double the price just because it was a hot day.",
            "sent4": "The taxi driver outcharged me like I was a millionaire, making me regret not negotiating the fare beforehand.",
            "sent5": "The hotel outcharged for the room, making me rethink my choice of accommodation."
        },
        {
            "definition": "To be charged excessively.",
            "pos": "verb",
            "sent1": "I was outcharged for the movie ticket, but I didn't realize until after the film had started.",
            "sent2": "The restaurant outcharged for a simple salad, making me question their pricing strategy.",
            "sent3": "Feeling outcharged for the subpar service, I decided not to leave a tip.",
            "sent4": "The airline outcharged for the extra luggage, leaving me with no choice but to pay the hefty fee.",
            "sent5": "Being outcharged for the online purchase, I immediately contacted customer service for a refund."
        },
        {
            "definition": "To have been charged more than is necessary.",
            "pos": "verb",
            "sent1": "Realizing I had been outcharged for the groceries, I hurried back to the store for a refund.",
            "sent2": "The customer felt outcharged for the product, leading to negative reviews about the company.",
            "sent3": "I found it amusing how I was outcharged for the expired milk at the convenience store.",
            "sent4": "The tourist was outcharged for the souvenir, but he didn't mind as it was his last day of vacation.",
            "sent5": "The student was outcharged for the textbook, causing frustration as it was already an expensive purchase."
        }
    ]
}