{
    "term": "outcrowd",
    "meanings": [
        {
            "definition": "A group of people who are not part of the main or dominant group.",
            "pos": "noun",
            "sent1": "The outcrowd gathered at the park for their own picnic away from the main group.",
            "sent2": "The outcrowd of students formed their own club outside of school.",
            "sent3": "The outcrowd decided to have a secret meeting in the library to plan a surprise for the main group.",
            "sent4": "She felt like she belonged more to the outcrowd than the popular kids in school.",
            "sent5": "The outcrowd of artists created unique and unconventional pieces that stood out from the rest."
        },
        {
            "definition": "To surpass or outdo a competitor or rival.",
            "pos": "verb",
            "sent1": "In the competition, she managed to outcrowd her opponent by scoring the highest points.",
            "sent2": "The new product design aimed to outcrowd all other similar items in the market.",
            "sent3": "He always tried to outcrowd his brother in sports, but they both enjoyed the friendly competition.",
            "sent4": "Her determination to outcrowd the competition led her to practice tirelessly every day.",
            "sent5": "The team's innovative strategy helped them outcrowd their rivals and secure the top spot in the tournament."
        },
        {
            "definition": "To move away from a crowded or enclosed space.",
            "pos": "verb",
            "sent1": "Feeling overwhelmed, she decided to outcrowd the busy shopping mall and take a walk in the park.",
            "sent2": "The passengers rushed to outcrowd the train as soon as the doors opened at the station.",
            "sent3": "The cat tried to outcrowd the other pets in the small room by finding a cozy spot near the window.",
            "sent4": "As the event ended, people started to outcrowd the venue, eager to avoid the traffic jam.",
            "sent5": "The hikers planned to outcrowd the popular trail and explore a more secluded path in the mountains."
        }
    ]
}