{
    "term": "outflank",
    "meanings": [
        {
            "definition": "To surpass or get the better of by artful maneuvering.",
            "pos": "verb",
            "sent1": "The clever fox managed to outflank the slower rabbit in the race.",
            "sent2": "The detective used his wit to outflank the criminal and solve the case.",
            "sent3": "The mischievous squirrel tried to outflank the bird feeder but got caught in the act.",
            "sent4": "Her strategic thinking allowed her to outflank her competitors in the business world.",
            "sent5": "The chess player's move to outflank the opponent's queen was unexpected and brilliant."
        },
        {
            "definition": "To go around the flank of (an opposing force).",
            "pos": "verb",
            "sent1": "The army planned to outflank the enemy by taking a hidden path through the forest.",
            "sent2": "The pirates attempted to outflank the navy's ships to reach the treasure island.",
            "sent3": "The sneaky cat tried to outflank the dog by sneaking through the back door.",
            "sent4": "The running back managed to outflank the defenders and score a touchdown.",
            "sent5": "The explorer's decision to outflank the mountain instead of climbing it directly saved time and energy."
        },
        {
            "definition": "To gain an advantage over.",
            "pos": "verb",
            "sent1": "She hoped to outflank her opponent in the upcoming debate by preparing thoroughly.",
            "sent2": "The company aimed to outflank its competitors by offering a unique product.",
            "sent3": "The magician tried to outflank his rival by performing a more impressive trick.",
            "sent4": "The student outflanked his classmates by scoring the highest on the test.",
            "sent5": "The athlete's determination to outflank his own record pushed him to train harder."
        }
    ]
}