{
    "term": "outgazes",
    "meanings": [
        {
            "definition": "To stare intently or fixedly at someone or something.",
            "pos": "verb",
            "sent1": "The cat outgazes the mouse, waiting for the perfect moment to pounce.",
            "sent2": "She outgazes her reflection in the mirror, trying to see if her new haircut suits her.",
            "sent3": "The little boy outgazes his vegetables, hoping they will magically disappear from his plate.",
            "sent4": "The detective outgazes the suspect, trying to read any signs of guilt in his eyes.",
            "sent5": "The owl outgazes its prey, calculating the perfect angle for the attack."
        },
        {
            "definition": "To look steadily or intently at someone or something.",
            "pos": "verb",
            "sent1": "The teacher outgazes each student during the exam to prevent cheating.",
            "sent2": "He outgazes the horizon, lost in thought about his future.",
            "sent3": "The baby outgazes the colorful mobile above the crib, mesmerized by the moving shapes.",
            "sent4": "The artist outgazes the blank canvas, envisioning the masterpiece that will come to life.",
            "sent5": "The hiker outgazes the mountain peak, determined to reach the summit before sunset."
        },
        {
            "definition": "To gaze out or beyond something.",
            "pos": "verb",
            "sent1": "She outgazes the window, daydreaming about faraway lands she longs to visit.",
            "sent2": "The astronaut outgazes the Earth from space, marveling at its beauty and vastness.",
            "sent3": "The child outgazes the fence, imagining the adventures that lie beyond it.",
            "sent4": "The poet outgazes the city skyline, seeking inspiration for his next verse.",
            "sent5": "The sailor outgazes the open sea, feeling the call of the unknown on the horizon."
        }
    ]
}