{
    "term": "outgoing",
    "meanings": [
        {
            "definition": "Friendly and sociable",
            "pos": "adjective",
            "sent1": "She is very outgoing and always greets everyone with a smile.",
            "sent2": "The outgoing girl made friends easily at the party.",
            "sent3": "His outgoing nature made the whole group feel comfortable around him.",
            "sent4": "Her outgoing personality shines brightly in social gatherings.",
            "sent5": "Being outgoing means being warm and welcoming to others."
        },
        {
            "definition": "Leaving a place",
            "pos": "verb",
            "sent1": "After saying goodbye, he started outgoing from the airport.",
            "sent2": "The train will be outgoing from the station in a few minutes.",
            "sent3": "The students were outgoing the classroom when the bell rang.",
            "sent4": "The ship was outgoing the harbor, heading towards the open sea.",
            "sent5": "Outgoing the building, he realized he forgot his keys inside."
        },
        {
            "definition": "Departing or going out",
            "pos": "adjective",
            "sent1": "The outgoing flight was delayed due to bad weather.",
            "sent2": "The outgoing passengers lined up to board the bus.",
            "sent3": "The outgoing train was filled with excited travelers.",
            "sent4": "The outgoing group waved goodbye as they left for their trip.",
            "sent5": "The outgoing crowd cheered as the parade began."
        },
        {
            "definition": "Expressing or revealing thoughts or feelings openly",
            "pos": "adjective",
            "sent1": "Her outgoing nature allowed her to share her feelings without hesitation.",
            "sent2": "The outgoing student was not afraid to speak up in class discussions.",
            "sent3": "His outgoing behavior made it easy for others to understand his emotions.",
            "sent4": "The outgoing artist poured his heart into his expressive paintings.",
            "sent5": "Being outgoing means being unafraid to show who you truly are."
        }
    ]
}