{
    "term": "outpress",
    "meanings": [
        {
            "definition": "To press out or squeeze out.",
            "pos": "verb",
            "sent1": "She tried to outpress the juice from the orange by squeezing it hard.",
            "sent2": "The athlete had to outpress all his strength to lift the heavy weights.",
            "sent3": "The toothpaste tube seemed to outpress every last bit of paste, refusing to give up.",
            "sent4": "Her determination to succeed was so strong, it felt like she could outpress any obstacle in her way.",
            "sent5": "The old machine groaned as it struggled to outpress the oil from the olives."
        },
        {
            "definition": "To surpass in pressing or squeezing.",
            "pos": "verb",
            "sent1": "In the arm-wrestling competition, he managed to outpress his opponent and win the match.",
            "sent2": "The hydraulic press was able to outpress any manual effort in flattening the metal sheets.",
            "sent3": "The competition was fierce as each participant tried to outpress the others in the grape stomping contest.",
            "sent4": "Her love for baking was so strong that she could outpress any doubts about her skills.",
            "sent5": "The giant python could easily outpress its prey, suffocating them with its powerful coils."
        },
        {
            "definition": "To publish or produce more copies of a book than a rival publisher.",
            "pos": "verb",
            "sent1": "The author decided to outpress the competition by releasing a special edition of the book.",
            "sent2": "The small publishing house managed to outpress the big companies by focusing on niche markets.",
            "sent3": "The bookstore owner joked that he would outpress his rival by selling books in his sleep.",
            "sent4": "Her enthusiasm for the project was so contagious that it seemed she could outpress any doubts about its success.",
            "sent5": "The printing press worked tirelessly to outpress the demand for the latest bestseller."
        }
    ]
}