{
    "term": "outpitch",
    "meanings": [
        {
            "definition": "To defeat or surpass in a pitching competition.",
            "pos": "verb",
            "sent1": "During the game, Sarah managed to outpitch all her opponents with her accurate throws.",
            "sent2": "The young pitcher hoped to outpitch the experienced players in the upcoming tournament.",
            "sent3": "The little league team was surprised to see their coach outpitch them effortlessly during practice.",
            "sent4": "In the final inning, the underdog team outpitched the reigning champions to claim victory.",
            "sent5": "His determination to outpitch his rivals fueled his intense training sessions."
        },
        {
            "definition": "To excel or outperform in pitching.",
            "pos": "verb",
            "sent1": "Despite his size, the pitcher managed to outpitch all his teammates with his accuracy.",
            "sent2": "The star player always aimed to outpitch himself in every game.",
            "sent3": "The robot pitcher was programmed to outpitch any human opponent it faced.",
            "sent4": "Her passion for the sport drove her to outpitch even the most skilled players.",
            "sent5": "The young athlete's dream was to outpitch the best pitchers in the league."
        },
        {
            "definition": "To outdo or outshine in pitching.",
            "pos": "verb",
            "sent1": "The rookie pitcher surprised everyone by outpitching the veteran players in the match.",
            "sent2": "The determined pitcher set out to outpitch his own personal record.",
            "sent3": "The pitcher's unique style allowed him to outpitch his competitors effortlessly.",
            "sent4": "Her dedication to practice helped her outpitch her rivals in the championship game.",
            "sent5": "The pitcher's unwavering focus enabled him to outpitch even the toughest opponents."
        }
    ]
}