{
    "term": "outriggers",
    "meanings": [
        {
            "definition": "A projecting beam or spar for supporting a boat's mast.",
            "pos": "noun",
            "sent1": "The outriggers on the boat kept the mast steady in the wind.",
            "sent2": "The sailors attached the outriggers to the mast to ensure it stayed upright.",
            "sent3": "The outriggers on the boat were like helpful arms holding up the mast.",
            "sent4": "The outriggers reached out like protective wings around the mast.",
            "sent5": "The outriggers acted as a strong foundation for the mast, preventing it from swaying."
        },
        {
            "definition": "A framework extending from the side of a canoe or other boat to prevent capsizing.",
            "pos": "noun",
            "sent1": "The outriggers on the canoe kept it balanced on the water.",
            "sent2": "Adding outriggers to the boat made it more stable in rough waters.",
            "sent3": "The outriggers on the canoe were like magical stabilizers, keeping it from tipping over.",
            "sent4": "The outriggers functioned as invisible hands, preventing the canoe from flipping.",
            "sent5": "The outriggers were like trusty companions, ensuring the canoe stayed afloat."
        },
        {
            "definition": "A structure extending from the side of a building for support or stability.",
            "pos": "noun",
            "sent1": "The outriggers on the building provided extra support during the storm.",
            "sent2": "Architects added outriggers to the structure for increased stability.",
            "sent3": "The outriggers on the building were like loyal guardians, protecting it from collapse.",
            "sent4": "The outriggers acted as invisible pillars, holding the building steady.",
            "sent5": "The outriggers were like strong roots, anchoring the building securely in place."
        }
    ]
}