{
    "term": "outsmoke",
    "meanings": [
        {
            "definition": "To surpass in smoking",
            "pos": "verb",
            "sent1": "He managed to outsmoke all his friends at the barbecue.",
            "sent2": "She always tries to outsmoke her colleagues during their smoke breaks.",
            "sent3": "The little squirrel tried to outsmoke the big bear, but it was just too small.",
            "sent4": "In the world of smoking, he was the one who could outsmoke anyone like a chimney.",
            "sent5": "The magician seemed to outsmoke everyone with his mysterious pipe tricks."
        },
        {
            "definition": "To defeat in a smoking competition",
            "pos": "verb",
            "sent1": "She trained hard to outsmoke her opponent in the smoking contest.",
            "sent2": "The champion was able to outsmoke all challengers in the annual smoking competition.",
            "sent3": "The cat thought it could outsmoke the dog in a puffing match, but it was mistaken.",
            "sent4": "He outsmoked his rival with ease, leaving no doubt about who was the better smoker.",
            "sent5": "The team captain knew he had to outsmoke the other team to secure victory in the smoking challenge."
        },
        {
            "definition": "To outdo in smoking",
            "pos": "verb",
            "sent1": "She always tries to outsmoke her friends by smoking the most cigarettes.",
            "sent2": "The daredevil attempted to outsmoke his previous record of cigars smoked in an hour.",
            "sent3": "The robot tried to outsmoke the humans by puffing on a cigar, but it malfunctioned.",
            "sent4": "He managed to outsmoke everyone at the party, impressing them with his smoking skills.",
            "sent5": "The old man could outsmoke anyone in the village, showing his experience in smoking."
        },
        {
            "definition": "To outwit in smoking",
            "pos": "verb",
            "sent1": "She used her clever tactics to outsmoke her opponents in the smoking challenge.",
            "sent2": "The detective was able to outsmoke the suspect during the interrogation.",
            "sent3": "The little mouse tried to outsmoke the cat by blowing smoke rings, confusing it.",
            "sent4": "He outsmoked his rival by coming up with a brilliant strategy during the smoking competition.",
            "sent5": "The cunning fox could outsmoke any other animal in the forest, always staying one step ahead."
        }
    ]
}