{
    "term": "outstated",
    "meanings": [
        {
            "definition": "To state or declare in excess of the truth",
            "pos": "verb",
            "sent1": "She outstated the number of cookies she ate to avoid getting in trouble.",
            "sent2": "The weather forecast outstated the actual amount of rainfall we received.",
            "sent3": "He outstated his height on the dating profile, making him seem taller than he really was.",
            "sent4": "Her excitement outstated her actual experience at the amusement park.",
            "sent5": "The politician's promises outstated his ability to deliver on them."
        },
        {
            "definition": "To surpass in stating or declaring",
            "pos": "verb",
            "sent1": "The singer outstated her previous performance with an outstanding rendition of the national anthem.",
            "sent2": "His presentation outstated all the others in terms of creativity and engagement.",
            "sent3": "The cat outstated the dog in the race to the food bowl.",
            "sent4": "The student's artwork outstated the rest of the class with its intricate details.",
            "sent5": "The athlete outstated his own record in the final sprint of the race."
        },
        {
            "definition": "To exceed in stating or declaring",
            "pos": "verb",
            "sent1": "The sales report outstated the company's projected earnings for the quarter.",
            "sent2": "Her enthusiasm outstated her actual knowledge on the subject during the presentation.",
            "sent3": "The chef outstated the recommended amount of seasoning in the recipe, resulting in a very salty dish.",
            "sent4": "The author's description of the setting outstated the reader's imagination, bringing the scene to life.",
            "sent5": "The student's excuse for being late outstated any previous excuses heard by the teacher."
        }
    ]
}