{
    "term": "outsailing",
    "meanings": [
        {
            "definition": "To sail faster or better than another ship.",
            "pos": "verb",
            "sent1": "During the race, our ship was outsailing the competition effortlessly.",
            "sent2": "The skilled captain managed to outsail all the other boats in the regatta.",
            "sent3": "The pirate captain boasted about outsailing the navy with his clever tactics.",
            "sent4": "The small fishing boat outsailed the storm, reaching the safety of the harbor.",
            "sent5": "With determination and skill, the sailor outsailed the rough waves to victory."
        },
        {
            "definition": "To surpass in sailing ability.",
            "pos": "verb",
            "sent1": "Despite the strong winds, the experienced sailor was able to outsail his companions.",
            "sent2": "She trained hard to outsail her fear of the open sea and finally set sail.",
            "sent3": "The young sailor challenged his mentor to a race, hoping to outsail him and prove his skills.",
            "sent4": "In the competition, only one captain could outsail the rest and claim the trophy.",
            "sent5": "The determined crew worked together to outsail the storm and reach the distant shore."
        },
        {
            "definition": "The act of sailing faster or better than another ship.",
            "pos": "noun",
            "sent1": "The outsailing of the sleek yacht left the spectators in awe.",
            "sent2": "In the history of naval battles, tales of outsailing have always been celebrated.",
            "sent3": "The annual regatta showcased the thrilling competition of outsailing among the participants.",
            "sent4": "The record-breaking outsailing of the clipper ship became legendary in maritime lore.",
            "sent5": "With grace and speed, the outsailing of the majestic vessel captured the attention of all."
        }
    ]
}