{
    "term": "overfearing",
    "meanings": [
        {
            "definition": "To be excessively afraid or anxious about something.",
            "pos": "verb",
            "sent1": "She was overfearing the dark hallway, imagining all sorts of scary things lurking in the shadows.",
            "sent2": "He tends to overfear when faced with new challenges, but he always manages to overcome his fears.",
            "sent3": "The cat was overfearing the vacuum cleaner, convinced it was a monster in disguise.",
            "sent4": "Her overfearing of failure was like a heavy chain holding her back from pursuing her dreams.",
            "sent5": "The overfearing storm clouds loomed ominously in the sky, threatening to unleash their fury at any moment."
        },
        {
            "definition": "The act of feeling excessive fear or anxiety.",
            "pos": "noun",
            "sent1": "His overfearing of public speaking made him avoid any situation where he might have to talk in front of a crowd.",
            "sent2": "The overfearing she experienced before the exam caused her hands to tremble and her heart to race.",
            "sent3": "The overfearing of spiders led her to scream and jump on the chair whenever she spotted one.",
            "sent4": "The overfearing in her eyes was evident as she hesitated to step onto the shaky bridge.",
            "sent5": "The overfearing in the room was palpable, as everyone waited nervously for the results to be announced."
        },
        {
            "definition": "To have an excessive amount of fear or anxiety.",
            "pos": "verb",
            "sent1": "He was overfearing the upcoming job interview, worrying about every possible question they might ask.",
            "sent2": "She tends to overfear when flying, gripping the armrest tightly during takeoff and landing.",
            "sent3": "The overfearing in his voice was evident as he described the encounter with the wild bear.",
            "sent4": "Her overfearing of rejection prevented her from taking the first step towards asking her crush out.",
            "sent5": "The overfearing clouds cast a shadow over the picnic, threatening to ruin the outdoor gathering."
        }
    ]
}