{
    "term": "overrode",
    "meanings": [
        {
            "definition": "To prevail over; conquer or defeat",
            "pos": "verb",
            "sent1": "In the game, the hero overrode the villain's evil plans.",
            "sent2": "The champion overrode all opponents to win the tournament.",
            "sent3": "The brave knight overrode the dragon with a swift strike.",
            "sent4": "Her determination overrode all obstacles in her path.",
            "sent5": "The sunlight overrode the darkness, bringing a new day."
        },
        {
            "definition": "To set aside or annul",
            "pos": "verb",
            "sent1": "The judge overrode the objection raised by the defense attorney.",
            "sent2": "She overrode the default settings to customize her preferences.",
            "sent3": "The teacher overrode the student's request for extra credit.",
            "sent4": "The storm overrode the carefully laid out picnic plans.",
            "sent5": "The new law overrode the old regulations, causing confusion."
        },
        {
            "definition": "To disregard or ignore",
            "pos": "verb",
            "sent1": "He overrode the warning signs and ventured into the forbidden forest.",
            "sent2": "The manager overrode the complaints and continued with the decision.",
            "sent3": "The curious cat overrode the 'Do Not Enter' sign and explored the room.",
            "sent4": "The loud noise overrode her attempts to concentrate on studying.",
            "sent5": "The strong smell of flowers overrode the musty scent of the old room."
        },
        {
            "definition": "To take precedence over",
            "pos": "verb",
            "sent1": "The safety of the passengers overrode the schedule of the train.",
            "sent2": "Quality overrode quantity in the selection of the materials.",
            "sent3": "The urgent message overrode all other notifications on his phone.",
            "sent4": "The health of the patient overrode the hospital's budget concerns.",
            "sent5": "The need for honesty overrode the temptation to deceive others."
        }
    ]
}