{
    "term": "overbooked",
    "meanings": [
        {
            "definition": "Booked beyond capacity.",
            "pos": "adjective",
            "sent1": "The small restaurant was overbooked, with every table full.",
            "sent2": "The hotel was overbooked during the holiday season, causing some guests to be turned away.",
            "sent3": "The overbooked flight led to a comical situation where passengers had to sit on each other's laps.",
            "sent4": "Her schedule was so overbooked that she felt like a tightly wound spring, ready to snap.",
            "sent5": "The overbooked train station was a chaotic mess, with people scrambling for seats."
        },
        {
            "definition": "To reserve more seats or rooms than are available.",
            "pos": "verb",
            "sent1": "The airline decided to overbook the flight to account for potential cancellations.",
            "sent2": "The hotel manager made a mistake and overbooked the rooms for the conference.",
            "sent3": "She accidentally overbooked the party venue, leading to a crowded but fun event.",
            "sent4": "The travel agency overbooked the tour bus, causing some passengers to stand for the entire trip.",
            "sent5": "The theater intentionally overbooked the show to ensure a full house on opening night."
        },
        {
            "definition": "To schedule too many appointments or events.",
            "pos": "verb",
            "sent1": "I tend to overbook my days, trying to fit too many tasks into a short amount of time.",
            "sent2": "The doctor's office overbooked appointments, resulting in long wait times for patients.",
            "sent3": "She overbooked her weekend with social gatherings, leaving no time for relaxation.",
            "sent4": "The event planner accidentally overbooked the venue, causing a logistical nightmare.",
            "sent5": "He realized he had overbooked himself when he had to rush from one meeting to the next without a break."
        }
    ]
}