{
    "term": "overpedalling",
    "meanings": [
        {
            "definition": "To pedal excessively while riding a bicycle.",
            "pos": "verb",
            "sent1": "She was overpedalling on her bike, making it hard to keep up with her.",
            "sent2": "He tends to overpedal when he's in a rush to get to work.",
            "sent3": "The squirrel looked like it was overpedalling on its tiny bicycle in the park.",
            "sent4": "His heart felt like it was overpedalling with excitement as he approached the finish line.",
            "sent5": "The sound of overpedalling echoed through the quiet street as she raced past."
        },
        {
            "definition": "To excessively use pedals on a musical instrument.",
            "pos": "verb",
            "sent1": "The pianist was overpedalling during the performance, causing some notes to blur together.",
            "sent2": "When he gets nervous, he tends to overpedal on the organ, creating a cacophony of sound.",
            "sent3": "The guitarist's foot slipped, and he ended up overpedalling on the pedal, resulting in a comical sound.",
            "sent4": "Her fingers danced on the piano keys, overpedalling with emotion in every note.",
            "sent5": "The room filled with the sound of overpedalling as the musician lost himself in the music."
        },
        {
            "definition": "To excessively use pedals in a vehicle.",
            "pos": "verb",
            "sent1": "He was overpedalling the gas pedal, causing the car to lurch forward.",
            "sent2": "The driver tends to overpedal when he's running late, burning through fuel quickly.",
            "sent3": "The kids giggled as their dad pretended to be overpedalling in the toy car at the amusement park.",
            "sent4": "The engine roared as he overpedalled, pushing the vehicle to its limits.",
            "sent5": "The smell of burnt rubber filled the air as he continued overpedalling on the accelerator."
        }
    ]
}