{
    "term": "overcapitalizes",
    "meanings": [
        {
            "definition": "To invest too much capital in a business or project.",
            "pos": "verb",
            "sent1": "She overcapitalizes by putting all her savings into the new company.",
            "sent2": "The company overcapitalizes on risky ventures, leading to financial troubles.",
            "sent3": "John always overcapitalizes on his friend's business ideas, even if they seem risky.",
            "sent4": "The team overcapitalizes their resources in one project, neglecting other important tasks.",
            "sent5": "The entrepreneur overcapitalizes on every opportunity, never considering the potential risks."
        },
        {
            "definition": "To assign too high a value to something.",
            "pos": "verb",
            "sent1": "He overcapitalizes his old car, thinking it's worth more than it is.",
            "sent2": "The seller overcapitalizes the antique vase, asking for an exorbitant price.",
            "sent3": "She always overcapitalizes her collection of vintage toys, believing they are priceless.",
            "sent4": "The appraiser overcapitalizes the painting, claiming it to be a masterpiece.",
            "sent5": "The auctioneer overcapitalizes the rare coin, creating a bidding frenzy among collectors."
        },
        {
            "definition": "To capitalize letters excessively in writing.",
            "pos": "verb",
            "sent1": "The student overcapitalizes every noun in the essay, making it hard to read.",
            "sent2": "The author overcapitalizes words for emphasis, but it distracts from the story.",
            "sent3": "In his excitement, he overcapitalizes every word in the text message.",
            "sent4": "The typist accidentally overcapitalizes the entire paragraph, causing confusion.",
            "sent5": "The editor notices that the writer tends to overcapitalize titles, which is against the style guide."
        }
    ]
}