{
    "term": "overhonors",
    "meanings": [
        {
            "definition": "To bestow excessive praise or recognition upon someone or something.",
            "pos": "verb",
            "sent1": "She overhonors her cat by throwing it a birthday party every month.",
            "sent2": "The teacher overhonors the student by giving them a gold star for every little thing.",
            "sent3": "He overhonors his favorite sports team by wearing their jersey every single day.",
            "sent4": "The company overhonors their top salesperson with a luxurious all-expenses-paid vacation.",
            "sent5": "The mayor overhonors the local hero with a grand parade and key to the city."
        },
        {
            "definition": "To give more respect or admiration than is deserved.",
            "pos": "verb",
            "sent1": "The celebrity overhonors their fans by personally responding to every single message.",
            "sent2": "She overhonors her boss by always agreeing with everything he says.",
            "sent3": "The child overhonors their imaginary friend by setting a place for them at the dinner table.",
            "sent4": "The artist overhonors their muse by dedicating every painting to them.",
            "sent5": "The student overhonors the teacher by bringing them gifts every day."
        },
        {
            "definition": "To honor or reward excessively.",
            "pos": "verb",
            "sent1": "The company overhonors their employees with extravagant bonuses for minor achievements.",
            "sent2": "He overhonors his dog by throwing it a lavish birthday party with a cake and presents.",
            "sent3": "The town overhonors their founding father by celebrating his birthday with a week-long festival.",
            "sent4": "The coach overhonors the team captain by naming them MVP every single game.",
            "sent5": "The school overhonors the valedictorian by giving them a scholarship to any university of their choice."
        }
    ]
}