{
    "term": "oversuspicious",
    "meanings": [
        {
            "definition": "excessively suspicious",
            "pos": "adjective",
            "sent1": "She was oversuspicious of strangers, always thinking they had bad intentions.",
            "sent2": "The oversuspicious cat would hide whenever someone new entered the room.",
            "sent3": "The oversuspicious squirrel kept eyeing the acorns suspiciously, as if they were up to something.",
            "sent4": "His oversuspicious nature acted like a dark cloud, casting doubt on everything around him.",
            "sent5": "The oversuspicious clouds gathered ominously, hinting at an impending storm."
        },
        {
            "definition": "showing excessive suspicion",
            "pos": "adjective",
            "sent1": "The oversuspicious student questioned every answer the teacher gave.",
            "sent2": "Her oversuspicious behavior made her friends feel like they were being watched.",
            "sent3": "The oversuspicious puppy barked at its own shadow, thinking it was a threat.",
            "sent4": "The oversuspicious atmosphere in the room made everyone uneasy.",
            "sent5": "His oversuspicious gaze made others uncomfortable, as if he could see through their lies."
        },
        {
            "definition": "having an excessive tendency to suspect wrongdoing",
            "pos": "adjective",
            "sent1": "The oversuspicious neighbor always thought the worst of everyone in the community.",
            "sent2": "Being oversuspicious led him to believe that even the smallest mistakes were intentional.",
            "sent3": "The oversuspicious detective saw conspiracy theories everywhere, even in a simple missing sock case.",
            "sent4": "Her oversuspicious mind created elaborate scenarios of betrayal and deceit.",
            "sent5": "The oversuspicious guard scrutinized every visitor, convinced they were up to something nefarious."
        }
    ]
}