{
    "term": "overlend",
    "meanings": [
        {
            "definition": "To lend more than the value of collateral.",
            "pos": "verb",
            "sent1": "She decided to overlend her friend some money, even though she knew it was risky.",
            "sent2": "The bank had to deal with the consequences of overlending to customers who couldn't repay.",
            "sent3": "The squirrel overlend acorns to its neighbor, hoping to make a new friend.",
            "sent4": "His generosity knew no bounds as he continued to overlend his possessions to those in need.",
            "sent5": "The teacher warned the students not to overlend their textbooks, as they might not get them back."
        },
        {
            "definition": "To lend excessively.",
            "pos": "verb",
            "sent1": "The shopkeeper would often overlend goods to customers who couldn't afford them.",
            "sent2": "It's important for financial institutions not to overlend to avoid economic instability.",
            "sent3": "The magician overlend his tricks, leaving the audience in awe of his skills.",
            "sent4": "Her kindness led her to overlend her time and energy to various charitable causes.",
            "sent5": "The chef would overlend ingredients to his colleagues, ensuring everyone could cook delicious meals."
        },
        {
            "definition": "To lend beyond one's means.",
            "pos": "verb",
            "sent1": "He would often overlend money to his friends, putting his own financial stability at risk.",
            "sent2": "Overlending can lead to financial troubles if not done responsibly.",
            "sent3": "The superhero overlend his powers to defeat the villain, knowing it was a risky move.",
            "sent4": "Despite warnings, she continued to overlend her resources, hoping to help as many people as possible.",
            "sent5": "The explorer overlend his supplies to the team, determined to reach the summit of the mountain."
        }
    ]
}