{
    "term": "oversolicitous",
    "meanings": [
        {
            "definition": "Excessively concerned or attentive",
            "pos": "adjective",
            "sent1": "She was oversolicitous about her friend's well-being, always checking in on them.",
            "sent2": "The oversolicitous nurse made sure to double-check every detail of the patient's care.",
            "sent3": "The oversolicitous mother packed her child's lunch, backpack, and even their favorite toy, just in case.",
            "sent4": "His oversolicitous behavior towards his plants led to them being overwatered and unhealthy.",
            "sent5": "The oversolicitous teacher knew every student's favorite subject and made sure to include it in the lesson plan."
        },
        {
            "definition": "Showing excessive concern or care",
            "pos": "adjective",
            "sent1": "The oversolicitous neighbor always offered to help with any task, no matter how small.",
            "sent2": "Being oversolicitous, she insisted on driving her friend to the doctor's appointment.",
            "sent3": "The oversolicitous dog kept bringing its owner toys, worried they might be bored.",
            "sent4": "Her oversolicitous nature extended to her plants, as she meticulously cared for each one.",
            "sent5": "The oversolicitous student always made sure to remind the teacher of upcoming assignments."
        },
        {
            "definition": "Overly anxious or worried about someone or something",
            "pos": "adjective",
            "sent1": "Feeling oversolicitous, she couldn't shake off the worry about her upcoming presentation.",
            "sent2": "His oversolicitous behavior towards his grades led to constant stress and sleepless nights.",
            "sent3": "The oversolicitous cat meowed loudly until its owner returned home, fearing abandonment.",
            "sent4": "The oversolicitous driver checked the rearview mirror every few seconds, anxious about other cars.",
            "sent5": "The oversolicitous student chewed on their pencil during the exam, nervous about the time limit."
        }
    ]
}