{
    "term": "overwaters",
    "meanings": [
        {
            "definition": "To cross a body of water.",
            "pos": "verb",
            "sent1": "The boat overwaters the river.",
            "sent2": "We will overwaters the lake on our canoe.",
            "sent3": "The adventurous duck overwaters the pond with ease.",
            "sent4": "Her determination overwaters any obstacle in her path.",
            "sent5": "The swimmer overwaters the vast ocean, feeling small yet brave."
        },
        {
            "definition": "To travel by water.",
            "pos": "verb",
            "sent1": "They overwaters to the island on a sailboat.",
            "sent2": "People often overwaters by cruise ship for vacations.",
            "sent3": "The fish overwaters swiftly in the stream.",
            "sent4": "Their love for adventure overwaters any fear of the sea.",
            "sent5": "The pirate ship overwaters the waves, seeking treasure and glory."
        },
        {
            "definition": "To pass over a body of water.",
            "pos": "verb",
            "sent1": "The bridge overwaters the river, connecting the two sides.",
            "sent2": "The airplane overwaters the ocean on its way to another continent.",
            "sent3": "The skipping stone overwaters the pond, creating ripples.",
            "sent4": "His dreams overwaters the sea of doubts and fears.",
            "sent5": "The seagull gracefully overwaters the bay, searching for food."
        },
        {
            "definition": "To go beyond the water's edge.",
            "pos": "verb",
            "sent1": "The children overwaters the shore to collect seashells.",
            "sent2": "The explorer overwaters the coastline to discover hidden caves.",
            "sent3": "The dog excitedly overwaters the beach, chasing seagulls.",
            "sent4": "Her imagination overwaters the boundaries of reality.",
            "sent5": "The artist's creativity overwaters the canvas, bringing it to life."
        }
    ]
}