{
    "term": "oversubscribing",
    "meanings": [
        {
            "definition": "To subscribe to more of something than is available or necessary.",
            "pos": "verb",
            "sent1": "She kept oversubscribing to magazines and ended up with a huge stack of unread issues.",
            "sent2": "Investors were oversubscribing to the new stock offering, causing the shares to sell out quickly.",
            "sent3": "John's habit of oversubscribing to streaming services left him with more options than time to watch.",
            "sent4": "The students were oversubscribing to the limited spots in the club, creating a sense of urgency.",
            "sent5": "By oversubscribing to the event, Sarah ensured she wouldn't miss out on any exciting activities."
        },
        {
            "definition": "To allocate more shares in a company than are available for purchase.",
            "pos": "verb",
            "sent1": "The company made a mistake by oversubscribing the shares, leading to disappointed investors.",
            "sent2": "During the IPO, the company was oversubscribing the shares, causing a frenzy in the market.",
            "sent3": "The CEO joked that oversubscribing the shares was like trying to fit a gallon of water into a pint-sized bottle.",
            "sent4": "Investors felt like the company was oversubscribing the shares to create artificial scarcity.",
            "sent5": "By oversubscribing the shares, the company inadvertently drove up demand for their stock."
        },
        {
            "definition": "To exceed the limit of subscriptions allowed.",
            "pos": "verb",
            "sent1": "The event was so popular that many people ended up oversubscribing the available slots.",
            "sent2": "The software limited users from oversubscribing to prevent system overload.",
            "sent3": "The idea of oversubscribing the newsletter amused the marketing team, imagining a flood of new subscribers.",
            "sent4": "The concept of oversubscribing the service was like trying to fit too many guests into a small room.",
            "sent5": "By oversubscribing the platform, users risked being locked out due to exceeding the subscription limit."
        }
    ]
}