{
    "term": "overvotes",
    "meanings": [
        {
            "definition": "Votes cast for more candidates than permitted.",
            "pos": "noun",
            "sent1": "The election results showed a high number of overvotes, indicating voter confusion.",
            "sent2": "The election officials had to carefully review the ballots to identify any overvotes.",
            "sent3": "The overvotes on the ballots caused delays in announcing the final results.",
            "sent4": "The overvotes in the election were like extra toppings on a pizza - unnecessary and messy.",
            "sent5": "The concept of overvotes can be understood as trying to fit too many puzzle pieces into a single spot."
        },
        {
            "definition": "To cast too many votes on a ballot.",
            "pos": "verb",
            "sent1": "It is important not to overvotes when marking your choices on the ballot.",
            "sent2": "The candidate was disqualified because they encouraged supporters to overvotes.",
            "sent3": "The idea of overvoting may seem tempting, but it can lead to invalidating your ballot.",
            "sent4": "She felt overwhelmed and accidentally overvoted for multiple candidates.",
            "sent5": "Overvoting is like trying to pour too much water into a small cup - it just spills over."
        },
        {
            "definition": "The act of marking more choices than allowed on a ballot.",
            "pos": "noun",
            "sent1": "The overvotes on the ballot were a result of unclear instructions.",
            "sent2": "The overvotes were discovered during the ballot counting process.",
            "sent3": "The overvotes on the ballot made the election more interesting, but also more complicated.",
            "sent4": "Her ballot had so many overvotes that it looked like a colorful rainbow.",
            "sent5": "The impact of overvotes on election outcomes cannot be underestimated."
        }
    ]
}