{
    "term": "overshadowing",
    "meanings": [
        {
            "definition": "To cast a shadow over",
            "pos": "verb",
            "sent1": "The tall tree was overshadowing the small flower.",
            "sent2": "The dark clouds were overshadowing the sun, causing a shadow to fall over the field.",
            "sent3": "The mischievous cat was overshadowing the sleeping dog, playing a game of hide and seek.",
            "sent4": "Her worries were overshadowing her happiness, darkening her mood.",
            "sent5": "The looming mountain was overshadowing the entire landscape, blocking out the sunlight."
        },
        {
            "definition": "To make someone or something seem less important or impressive by comparison",
            "pos": "verb",
            "sent1": "His loud voice was overshadowing the other students in the classroom.",
            "sent2": "The grand fireworks display was overshadowing the small sparklers at the party.",
            "sent3": "The flashy new car was overshadowing his old bicycle, making it look dull in comparison.",
            "sent4": "Her talent for singing was overshadowing his attempts at playing the guitar.",
            "sent5": "The bright neon sign was overshadowing the small shop next to it, drawing all the attention."
        },
        {
            "definition": "The state of being more important or noticeable than someone or something else",
            "pos": "noun",
            "sent1": "Her success in the competition was overshadowing the achievements of others.",
            "sent2": "The beauty of the sunset was overshadowing the noise of the city.",
            "sent3": "The popularity of the new movie was overshadowing the older films in the cinema.",
            "sent4": "His charisma was overshadowing the other candidates in the election.",
            "sent5": "The aroma of freshly baked bread was overshadowing all other scents in the bakery."
        }
    ]
}