{
    "term": "overshooting",
    "meanings": [
        {
            "definition": "To shoot or go beyond (a target or limit)",
            "pos": "verb",
            "sent1": "The basketball player kept overshooting the hoop during practice.",
            "sent2": "The archer's arrow overshot the target and landed in the bushes.",
            "sent3": "The young boy's toy gun kept overshooting the imaginary enemy, making his little sister giggle.",
            "sent4": "Her excitement overshot her aim, causing her to miss the bullseye by a mile.",
            "sent5": "The rocket overshot its intended trajectory, soaring into the unknown depths of space."
        },
        {
            "definition": "To pass over or beyond (a place)",
            "pos": "verb",
            "sent1": "The airplane overshot the airport runway and had to circle back for another landing attempt.",
            "sent2": "The hiker overshot the trail and found himself lost in the dense forest.",
            "sent3": "The mischievous squirrel overshot the tree branch and landed in a pile of leaves with a surprised squeak.",
            "sent4": "Her imagination overshot reality, taking her on a journey through fantastical lands.",
            "sent5": "The kite overshot the park boundary, dancing freely in the open field beyond."
        },
        {
            "definition": "To extend beyond or above (a point or level)",
            "pos": "verb",
            "sent1": "The floodwaters overshot the riverbanks, causing widespread damage to nearby homes.",
            "sent2": "The skyscraper overshot the surrounding buildings, standing tall against the city skyline.",
            "sent3": "The balloon overshot the party decorations, adding a whimsical touch to the ceiling.",
            "sent4": "His enthusiasm overshot the group's expectations, leading to an unforgettable event.",
            "sent5": "The mountain peak overshot the clouds, creating a majestic sight for all who beheld it."
        }
    ]
}