{
    "term": "overfavoring",
    "meanings": [
        {
            "definition": "To show excessive favoritism towards someone or something.",
            "pos": "verb",
            "sent1": "She was overfavoring her youngest son by always giving him extra treats.",
            "sent2": "The teacher was accused of overfavoring certain students in the class.",
            "sent3": "The cat was overfavoring the new toy, completely ignoring its old ones.",
            "sent4": "The politician was overfavoring his own interests, neglecting the needs of the people.",
            "sent5": "The coach's overfavoring of one player led to resentment among the team."
        },
        {
            "definition": "To give preferential treatment to someone or something.",
            "pos": "verb",
            "sent1": "The manager was overfavoring his friend by always assigning him the easiest tasks.",
            "sent2": "The company policy strictly prohibits overfavoring any employee based on personal relationships.",
            "sent3": "The overfavoring of the new product caused a decrease in sales for the older ones.",
            "sent4": "Overfavoring one team member can create a sense of unfairness among the rest.",
            "sent5": "The teacher's overfavoring of a particular student was evident to the entire class."
        },
        {
            "definition": "To be biased in favor of someone or something.",
            "pos": "verb",
            "sent1": "The judge was accused of overfavoring the prosecution throughout the trial.",
            "sent2": "It is important for a leader to avoid overfavoring any particular group within the organization.",
            "sent3": "The overfavoring of one brand over the others led to a decrease in overall customer satisfaction.",
            "sent4": "Overfavoring a specific candidate can undermine the credibility of the entire selection process.",
            "sent5": "The coach's overfavoring of star players often resulted in the team's overall performance suffering."
        }
    ]
}