{
    "term": "overharvested",
    "meanings": [
        {
            "definition": "To harvest (verb): to gather or collect (a crop) in excess of what is sustainable",
            "pos": "verb",
            "sent1": "Farmers overharvested the apples, leaving none for the next season.",
            "sent2": "The fishermen overharvested the fish, causing a decline in the population.",
            "sent3": "The squirrels overharvested the acorns, leading to a shortage for winter.",
            "sent4": "The students overharvested the library books, leaving none for others.",
            "sent5": "The bees overharvested the nectar, causing a scarcity of honey.",
            "sent6": "After the overharvesting of the crops, the fields were left barren.",
            "sent7": "The overharvested trees struggled to produce new fruit.",
            "sent8": "The overharvested land could no longer sustain healthy crops.",
            "sent9": "The overharvested garden was now devoid of any vegetables.",
            "sent10": "The overharvested bushes wilted under the strain of constant picking."
        },
        {
            "definition": "Harvested (adjective): gathered or collected in excess of what is sustainable",
            "pos": "adjective",
            "sent1": "The overharvested fields yielded little produce the following year.",
            "sent2": "The overharvested forest struggled to recover from the excessive logging.",
            "sent3": "The overharvested orchard looked sparse with its few remaining fruits.",
            "sent4": "The overharvested garden beds were now barren and unproductive.",
            "sent5": "The overharvested fish population faced a serious threat of extinction.",
            "sent6": "The overharvested crops left the soil depleted and infertile.",
            "sent7": "The overharvested flowers wilted under the weight of their own blooms.",
            "sent8": "The overharvested resources led to a scarcity of essential goods.",
            "sent9": "The overharvested fields struggled to support new plant growth.",
            "sent10": "The overharvested trees stood bare, stripped of their fruits by greed."
        }
    ]
}