{
    "term": "overoperated",
    "meanings": [
        {
            "definition": "Operated to an excessive degree.",
            "pos": "adjective",
            "sent1": "The overoperated machine broke down due to too much use.",
            "sent2": "The overoperated computer crashed after running for days without a break.",
            "sent3": "The overoperated toy robot danced wildly until its batteries died.",
            "sent4": "Her overoperated brain felt like it was on the verge of burning out from all the stress.",
            "sent5": "The overoperated engine roared loudly before finally giving out.",
            "sent6": "After being overoperated for hours, the tired machine finally shut down.",
            "sent7": "The overoperated car engine sputtered and stalled on the highway.",
            "sent8": "The overoperated phone battery drained quickly after being used non-stop.",
            "sent9": "The overoperated printer jammed repeatedly from being used too often.",
            "sent10": "The overoperated motor overheated and emitted a burning smell."
        },
        {
            "definition": "Past tense of operate excessively.",
            "pos": "verb",
            "sent1": "She overoperated the blender and ended up with a smoothie that was too thin.",
            "sent2": "He overoperated the lawnmower, causing it to break down in the middle of the yard.",
            "sent3": "The chef overoperated the mixer, splattering batter all over the kitchen.",
            "sent4": "The surgeon overoperated on the patient, leading to complications during recovery.",
            "sent5": "The mechanic overoperated the wrench, stripping the bolt in the process.",
            "sent6": "After he overoperated the remote control, the TV screen went blank.",
            "sent7": "She overoperated the vacuum cleaner, causing it to overheat and emit a burning smell.",
            "sent8": "The pilot overoperated the controls, making the plane veer off course.",
            "sent9": "He overoperated the drill, causing it to get stuck in the wall.",
            "sent10": "The gardener overoperated the hedge trimmer, leaving the bushes uneven and ragged."
        }
    ]
}