{
    "term": "overlooking",
    "meanings": [
        {
            "definition": "Fail to notice or consider something.",
            "pos": "verb",
            "sent1": "She was so focused on her book that she ended up overlooking the time and missed her appointment.",
            "sent2": "Sometimes, when we are in a hurry, we tend to overlook important details.",
            "sent3": "The detective overlooked a crucial clue that was right in front of him, leading to a surprising twist in the case.",
            "sent4": "In the rush of excitement, the team overlooked the potential risks involved in their plan.",
            "sent5": "Her tendency to overlook minor mistakes often led to bigger problems later on."
        },
        {
            "definition": "Have a view of from above.",
            "pos": "verb",
            "sent1": "From the top of the hill, we could see the entire city overlooking the river below.",
            "sent2": "The balcony of the hotel room overlooked a beautiful garden filled with colorful flowers.",
            "sent3": "The drone captured stunning footage as it overlooked the vast landscape below.",
            "sent4": "The ancient castle overlooked the village, standing as a silent guardian of the past.",
            "sent5": "The lighthouse overlooked the rocky cliffs, guiding ships safely through the night."
        },
        {
            "definition": "Look down on from above.",
            "pos": "verb",
            "sent1": "The eagle soared high in the sky, overlooking the forest below for its next prey.",
            "sent2": "The queen stood on the balcony, overlooking her kingdom with pride and grace.",
            "sent3": "The wise owl perched on the branch, overlooking the meadow with a watchful eye.",
            "sent4": "The mountain peak overlooked the valley, casting a majestic shadow over the land.",
            "sent5": "The ancient ruins overlooked the modern city, a reminder of the passage of time."
        }
    ]
}