{
    "term": "oversides",
    "meanings": [
        {
            "definition": "The parts of a ship's hull that extend above the waterline.",
            "pos": "noun",
            "sent1": "The oversides of the ship were painted a bright red color.",
            "sent2": "The oversides of the boat were damaged in the storm.",
            "sent3": "The oversides of the ship looked like giant walls rising from the sea.",
            "sent4": "The oversides of the vessel stood tall like guardians protecting the crew.",
            "sent5": "The oversides of the boat gleamed in the sunlight, reflecting off the water.",
            "sent6": "Above the waterline, the oversides of the ship were visible from afar.",
            "sent7": "The sailors painted the oversides of the ship to prevent rusting.",
            "sent8": "The oversides of the boat provided a sturdy structure for the crew to work on.",
            "sent9": "The oversides of the ship shielded the sailors from the harsh winds.",
            "sent10": "The oversides of the vessel were a striking feature against the blue ocean."
        },
        {
            "definition": "To exceed the limits or boundaries of something.",
            "pos": "verb",
            "sent1": "She oversides her budget every month by buying unnecessary items.",
            "sent2": "If you oversides the speed limit, you might get a ticket.",
            "sent3": "He always oversides his welcome by staying too long at parties.",
            "sent4": "The excitement oversides her fear when she goes on roller coasters.",
            "sent5": "Their laughter oversides the noise of the crowded room.",
            "sent6": "The students oversides the word count for their essays to include more details.",
            "sent7": "The runner oversides his previous record by a few seconds.",
            "sent8": "The balloon oversides its capacity and burst with a loud pop.",
            "sent9": "The tree oversides the fence, reaching into the neighbor's yard.",
            "sent10": "His enthusiasm oversides any obstacles in his way to success."
        },
        {
            "definition": "On or to the side opposite the front or direction of movement.",
            "pos": "adverb",
            "sent1": "The car parked oversides the building, blocking the entrance.",
            "sent2": "She placed the vase oversides on the table, away from the edge.",
            "sent3": "The dog ran oversides, chasing after a squirrel.",
            "sent4": "He leaned oversides to get a better view of the parade.",
            "sent5": "The cat jumped oversides the fence to explore the neighbor's garden.",
            "sent6": "The children sat oversides during storytime to see the pictures in the book.",
            "sent7": "The bird perched oversides on the branch, watching the surroundings.",
            "sent8": "She walked oversides to avoid the puddle on the sidewalk.",
            "sent9": "The squirrel scurried oversides, looking for a hiding spot.",
            "sent10": "He stood oversides, waiting for his friend to arrive."
        }
    ]
}