{
    "term": "overtrim",
    "meanings": [
        {
            "definition": "Trim (something) excessively.",
            "pos": "verb",
            "sent1": "She tends to overtrim the bushes in her garden, making them look unnatural.",
            "sent2": "He had to overtrim the hedge to make sure it didn't block the sidewalk.",
            "sent3": "The barber accidentally overtrimmed the customer's hair, giving him a funny, uneven look.",
            "sent4": "The decorator decided to overtrim the Christmas tree, leaving it looking sparse and sad.",
            "sent5": "The tailor warned her not to overtrim the fabric, or the dress would lose its shape."
        },
        {
            "definition": "To remove excess trim.",
            "pos": "verb",
            "sent1": "After sewing the dress, she had to overtrim the loose threads for a neat finish.",
            "sent2": "The gardener carefully overtrimmed the excess leaves to reveal the beautiful flower underneath.",
            "sent3": "He playfully overtrimmed the wrapping paper, leaving tiny confetti-like pieces all over the floor.",
            "sent4": "The chef had to overtrim the fat from the meat before cooking it to perfection.",
            "sent5": "The artist meticulously overtrimmed the edges of the painting to create a clean, polished look."
        },
        {
            "definition": "To be excessively trimmed.",
            "pos": "verb",
            "sent1": "The bushes in the park were overtrimmed, giving them a strange, unnatural shape.",
            "sent2": "The hedges along the path were overtrimmed, making them look sparse and bare.",
            "sent3": "The cake was overtrimmed with too many decorations, making it look more like a work of art than a dessert.",
            "sent4": "The dog's fur was overtrimmed, leaving patches of skin exposed.",
            "sent5": "The tree in the yard was overtrimmed, leaving it looking like a giant lollipop."
        }
    ]
}