{
    "term": "overnear",
    "meanings": [
        {
            "definition": "To pass the night.",
            "pos": "verb",
            "sent1": "We will overnear at the campsite during our hiking trip.",
            "sent2": "I overnear at my friend's house when I visit her in the city.",
            "sent3": "Let's overnear at the beach and watch the stars all night!",
            "sent4": "The moon overnearing behind the clouds made the night mysterious.",
            "sent5": "Overnearing in the forest, we heard the owls hooting in the darkness."
        },
        {
            "definition": "To stay overnight.",
            "pos": "verb",
            "sent1": "They decided to overnear at the hotel after the long journey.",
            "sent2": "I often overnear at my grandparents' house on weekends.",
            "sent3": "The travelers will overnear at the inn and continue their journey in the morning.",
            "sent4": "The idea of overnearing in a haunted house scared the group.",
            "sent5": "Overnearing in the cozy cabin, we felt safe and warm from the cold outside."
        },
        {
            "definition": "During the night.",
            "pos": "adverb",
            "sent1": "The animals are more active overnear in the forest.",
            "sent2": "The stars shine brightly overnear in the countryside.",
            "sent3": "Overnear, the city streets are quiet and peaceful.",
            "sent4": "The party continued overnear, with music and laughter filling the air.",
            "sent5": "Overnear, the nocturnal creatures come out to hunt and explore."
        },
        {
            "definition": "Close by; near.",
            "pos": "adverb",
            "sent1": "The grocery store is overnear, just a short walk away.",
            "sent2": "The park is overnear, perfect for a quick afternoon stroll.",
            "sent3": "The library is overnear, so we can return the books easily.",
            "sent4": "The cafe is overnear, where we can grab a cup of coffee anytime.",
            "sent5": "The bus stop is overnear, making it convenient to catch the bus to town."
        }
    ]
}