{
    "term": "oversteering",
    "meanings": [
        {
            "definition": "To steer a vehicle too much in a particular direction, causing loss of control.",
            "pos": "verb",
            "sent1": "The driver was oversteering around the corner, making the car swerve dangerously.",
            "sent2": "Be careful not to oversteer when making sharp turns to avoid accidents.",
            "sent3": "The oversteering squirrel on the road made everyone laugh as it struggled to stay on course.",
            "sent4": "Her emotions oversteered her actions, leading to unexpected consequences.",
            "sent5": "Oversteering in icy conditions can result in a loss of traction and spinouts."
        },
        {
            "definition": "The act of turning the steering wheel too far in one direction, leading to instability.",
            "pos": "noun",
            "sent1": "The mechanic explained that oversteering can cause the car to fishtail uncontrollably.",
            "sent2": "Excessive oversteering can wear out the tires faster than normal steering.",
            "sent3": "The oversteering of the shopping cart in the store aisle almost crashed into a display.",
            "sent4": "The oversteering of the ship's wheel in the storm symbolized the captain's panic.",
            "sent5": "The oversteering of the bicycle made it wobble dangerously on the uneven road."
        },
        {
            "definition": "The tendency of a vehicle to turn more sharply than intended due to excessive steering input.",
            "pos": "noun",
            "sent1": "The sports car's oversteering made it drift effortlessly around the track.",
            "sent2": "Drivers should be aware of the risks of oversteering on slippery roads.",
            "sent3": "The oversteering of the remote-controlled car amused the children as it spun in circles.",
            "sent4": "The oversteering of the conversation led to misunderstandings between the friends.",
            "sent5": "The oversteering of the lawnmower made it veer off course and into the flower bed."
        }
    ]
}