{
    "term": "overcome",
    "meanings": [
        {
            "definition": "To defeat or prevail over in a struggle or conflict.",
            "pos": "verb",
            "sent1": "She managed to overcome her fear of heights and climb to the top of the slide.",
            "sent2": "The team worked together to overcome their opponents and win the championship.",
            "sent3": "Despite being scared, she tried to overcome her fear of spiders by watching cute spider videos.",
            "sent4": "His determination to overcome all obstacles was like a powerful wave crashing against the shore.",
            "sent5": "The hero's journey to overcome the dragon symbolized courage and strength."
        },
        {
            "definition": "To successfully deal with or control a problem or obstacle.",
            "pos": "verb",
            "sent1": "With hard work and dedication, she was able to overcome the difficult math problem.",
            "sent2": "The community came together to overcome the challenges of rebuilding after the storm.",
            "sent3": "Trying to overcome a craving for sweets with a bowl of broccoli was a funny sight.",
            "sent4": "Her determination to overcome the mountain of paperwork was like a conqueror facing a vast empire.",
            "sent5": "The student's strategy to overcome procrastination involved setting small daily goals."
        },
        {
            "definition": "To overpower or overwhelm with emotion.",
            "pos": "verb",
            "sent1": "The touching movie scene made her overcome with tears of joy.",
            "sent2": "The surprise proposal left her overcome with happiness and excitement.",
            "sent3": "The adorable puppy's antics made everyone in the room overcome with laughter.",
            "sent4": "The beauty of the sunset was so breathtaking, it made him overcome with awe.",
            "sent5": "The heartfelt speech left the audience overcome with emotion and gratitude."
        }
    ]
}