{
    "term": "overspill",
    "meanings": [
        {
            "definition": "Overflowing or spilling over",
            "pos": "adjective",
            "sent1": "The overspill water from the bathtub created a small puddle on the floor.",
            "sent2": "The overspill paint dripped down the canvas, creating a beautiful abstract pattern.",
            "sent3": "The overspill milk carton decided to take a leap off the table, causing a messy situation.",
            "sent4": "Her overspill emotions burst out like a dam breaking, overwhelming everyone around her.",
            "sent5": "The overspill popcorn at the movie theater made it look like a snowstorm inside."
        },
        {
            "definition": "Excess or surplus that spills over",
            "pos": "noun",
            "sent1": "The overspill of toys in the playroom made it difficult to walk without stepping on something.",
            "sent2": "The overspill of joy on her face was evident as she opened the unexpected gift.",
            "sent3": "The overspill of laughter from the comedy show could be heard echoing down the street.",
            "sent4": "The overspill of kindness from the community event warmed everyone's hearts.",
            "sent5": "The overspill of books on the shelf made it look like a mini library in her room."
        },
        {
            "definition": "To spill over or spread beyond its limits",
            "pos": "verb",
            "sent1": "The excitement overspilled from the children as they ran around the playground.",
            "sent2": "Her happiness overspilled when she received the good news about her promotion.",
            "sent3": "The paint can overspill when you fill it too full, so be careful.",
            "sent4": "His love for music overspilled into every aspect of his life, shaping his identity.",
            "sent5": "The river overspilled its banks after days of heavy rain, causing flooding in the area."
        }
    ]
}