{
    "term": "overdramatic",
    "meanings": [
        {
            "definition": "Exaggerating emotions or reactions beyond what is appropriate.",
            "pos": "adjective",
            "sent1": "She always gets so overdramatic when she loses a game.",
            "sent2": "Her overdramatic reaction to a small mistake surprised everyone.",
            "sent3": "It was a bit overdramatic when he pretended to faint after spilling his drink.",
            "sent4": "Her reaction to the news was so overdramatic, it was like a scene from a soap opera.",
            "sent5": "The way she screamed was so overdramatic that it echoed through the entire house."
        },
        {
            "definition": "Characterized by excessive or exaggerated drama.",
            "pos": "adjective",
            "sent1": "The play was overly overdramatic, with exaggerated gestures and loud voices.",
            "sent2": "The movie's plot was so overdramatic that it felt unrealistic.",
            "sent3": "His reaction to the prank was so overdramatic that everyone burst out laughing.",
            "sent4": "The storm outside mirrored the overdramatic argument happening inside the house.",
            "sent5": "The actress's performance was incredibly overdramatic, drawing mixed reviews from critics."
        },
        {
            "definition": "Behaving in an overly theatrical or melodramatic manner.",
            "pos": "adjective",
            "sent1": "She tends to be a bit overdramatic when telling stories, adding unnecessary details.",
            "sent2": "His overdramatic gestures during the play made the audience chuckle.",
            "sent3": "The cat's overdramatic reaction to a cucumber behind it became a viral video.",
            "sent4": "The politician's speech was so overdramatic that it felt insincere.",
            "sent5": "The children's play was full of overdramatic scenes, making the parents smile proudly."
        }
    ]
}