{
    "term": "overvoting",
    "meanings": [
        {
            "definition": "To vote for more candidates than allowed in an election.",
            "pos": "verb",
            "sent1": "During the school election, Tim accidentally overvoted for two candidates instead of one.",
            "sent2": "It is important not to overvote in the upcoming election to ensure a fair outcome.",
            "sent3": "Sarah's enthusiasm led her to overvote for all her favorite classmates, thinking it would help them win.",
            "sent4": "Overvoting in the student council election is like trying to fit too many puzzle pieces into one spot.",
            "sent5": "The consequences of overvoting can lead to disqualification from the election."
        },
        {
            "definition": "The act of casting more votes than permitted.",
            "pos": "noun",
            "sent1": "The election officials discovered an instance of overvoting in the ballot count.",
            "sent2": "Overvoting can invalidate the entire election results if not caught in time.",
            "sent3": "The overvoting mistake on the ballot made everyone chuckle at the counting table.",
            "sent4": "The concept of overvoting is like trying to pour too much water into a small cup.",
            "sent5": "The news of overvoting spread quickly throughout the town, causing concern among voters."
        },
        {
            "definition": "The practice of marking a ballot with more choices than allowed.",
            "pos": "noun",
            "sent1": "The overvoting on the ballot was a clear violation of the election rules.",
            "sent2": "Overvoting can lead to legal consequences due to its impact on election integrity.",
            "sent3": "The overvoting incident on the ballot paper made the election committee shake their heads in disbelief.",
            "sent4": "The act of overvoting is like trying to wear too many hats on one's head.",
            "sent5": "The image of overvoting on the ballot stuck in the minds of the election officials."
        }
    ]
}