{
    "term": "overdriving",
    "meanings": [
        {
            "definition": "Drive (a vehicle) too fast for the prevailing conditions.",
            "pos": "verb",
            "sent1": "He was overdriving on the icy road, risking a dangerous accident.",
            "sent2": "The driver was overdriving on the highway, ignoring the speed limit.",
            "sent3": "She joked that her friend was overdriving in the parking lot, pretending to be a race car driver.",
            "sent4": "The team captain accused the player of overdriving their performance, leading to mistakes.",
            "sent5": "Overdriving in heavy rain can result in hydroplaning, so it's important to drive cautiously."
        },
        {
            "definition": "Push (a piece of equipment) beyond its intended limits.",
            "pos": "verb",
            "sent1": "The mechanic warned against overdriving the engine, as it could cause damage.",
            "sent2": "By overdriving the generator, he caused it to malfunction.",
            "sent3": "The kids were overdriving the swing set, trying to see who could swing the highest.",
            "sent4": "Overdriving the blender with too many ice cubes may break its blades.",
            "sent5": "The instructions clearly state not to overdrive the drill to avoid overheating."
        },
        {
            "definition": "Exaggerate or overemphasize.",
            "pos": "verb",
            "sent1": "She tends to overdrive her achievements, making them sound more impressive than they are.",
            "sent2": "The salesman was overdriving the benefits of the product to make a sale.",
            "sent3": "He always overdrives his excuses, trying to avoid taking responsibility.",
            "sent4": "The comedian overdrove the punchline, making it less funny than intended.",
            "sent5": "The artist overdrove the colors in the painting, creating a vibrant but unrealistic scene."
        }
    ]
}