{
    "term": "overbreed",
    "meanings": [
        {
            "definition": "To breed excessively",
            "pos": "verb",
            "sent1": "Farmers should avoid overbreeding their livestock to maintain a healthy population.",
            "sent2": "Some species can suffer if humans overbreed them without considering the consequences.",
            "sent3": "The rabbits in the story decided to overbreed as a prank, causing chaos in the garden.",
            "sent4": "The idea of overbreeding plants to create a jungle in the backyard seemed like a wild dream.",
            "sent5": "The warning signs of overbreeding were evident as the fish tank became overcrowded."
        },
        {
            "definition": "To produce offspring in large numbers, often to the detriment of the population",
            "pos": "verb",
            "sent1": "In the forest, the deer began to overbreed, leading to a shortage of food for all.",
            "sent2": "When certain fish species overbreed, it can disrupt the balance of the ecosystem.",
            "sent3": "The idea to overbreed the chickens for a chicken nugget festival was met with mixed reactions.",
            "sent4": "The concept of overbreeding the bees for more honey resulted in a sticky situation.",
            "sent5": "The consequences of overbreeding were evident as the bird population dwindled rapidly."
        },
        {
            "definition": "To mate animals too frequently or in an uncontrolled manner",
            "pos": "verb",
            "sent1": "The zookeepers had to separate the monkeys to prevent them from overbreeding.",
            "sent2": "When dogs overbreed, it can lead to health issues for the mother and puppies.",
            "sent3": "The idea to overbreed the cats for a cat fashion show seemed like a purrfect plan.",
            "sent4": "The farm faced a challenge when the pigs started to overbreed uncontrollably.",
            "sent5": "The consequences of overbreeding were clear as the animal shelter became overwhelmed with new arrivals."
        }
    ]
}