{
    "term": "overturned",
    "meanings": [
        {
            "definition": "To turn over or upside down",
            "pos": "verb",
            "sent1": "The cat overturned the bowl of milk.",
            "sent2": "She carefully overturned the soil in the garden to plant new flowers.",
            "sent3": "The mischievous puppy overturned the stack of books with a playful leap.",
            "sent4": "His sudden confession overturned her belief that he was innocent.",
            "sent5": "The storm's strong winds overturned the fragile boat, leaving it upside down in the water."
        },
        {
            "definition": "To reverse a decision or ruling",
            "pos": "verb",
            "sent1": "The judge overturned the previous verdict and declared the defendant innocent.",
            "sent2": "After much consideration, the committee decided to overturn the new policy.",
            "sent3": "The magic spell overturned the laws of nature, causing chaos in the town.",
            "sent4": "Her unexpected discovery overturned everything they thought they knew about the ancient civilization.",
            "sent5": "The unexpected turn of events overturned their plans for the weekend."
        },
        {
            "definition": "To overthrow or defeat",
            "pos": "verb",
            "sent1": "The rebels planned to overturn the oppressive regime.",
            "sent2": "The underdog team overturned the champions in a surprising victory.",
            "sent3": "The superhero overturned the evil villain's plans with a clever strategy.",
            "sent4": "The unexpected alliance overturned the enemy forces in a decisive battle.",
            "sent5": "The students overturned the strict dress code with a peaceful protest."
        },
        {
            "definition": "To cause to fail or collapse",
            "pos": "verb",
            "sent1": "The economic crisis overturned many businesses in the city.",
            "sent2": "The strong competition overturned their company's expansion plans.",
            "sent3": "The virus outbreak overturned their hopes for a normal school year.",
            "sent4": "The scandal overturned the politician's career in a matter of days.",
            "sent5": "The earthquake overturned the fragile structures, leaving a trail of destruction."
        }
    ]
}