{
    "term": "overflights",
    "meanings": [
        {
            "definition": "The act of flying over a particular area or location.",
            "pos": "noun",
            "sent1": "The overflights of the birds above the park were a beautiful sight.",
            "sent2": "The military conducted regular overflights over the disputed territory.",
            "sent3": "During the picnic, the unexpected overflights of seagulls caused quite a commotion.",
            "sent4": "Her dreams took her on overflights through the clouds, soaring high above the world.",
            "sent5": "The overflights of the hot air balloons painted the sky with vibrant colors."
        },
        {
            "definition": "The flight of an aircraft over a specific region without landing.",
            "pos": "noun",
            "sent1": "The overflights of the helicopters were part of a search and rescue mission.",
            "sent2": "The government restricted overflights over the national park to protect the wildlife.",
            "sent3": "The overflights of the drones provided valuable aerial footage for the documentary.",
            "sent4": "The overflights of the fighter jets created a deafening roar in the sky.",
            "sent5": "The overflights of the small planes offered tourists a unique perspective of the city below."
        },
        {
            "definition": "The passage of a bird or other flying creature over a certain area.",
            "pos": "noun",
            "sent1": "The overflights of the geese signaled the changing of seasons.",
            "sent2": "The overflights of the seagulls often left behind a trail of feathers.",
            "sent3": "The overflights of the pigeons in the park amused the children playing below.",
            "sent4": "The overflights of the eagles inspired awe in those watching from below.",
            "sent5": "The overflights of the hummingbirds brought a touch of magic to the garden."
        }
    ]
}