{
    "term": "overprescribes",
    "meanings": [
        {
            "definition": "To prescribe too much medication.",
            "pos": "verb",
            "sent1": "The doctor overprescribes antibiotics for every little cold.",
            "sent2": "The pharmacist worries that the doctor may overprescribe painkillers.",
            "sent3": "The nurse joked that the doctor must think everyone needs a pharmacy in their pocket with how much he overprescribes.",
            "sent4": "The veterinarian overprescribes treats for the dog, thinking it will solve all his problems.",
            "sent5": "The teacher overprescribes homework, making it impossible for students to have a life outside of school."
        },
        {
            "definition": "To give medical treatment excessively.",
            "pos": "verb",
            "sent1": "She overprescribes rest to her patients, thinking it will cure all their ailments.",
            "sent2": "The hospital policy aims to prevent doctors from overprescribing unnecessary tests.",
            "sent3": "The therapist playfully accused her colleague of overprescribing naps to their clients.",
            "sent4": "The coach overprescribes water breaks during practice, making the players lose focus.",
            "sent5": "The nutritionist overprescribes vitamins, believing they are the solution to all health issues."
        },
        {
            "definition": "To issue a prescription for more medication than necessary.",
            "pos": "verb",
            "sent1": "The clinic overprescribes painkillers, leading to a rise in addiction cases.",
            "sent2": "Doctors are trained to avoid overprescribing medication to prevent adverse effects.",
            "sent3": "The pharmacy technician teased the new intern for overprescribing band-aids for minor cuts.",
            "sent4": "The psychiatrist overprescribes sleeping pills, neglecting to address the root cause of insomnia.",
            "sent5": "The dentist overprescribes fluoride treatment, believing it will magically fix all dental issues."
        }
    ]
}