{
    "term": "override",
    "meanings": [
        {
            "definition": "To use one's authority to reject or cancel a decision",
            "pos": "verb",
            "sent1": "The teacher had to override the student's request to leave early.",
            "sent2": "The manager can override any changes made without approval.",
            "sent3": "The robot tried to override the command to stop and kept moving forward.",
            "sent4": "His determination to win was so strong that it seemed to override any obstacles in his way.",
            "sent5": "The superhero's willpower was able to override the mind control device."
        },
        {
            "definition": "To prevail over or dominate",
            "pos": "verb",
            "sent1": "In the end, kindness will always override cruelty.",
            "sent2": "The team's hard work will override any lack of experience.",
            "sent3": "The cat's desire for attention seemed to override the dog's need for a nap.",
            "sent4": "The beauty of the sunset seemed to override any worries in her mind.",
            "sent5": "The laughter of children can override the silence of a room."
        },
        {
            "definition": "To set aside or annul",
            "pos": "verb",
            "sent1": "The judge decided to override the previous ruling and grant a new trial.",
            "sent2": "The company policy allows the manager to override any expired contracts.",
            "sent3": "The magician's trick was to override the audience's memory of the card they picked.",
            "sent4": "The storm was so powerful that it seemed to override any attempts to control it.",
            "sent5": "The love for her family could override any disagreements they had."
        },
        {
            "definition": "To replace or supersede",
            "pos": "verb",
            "sent1": "The new software will override the old system completely.",
            "sent2": "The digital version will override the need for physical copies.",
            "sent3": "The excitement of the upcoming event seemed to override any worries about the past.",
            "sent4": "The new leader's vision will override the outdated practices of the past.",
            "sent5": "The modern technology will override the need for manual labor."
        }
    ]
}