{
    "term": "ovolos",
    "meanings": [
        {
            "definition": "A convex molding in the form of a quarter of a circle",
            "pos": "noun",
            "sent1": "The carpenter added an ovolos to the ceiling, giving it a rounded edge.",
            "sent2": "The ancient building featured intricate ovolos along its archways.",
            "sent3": "The ovolos on the wall looked like little smiles, making the room feel welcoming.",
            "sent4": "Her laughter echoed off the ovolos in the hallway, filling the space with joy.",
            "sent5": "The sunlight cast a shadow that emphasized the ovolos, creating a beautiful pattern on the floor."
        },
        {
            "definition": "A type of ancient Greek coin",
            "pos": "noun",
            "sent1": "In the museum, you can see an ovolos from the time of ancient Greece.",
            "sent2": "Collectors often seek out rare ovolos to add to their coin collections.",
            "sent3": "The ovolos in the display case seemed to whisper stories of the past.",
            "sent4": "His eyes sparkled when he held the ovolos, feeling a connection to history.",
            "sent5": "The ovolos gleamed under the museum lights, captivating all who passed by."
        },
        {
            "definition": "A decorative element in architecture consisting of an egg-and-dart pattern",
            "pos": "noun",
            "sent1": "The grand entrance featured intricate ovolos, adding elegance to the building.",
            "sent2": "The ovolos on the pillars were meticulously crafted, showcasing the artisan's skill.",
            "sent3": "The mischievous child pointed at the ovolos, pretending they were tiny eggs to collect.",
            "sent4": "As she walked through the hallway, the ovolos seemed to follow her every step.",
            "sent5": "The ovolos stood out against the plain walls, drawing attention to the architectural detail."
        }
    ]
}