{
    "term": "oxidizing",
    "meanings": [
        {
            "definition": "Cause to combine with oxygen.",
            "pos": "verb",
            "sent1": "Leaves left outside for too long start oxidizing and turn brown.",
            "sent2": "The metal fence is slowly oxidizing due to exposure to the elements.",
            "sent3": "The naughty squirrel thought it could trick the acorn into oxidizing and changing color.",
            "sent4": "Her anger was like a fire, slowly oxidizing everything in its path.",
            "sent5": "The sun's rays seemed to be actively oxidizing the paint on the old car."
        },
        {
            "definition": "Undergo or cause to undergo a reaction in which electrons are lost.",
            "pos": "verb",
            "sent1": "When the battery is used, it starts oxidizing and loses its charge.",
            "sent2": "During the experiment, the metal strip began oxidizing as electrons were lost.",
            "sent3": "The mischievous electron tried to play a prank by oxidizing its neighbor and making it lose power.",
            "sent4": "Her smile faded, as if oxidizing away into the darkness.",
            "sent5": "The old wire was oxidizing, shedding electrons like autumn leaves falling from a tree."
        },
        {
            "definition": "Become or cause to become chemically combined with oxygen.",
            "pos": "verb",
            "sent1": "The apple slice started oxidizing and turned brown after being exposed to air.",
            "sent2": "When the metal reacts with air, it begins oxidizing and forms a layer of rust.",
            "sent3": "The mischievous potion seemed to have a mind of its own, oxidizing the ingredients together in a colorful display.",
            "sent4": "His words seemed to hang in the air, slowly oxidizing into a cloud of misunderstanding.",
            "sent5": "The chemical reaction was like a dance, each element gracefully oxidizing with oxygen to form a new compound."
        }
    ]
}