{
    "term": "oxymorons",
    "meanings": [
        {
            "definition": "A figure of speech in which contradictory terms appear in conjunction (e.g. deafening silence).",
            "pos": "noun",
            "sent1": "In literature class, we learned about oxymorons like 'bittersweet' that combine opposite words.",
            "sent2": "The teacher explained how 'pretty ugly' is an example of oxymorons used to create impact in writing.",
            "sent3": "The comedian joked about 'seriously funny' as one of the oxymorons that make you think.",
            "sent4": "Her smile was a beautiful oxymoron, a mix of joy and sadness.",
            "sent5": "The concept of 'alone together' is a powerful oxymoron that captures the essence of solitude in a crowd."
        },
        {
            "definition": "A combination of contradictory or incongruous words (e.g. jumbo shrimp).",
            "pos": "noun",
            "sent1": "The menu listed 'freezer burn' as one of the oxymorons that made us chuckle.",
            "sent2": "People often use 'act naturally' without realizing it's one of the oxymorons.",
            "sent3": "The sign saying 'exact estimate' was a clever use of oxymorons to grab attention.",
            "sent4": "Her fashion style was a mix of oxymorons - elegant yet edgy.",
            "sent5": "The movie title 'virtual reality' played with oxymorons to hint at its plot twists."
        },
        {
            "definition": "A rhetorical figure in which incongruous or contradictory terms are combined (e.g. living dead).",
            "pos": "noun",
            "sent1": "The poet's use of 'dark light' showcased the beauty of oxymorons in writing.",
            "sent2": "During the debate, the politician used 'government efficiency' as an example of oxymorons.",
            "sent3": "The song lyrics 'sweet sorrow' played with oxymorons to express complex emotions.",
            "sent4": "His painting depicted a scene of 'organized chaos,' a perfect example of oxymorons.",
            "sent5": "The novel's title 'silent scream' was a haunting use of oxymorons to set the tone."
        }
    ]
}