{
    "term": "ozonization",
    "meanings": [
        {
            "definition": "The process of treating or purifying something with ozone.",
            "pos": "noun",
            "sent1": "The ozonization of water helps remove impurities and make it safe to drink.",
            "sent2": "Scientists use ozonization to clean the air in laboratories and hospitals.",
            "sent3": "During the ozonization of fruits, they seem to get a refreshing boost of cleanliness.",
            "sent4": "The ozonization of fabrics gives them a fresh scent like a field after rain.",
            "sent5": "The ozonization of the room made it feel like a breath of fresh air."
        },
        {
            "definition": "The act of converting oxygen into ozone.",
            "pos": "noun",
            "sent1": "In the laboratory, researchers study the ozonization of oxygen to understand its properties.",
            "sent2": "The ozonization of oxygen in the atmosphere is a natural process that helps protect us from harmful UV rays.",
            "sent3": "The magician's trick involved the sudden ozonization of oxygen, creating a puff of smoke.",
            "sent4": "The ozonization of oxygen in the air felt like a transformation into a purer form of energy.",
            "sent5": "The ozonization of oxygen around the planet is crucial for maintaining a healthy environment."
        },
        {
            "definition": "The application of ozone to a substance for disinfection or deodorization.",
            "pos": "noun",
            "sent1": "The ozonization of the gym equipment helps keep it free from germs and odors.",
            "sent2": "Restaurants use ozonization to ensure the freshness of their food storage areas.",
            "sent3": "The superhero's secret weapon was the power of ozonization, making villains flee from the fresh-smelling air.",
            "sent4": "The ozonization of the room with ozone felt like a burst of cleanliness and purity.",
            "sent5": "The ozonization of the car interior removed all traces of unpleasant smells, leaving it fresh and inviting."
        }
    ]
}