{
    "term": "paals",
    "meanings": [
        {
            "definition": "A long-handled tool with a flat blade, used for digging or cutting.",
            "pos": "noun",
            "sent1": "My dad used a paals to dig a hole for the new tree.",
            "sent2": "The gardener always carries a paals in his hand while working.",
            "sent3": "The mischievous squirrel tried to use the paals as a microphone.",
            "sent4": "Her determination was a paals, cutting through all obstacles in her way.",
            "sent5": "The shiny paals gleamed in the sunlight as it dug into the earth."
        },
        {
            "definition": "To dig or cut with a spade.",
            "pos": "verb",
            "sent1": "I paalsed the soil to plant the seeds for the flowers.",
            "sent2": "The farmer paalsed the field to prepare it for planting.",
            "sent3": "The kids decided to paals a secret tunnel in the sandbox.",
            "sent4": "She paalsed through the pile of leaves to find her lost earring.",
            "sent5": "The chef carefully paalsed the vegetables for the stew."
        },
        {
            "definition": "A card suit marked with a black figure resembling a spade.",
            "pos": "noun",
            "sent1": "The ace of paals is the highest card in the game.",
            "sent2": "She held a hand full of paals in the card game.",
            "sent3": "The magician pulled out a deck of cards with only paals.",
            "sent4": "His luck seemed to be a paals, as he kept drawing the same card.",
            "sent5": "The paals on the card looked like a tiny garden spade."
        },
        {
            "definition": "A sharp, flat projection on the bottom of a horseshoe.",
            "pos": "noun",
            "sent1": "The blacksmith carefully crafted the paals on the horseshoe.",
            "sent2": "The horse's shoe had a sturdy paals for better grip.",
            "sent3": "The mischievous cat tried to play with the paals on the horseshoe.",
            "sent4": "The paals on the horseshoe left a distinct mark on the ground.",
            "sent5": "The paals on the horseshoe glinted in the sunlight as the horse trotted."
        }
    ]
}