{
    "term": "paal",
    "meanings": [
        {
            "definition": "A large, round container used for storing liquids, typically made of metal or plastic.",
            "pos": "noun",
            "sent1": "I poured water from the paal into my glass.",
            "sent2": "The paal in the kitchen is filled with flour.",
            "sent3": "The cat knocked over the paal, creating a messy situation.",
            "sent4": "Her eyes were like deep paals, holding untold secrets.",
            "sent5": "The paal gleamed in the sunlight, reflecting its contents."
        },
        {
            "definition": "To strike or beat with a flat object.",
            "pos": "verb",
            "sent1": "He decided to paal the nail into the wall.",
            "sent2": "The chef used a hammer to paal the meat for tenderness.",
            "sent3": "I accidentally paal-ed my finger while hammering.",
            "sent4": "The waves paal against the shore relentlessly.",
            "sent5": "She could hear him paal-ing the drums in the distance."
        },
        {
            "definition": "A unit of length equal to 1/5 of a vara, used in the Philippines.",
            "pos": "noun",
            "sent1": "The road was marked every paal for measurement.",
            "sent2": "The paal is a common unit of length in the Philippines.",
            "sent3": "He jokingly measured the room using paals instead of feet.",
            "sent4": "The paal stretched out before them, a long journey ahead.",
            "sent5": "The paal marker indicated the distance to the next town."
        },
        {
            "definition": "A traditional Indian milk-based drink.",
            "pos": "noun",
            "sent1": "She enjoyed a refreshing glass of paal after yoga.",
            "sent2": "Paal is a popular beverage during festivals in India.",
            "sent3": "The paal was so creamy and delicious, it felt like a treat.",
            "sent4": "The paal flowed smoothly down her throat, soothing her senses.",
            "sent5": "The aroma of paal filled the room, enticing everyone to try some."
        }
    ]
}