{
    "term": "paans",
    "meanings": [
        {
            "definition": "A betel leaf chewed with areca nut and slaked lime as a stimulant in South and Southeast Asia.",
            "pos": "noun",
            "sent1": "In some cultures, people enjoy chewing paans after meals for a refreshing feeling.",
            "sent2": "She bought some paans from the market to share with her friends.",
            "sent3": "The mischievous monkey stole a paans and ran up a tree, much to the amusement of the onlookers.",
            "sent4": "The idea of chewing paans to stay awake during the long journey seemed like a magical potion.",
            "sent5": "The aroma of the paans lingered in the air, tempting everyone nearby to try a piece."
        },
        {
            "definition": "A small, usually round, flat, and thin object.",
            "pos": "noun",
            "sent1": "She found a shiny paans on the ground and picked it up curiously.",
            "sent2": "The artist carefully placed each colorful paans on the canvas to create a beautiful mosaic.",
            "sent3": "The paans rolled off the table and onto the floor, causing a comical moment during the party.",
            "sent4": "Her eyes sparkled as she discovered a hidden paans among the scattered leaves in the garden.",
            "sent5": "The children used paans as makeshift tokens in their imaginative game of pirates and treasures."
        },
        {
            "definition": "A type of Indian snack made with betel leaves.",
            "pos": "noun",
            "sent1": "The sweet and spicy paans left a delightful taste in her mouth after dinner.",
            "sent2": "He learned the traditional recipe for making paans from his grandmother.",
            "sent3": "The unexpected crunch in the paans made her giggle during the family picnic.",
            "sent4": "The vendor skillfully prepared the paans, turning it into a work of art before serving.",
            "sent5": "The colorful paans displayed in the shop window caught the attention of passersby with its vibrant hues."
        }
    ]
}