{
    "term": "packs",
    "meanings": [
        {
            "definition": "A group of wild animals, especially wolves, living and hunting together.",
            "pos": "noun",
            "sent1": "The packs of wolves roamed the forest in search of food.",
            "sent2": "The documentary showed how packs of wolves cooperate to catch their prey.",
            "sent3": "The packs of wolves decided to have a howling contest for fun.",
            "sent4": "In the darkness, the packs of wolves seemed like shadows moving silently.",
            "sent5": "The packs of wolves moved in perfect harmony, a sight to behold."
        },
        {
            "definition": "A group of people or animals working together.",
            "pos": "noun",
            "sent1": "The packs of students completed the project ahead of schedule.",
            "sent2": "The packs of ants efficiently gathered food for their colony.",
            "sent3": "The packs of friends organized a surprise party for Sarah.",
            "sent4": "In the race, the packs of runners pushed each other to do their best.",
            "sent5": "The packs of dolphins swam gracefully in unison, a mesmerizing sight."
        },
        {
            "definition": "A small cardboard or paper container in which goods are packed for storage or transportation.",
            "pos": "noun",
            "sent1": "She placed the fragile items in the packs carefully to avoid damage.",
            "sent2": "The packs of cookies were neatly arranged in the box for the bake sale.",
            "sent3": "The packs of candies looked like little treasures waiting to be opened.",
            "sent4": "The packs of tea were stacked neatly on the shelf, ready to be sold.",
            "sent5": "The packs of crackers were sealed tightly to keep them fresh for longer."
        },
        {
            "definition": "A group of similar items bundled or wrapped together for convenience or storage.",
            "pos": "noun",
            "sent1": "She bought packs of pens for the office supply.",
            "sent2": "The packs of socks were on sale at the department store.",
            "sent3": "The packs of balloons added a festive touch to the party decorations.",
            "sent4": "The packs of tissues were placed strategically around the room.",
            "sent5": "The packs of seeds were labeled for easy identification in the garden."
        }
    ]
}