{
    "term": "pack",
    "meanings": [
        {
            "definition": "A group of items wrapped or tied together for carrying",
            "pos": "noun",
            "sent1": "I carried a heavy pack on my back during the hike.",
            "sent2": "The pack of supplies was too bulky to fit in the small bag.",
            "sent3": "The pack of snacks was so big, it looked like a mini grocery store!",
            "sent4": "Her suitcase was like a pack of memories from all her travels.",
            "sent5": "The pack of books weighed me down like a ton of bricks."
        },
        {
            "definition": "A group of animals, especially wolves or hounds, that hunt together",
            "pos": "noun",
            "sent1": "The wolf pack howled in unison under the full moon.",
            "sent2": "The pack of hounds chased after the scent of the fox.",
            "sent3": "The pack of wolves played a game of hide-and-seek in the forest.",
            "sent4": "The hunting pack moved swiftly through the dense woods.",
            "sent5": "The pack of wild dogs roamed freely in the wilderness."
        },
        {
            "definition": "To fill a container tightly with items",
            "pos": "verb",
            "sent1": "I need to pack my suitcase for the trip tomorrow.",
            "sent2": "She carefully packed the fragile items in bubble wrap.",
            "sent3": "He tried to pack all his clothes into a tiny backpack.",
            "sent4": "The students helped pack the boxes with school supplies.",
            "sent5": "The chef had to pack the ingredients neatly in the pantry."
        },
        {
            "definition": "To compress something into a confined space",
            "pos": "verb",
            "sent1": "She had to pack her winter clothes into a small drawer.",
            "sent2": "He managed to pack all his belongings into a single suitcase.",
            "sent3": "The clown tried to pack himself into a tiny car for the show.",
            "sent4": "The moving crew helped pack the furniture into the truck.",
            "sent5": "The artist had to pack all her paintings into a small portfolio."
        }
    ]
}