{
    "term": "palankeens",
    "meanings": [
        {
            "definition": "A covered litter carried on the shoulders of four or more bearers.",
            "pos": "noun",
            "sent1": "The palankeens swayed gently as the bearers carried it through the narrow streets.",
            "sent2": "In ancient times, palankeens were a common mode of transportation for the nobility.",
            "sent3": "The palankeens looked like a cozy mobile room, making the traveler feel like a royal.",
            "sent4": "The palankeens glided through the bustling market like a floating throne.",
            "sent5": "The ornate palankeens were adorned with intricate carvings and colorful fabrics."
        },
        {
            "definition": "A type of conveyance used in India and other Eastern countries.",
            "pos": "noun",
            "sent1": "The palankeens were a symbol of luxury and status in traditional Indian culture.",
            "sent2": "Traveling in palankeens was a common sight in the vibrant streets of India.",
            "sent3": "The palankeens seemed like magical chariots from a fairy tale.",
            "sent4": "The palankeens carried the passenger like a precious jewel in a velvet box.",
            "sent5": "The ornate palankeens gleamed in the sunlight, attracting admiring glances."
        },
        {
            "definition": "A mode of transportation in which a person is carried in a covered chair.",
            "pos": "noun",
            "sent1": "The palankeens provided a comfortable and elegant way to travel long distances.",
            "sent2": "People enjoyed the luxurious experience of being carried in palankeens.",
            "sent3": "The palankeens made the traveler feel like a pampered prince on a royal procession.",
            "sent4": "The palankeens shielded the passenger from the elements like a protective cocoon.",
            "sent5": "The ornate palankeens added a touch of grandeur to the procession."
        }
    ]
}