{
    "term": "palsier",
    "meanings": [
        {
            "definition": "To become palsier: to become more shaky or unsteady in movement.",
            "pos": "verb",
            "sent1": "After the injury, his leg started to palsier, making it hard to walk.",
            "sent2": "The old bridge palsiered with each passing car, causing concern for its stability.",
            "sent3": "The wobbly table palsiered like a dancer trying to balance on one foot.",
            "sent4": "Her voice palsiered with nerves as she spoke in front of the large audience.",
            "sent5": "The tree branches palsiered in the wind, swaying back and forth."
        },
        {
            "definition": "Palsier: comparative form of the adjective 'palsy', meaning affected with paralysis or involuntary tremors.",
            "pos": "adjective",
            "sent1": "The palsier hand struggled to hold onto the cup without spilling.",
            "sent2": "She moved with caution, aware of her palsier leg that sometimes gave out.",
            "sent3": "The robot's palsier movements made it look like it was dancing a strange dance.",
            "sent4": "His palsier grip on reality made it hard for him to distinguish dreams from waking life.",
            "sent5": "The palsier patient relied on a wheelchair for mobility due to muscle weakness."
        },
        {
            "definition": "Palsier: comparative form of the verb 'palsy', meaning to paralyze or weaken.",
            "pos": "verb",
            "sent1": "The spider's venom can palsier its prey, making it easier to catch.",
            "sent2": "The disease slowly palsiered his muscles, causing difficulty in movement.",
            "sent3": "The magician's spell seemed to palsier the audience, leaving them in awe.",
            "sent4": "The fear of failure can palsier one's ability to take risks and try new things.",
            "sent5": "The cold weather palsiered the car's engine, making it hard to start."
        }
    ]
}