{
    "term": "paludism",
    "meanings": [
        {
            "definition": "A malarial fever.",
            "pos": "noun",
            "sent1": "After traveling to a tropical region, he developed paludism and had a high fever.",
            "sent2": "The doctor diagnosed the patient with paludism after experiencing chills and sweating.",
            "sent3": "The picnic was ruined when everyone caught paludism and started feeling unwell.",
            "sent4": "The paludism of conflict spread through the community like a contagious illness.",
            "sent5": "The relentless paludism made him feel weak and exhausted, like battling a persistent foe."
        },
        {
            "definition": "The condition of having malaria.",
            "pos": "noun",
            "sent1": "Her paludism was confirmed by the blood test results showing the presence of malaria parasites.",
            "sent2": "In regions with high mosquito populations, paludism is a common health concern.",
            "sent3": "Despite taking precautions, his paludism returned, reminding him of its stubborn nature.",
            "sent4": "The paludism in the village was a constant reminder of the need for better healthcare access.",
            "sent5": "The severity of her paludism required immediate medical attention to prevent complications."
        },
        {
            "definition": "The presence of malaria in a particular area.",
            "pos": "noun",
            "sent1": "The government issued a warning about the paludism in the nearby swampy region.",
            "sent2": "Travelers were advised to take anti-malarial medication due to the paludism in the area.",
            "sent3": "The local community worked together to reduce the paludism in their surroundings.",
            "sent4": "The persistent paludism in the region posed a threat to public health.",
            "sent5": "The sudden increase in paludism cases raised concerns about the effectiveness of prevention measures."
        }
    ]
}