{
    "term": "pancratia",
    "meanings": [
        {
            "definition": "A sport combining boxing and wrestling.",
            "pos": "noun",
            "sent1": "In pancratia, athletes use both boxing and wrestling skills.",
            "sent2": "The pancratia match was intense, with fighters showcasing their boxing and wrestling abilities.",
            "sent3": "At the pancratia competition, the boxer accidentally used wrestling moves, making everyone laugh.",
            "sent4": "The pancratia fighters moved like graceful dancers, seamlessly blending boxing and wrestling techniques.",
            "sent5": "The crowd cheered as the pancratia fighters demonstrated their mastery of both boxing and wrestling."
        },
        {
            "definition": "A form of ancient Greek martial art.",
            "pos": "noun",
            "sent1": "Ancient Greeks practiced pancratia as a martial art for self-defense.",
            "sent2": "The history books mention pancratia as a traditional Greek martial art.",
            "sent3": "During the pancratia class, the students tried to mimic the ancient Greek fighting style.",
            "sent4": "His fighting spirit was like that of a warrior from the pancratia era.",
            "sent5": "The ancient statues depicted warriors skilled in pancratia, capturing the essence of the martial art."
        },
        {
            "definition": "A type of combat sport.",
            "pos": "noun",
            "sent1": "Pancratia is a popular combat sport that tests both physical strength and agility.",
            "sent2": "The athletes trained rigorously for the upcoming pancratia tournament.",
            "sent3": "During the pancratia match, the competitors displayed remarkable sportsmanship.",
            "sent4": "The pancratia arena buzzed with excitement as the fighters prepared for battle.",
            "sent5": "The pancratia championship showcased the best of combat sports, drawing a large audience."
        }
    ]
}