{
    "term": "pandan",
    "meanings": [
        {
            "definition": "A tropical plant with long, narrow leaves used in Southeast Asian cooking for its fragrance and flavor.",
            "pos": "noun",
            "sent1": "The pandan plant grows in warm regions and adds a unique taste to dishes.",
            "sent2": "In the recipe, you need to add pandan leaves to enhance the aroma of the dish.",
            "sent3": "The mischievous squirrel tried to hide its nuts under the pandan plant's leaves.",
            "sent4": "Her words were as refreshing as the scent of pandan leaves in the kitchen.",
            "sent5": "The pandan plant's leaves danced in the breeze, spreading their delightful fragrance."
        },
        {
            "definition": "A type of green, fragrant rice cake made with pandan leaves.",
            "pos": "noun",
            "sent1": "The pandan rice cake had a lovely green color and a delightful aroma.",
            "sent2": "During the festival, families enjoy making and sharing pandan rice cakes.",
            "sent3": "The mischievous cat sneaked into the kitchen and stole a piece of pandan cake.",
            "sent4": "Her laughter filled the room like the sweet scent of pandan rice cakes.",
            "sent5": "The pandan rice cake melted in her mouth, leaving a lingering taste of happiness."
        },
        {
            "definition": "A sweet, green-colored drink flavored with pandan extract.",
            "pos": "noun",
            "sent1": "The pandan drink was a hit at the party with its vibrant green hue.",
            "sent2": "During the hot summer days, people love to sip on refreshing pandan drinks.",
            "sent3": "The mischievous siblings played a prank by adding extra pandan extract to the drink.",
            "sent4": "Her eyes sparkled like the shimmering surface of a chilled pandan drink.",
            "sent5": "The pandan drink tasted like a sip of nature's own sweetness, calming and fresh."
        }
    ]
}