{
    "term": "panning",
    "meanings": [
        {
            "definition": "To move a camera horizontally to follow a moving subject.",
            "pos": "verb",
            "sent1": "The filmmaker was panning the camera to capture the running horse.",
            "sent2": "During the nature documentary, the cameraman was panning across the beautiful landscape.",
            "sent3": "As the camera panned to the left, it comically revealed a sneaky squirrel stealing a snack.",
            "sent4": "Her eyes panned across the room, searching for any signs of the missing keys.",
            "sent5": "The panning shot of the bustling city street made the viewer feel like they were right there in the action."
        },
        {
            "definition": "To criticize severely.",
            "pos": "verb",
            "sent1": "The teacher was panning the student's sloppy essay with red marks.",
            "sent2": "The movie critic panned the new film for its lackluster plot.",
            "sent3": "Despite his harsh panning of her cooking, she couldn't help but laugh at his exaggerated reactions.",
            "sent4": "Her words panned through his mind, leaving a trail of self-doubt in their wake.",
            "sent5": "The judge's panning remarks echoed in the courtroom, leaving everyone in silence."
        },
        {
            "definition": "To wash gravel in a pan to separate out gold or other valuable minerals.",
            "pos": "verb",
            "sent1": "The gold miner was panning for gold in the river, hoping for a big find.",
            "sent2": "In the old days, prospectors would pan for gold in the streams of the Wild West.",
            "sent3": "As he panned the gravel, he jokingly exclaimed, 'Eureka! I've struck gold!'",
            "sent4": "Her hands moved swiftly, panning the mixture to reveal the glimmering specks of gold.",
            "sent5": "The sunlight glinted off the water as he panned for treasure, his excitement growing with each sift."
        }
    ]
}