{
    "term": "pantomime",
    "meanings": [
        {
            "definition": "A dramatic entertainment, originating in Roman mime, in which performers express meaning through gestures accompanied by music.",
            "pos": "noun",
            "sent1": "During the school play, the students performed a pantomime to tell the story without speaking.",
            "sent2": "The children enjoyed watching the pantomime at the theater, where the actors used gestures to convey the story.",
            "sent3": "At the party, Sarah tried to do a pantomime of a monkey swinging from a tree, making everyone laugh.",
            "sent4": "Her dance was like a pantomime of joy, each movement expressing happiness without words.",
            "sent5": "The street performer captivated the audience with a pantomime of a robot, moving in mechanical precision."
        },
        {
            "definition": "A performance or entertainment using gestures and movements without words.",
            "pos": "noun",
            "sent1": "The silent film was a pantomime, with actors conveying emotions through their actions.",
            "sent2": "The clown's pantomime at the circus delighted the children with funny movements and expressions.",
            "sent3": "The mime artist put on a pantomime of trying to catch an invisible butterfly, amusing the crowd.",
            "sent4": "The forest was alive with the pantomime of trees swaying in the wind, a silent dance of nature.",
            "sent5": "In the art of pantomime, the body becomes the canvas to paint stories without words."
        },
        {
            "definition": "To express or represent something through exaggerated gestures and movements, often for comedic effect.",
            "pos": "verb",
            "sent1": "She pantomimed knocking on the door when her friend couldn't hear her over the phone.",
            "sent2": "The comedian pantomimed slipping on a banana peel, causing the audience to burst into laughter.",
            "sent3": "He pantomimed a giant sneeze, pretending to blow away all the papers on the desk.",
            "sent4": "The actor pantomimed the struggle of climbing a mountain, using only his body to convey the effort.",
            "sent5": "The children pantomimed a spaceship launch, their arms and legs mimicking the countdown and liftoff."
        }
    ]
}