{
    "term": "pantechnicons",
    "meanings": [
        {
            "definition": "A large van or wagon used for transporting goods.",
            "pos": "noun",
            "sent1": "The pantechnicons arrived at the warehouse to deliver the new supplies.",
            "sent2": "The company rented a pantechnicon to move all the office furniture to the new building.",
            "sent3": "The pantechnicons lined up outside the store, ready to haul away the old inventory.",
            "sent4": "The pantechnicon rolled through the city streets like a giant metal beast carrying its cargo.",
            "sent5": "The shiny pantechnicon gleamed in the sunlight as it carried boxes of fresh produce."
        },
        {
            "definition": "A type of vehicle used for moving furniture or other large items.",
            "pos": "noun",
            "sent1": "We hired a pantechnicon to transport the heavy couch to our new home.",
            "sent2": "The moving company used a pantechnicon to deliver the new appliances to the customer's house.",
            "sent3": "The pantechnicons raced each other down the highway, each carrying a different set of belongings.",
            "sent4": "The pantechnicon stood out in the parking lot, towering over the other vehicles with its bulky frame.",
            "sent5": "The old pantechnicon creaked and groaned under the weight of the antique wardrobe."
        },
        {
            "definition": "A truck or lorry used for carrying a variety of goods.",
            "pos": "noun",
            "sent1": "The pantechnicon stopped at each farm to collect the fresh produce for the market.",
            "sent2": "The delivery company used a fleet of pantechnicons to distribute packages across the city.",
            "sent3": "The pantechnicons were decorated with colorful logos, making them stand out on the road.",
            "sent4": "The pantechnicon hummed along the highway, filled with a mix of electronics and clothing.",
            "sent5": "The massive pantechnicon dwarfed the small cars around it as it made its way through the town."
        }
    ]
}