{
    "term": "pantomimes",
    "meanings": [
        {
            "definition": "A dramatic entertainment, originating in Roman mime, in which performers express meaning through gestures accompanied by music.",
            "pos": "noun",
            "sent1": "During the school play, the students put on a pantomimes show with music and gestures.",
            "sent2": "The actors on stage performed pantomimes, telling a story without speaking.",
            "sent3": "At the party, Sarah entertained everyone with her funny pantomimes, making everyone laugh.",
            "sent4": "The dancer's graceful pantomimes on stage painted a vivid picture of love and loss.",
            "sent5": "The silent movie star was known for her expressive pantomimes that captivated audiences."
        },
        {
            "definition": "To express or represent something through exaggerated or theatrical gestures.",
            "pos": "verb",
            "sent1": "She pantomimes her excitement by jumping up and down with a big smile.",
            "sent2": "The comedian pantomimes a funny story using only his face and body movements.",
            "sent3": "The mime artist pantomimes a scene where he pretends to be stuck in a box, amusing the crowd.",
            "sent4": "His exaggerated gestures pantomime the struggle of climbing a mountain, even though he's on flat ground.",
            "sent5": "The actor pantomimes the feeling of fear so realistically that the audience gasps in response."
        },
        {
            "definition": "A performance or entertainment using gestures and movements without words.",
            "pos": "noun",
            "sent1": "The children put on a pantomimes show for their parents, using only their hands and faces.",
            "sent2": "The street performer captivated the audience with his pantomimes, earning applause.",
            "sent3": "The robot's jerky pantomimes of human actions were both eerie and amusing.",
            "sent4": "The dancer's fluid pantomimes told a story of joy and sorrow without uttering a single word.",
            "sent5": "The silent film relied on pantomimes to convey emotions and plot, engaging the viewers without sound."
        }
    ]
}