{
    "term": "paranoically",
    "meanings": [
        {
            "definition": "In a paranoid manner",
            "pos": "adverb",
            "sent1": "She looked around paranoically, convinced someone was following her.",
            "sent2": "He always checked the locks on the doors paranoically before going to bed.",
            "sent3": "Despite being in a safe neighborhood, she still double-checked the windows paranoically.",
            "sent4": "His eyes darted paranoically from side to side, searching for any signs of danger.",
            "sent5": "The old man peered paranoically through the curtains, expecting trouble at any moment."
        },
        {
            "definition": "Showing symptoms of paranoia",
            "pos": "adjective",
            "sent1": "The paranoically fearful man refused to leave his house without multiple security measures.",
            "sent2": "Her paranoically suspicious behavior made her friends worry about her mental state.",
            "sent3": "The cat's paranoically cautious approach to new people was both amusing and endearing.",
            "sent4": "The dark clouds looming overhead cast a paranoically ominous shadow over the town.",
            "sent5": "The paranoically guarded fortress was impenetrable to any intruders."
        },
        {
            "definition": "Characterized by extreme suspicion or distrust",
            "pos": "adjective",
            "sent1": "The paranoically jealous husband constantly accused his wife of infidelity.",
            "sent2": "The politician's paranoically defensive reactions to criticism raised eyebrows among his colleagues.",
            "sent3": "The squirrel's paranoically protective behavior over its acorns was both amusing and impressive.",
            "sent4": "The eerie silence in the abandoned house felt paranoically unsettling to the visitors.",
            "sent5": "The paranoically guarded secret was finally revealed, causing shock and disbelief."
        }
    ]
}