{
    "term": "paraplegia",
    "meanings": [
        {
            "definition": "Paraplegia: paralysis of the lower half of the body",
            "pos": "noun",
            "sent1": "After the accident, he was diagnosed with paraplegia and could not move his legs.",
            "sent2": "The doctor explained that paraplegia meant he would not be able to feel or move his lower body.",
            "sent3": "Despite his paraplegia, he remained positive and focused on his upper body strength.",
            "sent4": "Her fear of failure was like paraplegia, immobilizing her from taking any risks.",
            "sent5": "The image of the marathon runner with paraplegia crossing the finish line inspired many."
        },
        {
            "definition": "Paraplegia: a condition resulting from spinal cord injury",
            "pos": "noun",
            "sent1": "The doctors confirmed that his paraplegia was caused by a severe spinal cord injury.",
            "sent2": "She learned to adapt to life with paraplegia after her spinal cord injury.",
            "sent3": "His friends joked that his sudden love for wheelchairs was a result of his paraplegia.",
            "sent4": "The disconnect between them felt like a paraplegia in their relationship.",
            "sent5": "The documentary shed light on the challenges faced by individuals with paraplegia due to spinal cord injuries."
        },
        {
            "definition": "Paraplegia: the inability to move the legs and lower body",
            "pos": "noun",
            "sent1": "Despite his determination, his paraplegia made it impossible for him to walk.",
            "sent2": "The therapist worked with him to improve his mobility despite his paraplegia.",
            "sent3": "Her paraplegia seemed to vanish when she danced in her dreams.",
            "sent4": "The weight of his responsibilities felt like a heavy paraplegia holding him down.",
            "sent5": "The artist depicted the frustration of paraplegia through a powerful painting of a wheelchair."
        }
    ]
}