{
    "term": "parathyroidectomies",
    "meanings": [
        {
            "definition": "The surgical removal of one or more parathyroid glands.",
            "pos": "noun",
            "sent1": "The doctor performed two parathyroidectomies on the patient.",
            "sent2": "Parathyroidectomies are common procedures to treat certain medical conditions.",
            "sent3": "During the parathyroidectomies, the surgeon accidentally dropped a tool, causing a moment of panic.",
            "sent4": "The parathyroidectomies were like removing troublesome weeds from a garden.",
            "sent5": "The room echoed with the sounds of parathyroidectomies being performed."
        },
        {
            "definition": "The procedure of removing abnormal parathyroid tissue.",
            "pos": "noun",
            "sent1": "After the parathyroidectomies, the patient's calcium levels returned to normal.",
            "sent2": "Doctors recommend parathyroidectomies for patients with hyperparathyroidism.",
            "sent3": "The parathyroidectomies went smoothly, much to everyone's relief.",
            "sent4": "Her relief after the successful parathyroidectomies was like a weight lifted off her shoulders.",
            "sent5": "The bright lights in the operating room illuminated the parathyroidectomies in progress."
        },
        {
            "definition": "The act of excising overactive parathyroid glands.",
            "pos": "noun",
            "sent1": "The surgeon's skill in performing parathyroidectomies was commendable.",
            "sent2": "Patients often experience improved health after successful parathyroidectomies.",
            "sent3": "The parathyroidectomies were so quick, it was almost like magic.",
            "sent4": "The relief after the parathyroidectomies was like a cloud lifting from his mind.",
            "sent5": "The hospital hallway buzzed with talk of the upcoming parathyroidectomies."
        }
    ]
}