{
    "term": "paras",
    "meanings": [
        {
            "definition": "a unit of currency in Nepal",
            "pos": "noun",
            "sent1": "In Nepal, you can buy many things with just a few paras.",
            "sent2": "I exchanged my dollars for paras when I visited Nepal.",
            "sent3": "Why did the paras refuse to play with the rupees? Because they were too small!",
            "sent4": "The value of a paras in Nepal is like finding a hidden treasure.",
            "sent5": "The colorful paras jingled in my pocket as I walked through the market."
        },
        {
            "definition": "a small, flat, disc-shaped object used in games",
            "pos": "noun",
            "sent1": "The children played with paras in the park all afternoon.",
            "sent2": "I found a shiny paras under the couch while cleaning.",
            "sent3": "Why did the paras roll away from the other toys? It wanted to be the disc of attention!",
            "sent4": "The paras spun through the air like a flying saucer.",
            "sent5": "The paras landed perfectly in the target, earning a high score in the game."
        },
        {
            "definition": "a type of plant that grows on other plants",
            "pos": "noun",
            "sent1": "The paras on the tree trunk added a touch of green to the forest.",
            "sent2": "The paras on the branches provided a home for small insects.",
            "sent3": "Why did the paras blush? Because it saw the mistletoe!",
            "sent4": "The paras intertwined with the host plant, creating a beautiful symbiotic relationship.",
            "sent5": "The paras swayed gently in the breeze, enjoying the sunlight filtering through the leaves."
        },
        {
            "definition": "a prefix meaning beside or alongside",
            "pos": "prefix",
            "sent1": "The parasocial relationships formed online can feel real to some people.",
            "sent2": "The parasitism between the two characters in the story was evident.",
            "sent3": "Why did the parasailing instructor always have great stories? Because he lived life beside the clouds!",
            "sent4": "The friendship between them was like a parasol, providing shade and comfort.",
            "sent5": "The collaboration between the two artists was a masterpiece, working paras to create something beautiful."
        }
    ]
}