{
    "term": "pararescueman",
    "meanings": [
        {
            "definition": "A member of the United States Air Force specially trained for search and rescue missions.",
            "pos": "noun",
            "sent1": "The pararescueman bravely saved the hiker stranded on the mountain.",
            "sent2": "The pararescueman rushed to the scene to help the injured climber.",
            "sent3": "The pararescueman joked that rescuing cats stuck in trees was part of the job.",
            "sent4": "The pararescueman was like a guardian angel descending from the sky to aid those in need.",
            "sent5": "The pararescueman's heroism in saving lives is truly remarkable."
        },
        {
            "definition": "A highly skilled individual trained in emergency medical care and combat tactics.",
            "pos": "noun",
            "sent1": "The pararescueman expertly administered first aid to the injured soldier.",
            "sent2": "In the military, the pararescueman is known for their exceptional medical and combat skills.",
            "sent3": "During training, the pararescueman pretended to perform CPR on a dummy made of balloons.",
            "sent4": "The pararescueman's ability to remain calm under pressure is like a superpower.",
            "sent5": "The pararescueman's knowledge of emergency medicine is crucial in saving lives."
        },
        {
            "definition": "One who performs daring rescues in dangerous situations.",
            "pos": "noun",
            "sent1": "The pararescueman fearlessly jumped into the raging river to save the drowning child.",
            "sent2": "As a pararescueman, he is always ready to risk his life to save others.",
            "sent3": "The pararescueman playfully referred to himself as a real-life superhero.",
            "sent4": "In the face of danger, the pararescueman's bravery shines like a beacon.",
            "sent5": "The pararescueman's courage in the most perilous situations is truly inspiring."
        }
    ]
}