{
    "term": "parangs",
    "meanings": [
        {
            "definition": "A type of machete or large knife used in Malaysia and Indonesia.",
            "pos": "noun",
            "sent1": "The villagers used parangs to clear the thick bushes in the jungle.",
            "sent2": "The explorer carried a sharp parangs for protection in the wilderness.",
            "sent3": "When the chef mistakenly grabbed a parangs instead of a kitchen knife, chaos ensued in the restaurant.",
            "sent4": "The parangs gleamed in the sunlight, ready to tackle any obstacle in its path.",
            "sent5": "The old man's hands expertly wielded the parangs, a tool he had used all his life."
        },
        {
            "definition": "The act of using parangs for cutting through dense vegetation.",
            "pos": "noun",
            "sent1": "The team's progress was swift thanks to their skillful parangs.",
            "sent2": "The sound of parangs slicing through the thick undergrowth echoed in the forest.",
            "sent3": "The hiker's parangs danced through the bushes like a skilled musician playing a melody.",
            "sent4": "With each swing, the parangs made quick work of the tangled vines blocking the path.",
            "sent5": "The rhythmic swish of the parangs filled the air as the workers cleared the overgrown area."
        },
        {
            "definition": "The sound of parangs hitting against each other.",
            "pos": "noun",
            "sent1": "In the distance, the rhythmic clang of parangs could be heard from the village.",
            "sent2": "The metallic ring of the parangs meeting in the training yard signaled the start of practice.",
            "sent3": "The musical parangs created a unique symphony as they clashed together in the performance.",
            "sent4": "The clash of parangs filled the air, creating a cacophony of sound in the workshop.",
            "sent5": "The parangs' collision produced a sharp sound that reverberated through the valley."
        }
    ]
}