{
    "term": "parawing",
    "meanings": [
        {
            "definition": "A type of parachute designed for use in sports such as paragliding.",
            "pos": "noun",
            "sent1": "During the paragliding competition, the athlete deployed their parawing gracefully.",
            "sent2": "The parawing opened smoothly, allowing the paraglider to descend safely.",
            "sent3": "At the sports store, they mistook the parawing for a regular parachute and tried to jump off a small hill.",
            "sent4": "Her parawing of colorful fabric billowed in the wind like a giant flower petal.",
            "sent5": "The intricate design of the parawing made it stand out among the other parachutes."
        },
        {
            "definition": "A wing-shaped structure used in aviation for lift and control.",
            "pos": "noun",
            "sent1": "The aircraft's parawing provided the necessary lift for takeoff.",
            "sent2": "The engineers studied the parawing's aerodynamics to improve flight efficiency.",
            "sent3": "The birds perched on the parawing of the plane, thinking it was a giant tree branch.",
            "sent4": "The parawing sliced through the air with precision, guiding the aircraft smoothly.",
            "sent5": "The pilot adjusted the angle of the parawing to maintain altitude during the flight."
        },
        {
            "definition": "To glide or soar using a parawing.",
            "pos": "verb",
            "sent1": "She loved to parawing over the vast landscape, feeling the wind in her hair.",
            "sent2": "The experienced paraglider taught the beginners how to parawing safely.",
            "sent3": "The penguin tried to parawing using a makeshift parawing made of leaves.",
            "sent4": "His dreams were like wings that allowed him to parawing through the night sky.",
            "sent5": "With determination, he learned to parawing gracefully, mastering the art of flight."
        }
    ]
}