{
    "term": "parlay",
    "meanings": [
        {
            "definition": "To bet or gamble with the winnings from a previous bet.",
            "pos": "verb",
            "sent1": "After winning at poker, he decided to parlay his earnings into a game of blackjack.",
            "sent2": "She likes to parlay her lottery winnings into more tickets for the next draw.",
            "sent3": "Trying to parlay a small win into a big one, he ended up losing everything.",
            "sent4": "He attempted to parlay his luck at the casino into a fortune, but it quickly turned sour.",
            "sent5": "The gambler's strategy was to parlay each small victory into a larger one."
        },
        {
            "definition": "To use success or luck to achieve a desired outcome.",
            "pos": "verb",
            "sent1": "With his charm and wit, he was able to parlay his way into getting a promotion.",
            "sent2": "She hoped to parlay her good grades into a scholarship for college.",
            "sent3": "He tried to parlay his good mood into convincing his friends to go to the beach.",
            "sent4": "The team captain knew how to parlay his team's enthusiasm into a winning streak.",
            "sent5": "She managed to parlay her talent for painting into a successful career as an artist."
        },
        {
            "definition": "A series of bets in which the original stake and winnings are wagered on successive bets.",
            "pos": "noun",
            "sent1": "His risky parlay on the horse races paid off with a huge jackpot.",
            "sent2": "The gambler placed a parlay on multiple football games, hoping for a big payout.",
            "sent3": "The parlay he made at the casino involved betting on three different games in a row.",
            "sent4": "She decided to try her luck with a parlay on the roulette table, combining her winnings each time.",
            "sent5": "The high roller's favorite strategy was to place a parlay on the most unpredictable games."
        }
    ]
}