{
    "term": "parols",
    "meanings": [
        {
            "definition": "A traditional Filipino Christmas lantern made of bamboo and paper.",
            "pos": "noun",
            "sent1": "During the holidays, we hang colorful parols outside our house.",
            "sent2": "The parols illuminated the street with their festive glow.",
            "sent3": "The mischievous cat tried to climb the parols, thinking they were giant toys.",
            "sent4": "The parols swayed gently in the evening breeze, casting a warm light.",
            "sent5": "The intricate design of the parols captured the essence of Christmas magic."
        },
        {
            "definition": "To speak or write in a loud, angry, or emotionally charged manner.",
            "pos": "verb",
            "sent1": "Please don't parols at me when you're upset.",
            "sent2": "He tends to parols whenever he disagrees with someone.",
            "sent3": "The toddler started to parols when his toy was taken away.",
            "sent4": "Her words parols through the room, causing tension among the listeners.",
            "sent5": "The teacher had to calm down the student who began to parols during class."
        },
        {
            "definition": "A type of decorative object or ornament.",
            "pos": "noun",
            "sent1": "The shelves were filled with delicate parols and figurines.",
            "sent2": "She collected unique parols from different countries.",
            "sent3": "The parols added a touch of elegance to the room.",
            "sent4": "The antique shop displayed various parols from different eras.",
            "sent5": "The parols sparkled under the light, catching everyone's attention."
        },
        {
            "definition": "To grant a prisoner an early release from prison.",
            "pos": "verb",
            "sent1": "The governor decided to parols the inmate due to good behavior.",
            "sent2": "The judge may choose to parols the offender for a fresh start.",
            "sent3": "The community supported the decision to parols the reformed criminal.",
            "sent4": "The organization helps to parols deserving individuals back into society.",
            "sent5": "The parole board will review the case before deciding to parols the convict."
        }
    ]
}