{
    "term": "parody",
    "meanings": [
        {
            "definition": "An imitation of the style of a particular writer, artist, or genre with deliberate exaggeration for comic effect.",
            "pos": "noun",
            "sent1": "The parody of the famous author's writing made everyone laugh.",
            "sent2": "The comedy show included a hilarious parody of a popular movie scene.",
            "sent3": "The students created a parody of Shakespeare's play for their school project.",
            "sent4": "Her exaggerated parody of the fashion industry was both funny and thought-provoking.",
            "sent5": "The parody of the politician's speech was so accurate, it became a viral sensation."
        },
        {
            "definition": "A humorous or satirical imitation of a serious piece of literature or art.",
            "pos": "noun",
            "sent1": "The parody of the classic novel added a comedic twist to the story.",
            "sent2": "The comedian's performance was a brilliant parody of a famous painting.",
            "sent3": "The parody of the museum exhibit had visitors chuckling at the clever humor.",
            "sent4": "Her satirical parody of the art world's pretentiousness was both clever and entertaining.",
            "sent5": "The parody of the opera singer's performance was both funny and surprisingly accurate."
        },
        {
            "definition": "To produce a humorous imitation of (a writer, artist, or genre).",
            "pos": "verb",
            "sent1": "She decided to parody the famous singer's latest hit song.",
            "sent2": "The comedy group loves to parody popular TV shows in their sketches.",
            "sent3": "He tried to parody the famous painter's style but ended up creating his own unique art.",
            "sent4": "The comedian's ability to parody celebrities always leaves the audience in stitches.",
            "sent5": "The students planned to parody the school principal in their upcoming play."
        }
    ]
}