{
    "term": "parroting",
    "meanings": [
        {
            "definition": "To repeat or imitate without understanding or thought.",
            "pos": "verb",
            "sent1": "She was just parroting what the teacher said without really knowing what it meant.",
            "sent2": "The child was parroting the song lyrics he heard on the radio.",
            "sent3": "The parrot was parroting the owner's sneeze, much to everyone's amusement.",
            "sent4": "Her little brother was parroting her every move, like a mirror reflecting her actions.",
            "sent5": "The robot was parroting the commands it was programmed to follow, showing no originality."
        },
        {
            "definition": "To mimic or copy someone else's words or actions.",
            "pos": "verb",
            "sent1": "He was parroting his friend's jokes to make others laugh.",
            "sent2": "The comedian was known for parroting famous politicians in his stand-up routine.",
            "sent3": "The parrot was parroting the dog's bark, causing confusion in the household.",
            "sent4": "The student was parroting the professor's lecture, hoping to impress with knowledge.",
            "sent5": "The actor was parroting the gestures of the character he was portraying, down to the smallest detail."
        },
        {
            "definition": "The act of mindlessly repeating something said by another.",
            "pos": "noun",
            "sent1": "Her constant parroting of her favorite catchphrase annoyed her friends.",
            "sent2": "The politician's parroting of the same promises lost its impact over time.",
            "sent3": "The parrot's parroting of the TV commercials made the family laugh every time.",
            "sent4": "The parroting of the old legend by the villagers added a sense of tradition to the storytelling.",
            "sent5": "The child's parroting of the nursery rhyme was so adorable that everyone joined in singing along."
        }
    ]
}