{
    "term": "partiality",
    "meanings": [
        {
            "definition": "Unfair bias towards a particular person or group.",
            "pos": "noun",
            "sent1": "Her partiality towards her best friend was evident to everyone.",
            "sent2": "The judge's partiality towards the defendant raised concerns about the fairness of the trial.",
            "sent3": "His partiality for always choosing the same team in games made his friends tease him.",
            "sent4": "The teacher's partiality towards certain students was like a spotlight on their achievements.",
            "sent5": "The company's hiring process was marred by partiality, leading to dissatisfaction among applicants."
        },
        {
            "definition": "A liking or preference for something.",
            "pos": "noun",
            "sent1": "Her partiality for chocolate ice cream was well-known among her friends.",
            "sent2": "His partiality for action movies made him a regular at the cinema.",
            "sent3": "The cat showed partiality for the sunny spot by the window.",
            "sent4": "The chef's partiality for using fresh ingredients elevated the quality of his dishes.",
            "sent5": "The child's partiality for playing with building blocks sparked creativity and imagination."
        },
        {
            "definition": "Incomplete or limited in scope.",
            "pos": "adjective",
            "sent1": "The partiality report only covered the first quarter of the year.",
            "sent2": "Her partiality knowledge of the subject made it challenging for her to complete the assignment.",
            "sent3": "The partiality map failed to show all the important landmarks in the city.",
            "sent4": "The partiality information provided in the article left readers with more questions than answers.",
            "sent5": "The partiality view from the top of the hill was still breathtaking."
        }
    ]
}