{
    "term": "parturient",
    "meanings": [
        {
            "definition": "About to give birth",
            "pos": "adjective",
            "sent1": "The parturient cat nested in a cozy corner.",
            "sent2": "The parturient mother elephant was carefully monitored by the zookeepers.",
            "sent3": "The parturient mare seemed to be counting down the days on her equine calendar.",
            "sent4": "The parturient clouds were heavy with the promise of rain.",
            "sent5": "The parturient sow's belly was round and ready to burst with piglets."
        },
        {
            "definition": "In labor",
            "pos": "adjective",
            "sent1": "The parturient woman breathed deeply through her contractions.",
            "sent2": "The parturient dog paced anxiously in the whelping box.",
            "sent3": "The parturient hen clucked loudly as she prepared to lay her eggs.",
            "sent4": "The parturient storm clouds darkened the sky with impending rain.",
            "sent5": "The parturient cow mooed softly as she labored to bring her calf into the world."
        },
        {
            "definition": "Giving birth",
            "pos": "verb",
            "sent1": "The mare parturiented in the middle of the night.",
            "sent2": "The cat parturiented quietly in the corner of the room.",
            "sent3": "The dog parturiented with a mix of whimpers and whines.",
            "sent4": "The cow parturiented under the watchful eye of the farmer.",
            "sent5": "The rabbit parturiented swiftly, surprising everyone with her speed."
        },
        {
            "definition": "Producing or about to produce offspring",
            "pos": "adjective",
            "sent1": "The parturient ewe grazed peacefully in the pasture.",
            "sent2": "The parturient rabbit burrowed deep to create a safe nest.",
            "sent3": "The parturient fish shimmered with the colors of impending motherhood.",
            "sent4": "The parturient tree was heavy with the weight of ripening fruit.",
            "sent5": "The parturient bird sang a sweet melody to her unhatched chicks."
        }
    ]
}