{
    "term": "paschals",
    "meanings": [
        {
            "definition": "relating to or characteristic of Easter",
            "pos": "adjective",
            "sent1": "The paschals decorations filled the church with joy.",
            "sent2": "The paschals holiday is a time for family gatherings.",
            "sent3": "The paschals bunnies were hopping around the garden.",
            "sent4": "Her smile was as bright as a paschals sunrise.",
            "sent5": "The paschals colors of spring bloomed everywhere."
        },
        {
            "definition": "a celebration of Easter",
            "pos": "noun",
            "sent1": "The church organized a beautiful paschals for the community.",
            "sent2": "The whole town joined the paschals procession.",
            "sent3": "The children's paschals was filled with laughter and egg hunts.",
            "sent4": "The paschals brought everyone together like a big family reunion.",
            "sent5": "The annual paschals was a time of reflection and joy."
        },
        {
            "definition": "a type of Easter egg",
            "pos": "noun",
            "sent1": "She carefully painted the paschals with intricate designs.",
            "sent2": "The children eagerly searched for the hidden paschals in the garden.",
            "sent3": "The mischievous puppy stole one of the paschals and ran off.",
            "sent4": "The paschals gleamed in the sunlight like precious jewels.",
            "sent5": "The basket was filled with colorful paschals for the Easter hunt."
        },
        {
            "definition": "a type of Easter candle",
            "pos": "noun",
            "sent1": "The paschals candles illuminated the dark church.",
            "sent2": "The priest lit the paschals to begin the Easter service.",
            "sent3": "The sweet scent of the paschals filled the room.",
            "sent4": "The paschals flickered like tiny beacons of hope.",
            "sent5": "The paschals candles symbolized the light of Christ."
        }
    ]
}