{
    "term": "pash",
    "meanings": [
        {
            "definition": "A passionate kiss.",
            "pos": "noun",
            "sent1": "After the movie, they shared a sweet pash.",
            "sent2": "She gave him a quick pash on the cheek.",
            "sent3": "The pash in the romantic movie made everyone smile.",
            "sent4": "Their pash was like a burst of fireworks in the night sky.",
            "sent5": "The pash between the characters was filled with emotion and longing."
        },
        {
            "definition": "To kiss passionately.",
            "pos": "verb",
            "sent1": "They pashed under the moonlight by the lake.",
            "sent2": "The couple pashed before saying goodbye.",
            "sent3": "The puppies pashed playfully in the park.",
            "sent4": "The waves pashed against the shore with a gentle rhythm.",
            "sent5": "The dancers pashed with grace and intensity on stage."
        },
        {
            "definition": "A strong feeling of love or attraction.",
            "pos": "noun",
            "sent1": "She felt a warm pash for her childhood friend.",
            "sent2": "Their eyes met, and a deep pash blossomed between them.",
            "sent3": "The pash between the two characters was evident to everyone.",
            "sent4": "His pash for adventure led him to explore new places.",
            "sent5": "The artist's work was fueled by a creative pash for colors and shapes."
        },
        {
            "definition": "To have a strong feeling of love or attraction.",
            "pos": "verb",
            "sent1": "He pashed after meeting her for the first time.",
            "sent2": "They pashed for each other more with each passing day.",
            "sent3": "The students pashed for the idea of a long weekend.",
            "sent4": "The singer pashed for the stage, where she felt most alive.",
            "sent5": "The writer pashed for words, always seeking the perfect ones."
        }
    ]
}