{
    "term": "passing",
    "meanings": [
        {
            "definition": "Moving past someone or something",
            "pos": "verb",
            "sent1": "The car was passing the slow truck on the highway.",
            "sent2": "I saw a bird passing by my window this morning.",
            "sent3": "The turtle thought it was passing a race car.",
            "sent4": "Time keeps passing like a river flowing downstream.",
            "sent5": "The runner was passing all the other competitors effortlessly."
        },
        {
            "definition": "Going by or beyond a place",
            "pos": "adverb",
            "sent1": "The train went passing through the tunnel with a loud noise.",
            "sent2": "I walked passing the park on my way to school.",
            "sent3": "The cat went passing the dog, surprising everyone.",
            "sent4": "The days kept going passing quickly, like a blur.",
            "sent5": "The river flowed passing the old mill, carrying memories away."
        },
        {
            "definition": "Happening or taking place",
            "pos": "adjective",
            "sent1": "The passing storm left behind a rainbow in the sky.",
            "sent2": "The passing cars created a lot of noise on the street.",
            "sent3": "The passing moment felt like a dream within a dream.",
            "sent4": "The passing day whispered secrets of the night to come.",
            "sent5": "The passing seasons painted the trees in different colors."
        },
        {
            "definition": "Approaching or nearing something",
            "pos": "adjective",
            "sent1": "The passing train could be heard from a distance.",
            "sent2": "The passing clouds signaled an incoming storm.",
            "sent3": "The passing hourglass reminded her of time slipping away.",
            "sent4": "The passing footsteps grew louder as they neared the door.",
            "sent5": "The passing shadows on the wall indicated the sun was setting."
        },
        {
            "definition": "Succeeding in a test or examination",
            "pos": "adjective",
            "sent1": "After studying hard, she felt confident about passing the exam.",
            "sent2": "He was relieved to hear that he was passing all his classes.",
            "sent3": "The passing grade brought a smile to her face.",
            "sent4": "Passing the test felt like a weight lifted off his shoulders.",
            "sent5": "She celebrated passing the challenging test with her friends."
        }
    ]
}