{
    "term": "pasters",
    "meanings": [
        {
            "definition": "A person or thing that pastes.",
            "pos": "noun",
            "sent1": "The pasters in the art class helped stick the pictures on the board.",
            "sent2": "I need some pasters to help me glue these papers together.",
            "sent3": "The mischievous cat thought it was a good idea to become a paster and stick its toys to the wall.",
            "sent4": "Her words were like pasters, carefully piecing together the broken hearts of her friends.",
            "sent5": "The diligent student was known as the paster of the class, always ready with glue for any project."
        },
        {
            "definition": "A small piece of paper, especially one that has been cut from a larger sheet, that is used to cover a hole or mark a place.",
            "pos": "noun",
            "sent1": "She used pasters to cover up the mistakes in her drawing.",
            "sent2": "The teacher handed out colorful pasters for the students to use in their workbooks.",
            "sent3": "The pasters on the map were like tiny flags marking the places they had visited.",
            "sent4": "His words were like pasters, covering up the truth with pretty lies.",
            "sent5": "The artist carefully selected the perfect paster to highlight the focal point of her masterpiece."
        },
        {
            "definition": "A person who pastes up bills or posters.",
            "pos": "noun",
            "sent1": "The paster was busy putting up advertisements all over the town.",
            "sent2": "We need to hire a new paster for the upcoming event.",
            "sent3": "The paster accidentally glued his own hand to the wall while putting up the poster.",
            "sent4": "She was a paster of dreams, spreading hope with every poster she hung.",
            "sent5": "The diligent paster made sure every corner of the city was covered with announcements."
        }
    ]
}