{
    "term": "pasteurise",
    "meanings": [
        {
            "definition": "Treat (a liquid) with heat to kill or slow the growth of bacteria.",
            "pos": "verb",
            "sent1": "The chef decided to pasteurise the milk before using it in the recipe.",
            "sent2": "It is important to pasteurise milk to make it safe for drinking.",
            "sent3": "The milk was so scared of bacteria that it begged to be pasteurised.",
            "sent4": "The heat from the pasteurisation process was like a shield protecting the milk from harm.",
            "sent5": "The bubbling liquid danced happily as it underwent pasteurisation."
        },
        {
            "definition": "Subject (a liquid) to pasteurization.",
            "pos": "verb",
            "sent1": "The dairy farm decided to pasteurise all their milk for safety reasons.",
            "sent2": "In order to sell their products, the company had to pasteurise the juice first.",
            "sent3": "The milk bottle felt like a superstar as it was chosen to be pasteurised.",
            "sent4": "The pasteurisation process was like a warm hug for the liquid, ensuring its purity.",
            "sent5": "The factory workers carefully monitored the pasteurisation of the liquid to perfection."
        },
        {
            "definition": "To heat (a liquid) to a temperature that kills bacteria.",
            "pos": "verb",
            "sent1": "The health inspector reminded the restaurant to pasteurise the sauce before serving.",
            "sent2": "It is common practice to pasteurise fruit juices to make them safe for consumption.",
            "sent3": "The bacteria in the liquid ran away in fear when they heard it was going to be pasteurised.",
            "sent4": "The intense heat of pasteurisation was like a superhero fighting off the bacteria invaders.",
            "sent5": "The liquid transformed into a warrior, ready to face the heat of pasteurisation."
        }
    ]
}