{
    "term": "patagium",
    "meanings": [
        {
            "definition": "A thin membrane stretching between the limbs of certain animals, such as bats.",
            "pos": "noun",
            "sent1": "The bat's patagium helps it glide through the air effortlessly.",
            "sent2": "The patagium of a flying squirrel allows it to soar from tree to tree.",
            "sent3": "The bat joked that its patagium was like having a built-in parachute.",
            "sent4": "Her dreams took flight on the wings of a patagium, carrying her to new heights.",
            "sent5": "The delicate patagium shimmered in the moonlight, a graceful ribbon in the night sky."
        },
        {
            "definition": "The wing membrane of a bat or gliding mammal.",
            "pos": "noun",
            "sent1": "The bat's patagium fluttered as it swooped down to catch its prey.",
            "sent2": "The patagium of a flying fox is much larger than that of a mouse lemur.",
            "sent3": "The children giggled as they pretended to have patagium wings like bats.",
            "sent4": "Her imagination took flight on the delicate patagium of a bat's wing.",
            "sent5": "The patagium of the bat was a marvel of nature, allowing it to navigate the night sky with ease."
        },
        {
            "definition": "A thin membrane that extends between the body and limbs of certain animals, allowing for gliding or flying.",
            "pos": "noun",
            "sent1": "The sugar glider's patagium is essential for its nocturnal gliding adventures.",
            "sent2": "The patagium of a colugo is a remarkable adaptation for life in the treetops.",
            "sent3": "The clumsy penguin wished it had a patagium to glide gracefully over the ice.",
            "sent4": "Her spirit soared on the wings of a patagium, free from earthly constraints.",
            "sent5": "The patagium of the flying squirrel is a marvel of evolution, allowing it to traverse great distances effortlessly."
        }
    ]
}