{
    "term": "patchoulies",
    "meanings": [
        {
            "definition": "A strong-smelling plant of the mint family, used in perfumery and medicine.",
            "pos": "noun",
            "sent1": "The patchoulies in the garden filled the air with a pleasant scent.",
            "sent2": "She bought a bottle of patchoulies perfume from the store.",
            "sent3": "The mischievous cat rolled around in the patchoulies, leaving a fragrant trail behind.",
            "sent4": "Her laughter was like a cloud of patchoulies, spreading joy wherever it went.",
            "sent5": "The patchoulies plant stood tall, its aroma attracting bees and butterflies."
        },
        {
            "definition": "A perfume made from the oil of the patchouli plant.",
            "pos": "noun",
            "sent1": "The patchoulies she wore was a gift from her grandmother.",
            "sent2": "The patchoulies filled the room with a sweet and earthy fragrance.",
            "sent3": "He joked that the patchoulies perfume was so strong it could wake the neighbors.",
            "sent4": "Her presence was like a cloud of patchoulies, leaving a lingering impression on everyone.",
            "sent5": "The patchoulies perfume transported her back to memories of sunny days in the garden."
        },
        {
            "definition": "A strong-smelling oil obtained from the leaves of the patchouli plant, used in perfumery.",
            "pos": "noun",
            "sent1": "The patchoulies oil was carefully extracted from the leaves for making perfumes.",
            "sent2": "The patchoulies oil added a unique depth to the fragrance.",
            "sent3": "The chef accidentally mistook the patchoulies oil for olive oil in the recipe.",
            "sent4": "The patchoulies oil danced in the air, creating an enchanting atmosphere.",
            "sent5": "The patchoulies oil was a key ingredient in her signature perfume blend."
        }
    ]
}