{
    "term": "patents",
    "meanings": [
        {
            "definition": "A government authority or license conferring a right or title for a set period, especially the sole right to exclude others from making, using, or selling an invention.",
            "pos": "noun",
            "sent1": "The company filed for patents to protect their new invention from being copied.",
            "sent2": "Inventors often apply for patents to safeguard their unique creations.",
            "sent3": "The scientist's cat tried to patent a new way of catching mice, but the mice were not impressed.",
            "sent4": "Her creativity was like a patent, securing her ideas from being stolen by others.",
            "sent5": "The patents acted as a shield, defending the inventor's work from imitation."
        },
        {
            "definition": "A document granting a patent.",
            "pos": "noun",
            "sent1": "The inventor proudly displayed the patents for his groundbreaking invention.",
            "sent2": "The patents were carefully stored in a secure safe to prevent loss or damage.",
            "sent3": "The patents were so beautifully designed that they could easily be mistaken for artwork.",
            "sent4": "The patents were like golden tickets, unlocking opportunities for the inventor.",
            "sent5": "The patents gleamed with official seals, signifying their importance and value."
        },
        {
            "definition": "To obtain a patent for (an invention).",
            "pos": "verb",
            "sent1": "The inventor decided to patent his innovative idea to prevent others from copying it.",
            "sent2": "She planned to patent her unique design to ensure she had exclusive rights to it.",
            "sent3": "The young entrepreneur joked that he would patent a machine to make endless cookies.",
            "sent4": "His determination to patent his creation was as strong as steel.",
            "sent5": "She rushed to patent her invention, fearing someone else might beat her to it."
        }
    ]
}