{
    "term": "pathos",
    "meanings": [
        {
            "definition": "A quality that evokes pity or sadness.",
            "pos": "noun",
            "sent1": "The movie's ending was filled with pathos, making everyone in the theater shed a tear.",
            "sent2": "The novel's tragic plot was full of pathos, leaving readers emotionally moved.",
            "sent3": "The pathos in the sad clown's performance made the audience chuckle through their tears.",
            "sent4": "Her voice carried a deep pathos that resonated with the audience long after the song ended.",
            "sent5": "The abandoned puppy's eyes were full of pathos, tugging at the heartstrings of passersby."
        },
        {
            "definition": "The power of evoking feelings of pity or sadness in others.",
            "pos": "noun",
            "sent1": "The speech was delivered with such pathos that the entire audience was moved to tears.",
            "sent2": "The painting's use of color and light created a sense of pathos that touched viewers deeply.",
            "sent3": "Despite his best efforts, his pathos-filled plea for forgiveness was met with laughter.",
            "sent4": "The old photograph exuded a sense of pathos, capturing a moment of deep sorrow frozen in time.",
            "sent5": "The charity's advertisement was designed to evoke pathos and encourage donations for those in need."
        },
        {
            "definition": "A feeling of sympathy or compassion.",
            "pos": "noun",
            "sent1": "She couldn't help but feel pathos towards the stray kitten shivering in the cold.",
            "sent2": "His words were spoken with genuine pathos, touching the hearts of all who listened.",
            "sent3": "The pathos in her voice as she recounted the story brought tears to everyone's eyes.",
            "sent4": "The sight of the elderly couple holding hands filled him with a deep sense of pathos.",
            "sent5": "The documentary's portrayal of the refugee crisis stirred pathos in viewers, prompting them to take action."
        }
    ]
}