{
    "term": "pathological",
    "meanings": [
        {
            "definition": "Involving, caused by, or of the nature of a physical or mental disease",
            "pos": "adjective",
            "sent1": "Her pathological fear of spiders made it difficult for her to even look at a picture of one.",
            "sent2": "The doctor diagnosed him with a pathological condition that required immediate treatment.",
            "sent3": "His pathological aversion to vegetables led to some creative meal planning.",
            "sent4": "The city's neglect of the park was pathological, resulting in overgrown weeds and broken benches.",
            "sent5": "The pathological growth of the tumor required urgent surgical intervention."
        },
        {
            "definition": "Compulsive or obsessive in nature",
            "pos": "adjective",
            "sent1": "She had a pathological need to check the locks on the doors multiple times before going to bed.",
            "sent2": "His pathological need for order and cleanliness made him a meticulous organizer.",
            "sent3": "His pathological obsession with collecting stamps filled every corner of his house.",
            "sent4": "The company's pathological focus on profit above all else led to unethical practices.",
            "sent5": "Her pathological need for approval drove her to constantly seek validation from others."
        },
        {
            "definition": "Extreme or excessive",
            "pos": "adjective",
            "sent1": "The movie's violence reached a pathological level that left many viewers disturbed.",
            "sent2": "His pathological love for spicy food led him to carry hot sauce everywhere.",
            "sent3": "The team's pathological dedication to winning every game sometimes bordered on obsession.",
            "sent4": "The politician's pathological need for attention overshadowed his actual policies.",
            "sent5": "Her pathological fear of failure drove her to work tirelessly to succeed in every endeavor."
        }
    ]
}