{
    "term": "patiences",
    "meanings": [
        {
            "definition": "The capacity to accept or tolerate delay, trouble, or suffering without getting angry or upset.",
            "pos": "noun",
            "sent1": "Her patiences were tested when the bus was late, but she remained calm.",
            "sent2": "I admire his patiences in dealing with difficult customers at work.",
            "sent3": "His patiences seemed to have taken a vacation when he lost his temper over a small issue.",
            "sent4": "In the face of adversity, her patiences shone like a beacon of strength.",
            "sent5": "The old man's eyes held a deep well of patiences, weathered by years of experience."
        },
        {
            "definition": "The ability to wait, or to continue doing something despite difficulties or delays.",
            "pos": "noun",
            "sent1": "With great patiences, she waited for her turn in line at the store.",
            "sent2": "His patiences paid off when he finally received the job offer after a long wait.",
            "sent3": "The cat's patiences were tested as it waited for the mouse to emerge from its hole.",
            "sent4": "Time and patiences are the keys to mastering any skill.",
            "sent5": "The marathon runner's patiences were rewarded as he crossed the finish line."
        },
        {
            "definition": "A card game for one player, played with two decks of cards.",
            "pos": "noun",
            "sent1": "She enjoyed playing patiences in the evenings to relax after a long day.",
            "sent2": "During the flight, he passed the time by playing patiences on his tablet.",
            "sent3": "The family gathered around the table to play patiences together on a rainy day.",
            "sent4": "His favorite way to unwind was to sip tea and play patiences by the fireplace.",
            "sent5": "The sound of cards shuffling filled the room as they prepared to play patiences."
        }
    ]
}