{
    "term": "patronage",
    "meanings": [
        {
            "definition": "The support, encouragement, privilege, or financial aid that an organization or individual bestows to another.",
            "pos": "noun",
            "sent1": "The local art gallery relies on the patronage of generous donors to fund its exhibitions.",
            "sent2": "The artist's success was due to the patronage of a wealthy benefactor who believed in their talent.",
            "sent3": "The museum director joked that without patronage, the Mona Lisa might have been replaced with stick figure drawings.",
            "sent4": "In the world of art, patronage is like a nurturing garden where creativity blooms.",
            "sent5": "The patronage of the community kept the struggling theater alive during tough times."
        },
        {
            "definition": "The power to appoint or grant positions or benefits.",
            "pos": "noun",
            "sent1": "The king's patronage allowed him to fill important government roles with loyal supporters.",
            "sent2": "Political leaders often use patronage to reward their allies with prestigious titles.",
            "sent3": "The mayor's cat seemed to have a knack for patronage, always choosing who got the comfiest spot on the couch.",
            "sent4": "In the corporate world, patronage can be a double-edged sword, leading to accusations of favoritism.",
            "sent5": "The patronage of the CEO was a powerful tool in shaping the company's direction and culture."
        },
        {
            "definition": "The act of being a customer or client of a business or service.",
            "pos": "noun",
            "sent1": "The local bakery thrived thanks to the patronage of loyal customers who loved their pastries.",
            "sent2": "As a sign of patronage, the regulars at the diner had their favorite booth reserved for them every weekend.",
            "sent3": "The cat's patronage of the pet store was evident by the number of toys it had accumulated over the years.",
            "sent4": "In a small town, patronage at the family-owned store was not just a transaction but a bond between neighbors.",
            "sent5": "The online bookstore appreciated the patronage of book lovers who kept coming back for new releases."
        }
    ]
}