{
    "term": "patronized",
    "meanings": [
        {
            "definition": "Treat with an apparent kindness that betrays a feeling of superiority.",
            "pos": "verb",
            "sent1": "She patronized her younger sister by offering to help with her homework, but she really just wanted to show off.",
            "sent2": "The wealthy woman patronized the boutique, looking down on the salespeople as she made her purchases.",
            "sent3": "The cat patronized the dog by pretending to be interested in its bone, only to snatch it away playfully.",
            "sent4": "His smile patronized her like a crown, masking his true intentions with false sweetness.",
            "sent5": "The teacher's tone patronized the students, making them feel small and insignificant."
        },
        {
            "definition": "Frequent or support as a customer.",
            "pos": "verb",
            "sent1": "They patronized the local bakery every Saturday, enjoying the freshly baked bread and pastries.",
            "sent2": "As a loyal customer, she patronized the small bookstore, always eager to discover new reads.",
            "sent3": "The robot patronized the repair shop regularly, getting its circuits checked for any glitches.",
            "sent4": "The garden patronized the bees, providing them with nectar and pollen for their hard work.",
            "sent5": "The family patronized the farmer's market, buying fresh produce directly from the growers."
        },
        {
            "definition": "Condescend to give one's custom to.",
            "pos": "verb",
            "sent1": "He would patronize the local diner only when he couldn't find a fancier restaurant to dine in.",
            "sent2": "Despite his wealth, he would patronize the street vendors, appreciating their humble offerings.",
            "sent3": "The queen decided to patronize the village fair, gracing the event with her presence.",
            "sent4": "The celebrity chose to patronize the small charity event, bringing attention and support to the cause.",
            "sent5": "The mayor would patronize the community center, showing his solidarity with the local residents."
        }
    ]
}