{
    "term": "patronised",
    "meanings": [
        {
            "definition": "Treat with an apparent kindness that betrays a feeling of superiority.",
            "pos": "verb",
            "sent1": "She patronised her younger sister by offering to help with her homework but correcting every mistake.",
            "sent2": "The wealthy woman patronised the local charity event, looking down on the other attendees.",
            "sent3": "The cat patronised the dog by allowing it to play with its favorite toy, but always snatching it away at the last moment.",
            "sent4": "His smile patronised her, as if he thought she couldn't understand the complex topic.",
            "sent5": "The teacher patronised the student, speaking slowly and using simple words as if the student were a child."
        },
        {
            "definition": "Frequent (a store, theater, restaurant, etc.) as a customer.",
            "pos": "verb",
            "sent1": "He patronised the local bakery every morning for his favorite pastries.",
            "sent2": "The couple patronised the new restaurant in town, enjoying the delicious food and friendly service.",
            "sent3": "She patronised the bookstore so often that the owner knew her by name and recommended new releases.",
            "sent4": "The old man patronised the same barber shop for decades, loyal to the skilled barber.",
            "sent5": "The family patronised the small theater in their neighborhood, attending every play and supporting local talent."
        },
        {
            "definition": "Act as a patron and support financially.",
            "pos": "verb",
            "sent1": "The wealthy businessman patronised the arts by funding scholarships for young artists.",
            "sent2": "She patronised the local animal shelter, donating food and supplies regularly.",
            "sent3": "The company patronised the community center, sponsoring events and programs for the residents.",
            "sent4": "He patronised the museum, contributing to the preservation of historical artifacts.",
            "sent5": "The organization patronised the school, providing resources for educational programs and extracurricular activities."
        }
    ]
}