{
    "term": "patriarchies",
    "meanings": [
        {
            "definition": "A system of society or government in which men hold the power and women are largely excluded.",
            "pos": "noun",
            "sent1": "In some patriarchies, only men are allowed to make important decisions.",
            "sent2": "Historically, many ancient civilizations were patriarchies where men had more authority.",
            "sent3": "The patriarchies in fairy tales often depict kings ruling over their kingdoms.",
            "sent4": "The patriarchies of old cast a long shadow over the roles of men and women.",
            "sent5": "The concept of patriarchies can be seen in various historical texts and documents."
        },
        {
            "definition": "Societies in which power is held by men, particularly by fathers or elder males.",
            "pos": "noun",
            "sent1": "Some patriarchies follow a tradition where leadership is passed down from father to son.",
            "sent2": "In certain patriarchies, the eldest male member of the family makes all major decisions.",
            "sent3": "The patriarchies in rural areas often revolve around the authority of the oldest male relative.",
            "sent4": "The patriarchies of olden times were deeply rooted in familial hierarchies.",
            "sent5": "The concept of patriarchies shapes the dynamics within many communities."
        },
        {
            "definition": "The dominance of men in social or cultural systems.",
            "pos": "noun",
            "sent1": "Gender roles in patriarchies often limit the opportunities available to women.",
            "sent2": "Patriarchies tend to prioritize the voices and perspectives of men over women.",
            "sent3": "The patriarchies in literature sometimes exaggerate the power dynamics between genders.",
            "sent4": "The patriarchies of society can influence how individuals perceive gender norms.",
            "sent5": "The impact of patriarchies on cultural norms is a topic of ongoing discussion."
        }
    ]
}