{
    "term": "patroon",
    "meanings": [
        {
            "definition": "A person who is the owner or manager of a large estate or land grant",
            "pos": "noun",
            "sent1": "The wealthy patroon lived in a grand mansion on his vast estate.",
            "sent2": "The patroon oversaw the workers on the large land grant.",
            "sent3": "The patroon's dog, named Rover, thought he was the real owner of the estate!",
            "sent4": "She ruled over the estate like a queen, a true patroon of the land.",
            "sent5": "The patroon's presence on the estate was as imposing as the mountains surrounding it."
        },
        {
            "definition": "To act as a patroon by overseeing the operations of a large estate",
            "pos": "verb",
            "sent1": "He would patroon the estate by making sure everything ran smoothly.",
            "sent2": "She patroons the land grant with a firm but fair hand.",
            "sent3": "The workers joked that he liked to patroon around all day instead of working!",
            "sent4": "She patroons the estate like a skilled conductor leading an orchestra.",
            "sent5": "His dedication to patrooning the estate was unmatched, like a captain steering a ship through rough waters."
        },
        {
            "definition": "The system of land grants and estates established in colonial America",
            "pos": "noun",
            "sent1": "The patroon system in colonial America was a way to manage large estates.",
            "sent2": "Colonial America relied on the patroon system for organizing land grants.",
            "sent3": "The patroon system was like a puzzle, fitting together different pieces of land.",
            "sent4": "The patroon system shaped the landscape of colonial America like a sculptor molds clay.",
            "sent5": "The patroon system was the backbone of colonial America, holding the land together like glue."
        }
    ]
}