{
    "term": "patter",
    "meanings": [
        {
            "definition": "Rapid, continuous talk or chatter",
            "pos": "noun",
            "sent1": "The children's patter filled the room with excitement.",
            "sent2": "I could hear the patter of rain on the roof.",
            "sent3": "The patter of the squirrel's tiny feet on the roof made me smile.",
            "sent4": "The patter of footsteps in the hallway signaled the start of the party.",
            "sent5": "Her cheerful patter always brightened my day."
        },
        {
            "definition": "A repeated light tapping sound",
            "pos": "noun",
            "sent1": "The patter of footsteps echoed in the empty hallway.",
            "sent2": "I love the gentle patter of rain on the window.",
            "sent3": "The patter of the woodpecker's beak on the tree was rhythmic.",
            "sent4": "The patter of hail on the roof sounded like tiny drums.",
            "sent5": "The patter of the cat's paws on the floor was soothing."
        },
        {
            "definition": "To speak rapidly and continuously, often in a glib or insincere manner",
            "pos": "verb",
            "sent1": "She would patter on about her day without pausing for breath.",
            "sent2": "The salesman tried to patter his way into making a sale.",
            "sent3": "His constant patter about the weather became tiresome.",
            "sent4": "She could patter away for hours without saying anything meaningful.",
            "sent5": "The politician's patter failed to convince the audience."
        },
        {
            "definition": "To make a rapid, light tapping sound",
            "pos": "verb",
            "sent1": "The rain continued to patter on the window throughout the night.",
            "sent2": "I could hear the leaves patter as they fell to the ground.",
            "sent3": "The horse's hooves began to patter on the pavement.",
            "sent4": "The acorns would patter on the roof during windy days.",
            "sent5": "The gentle patter of the river against the rocks was calming."
        }
    ]
}