{
    "term": "patu",
    "meanings": [
        {
            "definition": "A Maori war club",
            "pos": "noun",
            "sent1": "The warrior held his patu tightly before battle.",
            "sent2": "The patu was beautifully carved and decorated.",
            "sent3": "During the ceremony, the chief accidentally dropped the patu, causing a moment of laughter.",
            "sent4": "His words were like a patu, striking fear into the hearts of his enemies.",
            "sent5": "The patu's design was so intricate, it seemed to tell a story of its own."
        },
        {
            "definition": "To strike with a patu",
            "pos": "verb",
            "sent1": "He decided to patu the tree to knock down some coconuts.",
            "sent2": "The warrior swiftly patu'd his opponent in the battle.",
            "sent3": "The chef patu'd the dough to flatten it for the pie crust.",
            "sent4": "Her words patu'd through the silence, making everyone pay attention.",
            "sent5": "The hammer patu'd the nail into the wood with a loud thud."
        },
        {
            "definition": "A type of traditional Maori weapon",
            "pos": "noun",
            "sent1": "The museum displayed an ancient patu used by Maori warriors.",
            "sent2": "The patu was passed down through generations as a symbol of strength.",
            "sent3": "The patu was so old that it seemed to have its own stories to tell.",
            "sent4": "His determination was his patu, always ready to defend his beliefs.",
            "sent5": "The patu's craftsmanship was unmatched, a true work of art."
        },
        {
            "definition": "To hit or strike with a weapon",
            "pos": "verb",
            "sent1": "The knight patu'd his sword against the shield of his opponent.",
            "sent2": "She patu'd the ball with all her might, sending it flying across the field.",
            "sent3": "The chef accidentally patu'd the pot, causing soup to splash everywhere.",
            "sent4": "His words patu'd through the noise, silencing the room instantly.",
            "sent5": "The storm patu'd the coast, leaving destruction in its wake."
        }
    ]
}