{
    "term": "paughty",
    "meanings": [
        {
            "definition": "Showing an excessively high opinion of oneself; arrogant.",
            "pos": "adjective",
            "sent1": "She always acts so paughty, thinking she's better than everyone else.",
            "sent2": "The paughty cat strutted around the house as if it owned the place.",
            "sent3": "Even the mirror couldn't handle her paughty attitude, cracking under the pressure.",
            "sent4": "Her paughty demeanor was like a crown made of glass, fragile and transparent.",
            "sent5": "The sun shone on her paughty face, making her seem even more full of herself."
        },
        {
            "definition": "Behaving in a proud and disdainful manner.",
            "pos": "adjective",
            "sent1": "He gave her a paughty look, making her feel small and insignificant.",
            "sent2": "The paughty student refused to work with others, believing he was above them.",
            "sent3": "His paughty behavior at the party made everyone uncomfortable, like a dark cloud looming over.",
            "sent4": "The wind whispered through the trees, carrying the echoes of his paughty laughter.",
            "sent5": "Her paughty tone cut through the room, leaving a trail of hurt feelings in its wake."
        },
        {
            "definition": "Having an attitude of superiority or haughtiness.",
            "pos": "adjective",
            "sent1": "The paughty professor looked down on his students, never acknowledging their efforts.",
            "sent2": "She wore her paughty expression like a mask, hiding any vulnerability.",
            "sent3": "The cat's paughty gaze seemed to say, 'I am the ruler of this household.'",
            "sent4": "His paughty stance was like a fortress, impenetrable to any criticism.",
            "sent5": "The mountain stood tall and paughty, overlooking the valley below with a sense of grandeur."
        }
    ]
}