{
    "term": "payolas",
    "meanings": [
        {
            "definition": "Payolas: bribes or kickbacks",
            "pos": "noun",
            "sent1": "The corrupt official demanded payolas in exchange for granting the construction contract.",
            "sent2": "The company was involved in a scandal for offering payolas to secure government contracts.",
            "sent3": "The detective uncovered a scheme where payolas were disguised as gifts to avoid suspicion.",
            "sent4": "The payolas exchanged hands like a dark dance of deceit in the shadows of the city.",
            "sent5": "The concept of payolas tainted the reputation of the once-respected businessman."
        },
        {
            "definition": "Payolas: illegal payments made to someone in a position of trust",
            "pos": "noun",
            "sent1": "The embezzler was caught red-handed receiving payolas from unsuspecting clients.",
            "sent2": "The politician was arrested for accepting payolas from lobbyists in exchange for favors.",
            "sent3": "The comedy movie portrayed a comical character who hilariously tried to hide his payolas.",
            "sent4": "The web of payolas woven by the corrupt official eventually led to his downfall.",
            "sent5": "The allure of easy money through payolas blinded the once-honest employee."
        },
        {
            "definition": "Payolas: money paid for a service or product",
            "pos": "noun",
            "sent1": "The customer handed over the payolas at the counter in exchange for the new gadget.",
            "sent2": "The online store accepted various forms of payolas, including credit cards and digital wallets.",
            "sent3": "The children saved up their allowance to pool their payolas for a special gift for their parents.",
            "sent4": "The payolas flowed freely at the charity auction, raising funds for a good cause.",
            "sent5": "The shiny coins and crumpled bills represented the hard-earned payolas of the workers."
        }
    ]
}