{
    "term": "pe",
    "meanings": [
        {
            "definition": "A unit of weight equal to 16 avoirdupois ounces.",
            "pos": "noun",
            "sent1": "I bought a bag of flour that weighed one pe.",
            "sent2": "The recipe called for two pes of sugar.",
            "sent3": "The baker mistakenly added a pe of salt instead of sugar.",
            "sent4": "Her love for baking weighed more than a thousand pes.",
            "sent5": "The pe of gold felt heavy in his hand."
        },
        {
            "definition": "To pay.",
            "pos": "verb",
            "sent1": "I need to pe for my groceries at the store.",
            "sent2": "He will pe the bill at the restaurant.",
            "sent3": "She forgot to pe for her coffee and ran back to the counter.",
            "sent4": "The debt was finally peed off after years of hard work.",
            "sent5": "The customer decided to pe with a credit card instead of cash."
        },
        {
            "definition": "A river in central Europe, flowing from the Carpathian Mountains in Romania into the Danube in Serbia.",
            "pos": "noun",
            "sent1": "The beautiful pe flows through multiple countries.",
            "sent2": "Many tourists enjoy boat rides on the pe.",
            "sent3": "The fish in the pe were known for their unique colors.",
            "sent4": "The pe carried stories of ancient civilizations along its banks.",
            "sent5": "The pe's water was crystal clear, reflecting the surrounding nature."
        },
        {
            "definition": "A Hebrew letter.",
            "pos": "noun",
            "sent1": "The word started with the letter pe.",
            "sent2": "In Hebrew class, we learned about the pronunciation of pe.",
            "sent3": "The pe looked similar to the English letter 'P'.",
            "sent4": "The calligraphy artist beautifully wrote the pe on the parchment.",
            "sent5": "The pe symbolized a sound in the Hebrew language."
        }
    ]
}