{
    "term": "pearled",
    "meanings": [
        {
            "definition": "Covered or adorned with pearls.",
            "pos": "adjective",
            "sent1": "She wore a beautiful pearled necklace to the party.",
            "sent2": "The dress had a pearled finish that shimmered in the light.",
            "sent3": "The cake was so fancy, it looked like a pearled masterpiece.",
            "sent4": "The sky at sunset was a pearled canvas painted by nature.",
            "sent5": "The queen's crown sparkled with pearled elegance."
        },
        {
            "definition": "Having a lustrous appearance resembling pearls.",
            "pos": "adjective",
            "sent1": "The dew on the leaves gave them a pearled look in the morning.",
            "sent2": "Her eyes had a pearled shine that captivated everyone.",
            "sent3": "The car's new paint job made it look pearled and polished.",
            "sent4": "The moon cast a pearled glow over the quiet lake.",
            "sent5": "The seashell had a pearled sheen that caught the sunlight."
        },
        {
            "definition": "To form into the shape of a pearl.",
            "pos": "verb",
            "sent1": "She carefully pearled the clay into a round shape for the pendant.",
            "sent2": "The chef pearled the dough into small balls for the pastry.",
            "sent3": "The artist pearled the paint on the canvas to create a unique texture.",
            "sent4": "The rain pearled on the window, forming small droplets.",
            "sent5": "The sculptor pearled the marble into a perfect sphere."
        },
        {
            "definition": "To decorate or embellish with pearls.",
            "pos": "verb",
            "sent1": "She pearled her hair with delicate white beads for the wedding.",
            "sent2": "The designer pearled the gown with intricate patterns along the hem.",
            "sent3": "The baker pearled the cake with edible sugar pearls for a special touch.",
            "sent4": "The dancer's costume was pearled with shimmering sequins for the performance.",
            "sent5": "The tailor pearled the dress with tiny beads to add a touch of elegance."
        }
    ]
}