{
    "term": "pechan",
    "meanings": [
        {
            "definition": "A small, round, smooth-skinned fruit with a single pit.",
            "pos": "noun",
            "sent1": "I picked a ripe pechan from the tree.",
            "sent2": "The pechan was juicy and sweet.",
            "sent3": "The pechan rolled off the table and surprised me.",
            "sent4": "Her laughter was like the taste of a fresh pechan.",
            "sent5": "The pechan's vibrant color stood out among the leaves."
        },
        {
            "definition": "A tree that bears pechans.",
            "pos": "noun",
            "sent1": "The pechan tree provided shade in the garden.",
            "sent2": "Many birds gathered on the branches of the pechan tree.",
            "sent3": "The squirrels raced up the pechan tree, looking for nuts.",
            "sent4": "The pechan tree's branches reached towards the sky like outstretched arms.",
            "sent5": "The pechan tree's leaves rustled in the gentle breeze."
        },
        {
            "definition": "To gather or harvest pechans.",
            "pos": "verb",
            "sent1": "We will pechan the fruits in the morning.",
            "sent2": "She enjoys pechanning with her family every summer.",
            "sent3": "The children laughed as they tried to pechan the ripe fruits.",
            "sent4": "He carefully pechanned the pechans, ensuring none were squished.",
            "sent5": "The farmers worked hard to pechan the bountiful harvest."
        },
        {
            "definition": "Having the flavor or scent of pechans.",
            "pos": "adjective",
            "sent1": "The pie had a delightful pechan taste.",
            "sent2": "The air was filled with the sweet pechan scent.",
            "sent3": "She wore a perfume with a hint of pechan fragrance.",
            "sent4": "The room was decorated with pechan-colored curtains.",
            "sent5": "The cake had a rich and tangy pechan flavor."
        }
    ]
}