{
    "term": "pecker",
    "meanings": [
        {
            "definition": "A bird's beak",
            "pos": "noun",
            "sent1": "The little bird used its pecker to pick up seeds.",
            "sent2": "The colorful parrot's pecker was sharp and strong.",
            "sent3": "The hungry bird's pecker was perfect for eating its favorite fruits.",
            "sent4": "The robin's pecker darted in and out as it searched for worms.",
            "sent5": "The eagle's pecker was a powerful tool for catching fish."
        },
        {
            "definition": "A slang term for a penis",
            "pos": "noun",
            "sent1": "The doctor asked the patient if he had injured his pecker.",
            "sent2": "The comedian made a joke about a man getting his pecker stuck in a zipper.",
            "sent3": "The embarrassed boy blushed when his friends teased him about his pecker.",
            "sent4": "The toddler proudly showed off his pecker to anyone who would look.",
            "sent5": "The old man chuckled at the memory of his younger days when his pecker was more active."
        },
        {
            "definition": "A slang term for a woodpecker",
            "pos": "noun",
            "sent1": "The children watched in awe as the pecker hammered on the tree.",
            "sent2": "The noisy pecker woke up the entire neighborhood with its drumming.",
            "sent3": "The mischievous squirrel tried to mimic the pecker's tapping but failed miserably.",
            "sent4": "The pecker's red head stood out against the green leaves of the forest.",
            "sent5": "The pecker's rhythmic pecking echoed through the woods."
        },
        {
            "definition": "To strike or pierce with a pointed object",
            "pos": "verb",
            "sent1": "He used the hammer to pecker the nail into the wall.",
            "sent2": "The tailor carefully peckered the fabric with his needle and thread.",
            "sent3": "The chef had to pecker the tough meat to make it tender for the stew.",
            "sent4": "The woodpecker peckered the tree trunk looking for insects.",
            "sent5": "The boxer aimed to pecker his opponent with a swift jab to the ribs."
        }
    ]
}