{
    "term": "peckiest",
    "meanings": [
        {
            "definition": "Showing a tendency to peck or pick at something.",
            "pos": "adjective",
            "sent1": "The peckiest chicken in the coop always tries to find the tastiest seeds.",
            "sent2": "The woodpecker is known for its peckiest behavior when searching for insects.",
            "sent3": "The peckiest squirrel in the park never misses a chance to gather nuts for winter.",
            "sent4": "Her peckiest attitude towards her work earned her the reputation of being meticulous.",
            "sent5": "The peckiest toddler in the daycare center always wants to explore new toys."
        },
        {
            "definition": "Superlative form of pecky, meaning marked by small, shallow holes or indentations.",
            "pos": "adjective",
            "sent1": "The peckiest piece of wood had tiny holes all over its surface.",
            "sent2": "The peckiest apple in the basket had small indentations from insect bites.",
            "sent3": "The peckiest cookie on the plate looked like it had been nibbled by a mouse.",
            "sent4": "The peckiest pillow in the store had a texture reminiscent of bird pecks.",
            "sent5": "The peckiest wall in the house showed signs of wear with its small holes."
        },
        {
            "definition": "Having the most pecking behavior among a group of animals.",
            "pos": "adjective",
            "sent1": "The peckiest bird in the flock always leads the others in searching for food.",
            "sent2": "The peckiest penguin in the group was the first to dive into the water for fish.",
            "sent3": "The peckiest duck in the pond was like a drill sergeant during feeding time.",
            "sent4": "The peckiest robin in the garden seemed to organize the other birds during meals.",
            "sent5": "The peckiest crow in the murder had a commanding presence during scavenging."
        }
    ]
}