{
    "term": "pedagogue",
    "meanings": [
        {
            "definition": "A teacher, especially a strict or pedantic one.",
            "pos": "noun",
            "sent1": "The pedagogue in our school always assigns a lot of homework.",
            "sent2": "The new pedagogue at the music academy is very knowledgeable.",
            "sent3": "The pedagogue tried to teach math using only rhymes, which made the students laugh.",
            "sent4": "Her father was a pedagogue of the old school, instilling discipline with a firm hand.",
            "sent5": "The pedagogue's classroom was like a treasure trove of knowledge waiting to be explored."
        },
        {
            "definition": "To act as a teacher or pedagogue.",
            "pos": "verb",
            "sent1": "She decided to pedagogue the young students in art history.",
            "sent2": "The experienced professor knows how to pedagogue complex concepts effectively.",
            "sent3": "He tried to pedagogue his friends on the best way to play video games, but they just rolled their eyes.",
            "sent4": "The coach pedagogued the team on the importance of teamwork, using real-life examples.",
            "sent5": "As a parent, it's important to pedagogue your children on good manners and respect."
        },
        {
            "definition": "A person who is pedantic or dogmatic in teaching.",
            "pos": "noun",
            "sent1": "The history professor was known as a pedagogue for his strict adherence to the textbook.",
            "sent2": "She was labeled a pedagogue by her colleagues due to her rigid teaching style.",
            "sent3": "The pedagogue insisted on using only one specific method to solve math problems, much to the students' amusement.",
            "sent4": "In the debate club, he was seen as a pedagogue, always sticking to his arguments no matter what.",
            "sent5": "The pedagogue's lectures were like a never-ending stream of rules and regulations, drowning the students in information."
        }
    ]
}