{
    "term": "pedals",
    "meanings": [
        {
            "definition": "A foot-operated lever used for powering a bicycle or other vehicle.",
            "pos": "noun",
            "sent1": "She pushed the pedals to make the bicycle move.",
            "sent2": "The piano player's feet danced on the pedals as she played a beautiful melody.",
            "sent3": "The little girl pretended the pedals were magic buttons that made her bike fly.",
            "sent4": "His love for cycling was so strong that he saw the pedals as wings propelling him forward.",
            "sent5": "The sound of the pedals clicking against the ground echoed through the park."
        },
        {
            "definition": "A lever operated by the foot to control various mechanisms, such as those in a piano.",
            "pos": "noun",
            "sent1": "The pianist's skilled foot controlled the pedals to create different sounds.",
            "sent2": "He adjusted the volume of the piano by pressing the pedals with his foot.",
            "sent3": "The mischievous cat thought the piano pedals were toys to play with.",
            "sent4": "Her emotions flowed through her fingers and into the piano pedals.",
            "sent5": "The pedals of the piano added a deep resonance to the music."
        },
        {
            "definition": "To operate a bicycle or other vehicle by using pedals.",
            "pos": "verb",
            "sent1": "He pedals his bike to school every day.",
            "sent2": "She enjoys pedaling through the park on sunny afternoons.",
            "sent3": "The squirrel tried to pedal a tiny toy car with its tiny paws.",
            "sent4": "Pedaling up the hill felt like conquering a mountain.",
            "sent5": "The children laughed as they pedaled their tricycles around the yard."
        },
        {
            "definition": "To move by operating pedals, as in a bicycle.",
            "pos": "verb",
            "sent1": "The bike pedals spun quickly as he raced down the street.",
            "sent2": "She pedaled hard to keep up with her friends on the cycling trip.",
            "sent3": "The robot learned to pedal the bike with precision and balance.",
            "sent4": "Pedaling through the forest, she felt a sense of freedom and joy.",
            "sent5": "The old car slowly pedaled its way up the steep hill."
        }
    ]
}