{
    "term": "pedantic",
    "meanings": [
        {
            "definition": "Excessively concerned with minor details or rules.",
            "pos": "adjective",
            "sent1": "She is so pedantic about grammar that she corrects everyone's speech.",
            "sent2": "The pedantic teacher always insists on following the strict classroom rules.",
            "sent3": "The pedantic librarian organized the books by color instead of genre, just to be different.",
            "sent4": "His pedantic focus on punctuation turned his writing into a masterpiece of precision.",
            "sent5": "The pedantic chef measured each ingredient with meticulous care to ensure a perfect dish."
        },
        {
            "definition": "Ostentatious in one's learning.",
            "pos": "adjective",
            "sent1": "The pedantic professor loved to show off his extensive vocabulary in class.",
            "sent2": "Her pedantic behavior at the lecture made it clear she wanted everyone to know how smart she was.",
            "sent3": "The pedantic student wore glasses with fake lenses to appear more intellectual.",
            "sent4": "His pedantic display of knowledge intimidated his classmates.",
            "sent5": "The pedantic scientist always used complex jargon to impress his peers."
        },
        {
            "definition": "Characterized by a narrow, often ostentatious concern for book learning and formal rules.",
            "pos": "adjective",
            "sent1": "The pedantic scholar only cared about academic achievements and citations.",
            "sent2": "Her pedantic attitude towards literature made her seem unapproachable.",
            "sent3": "The pedantic book club member insisted on discussing the symbolism of every paragraph.",
            "sent4": "His pedantic approach to history made him an expert in ancient civilizations.",
            "sent5": "The pedantic lawyer always quoted legal precedents to support his arguments."
        }
    ]
}