{
    "term": "pedlary",
    "meanings": [
        {
            "definition": "The act of selling goods or services door-to-door.",
            "pos": "noun",
            "sent1": "She engaged in pedlary by going from house to house selling her handmade crafts.",
            "sent2": "Pedlary was a common way for people to earn money before the rise of big retail stores.",
            "sent3": "The pedlary business was booming, with each knock on the door bringing a potential sale.",
            "sent4": "Her pedlary skills were so sharp that she could convince anyone to buy something they didn't even know they needed.",
            "sent5": "The image of the pedlar with a basket of goods on his arm epitomized the essence of pedlary."
        },
        {
            "definition": "The occupation or business of a peddler.",
            "pos": "noun",
            "sent1": "His family had been in pedlary for generations, traveling far and wide to sell their goods.",
            "sent2": "Pedlary required a lot of stamina and people skills to be successful.",
            "sent3": "The peddler's pedlary took him to many interesting places, meeting all kinds of customers.",
            "sent4": "In the world of business, pedlary was seen as a humble yet essential profession.",
            "sent5": "The peddler's cart was a symbol of his dedication to the art of pedlary."
        },
        {
            "definition": "The goods or wares sold by a peddler.",
            "pos": "noun",
            "sent1": "The peddler displayed his pedlary on a small wooden table by the roadside.",
            "sent2": "Customers were always curious to see the variety of pedlary the peddler carried in his pack.",
            "sent3": "The peddler's pedlary included everything from trinkets to household essentials.",
            "sent4": "The peddler's pedlary shone brightly under the midday sun, attracting passersby.",
            "sent5": "Each piece of pedlary had a story behind it, making them more than just items for sale."
        }
    ]
}