{
    "term": "pedophilia",
    "meanings": [
        {
            "definition": "The condition of being sexually attracted to children.",
            "pos": "noun",
            "sent1": "Pedophilia is a serious issue that requires immediate attention.",
            "sent2": "It is important to protect children from individuals with pedophilia.",
            "sent3": "The comedian joked that his friend's obsession with collecting toys was like a harmless form of pedophilia.",
            "sent4": "The company's marketing strategy showed a disturbing level of pedophilia towards young consumers.",
            "sent5": "The documentary shed light on the devastating effects of pedophilia on victims and their families."
        },
        {
            "definition": "The act of engaging in sexual activity with a child.",
            "pos": "noun",
            "sent1": "Pedophilia is a criminal offense that must be punished severely.",
            "sent2": "The news reported a case of pedophilia in a local school.",
            "sent3": "The movie plot revolved around a detective solving a case of pedophilia in a small town.",
            "sent4": "The court sentenced the man to prison for his heinous act of pedophilia.",
            "sent5": "The community came together to raise awareness and prevent cases of pedophilia in their neighborhood."
        },
        {
            "definition": "A person who is sexually attracted to children.",
            "pos": "noun",
            "sent1": "Pedophilia is a psychological disorder that requires treatment.",
            "sent2": "The police arrested a suspected pedophilia in the park.",
            "sent3": "The novel's antagonist was portrayed as a cunning pedophilia preying on innocent children.",
            "sent4": "The therapist worked with individuals struggling with pedophilia to help them overcome their urges.",
            "sent5": "The documentary interviewed a reformed pedophilia who shared his journey towards rehabilitation."
        }
    ]
}