{
    "term": "pedophilias",
    "meanings": [
        {
            "definition": "The psychiatric disorder of being sexually attracted to children.",
            "pos": "noun",
            "sent1": "Pedophilias can have serious consequences for both the individual and the child.",
            "sent2": "It is important to address pedophilias through therapy and intervention.",
            "sent3": "The concept of pedophilias is disturbing but must be understood to prevent harm.",
            "sent4": "In society, pedophilias are seen as a grave violation of innocence.",
            "sent5": "The presence of pedophilias in someone should never be ignored or dismissed."
        },
        {
            "definition": "The act of engaging in sexual activity with a child.",
            "pos": "noun",
            "sent1": "Pedophilias is a criminal offense that can lead to severe legal consequences.",
            "sent2": "Perpetrators of pedophilias must be held accountable for their actions.",
            "sent3": "The news reported a case of pedophilias, shocking the community.",
            "sent4": "The impact of pedophilias on a child's life can be devastating and long-lasting.",
            "sent5": "Educating children about the dangers of pedophilias is crucial for their safety."
        },
        {
            "definition": "A person who is sexually attracted to children.",
            "pos": "noun",
            "sent1": "Pedophilias often struggle with their inappropriate desires and impulses.",
            "sent2": "It is essential to keep pedophilias away from situations where they can harm children.",
            "sent3": "The movie portrayed a character who was revealed to be a pedophilias, adding a twist to the plot.",
            "sent4": "Society must work together to identify and prevent pedophilias from causing harm.",
            "sent5": "The presence of a pedophilias in a community can create fear and concern among parents."
        }
    ]
}