{
    "term": "peenge",
    "meanings": [
        {
            "definition": "To whine or complain persistently.",
            "pos": "verb",
            "sent1": "She would peenge about having to do her chores every day.",
            "sent2": "The child would peenge whenever he didn't get his favorite toy.",
            "sent3": "Instead of enjoying the game, he would just peenge about the rules.",
            "sent4": "Her constant peenging was like a broken record that never stopped.",
            "sent5": "The sound of her peenging echoed through the house, irritating everyone.",
            "sent6": "He would peenge to his friends about the long lines at the store.",
            "sent7": "The cat would peenge for attention when its owner was busy.",
            "sent8": "Even the sunny weather couldn't stop her from peenging about the heat.",
            "sent9": "His peenging was so loud that it drowned out all other sounds in the room.",
            "sent10": "The peenging of the old car engine signaled trouble ahead."
        },
        {
            "definition": "A whining or complaining tone.",
            "pos": "noun",
            "sent1": "Her voice had a constant peenge whenever things didn't go her way.",
            "sent2": "The meeting was filled with the peenge of dissatisfied employees.",
            "sent3": "The peenge in her voice made it hard to take her seriously.",
            "sent4": "The peenge of the wind outside matched her mood perfectly.",
            "sent5": "The constant peenge in the room made it hard to focus on work.",
            "sent6": "The peenge of the old door hinges filled the room with a eerie sound.",
            "sent7": "The peenge of the violin added a melancholic touch to the music.",
            "sent8": "His constant peenge about the weather annoyed everyone around him.",
            "sent9": "The peenge of the dog next door kept him up all night.",
            "sent10": "The peenge of the broken fan was a constant reminder of the summer heat."
        },
        {
            "definition": "A small amount of money.",
            "pos": "noun",
            "sent1": "He only had a peenge left in his pocket after buying lunch.",
            "sent2": "She scrounged up every last peenge to buy a birthday gift.",
            "sent3": "The peenge he found in the couch cushions was enough for a coffee.",
            "sent4": "With just a peenge to spare, he couldn't afford the new video game.",
            "sent5": "Every peenge counted when he was saving up for a trip.",
            "sent6": "She managed to save every peenge to buy a new phone.",
            "sent7": "The peenge he earned from mowing lawns added up over time.",
            "sent8": "He was determined to make every peenge count towards his goal.",
            "sent9": "The peenge he received as a tip brightened his day.",
            "sent10": "Even a small peenge could make a big difference in the right hands."
        }
    ]
}