{
    "term": "peg",
    "meanings": [
        {
            "definition": "A small, cylindrical piece of wood or metal used to fasten or support something.",
            "pos": "noun",
            "sent1": "She hung her coat on the peg by the door.",
            "sent2": "The carpenter used a peg to hold the shelf in place.",
            "sent3": "The mischievous squirrel stole the peg and ran up the tree with it.",
            "sent4": "His determination was the peg that kept the team together during tough times.",
            "sent5": "The peg in the ground marked the spot where the treasure was buried."
        },
        {
            "definition": "A pin or bolt used to hold something in place.",
            "pos": "noun",
            "sent1": "The tent was secured firmly with a peg in each corner.",
            "sent2": "She used a peg to keep the papers from flying away in the wind.",
            "sent3": "The magician pulled a never-ending string of colorful scarves out of his hat, each tied to a peg.",
            "sent4": "His words acted as a peg, anchoring her thoughts in reality.",
            "sent5": "The peg in the lock prevented the door from swinging open."
        },
        {
            "definition": "To fasten or secure with a peg.",
            "pos": "verb",
            "sent1": "He decided to peg the tent down before the storm arrived.",
            "sent2": "She carefully pegged the laundry on the line to dry.",
            "sent3": "The mischievous puppy tried to peg the ball with its paw.",
            "sent4": "The idea of friendship pegged them together in a bond that could not be broken.",
            "sent5": "She pegged her hopes on winning the competition."
        },
        {
            "definition": "A projecting pin or bolt on which something is hung or supported.",
            "pos": "noun",
            "sent1": "The picture frame hung securely on the peg in the wall.",
            "sent2": "The shelf was wobbly until he placed it on the peg.",
            "sent3": "The peg on the wall seemed to wink at her mischievously.",
            "sent4": "His dreams were hanging on a peg, waiting to be realized.",
            "sent5": "The peg on the tree branch held the birdhouse in place."
        }
    ]
}