{
    "term": "pele",
    "meanings": [
        {
            "definition": "A Hawaiian volcano deity",
            "pos": "noun",
            "sent1": "The ancient Hawaiians believed Pele controlled the volcanoes.",
            "sent2": "People in Hawaii honor Pele during volcanic eruptions.",
            "sent3": "Pele must be in a fiery mood today, making the lava flow faster.",
            "sent4": "The power of Pele's wrath can be seen in the fiery eruptions.",
            "sent5": "The legend of Pele's fiery temper is passed down through generations."
        },
        {
            "definition": "A Brazilian soccer legend",
            "pos": "noun",
            "sent1": "Soccer fans around the world admire Pele's skills on the field.",
            "sent2": "Pele scored many goals during his soccer career.",
            "sent3": "Imagine playing soccer with Pele as your teammate!",
            "sent4": "Pele's impact on soccer is as legendary as his goal-scoring abilities.",
            "sent5": "The name Pele is synonymous with excellence in the world of soccer."
        },
        {
            "definition": "A type of volcanic rock",
            "pos": "noun",
            "sent1": "The hikers collected pieces of Pele to study its composition.",
            "sent2": "Pele is often found near active volcanoes.",
            "sent3": "The geologist found a rare specimen of Pele during the expedition.",
            "sent4": "The beauty of Pele lies in its unique texture and color.",
            "sent5": "The formation of Pele is a fascinating process of nature."
        },
        {
            "definition": "A Hawaiian term for lava",
            "pos": "noun",
            "sent1": "The lava flow from Kilauea is known as Pele in Hawaiian culture.",
            "sent2": "Pele can create new land with its fiery lava.",
            "sent3": "The locals tell stories of Pele's fiery dance across the land.",
            "sent4": "The destructive power of Pele's lava is both feared and respected.",
            "sent5": "The sight of Pele's glowing lava is both mesmerizing and terrifying."
        },
        {
            "definition": "A Portuguese word for skin",
            "pos": "noun",
            "sent1": "In Portuguese, 'pele' refers to the outer layer of the body.",
            "sent2": "Taking care of your pele is important for overall health.",
            "sent3": "The dermatologist examined the patient's pele for any issues.",
            "sent4": "The softness of baby pele is a sign of good health.",
            "sent5": "Protect your pele from the sun's harmful rays with sunscreen."
        }
    ]
}