{
    "term": "penang",
    "meanings": [
        {
            "definition": "A state in Malaysia.",
            "pos": "noun",
            "sent1": "Penang is a beautiful state in Malaysia.",
            "sent2": "I visited Penang last summer and enjoyed the beaches.",
            "sent3": "When I think of Penang, I imagine palm trees swaying in the breeze.",
            "sent4": "Penang is like a hidden gem waiting to be explored.",
            "sent5": "The colors of Penang are vibrant and inviting."
        },
        {
            "definition": "A type of Malaysian cuisine.",
            "pos": "noun",
            "sent1": "I tried Penang for the first time and loved the flavors.",
            "sent2": "Penang cuisine is known for its spicy and aromatic dishes.",
            "sent3": "Eating Penang always puts a smile on my face.",
            "sent4": "The taste of Penang is like a burst of happiness in my mouth.",
            "sent5": "The aroma of Penang dishes fills the room with warmth."
        },
        {
            "definition": "A type of shrimp paste.",
            "pos": "noun",
            "sent1": "The recipe called for a spoonful of Penang.",
            "sent2": "Penang adds a unique flavor to traditional dishes.",
            "sent3": "I accidentally mistook Penang for chocolate spread.",
            "sent4": "The scent of Penang lingered in the kitchen for hours.",
            "sent5": "The texture of Penang is both smooth and pungent."
        },
        {
            "definition": "A type of dried shrimp.",
            "pos": "noun",
            "sent1": "The market had fresh seafood, including Penang.",
            "sent2": "Penang is a popular ingredient in many Asian recipes.",
            "sent3": "I found Penang hidden at the back of the pantry.",
            "sent4": "The crunch of Penang adds a delightful twist to dishes.",
            "sent5": "The salty taste of Penang reminds me of the ocean."
        }
    ]
}