{
    "term": "pendentives",
    "meanings": [
        {
            "definition": "A pendentive is a curved triangle of vaulting formed by the intersection of a dome with its supporting arches.",
            "pos": "noun",
            "sent1": "The pendentives in the cathedral beautifully support the dome above.",
            "sent2": "Architects often use pendentives to create a smooth transition between different architectural shapes.",
            "sent3": "The mischievous squirrel thought the pendentives were perfect for acrobatics.",
            "sent4": "Her laughter echoed through the room, bouncing off the pendentives like playful whispers.",
            "sent5": "The sunlight streaming through the pendentives painted patterns on the floor below."
        },
        {
            "definition": "Pendentives are architectural elements used to transition from a circular dome to a square or polygonal base.",
            "pos": "noun",
            "sent1": "The ancient temple's pendentives were masterfully crafted to blend the dome with the base.",
            "sent2": "Visitors marveled at the intricate details of the pendentives supporting the grand dome.",
            "sent3": "The mischievous squirrel thought the pendentives were perfect for acrobatics.",
            "sent4": "Her laughter echoed through the room, bouncing off the pendentives like playful whispers.",
            "sent5": "The sunlight streaming through the pendentives painted patterns on the floor below."
        },
        {
            "definition": "Pendentives can be found in many Byzantine and Islamic architectural designs.",
            "pos": "noun",
            "sent1": "Exploring the ancient mosque, we admired the intricate pendentives adorning the dome.",
            "sent2": "The pendentives in the palace showcased the skilled craftsmanship of the architects.",
            "sent3": "The mischievous squirrel thought the pendentives were perfect for acrobatics.",
            "sent4": "Her laughter echoed through the room, bouncing off the pendentives like playful whispers.",
            "sent5": "The sunlight streaming through the pendentives painted patterns on the floor below."
        }
    ]
}