{
    "term": "pennate",
    "meanings": [
        {
            "definition": "Having feathers or wings",
            "pos": "adjective",
            "sent1": "The bird's pennate wings helped it soar through the sky.",
            "sent2": "The angel's costume had beautiful pennate wings attached.",
            "sent3": "The superhero's cape looked pennate, making them appear ready to take flight.",
            "sent4": "Her pennate shawl fluttered in the wind like a graceful bird.",
            "sent5": "The pennate design on the kite made it look like a colorful bird in flight."
        },
        {
            "definition": "Resembling a feather in structure or arrangement",
            "pos": "adjective",
            "sent1": "The delicate fern had pennate leaves that looked like tiny feathers.",
            "sent2": "The intricate necklace was adorned with pennate charms that shimmered in the light.",
            "sent3": "The pastry chef created a cake with pennate decorations that resembled delicate feathers.",
            "sent4": "Her hair was styled in a pennate braid that cascaded down her back like a feather boa.",
            "sent5": "The dancer's costume had pennate fringes that swayed with her every move, resembling feathers."
        },
        {
            "definition": "Having lateral veins or branches on each side of a central axis",
            "pos": "adjective",
            "sent1": "The pennate leaf had veins running along its sides, giving it a unique appearance.",
            "sent2": "The plant's pennate structure allowed nutrients to flow efficiently through its veins.",
            "sent3": "The map showed a pennate river system branching out like a tree with many limbs.",
            "sent4": "The lightning struck in a pennate pattern, spreading out like a tree's branches in the sky.",
            "sent5": "The artist painted a pennate tree with intricate branches that reached out in all directions."
        }
    ]
}