{
    "term": "penoncel",
    "meanings": [
        {
            "definition": "A small flag or streamer attached to a lance or spear.",
            "pos": "noun",
            "sent1": "The knight's penoncel fluttered proudly in the wind as he rode into battle.",
            "sent2": "During the jousting tournament, each competitor had a colorful penoncel on their lance.",
            "sent3": "The mischievous squirrel mistook the penoncel for a tasty treat and tried to grab it.",
            "sent4": "Her laughter was like a penoncel, bright and full of joy, lighting up the room.",
            "sent5": "The penoncel danced gracefully in the breeze, adding a touch of elegance to the scene."
        },
        {
            "definition": "A small triangular or swallow-tailed flag or streamer.",
            "pos": "noun",
            "sent1": "The ship's penoncel fluttered in the wind, guiding them safely to shore.",
            "sent2": "At the festival, colorful penoncels adorned every corner, creating a festive atmosphere.",
            "sent3": "The mischievous puppy thought the penoncel was a toy and playfully tugged on it.",
            "sent4": "Her smile was like a penoncel, brightening up even the gloomiest of days.",
            "sent5": "The penoncel stood out against the clear blue sky, a symbol of hope and freedom."
        },
        {
            "definition": "A small decorative flag or banner.",
            "pos": "noun",
            "sent1": "The garden party was decorated with beautiful penoncels hanging from the trees.",
            "sent2": "In medieval times, penoncels were used to represent different noble families.",
            "sent3": "The curious cat batted at the penoncel, trying to unravel its mysteries.",
            "sent4": "Her voice was like a penoncel, drawing everyone's attention with its melodious tone.",
            "sent5": "The penoncel added a touch of color to the otherwise plain room, making it feel more welcoming."
        }
    ]
}