{
    "term": "penury",
    "meanings": [
        {
            "definition": "Extreme poverty",
            "pos": "noun",
            "sent1": "The family lived in penury, struggling to afford even basic necessities.",
            "sent2": "After losing his job, he fell into penury and had to rely on charity for food.",
            "sent3": "In the play, the character's penury led to comical situations as he tried to make ends meet.",
            "sent4": "The artist depicted the city's penury through his paintings of rundown buildings and empty streets.",
            "sent5": "The documentary vividly portrayed the harsh reality of penury faced by many in the community."
        },
        {
            "definition": "Destitution or lack of resources",
            "pos": "noun",
            "sent1": "The refugees escaped war only to face penury in the overcrowded camp.",
            "sent2": "She dedicated her life to helping those in penury by providing them with essential supplies.",
            "sent3": "Despite his penury, he always had a smile on his face, finding joy in the simplest things.",
            "sent4": "The abandoned house stood as a symbol of the town's penury, with broken windows and overgrown weeds.",
            "sent5": "The novel painted a bleak picture of the protagonist's penury, highlighting the struggle for survival."
        },
        {
            "definition": "Scarcity or insufficiency",
            "pos": "noun",
            "sent1": "The penury of resources in the region led to fierce competition among the villagers.",
            "sent2": "During the drought, the farmers faced penury as their crops withered in the fields.",
            "sent3": "The penury of ideas in the meeting resulted in a lackluster discussion with no innovative solutions.",
            "sent4": "Her garden reflected the penury of rain, with wilted flowers and dry soil.",
            "sent5": "The company's penury of skilled workers hindered its ability to complete projects on time."
        }
    ]
}