{
    "term": "peonage",
    "meanings": [
        {
            "definition": "The practice of forcing debtors to work off their debts.",
            "pos": "noun",
            "sent1": "In some places, peonage was used to make people work without pay.",
            "sent2": "The authorities cracked down on the illegal peonage happening in the region.",
            "sent3": "The idea of peonage seemed like a cruel joke to the indebted workers.",
            "sent4": "The shadow of peonage loomed over the struggling farmers, trapping them in endless toil.",
            "sent5": "The harsh reality of peonage left a lasting mark on the community."
        },
        {
            "definition": "A system of labor in which workers are held in servitude until their debts are paid off.",
            "pos": "noun",
            "sent1": "The workers were trapped in a cycle of peonage until they could settle their debts.",
            "sent2": "Peonage was a way for the wealthy to exploit the labor of those in debt.",
            "sent3": "The workers joked about forming a 'peonage escape club' to lighten the mood.",
            "sent4": "The chains of peonage bound the workers to their creditors, stifling their freedom.",
            "sent5": "The oppressive nature of peonage made it hard for workers to break free from their debts."
        },
        {
            "definition": "The state of being a peon or a laborer.",
            "pos": "noun",
            "sent1": "After losing everything, he found himself in a state of peonage, working day and night.",
            "sent2": "The harsh reality of peonage hit him when he realized he had no way out.",
            "sent3": "He tried to make light of his peonage situation by cracking jokes with his fellow laborers.",
            "sent4": "The weight of peonage felt like a heavy burden on his shoulders, dragging him down.",
            "sent5": "The endless cycle of peonage seemed like an inescapable fate for many in the village."
        }
    ]
}