{
    "term": "peoplehoods",
    "meanings": [
        {
            "definition": "The state or condition of being a people.",
            "pos": "noun",
            "sent1": "The peoplehoods of the tribe were evident in their shared traditions.",
            "sent2": "The concept of peoplehoods is important in understanding cultural diversity.",
            "sent3": "The peoplehoods of the town were so strong that they all dressed up in matching outfits for the event.",
            "sent4": "In the melting pot of the city, different peoplehoods blended together to create a unique culture.",
            "sent5": "The sense of peoplehoods among the villagers was so strong that they always came together to help one another."
        },
        {
            "definition": "The collective identity or consciousness of a group of people.",
            "pos": "noun",
            "sent1": "The shared history and values contribute to the peoplehoods of the community.",
            "sent2": "The celebration of cultural festivals strengthens the peoplehoods of the society.",
            "sent3": "The peoplehoods of the team were evident in their synchronized dance routine.",
            "sent4": "The peoplehoods of the nation resonated in the unity displayed during the crisis.",
            "sent5": "The sense of peoplehoods among the students was fostered through collaborative projects and activities."
        },
        {
            "definition": "The quality or state of being a member of a particular group or community.",
            "pos": "noun",
            "sent1": "Belonging to the peoplehoods of the neighborhood brought a sense of security.",
            "sent2": "The sense of peoplehoods in the organization promoted teamwork and cooperation.",
            "sent3": "The peoplehoods of the club were so strong that they had secret handshakes.",
            "sent4": "The peoplehoods of the family were evident in their shared values and traditions.",
            "sent5": "Being part of the peoplehoods of the town meant participating in community events and gatherings."
        }
    ]
}