{
    "term": "percolator",
    "meanings": [
        {
            "definition": "A device used for brewing coffee by passing boiling water through ground coffee beans.",
            "pos": "noun",
            "sent1": "In the morning, the percolator bubbled as it brewed fresh coffee.",
            "sent2": "My grandmother's percolator makes the best coffee in town.",
            "sent3": "The percolator and I have a daily ritual of brewing the perfect cup of joe.",
            "sent4": "The percolator hummed like a content bee as it brewed the aromatic coffee.",
            "sent5": "The percolator's gurgling sounds signaled that the coffee was ready to be enjoyed."
        },
        {
            "definition": "A person or thing that percolates.",
            "pos": "noun",
            "sent1": "She was like a percolator of ideas, always coming up with new and creative solutions.",
            "sent2": "The team leader acted as a percolator, filtering information to the rest of the group.",
            "sent3": "The percolator of gossip in the office always had the juiciest news to share.",
            "sent4": "His mind worked like a percolator, slowly processing information until a brilliant idea emerged.",
            "sent5": "The percolator of emotions, she could sense the mood in the room before anyone else."
        },
        {
            "definition": "To filter gradually through a porous surface or substance.",
            "pos": "verb",
            "sent1": "The rainwater began to percolate through the soil, nourishing the plants.",
            "sent2": "I watched the coffee percolate through the filter, turning into a rich brew.",
            "sent3": "Her laughter seemed to percolate through the room, infecting everyone with joy.",
            "sent4": "The idea started to percolate in his mind, growing stronger with each passing moment.",
            "sent5": "The scent of fresh bread began to percolate through the house, making everyone hungry."
        }
    ]
}