{
    "term": "perdus",
    "meanings": [
        {
            "definition": "Lost or wandering aimlessly",
            "pos": "adjective",
            "sent1": "The cat looked perdus as it roamed around the neighborhood without a clear destination.",
            "sent2": "The hiker felt perdus in the dense forest, unsure of which path to take.",
            "sent3": "The lost puppy appeared perdus as it followed a butterfly in circles.",
            "sent4": "Her thoughts were like perdus clouds, drifting aimlessly in her mind.",
            "sent5": "The old man's eyes held a perdus gaze, reflecting a lifetime of wandering memories."
        },
        {
            "definition": "A soldier separated from their unit",
            "pos": "noun",
            "sent1": "The brave soldier became perdus in the chaos of battle, searching for familiar faces.",
            "sent2": "The sergeant quickly organized a search party to find the perdus soldier in the dense jungle.",
            "sent3": "The lost soldier's helmet sat abandoned, a symbol of the perdus warrior.",
            "sent4": "In the sea of uniforms, the perdus soldier stood out like a lone tree in a field.",
            "sent5": "The sound of gunfire echoed around the perdus soldier, emphasizing his isolation."
        },
        {
            "definition": "A game of chance in which players bet on the outcome of a roll of dice",
            "pos": "noun",
            "sent1": "The group of friends gathered around the table to play perdus, each hoping for a lucky roll.",
            "sent2": "The casino was filled with the sounds of excitement as players tried their luck at perdus.",
            "sent3": "The family laughed and cheered as they played perdus, each taking turns to roll the dice.",
            "sent4": "The clatter of dice echoed through the room, signaling the start of another round of perdus.",
            "sent5": "The anticipation in the air was palpable as the players placed their bets for the next round of perdus."
        }
    ]
}