{
    "term": "perennial",
    "meanings": [
        {
            "definition": "Lasting for a long time",
            "pos": "adjective",
            "sent1": "The friendship between the two neighbors was perennial, enduring for many years.",
            "sent2": "The ancient ruins stood as a perennial reminder of the city's glorious past.",
            "sent3": "The perennial clock on the wall seemed to tick slower on Mondays, as if dreading the start of the week.",
            "sent4": "Her love for him was like a perennial flower, blooming endlessly in her heart.",
            "sent5": "The perennial oak tree in the park symbolized strength and resilience to all who passed by."
        },
        {
            "definition": "A plant that lives for more than two years",
            "pos": "noun",
            "sent1": "The gardener planted several perennial flowers in the garden that bloomed year after year.",
            "sent2": "The rose bush in the backyard was a perennial, coming back each spring with vibrant blooms.",
            "sent3": "The mischievous squirrel kept digging up the perennial plants, mistaking them for buried treasures.",
            "sent4": "The perennial in the corner of the garden stood tall and proud, a testament to nature's endurance.",
            "sent5": "The colorful perennial added a touch of beauty to the otherwise dull landscape."
        },
        {
            "definition": "Recurring or continuing regularly",
            "pos": "adjective",
            "sent1": "The perennial issue of littering in the park needed to be addressed by the community.",
            "sent2": "The annual festival was a perennial favorite among the townspeople, eagerly awaited each year.",
            "sent3": "The perennial rain showers in the region made umbrellas a must-have accessory for locals.",
            "sent4": "His perennial lateness to meetings became a running joke among his colleagues.",
            "sent5": "The perennial debate over the best pizza toppings divided the group into passionate factions."
        }
    ]
}