{
    "term": "peres",
    "meanings": [
        {
            "definition": "A unit of currency in Iran.",
            "pos": "noun",
            "sent1": "In Iran, you can buy many things with just a few peres.",
            "sent2": "I exchanged my dollars for peres at the currency exchange.",
            "sent3": "The peres in my pocket jingled as I walked down the street.",
            "sent4": "Her savings were like a jar full of shiny peres, each representing hard work.",
            "sent5": "The peres were stacked neatly in the cash register, ready to be spent."
        },
        {
            "definition": "A type of fruit.",
            "pos": "noun",
            "sent1": "The market was filled with the sweet aroma of ripe peres.",
            "sent2": "I enjoy eating peres as a healthy snack.",
            "sent3": "She juggled the peres in the air, pretending they were balls.",
            "sent4": "The peres on the tree looked like colorful ornaments hanging from branches.",
            "sent5": "The peres were so juicy that they dripped down my chin with each bite."
        },
        {
            "definition": "To cut or trim the edges of something.",
            "pos": "verb",
            "sent1": "I need to peres the paper to make it fit in the frame.",
            "sent2": "She carefully peres the fabric before sewing it together.",
            "sent3": "He tried to peres his hair with kitchen scissors, resulting in a messy look.",
            "sent4": "The chef used a sharp knife to peres the vegetables with precision.",
            "sent5": "The barber will peres your hair to give you a fresh new look."
        },
        {
            "definition": "To divide into parts.",
            "pos": "verb",
            "sent1": "The teacher asked the students to peres the group into smaller teams.",
            "sent2": "I will peres the cake into equal slices for everyone to enjoy.",
            "sent3": "The magician seemed to peres himself into two on stage, amazing the audience.",
            "sent4": "The river seemed to peres the land, creating a beautiful delta.",
            "sent5": "She will peres her time between work and family to find balance."
        }
    ]
}