{
    "term": "perfuse",
    "meanings": [
        {
            "definition": "To saturate or fill with a liquid, especially blood",
            "pos": "verb",
            "sent1": "The doctor needed to perfuse the wound with antiseptic to prevent infection.",
            "sent2": "The rain began to perfuse the parched earth, bringing much-needed relief to the crops.",
            "sent3": "She accidentally perfused the soup with too much salt, making it nearly inedible.",
            "sent4": "His words seemed to perfuse her heart with warmth, easing her fears.",
            "sent5": "The vibrant colors of the sunset seemed to perfuse the sky, creating a breathtaking scene."
        },
        {
            "definition": "To spread or diffuse through something",
            "pos": "verb",
            "sent1": "The aroma of freshly baked bread began to perfuse the entire house.",
            "sent2": "The scent of flowers perfused the garden, attracting bees and butterflies.",
            "sent3": "The laughter from the party perfused through the walls, making the neighbors curious.",
            "sent4": "His kindness seemed to perfuse every interaction, leaving a lasting impact on others.",
            "sent5": "The music perfused the room, filling it with joy and energy."
        },
        {
            "definition": "To supply an organ or tissue with blood or other fluid",
            "pos": "verb",
            "sent1": "The heart works tirelessly to perfuse the body with oxygen-rich blood.",
            "sent2": "The surgeon carefully perfused the transplanted kidney, ensuring its proper function.",
            "sent3": "The water pump failed to perfuse the garden, causing the plants to wither.",
            "sent4": "Her generosity seemed to perfuse every aspect of her life, bringing happiness to those around her.",
            "sent5": "The artist's passion perfused every brushstroke, creating a masterpiece full of emotion."
        }
    ]
}