{
    "term": "perfidiousnesses",
    "meanings": [
        {
            "definition": "The quality or state of being perfidious.",
            "pos": "noun",
            "sent1": "Her perfidiousnesses were evident in her constant lies and broken promises.",
            "sent2": "The perfidiousnesses of the villain were revealed when he double-crossed his allies.",
            "sent3": "The perfidiousnesses of the cat pretending to be innocent were exposed when it knocked over the vase.",
            "sent4": "The perfidiousnesses of the storm clouds betrayed the sunny morning with a sudden downpour.",
            "sent5": "The perfidiousnesses of the mirror distorted her reflection, making her appear taller than she was."
        },
        {
            "definition": "The act of betraying someone or something.",
            "pos": "noun",
            "sent1": "His perfidiousnesses towards his friends led to their trust being shattered.",
            "sent2": "The perfidiousnesses of the spy were finally uncovered by the intelligence agency.",
            "sent3": "The perfidiousnesses of the cookie jar luring the children with promises of sweets were revealed when it turned out to be empty.",
            "sent4": "The perfidiousnesses of the shadows betrayed the hiding place of the fugitive.",
            "sent5": "The perfidiousnesses of the compass needle pointed in the wrong direction, leading the hikers astray."
        },
        {
            "definition": "Deceitfulness or untrustworthiness.",
            "pos": "noun",
            "sent1": "The perfidiousnesses of the con artist were exposed when his scams were uncovered.",
            "sent2": "She was hurt by the perfidiousnesses of her once-trusted advisor.",
            "sent3": "The perfidiousnesses of the mischievous squirrel stealing nuts from the bird feeder were caught on camera.",
            "sent4": "The perfidiousnesses of the quicksand lured unsuspecting travelers into its treacherous depths.",
            "sent5": "The perfidiousnesses of the old bridge collapsed under the weight of the heavy truck."
        }
    ]
}