{
    "term": "perfectionism",
    "meanings": [
        {
            "definition": "A person who strives for flawlessness and setting excessively high standards for themselves.",
            "pos": "noun",
            "sent1": "Her perfectionism made her spend hours perfecting every detail of her project.",
            "sent2": "His perfectionism often led to him feeling frustrated when things didn't go exactly as planned.",
            "sent3": "Sarah's perfectionism reached new heights when she color-coded her sock drawer.",
            "sent4": "The artist's perfectionism was like a sharp knife, cutting away any imperfections in his work.",
            "sent5": "The perfectionism of the chef was evident in the precise way he plated each dish."
        },
        {
            "definition": "The belief that perfection can and should be attained in all aspects of life.",
            "pos": "noun",
            "sent1": "His perfectionism drove him to constantly seek ways to improve every aspect of his life.",
            "sent2": "The culture of perfectionism in the company created a high-pressure environment for employees.",
            "sent3": "The perfectionism of the weatherman was evident in his insistence on predicting the exact temperature.",
            "sent4": "The idea of perfectionism in relationships can sometimes lead to unrealistic expectations.",
            "sent5": "The perfectionism of the gardener was reflected in the immaculate beauty of the garden."
        },
        {
            "definition": "The tendency to be overly critical of oneself and others in pursuit of perfection.",
            "pos": "noun",
            "sent1": "Her perfectionism often caused her to nitpick every little mistake she made.",
            "sent2": "The perfectionism of the coach sometimes made the players feel discouraged.",
            "sent3": "John's perfectionism reached comical levels when he rearranged his bookshelf by color.",
            "sent4": "The perfectionism of the judge was like a magnifying glass, highlighting even the smallest errors.",
            "sent5": "The perfectionism of the student was both a blessing and a curse in her academic pursuits."
        }
    ]
}