{
    "term": "perinatologist",
    "meanings": [
        {
            "definition": "A doctor specializing in high-risk pregnancies.",
            "pos": "noun",
            "sent1": "The perinatologist closely monitors the health of both the mother and the baby during a high-risk pregnancy.",
            "sent2": "My friend's sister had to see a perinatologist because her pregnancy was considered high-risk.",
            "sent3": "The perinatologist joked that the baby was already causing trouble before being born.",
            "sent4": "The perinatologist is like a guardian angel, watching over the mother and baby with great care.",
            "sent5": "The perinatologist's expertise can make all the difference in ensuring a safe delivery."
        },
        {
            "definition": "A medical professional who cares for pregnant women and their unborn babies.",
            "pos": "noun",
            "sent1": "The perinatologist provided excellent care to the pregnant woman and her unborn baby.",
            "sent2": "During her pregnancy, Sarah felt grateful for the support of her perinatologist.",
            "sent3": "The perinatologist's dedication to the well-being of both mother and baby is truly admirable.",
            "sent4": "In the world of pregnancy, the perinatologist is a beacon of hope and expertise.",
            "sent5": "The perinatologist's compassion shines through in every interaction with expecting mothers."
        },
        {
            "definition": "An obstetrician who focuses on the health of both mother and baby during pregnancy.",
            "pos": "noun",
            "sent1": "The perinatologist's expertise in maternal and fetal health is invaluable during pregnancy.",
            "sent2": "The perinatologist's role is crucial in ensuring the well-being of both the mother and the baby.",
            "sent3": "The perinatologist playfully remarked that taking care of two patients at once keeps things interesting.",
            "sent4": "To the expecting parents, the perinatologist is a trusted guide through the journey of pregnancy.",
            "sent5": "The perinatologist's dedication to maternal and fetal health is unwavering."
        }
    ]
}