{
    "term": "permutation",
    "meanings": [
        {
            "definition": "A way in which a set or number of things can be ordered or arranged.",
            "pos": "noun",
            "sent1": "In math class, we learned about the different ways to arrange objects in a permutation.",
            "sent2": "The permutation of the letters in the word 'cat' can result in 'act' or 'tac'.",
            "sent3": "During the game, the player's lucky permutation of cards helped them win.",
            "sent4": "The permutation of colors in the sunset painted the sky in a breathtaking display.",
            "sent5": "Her unique permutation of spices in the recipe created a delicious dish."
        },
        {
            "definition": "The act of changing the arrangement of a set of things.",
            "pos": "noun",
            "sent1": "After the party, the cleanup involved the permutation of chairs and tables back to their original places.",
            "sent2": "The decorator suggested a permutation of the furniture to give the room a fresh look.",
            "sent3": "The magician's trick involved a surprising permutation of cards that left the audience amazed.",
            "sent4": "The sudden permutation of plans caused confusion among the team members.",
            "sent5": "The artist's unique permutation of colors on the canvas created a striking visual impact."
        },
        {
            "definition": "A transformation of a set of elements that changes their order.",
            "pos": "noun",
            "sent1": "The encryption software uses a complex permutation to scramble the data for security.",
            "sent2": "The permutation of the digits in the code unlocked the hidden message.",
            "sent3": "The unexpected permutation of events led to a surprising outcome.",
            "sent4": "The permutation of roles in the play added a new dynamic to the performance.",
            "sent5": "The chef's creative permutation of ingredients resulted in a unique flavor combination."
        }
    ]
}