{
    "term": "personation",
    "meanings": [
        {
            "definition": "The act of pretending to be someone else.",
            "pos": "noun",
            "sent1": "During the play, the actor's personation of a famous historical figure was very convincing.",
            "sent2": "Identity theft is a serious crime that involves personation of another individual.",
            "sent3": "At the costume party, his personation of a superhero made everyone laugh.",
            "sent4": "Her personation of a strict teacher was so accurate, it felt like she had transformed into someone else.",
            "sent5": "The spy's personation of a wealthy businessman fooled everyone at the gala event."
        },
        {
            "definition": "The act of impersonating someone.",
            "pos": "noun",
            "sent1": "The comedian's personation of a famous singer had the audience in stitches.",
            "sent2": "Impersonation is often used in movies to create comedic or dramatic effects.",
            "sent3": "His personation of the boss during the meeting was so spot-on, it was hard to keep a straight face.",
            "sent4": "The criminal's personation of a police officer almost fooled the security guard at the bank.",
            "sent5": "The actor's personation of a detective was so convincing, he was mistaken for a real investigator."
        },
        {
            "definition": "The act of assuming the identity of another person.",
            "pos": "noun",
            "sent1": "Identity theft involves the personation of an unsuspecting individual for fraudulent purposes.",
            "sent2": "In espionage movies, there is often a scene where a character uses personation to gain access to a secure facility.",
            "sent3": "The student's personation of the teacher was meant as a harmless prank.",
            "sent4": "The criminal's personation of a wealthy heiress led to a series of elaborate cons.",
            "sent5": "The actress's personation of a famous celebrity was so convincing, she was asked for autographs in public."
        }
    ]
}