{
    "term": "persecutory",
    "meanings": [
        {
            "definition": "Causing or characterized by persecution",
            "pos": "adjective",
            "sent1": "The persecutory actions of the dictator led to fear among the citizens.",
            "sent2": "The community came together to address the persecutory behavior of the bullies.",
            "sent3": "The cat's persecutory stare made the mouse scamper away in a playful chase.",
            "sent4": "The storm's persecutory winds battered the fragile roof of the old house.",
            "sent5": "The persecutory nature of the forest at night sent shivers down her spine."
        },
        {
            "definition": "Involving or relating to the persecution of a person or group",
            "pos": "adjective",
            "sent1": "The persecutory laws targeted a specific religious minority.",
            "sent2": "The historical records shed light on the persecutory acts committed during that era.",
            "sent3": "The movie portrayed a comical twist on persecutory situations, bringing laughter to the audience.",
            "sent4": "Her mind felt like a battlefield, filled with persecutory thoughts attacking her sense of peace.",
            "sent5": "The artist's painting captured the essence of a persecutory society with vivid colors and shapes."
        },
        {
            "definition": "Feeling or experiencing persecution",
            "pos": "adjective",
            "sent1": "The persecuted individual had a persecutory sense of being watched at all times.",
            "sent2": "She couldn't shake off the persecutory feeling that lingered after the unsettling encounter.",
            "sent3": "Despite the playful teasing, his persecutory paranoia made him believe in imaginary threats.",
            "sent4": "The weight of the persecutory emotions pressed down on her heart like a heavy burden.",
            "sent5": "In her nightmares, the shadows took on a persecutory form, haunting her dreams."
        }
    ]
}