{
    "term": "personified",
    "meanings": [
        {
            "definition": "Represented in human form or with human characteristics.",
            "pos": "adjective",
            "sent1": "The cartoon character was personified with a big smile and friendly eyes.",
            "sent2": "The painting of the queen was personified with a crown and elegant dress.",
            "sent3": "The toy bear was personified with a cute bow tie and a friendly wave.",
            "sent4": "The tree in the story was personified with arms reaching out like welcoming branches.",
            "sent5": "The robot in the movie was personified with blinking lights and a cheerful voice."
        },
        {
            "definition": "Embodied or exemplified in a person.",
            "pos": "adjective",
            "sent1": "Her kindness was personified in the way she helped everyone in need.",
            "sent2": "His bravery was personified when he stood up to the bully at school.",
            "sent3": "Their teamwork was personified during the group project when they all worked together seamlessly.",
            "sent4": "The spirit of generosity was personified by the anonymous donor who gave to charity.",
            "sent5": "The essence of leadership was personified by the captain of the team who inspired others to do their best."
        },
        {
            "definition": "To attribute human qualities to something non-human.",
            "pos": "verb",
            "sent1": "In the fairy tale, the animals were personified and could talk and dance.",
            "sent2": "The ancient Greeks often personified natural elements like the sun and the moon.",
            "sent3": "The old car seemed to be personified, making funny noises like it was laughing.",
            "sent4": "The wind was personified as a mischievous trickster, playing with the leaves in the garden.",
            "sent5": "The mountain was personified in the legend as a sleeping giant, waiting to awaken."
        }
    ]
}