{
    "term": "personification",
    "meanings": [
        {
            "definition": "The attribution of human characteristics to something non-human.",
            "pos": "noun",
            "sent1": "In the story, the talking animals were a clever use of personification.",
            "sent2": "The author used personification to make the wind seem like a playful child.",
            "sent3": "The personification of the sun as a smiling face made the children giggle.",
            "sent4": "Her artwork was a beautiful personification of nature's grace and power.",
            "sent5": "The poet's personification of the moon as a silent watcher was hauntingly beautiful."
        },
        {
            "definition": "A figure of speech in which a thing, idea, or animal is given human attributes.",
            "pos": "noun",
            "sent1": "The advertisement used personification to make the car seem friendly and reliable.",
            "sent2": "In the fable, the talking tree was a clear example of personification.",
            "sent3": "The personification of the storm as an angry giant added a humorous touch to the story.",
            "sent4": "Her painting was a striking personification of loneliness, with a solitary figure under a dark sky.",
            "sent5": "The author's personification of the ocean as a mighty beast brought the scene to life."
        },
        {
            "definition": "The representation of an abstract quality in human form.",
            "pos": "noun",
            "sent1": "The artist's personification of love as a dancing couple was heartwarming.",
            "sent2": "The play used personification to depict jealousy as a green-eyed monster.",
            "sent3": "The personification of time as an old man with a scythe was both amusing and thought-provoking.",
            "sent4": "Her sculpture was a powerful personification of freedom, with a figure breaking chains.",
            "sent5": "The writer's personification of hope as a guiding light resonated with readers."
        }
    ]
}