{
    "term": "persecuting",
    "meanings": [
        {
            "definition": "Subjecting someone to hostility or ill-treatment, especially because of their race, religion, or political beliefs.",
            "pos": "noun",
            "sent1": "The persecuting of individuals based on their beliefs is a violation of human rights.",
            "sent2": "The community came together to stop the persecuting of a particular religious group.",
            "sent3": "The comedy show highlighted the absurdity of persecuting others for their differences.",
            "sent4": "In a world without persecuting, harmony and understanding can flourish.",
            "sent5": "The history books are filled with stories of the devastating effects of persecuting."
        },
        {
            "definition": "Harassing or oppressing someone persistently.",
            "pos": "verb",
            "sent1": "She felt like she was constantly persecuting by her classmates at school.",
            "sent2": "The dictator was known for persecuting anyone who spoke against him.",
            "sent3": "The mischievous cat seemed to enjoy persecuting the poor dog every chance it got.",
            "sent4": "The dark clouds seemed to be persecuting the small town with never-ending rain.",
            "sent5": "The villain in the movie had a habit of persecuting innocent bystanders."
        },
        {
            "definition": "Treating someone unfairly or cruelly over a period of time.",
            "pos": "verb",
            "sent1": "The boss was persecuting his employees by giving them impossible tasks.",
            "sent2": "The stepmother was constantly persecuting her stepdaughter, making her life miserable.",
            "sent3": "The misbehaving child was persecuting the babysitter with endless tantrums.",
            "sent4": "The old house seemed to be persecuting its new owners with strange noises at night.",
            "sent5": "The novel depicted a powerful ruler persecuting the peasants in his kingdom."
        }
    ]
}