{
    "term": "personal",
    "meanings": [
        {
            "definition": "Belonging to or affecting a particular person",
            "pos": "adjective",
            "sent1": "My personal belongings are kept in a special box.",
            "sent2": "She values her personal space and privacy.",
            "sent3": "I accidentally wore my personal socks to work today!",
            "sent4": "The personal touch of handmade gifts is always appreciated.",
            "sent5": "The personal connection we share makes our friendship strong."
        },
        {
            "definition": "Of or relating to a person's private life",
            "pos": "adjective",
            "sent1": "He prefers to keep his personal matters private.",
            "sent2": "The diary contains her personal thoughts and feelings.",
            "sent3": "It's important to respect others' personal boundaries.",
            "sent4": "The movie delves into the personal struggles of the main character.",
            "sent5": "The personal memories we create together are precious."
        },
        {
            "definition": "Done, made, or performed by a particular person",
            "pos": "adjective",
            "sent1": "The painting is a personal masterpiece of the artist.",
            "sent2": "Her personal artwork reflects her unique style.",
            "sent3": "I tried my personal best in the competition.",
            "sent4": "The personal touch of the chef is evident in every dish.",
            "sent5": "The personal effort she puts into her work is admirable."
        },
        {
            "definition": "Intended for use by one person at a time",
            "pos": "adjective",
            "sent1": "Each student has their own personal desk in the classroom.",
            "sent2": "The library provides personal study carrels for quiet reading.",
            "sent3": "I always bring my personal headphones to listen to music.",
            "sent4": "The personal computer at home is faster than the shared one at work.",
            "sent5": "The personal locker assigned to me is where I keep my belongings."
        }
    ]
}