{
    "term": "pes",
    "meanings": [
        {
            "definition": "A unit of weight in ancient Rome, equal to about 12 ounces.",
            "pos": "noun",
            "sent1": "In ancient Rome, they measured goods using the pes.",
            "sent2": "The pes was a common measure for heavy items in the past.",
            "sent3": "The pes decided the weight of the treasure chest in the historical play.",
            "sent4": "Her determination was a pes on his shoulders, a weight he couldn't shake off.",
            "sent5": "The pes of responsibility rested heavily on his young shoulders."
        },
        {
            "definition": "The plural of 'pe', a monetary unit of Hungary.",
            "pos": "noun",
            "sent1": "She exchanged her euros for Hungarian pes at the bank.",
            "sent2": "The market only accepted payment in Hungarian pes.",
            "sent3": "He found a forgotten stash of Hungarian pes in his old jacket pocket.",
            "sent4": "The value of friendship cannot be measured in Hungarian pes.",
            "sent5": "His generosity was worth more than a bag full of Hungarian pes."
        },
        {
            "definition": "The plural of 'pe', a former monetary unit of Peru.",
            "pos": "noun",
            "sent1": "The souvenir shop only accepted payment in Peruvian pes.",
            "sent2": "She saved up all her Peruvian pes for a special occasion.",
            "sent3": "He accidentally paid with Peruvian pes instead of dollars at the market.",
            "sent4": "Her smile was worth more than a handful of Peruvian pes.",
            "sent5": "The sound of the waves was the only currency needed, not Peruvian pes."
        },
        {
            "definition": "The plural of 'pe', a former monetary unit of the Philippines.",
            "pos": "noun",
            "sent1": "The street vendor preferred payment in Philippine pes.",
            "sent2": "He collected old coins, including Philippine pes, as a hobby.",
            "sent3": "She found a lucky Philippine pes on the sidewalk.",
            "sent4": "His words were more valuable than any amount of Philippine pes.",
            "sent5": "The aroma of freshly baked bread was worth its weight in Philippine pes."
        }
    ]
}