{
    "term": "pesticidal",
    "meanings": [
        {
            "definition": "Of or relating to pesticides.",
            "pos": "adjective",
            "sent1": "The farmer used a pesticidal spray to protect his crops from insects.",
            "sent2": "The company developed a new pesticidal formula to combat weeds effectively.",
            "sent3": "The garden gnome joked that his hat was made of pesticidal material to keep bugs away.",
            "sent4": "Her smile was as pesticidal as a powerful insecticide, brightening everyone's day.",
            "sent5": "The sun's rays acted like a pesticidal shield, warding off any harmful pests from the garden."
        },
        {
            "definition": "Capable of killing pests.",
            "pos": "adjective",
            "sent1": "The pesticidal powder quickly eliminated the ant infestation in the kitchen.",
            "sent2": "The strong pesticidal properties of the new product made it highly effective against rodents.",
            "sent3": "The cat proudly displayed its pesticidal skills by catching a mouse in the barn.",
            "sent4": "His words were as pesticidal as a potent insect killer, silencing any doubts in the room.",
            "sent5": "The superhero's powers were described as pesticidal, eradicating evil like pests from the city."
        },
        {
            "definition": "Having the properties of a pesticide.",
            "pos": "adjective",
            "sent1": "The pesticidal effect of the solution was evident as the weeds wilted away.",
            "sent2": "The team tested the pesticidal nature of the substance on different types of insects.",
            "sent3": "The magician's hat seemed to have pesticidal qualities, making coins disappear like pests.",
            "sent4": "Her voice was as pesticidal as a potent bug spray, clearing the room of any doubts.",
            "sent5": "The potion had a pesticidal aroma, repelling insects with its strong scent."
        }
    ]
}