{
    "term": "pestilentially",
    "meanings": [
        {
            "definition": "In a manner relating to or resembling a pestilence.",
            "pos": "adverb",
            "sent1": "The dark clouds loomed pestilentially over the village, foretelling a storm.",
            "sent2": "The virus spread pestilentially through the crowded city.",
            "sent3": "The mosquitoes buzzed pestilentially around the picnic, annoying everyone.",
            "sent4": "The corruption in the government spread pestilentially, infecting every level.",
            "sent5": "The wildfire raged pestilentially, consuming everything in its path."
        },
        {
            "definition": "In a manner that spreads disease or causes harm.",
            "pos": "adverb",
            "sent1": "The contaminated water source flowed pestilentially downstream, affecting the entire town.",
            "sent2": "The rumor spread pestilentially, causing panic among the students.",
            "sent3": "The mischievous raccoon raided the campsite pestilentially, stealing all the food.",
            "sent4": "The toxic fumes from the factory billowed pestilentially into the air, endangering the nearby residents.",
            "sent5": "The invasive species multiplied pestilentially, threatening the local ecosystem."
        },
        {
            "definition": "In a manner that is extremely harmful or destructive.",
            "pos": "adverb",
            "sent1": "The dictator ruled pestilentially, oppressing the citizens with fear.",
            "sent2": "The financial crisis hit the country pestilentially, causing widespread poverty.",
            "sent3": "The toddler ran around the house pestilentially, knocking over everything in sight.",
            "sent4": "The invasive species spread pestilentially, wiping out native plants.",
            "sent5": "The wildfire spread pestilentially, leaving a path of destruction in its wake."
        }
    ]
}