{
    "term": "peters",
    "meanings": [
        {
            "definition": "To diminish gradually; dwindle",
            "pos": "verb",
            "sent1": "As the sun sets, the light peters out slowly.",
            "sent2": "The sound of laughter peters away in the distance.",
            "sent3": "The excitement of the party peters out as the night goes on.",
            "sent4": "Her enthusiasm for the project peters out like a candle flickering out.",
            "sent5": "The river's flow peters to a gentle trickle at the end of summer."
        },
        {
            "definition": "A common surname",
            "pos": "noun",
            "sent1": "The teacher called on Peter Peters in class.",
            "sent2": "Many people in the town share the last name Peters.",
            "sent3": "Mr. Peters and Mrs. Peters are siblings with the same surname.",
            "sent4": "The Peters family reunion is always a lively event.",
            "sent5": "The Peters name has been in the community for generations."
        },
        {
            "definition": "A slang term for money",
            "pos": "noun",
            "sent1": "He always carries a lot of peters in his wallet.",
            "sent2": "She saved up all her peters to buy a new bike.",
            "sent3": "I need to earn more peters to go on vacation.",
            "sent4": "His pockets jingled with the sound of peters.",
            "sent5": "The jar was filled with shiny peters of different denominations."
        },
        {
            "definition": "A type of fish",
            "pos": "noun",
            "sent1": "The peters in the pond swim gracefully.",
            "sent2": "Fishermen enjoy catching peters in the lake.",
            "sent3": "The aquarium has a tank dedicated to colorful peters.",
            "sent4": "The chef prepared a delicious dish using fresh peters.",
            "sent5": "Children love watching the playful peters in the stream."
        }
    ]
}