{
    "term": "petrographical",
    "meanings": [
        {
            "definition": "Relating to the description and classification of rocks.",
            "pos": "adjective",
            "sent1": "The petrographical report provided detailed information about the different types of rocks in the area.",
            "sent2": "Geologists use petrographical techniques to understand the characteristics of various rocks.",
            "sent3": "The petrographical analysis of the boulder revealed it was actually a disguised cake.",
            "sent4": "Her petrographical skills were so sharp, she could read the history of the rocks like a book.",
            "sent5": "The petrographical details painted a vivid picture of the rock formations in my mind."
        },
        {
            "definition": "Involving the study of the composition and texture of rocks.",
            "pos": "adjective",
            "sent1": "The petrographical study focused on the minerals present in the rock samples.",
            "sent2": "Researchers conducted petrographical experiments to analyze the texture of the rocks.",
            "sent3": "The petrographical investigation unexpectedly led to the discovery of a hidden gemstone.",
            "sent4": "His petrographical observations revealed the intricate patterns within the rocks.",
            "sent5": "The petrographical examination uncovered the secrets hidden beneath the surface of the rocks."
        },
        {
            "definition": "Pertaining to the analysis of minerals in rocks.",
            "pos": "adjective",
            "sent1": "The petrographical research focused on identifying the minerals present in the rock formations.",
            "sent2": "Scientists used petrographical methods to determine the mineral composition of the rocks.",
            "sent3": "The petrographical study unexpectedly led to the discovery of a rare gemstone hidden in the rocks.",
            "sent4": "Her petrographical expertise allowed her to identify the minerals with precision.",
            "sent5": "The petrographical analysis provided a clear picture of the mineral content within the rocks."
        }
    ]
}