{
    "term": "petrological",
    "meanings": [
        {
            "definition": "relating to the scientific study of rocks",
            "pos": "adjective",
            "sent1": "The petrological research team examined the different types of rocks in the area.",
            "sent2": "Her petrological expertise helped identify the unique characteristics of the rock samples.",
            "sent3": "The petrological investigation revealed that the rocks were actually disguised as diamonds!",
            "sent4": "His petrological knowledge was as solid as the rocks he studied.",
            "sent5": "The petrological analysis uncovered hidden layers within the rock formations."
        },
        {
            "definition": "pertaining to the classification and analysis of rocks and minerals",
            "pos": "adjective",
            "sent1": "The petrological report detailed the various minerals found in the rock samples.",
            "sent2": "Their petrological study focused on categorizing the rocks based on their composition.",
            "sent3": "The petrological examination unexpectedly revealed a treasure trove of rare minerals.",
            "sent4": "The petrological approach to rock analysis was both systematic and thorough.",
            "sent5": "Through petrological investigation, they were able to distinguish between different types of minerals."
        },
        {
            "definition": "involving the study of the origin and composition of rocks",
            "pos": "adjective",
            "sent1": "The petrological research delved into the formation processes of the rocks.",
            "sent2": "Their petrological findings shed light on the geological history of the region.",
            "sent3": "The petrological exploration led to surprising discoveries about the rocks' origins.",
            "sent4": "She had a petrological theory about the unique composition of the rocks.",
            "sent5": "The petrological investigation revealed the intricate details of the rock's composition."
        }
    ]
}