{
    "term": "pettifogging",
    "meanings": [
        {
            "definition": "Placing undue emphasis on petty details or trivial matters.",
            "pos": "adjective",
            "sent1": "The pettifogging rules at the board game competition made it hard for everyone to enjoy.",
            "sent2": "Her pettifogging attitude towards the color of the curtains delayed the home decoration process.",
            "sent3": "The pettifogging debate over which flavor of ice cream is the best lasted for hours.",
            "sent4": "His pettifogging obsession with organizing his bookshelf by size rather than genre was amusing to his friends.",
            "sent5": "The pettifogging arguments between the siblings over who gets the bigger slice of cake were endless."
        },
        {
            "definition": "Engaging in legal quibbling or sophistry.",
            "pos": "adjective",
            "sent1": "The pettifogging lawyer tried to confuse the jury with unnecessary details.",
            "sent2": "The pettifogging legal team managed to delay the trial with their constant objections.",
            "sent3": "The pettifogging attorney's clever arguments left the courtroom in awe.",
            "sent4": "Her pettifogging defense strategy was like a maze, leading nowhere.",
            "sent5": "The pettifogging tactics of the prosecutor were as transparent as glass."
        },
        {
            "definition": "Characterized by a narrow focus on insignificant details.",
            "pos": "adjective",
            "sent1": "The pettifogging report was filled with unnecessary statistics and figures.",
            "sent2": "His pettifogging approach to the project caused delays in its completion.",
            "sent3": "The pettifogging discussion about the font style for the presentation was comical.",
            "sent4": "Her pettifogging attention to the minor errors in the document slowed down the editing process.",
            "sent5": "The pettifogging inspection of the painting revealed no major flaws, just tiny imperfections."
        }
    ]
}