{
    "term": "petty",
    "meanings": [
        {
            "definition": "Of little importance or significance",
            "pos": "adjective",
            "sent1": "She got upset over a petty argument about who should sit where.",
            "sent2": "The petty issue of what color to paint the walls caused a big disagreement.",
            "sent3": "It was quite petty of him to refuse to share his toys with his little sister.",
            "sent4": "Her petty complaints about the weather made everyone roll their eyes.",
            "sent5": "The petty details of the story made it hard to focus on the main plot."
        },
        {
            "definition": "Small-minded or narrow in outlook",
            "pos": "adjective",
            "sent1": "His petty attitude towards people who were different from him was disappointing.",
            "sent2": "She had a petty view of the world, only caring about her own interests.",
            "sent3": "It was petty of him to judge someone based on their appearance alone.",
            "sent4": "Her petty opinions limited her ability to see the bigger picture.",
            "sent5": "The petty mindset of the group prevented them from considering new ideas."
        },
        {
            "definition": "Trivial or insignificant",
            "pos": "adjective",
            "sent1": "The petty argument over who should do the dishes was quickly forgotten.",
            "sent2": "She felt embarrassed by her petty mistake in the presentation.",
            "sent3": "It seemed petty to worry about such a small issue in the grand scheme of things.",
            "sent4": "His petty concerns about what to wear seemed silly in comparison to the event.",
            "sent5": "The petty details of the plan were overlooked in favor of the main goals."
        },
        {
            "definition": "Showing a lack of generosity or magnanimity",
            "pos": "adjective",
            "sent1": "Her petty refusal to help her friend in need was unkind.",
            "sent2": "He displayed a petty attitude by not congratulating his colleague on the promotion.",
            "sent3": "It was petty of him to not share credit for the successful project.",
            "sent4": "Their petty behavior towards each other only created more tension.",
            "sent5": "The petty actions of the team leader caused resentment among the members."
        }
    ]
}