{
    "term": "phallocratic",
    "meanings": [
        {
            "definition": "Relating to or characterized by male dominance or a focus on male perspectives.",
            "pos": "adjective",
            "sent1": "The phallocratic society only valued opinions from men.",
            "sent2": "Her essay criticized the phallocratic nature of the company's leadership.",
            "sent3": "In the phallocratic world of superheroes, female characters often play secondary roles.",
            "sent4": "The phallocratic mindset in the boardroom stifled diversity and innovation.",
            "sent5": "The phallocratic culture in the workplace made it challenging for women to advance."
        },
        {
            "definition": "A system or society that prioritizes male authority and power.",
            "pos": "noun",
            "sent1": "The phallocratic enforced strict gender roles.",
            "sent2": "She studied the effects of phallocratic structures on social dynamics.",
            "sent3": "The comedy show humorously portrayed a phallocratic society where men ruled everything.",
            "sent4": "The phallocratic system limited opportunities for women to lead.",
            "sent5": "Living in a phallocratic community, she felt the need to challenge gender norms."
        },
        {
            "definition": "Reflecting or reinforcing traditional gender roles that favor men.",
            "pos": "adjective",
            "sent1": "The phallocratic advertisements perpetuated stereotypes about masculinity.",
            "sent2": "His phallocratic beliefs clashed with her modern views on gender equality.",
            "sent3": "The movie humorously depicted a phallocratic family where the father made all decisions.",
            "sent4": "Her phallocratic upbringing influenced her perception of gender roles.",
            "sent5": "The phallocratic norms in the workplace discouraged women from seeking leadership roles."
        }
    ]
}