{
    "term": "phallocentrism",
    "meanings": [
        {
            "definition": "A focus on the male perspective or experience to the exclusion of others.",
            "pos": "noun",
            "sent1": "In the story, the author's phallocentrism was evident as all the main characters were male.",
            "sent2": "The phallocentrism in the workplace often led to women feeling marginalized and unheard.",
            "sent3": "At the meeting, the phallocentrism was so extreme that even the plants in the room seemed to be male.",
            "sent4": "The phallocentrism in the boardroom was like a giant shadow, casting doubt on the voices of women.",
            "sent5": "Her essay vividly portrayed the impact of phallocentrism on shaping societal norms."
        },
        {
            "definition": "The belief in the superiority of the male gender.",
            "pos": "noun",
            "sent1": "His phallocentrism made him think that men were inherently better leaders than women.",
            "sent2": "The phallocentrism of the ancient society restricted women from holding positions of power.",
            "sent3": "The comedian joked about the absurdity of phallocentrism by pretending to be a male peacock strutting around.",
            "sent4": "The phallocentrism in the sports industry was like a heavy cloak, suffocating the talents of female athletes.",
            "sent5": "The documentary highlighted the damaging effects of phallocentrism on gender equality."
        },
        {
            "definition": "The practice of centering societal norms and values around masculinity.",
            "pos": "noun",
            "sent1": "The phallocentrism in the media often portrays men as strong and emotionless.",
            "sent2": "In some cultures, phallocentrism dictates that men should not show vulnerability.",
            "sent3": "The party theme of 'macho madness' was a humorous take on phallocentrism.",
            "sent4": "The phallocentrism in fashion design limited the range of clothing options for men.",
            "sent5": "The artist's painting symbolized the grip of phallocentrism on shaping societal expectations."
        }
    ]
}