{
    "term": "phantasmal",
    "meanings": [
        {
            "definition": "Of, relating to, or resembling a phantasm; ghostly.",
            "pos": "adjective",
            "sent1": "The dark forest was filled with phantasmal shadows that seemed to move on their own.",
            "sent2": "The old house had a phantasmal aura, making it appear haunted to the townspeople.",
            "sent3": "The children giggled as they told stories of phantasmal creatures hiding in the attic.",
            "sent4": "Her memories of the accident were phantasmal, haunting her dreams every night.",
            "sent5": "The phantasmal mist enveloped the graveyard, creating an eerie atmosphere."
        },
        {
            "definition": "Resembling or characteristic of a phantom; illusory.",
            "pos": "adjective",
            "sent1": "The mirage in the desert was phantasmal, disappearing as they approached.",
            "sent2": "The magician's tricks created a phantasmal effect, leaving the audience in awe.",
            "sent3": "The painting's phantasmal colors seemed to shift and change under different lighting.",
            "sent4": "His hopes for a promotion were phantasmal, fading away as the company faced financial troubles.",
            "sent5": "The phantasmal music played by the street performer captivated the passersby."
        },
        {
            "definition": "A phantasmal figure or apparition.",
            "pos": "noun",
            "sent1": "The ghost story featured a phantasmal specter that haunted the old mansion.",
            "sent2": "The legend spoke of a phantasmal being that roamed the moors at night.",
            "sent3": "The children dressed up as phantasmal creatures for Halloween, scaring their neighbors.",
            "sent4": "In the foggy night, a phantasmal shape appeared at the edge of the forest, sending shivers down their spines.",
            "sent5": "The phantasmal presence in the room made the hairs on the back of her neck stand up."
        }
    ]
}