{
    "term": "pheer",
    "meanings": [
        {
            "definition": "To be afraid of (someone or something)",
            "pos": "verb",
            "sent1": "I pheer the dark forest at night.",
            "sent2": "She pheers spiders more than any other insect.",
            "sent3": "The little boy pheers the monster under his bed.",
            "sent4": "The loud thunder made the dog pheer and hide.",
            "sent5": "As the storm approached, the sailors began to pheer for their safety."
        },
        {
            "definition": "A feeling of fear or anxiety",
            "pos": "noun",
            "sent1": "Her pheer of heights kept her from climbing the ladder.",
            "sent2": "The movie filled him with pheer as the suspense built up.",
            "sent3": "The haunted house was full of fake pheer-inducing props.",
            "sent4": "The pheer in her eyes was evident as she faced the unknown.",
            "sent5": "The eerie silence in the abandoned house sent shivers of pheer down his spine."
        },
        {
            "definition": "To feel fear or anxiety about something",
            "pos": "verb",
            "sent1": "He pheers the upcoming exam because he didn't study enough.",
            "sent2": "She pheers the dentist appointment due to past bad experiences.",
            "sent3": "The cat pheers the vacuum cleaner every time it's turned on.",
            "sent4": "The hiker pheers getting lost in the dense forest.",
            "sent5": "The child pheers the dark closet after watching a scary movie."
        },
        {
            "definition": "A person or thing that causes fear or anxiety",
            "pos": "noun",
            "sent1": "The haunted house was a pheer for all the neighborhood kids.",
            "sent2": "The snake was a pheer to the small animals in the garden.",
            "sent3": "The ghost costume turned out to be more of a funny pheer than a scary one.",
            "sent4": "The unknown noise in the attic became a pheer for the family.",
            "sent5": "The old abandoned mansion was a pheer to the townspeople, who believed it was haunted."
        }
    ]
}