{
    "term": "phenylketonuria",
    "meanings": [
        {
            "definition": "A rare inherited disorder that causes a buildup of the amino acid phenylalanine in the body.",
            "pos": "noun",
            "sent1": "Phenylketonuria can lead to serious health problems if not managed properly.",
            "sent2": "Doctors can test newborns for phenylketonuria to start treatment early.",
            "sent3": "When discussing phenylketonuria, some people may confuse it with other genetic conditions.",
            "sent4": "Living with phenylketonuria is like having to carefully balance a delicate scale every day.",
            "sent5": "The impact of phenylketonuria on the body is significant and requires constant attention."
        },
        {
            "definition": "A metabolic disorder that results in the inability to break down the amino acid phenylalanine.",
            "pos": "noun",
            "sent1": "The symptoms of phenylketonuria can vary from person to person.",
            "sent2": "People with phenylketonuria need to follow a strict diet to manage their condition.",
            "sent3": "Trying to explain phenylketonuria to someone unfamiliar with it can be challenging.",
            "sent4": "Living with phenylketonuria is like having a key that doesn't fit the lock of normal metabolism.",
            "sent5": "The consequences of untreated phenylketonuria can be severe and life-altering."
        },
        {
            "definition": "A genetic condition that affects the body's ability to process phenylalanine.",
            "pos": "noun",
            "sent1": "Genetic counseling can help families understand the risks of phenylketonuria.",
            "sent2": "Individuals with phenylketonuria must monitor their phenylalanine intake carefully.",
            "sent3": "Learning about phenylketonuria can be overwhelming at first, but it gets easier with time.",
            "sent4": "Living with phenylketonuria is like having a faulty gene that disrupts the body's balance.",
            "sent5": "The genetic component of phenylketonuria makes it crucial for family members to get tested."
        }
    ]
}