{
    "term": "phenomenon",
    "meanings": [
        {
            "definition": "A fact or situation that is observed to exist or happen, especially one whose cause or explanation is in question.",
            "pos": "noun",
            "sent1": "The strange phenomenon of lights appearing in the sky puzzled the scientists.",
            "sent2": "The aurora borealis is a natural phenomenon that many people travel to see.",
            "sent3": "The phenomenon of a cat chasing its own tail never fails to entertain.",
            "sent4": "Her sudden burst of laughter was a phenomenon that brightened up the room.",
            "sent5": "The phenomenon of a rainbow after a storm is truly magical.",
            "sent6": "In the forest, the phenomenon of trees swaying in the wind is a common sight.",
            "sent7": "The phenomenon of a baby's first steps is a joyous occasion for the family.",
            "sent8": "The mysterious phenomenon of a disappearing coin always baffles me.",
            "sent9": "The phenomenon of a shooting star streaking across the night sky is a breathtaking sight.",
            "sent10": "The phenomenon of a flower blooming in the desert is a symbol of resilience."
        },
        {
            "definition": "A remarkable person, thing, or event.",
            "pos": "noun",
            "sent1": "Marie Curie was a scientific phenomenon in the field of radioactivity.",
            "sent2": "The Eiffel Tower is a cultural phenomenon that attracts millions of tourists.",
            "sent3": "The phenomenon of a talking parrot always surprises visitors to the zoo.",
            "sent4": "His incredible memory was a phenomenon that amazed his classmates.",
            "sent5": "The phenomenon of a double rainbow is a rare and beautiful sight.",
            "sent6": "The phenomenon of a solar eclipse is a spectacular event to witness.",
            "sent7": "The phenomenon of a child prodigy playing the piano is truly impressive.",
            "sent8": "The phenomenon of a sudden heatwave in winter is quite unusual.",
            "sent9": "The phenomenon of a cat befriending a bird is an unexpected friendship.",
            "sent10": "The phenomenon of a full moon casting a silver glow is mesmerizing."
        }
    ]
}