{
    "term": "phentolamine",
    "meanings": [
        {
            "definition": "A medication used to treat high blood pressure and improve blood flow during surgery.",
            "pos": "noun",
            "sent1": "The doctor prescribed phentolamine to lower the patient's blood pressure.",
            "sent2": "During the surgery, the nurse administered phentolamine to help with blood flow.",
            "sent3": "The phentolamine bottle and the blood pressure machine had a funny conversation in the hospital.",
            "sent4": "The phentolamine worked like a magic wand, making the blood pressure disappear.",
            "sent5": "The vivid red color of the phentolamine bottle reminded the patient of a blooming rose."
        },
        {
            "definition": "To administer phentolamine to a patient before a surgical procedure.",
            "pos": "verb",
            "sent1": "The anesthesiologist will phentolamine the patient before the surgery starts.",
            "sent2": "It is important to phentolamine the patient to ensure a smooth operation.",
            "sent3": "The nurse accidentally phentolamined herself instead of the patient, causing a funny mix-up.",
            "sent4": "The doctor's skilled hands phentolamined the patient's veins with precision.",
            "sent5": "The surgeon phentolamined the patient's arm, making it as numb as a wooden plank."
        },
        {
            "definition": "The chemical compound C17H19N3O.",
            "pos": "noun",
            "sent1": "The scientist studied the structure of phentolamine in the lab.",
            "sent2": "Phentolamine is composed of the elements carbon, hydrogen, nitrogen, and oxygen.",
            "sent3": "The mischievous student spilled phentolamine on the lab table, causing a small explosion.",
            "sent4": "The phentolamine molecule danced under the microscope's lens, revealing its secrets.",
            "sent5": "The unique smell of phentolamine filled the room, reminding everyone of a chemistry lesson."
        }
    ]
}