{
    "term": "pheochromocytomas",
    "meanings": [
        {
            "definition": "A tumor of the adrenal gland that secretes excessive amounts of adrenaline and noradrenaline.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with pheochromocytomas.",
            "sent2": "The pheochromocytomas caused the patient's heart to race uncontrollably.",
            "sent3": "The pheochromocytomas in the adrenal gland decided to throw a party and release too much adrenaline.",
            "sent4": "Her pheochromocytomas were like tiny factories producing too much adrenaline and noradrenaline.",
            "sent5": "The image of pheochromocytomas in the adrenal gland stuck in his mind like a vivid painting."
        },
        {
            "definition": "Pheochromocytomas are typically benign but can cause high blood pressure and other symptoms.",
            "pos": "noun",
            "sent1": "The doctor explained that pheochromocytomas are usually not cancerous.",
            "sent2": "High blood pressure is a common symptom of pheochromocytomas.",
            "sent3": "The mischievous pheochromocytomas played a prank by raising the patient's blood pressure.",
            "sent4": "Her pheochromocytomas were like hidden troublemakers causing high blood pressure.",
            "sent5": "The impact of pheochromocytomas on health was as clear as day, like a bright light shining on the issue."
        },
        {
            "definition": "Surgery is often necessary to remove pheochromocytomas.",
            "pos": "noun",
            "sent1": "The surgeon successfully removed the pheochromocytomas from the adrenal gland.",
            "sent2": "Recovery after surgery for pheochromocytomas can take time.",
            "sent3": "The pheochromocytomas were so stubborn that they required surgery to evict them.",
            "sent4": "Her pheochromocytomas were like unwelcome guests that needed to be surgically removed.",
            "sent5": "The necessity of surgery to remove pheochromocytomas was as clear as the blue sky on a sunny day."
        }
    ]
}