{
    "term": "phlegmatic",
    "meanings": [
        {
            "definition": "Having an unemotional and calm disposition.",
            "pos": "adjective",
            "sent1": "She remained phlegmatic during the stressful situation, never showing any signs of panic.",
            "sent2": "The phlegmatic cat lounged lazily in the sun, unaffected by the hustle and bustle around it.",
            "sent3": "Even when the clown slipped on a banana peel, the phlegmatic audience barely cracked a smile.",
            "sent4": "His phlegmatic demeanor was like a still lake, reflecting no ripples of emotion.",
            "sent5": "The phlegmatic teacher's soothing presence calmed the rowdy students instantly."
        },
        {
            "definition": "A person who is calm and unemotional.",
            "pos": "noun",
            "sent1": "She was known as the phlegmatic of the group, always keeping her cool in any situation.",
            "sent2": "The phlegmatic rarely raised his voice, preferring to handle conflicts with quiet diplomacy.",
            "sent3": "The phlegmatic at the party was content to sit quietly in the corner, observing the festivities.",
            "sent4": "In the chaos of the emergency room, the phlegmatic nurse was a beacon of calm professionalism.",
            "sent5": "The phlegmatic leader's steady demeanor inspired confidence in the team during challenging times."
        },
        {
            "definition": "Showing little emotion or interest.",
            "pos": "adjective",
            "sent1": "His phlegmatic response to the exciting news puzzled his friends, who expected more enthusiasm.",
            "sent2": "The phlegmatic receptionist greeted each visitor with a polite but distant smile.",
            "sent3": "The phlegmatic cat watched the bird outside with mild curiosity but made no move to chase it.",
            "sent4": "The phlegmatic landscape stretched out before them, its vastness evoking a sense of quiet emptiness.",
            "sent5": "Her phlegmatic expression revealed nothing of her true feelings, leaving others guessing."
        }
    ]
}