{
    "term": "phoenixlike",
    "meanings": [
        {
            "definition": "Resembling a phoenix in characteristics or qualities.",
            "pos": "adjective",
            "sent1": "The colorful bird had a phoenixlike appearance with its vibrant feathers.",
            "sent2": "Her majestic and phoenixlike presence captivated everyone in the room.",
            "sent3": "The cake, rising from the oven, looked phoenixlike with its golden crust.",
            "sent4": "The old building, after renovation, emerged phoenixlike from its previous state of disrepair.",
            "sent5": "The sunset painted the sky in a phoenixlike array of colors, breathtaking to behold."
        },
        {
            "definition": "In a manner reminiscent of a phoenix.",
            "pos": "adverb",
            "sent1": "She soared phoenixlike through the sky, graceful and powerful.",
            "sent2": "The firework exploded phoenixlike, lighting up the night with brilliance.",
            "sent3": "The dancer moved phoenixlike across the stage, captivating the audience with her movements.",
            "sent4": "The music crescendoed phoenixlike, filling the concert hall with energy and emotion.",
            "sent5": "The athlete leaped phoenixlike over the hurdle, clearing it with ease and agility."
        },
        {
            "definition": "Having the qualities or characteristics of a phoenix.",
            "pos": "adjective",
            "sent1": "The ancient tale had a phoenixlike theme of rebirth and renewal.",
            "sent2": "His phoenixlike resilience in the face of adversity inspired those around him.",
            "sent3": "The garden bloomed with phoenixlike flowers, vibrant and resilient.",
            "sent4": "The company showed phoenixlike growth, rising from the ashes of bankruptcy.",
            "sent5": "The mountain range stood tall and phoenixlike against the horizon, majestic and enduring."
        }
    ]
}