{
    "term": "phonier",
    "meanings": [
        {
            "definition": "Not genuine or real; counterfeit.",
            "pos": "adjective",
            "sent1": "The fake designer bag was even phonier than the imitation watch.",
            "sent2": "Her smile seemed phonier than usual, making others question her sincerity.",
            "sent3": "The actor's attempt to cry on cue came off as even phonier than his fake tears.",
            "sent4": "The politician's promises sounded phonier than a three-dollar bill.",
            "sent5": "The forged signature on the document was so phonier that it was immediately detected."
        },
        {
            "definition": "Pretending to be something one is not; insincere.",
            "pos": "adjective",
            "sent1": "His phonier attempt to fit in with the cool kids only made him seem more out of place.",
            "sent2": "The salesperson's phonier smile didn't fool anyone into buying the overpriced product.",
            "sent3": "The cat's phonier attempt at innocence after knocking over the vase was comically transparent.",
            "sent4": "Her phonier accent slipped through when she got nervous, revealing her true origins.",
            "sent5": "The student's phonier excuse for not doing homework was met with skepticism by the teacher."
        },
        {
            "definition": "Lacking authenticity or sincerity.",
            "pos": "adjective",
            "sent1": "The singer's phonier performance failed to move the audience like her genuine ones did.",
            "sent2": "His phonier apology rang hollow, lacking any true remorse.",
            "sent3": "The chef's phonier smile couldn't hide the fact that the dish was a disaster.",
            "sent4": "The politician's phonier charm was no match for his opponent's genuine charisma.",
            "sent5": "The friendship felt phonier than a plastic flower, lacking any real connection."
        }
    ]
}