{
    "term": "phonocardiography",
    "meanings": [
        {
            "definition": "The process of recording and analyzing the sounds produced by the heart, typically using a microphone and amplifier.",
            "pos": "noun",
            "sent1": "During phonocardiography, the doctor listened to the heart sounds with a special device.",
            "sent2": "The hospital uses phonocardiography to check for any irregularities in heartbeats.",
            "sent3": "The students found a way to turn phonocardiography into a fun science experiment.",
            "sent4": "Her love for music was like phonocardiography, always listening for the rhythm of life.",
            "sent5": "The phonocardiography results were as clear as a bell, showing a healthy heart."
        },
        {
            "definition": "The study or practice of phonocardiography.",
            "pos": "noun",
            "sent1": "In her classes, she learned about the importance of phonocardiography in healthcare.",
            "sent2": "Many medical students choose to specialize in phonocardiography for their careers.",
            "sent3": "The research team's dedication to phonocardiography led to groundbreaking discoveries.",
            "sent4": "His dedication to phonocardiography was like a compass guiding him through the medical field.",
            "sent5": "The professor's passion for phonocardiography was contagious, inspiring all his students."
        },
        {
            "definition": "A phonocardiogram, a visual representation of the sounds produced by the heart.",
            "pos": "noun",
            "sent1": "The doctor showed the patient the phonocardiography of their heartbeat on the screen.",
            "sent2": "The technician carefully analyzed the phonocardiography to detect any abnormalities.",
            "sent3": "The artist used the concept of phonocardiography to create a unique piece of art.",
            "sent4": "The phonocardiography resembled a musical score, capturing the heart's symphony.",
            "sent5": "The beauty of the phonocardiography was like a painting, each beat a brushstroke on the canvas."
        }
    ]
}