{
    "term": "photocoagulations",
    "meanings": [
        {
            "definition": "The process of using light to coagulate or clot blood vessels.",
            "pos": "noun",
            "sent1": "During the photocoagulations, the light helps stop bleeding.",
            "sent2": "Doctors performed photocoagulations to stop the bleeding in the patient's vessels.",
            "sent3": "The photocoagulations were like a superhero stopping the blood from flowing too much.",
            "sent4": "Her precision in photocoagulations was like a skilled archer hitting the target every time.",
            "sent5": "The photocoagulations were as effective as turning off a faucet to stop the blood flow."
        },
        {
            "definition": "The act of using a laser to treat certain eye conditions by sealing off leaking blood vessels.",
            "pos": "noun",
            "sent1": "The doctor recommended photocoagulations to seal the leaking vessels in the eye.",
            "sent2": "Photocoagulations are commonly used to treat eye conditions by sealing off leaking vessels.",
            "sent3": "The photocoagulations in the eye were like fixing a leaky pipe.",
            "sent4": "Her skill in performing photocoagulations was like a magician fixing a broken wand.",
            "sent5": "The photocoagulations made the leaking vessels disappear like magic tricks."
        },
        {
            "definition": "The result of using a focused beam of light to cauterize tissue.",
            "pos": "noun",
            "sent1": "After the photocoagulations, the tissue was sealed and healed.",
            "sent2": "The photocoagulations successfully cauterized the tissue, stopping the bleeding.",
            "sent3": "The photocoagulations on the tissue were like putting a bandage on a wound.",
            "sent4": "His precision in photocoagulations was like a surgeon's steady hand during surgery.",
            "sent5": "The photocoagulations left the tissue as clean and sealed as a freshly wrapped gift."
        }
    ]
}