{
    "term": "phototherapy",
    "meanings": [
        {
            "definition": "Treatment of medical conditions using light",
            "pos": "noun",
            "sent1": "Phototherapy can help heal certain illnesses by using light.",
            "sent2": "Doctors often recommend phototherapy to treat various medical conditions.",
            "sent3": "The patient joked that their prescription for phototherapy was like getting a dose of sunshine in a bottle.",
            "sent4": "To the skin, phototherapy is like a warm hug from the sun, soothing and healing.",
            "sent5": "The concept of phototherapy is like a bright beacon of hope in the world of medicine."
        },
        {
            "definition": "The use of light to treat skin disorders",
            "pos": "noun",
            "sent1": "Phototherapy is effective in treating skin issues with light exposure.",
            "sent2": "Dermatologists often recommend phototherapy for various skin disorders.",
            "sent3": "The idea of using phototherapy to clear acne seemed like a bright solution.",
            "sent4": "For skin problems, phototherapy acts like a gentle healer, calming and rejuvenating.",
            "sent5": "The power of phototherapy on skin disorders is like a magic wand, bringing clarity and healing."
        },
        {
            "definition": "Therapy involving exposure to light, especially ultraviolet light",
            "pos": "noun",
            "sent1": "Phototherapy includes treatments that expose the body to light, especially UV light.",
            "sent2": "Some people find relief from certain conditions through phototherapy sessions.",
            "sent3": "The idea of phototherapy as a light bath made the patient chuckle.",
            "sent4": "In the world of therapy, phototherapy shines like a bright star, guiding towards wellness.",
            "sent5": "The experience of phototherapy is like being wrapped in a warm blanket of healing light."
        }
    ]
}