{
    "term": "photocells",
    "meanings": [
        {
            "definition": "A device that converts light into electrical energy.",
            "pos": "noun",
            "sent1": "The photocells on the solar panel capture sunlight to produce electricity.",
            "sent2": "The security lights in the garden are equipped with photocells to turn on automatically at night.",
            "sent3": "The mischievous squirrel thought the photocells were tiny magic boxes that made the lights come on.",
            "sent4": "Her smile was like the photocells, absorbing all the brightness around her and radiating warmth.",
            "sent5": "The photocells hummed softly as they transformed the sun's rays into power for the house."
        },
        {
            "definition": "A type of sensor that detects light and triggers a response.",
            "pos": "noun",
            "sent1": "The automatic doors at the store rely on photocells to open when someone approaches.",
            "sent2": "The streetlights use photocells to adjust their brightness based on the amount of natural light.",
            "sent3": "The mischievous cat kept playing with the photocells, setting off the alarm every time.",
            "sent4": "Her intuition was like the photocells, always sensing the slightest changes in the environment.",
            "sent5": "The photocells blinked rapidly, signaling the system to activate the cooling fans."
        },
        {
            "definition": "Cells that generate electricity when exposed to light.",
            "pos": "noun",
            "sent1": "The small calculator operates using tiny photocells that convert light into power.",
            "sent2": "The garden decorations are powered by photocells that charge during the day and light up at night.",
            "sent3": "The mischievous child thought the photocells were secret buttons that made the toys move.",
            "sent4": "Her creativity sparkled like the photocells, turning ordinary ideas into brilliant innovations.",
            "sent5": "The photocells gleamed brightly as they transformed sunlight into energy for the remote cabin."
        }
    ]
}