{
    "term": "photoreceptive",
    "meanings": [
        {
            "definition": "Responsive to light.",
            "pos": "adjective",
            "sent1": "The photoreceptive cells in the eye help us see in bright sunlight.",
            "sent2": "Cats have photoreceptive eyes that allow them to see in the dark.",
            "sent3": "The photoreceptive plants in the garden seemed to glow under the moonlight.",
            "sent4": "Her photoreceptive skin turned a shade lighter when exposed to the sun for too long.",
            "sent5": "The photoreceptive camera adjusted its settings automatically in the changing light conditions."
        },
        {
            "definition": "Capable of detecting or responding to light.",
            "pos": "adjective",
            "sent1": "Some animals have photoreceptive cells that help them navigate in the dark.",
            "sent2": "The photoreceptive sensors in the room turned the lights on as soon as it got dark.",
            "sent3": "The photoreceptive robot mistook a flashlight for a signal to start dancing.",
            "sent4": "His photoreceptive instincts guided him safely through the dimly lit forest.",
            "sent5": "The photoreceptive device automatically adjusted the screen brightness based on ambient light."
        },
        {
            "definition": "Having the ability to sense or perceive light.",
            "pos": "adjective",
            "sent1": "The photoreceptive cells in the skin help regulate vitamin D production.",
            "sent2": "Certain insects are photoreceptive and can detect changes in light for survival.",
            "sent3": "The photoreceptive flowers bloomed only when the sun touched their petals.",
            "sent4": "His photoreceptive intuition told him a storm was coming long before the sky darkened.",
            "sent5": "The photoreceptive technology mimicked the human eye's ability to adjust to different light levels."
        }
    ]
}