{
    "term": "photokinesis",
    "meanings": [
        {
            "definition": "The movement or response of an organism to light.",
            "pos": "noun",
            "sent1": "Photokinesis is when a plant turns its leaves towards the sunlight.",
            "sent2": "The moth's photokinesis led it to fly towards the bright porch light.",
            "sent3": "The photokinesis of the sunflower made it look like it was dancing in the sun.",
            "sent4": "Her photokinesis was like a magnet pulling her towards the glowing lantern.",
            "sent5": "The firefly's photokinesis created a mesmerizing light show in the dark garden."
        },
        {
            "definition": "The ability of an organism to move towards or away from light.",
            "pos": "noun",
            "sent1": "The fish's photokinesis allowed it to swim deeper to avoid the bright sunlight.",
            "sent2": "Photokinesis helps plants grow towards the sunlight for photosynthesis.",
            "sent3": "The photokinesis of the cat made it chase after the laser pointer.",
            "sent4": "Her photokinesis was like a compass guiding her away from the blinding glare.",
            "sent5": "The bird's photokinesis helped it find the perfect spot to bask in the warm sun rays."
        },
        {
            "definition": "The process by which an organism changes its position or orientation in response to light stimuli.",
            "pos": "noun",
            "sent1": "Photokinesis is crucial for plants to adjust their growth towards the light source.",
            "sent2": "The beetle's photokinesis allowed it to navigate through the dark forest using moonlight.",
            "sent3": "The photokinesis of the scarecrow made it turn its face towards the setting sun.",
            "sent4": "Her photokinesis was like a clockwork mechanism responding to the changing daylight.",
            "sent5": "The plant's photokinesis was so efficient that it always faced the brightest corner of the room."
        }
    ]
}