{
    "term": "photopias",
    "meanings": [
        {
            "definition": "The condition of seeing light or colors in a distorted manner.",
            "pos": "noun",
            "sent1": "Her photopias made the world look like a colorful kaleidoscope.",
            "sent2": "The doctor diagnosed her with photopias after she complained of seeing flashing lights.",
            "sent3": "During the art show, his photopias made the paintings appear as if they were moving.",
            "sent4": "The city at night was a symphony of photopias, with lights dancing in the darkness.",
            "sent5": "His photopias transformed the mundane streetlights into a magical light show."
        },
        {
            "definition": "A visual disturbance in which bright lights appear to have a halo or starburst effect.",
            "pos": "noun",
            "sent1": "The headlights of the car had a photopias effect, making it hard to see clearly.",
            "sent2": "She experienced photopias while looking at the streetlights on a foggy night.",
            "sent3": "The photopias from the street lamps made it seem like the city was under a celestial spell.",
            "sent4": "The fireworks in the sky created a dazzling photopias display for the crowd.",
            "sent5": "The camera captured the photopias of the cityscape, turning ordinary lights into radiant stars."
        },
        {
            "definition": "The perception of light in a way that differs from normal vision.",
            "pos": "noun",
            "sent1": "His photopias caused him to see rainbows even on cloudy days.",
            "sent2": "The optometrist explained that her photopias were due to a rare eye condition.",
            "sent3": "The artist's photopias inspired a series of paintings depicting surreal light patterns.",
            "sent4": "In his dreams, he wandered through a world filled with fantastical photopias.",
            "sent5": "The forest at dusk was a realm of mysterious photopias, where shadows danced with light."
        }
    ]
}