{
    "term": "phthisics",
    "meanings": [
        {
            "definition": "A wasting or consumption of the body; a wasting disease.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with phthisics after observing the severe weight loss.",
            "sent2": "Phthisics was a common ailment in the past when medical knowledge was limited.",
            "sent3": "Despite his best efforts, the diet plan seemed to be promoting phthisics rather than health.",
            "sent4": "The relentless illness gnawed at her body like a silent predator, a true phthisics.",
            "sent5": "The image of phthisics haunted the village, a specter of frailty and decline."
        },
        {
            "definition": "A person suffering from phthisis.",
            "pos": "noun",
            "sent1": "The hospital ward was filled with phthisics seeking treatment for their condition.",
            "sent2": "She dedicated her life to caring for phthisics, offering comfort and support.",
            "sent3": "The group of phthisics formed a support network, sharing stories and laughter.",
            "sent4": "In the crowded city, the phthisics were like forgotten shadows, unseen and unheard.",
            "sent5": "The community rallied together to raise funds for the phthisics in need, showing compassion and solidarity."
        },
        {
            "definition": "The study or treatment of phthisis.",
            "pos": "noun",
            "sent1": "The medical students focused on phthisics during their research project.",
            "sent2": "The hospital specialized in the study and treatment of phthisics, offering hope to many.",
            "sent3": "The professor's passion for phthisics was evident in every lecture, inspiring his students.",
            "sent4": "In the field of phthisics, new breakthroughs were constantly being made, pushing the boundaries of medicine.",
            "sent5": "The dedication of the researchers shone through in their relentless pursuit of knowledge in phthisics."
        }
    ]
}