{
    "term": "phthisic",
    "meanings": [
        {
            "definition": "A wasting or consumptive disease, especially pulmonary tuberculosis.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with phthisic after observing severe weight loss and coughing.",
            "sent2": "In the 19th century, many people succumbed to phthisic due to poor living conditions.",
            "sent3": "Despite his phthisic, the comedian managed to keep the audience laughing with his jokes.",
            "sent4": "The phthisic of poverty slowly ate away at the once prosperous town.",
            "sent5": "The haunting image of the phthisic patient stayed with the nurse long after her shift ended."
        },
        {
            "definition": "A person suffering from phthisis.",
            "pos": "noun",
            "sent1": "The hospital ward was filled with phthisics seeking treatment for their condition.",
            "sent2": "The phthisic was advised to rest and follow the prescribed medication.",
            "sent3": "Despite being a phthisic, she always had a smile on her face, brightening up the room.",
            "sent4": "The phthisic's determination to fight the disease inspired those around him.",
            "sent5": "The community came together to support the phthisic in their time of need."
        },
        {
            "definition": "Of or relating to phthisis.",
            "pos": "adjective",
            "sent1": "The doctor specialized in phthisic treatments, focusing on lung health.",
            "sent2": "The phthisic symptoms were evident in the patient's medical records.",
            "sent3": "The phthisic medication had a distinct smell that reminded him of childhood memories.",
            "sent4": "Her love for fresh air stemmed from her phthisic upbringing in the countryside.",
            "sent5": "The phthisic ward was painted in calming colors to create a soothing environment for patients."
        }
    ]
}