{
    "term": "phytohemagglutinins",
    "meanings": [
        {
            "definition": "A type of protein found in plants that can agglutinate red blood cells.",
            "pos": "noun",
            "sent1": "The phytohemagglutinins in the plant caused the red blood cells to clump together.",
            "sent2": "Scientists are studying the effects of phytohemagglutinins on blood cells.",
            "sent3": "The phytohemagglutinins in the salad decided to have a party and invited all the red blood cells.",
            "sent4": "The phytohemagglutinins acted like magnets, pulling the red blood cells closer together.",
            "sent5": "The teacher used a model to demonstrate how phytohemagglutinins bind red blood cells."
        },
        {
            "definition": "Proteins in plants that can cause clumping of red blood cells.",
            "pos": "noun",
            "sent1": "Avoiding foods high in phytohemagglutinins can help prevent blood cell clumping.",
            "sent2": "The doctor explained the potential risks associated with consuming phytohemagglutinins.",
            "sent3": "The phytohemagglutinins in the smoothie decided to stick together and form a dance group.",
            "sent4": "The phytohemagglutinins were like puzzle pieces fitting perfectly to clump the red blood cells.",
            "sent5": "The textbook illustrated how phytohemagglutinins interact with red blood cells."
        },
        {
            "definition": "Plant proteins that can agglutinate red blood cells.",
            "pos": "noun",
            "sent1": "The salad contained phytohemagglutinins that affected the blood cells' behavior.",
            "sent2": "Researchers are investigating the role of phytohemagglutinins in plant defense mechanisms.",
            "sent3": "The phytohemagglutinins in the garden were known for their ability to bring red blood cells together for a chat.",
            "sent4": "The phytohemagglutinins functioned like glue, sticking the red blood cells in place.",
            "sent5": "The students conducted an experiment to observe how phytohemagglutinins interact with red blood cells."
        }
    ]
}