{
    "term": "pibals",
    "meanings": [
        {
            "definition": "A small, round fruit with a thin skin and juicy flesh.",
            "pos": "noun",
            "sent1": "I picked some pibals from the tree for a snack.",
            "sent2": "The market was selling fresh pibals at a low price.",
            "sent3": "The pibals rolled off the table and onto the floor, making a mess.",
            "sent4": "Her cheeks were like ripe pibals, glowing with health.",
            "sent5": "The pibals burst with flavor in my mouth, making me smile."
        },
        {
            "definition": "To throw or hit something with force.",
            "pos": "verb",
            "sent1": "He pibals the ball across the field with great strength.",
            "sent2": "Kids love to pibals stones into the pond and watch the ripples.",
            "sent3": "She accidentally pibals the remote control into the air while gesturing.",
            "sent4": "The storm winds pibals branches against the windows all night.",
            "sent5": "The chef expertly pibals the dough to make the perfect pizza crust."
        },
        {
            "definition": "A device used for measuring pressure in a fluid.",
            "pos": "noun",
            "sent1": "The scientist used a pibals to check the pressure in the experiment.",
            "sent2": "The mechanic relied on the pibals to diagnose the issue with the engine.",
            "sent3": "The pibals beeped loudly when the pressure reached a dangerous level.",
            "sent4": "The diver's pibals showed a sudden increase in water pressure.",
            "sent5": "The nurse checked the patient's IV drip using the pibals to ensure accuracy."
        },
        {
            "definition": "A slang term for a person's face.",
            "pos": "noun",
            "sent1": "He had a big smile on his pibals when he saw the surprise.",
            "sent2": "She gently kissed the baby's soft pibals.",
            "sent3": "The comedian made a funny face, scrunching up his pibals.",
            "sent4": "Her pibals lit up with joy when she saw her favorite dessert.",
            "sent5": "The actor's expressive pibals conveyed a range of emotions in the scene."
        }
    ]
}