{
    "term": "pibal",
    "meanings": [
        {
            "definition": "A small balloon released into the atmosphere to measure wind speed and direction.",
            "pos": "noun",
            "sent1": "The pibal floated gracefully in the sky, helping scientists understand the wind.",
            "sent2": "Meteorologists use a pibal to study how the air moves above us.",
            "sent3": "The mischievous squirrel mistook the pibal for a tasty treat and tried to nibble on it.",
            "sent4": "The pibal danced in the air like a tiny ballerina, twirling with the wind's rhythm.",
            "sent5": "As the pibal soared higher, it whispered secrets of the sky to the watching researchers."
        },
        {
            "definition": "A device used in meteorology to track the movement of air currents.",
            "pos": "noun",
            "sent1": "The pibal device beeped softly as it recorded the air's journey through the atmosphere.",
            "sent2": "Scientists rely on the pibal to map out the invisible paths of the wind.",
            "sent3": "During the experiment, the curious cat batted at the pibal device, trying to understand its purpose.",
            "sent4": "The pibal device acted as a silent detective, uncovering the secrets of the air's travels.",
            "sent5": "With the pibal device in hand, meteorologists could decode the language of the wind."
        },
        {
            "definition": "The act of releasing a pibal for meteorological purposes.",
            "pos": "noun",
            "sent1": "Before the launch, the team prepared for the pibal with precision and care.",
            "sent2": "The pibal release marked the beginning of the meteorological data collection.",
            "sent3": "As the pibal soared into the sky, it waved goodbye to the scientists below.",
            "sent4": "The pibal release felt like sending a messenger to the winds, carrying messages of the atmosphere.",
            "sent5": "With a gentle push, the pibal embarked on its mission to unravel the mysteries of the air."
        }
    ]
}