{
    "term": "picarooned",
    "meanings": [
        {
            "definition": "To be stranded or marooned on a deserted island.",
            "pos": "verb",
            "sent1": "After the shipwreck, the sailor found himself picarooned on the sandy shore.",
            "sent2": "The adventurers were picarooned on the remote island after their boat drifted away.",
            "sent3": "The idea of being picarooned on an island sounded like a thrilling adventure in books.",
            "sent4": "Her heart felt picarooned on the island of loneliness, with no one to share her thoughts.",
            "sent5": "The image of being picarooned on the island was etched in his mind like a vivid painting."
        },
        {
            "definition": "A person who has been abandoned or left behind.",
            "pos": "noun",
            "sent1": "The picarooned child sat alone on the playground, waiting for someone to pick him up.",
            "sent2": "The old dog, a picarooned creature, wandered the streets looking for a home.",
            "sent3": "The picarooned kitten meowed sadly outside the closed door, hoping to be let in.",
            "sent4": "She felt like a picarooned soul in the bustling city, unnoticed and forgotten by all.",
            "sent5": "The picarooned man's eyes held a silent plea for companionship and understanding."
        },
        {
            "definition": "To be left in a difficult or dangerous situation.",
            "pos": "verb",
            "sent1": "Without a map or supplies, they were picarooned in the middle of the dense forest.",
            "sent2": "The hikers were picarooned at the edge of the cliff, unable to move forward or back.",
            "sent3": "The car broke down, leaving them picarooned on the deserted road under the scorching sun.",
            "sent4": "Her mind felt picarooned in a maze of confusing thoughts, unable to find a way out.",
            "sent5": "The storm picarooned the small boat in the raging sea, tossing it like a leaf in the wind."
        }
    ]
}