{
    "term": "picket",
    "meanings": [
        {
            "definition": "A pointed stake or post driven into the ground to form a fence.",
            "pos": "noun",
            "sent1": "The farmer used a picket to mark the boundary of his land.",
            "sent2": "The wooden picket fence surrounded the garden beautifully.",
            "sent3": "The mischievous squirrel balanced on the picket, pretending it was a tightrope.",
            "sent4": "Her determination was like a picket, firmly holding her beliefs in place.",
            "sent5": "The picket stood tall, guarding the flowers from any harm."
        },
        {
            "definition": "A person or group of people stationed outside a workplace or other location as part of a strike or protest.",
            "pos": "noun",
            "sent1": "The picket outside the factory chanted slogans for fair wages.",
            "sent2": "The picket peacefully demonstrated for better working conditions.",
            "sent3": "The picket shared jokes to keep spirits high during the protest.",
            "sent4": "Their unity on the picket line was a powerful symbol of solidarity.",
            "sent5": "The picket's determination inspired others to join the cause."
        },
        {
            "definition": "To stand or march outside a location as part of a strike or protest.",
            "pos": "verb",
            "sent1": "They decided to picket in front of the city hall to demand change.",
            "sent2": "The workers picketed peacefully, holding signs for their rights.",
            "sent3": "The students picketed in a circle, singing songs of unity.",
            "sent4": "Her heart picketed against the unfair treatment of animals.",
            "sent5": "The community picketed together, raising their voices for justice."
        },
        {
            "definition": "To fasten or decorate with pickets.",
            "pos": "verb",
            "sent1": "She wanted to picket the garden gate with colorful ribbons.",
            "sent2": "The children picketed the treehouse with handmade signs.",
            "sent3": "The artist picketed the canvas with bold strokes of paint.",
            "sent4": "His love for her was picketed with memories of their adventures.",
            "sent5": "The house was picketed with twinkling lights for the festive season."
        }
    ]
}