{
    "term": "picked",
    "meanings": [
        {
            "definition": "To select or choose from a group",
            "pos": "verb",
            "sent1": "She picked a red apple from the tree.",
            "sent2": "The team captain picked the best player for the match.",
            "sent3": "The little girl picked her favorite toy from the shelf.",
            "sent4": "He picked the winning lottery numbers from the list.",
            "sent5": "The chef carefully picked the freshest ingredients for the dish."
        },
        {
            "definition": "To remove something with one's fingers or a tool",
            "pos": "verb",
            "sent1": "He picked the splinter from his finger.",
            "sent2": "She picked the flower petals off the stem.",
            "sent3": "The monkey picked the bugs off its fur.",
            "sent4": "The detective picked the lock to enter the room.",
            "sent5": "The gardener picked the weeds from the flower bed."
        },
        {
            "definition": "To pluck or gather by hand",
            "pos": "verb",
            "sent1": "She picked a daisy from the field.",
            "sent2": "He picked the grapes from the vine.",
            "sent3": "The child picked seashells along the shore.",
            "sent4": "The farmer picked fresh vegetables from the garden.",
            "sent5": "The hiker picked wild berries from the bushes."
        },
        {
            "definition": "To clean or prepare by removing unwanted items",
            "pos": "verb",
            "sent1": "She picked the bones from the fish before cooking.",
            "sent2": "He picked the leaves from the salad.",
            "sent3": "The tailor picked the loose threads from the fabric.",
            "sent4": "The artist picked the imperfections from the sculpture.",
            "sent5": "The teacher picked the incorrect answers from the test."
        },
        {
            "definition": "To steal or take without permission",
            "pos": "verb",
            "sent1": "The thief picked the wallet from the unsuspecting victim.",
            "sent2": "She picked the idea from her colleague without credit.",
            "sent3": "He picked the cookies from the jar when no one was looking.",
            "sent4": "The bird picked the shiny object from the ground for its nest.",
            "sent5": "The bully picked the lunch money from the younger student."
        }
    ]
}