{
    "term": "pickup",
    "meanings": [
        {
            "definition": "The act of lifting or gathering something up.",
            "pos": "noun",
            "sent1": "I helped my friend with the pickup of his heavy boxes.",
            "sent2": "The pickup of toys from the floor made the room look tidy.",
            "sent3": "The pickup of fallen leaves turned into a fun game for the kids.",
            "sent4": "Her quick pickup of the situation saved the day.",
            "sent5": "The pickup of shells along the beach was a delightful activity."
        },
        {
            "definition": "A small truck with an open bed for transporting goods.",
            "pos": "noun",
            "sent1": "The farmer used his pickup to carry the harvested crops.",
            "sent2": "We loaded the furniture onto the pickup for moving.",
            "sent3": "The pickup was so full of pumpkins, it looked like a giant orange basket.",
            "sent4": "The pickup roared down the road, carrying supplies for the camp.",
            "sent5": "The pickup's engine hummed as it transported the tools to the construction site."
        },
        {
            "definition": "A casual sexual encounter or relationship.",
            "pos": "noun",
            "sent1": "She regretted the pickup at the party last night.",
            "sent2": "Their pickup at the bar led to a brief romance.",
            "sent3": "The pickup at the office holiday party was the talk of the town.",
            "sent4": "His pickup line was so cheesy, it made everyone laugh.",
            "sent5": "The pickup between the characters added an unexpected twist to the story."
        },
        {
            "definition": "A device that converts sound waves into electrical signals in a musical instrument.",
            "pos": "noun",
            "sent1": "The musician adjusted the pickup on his guitar for better sound quality.",
            "sent2": "The pickup on the electric keyboard enhanced the music performance.",
            "sent3": "The pickup on the violin malfunctioned during the concert, creating a funny sound.",
            "sent4": "Her new guitar had a pickup that produced a unique tone.",
            "sent5": "The pickup on the microphone captured every note of the singer's voice."
        }
    ]
}