{
    "term": "pick",
    "meanings": [
        {
            "definition": "To select or choose from a group",
            "pos": "verb",
            "sent1": "I will pick a book to read from the library.",
            "sent2": "She likes to pick her favorite color from the crayon box.",
            "sent3": "Let's pick a movie for movie night!",
            "sent4": "He will pick the best candidate for the job.",
            "sent5": "The teacher will pick a student to answer the question."
        },
        {
            "definition": "A tool with a long handle and a pointed end, used for breaking up hard ground or rock",
            "pos": "noun",
            "sent1": "The farmer used a pick to break the hard soil.",
            "sent2": "The miner carried a pick to dig for precious stones.",
            "sent3": "The pick made the tough job of digging easier.",
            "sent4": "The pick struck the rock with a loud clang.",
            "sent5": "The pick was essential for breaking the large boulder."
        },
        {
            "definition": "To pluck or gather with the fingers",
            "pos": "verb",
            "sent1": "She will pick the ripe apples from the tree.",
            "sent2": "He likes to pick flowers from the garden.",
            "sent3": "Let's pick some berries for our dessert!",
            "sent4": "The children will pick daisies in the field.",
            "sent5": "The chef will pick fresh herbs for the dish."
        },
        {
            "definition": "A small tool with a sharp point, used for removing small items or cleaning small spaces",
            "pos": "noun",
            "sent1": "The seamstress used a pick to remove the loose threads.",
            "sent2": "The dentist used a pick to clean between the teeth.",
            "sent3": "The pick helped in getting out the tiny splinter.",
            "sent4": "The artist used a pick to create intricate designs.",
            "sent5": "The mechanic used a pick to unclog the tiny hole."
        }
    ]
}