{
    "term": "pickled",
    "meanings": [
        {
            "definition": "Preserved in vinegar or brine",
            "pos": "adjective",
            "sent1": "The pickled cucumbers added a tangy flavor to the sandwich.",
            "sent2": "I enjoy eating pickled vegetables with my meals.",
            "sent3": "The pickled onions danced on my taste buds with excitement.",
            "sent4": "Her pickled sense of humor always brought a smile to my face.",
            "sent5": "The pickled peppers sparkled like jewels in the jar."
        },
        {
            "definition": "Drunk or intoxicated",
            "pos": "adjective",
            "sent1": "After too many drinks, he stumbled around, feeling pickled.",
            "sent2": "She regretted getting pickled at the party last night.",
            "sent3": "The pickled party guests laughed loudly at everything.",
            "sent4": "The pickled revelers sang off-key but with enthusiasm.",
            "sent5": "The pickled friends shared stories and giggled uncontrollably."
        },
        {
            "definition": "To preserve in vinegar or brine",
            "pos": "verb",
            "sent1": "She learned how to pickle cucumbers from her grandmother.",
            "sent2": "The chef decided to pickle the excess vegetables for later use.",
            "sent3": "He accidentally pickled his socks in the laundry with vinegar.",
            "sent4": "The tradition of pickling fruits has been passed down for generations.",
            "sent5": "The pickled eggs sat in the jar, waiting to be enjoyed."
        },
        {
            "definition": "To choose or select from a group",
            "pos": "verb",
            "sent1": "I will pickled the best apples for the pie.",
            "sent2": "She carefully pickled the ripest tomatoes from the garden.",
            "sent3": "He always seemed to pickled the most interesting books to read.",
            "sent4": "The coach will pickled the players for the upcoming match.",
            "sent5": "The teacher asked the students to pickled a partner for the project."
        }
    ]
}