{
    "term": "picker",
    "meanings": [
        {
            "definition": "One who picks or gathers",
            "pos": "noun",
            "sent1": "The apple picker collected ripe fruits from the tree.",
            "sent2": "The berry picker filled her basket with fresh berries.",
            "sent3": "The flower picker accidentally picked a dandelion instead of a rose.",
            "sent4": "The picker of seashells carefully selected the most colorful ones.",
            "sent5": "The mushroom picker knew exactly which ones were safe to gather."
        },
        {
            "definition": "A tool or device used for picking or selecting",
            "pos": "noun",
            "sent1": "The fruit picker helped reach the apples at the top of the tree.",
            "sent2": "The guitar picker carefully plucked the strings to create music.",
            "sent3": "The salad picker made it easy to choose the freshest vegetables.",
            "sent4": "The color picker on the computer screen allowed for precise selection.",
            "sent5": "The toothpick was a handy little picker for removing food stuck between teeth."
        },
        {
            "definition": "A machine or device used for picking or harvesting",
            "pos": "noun",
            "sent1": "The berry picker machine quickly gathered all the ripe fruits.",
            "sent2": "The cotton picker efficiently harvested the fields.",
            "sent3": "The apple picker device made picking apples much faster.",
            "sent4": "The mechanical picker sorted through the produce with ease.",
            "sent5": "The automated picker saved a lot of time during the harvest season."
        },
        {
            "definition": "A person who selects or chooses from a group",
            "pos": "noun",
            "sent1": "The team captain was the picker for the game lineup.",
            "sent2": "The book club picker chose the next novel for discussion.",
            "sent3": "The movie night picker always selected the best films to watch.",
            "sent4": "The menu picker had the difficult task of choosing dishes for the event.",
            "sent5": "The color picker for the paint samples helped decide on the perfect shade."
        }
    ]
}