{
    "term": "piddling",
    "meanings": [
        {
            "definition": "Trivial or insignificant in amount",
            "pos": "adjective",
            "sent1": "The piddling amount of candy left in the jar was not enough to satisfy anyone.",
            "sent2": "She dismissed his piddling excuses and demanded a proper explanation.",
            "sent3": "The piddling argument over who gets the last cookie was resolved with a game of rock-paper-scissors.",
            "sent4": "His piddling attempts at fixing the leaky faucet only made the situation worse.",
            "sent5": "The piddling stars in the sky were overshadowed by the bright full moon."
        },
        {
            "definition": "Wasting time in a petty way",
            "pos": "adverb",
            "sent1": "He spent the afternoon piddling around in the garden, not accomplishing anything.",
            "sent2": "She always piddles away her time on meaningless tasks instead of focusing on important work.",
            "sent3": "The cat piddled lazily in the sun, enjoying the warmth on its fur.",
            "sent4": "Time seemed to piddle by slowly as they waited for the train to arrive.",
            "sent5": "The students piddled through the boring lecture, doodling in their notebooks."
        },
        {
            "definition": "To spend time in a wasteful or ineffective manner",
            "pos": "verb",
            "sent1": "He would often piddle away his weekends watching mindless TV shows.",
            "sent2": "She regretted piddling her time on social media instead of studying for the exam.",
            "sent3": "The team piddled around during practice, leading to a disappointing performance in the game.",
            "sent4": "She felt guilty for piddling the whole day without completing any of her tasks.",
            "sent5": "The artist would piddle for hours in front of a blank canvas, waiting for inspiration to strike."
        }
    ]
}