{
    "term": "piece",
    "meanings": [
        {
            "definition": "A part of something",
            "pos": "noun",
            "sent1": "She took a small piece of cake.",
            "sent2": "The puzzle was missing a piece.",
            "sent3": "He found a piece of candy in his pocket.",
            "sent4": "Her smile was a missing piece in his day.",
            "sent5": "The piece of the jigsaw puzzle fit perfectly."
        },
        {
            "definition": "An object made of a material",
            "pos": "noun",
            "sent1": "The jeweler crafted a beautiful piece of jewelry.",
            "sent2": "The sculptor created a masterpiece out of marble.",
            "sent3": "The artist's palette held every color of paint except for the one needed for the piece.",
            "sent4": "Her heart felt like a fragile piece of glass.",
            "sent5": "The piece of wood was smooth and polished to perfection."
        },
        {
            "definition": "A work of art",
            "pos": "noun",
            "sent1": "The museum displayed a famous piece by Picasso.",
            "sent2": "She admired the intricate details of the art piece.",
            "sent3": "The children's play was a hilarious piece of theater.",
            "sent4": "His words were a poetic piece that touched everyone's hearts.",
            "sent5": "The sculpture was a breathtaking piece of creativity."
        },
        {
            "definition": "A written composition",
            "pos": "noun",
            "sent1": "She wrote a beautiful piece for the school newspaper.",
            "sent2": "The author's latest piece was published in a magazine.",
            "sent3": "The detective story was a thrilling piece of fiction.",
            "sent4": "His essay was a thought-provoking piece on climate change.",
            "sent5": "The poem was a touching piece that brought tears to her eyes."
        },
        {
            "definition": "A single item or unit",
            "pos": "noun",
            "sent1": "He bought a piece of fruit from the market.",
            "sent2": "The store sold each piece at a discounted price.",
            "sent3": "The missing piece of the set was finally found.",
            "sent4": "Her smile was the missing piece to his happiness.",
            "sent5": "The piece of the puzzle completed the picture perfectly."
        }
    ]
}