{
    "term": "pieforts",
    "meanings": [
        {
            "definition": "A type of coin that is thicker and heavier than standard coins.",
            "pos": "noun",
            "sent1": "I collected rare pieforts from different countries.",
            "sent2": "The museum displayed ancient pieforts from the Roman Empire.",
            "sent3": "My brother thought my hobby of collecting pieforts was silly.",
            "sent4": "The weight of the pieforts in my hand felt like holding history.",
            "sent5": "The shiny pieforts gleamed under the museum lights."
        },
        {
            "definition": "A collection of pieforts.",
            "pos": "noun",
            "sent1": "Grandpa's pieforts collection was passed down to me.",
            "sent2": "The auction featured a rare pieforts set.",
            "sent3": "We marveled at the vastness of the pieforts display.",
            "sent4": "Her room looked like a treasure trove with all the pieforts.",
            "sent5": "The shelves were filled with gleaming pieforts of all sizes."
        },
        {
            "definition": "To create pieforts.",
            "pos": "verb",
            "sent1": "The mint workers pieforts the new coins with precision.",
            "sent2": "Artisans carefully pieforts the commemorative coins.",
            "sent3": "I tried to pieforts my own coins but they turned out lopsided.",
            "sent4": "The sculptor's hands pieforts the design onto the metal.",
            "sent5": "She learned how to pieforts coins under the guidance of a master craftsman."
        },
        {
            "definition": "The quality of being pieforts.",
            "pos": "noun",
            "sent1": "The durability of the pieforts made them valuable.",
            "sent2": "The uniqueness of the pieforts set them apart from regular coins.",
            "sent3": "The professor discussed the historical significance of pieforts.",
            "sent4": "Her admiration for the pieforts was evident in her collection.",
            "sent5": "The craftsmanship and detail showcased the high pieforts of the coins."
        }
    ]
}