{
    "term": "piets",
    "meanings": [
        {
            "definition": "A person who is a devout follower of a particular religion.",
            "pos": "noun",
            "sent1": "The community center welcomed all piets to their prayer service.",
            "sent2": "The pious piet always attended church on Sundays.",
            "sent3": "The piet joked that their favorite holiday was 'pray-day'.",
            "sent4": "Her faith shone brightly like a piet's robe.",
            "sent5": "The piet's devotion was as strong as a stone wall."
        },
        {
            "definition": "A small, round pastry filled with fruit or meat.",
            "pos": "noun",
            "sent1": "She enjoyed a delicious piet for dessert.",
            "sent2": "The bakery sold freshly baked piets every morning.",
            "sent3": "He playfully juggled the piets before eating them.",
            "sent4": "The warm piet melted in her mouth like a sweet dream.",
            "sent5": "The aroma of the freshly baked piet filled the room with joy."
        },
        {
            "definition": "To decorate or adorn with small, colorful pieces of glass or stone.",
            "pos": "verb",
            "sent1": "She carefully piets the vase with colorful gems.",
            "sent2": "The artist piets the mosaic with intricate designs.",
            "sent3": "He decided to piet his shoes with shiny beads.",
            "sent4": "Her smile piets the room with happiness.",
            "sent5": "The garden was pietsed with sparkling stones, creating a magical atmosphere."
        },
        {
            "definition": "A type of bird known for its colorful plumage.",
            "pos": "noun",
            "sent1": "The exotic piet chirped melodiously in the forest.",
            "sent2": "The zoo had a special exhibit featuring tropical piets.",
            "sent3": "The mischievous piet stole shiny objects to decorate its nest.",
            "sent4": "Her dress was as vibrant as a piet's feathers.",
            "sent5": "The graceful flight of the piet was a sight to behold."
        }
    ]
}