{
    "term": "pietas",
    "meanings": [
        {
            "definition": "Piety: the quality of being religious or reverent",
            "pos": "noun",
            "sent1": "Her deep pietas was evident in her daily prayers and acts of kindness.",
            "sent2": "The community admired his pietas and dedication to helping those in need.",
            "sent3": "The pietas of the old lady was so strong that even the birds seemed to sing hymns around her.",
            "sent4": "His pietas shone like a beacon in the darkness of doubt and disbelief.",
            "sent5": "The pietas of the monk was like a gentle breeze, calming all who came near."
        },
        {
            "definition": "Pious: devoutly religious",
            "pos": "adjective",
            "sent1": "The pietas man prayed at the altar every morning without fail.",
            "sent2": "She was known for her pietas nature and unwavering faith.",
            "sent3": "The pietas nun always had a smile on her face, even during the toughest times.",
            "sent4": "His pietas devotion to his beliefs was unwavering, like a rock in a storm.",
            "sent5": "The pietas priest's eyes shone with a holy light, reflecting his inner faith."
        },
        {
            "definition": "Piteous: deserving or arousing pity",
            "pos": "adjective",
            "sent1": "The pietas beggar sat on the street, hoping for a kind soul to help.",
            "sent2": "Her pietas expression tugged at the heartstrings of all who passed by.",
            "sent3": "The pietas puppy's sad eyes made everyone want to shower it with love and care.",
            "sent4": "In the pietas scene, the orphan's tears moved even the coldest of hearts.",
            "sent5": "The pietas sight of the abandoned kitten stirred compassion in all who saw it."
        },
        {
            "definition": "Pitiably: in a way that arouses pity or compassion",
            "pos": "adverb",
            "sent1": "She looked at him pietas as he struggled to lift the heavy load.",
            "sent2": "The old man sang pietas as he begged for a few coins to buy food.",
            "sent3": "The child's face lit up pietas when she saw the kind stranger approaching.",
            "sent4": "The wounded soldier limped pietas towards the medic, seeking help.",
            "sent5": "The starving artist painted pietas, capturing the essence of human suffering."
        }
    ]
}