{
    "term": "pieties",
    "meanings": [
        {
            "definition": "The quality of being religious or reverent.",
            "pos": "noun",
            "sent1": "Her pieties were evident in the way she prayed every morning.",
            "sent2": "The community's pieties were reflected in their weekly church attendance.",
            "sent3": "Despite his mischievous nature, he always showed pieties during religious ceremonies.",
            "sent4": "The old church stood as a symbol of the town's pieties through the centuries.",
            "sent5": "The nun's pieties shone through her kind and compassionate actions towards others."
        },
        {
            "definition": "A belief or point of view that is accepted with unthinking conventional reverence.",
            "pos": "noun",
            "sent1": "His pieties towards tradition made him resistant to change.",
            "sent2": "The political leader's pieties were evident in his unwavering support for certain policies.",
            "sent3": "Despite his young age, he held onto pieties that seemed outdated to his peers.",
            "sent4": "Her pieties towards superstitions led her to carry a lucky charm everywhere.",
            "sent5": "The family's pieties towards family values were deeply ingrained in their daily lives."
        },
        {
            "definition": "The practice of showing reverence to a deity.",
            "pos": "noun",
            "sent1": "During the ceremony, the priest led the congregation in their pieties.",
            "sent2": "In ancient times, pieties were expressed through elaborate rituals and sacrifices.",
            "sent3": "His pieties towards the gods were tested when faced with a difficult decision.",
            "sent4": "The festival was a celebration of the community's pieties towards their chosen deity.",
            "sent5": "The painting depicted the people's pieties as they offered prayers at the temple."
        }
    ]
}