{
    "term": "piffled",
    "meanings": [
        {
            "definition": "To be confused or bewildered.",
            "pos": "verb",
            "sent1": "She piffled at the complex math problem, unsure of where to start.",
            "sent2": "The unexpected turn of events piffled him, leaving him unsure of what to do next.",
            "sent3": "The magician's disappearing act piffled the audience, making them scratch their heads in confusion.",
            "sent4": "The maze of corridors in the old castle piffled the explorers, as if they were lost in a dream.",
            "sent5": "The intricate plot of the mystery novel piffled her mind, leaving her unable to guess the ending."
        },
        {
            "definition": "To be annoyed or irritated.",
            "pos": "verb",
            "sent1": "He was piffled by the constant noise coming from the construction site next door.",
            "sent2": "The repetitive sound of the dripping faucet piffled her nerves, making it hard to concentrate.",
            "sent3": "The persistent buzzing of the fly piffled him, causing him to swat at it in frustration.",
            "sent4": "The slow internet connection piffled her, like a pebble in her shoe that she couldn't shake out.",
            "sent5": "The loud chewing noises from the table next to her piffled her, making her lose her appetite."
        },
        {
            "definition": "To talk or act in a confused or silly manner.",
            "pos": "verb",
            "sent1": "The children piffled excitedly about their plans for the day.",
            "sent2": "After a long day at work, he piffled on about random topics, not making much sense.",
            "sent3": "The comedian piffled on stage, making the audience laugh with his silly jokes.",
            "sent4": "The group of friends piffled around the campfire, sharing funny stories and memories.",
            "sent5": "She piffled with joy as she recounted the amusing incident that happened earlier."
        }
    ]
}