{
    "term": "piggishness",
    "meanings": [
        {
            "definition": "The quality or state of being like a pig in behavior or appearance.",
            "pos": "noun",
            "sent1": "His piggishness at the dinner table was evident as he devoured his food noisily.",
            "sent2": "Her piggishness was apparent when she refused to share her snacks with anyone.",
            "sent3": "The piggishness of the raccoon raiding the trash cans was both annoying and amusing.",
            "sent4": "The piggishness of the bully's behavior left a sour taste in everyone's mouth.",
            "sent5": "The piggishness of the toddler's messy eating habits made quite a memorable impression.",
            "sent6": "Despite his piggishness, he was still a lovable character in the story.",
            "sent7": "The piggishness of the student hogging all the crayons upset the teacher.",
            "sent8": "The piggishness of the squirrel hoarding nuts for winter was quite impressive.",
            "sent9": "The piggishness of the cat eating all the treats left the dog disappointed.",
            "sent10": "The piggishness of the child grabbing all the toys was hard to ignore."
        },
        {
            "definition": "The characteristic of being greedy or selfish in a manner reminiscent of a pig.",
            "pos": "noun",
            "sent1": "Her piggishness in taking all the credit for the project was unfair to the team.",
            "sent2": "The businessman's piggishness in exploiting his workers for profit was despicable.",
            "sent3": "The piggishness of the politician accepting bribes was both shameful and predictable.",
            "sent4": "The piggishness of the corporation prioritizing profits over employee well-being was alarming.",
            "sent5": "The piggishness of the landlord raising rent prices during a crisis was heartless.",
            "sent6": "Despite his piggishness, he still managed to win the community's trust.",
            "sent7": "The piggishness of the company cutting corners to save money backfired in the end.",
            "sent8": "The piggishness of the child refusing to share toys upset the other kids.",
            "sent9": "The piggishness of the customer demanding special treatment was unreasonable.",
            "sent10": "The piggishness of the celebrity demanding VIP treatment was off-putting."
        }
    ]
}