{
    "term": "pigged",
    "meanings": [
        {
            "definition": "To eat greedily or excessively.",
            "pos": "verb",
            "sent1": "The hungry child pigged down the entire pizza in minutes.",
            "sent2": "She always pigged on sweets whenever she felt stressed.",
            "sent3": "At the party, he pigged on the snacks like there was no tomorrow.",
            "sent4": "The raccoon pigged on the leftovers in the trash can, leaving a mess behind.",
            "sent5": "The competitive eater pigged through the hot dog eating contest, setting a new record."
        },
        {
            "definition": "To live in a messy or dirty manner.",
            "pos": "verb",
            "sent1": "The students pigged in their dorm room, leaving clothes and books everywhere.",
            "sent2": "After a long week of work, she pigged in her messy apartment without cleaning up.",
            "sent3": "The dog pigged in the mud and then ran around the house, leaving dirty paw prints everywhere.",
            "sent4": "The toddler pigged in the sandbox, covering himself in sand from head to toe.",
            "sent5": "The artist pigged in his cluttered studio, creating masterpieces among the chaos."
        },
        {
            "definition": "To hunt or kill pigs for food.",
            "pos": "verb",
            "sent1": "In the olden days, people pigged to provide meat for their families.",
            "sent2": "The tribe would pig in the forest to ensure they had enough food for the winter.",
            "sent3": "The hunters pigged in the wild, tracking down the wild boars for their feast.",
            "sent4": "The chef decided to pig for fresh pork to prepare a special dish for the guests.",
            "sent5": "The villagers would pig during the harvest season to stock up on food for the coming months."
        },
        {
            "definition": "To become plump or fat.",
            "pos": "verb",
            "sent1": "After indulging in holiday treats, she pigged and had to loosen her belt.",
            "sent2": "The stray cat pigged on scraps from the garbage bins and soon became chubby.",
            "sent3": "Despite warnings from the doctor, he continued to pig on unhealthy fast food.",
            "sent4": "The bear pigged on fish before hibernation, preparing for the long winter ahead.",
            "sent5": "The squirrel pigged on nuts and seeds, getting ready for the cold winter months."
        }
    ]
}