{
    "term": "pigheaded",
    "meanings": [
        {
            "definition": "Stubborn or obstinate",
            "pos": "adjective",
            "sent1": "His pigheaded refusal to consider other options led to a lot of arguments.",
            "sent2": "She can be quite pigheaded when she has made up her mind about something.",
            "sent3": "Even the pigheaded mule eventually gave in and followed the trail.",
            "sent4": "The pigheaded rock stood unmoved against the relentless waves.",
            "sent5": "The pigheaded child insisted on wearing shorts in the snow, refusing to listen to reason."
        },
        {
            "definition": "Showing unreasonable determination",
            "pos": "adjective",
            "sent1": "Despite the challenges, his pigheaded determination kept him going.",
            "sent2": "Her pigheaded focus on her goal helped her achieve success against all odds.",
            "sent3": "The pigheaded squirrel refused to leave the bird feeder, no matter what.",
            "sent4": "The pigheaded tree stubbornly held onto its leaves long after all others had fallen.",
            "sent5": "The pigheaded detective wouldn't rest until he solved the case, no matter what obstacles came his way."
        },
        {
            "definition": "Having a closed mind or refusing to listen to others",
            "pos": "adjective",
            "sent1": "His pigheaded belief in his own superiority made it hard for him to accept feedback.",
            "sent2": "She was so pigheaded that she never even considered the possibility of being wrong.",
            "sent3": "The pigheaded customer insisted on speaking to the manager, even though the issue was easily resolved.",
            "sent4": "The pigheaded politician refused to acknowledge the concerns of the people, leading to his downfall.",
            "sent5": "The pigheaded professor dismissed any new ideas that challenged his established theories."
        }
    ]
}