{
    "term": "pigmy",
    "meanings": [
        {
            "definition": "A member of certain peoples of very short stature in equatorial Africa and parts of Southeast Asia.",
            "pos": "noun",
            "sent1": "The pigmy from Africa was known for their small stature.",
            "sent2": "The explorer met a friendly pigmy during his travels in Africa.",
            "sent3": "The pigmy tried to reach the top shelf but couldn't quite make it, causing a comical scene.",
            "sent4": "In a world of giants, she felt like a pigmy, always overlooked and underestimated.",
            "sent5": "The pigmy's tiny footprints in the sand were barely visible, like whispers of a forgotten civilization."
        },
        {
            "definition": "A person of small stature or limited importance.",
            "pos": "noun",
            "sent1": "Despite his pigmy stature, he had a big heart and a strong spirit.",
            "sent2": "She may be a pigmy in size, but her contributions to the team are invaluable.",
            "sent3": "The pigmy of the office surprised everyone with his grand ideas during the meeting.",
            "sent4": "In a world of towering egos, his humility shone brightly, making him stand out like a pigmy among giants.",
            "sent5": "Her pigmy presence in the room was overshadowed by the loud voices of the crowd."
        },
        {
            "definition": "A very small or diminutive person or thing.",
            "pos": "noun",
            "sent1": "The tiny pigmy frog hopped delicately among the leaves in the forest.",
            "sent2": "She kept a collection of pigmy figurines on her shelf, each one intricately detailed.",
            "sent3": "The pigmy mushroom in the garden seemed to be hiding from the larger plants around it.",
            "sent4": "The pigmy star in the sky twinkled faintly, almost lost among the brighter ones.",
            "sent5": "The pigmy diamond sparkled in the sunlight, a tiny treasure waiting to be discovered."
        }
    ]
}