{
    "term": "pigsticking",
    "meanings": [
        {
            "definition": "The act of hunting wild boars with a spear.",
            "pos": "noun",
            "sent1": "In the ancient tradition of pigsticking, hunters would bravely face wild boars with their spears.",
            "sent2": "The villagers organized a pigsticking event to showcase their hunting skills with spears.",
            "sent3": "During the pigsticking competition, the boars seemed to outsmart the hunters at every turn.",
            "sent4": "His determination to succeed in pigsticking was as sharp as the tip of his spear.",
            "sent5": "The adrenaline rush of pigsticking made the hunters feel alive and connected to nature."
        },
        {
            "definition": "A method of controlling weeds by cutting them off at ground level.",
            "pos": "noun",
            "sent1": "Gardening experts recommend pigsticking as an effective way to manage pesky weeds.",
            "sent2": "Using pigsticking in the garden helped keep the weed population under control.",
            "sent3": "The neighbors were puzzled by his unique approach of pigsticking the weeds instead of pulling them out.",
            "sent4": "Her precision in pigsticking the weeds was like a skilled surgeon performing delicate surgery.",
            "sent5": "The garden flourished after regular pigsticking sessions eliminated the unwanted plants."
        },
        {
            "definition": "A sharp implement used for piercing or stabbing.",
            "pos": "noun",
            "sent1": "The warrior's sword was a deadly pigsticking weapon in battle.",
            "sent2": "She carefully cleaned the pigsticking tool after each use to maintain its sharpness.",
            "sent3": "The chef's favorite pigsticking knife was passed down through generations in the family.",
            "sent4": "The detective found a bloody pigsticking object at the crime scene.",
            "sent5": "The artist used a unique pigsticking tool to create intricate designs on wood."
        }
    ]
}