{
    "term": "pigstickers",
    "meanings": [
        {
            "definition": "A sharp implement used for stabbing pigs.",
            "pos": "noun",
            "sent1": "The farmer used pigstickers to protect his livestock from predators.",
            "sent2": "The butcher's tool kit included various pigstickers for processing meat.",
            "sent3": "In the old cartoon, the pigstickers were comically oversized, causing chaos in the barn.",
            "sent4": "Her eyes widened in fear as she saw the glint of the pigstickers in the intruder's hand.",
            "sent5": "The gleaming pigstickers were displayed in a row, ready for the next pig to be processed."
        },
        {
            "definition": "A person who stabs pigs.",
            "pos": "noun",
            "sent1": "The pigstickers at the farm were skilled in their work, ensuring a quick and humane process.",
            "sent2": "The community was shocked to discover that the pigstickers had been stealing from the farm.",
            "sent3": "The mischievous pigstickers played a prank by hiding all the pig feed, causing a ruckus.",
            "sent4": "She was known as the fastest pigstickers in the county, never missing her mark.",
            "sent5": "The pigstickers gathered at the annual fair to showcase their techniques and compete for prizes."
        },
        {
            "definition": "To stab pigs.",
            "pos": "verb",
            "sent1": "The farmer had to pigstickers the wild boar that threatened the safety of the other animals.",
            "sent2": "It is illegal to pigstickers pigs for sport or entertainment.",
            "sent3": "The chef decided to pigstickers the pig himself to ensure the freshest meat for the dish.",
            "sent4": "She felt a pang of guilt as she had to pigstickers the injured pig to end its suffering.",
            "sent5": "The ancient ritual required the chosen warrior to pigstickers the sacred pig as a test of bravery."
        }
    ]
}