{
    "term": "piki",
    "meanings": [
        {
            "definition": "To pick or gather small items by hand.",
            "pos": "verb",
            "sent1": "I piki flowers in the garden.",
            "sent2": "She likes to piki seashells at the beach.",
            "sent3": "The child tried to piki the stars from the sky.",
            "sent4": "He pikied his way through the scattered toys on the floor.",
            "sent5": "The squirrel pikied nuts from the tree with nimble fingers."
        },
        {
            "definition": "A small, flat basket used for gathering berries or other small items.",
            "pos": "noun",
            "sent1": "She carried the berries in a piki.",
            "sent2": "The farmer filled the piki with freshly picked apples.",
            "sent3": "The little girl pretended her piki was a magical treasure chest.",
            "sent4": "The piki lay empty by the berry bushes, waiting to be filled.",
            "sent5": "The woven piki was sturdy and perfect for holding tiny treasures."
        },
        {
            "definition": "To climb or ascend by using hands and feet.",
            "pos": "verb",
            "sent1": "The cat tried to piki up the tree.",
            "sent2": "He pikied over the rocks to reach the mountaintop.",
            "sent3": "The spider decided to piki the wall instead of using its web.",
            "sent4": "She pikied the ladder to reach the attic.",
            "sent5": "The hiker pikied the steep trail with determination."
        },
        {
            "definition": "A type of traditional Hopi pottery.",
            "pos": "noun",
            "sent1": "The museum displayed beautiful piki pottery.",
            "sent2": "She admired the intricate designs on the piki.",
            "sent3": "The piki on the shelf seemed to whisper stories of the past.",
            "sent4": "The artist carefully painted the piki with vibrant colors.",
            "sent5": "The piki was passed down through generations as a symbol of heritage."
        }
    ]
}