{
    "term": "pilocarpine",
    "meanings": [
        {
            "definition": "A drug used to treat glaucoma by reducing intraocular pressure.",
            "pos": "noun",
            "sent1": "The doctor prescribed pilocarpine to help lower the pressure in my eyes.",
            "sent2": "My grandmother uses pilocarpine eye drops to manage her glaucoma.",
            "sent3": "I accidentally mistook the pilocarpine for regular eye drops and ended up with dilated pupils!",
            "sent4": "The pilocarpine worked like a charm, melting away the tension in my eyes like ice on a hot day.",
            "sent5": "As the pilocarpine seeped into my eyes, I felt a soothing relief wash over me."
        },
        {
            "definition": "A chemical compound derived from the South American shrub Pilocarpus jaborandi.",
            "pos": "noun",
            "sent1": "The scientist studied the properties of pilocarpine extracted from the jaborandi shrub.",
            "sent2": "The pharmacy sourced high-quality pilocarpine for their new eye drop formula.",
            "sent3": "The chef accidentally added pilocarpine instead of parsley to the dish, creating a strange flavor.",
            "sent4": "The aroma of the pilocarpine-infused potion filled the room, transporting me to a tropical forest.",
            "sent5": "The pilocarpine gleamed under the microscope, revealing its intricate molecular structure."
        },
        {
            "definition": "A medication that stimulates the parasympathetic nervous system.",
            "pos": "noun",
            "sent1": "The pilocarpine injection quickly activated my parasympathetic nervous system.",
            "sent2": "Athletes sometimes use pilocarpine to enhance their performance by stimulating their nervous system.",
            "sent3": "After taking pilocarpine, I couldn't stop laughing at the silliest jokes!",
            "sent4": "Her words were like pilocarpine, soothing my nerves and calming my racing thoughts.",
            "sent5": "The pilocarpine rush made me feel alive, as if my body was dancing to its own beat."
        }
    ]
}