{
    "term": "pilocarpines",
    "meanings": [
        {
            "definition": "A type of drug used to treat glaucoma.",
            "pos": "noun",
            "sent1": "The doctor prescribed pilocarpines to help with my eye condition.",
            "sent2": "She picked up her pilocarpines from the pharmacy for her glaucoma treatment.",
            "sent3": "I accidentally mistook the pilocarpines for candy, thinking it would magically cure my eyes.",
            "sent4": "The pilocarpines worked like a superhero, fighting off the glaucoma villains in my eyes.",
            "sent5": "As I took the pilocarpines, I imagined tiny soldiers marching into battle against my eye troubles."
        },
        {
            "definition": "The plural form of pilocarpine, a medication derived from the South American shrub Pilocarpus jaborandi.",
            "pos": "noun",
            "sent1": "The pharmacist handed me a bottle of pilocarpines for my eye treatment.",
            "sent2": "Many patients rely on pilocarpines to manage their eye conditions.",
            "sent3": "I accidentally ordered a dozen pilocarpines instead of one, now I have a lifetime supply!",
            "sent4": "The room was filled with the scent of pilocarpines, like a fragrant garden in bloom.",
            "sent5": "The pilocarpines stood proudly on the shelf, ready to aid those in need with their healing powers."
        },
        {
            "definition": "The chemical compound found in pilocarpine medication.",
            "pos": "noun",
            "sent1": "Scientists studied the effects of pilocarpines on eye health.",
            "sent2": "The lab technician analyzed the purity of the pilocarpines in the sample.",
            "sent3": "The mischievous cat knocked over the vial of pilocarpines, creating a colorful mess.",
            "sent4": "Her eyes sparkled like pilocarpines, bright and full of life.",
            "sent5": "The pilocarpines glowed under the microscope, revealing their intricate structure."
        }
    ]
}