{
    "term": "pinang",
    "meanings": [
        {
            "definition": "A type of palm tree native to Southeast Asia.",
            "pos": "noun",
            "sent1": "The pinang tree provides shade with its large leaves.",
            "sent2": "In Southeast Asia, you can find the pinang tree growing in abundance.",
            "sent3": "The monkeys in the jungle love to climb the tall pinang trees.",
            "sent4": "The pinang tree stood tall like a guardian of the forest.",
            "sent5": "The vibrant green color of the pinang tree leaves is a sight to behold."
        },
        {
            "definition": "The fruit of the pinang palm tree, also known as betel nut.",
            "pos": "noun",
            "sent1": "Chewing on pinang can give you a burst of energy.",
            "sent2": "Many people in Southeast Asia enjoy the taste of pinang.",
            "sent3": "The villagers shared stories under the shade of the pinang tree while chewing on betel nut.",
            "sent4": "The pinang fruit's flavor exploded in my mouth like a tropical treat.",
            "sent5": "The aroma of pinang filled the air, tempting everyone nearby."
        },
        {
            "definition": "A small, pointed piece of metal used for fastening materials together.",
            "pos": "noun",
            "sent1": "She carefully placed the pinang in the fabric to secure it.",
            "sent2": "The pinang held the pieces of wood firmly in place.",
            "sent3": "The mischievous child used the pinang to create a makeshift crown.",
            "sent4": "The pinang gleamed in the sunlight, a tiny but essential tool.",
            "sent5": "With a swift motion, she inserted the pinang into the paper to keep it together."
        },
        {
            "definition": "To fasten or attach something with a pinang.",
            "pos": "verb",
            "sent1": "He decided to pinang the loose ends of the rope together.",
            "sent2": "She carefully pinanged the fabric to prevent it from unraveling.",
            "sent3": "The children tried to pinang their drawings on the wall with tape.",
            "sent4": "She pinanged her hair up in a messy bun for a casual look.",
            "sent5": "The tailor skillfully pinanged the buttons onto the shirt."
        }
    ]
}