{
    "term": "pinioned",
    "meanings": [
        {
            "definition": "Confined or restrained",
            "pos": "adjective",
            "sent1": "The bird's pinioned wings kept it from flying away.",
            "sent2": "The pinioned prisoner could not escape from the cell.",
            "sent3": "The pinioned cat looked at the tempting bird outside.",
            "sent4": "Her fear pinioned her in place, unable to move.",
            "sent5": "The pinioned horse struggled against its restraints."
        },
        {
            "definition": "Fastened or secured",
            "pos": "adjective",
            "sent1": "The pinioned door prevented anyone from entering.",
            "sent2": "The pinioned lock kept the treasure chest safe.",
            "sent3": "The pinioned gate swung shut with a loud clang.",
            "sent4": "His eyes were pinioned on the mysterious package.",
            "sent5": "The pinioned rope held the boat securely in place."
        },
        {
            "definition": "Restrained by binding the arms",
            "pos": "adjective",
            "sent1": "The pinioned criminal was escorted into the courtroom.",
            "sent2": "The pinioned suspect was taken into custody by the police.",
            "sent3": "The pinioned wrestler struggled to break free from the hold.",
            "sent4": "Her pinioned arms made it difficult for her to defend herself.",
            "sent5": "The pinioned prisoner sat quietly in the interrogation room."
        },
        {
            "definition": "Clipped or trimmed wings of a bird",
            "pos": "noun",
            "sent1": "The bird's pinioned fluttering caught everyone's attention.",
            "sent2": "The pinioned feathers lay scattered on the ground.",
            "sent3": "The pinioned bird hopped around the garden, unable to fly.",
            "sent4": "The pinioned wings of the eagle symbolized freedom lost.",
            "sent5": "The pinioned sparrow chirped sadly from its perch."
        }
    ]
}