{
    "term": "pinions",
    "meanings": [
        {
            "definition": "The outer part of a bird's wing that helps in flying.",
            "pos": "noun",
            "sent1": "The bird's pinions were strong and allowed it to soar high in the sky.",
            "sent2": "The colorful feathers on the bird's pinions caught the sunlight as it flew.",
            "sent3": "The mischievous squirrel tried to use the bird's pinions as a makeshift umbrella during the rain.",
            "sent4": "Her dreams had pinions that carried her to far-off lands while she slept.",
            "sent5": "The pinions of the majestic eagle were a sight to behold as it glided effortlessly through the air."
        },
        {
            "definition": "The outer part of a bird's wing that is used for steering.",
            "pos": "noun",
            "sent1": "With a swift movement of its pinions, the bird changed direction in mid-flight.",
            "sent2": "The bird expert explained how the pinions help the bird navigate through the air.",
            "sent3": "The mischievous squirrel tried to use the bird's pinions as a rudder for its tiny boat.",
            "sent4": "Her thoughts had pinions that guided her towards making the right decision.",
            "sent5": "The pinions of the seagull fluttered gracefully as it turned towards the ocean."
        },
        {
            "definition": "To bind or hold someone's arms to their sides.",
            "pos": "verb",
            "sent1": "The villain attempted to pinions the hero's arms to prevent escape.",
            "sent2": "The magician used invisible threads to pinions the volunteer's arms during the trick.",
            "sent3": "The mischievous toddler tried to pinions their teddy bear's arms with tape.",
            "sent4": "Her fears seemed to pinions her, making it hard to move forward.",
            "sent5": "The chains of doubt seemed to pinions his every action, holding him back from his dreams."
        }
    ]
}