{
    "term": "pink",
    "meanings": [
        {
            "definition": "A color varying from light crimson to pale reddish purple.",
            "pos": "noun",
            "sent1": "The little girl's room was painted a soft pink.",
            "sent2": "She picked out a pink dress for the party.",
            "sent3": "The pink flowers in the garden seemed to be blushing.",
            "sent4": "The sky turned a beautiful pink as the sun set.",
            "sent5": "The pink of the sunset reflected on the calm lake."
        },
        {
            "definition": "To decorate or color with pink.",
            "pos": "verb",
            "sent1": "She decided to pink the edges of the paper with a marker.",
            "sent2": "They pinked the cupcakes with frosting for the bake sale.",
            "sent3": "He accidentally pinked his white shirt while trying to dye it.",
            "sent4": "The artist carefully pinked the canvas to add a pop of color.",
            "sent5": "The students worked together to pink the classroom walls for the event."
        },
        {
            "definition": "A pink color.",
            "pos": "noun",
            "sent1": "The baby blanket was a soft pink.",
            "sent2": "She loved the pink of the roses in the garden.",
            "sent3": "The pink of the cotton candy made her smile.",
            "sent4": "The pink of the sunrise painted the sky with warmth.",
            "sent5": "The pink of the flamingo stood out against the green grass."
        },
        {
            "definition": "A pink garment.",
            "pos": "noun",
            "sent1": "She wore a pink dress to the dance.",
            "sent2": "He bought a pink shirt to match his new shoes.",
            "sent3": "The pink sweater kept her warm on the chilly evening.",
            "sent4": "The pink scarf added a touch of color to her outfit.",
            "sent5": "The pink hat completed her outfit for the parade."
        }
    ]
}