{
    "term": "pinnation",
    "meanings": [
        {
            "definition": "The arrangement of leaflets or lobes on either side of a common axis.",
            "pos": "noun",
            "sent1": "The pinnation of the leaves on the tree made them look like little fans.",
            "sent2": "The pinnation of the fern's fronds allowed them to capture sunlight efficiently.",
            "sent3": "The pinnation of the book's pages made it seem like a tiny forest in my hands.",
            "sent4": "The pinnation of the flags along the street created a beautiful symmetrical display.",
            "sent5": "I marveled at the pinnation of the butterfly's wings as it fluttered by."
        },
        {
            "definition": "Having leaflets or lobes arranged on either side of a common axis.",
            "pos": "adjective",
            "sent1": "The pinnation pattern of the plant's leaves gave it a unique appearance.",
            "sent2": "The pinnation structure of the fern made it an ideal choice for the shady corner.",
            "sent3": "The pinnation design of the curtains added a touch of elegance to the room.",
            "sent4": "Her dress had a pinnation style that flowed gracefully as she walked.",
            "sent5": "The artist captured the pinnation arrangement of the leaves in exquisite detail."
        },
        {
            "definition": "A leaf or frond with leaflets or lobes arranged on either side of a common axis.",
            "pos": "noun",
            "sent1": "The pinnation of the palm frond created a beautiful tropical feel in the garden.",
            "sent2": "The botanist studied the pinnation of the leaf to identify the plant species.",
            "sent3": "The pinnation of the map's edges made it look like a treasure map.",
            "sent4": "The pinnation of the feather gave it a delicate and intricate appearance.",
            "sent5": "I admired the pinnation of the ivy leaf as it climbed up the wall."
        }
    ]
}