{
    "term": "pinoles",
    "meanings": [
        {
            "definition": "A type of flour made from ground parched corn.",
            "pos": "noun",
            "sent1": "The recipe called for pinoles to be used as a key ingredient in the cornbread.",
            "sent2": "She bought a bag of pinoles to make traditional corn tortillas.",
            "sent3": "The pinoles in the pantry were so tempting that she ended up baking corn muffins at midnight.",
            "sent4": "The aroma of freshly baked bread filled the kitchen, reminding her of the comforting scent of pinoles.",
            "sent5": "As she sifted the pinoles, the fine texture reminded her of soft sand on a sunny beach."
        },
        {
            "definition": "A type of food made from parched corn kernels.",
            "pos": "noun",
            "sent1": "The children enjoyed snacking on pinoles during their picnic in the park.",
            "sent2": "The market sold various flavors of pinoles, from spicy to sweet.",
            "sent3": "She playfully tossed a handful of pinoles in the air, pretending they were confetti.",
            "sent4": "The crunch of the pinoles echoed through the room, like tiny applause for the chef.",
            "sent5": "The colorful packaging of the pinoles caught her eye, promising a tasty treat inside."
        },
        {
            "definition": "A type of snack made from parched corn.",
            "pos": "noun",
            "sent1": "During the movie night, they shared a big bowl of pinoles, passing it around the room.",
            "sent2": "The vendors at the fair offered freshly popped pinoles as a popular snack.",
            "sent3": "He jokingly juggled the pinoles, pretending they were popcorn kernels.",
            "sent4": "The sound of laughter mixed with the crunch of pinoles, creating a joyful atmosphere.",
            "sent5": "The pinoles were so addictive that she found herself reaching for more after each handful."
        }
    ]
}