{
    "term": "piousnesses",
    "meanings": [
        {
            "definition": "The quality of being devoutly religious.",
            "pos": "noun",
            "sent1": "Her piousnesses were evident in her daily prayers and visits to the church.",
            "sent2": "The community admired his piousnesses and dedication to his faith.",
            "sent3": "During the ceremony, his piousnesses shone through as he humbly accepted the blessings.",
            "sent4": "In the quiet of the chapel, her piousnesses enveloped her like a warm embrace.",
            "sent5": "The old church echoed with the piousnesses of the worshippers, creating a serene atmosphere."
        },
        {
            "definition": "The state of showing reverence and devotion to a higher power.",
            "pos": "noun",
            "sent1": "Their piousnesses towards the divine were unwavering, even in times of hardship.",
            "sent2": "The monk's piousnesses were reflected in his daily rituals and prayers.",
            "sent3": "Despite his mischievous nature, his piousnesses during the religious ceremonies were undeniable.",
            "sent4": "The mountain peak seemed to reach for the sky with a sense of piousnesses, as if in prayer.",
            "sent5": "The ancient texts spoke of the piousnesses of the gods, inspiring awe and respect."
        },
        {
            "definition": "Acts of religious devotion and reverence.",
            "pos": "noun",
            "sent1": "The piousnesses of the pilgrims on their journey were a testament to their faith.",
            "sent2": "Each of her piousnesses was a heartfelt expression of her spiritual beliefs.",
            "sent3": "The mischievous child's piousnesses during the ceremony surprised everyone.",
            "sent4": "The piousnesses of the faithful filled the temple with a sense of peace and harmony.",
            "sent5": "The piousnesses of the monks were reflected in their simple way of life and dedication to prayer."
        }
    ]
}