{
    "term": "pip",
    "meanings": [
        {
            "definition": "A small seed in a fruit",
            "pos": "noun",
            "sent1": "The apple had a tiny pip inside.",
            "sent2": "She accidentally swallowed a pip from the orange.",
            "sent3": "The mischievous squirrel hid pips from the cherries in its nest.",
            "sent4": "The pip in the peach held the promise of new life.",
            "sent5": "The farmer planted the pips to grow fruit trees."
        },
        {
            "definition": "A small mark or spot",
            "pos": "noun",
            "sent1": "There was a small pip on the paper.",
            "sent2": "The artist carefully removed a pip of paint from the canvas.",
            "sent3": "The detective found a pip of blood at the crime scene.",
            "sent4": "The pip on the mirror distorted the reflection.",
            "sent5": "The pip on the wall caught her attention."
        },
        {
            "definition": "To defeat someone by a small margin",
            "pos": "verb",
            "sent1": "She managed to pip her opponent in the race.",
            "sent2": "The team was able to pip their rivals in the final minutes.",
            "sent3": "He always finds a way to pip me in our friendly competitions.",
            "sent4": "The underdog managed to pip the champion in a surprising turn of events.",
            "sent5": "The student studied hard to pip the others in the exam."
        },
        {
            "definition": "A high-pitched sound",
            "pos": "noun",
            "sent1": "The bird's song was a sweet pip in the quiet forest.",
            "sent2": "The pip of the whistle signaled the start of the game.",
            "sent3": "The unexpected pip of the alarm clock woke her up.",
            "sent4": "The pip of the flute echoed through the hall.",
            "sent5": "The pip of the cricket filled the night with music."
        },
        {
            "definition": "To remove the stones from fruit",
            "pos": "verb",
            "sent1": "She carefully pipped the peaches before baking.",
            "sent2": "The chef showed how to pip the cherries for the pie.",
            "sent3": "He always forgets to pip the olives before serving.",
            "sent4": "The children helped to pip the grapes for the snack.",
            "sent5": "The recipe called for pipping the plums before cooking."
        }
    ]
}