{
    "term": "pipals",
    "meanings": [
        {
            "definition": "A type of tree with heart-shaped leaves.",
            "pos": "noun",
            "sent1": "The forest was filled with tall pipals swaying gently in the breeze.",
            "sent2": "I love sitting under the shade of the pipals in the park.",
            "sent3": "The mischievous squirrel hid its acorn stash under the pipals, thinking no one would find it.",
            "sent4": "The pipals stood like guardians, their leaves forming a protective canopy over the clearing.",
            "sent5": "The pipals in the botanical garden were so vibrant and green, they seemed to dance in the sunlight."
        },
        {
            "definition": "The sound made by a small bird.",
            "pos": "noun",
            "sent1": "In the morning, the sweet pipals of the sparrows greeted me outside my window.",
            "sent2": "I could hear the cheerful pipals of the robins as they sang in the garden.",
            "sent3": "The melodious pipals of the canary made everyone smile in the pet store.",
            "sent4": "The pipals of the nightingale filled the air with a magical symphony.",
            "sent5": "The pipals of the finch were like tiny musical notes floating in the air."
        },
        {
            "definition": "A small, hard seed found in some fruits.",
            "pos": "noun",
            "sent1": "She accidentally bit into a pipals while eating her apple, and it cracked her tooth.",
            "sent2": "The chef carefully removed the pipals from the peach before slicing it for the dessert.",
            "sent3": "The mischievous child pretended the pipals from the grapes were precious jewels and played with them.",
            "sent4": "The pipals from the pomegranate looked like tiny rubies scattered on the plate.",
            "sent5": "The squirrel buried the pipals from the cherry in the ground, hoping to grow a tree."
        }
    ]
}