{
    "term": "pipi",
    "meanings": [
        {
            "definition": "A small seed or kernel",
            "pos": "noun",
            "sent1": "I planted a pipi in the garden and it grew into a beautiful flower.",
            "sent2": "The farmer collected the papis from the sunflowers to use as seeds for next year.",
            "sent3": "The squirrel hid the pipi in the ground, thinking it was a tasty treat for later.",
            "sent4": "Her ideas were like papis, small but full of potential to grow into something big.",
            "sent5": "The tiny pipi held the promise of a future plant bursting with color."
        },
        {
            "definition": "A high-pitched sound or squeak",
            "pos": "noun",
            "sent1": "The bird made a pipi as it flew overhead, its song echoing through the trees.",
            "sent2": "The mouse let out a little pipi as it scurried across the floor.",
            "sent3": "The teapot let out a loud pipi when the water inside started to boil.",
            "sent4": "The old door made a haunting pipi every time the wind blew through the house.",
            "sent5": "The child's laughter filled the room with joyful pipis of delight."
        },
        {
            "definition": "A type of shellfish",
            "pos": "noun",
            "sent1": "The beach was full of pipis, their shells scattered along the shore.",
            "sent2": "The chef prepared a delicious dish using fresh pipis from the ocean.",
            "sent3": "The seagull swooped down to grab a pipi from the sand, only to drop it in the water.",
            "sent4": "The fisherman's net was filled with wriggling pipis, ready to be cooked for dinner.",
            "sent5": "The salty air was filled with the scent of cooking pipis, making everyone's mouths water."
        },
        {
            "definition": "A childish term for urine",
            "pos": "noun",
            "sent1": "The toddler giggled as he told his mom he needed to go pee-pee.",
            "sent2": "The little girl asked her teacher if she could use the bathroom to go pipi.",
            "sent3": "The puppy made a mess on the floor, leaving a puddle of pipi for its owner to clean up.",
            "sent4": "The cartoon character couldn't hold it anymore and had to run to the bushes to do pipi.",
            "sent5": "The sound of rain on the roof made the child want to go pipi, imagining it was the sound of a waterfall."
        }
    ]
}