{
    "term": "pips",
    "meanings": [
        {
            "definition": "A small hard seed in a fruit",
            "pos": "noun",
            "sent1": "The apple had tiny pips inside.",
            "sent2": "She bit into the peach and accidentally crunched on a pip.",
            "sent3": "The orange pip rolled off the plate and onto the floor.",
            "sent4": "The watermelon seeds were like pips waiting to grow.",
            "sent5": "The cherry pip was so small, it was easy to miss."
        },
        {
            "definition": "A series of small dots on a playing card",
            "pos": "noun",
            "sent1": "The card had red pips in the corner.",
            "sent2": "He noticed the black pips on the spades and clubs.",
            "sent3": "The pips on the card looked like a trail of ants.",
            "sent4": "The pips on the deck of cards seemed to dance when shuffled.",
            "sent5": "Counting the pips on the card helped him play the game."
        },
        {
            "definition": "A high-pitched sound, especially of a bird",
            "pos": "noun",
            "sent1": "The bird's cheerful pip echoed through the forest.",
            "sent2": "She woke up to the sweet pips of the early birds.",
            "sent3": "The loud pip of the robin made her smile.",
            "sent4": "The pips of the songbirds filled the air with music.",
            "sent5": "The little bird's pip was a delightful morning greeting."
        },
        {
            "definition": "To defeat someone in a game or competition",
            "pos": "verb",
            "sent1": "She managed to pips him in the final round.",
            "sent2": "He hoped to pip his opponent in the upcoming match.",
            "sent3": "The underdog team surprised everyone by pipping the champions.",
            "sent4": "In a surprising move, she pipped the reigning champion to win.",
            "sent5": "He trained hard to pip his rival and claim victory."
        }
    ]
}