{
    "term": "piquets",
    "meanings": [
        {
            "definition": "A pointed stake or post driven into the ground to form a fence.",
            "pos": "noun",
            "sent1": "The farmer used piquets to mark the boundaries of his land.",
            "sent2": "The wooden piquets were arranged neatly to create a sturdy fence.",
            "sent3": "The mischievous dog tried to chew on the piquets, thinking they were bones.",
            "sent4": "Her determination was like a row of unyielding piquets, standing firm against any challenge.",
            "sent5": "The piquets stood tall, guarding the garden from intruders."
        },
        {
            "definition": "A group of soldiers or troops positioned to guard or defend an area.",
            "pos": "noun",
            "sent1": "The commander ordered the piquets to patrol the perimeter of the camp.",
            "sent2": "The piquets remained vigilant throughout the night, ensuring the safety of their comrades.",
            "sent3": "The piquets played a game of hide-and-seek during their break, practicing their stealth.",
            "sent4": "The piquets stood like silent sentinels, ready to spring into action at any moment.",
            "sent5": "The piquets rotated their shifts, maintaining a constant watch over the surroundings."
        },
        {
            "definition": "A game of cards involving betting and trick-taking.",
            "pos": "noun",
            "sent1": "During the family gathering, they decided to play piquets for some friendly competition.",
            "sent2": "The players strategized carefully to outwit their opponents in the game of piquets.",
            "sent3": "Grandpa always claimed he could predict the outcome of a game of piquets with his lucky charm.",
            "sent4": "The atmosphere was tense as the final round of piquets determined the ultimate winner.",
            "sent5": "The sound of shuffling cards filled the room as they prepared for a round of piquets."
        }
    ]
}