{
    "term": "piroplasmata",
    "meanings": [
        {
            "definition": "A group of parasitic protozoa that infect red blood cells in mammals.",
            "pos": "noun",
            "sent1": "The piroplasmata caused the red blood cells to become sick.",
            "sent2": "Scientists are studying the effects of piroplasmata on different mammal species.",
            "sent3": "The piroplasmata threw a party inside the red blood cells, but the cells were not happy guests.",
            "sent4": "The piroplasmata were like tiny invaders taking over the red blood cell kingdom.",
            "sent5": "Under the microscope, the piroplasmata looked like tiny, mischievous creatures dancing in the blood."
        },
        {
            "definition": "The plural form of piroplasma, a type of parasitic protozoan.",
            "pos": "noun",
            "sent1": "There were many piroplasmata swimming in the blood of the infected animal.",
            "sent2": "The vet found piroplasmata in the blood sample taken from the sick dog.",
            "sent3": "The piroplasmata gathered for a family reunion in the bloodstream.",
            "sent4": "The piroplasmata were like tiny soldiers marching through the red blood cells.",
            "sent5": "The piroplasmata multiplied rapidly, spreading their parasitic presence throughout the body."
        },
        {
            "definition": "The study or scientific classification of piroplasmata.",
            "pos": "noun",
            "sent1": "The scientist dedicated years to researching piroplasmata and their behavior.",
            "sent2": "In the lab, researchers discussed the latest findings in piroplasmata taxonomy.",
            "sent3": "The piroplasmata research team had a 'bring your parasite to work' day.",
            "sent4": "The world of piroplasmata classification was like a complex puzzle waiting to be solved.",
            "sent5": "The textbook on piroplasmata was filled with colorful illustrations and detailed descriptions."
        }
    ]
}