{
    "term": "pit",
    "meanings": [
        {
            "definition": "A large hole in the ground",
            "pos": "noun",
            "sent1": "The miners dug a deep pit to extract coal.",
            "sent2": "Be careful not to fall into the pit while hiking.",
            "sent3": "The pit in the backyard turned into a swimming pool after heavy rain.",
            "sent4": "The pit of quicksand seemed bottomless, swallowing everything in its path.",
            "sent5": "The pit was so wide that it felt like staring into the mouth of the earth itself."
        },
        {
            "definition": "A hard seed inside a fruit",
            "pos": "noun",
            "sent1": "She accidentally bit into a cherry pit while eating.",
            "sent2": "The peach pit was carefully removed before making the jam.",
            "sent3": "He planted the apple pit in the hope of growing a tree.",
            "sent4": "The pit of the avocado was used to grow a small plant.",
            "sent5": "The pit inside the mango was too hard to crack with teeth."
        },
        {
            "definition": "A feeling of sadness or despair",
            "pos": "noun",
            "sent1": "After losing the game, he felt a pit in his stomach.",
            "sent2": "The news of the accident left a pit in her heart.",
            "sent3": "Despite the pit of sadness, she tried to smile for her friends.",
            "sent4": "The pit of despair seemed endless, engulfing his thoughts.",
            "sent5": "The pit of loneliness grew deeper with each passing day."
        },
        {
            "definition": "To mark with small depressions or scars",
            "pos": "verb",
            "sent1": "She accidentally pitted the table while moving furniture.",
            "sent2": "The hailstorm pitted the car's windshield with tiny dents.",
            "sent3": "His shoes pitted the wooden floor with marks.",
            "sent4": "The constant use of the hammer pitted the metal surface.",
            "sent5": "The stone pitted the glass window, leaving a rough texture."
        }
    ]
}