{
    "term": "pitches",
    "meanings": [
        {
            "definition": "To throw or toss something",
            "pos": "verb",
            "sent1": "He pitches the ball to his friend.",
            "sent2": "She pitches the paper into the recycling bin.",
            "sent3": "The pitcher pitches the ball with great accuracy.",
            "sent4": "She pitches her ideas to the team with enthusiasm.",
            "sent5": "He pitches the horseshoe towards the stake."
        },
        {
            "definition": "A level or flat area of ground",
            "pos": "noun",
            "sent1": "The children play on the pitches in the park.",
            "sent2": "The baseball field has well-maintained pitches.",
            "sent3": "The pitches in the field are perfect for a picnic.",
            "sent4": "The pitches of the soccer field are marked with white lines.",
            "sent5": "The pitches in the garden are ideal for planting vegetables."
        },
        {
            "definition": "The highness or lowness of a sound",
            "pos": "noun",
            "sent1": "The singer's voice reaches high pitches during the song.",
            "sent2": "The bird's chirping has different pitches.",
            "sent3": "The cat's meow at a high pitch always makes me smile.",
            "sent4": "The music teacher explained the concept of pitches to the students.",
            "sent5": "The violinist played beautiful melodies at various pitches."
        },
        {
            "definition": "A sales presentation or proposal",
            "pos": "noun",
            "sent1": "The company's pitches to potential clients are very convincing.",
            "sent2": "She prepared a detailed pitch for the new product launch.",
            "sent3": "The sales team practiced their pitch before the meeting.",
            "sent4": "His pitch to investors highlighted the product's unique features.",
            "sent5": "The entrepreneur delivered a compelling pitch to the investors."
        },
        {
            "definition": "To set up or establish a tent or campsite",
            "pos": "verb",
            "sent1": "They pitch their tent near the lake for the camping trip.",
            "sent2": "He pitches a temporary shelter for the night.",
            "sent3": "The campers pitch their tents under the starry sky.",
            "sent4": "She pitches the canopy to provide shade during the day.",
            "sent5": "The group pitches their campsite in a secluded area."
        }
    ]
}