{
    "term": "pitch",
    "meanings": [
        {
            "definition": "A thick, dark, sticky substance obtained from tar or turpentine.",
            "pos": "noun",
            "sent1": "The pitch on the road made it difficult to walk smoothly.",
            "sent2": "The roof was coated with pitch to protect it from the rain.",
            "sent3": "The kids thought the pitch looked like melted chocolate.",
            "sent4": "Her voice was as dark and sticky as pitch when she sang.",
            "sent5": "The pitch oozed slowly from the can, resembling thick molasses."
        },
        {
            "definition": "The degree of highness or lowness of a tone or sound.",
            "pos": "noun",
            "sent1": "The singer's pitch was perfect during the performance.",
            "sent2": "The pitch of the whistle was so high that only dogs could hear it.",
            "sent3": "The bird's chirping reached a pitch that made everyone cover their ears.",
            "sent4": "His laughter rose to a pitch that echoed through the entire room.",
            "sent5": "The pitch of the violin created a beautiful melody that touched the hearts of the audience."
        },
        {
            "definition": "The act of throwing something with a sharp motion.",
            "pos": "noun",
            "sent1": "He used all his strength to pitch the ball across the field.",
            "sent2": "The pitcher's pitch was so fast that the batter couldn't hit it.",
            "sent3": "She tried to pitch the paper airplane, but it crashed into the wall.",
            "sent4": "The pitch of the stone skipped across the water's surface.",
            "sent5": "With a swift pitch, he tossed the keys to his friend across the room."
        },
        {
            "definition": "The level or degree of something, such as intensity or difficulty.",
            "pos": "noun",
            "sent1": "The pitch of excitement in the room was palpable.",
            "sent2": "The pitch of the movie's suspense kept everyone on the edge of their seats.",
            "sent3": "The pitch of the challenge was so high that many gave up halfway.",
            "sent4": "The pitch of the argument rose as they both refused to back down.",
            "sent5": "The pitch of the storm made it impossible to hear anything else but the roaring wind."
        }
    ]
}