{
    "term": "pitchout",
    "meanings": [
        {
            "definition": "A throw made by a baseball pitcher to a base in an attempt to put out a baserunner.",
            "pos": "noun",
            "sent1": "The pitcher made a quick pitchout to catch the runner off guard.",
            "sent2": "The catcher signaled for a pitchout to try and stop the steal.",
            "sent3": "The coach's pitchout was so unexpected that the runner stumbled in surprise.",
            "sent4": "The pitchout was like a lightning bolt aimed straight at the base.",
            "sent5": "The loud thud of the pitchout hitting the baseman's glove echoed through the stadium."
        },
        {
            "definition": "A strategy in American football where the quarterback throws the ball away to avoid being sacked.",
            "pos": "noun",
            "sent1": "The quarterback executed a perfect pitchout to prevent a loss of yards.",
            "sent2": "In a tight situation, the quarterback opted for a pitchout to save the play.",
            "sent3": "The unexpected pitchout by the quarterback left the defenders puzzled.",
            "sent4": "The pitchout was a lifesaver, allowing the team to regroup for the next down.",
            "sent5": "The quarterback's quick thinking led to a successful pitchout and a reset for the offense."
        },
        {
            "definition": "To throw or toss something forcefully or with a high arc.",
            "pos": "verb",
            "sent1": "She decided to pitchout the old toys to make room for new ones.",
            "sent2": "He used all his strength to pitchout the heavy box from the attic.",
            "sent3": "The kids loved to pitchout the ball and watch it soar through the air.",
            "sent4": "With a flick of his wrist, he pitchout the frisbee into the distance.",
            "sent5": "The chef would pitchout the pizza dough high in the air before catching it skillfully."
        }
    ]
}