{
    "term": "pitched",
    "meanings": [
        {
            "definition": "To throw or toss something with force",
            "pos": "verb",
            "sent1": "He pitched the ball to his friend during the game.",
            "sent2": "She pitched the stone into the pond and watched the ripples spread.",
            "sent3": "The boy pitched the idea of a picnic to his family for the weekend.",
            "sent4": "The chef pitched the dough high in the air to make the perfect pizza crust.",
            "sent5": "The farmer pitched hay into the barn to feed the animals."
        },
        {
            "definition": "To set up or erect a tent or other temporary structure",
            "pos": "verb",
            "sent1": "They pitched their tent in the middle of the campsite.",
            "sent2": "The campers pitched their shelters quickly before the storm arrived.",
            "sent3": "The kids pitched a makeshift fort in the backyard using blankets and chairs.",
            "sent4": "The workers pitched the event canopy for the outdoor party.",
            "sent5": "The hikers pitched a small shelter to rest during their trek."
        },
        {
            "definition": "To slope or incline",
            "pos": "verb",
            "sent1": "The road pitched downward, making it easier to ride the bike.",
            "sent2": "The roof of the house pitched at a steep angle to shed snow easily.",
            "sent3": "The hillside pitched sharply, making it challenging to climb.",
            "sent4": "The ski slope pitched at a thrilling angle for experienced skiers.",
            "sent5": "The slide pitched downwards, sending the children laughing to the bottom."
        },
        {
            "definition": "To set a specific musical tone or key",
            "pos": "verb",
            "sent1": "The pianist pitched the melody in a cheerful key for the song.",
            "sent2": "The singer pitched her voice perfectly to hit the high notes.",
            "sent3": "The band pitched the tune in a lively key to get the crowd dancing.",
            "sent4": "The orchestra pitched the symphony in a grand key for the performance.",
            "sent5": "The guitarist pitched the chords in a soothing key for the ballad."
        },
        {
            "definition": "To engage in a sales pitch or presentation",
            "pos": "verb",
            "sent1": "The salesperson pitched the new product to the potential customers.",
            "sent2": "She pitched her business idea confidently to the investors.",
            "sent3": "The entrepreneur pitched his startup concept at the conference.",
            "sent4": "The team pitched their project proposal to the board of directors.",
            "sent5": "The marketer pitched the advertising campaign to the client with enthusiasm."
        }
    ]
}