{
    "term": "pitching",
    "meanings": [
        {
            "definition": "The act of throwing a baseball to a batter in a game.",
            "pos": "noun",
            "sent1": "During the baseball game, the pitcher's pitching was accurate and powerful.",
            "sent2": "The coach praised the team for their excellent pitching skills.",
            "sent3": "The pitching of the baseball made the crowd cheer with excitement.",
            "sent4": "His pitching was like a well-aimed arrow hitting the target every time.",
            "sent5": "The sound of the pitching ball echoed through the stadium."
        },
        {
            "definition": "The act of promoting or selling a product or idea.",
            "pos": "noun",
            "sent1": "The company's successful pitching of their new product led to increased sales.",
            "sent2": "She excelled in pitching the benefits of the new marketing strategy.",
            "sent3": "His enthusiastic pitching of the idea convinced everyone to join the project.",
            "sent4": "Her pitching skills in selling the product were unmatched in the market.",
            "sent5": "The team's pitching of the campaign won over many customers."
        },
        {
            "definition": "The act of setting up a tent or other temporary shelter.",
            "pos": "noun",
            "sent1": "After pitching the tent, they gathered around the campfire for stories.",
            "sent2": "The group worked together efficiently in pitching the shelter for the night.",
            "sent3": "His quick pitching of the canopy saved them from the sudden rain.",
            "sent4": "Pitching the tent felt like building a cozy home in the wilderness.",
            "sent5": "The family enjoyed pitching their camping gear for a weekend getaway."
        },
        {
            "definition": "The act of tilting or slanting in a particular direction.",
            "pos": "noun",
            "sent1": "The pitching of the ship caused some passengers to feel seasick.",
            "sent2": "The sudden pitching of the boat made it challenging to stand steady.",
            "sent3": "The unexpected pitching of the floor made it seem like a funhouse.",
            "sent4": "The pitching of the hill made the hike more adventurous and exciting.",
            "sent5": "The pitching of the tree trunk created a natural slide for the kids."
        }
    ]
}