{
    "term": "pitots",
    "meanings": [
        {
            "definition": "A device on an aircraft for measuring airspeed.",
            "pos": "noun",
            "sent1": "The pilot checked the pitots before takeoff to ensure accurate airspeed readings.",
            "sent2": "The mechanic replaced the damaged pitots on the airplane.",
            "sent3": "When the pitots got clogged with bugs, the airspeed readings went haywire!",
            "sent4": "The pitots, like vigilant sentinels, constantly monitored the airspeed of the aircraft.",
            "sent5": "The pitots hummed softly as they measured the rushing air around the plane."
        },
        {
            "definition": "A type of tube used in fluid mechanics.",
            "pos": "noun",
            "sent1": "The scientist used pitots to study the flow of liquids in the laboratory.",
            "sent2": "The engineer designed a new system with intricate pitots for precise measurements.",
            "sent3": "The pitots in the experiment were so sensitive, they could detect even the tiniest changes in fluid flow.",
            "sent4": "The pitots acted like silent observers, capturing the secrets of fluid dynamics.",
            "sent5": "The pitots whispered secrets of fluid behavior to the attentive researchers."
        },
        {
            "definition": "A type of sensor used in aviation.",
            "pos": "noun",
            "sent1": "The technician calibrated the pitots to ensure accurate readings during the flight.",
            "sent2": "Pilots rely on pitots to provide crucial data for safe navigation in the sky.",
            "sent3": "The pitots seemed to have a mind of their own, guiding the plane through the air.",
            "sent4": "The pitots acted as the eyes and ears of the aircraft, alerting the crew to any changes in airspeed.",
            "sent5": "The pitots gleamed in the sunlight, ready to assist the plane on its journey."
        }
    ]
}