{
    "term": "pity",
    "meanings": [
        {
            "definition": "the feeling of sorrow and compassion caused by the suffering and misfortunes of others",
            "pos": "noun",
            "sent1": "I felt pity for the sad puppy in the shelter.",
            "sent2": "It is natural to show pity towards those in need.",
            "sent3": "The kitten looked at me with big eyes, hoping to evoke my pity.",
            "sent4": "Her story was so heartbreaking that it stirred up deep pity within me.",
            "sent5": "The painting captured the essence of pity with its depiction of a lonely figure."
        },
        {
            "definition": "a cause for regret or disappointment",
            "pos": "noun",
            "sent1": "Losing the game was a great pity for the team.",
            "sent2": "It's a pity that the concert got canceled.",
            "sent3": "The missing ingredient was a pity, but the cake still tasted good.",
            "sent4": "The cracked mirror was a pity, reflecting a distorted image.",
            "sent5": "The torn painting was a pity, once a masterpiece now in ruins."
        },
        {
            "definition": "to feel sorrow or compassion for someone's suffering",
            "pos": "verb",
            "sent1": "I pity the lonely old man living next door.",
            "sent2": "It's hard not to pity those affected by the natural disaster.",
            "sent3": "She would often pity stray animals and bring them home.",
            "sent4": "His eyes filled with pity as he listened to her story.",
            "sent5": "The movie made me pity the character's difficult life."
        },
        {
            "definition": "to feel sorry for someone's misfortune",
            "pos": "verb",
            "sent1": "I can't help but pity her situation.",
            "sent2": "He would pity his friend's constant bad luck.",
            "sent3": "The clumsy waiter made me pity his awkwardness.",
            "sent4": "She couldn't help but pity the injured bird.",
            "sent5": "The old man's eyes seemed to pity the young boy's ignorance."
        }
    ]
}