{
    "term": "plagiarising",
    "meanings": [
        {
            "definition": "To use someone else's work or ideas as one's own without giving proper credit.",
            "pos": "verb",
            "sent1": "She got caught plagiarising her friend's essay for school.",
            "sent2": "Plagiarising is not allowed in academic writing.",
            "sent3": "The student thought plagiarising was a shortcut to success, but it only led to trouble.",
            "sent4": "Plagiarising is like trying to wear someone else's shoes and pretending they fit perfectly.",
            "sent5": "The consequences of plagiarising can be severe, so it's best to always give credit where it's due."
        },
        {
            "definition": "The act of copying someone else's work without permission.",
            "pos": "noun",
            "sent1": "Plagiarising can result in serious consequences for students.",
            "sent2": "The teacher caught him in the act of plagiarising a famous author's work.",
            "sent3": "The comedy sketch about a plagiarising parrot had everyone laughing.",
            "sent4": "In the world of art, plagiarising is like painting someone else's masterpiece and signing your name at the bottom.",
            "sent5": "The news article exposed a case of widespread plagiarising in the music industry, shocking many fans."
        },
        {
            "definition": "Taking credit for someone else's ideas or writing.",
            "pos": "noun",
            "sent1": "Plagiarising can damage a person's reputation in the academic community.",
            "sent2": "The author accused her colleague of plagiarising her research findings.",
            "sent3": "The comedy skit about a plagiarising politician had the audience in stitches.",
            "sent4": "In the business world, plagiarising is like stealing the spotlight from the true innovators.",
            "sent5": "The consequences of plagiarising someone's work can be both legal and ethical."
        }
    ]
}