{
    "term": "plagiarisms",
    "meanings": [
        {
            "definition": "The act of using someone else's work or ideas without giving proper credit.",
            "pos": "noun",
            "sent1": "She was accused of plagiarism in her essay for copying without permission.",
            "sent2": "The teacher caught two students exchanging plagiarisms during the exam.",
            "sent3": "The plagiarism in the book was so obvious that even a child could spot it.",
            "sent4": "His entire speech was a web of plagiarisms, stealing words from famous authors.",
            "sent5": "The consequences of plagiarism can be severe, leading to failing grades or even expulsion."
        },
        {
            "definition": "Instances of copying someone else's work without permission.",
            "pos": "noun",
            "sent1": "Plagiarisms were found in the research paper, leading to a failed grade.",
            "sent2": "The artist faced legal action for selling plagiarisms of famous paintings.",
            "sent3": "The plagiarisms in the movie script were so blatant, it became a joke in the industry.",
            "sent4": "Her room was filled with plagiarisms of famous artworks, all claiming to be original.",
            "sent5": "Detecting plagiarisms in academic papers has become easier with advanced software tools."
        },
        {
            "definition": "The practice of passing off someone else's work as your own.",
            "pos": "noun",
            "sent1": "His career was tarnished by the plagiarism of his colleague's ideas.",
            "sent2": "The student's plagiarism was discovered when the original author came forward.",
            "sent3": "The plagiarism of her design was so blatant that even her friends noticed.",
            "sent4": "The company faced a lawsuit for the plagiarism of a competitor's product.",
            "sent5": "Plagiarism is not only unethical but can also damage one's reputation in the long run."
        }
    ]
}