{
    "term": "plagiarism",
    "meanings": [
        {
            "definition": "The practice of taking someone else's work or ideas and passing them off as one's own.",
            "pos": "noun",
            "sent1": "Plagiarism is when you copy someone else's work and say it's yours.",
            "sent2": "She was caught for plagiarism when she copied a paragraph from the internet without citing the source.",
            "sent3": "The student tried to avoid plagiarism by writing the essay in her own words.",
            "sent4": "His plagiarism was like a shadow, following him wherever he went.",
            "sent5": "The consequences of plagiarism can be severe, leading to failing grades or even expulsion."
        },
        {
            "definition": "The act of plagiarizing; taking someone else's work or ideas and passing them off as one's own.",
            "pos": "noun",
            "sent1": "Plagiarism is a serious offense in academic settings.",
            "sent2": "The artist was accused of plagiarism after it was discovered that his painting was a copy of another artist's work.",
            "sent3": "The comedian joked about plagiarism, saying he wished he could steal jokes as effortlessly as some comedians do.",
            "sent4": "Her plagiarism was a stain on her reputation, tarnishing her credibility as a writer.",
            "sent5": "The company fired the employee for plagiarism, showing zero tolerance for intellectual theft."
        },
        {
            "definition": "An instance of plagiarizing; taking someone else's work or ideas and passing them off as one's own.",
            "pos": "noun",
            "sent1": "The professor detected plagiarism in the student's research paper.",
            "sent2": "Plagiarism can result in legal consequences if intellectual property rights are violated.",
            "sent3": "The detective in the novel uncovered a case of plagiarism in the bestselling author's manuscript.",
            "sent4": "The politician's speech was marred by accusations of plagiarism, overshadowing his message.",
            "sent5": "The consequences of plagiarism extend beyond academic dishonesty, impacting one's integrity and trustworthiness."
        }
    ]
}