{
    "term": "planetoidal",
    "meanings": [
        {
            "definition": "Resembling a planet in form or nature.",
            "pos": "adjective",
            "sent1": "The toy spaceship had a planetoidal shape, with round edges and a smooth surface.",
            "sent2": "The artist painted a beautiful planetoidal landscape, complete with swirling clouds and majestic mountains.",
            "sent3": "The planetoidal cake looked so realistic that guests thought it was a tiny world made of frosting.",
            "sent4": "Her eyes had a planetoidal quality, deep and mysterious like distant planets in the night sky.",
            "sent5": "The planetoidal sculpture in the park captured the essence of a distant world, frozen in time."
        },
        {
            "definition": "Of or relating to a planet.",
            "pos": "adjective",
            "sent1": "The scientist studied the planetoidal atmosphere, analyzing its composition and behavior.",
            "sent2": "Space missions collect data on various planetoidal phenomena to better understand our solar system.",
            "sent3": "The planetoidal weather forecast predicted clear skies and mild temperatures for the upcoming week.",
            "sent4": "Her passion for astronomy led her to pursue a career in planetoidal research and exploration.",
            "sent5": "The planetoidal orbit of the moon around the Earth fascinated astronomers for centuries."
        },
        {
            "definition": "A small celestial body resembling a planet.",
            "pos": "noun",
            "sent1": "The telescope revealed a distant planetoidal, a tiny speck of light in the vast darkness of space.",
            "sent2": "Scientists discovered a new planetoidal in our solar system, adding to the growing list of celestial bodies.",
            "sent3": "The children marveled at the planetoidal through the telescope, imagining adventures on its surface.",
            "sent4": "The planetoidal passed by Earth in a graceful dance through the cosmos, leaving astronomers in awe.",
            "sent5": "Explorers set out on a mission to study the mysterious planetoidal up close, eager to unlock its secrets."
        }
    ]
}