{
    "term": "planking",
    "meanings": [
        {
            "definition": "A method of exercise involving holding a push-up position with the body straight and rigid.",
            "pos": "noun",
            "sent1": "During gym class, we practiced planking to strengthen our core muscles.",
            "sent2": "She felt the burn in her abs while planking for a minute.",
            "sent3": "The fitness instructor joked that planking was the secret to a strong back.",
            "sent4": "His determination was like a sturdy plank while planking for a new personal record.",
            "sent5": "The image of planking on a balance beam stuck in her mind as she prepared to try it."
        },
        {
            "definition": "A method of construction using planks of wood.",
            "pos": "noun",
            "sent1": "The carpenter used planking to build a sturdy deck for the house.",
            "sent2": "The old barn was restored with traditional planking techniques.",
            "sent3": "The children built a small fort in the backyard using planking from an old fence.",
            "sent4": "The ship's hull was reinforced with thick planking to withstand rough seas.",
            "sent5": "The sound of hammering echoed through the workshop as the workers laid down the planking."
        },
        {
            "definition": "The act of lying face down with arms at the sides in an unusual or incongruous location for a photograph.",
            "pos": "noun",
            "sent1": "At the park, they couldn't resist planking on top of the picnic table for a funny picture.",
            "sent2": "The group of friends burst into laughter when they saw the hilarious planking photo.",
            "sent3": "The family reunion turned into a planking competition with everyone trying creative poses.",
            "sent4": "In the art exhibit, a sculpture of people planking in unexpected places caught everyone's attention.",
            "sent5": "The social media challenge of planking in strange locations went viral within hours."
        }
    ]
}