{
    "term": "planetesimals",
    "meanings": [
        {
            "definition": "Small celestial bodies that formed during the early stages of the solar system's evolution.",
            "pos": "noun",
            "sent1": "Scientists study planetesimals to learn about the history of our solar system.",
            "sent2": "The planetesimals collided and merged to create larger planets.",
            "sent3": "The planetesimals had a party in space to celebrate their role in forming planets.",
            "sent4": "The planetesimals danced around the sun, like tiny dancers in the cosmic ballet.",
            "sent5": "Looking through a telescope, you can see the planetesimals twinkling in the night sky."
        },
        {
            "definition": "Objects that are believed to have eventually coalesced to form planets.",
            "pos": "noun",
            "sent1": "Astronomers theorize that planetesimals came together to build the planets we know.",
            "sent2": "The planetesimals' journey ended when they transformed into full-fledged planets.",
            "sent3": "The planetesimals threw a farewell party before becoming planets, complete with asteroid cake.",
            "sent4": "The planetesimals united like pieces of a puzzle to give birth to new worlds.",
            "sent5": "In the vastness of space, the planetesimals quietly prepared to become planets."
        },
        {
            "definition": "Rocky or icy bodies that orbit a star.",
            "pos": "noun",
            "sent1": "Telescopes can detect planetesimals moving around distant stars.",
            "sent2": "The planetesimals in our solar system vary in composition and size.",
            "sent3": "The planetesimals had a race around the sun, with the comets cheering them on.",
            "sent4": "The planetesimals shimmered like jewels in the darkness of space.",
            "sent5": "Explorers dream of reaching distant planetesimals to uncover their secrets."
        }
    ]
}