{
    "term": "planche",
    "meanings": [
        {
            "definition": "A type of gymnastic move where the body is held parallel to the ground, supported only by the hands.",
            "pos": "noun",
            "sent1": "During the gymnastics competition, she amazed everyone with her flawless planche.",
            "sent2": "The gymnast practiced her planche every day to improve her strength and balance.",
            "sent3": "In a funny twist, the clown attempted a planche but ended up falling flat on his face.",
            "sent4": "Her determination to master the planche was like a tree rooted firmly in the ground.",
            "sent5": "The planche requires immense core strength and control to execute properly."
        },
        {
            "definition": "A flat, thin piece of metal or wood used for various purposes.",
            "pos": "noun",
            "sent1": "The carpenter measured the dimensions of the planche before cutting the wood.",
            "sent2": "She placed the planche on the table to create additional workspace.",
            "sent3": "The planche served as a makeshift tray for carrying snacks to the picnic.",
            "sent4": "The sunlight reflected off the shiny planche, creating a dazzling effect.",
            "sent5": "The planche was so light that it could be easily carried from one room to another."
        },
        {
            "definition": "A position in ballet where the body is held straight and horizontal, with the legs extended and toes pointed.",
            "pos": "noun",
            "sent1": "The ballerina gracefully performed the planche, showcasing her flexibility and strength.",
            "sent2": "During the ballet recital, the dancers executed a perfect planche in unison.",
            "sent3": "The ballet teacher jokingly said, 'Try not to fall asleep while holding the planche!'",
            "sent4": "Her elegant movements on stage made the planche look like a swan gliding on water.",
            "sent5": "The audience gasped in awe as the ballerina effortlessly held the planche with poise."
        }
    ]
}