{
    "term": "plaques",
    "meanings": [
        {
            "definition": "A flat, thin piece of metal or other material, typically with a design or inscription, used as an award or commemoration.",
            "pos": "noun",
            "sent1": "The school presented him with a shiny plaques for winning the science fair.",
            "sent2": "She proudly displayed her collection of plaques on the living room wall.",
            "sent3": "The cat knocked over the plaques, causing a domino effect of falling awards.",
            "sent4": "Her achievements shone brightly on the wall, like a constellation of plaques.",
            "sent5": "The plaques gleamed in the sunlight, reflecting the hard work and dedication behind each one."
        },
        {
            "definition": "A sticky film of bacteria that forms on teeth and can lead to tooth decay.",
            "pos": "noun",
            "sent1": "Brushing and flossing regularly helps prevent the buildup of plaques on your teeth.",
            "sent2": "The dentist recommended a special mouthwash to reduce plaques and maintain oral health.",
            "sent3": "The sneaky plaques on his teeth whispered, 'We will cause cavities if you don't brush!'",
            "sent4": "The plaques on her teeth were like tiny invaders, slowly damaging the enamel.",
            "sent5": "She could feel the slimy plaques on her teeth, reminding her to schedule a dental cleaning."
        },
        {
            "definition": "A patch of abnormal tissue in the body, such as in the brain or arteries.",
            "pos": "noun",
            "sent1": "The doctor discovered a dangerous plaques in his arteries during a routine check-up.",
            "sent2": "The MRI revealed a small plaques in her brain that required further examination.",
            "sent3": "The mischievous plaques in his arteries played a game of hide-and-seek with the medical team.",
            "sent4": "The plaques in her brain were like roadblocks, disrupting the normal flow of information.",
            "sent5": "The plaques in his arteries were a ticking time bomb, waiting to cause serious health issues."
        }
    ]
}