{
    "term": "plaster",
    "meanings": [
        {
            "definition": "A soft mixture of lime with sand or cement and water for spreading on walls, ceilings, or other structures to form a smooth hard surface when dried.",
            "pos": "noun",
            "sent1": "The plaster on the wall made it look smooth and clean.",
            "sent2": "The workers applied plaster to the ceiling to make it even.",
            "sent3": "The mischievous cat left paw prints in the wet plaster on the floor.",
            "sent4": "Her smile was like a fresh coat of plaster, brightening up the room.",
            "sent5": "The artist carefully sculpted the wet plaster into a beautiful design."
        },
        {
            "definition": "A bandage or strip of adhesive tape used for covering cuts or wounds.",
            "pos": "noun",
            "sent1": "After the accident, the nurse applied a plaster to the wound.",
            "sent2": "She always keeps a few plasters in her first aid kit.",
            "sent3": "The superhero's special power was healing wounds with magical plasters.",
            "sent4": "The bandage acted like a protective plaster, shielding the injury.",
            "sent5": "The colorful plaster made the injury less scary for the child."
        },
        {
            "definition": "To cover or coat with plaster.",
            "pos": "verb",
            "sent1": "They decided to plaster the old brick wall for a fresh look.",
            "sent2": "The workers will plaster the new house next week.",
            "sent3": "He tried to plaster a smile on his face despite feeling sad.",
            "sent4": "The news of her promotion seemed to plaster a grin on his face.",
            "sent5": "She plastered the poster on the wall to decorate her room."
        },
        {
            "definition": "A hard white substance made by heating limestone.",
            "pos": "noun",
            "sent1": "The sculptor used plaster to create a beautiful statue.",
            "sent2": "The ancient building was constructed using blocks of plaster.",
            "sent3": "The magician's wand was made of a mysterious type of plaster.",
            "sent4": "The moonlight reflected off the smooth surface of the plaster.",
            "sent5": "The scientist discovered a new way to strengthen plaster for buildings."
        }
    ]
}