{
    "term": "plasma",
    "meanings": [
        {
            "definition": "The liquid part of blood",
            "pos": "noun",
            "sent1": "The doctor mentioned that the plasma in my blood helps carry nutrients.",
            "sent2": "After the accident, the hospital provided a plasma transfusion to the injured patient.",
            "sent3": "I accidentally spilled some plasma on my shirt, making it look like a crime scene.",
            "sent4": "Her kindness flowed through her veins like life-giving plasma.",
            "sent5": "The plasma donation drive was a huge success, saving many lives."
        },
        {
            "definition": "A state of matter similar to gas in which a certain portion of the particles are ionized",
            "pos": "noun",
            "sent1": "Scientists study the plasma in stars to understand their composition.",
            "sent2": "Lightning is an example of plasma found in nature.",
            "sent3": "The plasma in the lightning bolt crackled like popcorn in a microwave.",
            "sent4": "The aurora borealis is a beautiful display of colorful plasma in the sky.",
            "sent5": "The plasma ball at the science museum fascinated the children."
        },
        {
            "definition": "A flat panel display technology",
            "pos": "noun",
            "sent1": "The new TV uses plasma technology for a clearer picture.",
            "sent2": "Plasma screens are known for their vibrant colors and sharp images.",
            "sent3": "The plasma TV was so thin, it looked like a futuristic window.",
            "sent4": "The plasma display on the tablet was crystal clear, making reading easy.",
            "sent5": "The store was offering a discount on plasma TVs for the holidays."
        },
        {
            "definition": "The clear yellowish fluid portion of an egg",
            "pos": "noun",
            "sent1": "When baking, it's important to separate the egg white from the plasma.",
            "sent2": "The chef carefully cracked the egg, being careful not to break the plasma.",
            "sent3": "The egg yolk and plasma mixed together, creating a unique color.",
            "sent4": "The omelette recipe called for beating the plasma until fluffy.",
            "sent5": "The cookbook explained the different properties of egg plasma."
        },
        {
            "definition": "A type of gas used in plasma cutting and welding",
            "pos": "noun",
            "sent1": "The welder used plasma to cut through the thick metal with precision.",
            "sent2": "Plasma cutting is a common technique in metal fabrication.",
            "sent3": "The sparks flew as the plasma torch sliced through the steel beam.",
            "sent4": "The artist used plasma welding to create intricate metal sculptures.",
            "sent5": "The workshop offered a course on using plasma for cutting and welding."
        }
    ]
}