{
    "term": "plasmas",
    "meanings": [
        {
            "definition": "A state of matter in which atoms are ionized and electrons are free to move",
            "pos": "noun",
            "sent1": "Scientists study plasmas to understand how atoms behave when they are charged.",
            "sent2": "The sun is made up of extremely hot plasmas that emit light and heat.",
            "sent3": "At the science fair, the student's volcano project used red-colored plasmas to simulate lava.",
            "sent4": "The lightning danced across the sky, creating a plasma of electrically charged particles.",
            "sent5": "In the laboratory, researchers observed colorful plasmas forming inside the vacuum chamber."
        },
        {
            "definition": "A fluid portion of blood containing water, electrolytes, and proteins",
            "pos": "noun",
            "sent1": "Doctors analyze plasmas in blood samples to check for any abnormalities.",
            "sent2": "The plasma in our blood helps transport nutrients and waste products throughout the body.",
            "sent3": "After the intense workout, the athlete drank a refreshing sports drink to replenish his lost plasmas.",
            "sent4": "The hospital quickly provided plasma donations to help the patient recover from severe blood loss.",
            "sent5": "The vampire myth often involves creatures that crave the plasmas of humans to survive."
        },
        {
            "definition": "A type of television screen technology using ionized gases to produce images",
            "pos": "noun",
            "sent1": "The new TV model features vibrant plasmas that enhance the viewing experience.",
            "sent2": "Many modern TVs utilize plasmas to create sharp and colorful pictures on the screen.",
            "sent3": "During the movie night, the family marveled at the realistic plasmas displayed on the television.",
            "sent4": "The artist used a unique technique to paint with glowing plasmas on the digital canvas.",
            "sent5": "The advertisement showcased the TV's advanced plasmas that deliver crystal-clear visuals."
        }
    ]
}