{
    "term": "played",
    "meanings": [
        {
            "definition": "Engaged in activity for enjoyment or recreation.",
            "pos": "adjective",
            "sent1": "The children had a fun time at the playground with their played toys.",
            "sent2": "The family had a relaxing picnic in the park with their played games.",
            "sent3": "The playful puppy chased its tail in circles, a true played sight.",
            "sent4": "The colorful carousel at the fair was a played masterpiece of joy.",
            "sent5": "The cheerful music filled the room, creating a played atmosphere."
        },
        {
            "definition": "Participated in a game or sport.",
            "pos": "verb",
            "sent1": "The kids played tag in the backyard until sunset.",
            "sent2": "The team played soccer against their rivals and won.",
            "sent3": "The monkeys played a hilarious game of catch with bananas.",
            "sent4": "The wind played with the leaves, swirling them in a dance.",
            "sent5": "The waves played with the shore, gently caressing the sand."
        },
        {
            "definition": "Performed on a musical instrument.",
            "pos": "adjective",
            "sent1": "The musician's played melodies filled the room with joy.",
            "sent2": "The band played a lively tune that got everyone dancing.",
            "sent3": "The playful piano keys danced under the musician's fingers.",
            "sent4": "The violin played a sweet serenade under the moonlight.",
            "sent5": "The guitar played a soulful melody that touched hearts."
        },
        {
            "definition": "Acted a role in a theatrical production.",
            "pos": "verb",
            "sent1": "She played the lead role in the school play with enthusiasm.",
            "sent2": "The actor played the villain in the movie with great skill.",
            "sent3": "The cat played the role of a detective in the funny video.",
            "sent4": "The shadows played on the wall, creating a mysterious scene.",
            "sent5": "The fireflies played in the night sky, lighting up the darkness."
        },
        {
            "definition": "Manipulated or handled something in a skillful manner.",
            "pos": "verb",
            "sent1": "The magician played with cards, dazzling the audience.",
            "sent2": "The chef played with flavors to create a delicious dish.",
            "sent3": "The mechanic played with the engine, fixing it in no time.",
            "sent4": "The artist played with colors, creating a vibrant painting.",
            "sent5": "The sculptor played with clay, shaping it into a masterpiece."
        }
    ]
}