{
    "term": "playacts",
    "meanings": [
        {
            "definition": "Pretends to be someone else for fun or deception.",
            "pos": "verb",
            "sent1": "At recess, Sarah playacts being a superhero, saving her friends from imaginary villains.",
            "sent2": "The children playacts being pirates, searching for hidden treasure in the backyard.",
            "sent3": "During the school play, the actor playacts being a ghost, floating around the stage with a white sheet.",
            "sent4": "In the spy-themed birthday party, the kids playacts being secret agents, sneaking around to solve clues.",
            "sent5": "The young girl playacts being a chef, pretending to cook up delicious meals in her toy kitchen."
        },
        {
            "definition": "Engages in dramatic or theatrical performances.",
            "pos": "verb",
            "sent1": "The actors playacts their roles with passion and emotion, bringing the characters to life on stage.",
            "sent2": "During the play rehearsal, the lead actress playacts her lines, practicing her delivery for the audience.",
            "sent3": "In the drama club, the students playacts various scenes from famous plays, exploring different characters.",
            "sent4": "The theater group playacts a Shakespearean play, captivating the audience with their performance.",
            "sent5": "The talented singer playacts a famous musical, showcasing her vocal range and acting skills."
        },
        {
            "definition": "Behaves in a way that is not genuine or sincere.",
            "pos": "adjective",
            "sent1": "His playacts smile didn't reach his eyes, revealing his true feelings of disappointment.",
            "sent2": "She gave a playacts apology, but everyone could tell she wasn't truly sorry for her actions.",
            "sent3": "The politician's playacts promises were met with skepticism by the voters.",
            "sent4": "The salesman's playacts enthusiasm for the product seemed forced and insincere.",
            "sent5": "The student's playacts interest in the lecture was evident as he kept checking his phone during class."
        }
    ]
}