{
    "term": "playmaker",
    "meanings": [
        {
            "definition": "a person who makes plays, especially in sports",
            "pos": "noun",
            "sent1": "The basketball team's playmaker passed the ball to his teammate for an easy layup.",
            "sent2": "The soccer playmaker dribbled past defenders to set up a goal-scoring opportunity.",
            "sent3": "The football playmaker pretended to pass but then surprised everyone by running for a touchdown.",
            "sent4": "In the game, she was the playmaker, orchestrating every move like a skilled conductor.",
            "sent5": "The hockey playmaker's precision in passing made the team unstoppable."
        },
        {
            "definition": "a player who creates scoring opportunities for teammates",
            "pos": "noun",
            "sent1": "The volleyball playmaker set up her teammates perfectly for powerful spikes.",
            "sent2": "The basketball playmaker's assists led to many points for the team.",
            "sent3": "During the game, the playmaker's passes were like magic tricks, surprising the opponents.",
            "sent4": "She was the playmaker on the field, weaving through defenders to create chances like an artist.",
            "sent5": "The playmaker's vision on the court made scoring goals look effortless for the team."
        },
        {
            "definition": "someone who is skilled at making strategic decisions or influencing outcomes",
            "pos": "noun",
            "sent1": "As a business playmaker, she always knew the right moves to make for success.",
            "sent2": "The political playmaker orchestrated a brilliant campaign that led to victory.",
            "sent3": "The playmaker at the negotiation table had everyone agreeing to his terms without realizing it.",
            "sent4": "In the meeting, she was the playmaker, guiding the discussion towards a beneficial outcome.",
            "sent5": "The playmaker's clever tactics turned the tide in their favor, surprising everyone."
        }
    ]
}