{
    "term": "playboy",
    "meanings": [
        {
            "definition": "A wealthy man who spends his time enjoying himself, especially one who behaves irresponsibly or is sexually promiscuous.",
            "pos": "noun",
            "sent1": "The playboy drove his fancy car around town, showing off his wealth.",
            "sent2": "The playboy was always surrounded by beautiful women at the club.",
            "sent3": "The playboy's extravagant lifestyle often landed him in trouble with the law.",
            "sent4": "His reputation as a playboy made him the talk of the town.",
            "sent5": "The playboy's lavish parties were the envy of all his friends."
        },
        {
            "definition": "A man who is devoted to a life of leisure and pleasure, often involving socializing and partying.",
            "pos": "noun",
            "sent1": "The young playboy spent his days lounging by the pool and his nights at the hottest clubs.",
            "sent2": "The playboy was always the life of the party, charming everyone with his wit and charisma.",
            "sent3": "Despite his carefree attitude, the playboy was surprisingly good at chess.",
            "sent4": "In the world of socialites, he was known as the ultimate playboy.",
            "sent5": "The playboy's carefree attitude was infectious, drawing others into his world of fun and excitement."
        },
        {
            "definition": "A lifestyle characterized by luxury, indulgence, and pursuit of pleasure.",
            "pos": "noun",
            "sent1": "The playboy's penthouse apartment was filled with expensive furniture and artwork.",
            "sent2": "Living the playboy lifestyle meant never having to worry about money or responsibilities.",
            "sent3": "Despite his playboy image, he secretly enjoyed quiet nights at home with a good book.",
            "sent4": "Her friends often joked that she lived like a modern-day playboy, always jet-setting to exotic locations.",
            "sent5": "The playboy's Instagram was a constant stream of envy-inducing photos from his luxurious vacations."
        }
    ]
}