{
    "term": "plays",
    "meanings": [
        {
            "definition": "Engage in activity for enjoyment and recreation.",
            "pos": "verb",
            "sent1": "On weekends, she plays with her friends at the park.",
            "sent2": "The children play with their toys happily.",
            "sent3": "He plays around with his siblings, making them laugh.",
            "sent4": "Her laughter plays like music in the air.",
            "sent5": "The colorful playground plays a vital role in their fun."
        },
        {
            "definition": "Perform in a theatrical production.",
            "pos": "verb",
            "sent1": "She plays the lead role in the school play.",
            "sent2": "The actors play their parts with passion on stage.",
            "sent3": "He plays a clown in the play, bringing joy to the audience.",
            "sent4": "The emotions play out beautifully in their performance.",
            "sent5": "The spotlight plays on the talented actress, highlighting her skills."
        },
        {
            "definition": "Participate in a game or sport.",
            "pos": "verb",
            "sent1": "He plays soccer every Saturday with his team.",
            "sent2": "The kids play basketball after school.",
            "sent3": "She plays fair and square in every match.",
            "sent4": "The ball plays like a living thing in his skilled hands.",
            "sent5": "The competitive spirit plays a big role in their games."
        },
        {
            "definition": "Operate a musical instrument or device.",
            "pos": "verb",
            "sent1": "She plays the piano beautifully at the recital.",
            "sent2": "He plays the guitar in a band with his friends.",
            "sent3": "The musician plays a tune that touches the heart.",
            "sent4": "The melody plays softly in the background, creating a soothing atmosphere.",
            "sent5": "The notes play harmoniously together, creating a magical sound."
        },
        {
            "definition": "Manipulate or handle something in a skillful manner.",
            "pos": "verb",
            "sent1": "He plays the cards expertly, winning every game.",
            "sent2": "She plays the puzzle with ease, fitting the pieces perfectly.",
            "sent3": "The chef plays with flavors, creating a unique dish.",
            "sent4": "His fingers play over the keyboard effortlessly, typing at lightning speed.",
            "sent5": "The artist plays with colors, blending them beautifully on the canvas."
        }
    ]
}