{
    "term": "play",
    "meanings": [
        {
            "definition": "Engage in activity for enjoyment and recreation.",
            "pos": "verb",
            "sent1": "Children love to play outside in the park.",
            "sent2": "Let's play a fun game of tag together.",
            "sent3": "The cat tried to play with the butterfly but couldn't catch it.",
            "sent4": "Her laughter played like music in the air.",
            "sent5": "The colorful playground equipment invited the children to play joyfully."
        },
        {
            "definition": "Perform on a musical instrument.",
            "pos": "verb",
            "sent1": "She will play the piano at the concert tonight.",
            "sent2": "The band will play their new song for the audience.",
            "sent3": "The musician decided to play a lullaby on the guitar.",
            "sent4": "The notes from the violin played softly in the background.",
            "sent5": "His fingers danced on the guitar strings as he played a cheerful tune."
        },
        {
            "definition": "Participate in a sport or game.",
            "pos": "verb",
            "sent1": "We can play soccer at the park this weekend.",
            "sent2": "Let's play basketball with our friends after school.",
            "sent3": "The team decided to play a friendly match against their rivals.",
            "sent4": "Their skills on the field played a crucial role in winning the game.",
            "sent5": "The crowd cheered as the players continued to play with determination."
        },
        {
            "definition": "Pretend to be someone or something.",
            "pos": "verb",
            "sent1": "The children like to play pirates in the backyard.",
            "sent2": "Let's play house and pretend to be a family.",
            "sent3": "She decided to play the role of a detective during the game.",
            "sent4": "His disguise played a trick on his friends during the party.",
            "sent5": "The actors will play different characters in the upcoming play."
        },
        {
            "definition": "Operate a recording or video.",
            "pos": "verb",
            "sent1": "You can play the movie on the TV now.",
            "sent2": "Let's play the new song on the stereo system.",
            "sent3": "He will play the video to show us his vacation adventures.",
            "sent4": "The DVD player played the film smoothly without any interruptions.",
            "sent5": "The projector will play the presentation for the entire audience."
        }
    ]
}