{
    "term": "pledge",
    "meanings": [
        {
            "definition": "A solemn promise or undertaking.",
            "pos": "noun",
            "sent1": "During the ceremony, they made a pledge to always be there for each other.",
            "sent2": "She kept her pledge to help her friend in times of need.",
            "sent3": "The pledge to always share their snacks became a running joke among friends.",
            "sent4": "His pledge to protect her was as strong as a suit of armor.",
            "sent5": "The pledge to never give up echoed in their hearts like a steady drumbeat."
        },
        {
            "definition": "A formal promise or agreement to do something.",
            "pos": "noun",
            "sent1": "The company signed a pledge to reduce their carbon footprint by 50%.",
            "sent2": "Her pledge to volunteer at the shelter every weekend was commendable.",
            "sent3": "The pledge to always bring cookies to the meetings was met with cheers.",
            "sent4": "Their pledge to work together harmoniously was the key to their success.",
            "sent5": "The pledge to always be honest created a strong bond of trust among them."
        },
        {
            "definition": "Something given as security for the performance of an action.",
            "pos": "noun",
            "sent1": "He left his watch as a pledge for borrowing the book.",
            "sent2": "The necklace served as a pledge for the loan she received.",
            "sent3": "The puppy was the pledge for their agreement to paint the fence.",
            "sent4": "The antique vase was the pledge for the deal they made.",
            "sent5": "The rare coin was the pledge for the antique shop owner's promise."
        },
        {
            "definition": "To promise or undertake to do something.",
            "pos": "verb",
            "sent1": "She would always pledge to support her friends in their endeavors.",
            "sent2": "He pledged to donate a portion of his earnings to charity.",
            "sent3": "The kids pledged to finish their homework before playing outside.",
            "sent4": "They pledged to always stand by each other through thick and thin.",
            "sent5": "He pledged to never forget the lessons his grandmother taught him."
        },
        {
            "definition": "To commit oneself to a particular course of action.",
            "pos": "verb",
            "sent1": "He decided to pledge his loyalty to the king and serve him faithfully.",
            "sent2": "She pledged to work hard and achieve her dreams no matter what.",
            "sent3": "The team pledged to train diligently for the upcoming championship.",
            "sent4": "They pledged to fight for justice and equality in their community.",
            "sent5": "She pledged to always strive for excellence in everything she did."
        }
    ]
}