{
    "term": "plethysmography",
    "meanings": [
        {
            "definition": "The process of measuring changes in volume in an organ or body part.",
            "pos": "noun",
            "sent1": "The doctor used plethysmography to check the size of my lungs.",
            "sent2": "Researchers used plethysmography to study how the heart changes in size during exercise.",
            "sent3": "During the experiment, the plethysmography machine beeped every time the balloon expanded.",
            "sent4": "Her love for animals was like plethysmography, always expanding and growing.",
            "sent5": "The plethysmography results were as clear as a sunny day, showing the exact volume changes."
        },
        {
            "definition": "A technique used to measure blood flow in the body.",
            "pos": "noun",
            "sent1": "The hospital used plethysmography to monitor blood flow in the patient's leg.",
            "sent2": "Plethysmography is a valuable tool in understanding how blood circulates in the body.",
            "sent3": "The nurse joked that the plethysmography machine was like a blood flow detective.",
            "sent4": "His passion for music flowed through him like the plethysmography of a river.",
            "sent5": "The plethysmography results painted a vivid picture of the blood flow patterns in the body."
        },
        {
            "definition": "The study or measurement of changes in volume in a biological system.",
            "pos": "noun",
            "sent1": "Scientists use plethysmography to analyze volume changes in plant cells.",
            "sent2": "Plethysmography helps researchers understand how volume fluctuations affect biological processes.",
            "sent3": "The students found the plethysmography experiment on yeast cells surprisingly interesting.",
            "sent4": "Her emotions swelled and shrank like the plethysmography of a living organism.",
            "sent5": "The plethysmography data revealed the intricate dance of volume changes within the biological system."
        }
    ]
}