{
    "term": "plight",
    "meanings": [
        {
            "definition": "A dangerous, difficult, or otherwise unfortunate situation.",
            "pos": "noun",
            "sent1": "The hiker found himself in a plight when he got lost in the dense forest.",
            "sent2": "The villagers faced a plight when their crops were destroyed by the storm.",
            "sent3": "The comical play highlighted the characters' exaggerated plights for comedic effect.",
            "sent4": "In the game, the player must navigate through various plights to reach the final level.",
            "sent5": "The movie portrayed the protagonist's plight with such intensity that it moved the audience to tears."
        },
        {
            "definition": "To promise or pledge solemnly.",
            "pos": "verb",
            "sent1": "She had to plight her loyalty to the king before being accepted into the royal court.",
            "sent2": "The couple decided to plight their love for each other in a beautiful ceremony.",
            "sent3": "He jokingly plighted to always finish his friend's snacks whenever they went out.",
            "sent4": "The knight plighted to defend the kingdom against any threats that may arise.",
            "sent5": "The students plighted to uphold the school's honor code throughout their academic journey."
        },
        {
            "definition": "To give or pledge (one's troth).",
            "pos": "verb",
            "sent1": "The bride and groom plighted their troth in front of their family and friends.",
            "sent2": "They decided to plight their troth to always support each other through thick and thin.",
            "sent3": "The siblings plighted their troth to always share their toys and games with each other.",
            "sent4": "The allies plighted their troth to stand united against any common enemies.",
            "sent5": "The team plighted their troth to work together towards achieving their shared goals."
        }
    ]
}