{
    "term": "pliotrons",
    "meanings": [
        {
            "definition": "A unit of measurement for the amount of radiation absorbed by a living organism.",
            "pos": "noun",
            "sent1": "The scientist measured the pliotrons to determine the radiation exposure of the patient.",
            "sent2": "The dosimeter recorded the number of pliotrons absorbed by the body during the X-ray.",
            "sent3": "The pliotrons in the lab were so high that the Geiger counter went crazy!",
            "sent4": "Her body felt like a magnet attracting pliotrons after the radiation therapy.",
            "sent5": "The pliotrons danced on the screen, showing the impact of the radioactive material."
        },
        {
            "definition": "A type of subatomic particle that is a constituent of atomic nuclei.",
            "pos": "noun",
            "sent1": "The physicist studied the behavior of pliotrons within the nucleus of an atom.",
            "sent2": "Pliotrons play a crucial role in the stability of atomic structures.",
            "sent3": "The pliotrons in the nucleus were having a party, bouncing around happily.",
            "sent4": "The pliotrons acted like tiny glue, holding the nucleus together.",
            "sent5": "The pliotrons were like tiny building blocks constructing the atomic core."
        },
        {
            "definition": "A device used in particle accelerators to increase the energy of charged particles.",
            "pos": "noun",
            "sent1": "The technician adjusted the pliotrons to enhance the particle acceleration process.",
            "sent2": "Pliotrons are essential components in boosting particle speeds in accelerators.",
            "sent3": "The pliotrons in the accelerator seemed to have a mind of their own, speeding up particles unexpectedly.",
            "sent4": "The pliotrons worked like energetic boosters, propelling particles to high velocities.",
            "sent5": "The pliotrons hummed with power, pushing the particles to breakneck speeds."
        }
    ]
}