{
    "term": "ploughhead",
    "meanings": [
        {
            "definition": "The front part of a plough.",
            "pos": "noun",
            "sent1": "The farmer attached the ploughhead to the plough before starting the field work.",
            "sent2": "The ploughhead is essential for guiding the plough through the soil.",
            "sent3": "The ploughhead decided to take a break and let the rest of the plough do the work for a change.",
            "sent4": "As the ploughhead of the team, she led them through the challenges with determination.",
            "sent5": "The shiny ploughhead gleamed in the sunlight as it sliced through the earth."
        },
        {
            "definition": "A person who leads or directs a group or activity.",
            "pos": "noun",
            "sent1": "The ploughhead instructed the workers on how to plant the seeds efficiently.",
            "sent2": "She was a natural ploughhead, always guiding her friends in the right direction.",
            "sent3": "The ploughhead made everyone laugh with their silly dance moves during the team meeting.",
            "sent4": "Like a ploughhead in a field, he cut through the obstacles to reach his goals.",
            "sent5": "The ploughhead's confident voice resonated across the room, commanding attention from all."
        },
        {
            "definition": "A tool used for breaking up soil.",
            "pos": "noun",
            "sent1": "The farmer grabbed the ploughhead to prepare the land for planting.",
            "sent2": "Using the ploughhead, he loosened the soil to make it easier for the seeds to grow.",
            "sent3": "The mischievous dog buried the bone right next to the ploughhead, thinking it was a great hiding spot.",
            "sent4": "The ploughhead cut through the earth like a knife through butter, creating neat furrows for the seeds.",
            "sent5": "With each strike, the ploughhead turned the rough soil into a fertile ground ready for cultivation."
        }
    ]
}