{
    "term": "pluckinesses",
    "meanings": [
        {
            "definition": "The quality of being courageous or determined.",
            "pos": "noun",
            "sent1": "Her pluckinesses shone through when she stood up to the bully at school.",
            "sent2": "The firefighter's pluckinesses were evident as he ran into the burning building to save the family.",
            "sent3": "Despite her small size, her pluckinesses made her a formidable opponent in the wrestling match.",
            "sent4": "The pluckinesses of the underdog team led them to victory against the reigning champions.",
            "sent5": "His pluckinesses in the face of danger inspired others to be brave as well."
        },
        {
            "definition": "The act of showing bravery or spirit.",
            "pos": "noun",
            "sent1": "The pluckinesses displayed by the soldier in battle earned him a medal of honor.",
            "sent2": "Cheering on her teammates with pluckinesses, she motivated them to give their best effort.",
            "sent3": "The kitten's pluckinesses in chasing after the big dog was both brave and amusing.",
            "sent4": "Her pluckinesses on the dance floor were like a burst of energy in the room.",
            "sent5": "The pluckinesses of the young artist to pursue her dreams despite criticism was admirable."
        },
        {
            "definition": "The state of having a bold or fearless attitude.",
            "pos": "noun",
            "sent1": "His pluckinesses in trying new things always led to exciting adventures.",
            "sent2": "The explorer's pluckinesses in the face of danger made him a legend in the history books.",
            "sent3": "The pluckinesses of the squirrel trying to steal nuts from the bird feeder was both daring and funny.",
            "sent4": "Her pluckinesses in speaking up for what she believed in inspired others to do the same.",
            "sent5": "The pluckinesses of the young detective to solve the case impressed even the seasoned officers."
        }
    ]
}