{
    "term": "pluck",
    "meanings": [
        {
            "definition": "To pull or pick off or out quickly",
            "pos": "verb",
            "sent1": "She had to pluck the flower from the garden.",
            "sent2": "The chef needed to pluck the feathers from the chicken.",
            "sent3": "He tried to pluck the idea from his mind like a stubborn weed.",
            "sent4": "The magician seemed to pluck the rabbit out of thin air.",
            "sent5": "The wind plucked the hat from her head and carried it away."
        },
        {
            "definition": "To pull at or remove with a sudden movement",
            "pos": "verb",
            "sent1": "The child tried to pluck the toy from the shelf.",
            "sent2": "She plucked the pen from his hand before he could write.",
            "sent3": "The cat tried to pluck the toy mouse from under the couch.",
            "sent4": "The storm plucked the leaves from the trees with great force.",
            "sent5": "The bird plucked the worm from the ground and flew away."
        },
        {
            "definition": "To play (a stringed instrument) by plucking the strings with the fingers",
            "pos": "verb",
            "sent1": "He learned to pluck the guitar strings with ease.",
            "sent2": "She plucked the harp strings gently, creating a soothing melody.",
            "sent3": "The musician tried to pluck the strings faster than ever before.",
            "sent4": "The sound of the violin plucking the heartstrings echoed in the hall.",
            "sent5": "The banjo player plucked the strings with incredible speed and skill."
        },
        {
            "definition": "Spirited and determined courage or resourcefulness",
            "pos": "noun",
            "sent1": "Her pluck in the face of danger inspired others around her.",
            "sent2": "The team showed great pluck in their efforts to win the game.",
            "sent3": "His pluck in trying times earned him the respect of his peers.",
            "sent4": "The pluck of the underdog team surprised everyone with their victory.",
            "sent5": "The explorer's pluck in the face of adversity led to new discoveries."
        }
    ]
}