{
    "term": "plugged",
    "meanings": [
        {
            "definition": "Filled or blocked with something",
            "pos": "adjective",
            "sent1": "The sink was plugged with hair, causing the water to not drain properly.",
            "sent2": "The bottle was plugged with a cork to keep the liquid inside.",
            "sent3": "The key got plugged in the lock, and I couldn't open the door!",
            "sent4": "Her mind was plugged with worry, making it hard for her to focus on anything else.",
            "sent5": "The road was plugged with cars, creating a traffic jam for miles."
        },
        {
            "definition": "Connected to an electrical outlet",
            "pos": "adjective",
            "sent1": "The lamp was plugged into the wall socket to provide light in the room.",
            "sent2": "Make sure the charger is plugged into the power source to charge your phone.",
            "sent3": "The TV was plugged in, but the remote control was nowhere to be found!",
            "sent4": "His phone was plugged in all night, ensuring it was fully charged by morning.",
            "sent5": "The vacuum cleaner was plugged into the outlet, ready to clean the carpet."
        },
        {
            "definition": "Promoted or advertised",
            "pos": "verb",
            "sent1": "The new movie was plugged on billboards all over the city.",
            "sent2": "The company plugged their latest product during the commercial break.",
            "sent3": "She plugged her friend's art exhibition to everyone she met.",
            "sent4": "The singer plugged her upcoming concert during the radio interview.",
            "sent5": "The politician plugged his campaign promises in every speech he gave."
        },
        {
            "definition": "Driven or hit forcefully",
            "pos": "verb",
            "sent1": "The nail was plugged into the wood with a hammer.",
            "sent2": "The soccer player plugged the ball into the net with a powerful kick.",
            "sent3": "He plugged the golf ball across the green, aiming for the hole.",
            "sent4": "The boxer plugged his opponent with a series of quick punches.",
            "sent5": "The storm plugged the tree branches together, creating a natural barrier."
        }
    ]
}