{
    "term": "plug",
    "meanings": [
        {
            "definition": "A piece of solid material fitting tightly into a hole and blocking it up.",
            "pos": "noun",
            "sent1": "I used a plug to stop the water from leaking out of the sink.",
            "sent2": "The electrician inserted the plug into the socket to power up the lamp.",
            "sent3": "The mischievous squirrel thought the plug in the tree was a nut and tried to store it for winter.",
            "sent4": "Her laughter was like a plug, filling the room with joy and warmth.",
            "sent5": "The cork acted as a plug, sealing the bottle of wine perfectly."
        },
        {
            "definition": "A device for making an electrical connection, especially between an appliance and a power supply.",
            "pos": "noun",
            "sent1": "Don't forget to unplug the device before moving it.",
            "sent2": "She inserted the plug into the wall to charge her phone.",
            "sent3": "The plug and the socket were best friends, always connecting and disconnecting.",
            "sent4": "His words were like a plug, sparking inspiration in everyone who listened.",
            "sent5": "The plug clicked into place, sending power to the computer."
        },
        {
            "definition": "To fill or close up a hole or opening with a plug.",
            "pos": "verb",
            "sent1": "I need to plug the hole in the boat to stop it from sinking.",
            "sent2": "He decided to plug the leak in the roof before the rain started.",
            "sent3": "She tried to plug the leak with chewing gum, but it didn't work.",
            "sent4": "His music plugged the silence in the room, filling it with melody.",
            "sent5": "The flowers plugged the garden with bursts of color."
        },
        {
            "definition": "To promote or advertise (a product or service) in a particular way.",
            "pos": "verb",
            "sent1": "The company hired a famous celebrity to plug their new product.",
            "sent2": "She always finds creative ways to plug her artwork on social media.",
            "sent3": "The comedian tried to plug his show during the serious interview.",
            "sent4": "Her smile plugged the room with positivity, making everyone feel happy.",
            "sent5": "The bright neon sign plugged the nightclub, attracting customers from afar."
        }
    ]
}