{
    "term": "plumbism",
    "meanings": [
        {
            "definition": "The condition of being poisoned by lead.",
            "pos": "noun",
            "sent1": "After playing with old lead paint, the child developed plumbism.",
            "sent2": "The doctor diagnosed the patient with plumbism after conducting blood tests.",
            "sent3": "The detective suspected foul play when multiple residents in the old building showed signs of plumbism.",
            "sent4": "The effects of plumbism on the body can be as silent and dangerous as a hidden poison.",
            "sent5": "The dangers of plumbism should never be underestimated, especially in older homes."
        },
        {
            "definition": "The act of testing the verticality of something.",
            "pos": "noun",
            "sent1": "The carpenter used a plumb line to ensure the plumbism of the newly constructed wall.",
            "sent2": "Before hanging the picture frame, she checked its plumbism using a level.",
            "sent3": "The comedian joked about his terrible sense of plumbism when it came to hanging shelves.",
            "sent4": "Her sense of plumbism was so accurate, she could tell if a surface was level with just a glance.",
            "sent5": "The precision of plumbism is crucial in construction to avoid any structural issues."
        },
        {
            "definition": "A person who specializes in installing and repairing pipes and fixtures.",
            "pos": "noun",
            "sent1": "The plumbism arrived promptly to fix the leaky faucet in the kitchen.",
            "sent2": "The homeowner called a plumbism to install a new shower system in the bathroom.",
            "sent3": "The plumbism had a great sense of humor, always cracking jokes while working on pipes.",
            "sent4": "The plumbism's expertise in pipe fittings was unmatched in the local area.",
            "sent5": "Becoming a skilled plumbism requires years of training and hands-on experience."
        }
    ]
}