{
    "term": "plumbings",
    "meanings": [
        {
            "definition": "The system of pipes, tanks, fittings, and other apparatus required for the water supply, heating, and sanitation in a building.",
            "pos": "noun",
            "sent1": "The plumbings in our house ensure clean water reaches every faucet.",
            "sent2": "The plumber fixed the plumbings in the bathroom to stop the leak.",
            "sent3": "I never appreciated the importance of plumbings until our toilet got clogged.",
            "sent4": "The intricate network of plumbings in the city flowed like veins carrying life-giving water.",
            "sent5": "The old house had rusty plumbings that groaned and complained with every use."
        },
        {
            "definition": "The work of installing and maintaining plumbing systems.",
            "pos": "noun",
            "sent1": "His expertise in plumbings made him the go-to person for any pipe-related issues.",
            "sent2": "Plumbings require precision and attention to detail to function properly.",
            "sent3": "The comedy show featured a hilarious skit about the challenges of plumbings.",
            "sent4": "Her dedication to plumbings was as solid as the pipes she worked with.",
            "sent5": "Learning about plumbings opened up a whole new world of possibilities for him."
        },
        {
            "definition": "The act of using a plumb line to determine the verticality of a structure.",
            "pos": "noun",
            "sent1": "The construction worker checked the plumbings of the wall before proceeding.",
            "sent2": "Accuracy in plumbings is crucial to ensure the building stands straight.",
            "sent3": "The magician used plumbings in his act to create an illusion of levitation.",
            "sent4": "The plumbings of the tower were so precise that it seemed to touch the sky.",
            "sent5": "The architect's attention to detail in the plumbings of the structure was evident in its flawless design."
        }
    ]
}