{
    "term": "plumed",
    "meanings": [
        {
            "definition": "Having feathers or feather-like projections",
            "pos": "adjective",
            "sent1": "The majestic peacock displayed its plumed tail.",
            "sent2": "The plumed bird soared gracefully through the sky.",
            "sent3": "The plumed hat made the clown look like a colorful bird.",
            "sent4": "Her plumed costume transformed her into a beautiful swan.",
            "sent5": "The plumed headdress shimmered in the sunlight, catching everyone's eye."
        },
        {
            "definition": "Adorned with or resembling a plume",
            "pos": "adjective",
            "sent1": "The plumed warrior stood out in the battlefield.",
            "sent2": "The tree's plumed branches swayed in the breeze.",
            "sent3": "The plumed vase added a touch of elegance to the room.",
            "sent4": "Her plumed fan looked like a delicate work of art.",
            "sent5": "The plumed crown sparkled with jewels, fit for a king."
        },
        {
            "definition": "To deck or dress with plumes",
            "pos": "verb",
            "sent1": "She plumed her hat with colorful feathers for the parade.",
            "sent2": "The dancers plumed their costumes for the carnival.",
            "sent3": "He plumed his outfit with feathers, ready for the masquerade ball.",
            "sent4": "The actress plumed her gown with ostrich feathers for the red carpet event.",
            "sent5": "The chef plumed the cake with edible feathers for the themed party."
        },
        {
            "definition": "To pride or congratulate oneself on an achievement",
            "pos": "verb",
            "sent1": "After winning the race, he plumed with satisfaction.",
            "sent2": "She plumed herself on completing the difficult puzzle.",
            "sent3": "He plumed a little too much after scoring the winning goal.",
            "sent4": "The artist plumed over the masterpiece she had created.",
            "sent5": "The student plumed proudly after acing the exam."
        }
    ]
}