{
    "term": "plumb",
    "meanings": [
        {
            "definition": "A weight on the end of a line used to determine verticality",
            "pos": "noun",
            "sent1": "The plumb helped the workers make sure the wall was straight.",
            "sent2": "The construction worker used a plumb to check if the post was upright.",
            "sent3": "The mischievous cat played with the plumb, thinking it was a toy.",
            "sent4": "Her gaze was as steady and true as a plumb line.",
            "sent5": "The old sailor's plumb swung gently, showing the way down."
        },
        {
            "definition": "Completely vertical",
            "pos": "adjective",
            "sent1": "The flagpole stood plumb in the center of the park.",
            "sent2": "The tower was built to be plumb, reaching high into the sky.",
            "sent3": "The plumb tree's branches seemed to defy gravity, growing straight up.",
            "sent4": "Her hair fell plumb down her back like a waterfall of silk.",
            "sent5": "The plumb line hung perfectly straight, a testament to the builder's skill."
        },
        {
            "definition": "To measure the depth of water",
            "pos": "verb",
            "sent1": "The fisherman used a plumb line to measure the depth of the lake.",
            "sent2": "She carefully plumb the river to find the best spot for fishing.",
            "sent3": "The children pretended to plumb the puddle with a stick, giggling.",
            "sent4": "His curiosity led him to plumb the mysterious depths of the ocean.",
            "sent5": "The explorer decided to plumb the river's secrets, diving in with determination."
        },
        {
            "definition": "To examine thoroughly or deeply",
            "pos": "verb",
            "sent1": "The detective tried to plumb the depths of the mysterious case.",
            "sent2": "She wanted to plumb the meaning behind his cryptic message.",
            "sent3": "The scientist tried to plumb the secrets of the universe, lost in thought.",
            "sent4": "Her eyes seemed to plumb his soul, searching for the truth within.",
            "sent5": "The writer's words plumb the emotions of the reader, touching hearts with each line."
        }
    ]
}