{
    "term": "plumbums",
    "meanings": [
        {
            "definition": "A heavy, bluish-white metallic element that is highly toxic and used in various applications, especially in batteries and radiation shielding.",
            "pos": "noun",
            "sent1": "The scientist studied the properties of plumbums in the laboratory.",
            "sent2": "The factory worker handled the plumbums carefully to avoid any accidents.",
            "sent3": "The curious cat accidentally knocked over a container of plumbums, creating a mess.",
            "sent4": "The plumbums in the storage room gleamed under the bright lights.",
            "sent5": "The artist used plumbums to create a unique sculpture for the exhibition."
        },
        {
            "definition": "To test or adjust the verticality or alignment of something, typically using a plumb line.",
            "pos": "verb",
            "sent1": "The construction worker plumbums the wall to ensure it is straight.",
            "sent2": "She carefully plumbums the door frame before installing it.",
            "sent3": "The magician pretended to plumbums his assistant in a comical act.",
            "sent4": "The dancer's movements were so precise, it seemed as if she could plumbums herself in mid-air.",
            "sent5": "The teacher asked the students to plumbums their drawings to make sure they were aligned correctly."
        },
        {
            "definition": "A weight attached to a line used to determine the depth of water or to ensure vertical alignment.",
            "pos": "noun",
            "sent1": "The fisherman used a plumbums to measure the depth of the lake.",
            "sent2": "The sailor checked the plumbums before dropping anchor.",
            "sent3": "The mischievous child tied a toy to the plumbums and pretended it was a spaceship.",
            "sent4": "The old well had a rusty plumbums hanging next to it.",
            "sent5": "The explorer relied on the plumbums to guide the underwater mapping expedition."
        }
    ]
}