{
    "term": "plunge",
    "meanings": [
        {
            "definition": "To jump or dive quickly and energetically into water.",
            "pos": "verb",
            "sent1": "The kids love to plunge into the pool on hot days.",
            "sent2": "She decided to plunge into the ocean to cool off.",
            "sent3": "As the sun beat down, they couldn't resist the urge to plunge into the refreshing water.",
            "sent4": "The daredevil dared to plunge from the high dive into the deep end of the pool.",
            "sent5": "With a loud splash, he took a daring plunge off the cliff into the crystal-clear lake."
        },
        {
            "definition": "To fall or drop suddenly and uncontrollably.",
            "pos": "verb",
            "sent1": "The hiker accidentally stepped too close to the edge and began to plunge down the steep slope.",
            "sent2": "The stock market can plunge unexpectedly, causing panic among investors.",
            "sent3": "The clumsy waiter managed to plunge headfirst into the cake he was carrying.",
            "sent4": "The darkness seemed to plunge the room into a deep, eerie silence.",
            "sent5": "The roller coaster made her stomach plunge as it rapidly descended down the steep track."
        },
        {
            "definition": "To push or thrust quickly and forcefully.",
            "pos": "verb",
            "sent1": "He used all his strength to plunge the shovel into the hard ground.",
            "sent2": "The chef had to plunge the knife into the tough meat to cut it.",
            "sent3": "The strong wind threatened to plunge the boat into the rough waves.",
            "sent4": "The knight prepared to plunge his sword into the dragon's heart.",
            "sent5": "The firefighter had to plunge through the smoke to rescue the trapped family."
        },
        {
            "definition": "A sudden rapid decrease or fall in value or amount.",
            "pos": "noun",
            "sent1": "The market experienced a plunge in prices, causing concern among traders.",
            "sent2": "The sudden plunge in temperature caught everyone off guard.",
            "sent3": "The unexpected plunge in attendance left the event organizers puzzled.",
            "sent4": "The company's stocks took a sharp plunge after the scandal was revealed.",
            "sent5": "The plunge in sales forced the store to offer discounts to attract customers."
        }
    ]
}