{
    "term": "plus",
    "meanings": [
        {
            "definition": "In addition to",
            "pos": "preposition",
            "sent1": "She bought a sandwich plus a drink for lunch.",
            "sent2": "You can have ice cream plus chocolate syrup on top.",
            "sent3": "He packed his bag with snacks plus a toy for the trip.",
            "sent4": "Her smile lit up the room, plus her laughter was contagious.",
            "sent5": "The flowers in the garden bloomed beautifully, plus the butterflies added a touch of magic."
        },
        {
            "definition": "Added to",
            "pos": "preposition",
            "sent1": "He ordered a burger plus fries for dinner.",
            "sent2": "The cake was delicious, plus the frosting made it even better.",
            "sent3": "The cat knocked over the vase, plus spilled water everywhere.",
            "sent4": "The music played softly in the background, plus the sound of rain added to the peaceful atmosphere.",
            "sent5": "The painting was stunning, plus the artist's signature added a personal touch."
        },
        {
            "definition": "Positive quantity or quality",
            "pos": "noun",
            "sent1": "She always looks at the plus side of things.",
            "sent2": "The teacher put a plus next to her excellent work.",
            "sent3": "The plus in his grades made him smile.",
            "sent4": "The plus in her savings account brought her joy.",
            "sent5": "The plus in her energy levels made her feel unstoppable."
        },
        {
            "definition": "Increased by",
            "pos": "preposition",
            "sent1": "The recipe called for sugar plus a pinch of salt.",
            "sent2": "The temperature rose by ten degrees plus the sun shining brightly.",
            "sent3": "He ran for five minutes plus an extra lap for good measure.",
            "sent4": "The crowd grew by a hundred people plus the arrival of the special guest.",
            "sent5": "The tree grew taller by a foot plus the nourishing soil."
        },
        {
            "definition": "Advantageous or beneficial aspect",
            "pos": "noun",
            "sent1": "One plus of living near the park is easy access to nature.",
            "sent2": "The flexibility of the schedule is a big plus for working parents.",
            "sent3": "The free dessert was an unexpected plus of dining at the restaurant.",
            "sent4": "The comfortable seating arrangement was a major plus of the event.",
            "sent5": "The friendly staff is definitely a plus of shopping at this store."
        }
    ]
}