{
    "term": "pneumatograph",
    "meanings": [
        {
            "definition": "A device for recording movements of the chest or abdomen during respiration.",
            "pos": "noun",
            "sent1": "The pneumatograph showed how my chest moved when I breathed deeply.",
            "sent2": "The doctor used the pneumatograph to monitor the patient's breathing patterns.",
            "sent3": "The pneumatograph danced along with each inhale and exhale, like a tiny chest companion.",
            "sent4": "Her laughter made the pneumatograph jump up and down, capturing the joy in her breath.",
            "sent5": "The pneumatograph's lines on paper mirrored the rise and fall of the chest, like a breath artist."
        },
        {
            "definition": "A machine for recording variations in air pressure.",
            "pos": "noun",
            "sent1": "The pneumatograph measured the changes in air pressure accurately.",
            "sent2": "Meteorologists use a pneumatograph to track air pressure changes in the atmosphere.",
            "sent3": "The pneumatograph hummed happily as it detected the slightest air pressure shifts.",
            "sent4": "The pneumatograph whispered secrets of the wind through its air pressure recordings.",
            "sent5": "The pneumatograph's needle danced across the paper, revealing the air's invisible movements."
        },
        {
            "definition": "A device for measuring the force or pressure of gases.",
            "pos": "noun",
            "sent1": "The pneumatograph displayed the pressure of the gas inside the container.",
            "sent2": "Scientists rely on the pneumatograph to accurately measure gas pressure in experiments.",
            "sent3": "The pneumatograph giggled as it gauged the gas's playful pressure changes.",
            "sent4": "The pneumatograph's readings painted a vivid picture of the gas's force within the chamber.",
            "sent5": "The pneumatograph's dial spun rapidly, capturing the intense pressure of the gas."
        }
    ]
}