{
    "term": "pneumonitis",
    "meanings": [
        {
            "definition": "Inflammation of the lungs.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with pneumonitis after examining their chest X-ray.",
            "sent2": "Pneumonitis can be caused by infections or exposure to harmful substances.",
            "sent3": "The pneumonitis in the lungs made the patient cough uncontrollably during the check-up.",
            "sent4": "The dark clouds of pneumonitis hovered over the city, affecting everyone's breathing.",
            "sent5": "The pneumonitis in his lungs felt like tiny flames burning inside him."
        },
        {
            "definition": "A condition characterized by inflammation of the lung tissue.",
            "pos": "noun",
            "sent1": "The patient's persistent cough was a clear sign of pneumonitis affecting their lung tissue.",
            "sent2": "Severe pneumonitis can lead to breathing difficulties and chest pain.",
            "sent3": "Despite the seriousness of the pneumonitis, the patient found humor in their wheezy breathing.",
            "sent4": "The pneumonitis in his lungs was a storm brewing, ready to unleash its fury.",
            "sent5": "The doctor's description of pneumonitis painted a vivid picture of the lung tissue inflammation."
        },
        {
            "definition": "An inflammatory condition affecting the lungs.",
            "pos": "noun",
            "sent1": "The medication helped reduce the inflammation caused by pneumonitis in her lungs.",
            "sent2": "Pneumonitis is a serious condition that requires prompt medical attention.",
            "sent3": "The pneumonitis in his lungs seemed to have a mind of its own, causing mischief.",
            "sent4": "The weight of the world felt like pneumonitis, pressing down on her chest.",
            "sent5": "The redness and swelling from pneumonitis made her lungs resemble a fiery battleground."
        }
    ]
}