{
    "term": "poignancies",
    "meanings": [
        {
            "definition": "The quality of evoking a keen sense of sadness or regret.",
            "pos": "noun",
            "sent1": "The movie's ending had such poignancies that it left everyone in tears.",
            "sent2": "The poem was filled with poignancies that resonated with the readers.",
            "sent3": "Despite its somber tone, the play managed to sprinkle poignancies with humor.",
            "sent4": "Her voice carried poignancies that lingered in the air long after she stopped singing.",
            "sent5": "The painting captured the poignancies of loss and longing with striking clarity."
        },
        {
            "definition": "The state or quality of being deeply affecting or touching.",
            "pos": "noun",
            "sent1": "The photograph captured the poignancies of the moment perfectly.",
            "sent2": "The music was filled with poignancies that moved the audience to tears.",
            "sent3": "The story had a surprising twist that added unexpected poignancies to the plot.",
            "sent4": "His words carried poignancies that touched the hearts of all who listened.",
            "sent5": "The sculpture depicted the poignancies of human emotion with remarkable detail."
        },
        {
            "definition": "The ability to evoke a strong emotional response.",
            "pos": "noun",
            "sent1": "The speech was delivered with such poignancies that it inspired the entire audience.",
            "sent2": "The novel's ending had unexpected poignancies that left readers reflecting for days.",
            "sent3": "The comedian's jokes were filled with clever poignancies that made everyone laugh and think.",
            "sent4": "The photograph captured the poignancies of joy and sorrow in a single frame.",
            "sent5": "The song's lyrics carried poignancies that resonated with listeners on a deep level."
        }
    ]
}