{
    "term": "poikilotherm",
    "meanings": [
        {
            "definition": "An organism that cannot regulate its body temperature internally and instead relies on external sources.",
            "pos": "noun",
            "sent1": "The poikilotherm basks in the sun to warm up.",
            "sent2": "The lizard, a poikilotherm, seeks out warm rocks to regulate its body temperature.",
            "sent3": "The poikilotherm decided to sunbathe all day to avoid catching a cold.",
            "sent4": "Like a poikilotherm, he adapted to the changing environment to survive.",
            "sent5": "The poikilotherm's body temperature fluctuates with the weather, just like a thermometer."
        },
        {
            "definition": "A cold-blooded animal.",
            "pos": "noun",
            "sent1": "The poikilotherm relies on the sun for warmth.",
            "sent2": "In the desert, you can find many poikilotherms like snakes and lizards.",
            "sent3": "The poikilotherm shivered in the cold breeze, wishing for a cozy blanket.",
            "sent4": "The poikilotherm's blood runs cold in the chilly night air.",
            "sent5": "The poikilotherm's cold-blooded nature makes it sluggish in the morning until it warms up."
        },
        {
            "definition": "A creature that adjusts its body temperature based on the temperature of its environment.",
            "pos": "noun",
            "sent1": "The poikilotherm moves to a shady spot when it gets too hot.",
            "sent2": "As a poikilotherm, the frog hops between sunny and shady areas to stay comfortable.",
            "sent3": "The poikilotherm is like a living thermometer, always adapting to its surroundings.",
            "sent4": "The poikilotherm's body acts like a mirror, reflecting the temperature around it.",
            "sent5": "The poikilotherm's ability to adjust its body temperature is a remarkable survival strategy."
        }
    ]
}