{
    "term": "poked",
    "meanings": [
        {
            "definition": "To push or jab with a finger or a pointed object.",
            "pos": "verb",
            "sent1": "She poked the balloon with her finger.",
            "sent2": "He poked the bear gently to get its attention.",
            "sent3": "The cat poked its paw through the hole in the curtain.",
            "sent4": "The sunlight poked through the clouds like a golden spear.",
            "sent5": "The child poked the dough to see if it was ready."
        },
        {
            "definition": "To stir or mix with a finger or a pointed object.",
            "pos": "verb",
            "sent1": "Mom poked the cake batter to check its consistency.",
            "sent2": "She poked the soup to see if it was hot enough.",
            "sent3": "The chef poked the sauce with a spoon, creating a delicious aroma.",
            "sent4": "The wind poked at the leaves, swirling them around.",
            "sent5": "He poked the paint to create a marbled effect."
        },
        {
            "definition": "To prod or nudge someone or something.",
            "pos": "verb",
            "sent1": "She poked her brother to wake him up for school.",
            "sent2": "The hiker poked the rock with a stick to see if it was stable.",
            "sent3": "The puppy poked its nose into the bag of treats.",
            "sent4": "The detective poked at the evidence, trying to solve the case.",
            "sent5": "He poked the firewood to arrange it neatly."
        },
        {
            "definition": "To make a small hole or indentation in something.",
            "pos": "verb",
            "sent1": "The child poked a hole in the sand with a stick.",
            "sent2": "She poked the paper with a pencil, leaving a mark.",
            "sent3": "The squirrel poked at the ground, searching for buried nuts.",
            "sent4": "The key poked a dent in the soft clay.",
            "sent5": "He poked the button, accidentally activating the alarm."
        }
    ]
}