{
    "term": "poke",
    "meanings": [
        {
            "definition": "To push or jab with a finger or sharp object.",
            "pos": "verb",
            "sent1": "She decided to poke the balloon with a pin.",
            "sent2": "He likes to poke his little brother playfully.",
            "sent3": "The mischievous kitten tried to poke its paw under the door.",
            "sent4": "Her words seemed to poke at his insecurities.",
            "sent5": "The curious child poked the ant hill with a stick, watching the insects scatter."
        },
        {
            "definition": "A quick, sharp blow or thrust.",
            "pos": "noun",
            "sent1": "He felt a poke on his shoulder and turned around.",
            "sent2": "The poke from the stick startled the cat.",
            "sent3": "The poke in the ribs made him jump in surprise.",
            "sent4": "The poke of the needle was quick but painful.",
            "sent5": "She gave him a playful poke in the side to get his attention."
        },
        {
            "definition": "To stir or mix with a spoon or other utensil.",
            "pos": "verb",
            "sent1": "She used a wooden spoon to poke the soup gently.",
            "sent2": "He liked to poke the cake batter until it was smooth.",
            "sent3": "The chef would poke the sauce to ensure it was well blended.",
            "sent4": "The children loved to poke their fingers into the cookie dough.",
            "sent5": "She would poke the paint with a brush to create a textured effect."
        },
        {
            "definition": "A small, quick meal or snack.",
            "pos": "noun",
            "sent1": "She grabbed a quick poke before heading out the door.",
            "sent2": "He enjoyed a poke of popcorn while watching the movie.",
            "sent3": "The office always had a bowl of candy for a midday poke.",
            "sent4": "The vending machine offered various pokes for a quick bite.",
            "sent5": "She packed a healthy poke of fruits for her afternoon snack."
        },
        {
            "definition": "To search or rummage around in something.",
            "pos": "verb",
            "sent1": "The detective decided to poke around the crime scene for clues.",
            "sent2": "She would poke through the box of old toys looking for her favorite.",
            "sent3": "The kids loved to poke around in the garden for hidden treasures.",
            "sent4": "He would poke into every corner of the attic searching for the lost key.",
            "sent5": "She carefully poked through the pile of papers on her desk to find the missing document."
        }
    ]
}