{
    "term": "poking",
    "meanings": [
        {
            "definition": "To push or jab with a finger or a pointed object.",
            "pos": "verb",
            "sent1": "She was poking the dough to see if it was ready.",
            "sent2": "The child was poking the cat gently with a stick.",
            "sent3": "He kept poking his friend playfully during the movie.",
            "sent4": "The sun was poking through the clouds after the storm.",
            "sent5": "The teacher was poking the map to show us where we were."
        },
        {
            "definition": "To stir or mix with a pointed object.",
            "pos": "verb",
            "sent1": "Mom was poking the soup to make sure it was hot.",
            "sent2": "She was poking the paint to blend the colors together.",
            "sent3": "The chef was poking the sauce with a spoon in the kitchen.",
            "sent4": "The wind was poking at the leaves, creating a rustling sound.",
            "sent5": "He was poking the fire to keep it burning brightly."
        },
        {
            "definition": "To make a hole or indentation by pushing or jabbing.",
            "pos": "verb",
            "sent1": "The squirrel was poking holes in the ground to bury its nuts.",
            "sent2": "She was poking the clay to create a design on the pot.",
            "sent3": "The kids were poking their fingers into the cake before it was baked.",
            "sent4": "The flashlight was poking a beam of light through the darkness.",
            "sent5": "He was poking the straw into the juice box to drink."
        },
        {
            "definition": "To protrude or stick out.",
            "pos": "verb",
            "sent1": "The turtle was poking its head out of its shell.",
            "sent2": "The key was poking out of the lock, making it hard to turn.",
            "sent3": "The flower was poking out from behind the fence.",
            "sent4": "The mountain peak was poking through the clouds in the distance.",
            "sent5": "His toes were poking out from under the blanket while he slept."
        }
    ]
}