{
    "term": "polarises",
    "meanings": [
        {
            "definition": "To divide or cause to divide into two sharply contrasting groups or sets of opinions or beliefs.",
            "pos": "verb",
            "sent1": "The controversial topic polarises the students into two opposing groups.",
            "sent2": "The political issue polarises the nation, with people strongly supporting one side or the other.",
            "sent3": "The debate about pizza toppings polarises the office, with half the team loving pineapple and the other half hating it.",
            "sent4": "The new policy polarises the community, creating a clear divide between those in favor and those against.",
            "sent5": "The movie's ending polarises viewers, leaving some satisfied and others disappointed."
        },
        {
            "definition": "To cause to acquire polarity.",
            "pos": "verb",
            "sent1": "The magnet polarises the metal, making it attract or repel other objects.",
            "sent2": "The electric charge polarises the particles, causing them to align in a specific direction.",
            "sent3": "The experiment polarises the materials, making them behave differently under certain conditions.",
            "sent4": "The light polarises as it passes through the filter, creating distinct patterns.",
            "sent5": "The magnetic field polarises the compass needle, pointing it towards the north pole."
        },
        {
            "definition": "To cause to concentrate about two conflicting or contrasting positions.",
            "pos": "verb",
            "sent1": "The issue polarises the discussion, focusing all attention on two opposing viewpoints.",
            "sent2": "The debate polarises the audience, drawing them towards either side of the argument.",
            "sent3": "The game polarises the fans, with half cheering for one team and the other half for the opposing team.",
            "sent4": "The decision polarises the team, leading to a split in opinions on the best course of action.",
            "sent5": "The news article polarises readers, prompting them to take sides on the controversial topic."
        }
    ]
}