{
    "term": "polar",
    "meanings": [
        {
            "definition": "Directly opposite in character or tendency",
            "pos": "adjective",
            "sent1": "Their opinions on the matter were polar opposites.",
            "sent2": "The two friends had very different personalities, almost polar in nature.",
            "sent3": "It was like they were from polar worlds, yet somehow they got along.",
            "sent4": "Their relationship was a polar magnet, always attracting and repelling.",
            "sent5": "The contrast between them was as stark as the poles of a magnet."
        },
        {
            "definition": "Of or relating to one of the poles of the earth or of a celestial body",
            "pos": "adjective",
            "sent1": "The polar regions are known for their extreme cold.",
            "sent2": "Explorers face harsh conditions in the polar regions.",
            "sent3": "The penguins waddled happily in their polar habitat.",
            "sent4": "The North Pole is a famous polar location on Earth.",
            "sent5": "The polar ice caps are melting due to climate change."
        },
        {
            "definition": "Having a pair of equal and opposite charges",
            "pos": "adjective",
            "sent1": "The polar molecules attract each other due to their charges.",
            "sent2": "The battery terminals have polar charges that power the device.",
            "sent3": "The magnets aligned perfectly due to their polar charges.",
            "sent4": "The positive and negative ends of the magnet create polar forces.",
            "sent5": "The polarized particles exhibit distinct behavior due to their charges."
        },
        {
            "definition": "Extremely cold; icy",
            "pos": "adjective",
            "sent1": "The wind was polar, chilling everyone to the bone.",
            "sent2": "The polar blast brought snow and freezing temperatures.",
            "sent3": "The ice cream was so cold, it felt polar in my mouth.",
            "sent4": "The lake froze over, creating a polar landscape.",
            "sent5": "The polar conditions made it impossible to go outside without a coat."
        }
    ]
}