{
    "term": "polemics",
    "meanings": [
        {
            "definition": "The art or practice of engaging in controversial debate or dispute.",
            "pos": "noun",
            "sent1": "She excelled in polemics, always ready to engage in a heated debate.",
            "sent2": "The author's polemics against the government sparked a lively discussion.",
            "sent3": "During the family dinner, the siblings turned their conversation into a friendly polemics about their favorite TV shows.",
            "sent4": "Her polemics on social media were like fiery arrows, hitting their targets with precision.",
            "sent5": "The classroom was filled with the sound of polemics as the students debated the topic passionately."
        },
        {
            "definition": "A strong verbal or written attack on someone or something.",
            "pos": "noun",
            "sent1": "The politician's polemics against his opponent were harsh and unforgiving.",
            "sent2": "The journalist's polemics on corruption exposed the truth behind the scandal.",
            "sent3": "In the schoolyard, the children engaged in playful polemics over who could run the fastest.",
            "sent4": "Her polemics on the company's unethical practices were like a thunderstorm, shaking the foundation of trust.",
            "sent5": "The teacher's polemics on the importance of education resonated with the students, inspiring them to strive for excellence."
        },
        {
            "definition": "A controversial argument or discussion.",
            "pos": "noun",
            "sent1": "The family dinner turned into a polemics about politics, with everyone sharing their strong opinions.",
            "sent2": "The online forum was filled with polemics about the new policy, sparking a virtual debate.",
            "sent3": "The polemics between the two friends about their favorite sports team was all in good fun.",
            "sent4": "His polemics on climate change were like a raging river, sweeping away any doubts about the urgency of the issue.",
            "sent5": "The polemics in the courtroom were intense, with each lawyer presenting compelling arguments to sway the jury."
        }
    ]
}