{
    "term": "policed",
    "meanings": [
        {
            "definition": "To regulate, control, or keep order in (an area) by means of police officers.",
            "pos": "verb",
            "sent1": "The officers policed the busy intersection to ensure everyone followed the traffic rules.",
            "sent2": "The neighborhood was policed by the diligent officers, making it a safe place to live.",
            "sent3": "The police officer policed the playground, making sure all the children played nicely together.",
            "sent4": "The teacher policed the classroom like a strict guardian, maintaining discipline at all times.",
            "sent5": "The security guard policed the event with a watchful eye, preventing any disturbances."
        },
        {
            "definition": "To make (something) neat or in order.",
            "pos": "verb",
            "sent1": "She policed her room by organizing her toys and books on the shelves.",
            "sent2": "The janitor policed the hallway, ensuring it was clean and free of clutter.",
            "sent3": "He policed his desk, arranging his pens and papers in a tidy manner.",
            "sent4": "The librarian policed the bookshelves, keeping them in perfect alphabetical order.",
            "sent5": "The gardener policed the flower beds, removing any weeds for a neat appearance."
        },
        {
            "definition": "To enforce laws or regulations.",
            "pos": "verb",
            "sent1": "The security guard policed the premises, making sure no one entered without permission.",
            "sent2": "The government policed the new regulations, ensuring compliance from all citizens.",
            "sent3": "The referee policed the game, penalizing any players who broke the rules.",
            "sent4": "The supervisor policed the workplace, ensuring all employees followed safety protocols.",
            "sent5": "The park ranger policed the park, protecting the wildlife and enforcing park rules."
        }
    ]
}