{
    "term": "poller",
    "meanings": [
        {
            "definition": "One who conducts a survey or collects votes.",
            "pos": "noun",
            "sent1": "The poller asked people about their favorite color.",
            "sent2": "The poller counted the votes to determine the winner.",
            "sent3": "The poller found out that most people prefer dogs over cats.",
            "sent4": "The poller sifted through the opinions to find the most popular choice.",
            "sent5": "The poller's job is to gather information from different individuals."
        },
        {
            "definition": "A device used for measuring or recording data at regular intervals.",
            "pos": "noun",
            "sent1": "The weather station uses a poller to track temperature changes.",
            "sent2": "The poller recorded the water levels in the river every hour.",
            "sent3": "The poller beeped every time it took a measurement.",
            "sent4": "The poller hummed as it diligently collected data throughout the day.",
            "sent5": "The poller is an essential tool for monitoring environmental conditions."
        },
        {
            "definition": "A person or thing that removes the horns of an animal.",
            "pos": "noun",
            "sent1": "The skilled poller carefully removed the horns from the bull.",
            "sent2": "The poller ensured the safety of the farm animals by dehorning them.",
            "sent3": "The poller's job was to make sure the cows couldn't hurt each other.",
            "sent4": "The poller's hands expertly handled the task of dehorning.",
            "sent5": "The poller's work prevented injuries among the livestock."
        },
        {
            "definition": "A person who trims or cuts hair.",
            "pos": "noun",
            "sent1": "The poller styled the customer's hair according to their preference.",
            "sent2": "The poller skillfully snipped away the split ends.",
            "sent3": "The poller's scissors danced through the hair, creating a new look.",
            "sent4": "The poller transformed the messy hair into a stylish haircut.",
            "sent5": "The poller's expertise in hair cutting made the clients happy."
        }
    ]
}