{
    "term": "polyphonic",
    "meanings": [
        {
            "definition": "Having two or more independent but harmonically related melodic parts sounding together",
            "pos": "adjective",
            "sent1": "The choir sang a polyphonic hymn with multiple harmonious melodies.",
            "sent2": "The polyphonic music filled the concert hall with rich, layered sounds.",
            "sent3": "The polyphonic orchestra played a symphony that made everyone tap their feet.",
            "sent4": "Her laughter was like a polyphonic melody, spreading joy in the room.",
            "sent5": "The polyphonic nature of the song created a mesmerizing auditory experience."
        },
        {
            "definition": "Of or relating to polyphony",
            "pos": "adjective",
            "sent1": "The composer's polyphonic style was influenced by classical music.",
            "sent2": "The polyphonic tradition in choral music dates back centuries.",
            "sent3": "The polyphonic discussion among musicians led to a beautiful collaboration.",
            "sent4": "Her mind was a polyphonic maze of thoughts, each one harmonizing with the other.",
            "sent5": "The polyphonic nature of the piece showcased the composer's skill in blending melodies."
        },
        {
            "definition": "Capable of producing more than one tone at a time",
            "pos": "adjective",
            "sent1": "The polyphonic keyboard allowed the musician to play chords effortlessly.",
            "sent2": "The electronic device had a polyphonic feature that enabled complex sound combinations.",
            "sent3": "The polyphonic sound system filled the room with a mix of different tones.",
            "sent4": "His voice was like a polyphonic instrument, capable of hitting multiple notes simultaneously.",
            "sent5": "The polyphonic capabilities of the synthesizer added depth to the music composition."
        }
    ]
}