{
    "term": "polyzoans",
    "meanings": [
        {
            "definition": "Polyzoans: colonial marine animals that form encrusting or branching colonies",
            "pos": "noun",
            "sent1": "The polyzoans in the ocean create beautiful colonies on the rocks.",
            "sent2": "Scientists study polyzoans to understand how they build their colonies in the sea.",
            "sent3": "The polyzoans had a party on the coral reef, each one adding a new branch to the celebration.",
            "sent4": "The polyzoans' colonies are like tiny cities under the sea, bustling with activity.",
            "sent5": "As the sun set, the polyzoans' colonies glowed with a rainbow of colors, a mesmerizing sight."
        },
        {
            "definition": "Polyzoans: organisms that reproduce asexually by budding",
            "pos": "noun",
            "sent1": "A single polyzoan can give rise to many new individuals through budding.",
            "sent2": "In biology class, we learned about how polyzoans reproduce by budding.",
            "sent3": "The polyzoans decided to have a contest to see who could bud the fastest.",
            "sent4": "The field of polyzoans was a sea of new growth, each one a clone of the original.",
            "sent5": "The aquarium was filled with polyzoans budding off each other, a fascinating display of life."
        },
        {
            "definition": "Polyzoans: small aquatic invertebrates with a calcareous skeleton",
            "pos": "noun",
            "sent1": "The polyzoans with their calcareous skeleton are important members of the underwater ecosystem.",
            "sent2": "Divers often spot polyzoans with their unique calcareous skeletons while exploring the ocean.",
            "sent3": "The polyzoans with their hard skeletons challenged each other to a calcium-building contest.",
            "sent4": "The polyzoans' calcareous skeletons were like tiny suits of armor protecting them in the sea.",
            "sent5": "Children marveled at the polyzoans with their calcareous skeletons, imagining them as underwater knights."
        }
    ]
}