{
    "term": "polymorphs",
    "meanings": [
        {
            "definition": "An organism that can exist in multiple forms or shapes.",
            "pos": "noun",
            "sent1": "The scientist studied the polymorphs in the forest, amazed by their ability to change shapes.",
            "sent2": "The chameleon is a polymorphs, blending into its surroundings by changing colors.",
            "sent3": "The polymorphs at the zoo decided to have a shape-shifting contest for fun.",
            "sent4": "Her creativity was like a box of polymorphs, constantly transforming ideas into new shapes.",
            "sent5": "The polymorphs in the storybook could turn into any creature they imagined."
        },
        {
            "definition": "A mineral that can crystallize in different structures.",
            "pos": "noun",
            "sent1": "The geologist discovered rare polymorphs deep within the cave, each crystal unique in structure.",
            "sent2": "Diamond is a polymorphs, forming under different conditions to create various crystal shapes.",
            "sent3": "The polymorphs in the rock collection seemed to sparkle differently every time someone looked at them.",
            "sent4": "The sunlight reflected off the polymorphs in the cave, creating a dazzling display of colors.",
            "sent5": "The jeweler marveled at the polymorphs, admiring the intricate patterns in each crystal."
        },
        {
            "definition": "A substance that can take on different physical forms.",
            "pos": "noun",
            "sent1": "The clay was a polymorphs, easily molded into different shapes by the sculptor.",
            "sent2": "Water is a polymorphs, transforming from liquid to solid when frozen.",
            "sent3": "The polymorphs in the art class were used to create sculptures that changed shape with heat.",
            "sent4": "Her thoughts were like polymorphs, shifting from one idea to another in a fluid motion.",
            "sent5": "The polymorphs in the experiment changed color when exposed to different temperatures."
        }
    ]
}