{
    "term": "polydipsia",
    "meanings": [
        {
            "definition": "Excessive thirst.",
            "pos": "noun",
            "sent1": "After running a marathon, he experienced polydipsia and drank a whole bottle of water.",
            "sent2": "The doctor diagnosed the patient with polydipsia due to their constant need for water.",
            "sent3": "The camel joked that it had polydipsia because it drank an entire oasis.",
            "sent4": "Her thirst was like a bottomless pit, a polydipsia that could never be quenched.",
            "sent5": "Polydipsia made him feel like he was always in a desert, searching for water."
        },
        {
            "definition": "Condition of abnormally increased thirst.",
            "pos": "noun",
            "sent1": "The medication side effect caused polydipsia in the patient, making them drink more than usual.",
            "sent2": "Polydipsia can be a sign of an underlying health issue that needs to be addressed.",
            "sent3": "The cartoon character's polydipsia was so extreme, they drank the entire swimming pool.",
            "sent4": "Her polydipsia was like a never-ending river, always flowing and never satisfied.",
            "sent5": "The sensation of polydipsia was like a constant nagging reminder of unquenchable thirst."
        },
        {
            "definition": "Symptom of drinking abnormally large amounts of fluids.",
            "pos": "noun",
            "sent1": "The doctor noted the patient's polydipsia as a result of excessive fluid intake.",
            "sent2": "Polydipsia can lead to electrolyte imbalances if not managed properly.",
            "sent3": "The party clown's polydipsia was evident when he drank all the punch in one go.",
            "sent4": "Her polydipsia was like a waterfall, a constant flow of liquid going in.",
            "sent5": "Polydipsia felt like an unquenchable river, always demanding more water."
        }
    ]
}