{
    "term": "pommel",
    "meanings": [
        {
            "definition": "The rounded knob on the hilt of a sword or similar weapon.",
            "pos": "noun",
            "sent1": "The knight gripped the pommel tightly as he charged into battle.",
            "sent2": "She admired the intricate design of the sword's pommel.",
            "sent3": "The shiny pommel reflected the sunlight, dazzling the onlookers.",
            "sent4": "The pommel gleamed like a precious gem amidst the chaos of the battlefield.",
            "sent5": "The pommel's smooth surface felt cool to the touch, a comforting presence in the warrior's hand."
        },
        {
            "definition": "To strike repeatedly, especially with the fists.",
            "pos": "verb",
            "sent1": "He tried to pommel the punching bag to release his frustration.",
            "sent2": "The boxer pummeled his opponent with a series of powerful pommeling strikes.",
            "sent3": "The child playfully pretended to pommel the air, imagining foes to conquer.",
            "sent4": "The rain seemed to pommel the roof relentlessly, creating a soothing rhythm.",
            "sent5": "His heart seemed to pommel against his chest as he faced the daunting challenge ahead."
        },
        {
            "definition": "The raised, padded part of a horse's saddle in front of the rider.",
            "pos": "noun",
            "sent1": "She adjusted the stirrups and gripped the pommel for stability during the ride.",
            "sent2": "The horse's saddle had a comfortable pommel that provided extra support.",
            "sent3": "The mischievous squirrel perched on the saddle's pommel, eyeing the rider curiously.",
            "sent4": "The pommel of the saddle cradled the rider like a gentle embrace during the bumpy journey.",
            "sent5": "The worn leather of the pommel carried the memories of countless rides through the countryside."
        }
    ]
}