{
    "term": "poms",
    "meanings": [
        {
            "definition": "A type of fruit",
            "pos": "noun",
            "sent1": "I picked some juicy poms from the tree.",
            "sent2": "The grocery store sells fresh poms in the produce section.",
            "sent3": "The colorful poms looked like little ornaments on the tree.",
            "sent4": "Her smile was as bright as a basket of poms.",
            "sent5": "The sweet aroma of the poms filled the kitchen."
        },
        {
            "definition": "A type of dog breed",
            "pos": "noun",
            "sent1": "The poms are known for their fluffy coats.",
            "sent2": "She loves walking her poms in the park every morning.",
            "sent3": "The poms wagged their tails happily as they played fetch.",
            "sent4": "Her poms were like little balls of fur bouncing around.",
            "sent5": "The poms' barks echoed through the neighborhood."
        },
        {
            "definition": "A type of cheerleading accessory",
            "pos": "noun",
            "sent1": "She waved her colorful poms during the cheer routine.",
            "sent2": "The cheerleaders twirled their poms in perfect unison.",
            "sent3": "The poms added a fun pop of color to the cheerleader's outfit.",
            "sent4": "Her poms sparkled under the stadium lights.",
            "sent5": "The sound of the poms swishing filled the gymnasium."
        },
        {
            "definition": "A slang term for British people",
            "pos": "noun",
            "sent1": "The tourists were excited to meet the friendly poms.",
            "sent2": "She heard that poms have a great sense of humor.",
            "sent3": "The poms at the pub were cheering for their favorite team.",
            "sent4": "The group of poms stood out with their charming accents.",
            "sent5": "The poms' tea party was the talk of the town."
        }
    ]
}