{
    "term": "pontils",
    "meanings": [
        {
            "definition": "A solid metal rod used in glassblowing to shape and manipulate molten glass.",
            "pos": "noun",
            "sent1": "The glassblower carefully used the pontils to shape the molten glass into a beautiful vase.",
            "sent2": "After the glassblower finished shaping the vase, he gently removed the pontils from the glass.",
            "sent3": "The mischievous cat mistook the pontils for toys and batted them around the studio.",
            "sent4": "The pontils were like magic wands in the hands of the skilled glassblower, transforming the glass into art.",
            "sent5": "The pontils glowed red-hot as they touched the glass, leaving a lasting impression on the final piece."
        },
        {
            "definition": "A small piece of glass left on the base of a blown glass object after it is removed from the blowing iron.",
            "pos": "noun",
            "sent1": "The delicate vase had a tiny pontil at its base, evidence of its handcrafted origin.",
            "sent2": "The glass artist carefully broke off the pontil, leaving the vase smooth and flawless.",
            "sent3": "The mischievous squirrel mistook the pontil for a precious gem and tried to bury it in the garden.",
            "sent4": "The pontil left a mark on the vase like a signature, showing the artist's hand in its creation.",
            "sent5": "The pontil sparkled in the sunlight, adding a touch of magic to the glass artwork."
        },
        {
            "definition": "A tool used in glassmaking to hold and shape hot glass.",
            "pos": "noun",
            "sent1": "The glassmaker carefully selected the pontils to shape the molten glass into intricate designs.",
            "sent2": "With skilled hands, the glassmaker used the pontils to create delicate swirls in the glass.",
            "sent3": "The mischievous child mistook the pontils for toys and tried to use them as drumsticks.",
            "sent4": "The pontils were like extensions of the glassmaker's hands, bringing life to the hot glass.",
            "sent5": "The pontils clinked softly against the glass, creating a rhythmic melody in the glassmaking studio."
        }
    ]
}