{
    "term": "pont",
    "meanings": [
        {
            "definition": "A bridge",
            "pos": "noun",
            "sent1": "The pont over the river was made of strong steel beams.",
            "sent2": "We walked across the pont to reach the other side of the city.",
            "sent3": "The troll lived under the pont and asked for tolls from passersby.",
            "sent4": "Their friendship served as a pont connecting their two very different worlds.",
            "sent5": "The grand pont stood majestically against the backdrop of the setting sun."
        },
        {
            "definition": "A card game similar to bridge",
            "pos": "noun",
            "sent1": "Let's play a round of pont after dinner with the family.",
            "sent2": "She learned how to play pont from her grandparents during summer vacations.",
            "sent3": "The pont game became intense as each player strategized their moves.",
            "sent4": "In the world of card games, pont is known for its intricate rules and tactics.",
            "sent5": "The sound of shuffling cards filled the room as they prepared for a game of pont."
        },
        {
            "definition": "A type of fish",
            "pos": "noun",
            "sent1": "The pont swam gracefully in the clear waters of the aquarium.",
            "sent2": "Fishermen were excited to catch a rare pont in the lake.",
            "sent3": "The chef prepared a delicious meal using fresh pont as the main ingredient.",
            "sent4": "The colorful scales of the pont shimmered under the sunlight.",
            "sent5": "Children giggled with delight as they watched the playful pont in the pond."
        },
        {
            "definition": "A type of boat",
            "pos": "noun",
            "sent1": "The pont gently rocked on the calm waters of the lake.",
            "sent2": "They decided to rent a pont for a relaxing day on the river.",
            "sent3": "The old pont creaked as it sailed through the misty morning fog.",
            "sent4": "The pont glided smoothly across the serene lake, carrying its passengers.",
            "sent5": "The fishermen loaded their gear onto the sturdy pont before setting off for the day."
        }
    ]
}