{
    "term": "pooching",
    "meanings": [
        {
            "definition": "To protrude or bulge outwards",
            "pos": "verb",
            "sent1": "The balloon was pooching outwards as it filled with air.",
            "sent2": "The pillow was pooching from the overstuffed chair.",
            "sent3": "The overstuffed suitcase was pooching at the seams.",
            "sent4": "The flower petals were pooching outwards in full bloom.",
            "sent5": "The turtle's shell was pooching slightly on one side."
        },
        {
            "definition": "To search or scavenge for food",
            "pos": "verb",
            "sent1": "The raccoon was pooching around the trash cans for scraps.",
            "sent2": "The dog was pooching in the backyard for buried bones.",
            "sent3": "The squirrel was pooching through the fallen leaves for acorns.",
            "sent4": "The seagull was pooching for fish along the shore.",
            "sent5": "The bear was pooching for berries in the forest."
        },
        {
            "definition": "To move slowly or lazily",
            "pos": "verb",
            "sent1": "The cat was pooching along the windowsill in the sun.",
            "sent2": "The snail was pooching across the garden path.",
            "sent3": "The sloth was pooching from tree to tree in the jungle.",
            "sent4": "The turtle was pooching towards the pond for a swim.",
            "sent5": "The old dog was pooching around the yard, enjoying the day."
        },
        {
            "definition": "To steal or pilfer goods",
            "pos": "verb",
            "sent1": "The thief was caught pooching items from the store.",
            "sent2": "The magpie was pooching shiny objects from the picnic area.",
            "sent3": "The raccoon was pooching snacks from the campers' bags.",
            "sent4": "The pickpocket was pooching wallets in the crowded market.",
            "sent5": "The pirate was pooching treasures from the ship's cargo."
        },
        {
            "definition": "To curve or bend in a downward direction",
            "pos": "verb",
            "sent1": "The road was pooching downwards towards the valley.",
            "sent2": "The tree branch was pooching under the weight of the snow.",
            "sent3": "The hose was pooching downwards as the water flowed through.",
            "sent4": "The roof was pooching slightly after the heavy rain.",
            "sent5": "The bridge was pooching in the middle due to the weight of the cars."
        }
    ]
}