{
    "term": "poops",
    "meanings": [
        {
            "definition": "Defecates",
            "pos": "verb",
            "sent1": "The baby poops in his diaper.",
            "sent2": "The dog poops outside every morning.",
            "sent3": "When nature calls, the body poops to get rid of waste.",
            "sent4": "The overflowing trash can poops out garbage onto the floor.",
            "sent5": "In the wild, animals poop to keep their living area clean."
        },
        {
            "definition": "Excrement",
            "pos": "noun",
            "sent1": "Watch out for the dog's poops on the sidewalk.",
            "sent2": "The zookeeper cleans up animal poops daily.",
            "sent3": "Stepping on bird poops brings bad luck in some cultures.",
            "sent4": "The smell of fresh horse poop filled the barn.",
            "sent5": "The scientist studied the composition of animal poops for research."
        },
        {
            "definition": "Foolish or silly person",
            "pos": "noun",
            "sent1": "Don't listen to that poops; he doesn't know what he's talking about.",
            "sent2": "The class clown is always joking around and acting like a poops.",
            "sent3": "The poops thought he could fly by jumping off the swing.",
            "sent4": "She giggled at her friend's silly antics, calling her a poops affectionately.",
            "sent5": "The movie character was portrayed as a lovable poops who always made mistakes."
        },
        {
            "definition": "To break wind",
            "pos": "verb",
            "sent1": "Grandpa accidentally poops during dinner, making everyone laugh.",
            "sent2": "The comedian pretended to poops on stage for a funny skit.",
            "sent3": "The embarrassing moment came when he poops loudly in the quiet room.",
            "sent4": "The balloon slowly poops out air, making a funny noise.",
            "sent5": "The child giggled as he tried to poops silently during the game."
        },
        {
            "definition": "To spoil or ruin",
            "pos": "verb",
            "sent1": "Leaving the milk out too long will poops it.",
            "sent2": "The rain threatened to poops the outdoor picnic.",
            "sent3": "The mischievous squirrel tried to poops the garden by digging up the plants.",
            "sent4": "The spilled juice will poops the clean tablecloth.",
            "sent5": "The careless mistake could poops the entire project if not fixed quickly."
        }
    ]
}