{
    "term": "pop",
    "meanings": [
        {
            "definition": "A sudden, sharp sound",
            "pos": "noun",
            "sent1": "I heard a loud pop when the balloon burst.",
            "sent2": "The pop of the firecracker startled me.",
            "sent3": "The pop of the bubble wrap made me jump.",
            "sent4": "The pop of the champagne cork signaled the start of the celebration.",
            "sent5": "The pop of the popcorn in the microwave filled the room with a delicious smell."
        },
        {
            "definition": "To make a sudden, sharp sound",
            "pos": "verb",
            "sent1": "She tried to pop the bubble with her finger.",
            "sent2": "The balloon popped loudly when she pricked it.",
            "sent3": "He likes to pop the bubble wrap for fun.",
            "sent4": "The cork popped out of the bottle with a loud noise.",
            "sent5": "The toaster popped the bread up when it was done."
        },
        {
            "definition": "To put something into one's mouth",
            "pos": "verb",
            "sent1": "He likes to pop candies into his mouth.",
            "sent2": "She popped a grape into her mouth and smiled.",
            "sent3": "The baby tried to pop everything into his mouth.",
            "sent4": "He popped a piece of chocolate into his mouth and savored the taste.",
            "sent5": "She popped a mint into her mouth to freshen her breath."
        },
        {
            "definition": "To open something quickly and suddenly",
            "pos": "verb",
            "sent1": "She popped the lid off the jar with ease.",
            "sent2": "He popped the top of the can to drink the soda.",
            "sent3": "The surprise made her pop the box open quickly.",
            "sent4": "He popped the lock on the suitcase to reveal the contents.",
            "sent5": "She popped the balloon to see what was inside."
        },
        {
            "definition": "Popular music characterized by a catchy melody",
            "pos": "noun",
            "sent1": "She enjoys listening to upbeat pop music.",
            "sent2": "The radio station plays a lot of pop songs.",
            "sent3": "The catchy pop tunes always make her dance.",
            "sent4": "Pop music is known for its catchy hooks and rhythms.",
            "sent5": "The concert was filled with fans of pop music."
        }
    ]
}