{
    "term": "popcorns",
    "meanings": [
        {
            "definition": "Popcorns: popped kernels of corn",
            "pos": "noun",
            "sent1": "I love to eat popcorns while watching movies.",
            "sent2": "The popcorns at the movie theater are always so buttery.",
            "sent3": "The popcorns in the bowl disappeared faster than I could blink!",
            "sent4": "The popcorns in the microwave danced around as they popped.",
            "sent5": "The aroma of freshly popped popcorns filled the room."
        },
        {
            "definition": "Popcorns: a snack made from popped kernels of corn",
            "pos": "noun",
            "sent1": "My favorite snack at the carnival is popcorns.",
            "sent2": "She always brings a bag of popcorns to the park for a picnic.",
            "sent3": "The kids giggled as they threw popcorns at each other playfully.",
            "sent4": "The popcorns in the bucket were like little clouds of happiness.",
            "sent5": "The crunch of the popcorns was music to my ears."
        },
        {
            "definition": "Popcorns: to pop kernels of corn",
            "pos": "verb",
            "sent1": "I like to watch the kernels popcorns in the pan.",
            "sent2": "She popcorns the corn in a hot air popper for a healthier snack.",
            "sent3": "The kernels popcorns loudly, making everyone jump.",
            "sent4": "The corn kernels popcorns into fluffy white clouds.",
            "sent5": "The sound of popcorns always makes me smile."
        },
        {
            "definition": "Popcorns: a container of popped kernels of corn",
            "pos": "noun",
            "sent1": "She stored the leftover popcorns in a plastic container.",
            "sent2": "The popcorns spilled out of the container when she opened it.",
            "sent3": "The container of popcorns sat on the counter, tempting me.",
            "sent4": "The container of popcorns was like a treasure chest of snacks.",
            "sent5": "The lid of the container kept the popcorns fresh and crispy."
        }
    ]
}