{
    "term": "popinjay",
    "meanings": [
        {
            "definition": "A vain or conceited person.",
            "pos": "noun",
            "sent1": "The popinjay always talked about how wonderful they were.",
            "sent2": "She couldn't stand his attitude; he was such a popinjay.",
            "sent3": "The popinjay spent hours admiring themselves in the mirror.",
            "sent4": "In the office, he strutted around like a popinjay, showing off his new watch.",
            "sent5": "The popinjay's constant bragging annoyed everyone around them."
        },
        {
            "definition": "A parrot.",
            "pos": "noun",
            "sent1": "The colorful popinjay repeated the words it heard.",
            "sent2": "She enjoyed listening to the popinjay mimic different sounds.",
            "sent3": "The popinjay squawked loudly, startling the visitors.",
            "sent4": "The popinjay's feathers shimmered in the sunlight, a beautiful sight.",
            "sent5": "The popinjay's bright plumage caught everyone's attention."
        },
        {
            "definition": "A brightly colored bird.",
            "pos": "noun",
            "sent1": "The garden was filled with chirping popinjays of all colors.",
            "sent2": "She marveled at the beauty of the popinjay perched on the branch.",
            "sent3": "The popinjay's vibrant feathers stood out against the green leaves.",
            "sent4": "Like a popinjay in a forest, she stood out with her colorful dress.",
            "sent5": "The popinjay's song echoed through the valley, a melody of colors."
        },
        {
            "definition": "A showy or ostentatious person.",
            "pos": "noun",
            "sent1": "At the party, the popinjay wore a flashy suit to grab attention.",
            "sent2": "He was known as the office popinjay for his extravagant style.",
            "sent3": "The popinjay's over-the-top gestures amused everyone around.",
            "sent4": "She felt like a popinjay in her extravagant gown at the ball.",
            "sent5": "The popinjay's flamboyant personality lit up the room."
        }
    ]
}