{
    "term": "popping",
    "meanings": [
        {
            "definition": "Make a sudden, sharp, explosive sound.",
            "pos": "verb",
            "sent1": "The balloon was popping loudly.",
            "sent2": "I heard the popcorn popping in the microwave.",
            "sent3": "The unexpected loud popping startled the cat.",
            "sent4": "The fireworks were popping in the night sky.",
            "sent5": "The bubble wrap popping was oddly satisfying."
        },
        {
            "definition": "To burst open or break.",
            "pos": "verb",
            "sent1": "The balloon kept popping with each poke.",
            "sent2": "The dam burst, water popping through the cracks.",
            "sent3": "The surprise gift box was popping open.",
            "sent4": "The tension in the room felt like it was popping.",
            "sent5": "The popcorn bag was popping from the heat."
        },
        {
            "definition": "To appear suddenly or unexpectedly.",
            "pos": "verb",
            "sent1": "The magician made a rabbit popping out of the hat.",
            "sent2": "The idea of a solution was popping into her mind.",
            "sent3": "The surprise guest was popping up at the party.",
            "sent4": "The stars were popping out as the sky darkened.",
            "sent5": "The memory of the event kept popping into his thoughts."
        },
        {
            "definition": "To cook something quickly in hot oil or fat.",
            "pos": "verb",
            "sent1": "She was popping the corn kernels in the pan.",
            "sent2": "The chef was popping the shrimp in the sizzling oil.",
            "sent3": "The potatoes were popping in the deep fryer.",
            "sent4": "The aroma of the bacon popping in the skillet was enticing.",
            "sent5": "The sound of the vegetables popping in the stir-fry was music to her ears."
        },
        {
            "definition": "To move quickly or suddenly.",
            "pos": "verb",
            "sent1": "The cat was popping around the room chasing a toy.",
            "sent2": "The kids were popping up and down with excitement.",
            "sent3": "The squirrel was popping from tree to tree.",
            "sent4": "The idea was popping into her head as she ran.",
            "sent5": "The bubbles were popping as the children played in the park."
        }
    ]
}