{
    "term": "pops",
    "meanings": [
        {
            "definition": "A sudden, explosive sound.",
            "pos": "noun",
            "sent1": "The pops of the fireworks filled the night sky.",
            "sent2": "I heard pops coming from the kitchen as the popcorn was being made.",
            "sent3": "The pops of the balloons scared the cat, making it jump.",
            "sent4": "The pops of the bubble wrap echoed through the empty room.",
            "sent5": "The pops of the firecrackers made everyone cover their ears."
        },
        {
            "definition": "A term of endearment for one's father.",
            "pos": "noun",
            "sent1": "My pops always tells the best bedtime stories.",
            "sent2": "I love spending time fishing with my pops on weekends.",
            "sent3": "My pops is the best at making pancakes on Saturday mornings.",
            "sent4": "Even though my pops is strict, he always has a kind smile.",
            "sent5": "I look up to my pops for his wisdom and guidance."
        },
        {
            "definition": "To make a short, sharp sound.",
            "pos": "verb",
            "sent1": "The toy gun pops when you pull the trigger.",
            "sent2": "The popcorn pops loudly in the microwave.",
            "sent3": "The cork pops out of the champagne bottle with a loud 'pop'.",
            "sent4": "The fire crackles and pops in the fireplace on a cold night.",
            "sent5": "The bubble wrap pops when you press on it with your fingers."
        },
        {
            "definition": "To move quickly or suddenly.",
            "pos": "verb",
            "sent1": "The squirrel pops up from behind the tree and scurries away.",
            "sent2": "The rabbit pops out of its burrow and dashes across the field.",
            "sent3": "The cat pops out of the box, surprising everyone in the room.",
            "sent4": "The jack-in-the-box pops up when you turn the handle.",
            "sent5": "The toast pops out of the toaster when it's done."
        },
        {
            "definition": "A type of carbonated beverage.",
            "pos": "noun",
            "sent1": "I grabbed a cold pops from the fridge to quench my thirst.",
            "sent2": "The kids enjoyed sipping on their favorite pops during the picnic.",
            "sent3": "The pops fizzed and bubbled when I opened the can.",
            "sent4": "A refreshing pops is perfect on a hot summer day.",
            "sent5": "The pops was so fizzy that it tickled my nose when I drank it."
        }
    ]
}