{
    "term": "popularities",
    "meanings": [
        {
            "definition": "The state or condition of being liked, admired, or supported by many people.",
            "pos": "noun",
            "sent1": "Her popularities among her classmates made her feel happy and included.",
            "sent2": "The singer's popularities grew after releasing a hit song.",
            "sent3": "The puppy's popularities at the park were evident as everyone wanted to pet him.",
            "sent4": "The popularities of the new restaurant spread like wildfire through the town.",
            "sent5": "The popularities of kindness and generosity are always appreciated by others."
        },
        {
            "definition": "The quality of being widely accepted or recognized.",
            "pos": "noun",
            "sent1": "The popularities of the brand were evident in its high sales numbers.",
            "sent2": "His popularities as a leader were acknowledged by people from different backgrounds.",
            "sent3": "The popularities of the new fashion trend were undeniable as everyone started wearing it.",
            "sent4": "The popularities of honesty and integrity are values that should be cherished.",
            "sent5": "The popularities of the artist's work were celebrated by art enthusiasts."
        },
        {
            "definition": "The extent to which something is favored or well-liked by a large number of people.",
            "pos": "noun",
            "sent1": "The popularities of the movie led to sold-out screenings every night.",
            "sent2": "The popularities of the dessert were evident by how quickly it sold out at the bakery.",
            "sent3": "The popularities of the new video game were so high that it became a cultural phenomenon.",
            "sent4": "The popularities of the book soared after receiving rave reviews from critics.",
            "sent5": "The popularities of the team's performance made them the talk of the town."
        }
    ]
}