{
    "term": "populists",
    "meanings": [
        {
            "definition": "A member or adherent of a political party seeking to represent the interests of ordinary people.",
            "pos": "noun",
            "sent1": "The populists gathered to discuss ways to support the needs of the community.",
            "sent2": "The candidate claimed to be a true populist, fighting for the rights of the working class.",
            "sent3": "The populists decided to throw a party to raise funds for local schools.",
            "sent4": "In the land of populists, the voice of the common folk echoed louder than ever.",
            "sent5": "The image of the populists marching together left a lasting impression on the town."
        },
        {
            "definition": "A person who seeks to appeal to or represent the interests of the general population.",
            "pos": "noun",
            "sent1": "As a populist, she always listened to the concerns of the people around her.",
            "sent2": "The speaker's message resonated with the crowd, making him a true populist.",
            "sent3": "The populist chef created a dish that everyone in the town loved.",
            "sent4": "Her words had a populist charm that drew listeners in like a magnet.",
            "sent5": "The populist leader's actions spoke louder than any words could."
        },
        {
            "definition": "Of or relating to a political party or movement that seeks to represent the interests of ordinary people.",
            "pos": "adjective",
            "sent1": "The populist movement gained momentum as more people joined in support.",
            "sent2": "The candidate's populist policies aimed to address the concerns of the working class.",
            "sent3": "The town's atmosphere had a populist vibe, welcoming all with open arms.",
            "sent4": "Her speech had a populist tone that resonated with the audience.",
            "sent5": "The populist approach to governance brought positive changes to the community."
        }
    ]
}