{
    "term": "populist",
    "meanings": [
        {
            "definition": "A person who supports or seeks to appeal to the interests of ordinary people.",
            "pos": "noun",
            "sent1": "The politician claimed to be a populist, always speaking up for the common folk.",
            "sent2": "The populist leader gained a large following by championing the concerns of everyday citizens.",
            "sent3": "The birthday party clown decided to take a populist approach, making balloon animals for all the kids.",
            "sent4": "Her storytelling style was so populist that it felt like the characters were real people you knew.",
            "sent5": "In the play, the protagonist was portrayed as a populist hero fighting for justice."
        },
        {
            "definition": "Relating to or characteristic of populism.",
            "pos": "adjective",
            "sent1": "The candidate's populist message resonated with many voters.",
            "sent2": "The populist movement aimed to address the concerns of the working class.",
            "sent3": "The restaurant's menu had a populist appeal, offering simple and affordable dishes.",
            "sent4": "Her fashion sense was described as populist, focusing on comfortable and practical clothing.",
            "sent5": "The artist's work had a populist quality, accessible and relatable to all audiences."
        },
        {
            "definition": "A member or adherent of a political party seeking to represent the interests of ordinary people.",
            "pos": "noun",
            "sent1": "The group of populists gathered to discuss their strategies for the upcoming election.",
            "sent2": "The populist party promised to prioritize the needs of the working class.",
            "sent3": "At the costume party, he dressed up as a populist politician, complete with a campaign button.",
            "sent4": "The team captain was a true populist, always advocating for the fair treatment of all players.",
            "sent5": "In the historical novel, the protagonist joined forces with a group of populists to fight for equality."
        }
    ]
}