{
    "term": "portraitists",
    "meanings": [
        {
            "definition": "A person who creates portraits.",
            "pos": "noun",
            "sent1": "The talented portraitists captured the essence of their subjects in their paintings.",
            "sent2": "Many portraitists use different techniques to paint realistic portraits.",
            "sent3": "The portraitists at the art fair had a competition to see who could paint the silliest portrait.",
            "sent4": "She was a portraitist of emotions, using colors to express feelings on canvas.",
            "sent5": "The portraitists' gallery was filled with lifelike paintings that seemed to come alive."
        },
        {
            "definition": "The act of creating portraits.",
            "pos": "noun",
            "sent1": "Portraitists spend hours perfecting their craft to create beautiful portraits.",
            "sent2": "The art school offers classes on portraitists for aspiring painters.",
            "sent3": "During the portraitists' workshop, they accidentally spilled paint all over the canvas.",
            "sent4": "Her brushstrokes danced on the canvas, a true display of portraitists' skill.",
            "sent5": "The portraitists' exhibition showcased the diversity of styles in portrait painting."
        },
        {
            "definition": "The study or practice of creating portraits.",
            "pos": "noun",
            "sent1": "The university offers a degree in portraitists for those interested in the art form.",
            "sent2": "Many famous artists have dedicated their lives to the study of portraitists.",
            "sent3": "The portraitists' club meets every week to discuss new techniques and trends.",
            "sent4": "In the world of portraitists, attention to detail is key to capturing likeness.",
            "sent5": "The book on portraitists' history highlighted the evolution of portrait painting over the centuries."
        }
    ]
}