{
    "term": "post",
    "meanings": [
        {
            "definition": "A long, sturdy piece of timber or metal set upright in the ground and used as a support or marker.",
            "pos": "noun",
            "sent1": "The post marked the boundary of the property.",
            "sent2": "She leaned against the post while waiting for the bus.",
            "sent3": "The squirrel used the post as a lookout point for acorns.",
            "sent4": "The post stood tall like a guardian of the garden.",
            "sent5": "The post was so heavy, it took two people to lift it into place."
        },
        {
            "definition": "A job or position in an organization.",
            "pos": "noun",
            "sent1": "Her dream was to get a post in the company's marketing department.",
            "sent2": "The manager announced a new post opening in the sales team.",
            "sent3": "The post of team leader came with added responsibilities.",
            "sent4": "She aspired to reach a high post within the organization.",
            "sent5": "The post of CEO required strong leadership skills."
        },
        {
            "definition": "To display or publish something online.",
            "pos": "verb",
            "sent1": "She would post updates about her travels on social media.",
            "sent2": "He decided to post a picture of his new puppy on his blog.",
            "sent3": "The cat tried to post a selfie but ended up taking a nap on the keyboard.",
            "sent4": "The artist would post his latest creations for his followers to see.",
            "sent5": "She planned to post a video tutorial on her channel next week."
        },
        {
            "definition": "To send or submit something for consideration or publication.",
            "pos": "verb",
            "sent1": "He needed to post his application before the deadline.",
            "sent2": "She would post her article to the editor for review.",
            "sent3": "The student forgot to post his homework assignment on time.",
            "sent4": "They decided to post their research findings in a scientific journal.",
            "sent5": "She hurried to post her entry for the writing competition."
        }
    ]
}