{
    "term": "potent",
    "meanings": [
        {
            "definition": "Having great power, influence, or effect.",
            "pos": "adjective",
            "sent1": "The superhero's potent abilities saved the city from disaster.",
            "sent2": "The medicine had a potent effect on the patient's illness.",
            "sent3": "The magician's wand was so potent that it made objects disappear in a puff of smoke.",
            "sent4": "Her words were as potent as a thunderstorm, leaving a lasting impact on the audience.",
            "sent5": "The potent smell of freshly baked cookies filled the entire house, tempting everyone to have a bite."
        },
        {
            "definition": "Strong and effective in a particular situation.",
            "pos": "adjective",
            "sent1": "The team's potent strategy led them to victory in the championship.",
            "sent2": "The cleaner's potent solution easily removed the stubborn stain from the carpet.",
            "sent3": "The detective's potent deduction skills helped solve the mystery in record time.",
            "sent4": "Her potent argument swayed the jury in her favor during the trial.",
            "sent5": "The potent combination of spices in the dish created a burst of flavors in every bite."
        },
        {
            "definition": "Capable of producing a strong physical or chemical effect.",
            "pos": "adjective",
            "sent1": "The potent cleaner quickly dissolved the grease on the kitchen counter.",
            "sent2": "The volcano's eruption released a potent cloud of ash into the sky.",
            "sent3": "The potion's potent ingredients bubbled and steamed in the cauldron.",
            "sent4": "The potent smell of the flowers attracted bees from miles away.",
            "sent5": "The potent heat of the sun warmed the earth and made the flowers bloom."
        },
        {
            "definition": "Having a strong sexual desire or ability.",
            "pos": "adjective",
            "sent1": "The potent attraction between them was undeniable.",
            "sent2": "The perfume's potent scent captivated everyone in the room.",
            "sent3": "The romantic movie had a potent effect on their emotions, making them tear up.",
            "sent4": "The potent chemistry between the actors made the love scenes feel authentic.",
            "sent5": "The potent allure of the forbidden fruit tempted Eve to take a bite."
        }
    ]
}