{
    "term": "pounded",
    "meanings": [
        {
            "definition": "To strike repeatedly with great force",
            "pos": "verb",
            "sent1": "The blacksmith pounded the hot metal on the anvil.",
            "sent2": "She pounded the drum loudly during the performance.",
            "sent3": "The chef pounded the spices in the mortar and pestle, creating a cloud of aroma.",
            "sent4": "The waves pounded against the shore, creating a rhythmic sound.",
            "sent5": "The carpenter pounded the nail into the wood with precision."
        },
        {
            "definition": "To crush or grind into a powder or paste",
            "pos": "verb",
            "sent1": "She pounded the garlic and herbs in the mortar to make a flavorful paste.",
            "sent2": "The chef pounded the spices to create a fine powder for the curry.",
            "sent3": "The kids pounded the candy canes into small pieces to decorate the cupcakes.",
            "sent4": "The heavy rain pounded the soil into mud, making it difficult to walk.",
            "sent5": "The old recipe required pounding the nuts into a smooth butter for the cake."
        },
        {
            "definition": "To move heavily or clumsily",
            "pos": "verb",
            "sent1": "The tired hiker pounded down the trail, eager to reach the campsite.",
            "sent2": "The elephant pounded through the jungle, shaking the ground with each step.",
            "sent3": "The clumsy puppy pounded around the house, knocking over everything in its path.",
            "sent4": "The heavy suitcase pounded down the stairs, causing a loud noise.",
            "sent5": "The exhausted runner pounded across the finish line, gasping for breath."
        },
        {
            "definition": "To beat or throb with intensity",
            "pos": "verb",
            "sent1": "His heart pounded in his chest as he waited for the exam results.",
            "sent2": "The music pounded through the speakers, making the floor vibrate.",
            "sent3": "The headache pounded in his temples, making it hard to focus.",
            "sent4": "The rain pounded on the roof, creating a soothing rhythm for sleep.",
            "sent5": "The excitement pounded in her veins as she approached the stage."
        }
    ]
}