{
    "term": "poussettes",
    "meanings": [
        {
            "definition": "A dance move involving a series of small steps and turns.",
            "pos": "noun",
            "sent1": "During the dance competition, she impressed the judges with her flawless poussettes.",
            "sent2": "The ballet instructor taught the students how to perform elegant poussettes across the stage.",
            "sent3": "At the wedding, the guests cheered as the groom attempted poussettes on the dance floor.",
            "sent4": "Her poussettes were like a graceful whirlwind, captivating everyone in the room.",
            "sent5": "The poussettes added a touch of magic to the performance, mesmerizing the audience."
        },
        {
            "definition": "A type of carriage or stroller for babies.",
            "pos": "noun",
            "sent1": "The mother carefully placed her sleeping baby in the poussettes before heading out for a walk.",
            "sent2": "The park was filled with parents pushing poussettes while enjoying the sunny day.",
            "sent3": "The poussettes rolled smoothly over the bumpy path, lulling the baby to sleep.",
            "sent4": "The poussettes stood out with their vibrant colors, attracting the attention of passersby.",
            "sent5": "She decorated the poussettes with cute toys to keep the baby entertained during the stroll."
        },
        {
            "definition": "To push or move something gently with a slight rocking motion.",
            "pos": "verb",
            "sent1": "She poussettes the swing back and forth to soothe her little sister.",
            "sent2": "The caretaker poussettes the wheelchair along the garden path with ease.",
            "sent3": "He poussettes the shopping cart playfully around the supermarket aisles.",
            "sent4": "The boat gently poussettes on the calm waters of the lake, creating ripples.",
            "sent5": "The breeze poussettes the leaves on the tree branches, creating a peaceful rustling sound."
        }
    ]
}