{
    "term": "powder",
    "meanings": [
        {
            "definition": "A fine substance made up of small particles",
            "pos": "noun",
            "sent1": "The baby's face was covered in powder after playing in the sandbox.",
            "sent2": "The flour looked like a soft powder as it sifted through the sieve.",
            "sent3": "The magician's trick involved turning water into powder, much to the audience's amazement.",
            "sent4": "The stars in the night sky seemed to be sprinkled like powder across the dark canvas.",
            "sent5": "The snowfall was so heavy that it blanketed the town in a thick layer of white powder."
        },
        {
            "definition": "To sprinkle or cover with powder",
            "pos": "verb",
            "sent1": "She likes to powder her hands before climbing to improve her grip.",
            "sent2": "The baker would powder the freshly baked donuts with sugar before serving them.",
            "sent3": "The clown accidentally powdered his face with flour instead of makeup, causing laughter in the audience.",
            "sent4": "The wind would powder the ground with fallen leaves, creating a colorful carpet in the park.",
            "sent5": "The chef would carefully powder the dessert with cocoa for a final touch of sweetness."
        },
        {
            "definition": "A cosmetic in the form of a loose, dry substance",
            "pos": "noun",
            "sent1": "She applied a light dusting of powder to set her makeup in place.",
            "sent2": "The powder puff was used to evenly distribute the cosmetic powder on her skin.",
            "sent3": "The clown's exaggerated face makeup included bright red powder on his cheeks.",
            "sent4": "The desert sand shimmered like golden powder under the scorching sun.",
            "sent5": "The volcanic ash settled like a fine powder on the rooftops after the eruption."
        },
        {
            "definition": "To reduce to fine particles by crushing or grinding",
            "pos": "verb",
            "sent1": "The chef would powder the spices to enhance the flavor of the dish.",
            "sent2": "The old mill would powder the grains into flour for the villagers.",
            "sent3": "The hiker accidentally powdered the rocks under his heavy boots as he climbed the mountain.",
            "sent4": "The ancient statue had been weathered over time, its features powdered by the elements.",
            "sent5": "The artist would carefully powder the pigments to create vibrant colors for his paintings."
        }
    ]
}