{
    "term": "powerless",
    "meanings": [
        {
            "definition": "Lacking power or ability",
            "pos": "adjective",
            "sent1": "The tiny kitten felt powerless against the big dog.",
            "sent2": "She felt powerless to change the situation.",
            "sent3": "The superhero's powerless sidekick always made everyone laugh.",
            "sent4": "The flickering candle seemed powerless against the darkness.",
            "sent5": "The old, rusty car was completely powerless to start."
        },
        {
            "definition": "Without power or control",
            "pos": "adjective",
            "sent1": "The broken remote was powerless to turn on the TV.",
            "sent2": "The citizens were powerless to stop the new law from passing.",
            "sent3": "The magician's powerless wand kept producing unexpected results.",
            "sent4": "The small boat felt powerless against the raging storm.",
            "sent5": "The tired athlete was powerless to continue running."
        },
        {
            "definition": "Unable to act or influence",
            "pos": "adjective",
            "sent1": "The student felt powerless to change the teacher's mind.",
            "sent2": "The tree was powerless to move out of the way of the bulldozer.",
            "sent3": "The powerless clock couldn't speed up time for the impatient child.",
            "sent4": "The trapped bird was powerless to escape from the cage.",
            "sent5": "The old computer was powerless to load the heavy software."
        },
        {
            "definition": "Devoid of strength or authority",
            "pos": "adjective",
            "sent1": "The wilted flower looked powerless in the scorching sun.",
            "sent2": "The king became powerless after the revolution.",
            "sent3": "The powerless ruler's crown kept slipping off his head.",
            "sent4": "The weak bridge felt powerless under the weight of the truck.",
            "sent5": "The old, rusty lock was powerless to keep the door closed."
        }
    ]
}