{
    "term": "pozzolana",
    "meanings": [
        {
            "definition": "A type of volcanic ash used in construction.",
            "pos": "noun",
            "sent1": "The builders mixed pozzolana with other materials to make the concrete stronger.",
            "sent2": "Pozzolana is a key ingredient in many ancient Roman structures.",
            "sent3": "The volcano sneezed out pozzolana, and the builders caught it to use in their projects.",
            "sent4": "The pozzolana in the mixture acted like a superhero, strengthening the construction.",
            "sent5": "The pozzolana ash added a touch of magic to the building process."
        },
        {
            "definition": "A material that can be mixed with lime to create a hydraulic cement.",
            "pos": "noun",
            "sent1": "The workers combined pozzolana with lime to produce a special type of cement.",
            "sent2": "Pozzolana is known for its ability to react with lime and form a strong bond.",
            "sent3": "The pozzolana and lime danced together in the cement mixer, creating a unique blend.",
            "sent4": "The mixture of pozzolana and lime transformed into a powerful cement potion.",
            "sent5": "Adding pozzolana to the lime mix was like adding a secret ingredient to a recipe."
        },
        {
            "definition": "A substance that improves the strength and durability of concrete.",
            "pos": "noun",
            "sent1": "The engineers discovered that pozzolana enhanced the concrete's resilience.",
            "sent2": "Pozzolana is a valuable additive that increases the longevity of concrete structures.",
            "sent3": "The pozzolana high-fived the concrete, making it tougher and more durable.",
            "sent4": "The concrete, infused with pozzolana, became as tough as a warrior's shield.",
            "sent5": "The pozzolana infusion turned the concrete into a fortress of strength and durability."
        }
    ]
}