{
    "term": "preach",
    "meanings": [
        {
            "definition": "To deliver a sermon or religious discourse.",
            "pos": "verb",
            "sent1": "Every Sunday, the pastor would preach to the congregation about kindness and forgiveness.",
            "sent2": "The preacher traveled from town to town to preach the word of God.",
            "sent3": "The parrot started to preach about sharing crackers with everyone in the room.",
            "sent4": "Her actions preached louder than her words, showing true compassion and empathy.",
            "sent5": "The old oak tree seemed to preach wisdom with its swaying branches."
        },
        {
            "definition": "To advocate or promote a belief or cause.",
            "pos": "verb",
            "sent1": "She would often preach the benefits of eating vegetables to her friends.",
            "sent2": "The activist would preach for hours about the importance of protecting the environment.",
            "sent3": "The cat tried to preach the superiority of napping over playing all day.",
            "sent4": "His artwork preached a message of unity and acceptance to all who viewed it.",
            "sent5": "The colorful banner preached a message of love and equality to all who passed by."
        },
        {
            "definition": "To give moral or religious advice in a tedious or self-righteous way.",
            "pos": "verb",
            "sent1": "He would often preach about the dangers of eating too much sugar to anyone who would listen.",
            "sent2": "The aunt would preach to her nieces and nephews about the importance of good manners.",
            "sent3": "The dog seemed to preach about the benefits of belly rubs and treats all day long.",
            "sent4": "Her constant preaching about the evils of technology started to annoy her friends.",
            "sent5": "The painting on the wall seemed to preach about the passage of time and the beauty of aging."
        }
    ]
}