{
    "term": "precedences",
    "meanings": [
        {
            "definition": "The condition of being considered more important than someone or something else.",
            "pos": "noun",
            "sent1": "In our family, age often takes precedences when making decisions.",
            "sent2": "Respecting your elders is a common precedence in many cultures.",
            "sent3": "At the dinner table, the cat claimed precedence over the dog for the best spot by the window.",
            "sent4": "The safety of the passengers takes precedence over everything else for the pilot.",
            "sent5": "The teacher's precedence in the classroom is to ensure all students are learning effectively."
        },
        {
            "definition": "The order in which things should be dealt with or given attention.",
            "pos": "noun",
            "sent1": "When organizing the event, the precedence was given to setting up the stage first.",
            "sent2": "The teacher explained the precedence of completing homework before starting a new project.",
            "sent3": "The cat's precedence for attention was evident when it meowed loudly until it was petted.",
            "sent4": "In the emergency room, patients are treated based on the precedence of their injuries.",
            "sent5": "The team leader established a clear precedence for tasks to be completed in a specific order."
        },
        {
            "definition": "The act or fact of coming before in time, order, or position.",
            "pos": "noun",
            "sent1": "The precedence of the sunrise signals the start of a new day.",
            "sent2": "In history, the precedence of certain events can shape the course of the future.",
            "sent3": "The cat's precedence in the household was evident by its favorite spot on the couch.",
            "sent4": "The precedence of the queen's arrival was marked by a grand procession.",
            "sent5": "The precedence of the first snowfall brought excitement to the children in the neighborhood."
        }
    ]
}