{
    "term": "precentors",
    "meanings": [
        {
            "definition": "A person who leads a choir or congregation in singing.",
            "pos": "noun",
            "sent1": "The precentors guided the choir in singing hymns during the church service.",
            "sent2": "The precentors at the cathedral had beautiful voices that inspired the congregation.",
            "sent3": "The precentors joked that they should start a choir of birds to join them in their performances.",
            "sent4": "Her voice soared above the choir like a precentors leading a heavenly chorus.",
            "sent5": "The precentors, with their confident gestures, set the tone for the entire choir."
        },
        {
            "definition": "The leader of a choir in a cathedral or church.",
            "pos": "noun",
            "sent1": "As the precentors, they were responsible for choosing the hymns for the church service.",
            "sent2": "The precentors stood at the front of the choir, directing the singers with precision.",
            "sent3": "The precentors, with their regal robes, looked like they belonged in a royal court instead of a church.",
            "sent4": "She ruled over the choir like a precentors commanding an army of voices.",
            "sent5": "The precentors' presence filled the cathedral with music and reverence."
        },
        {
            "definition": "A person who directs the singing of a choir.",
            "pos": "noun",
            "sent1": "The precentors used hand signals to indicate when the choir should start singing.",
            "sent2": "In the church choir, the precentors ensured that each voice blended harmoniously.",
            "sent3": "The precentors playfully pretended to conduct an invisible choir during rehearsal.",
            "sent4": "Her role as precentors was like being the captain of a ship navigating through a sea of melodies.",
            "sent5": "The precentors' passion for music shone through in every gesture they made."
        }
    ]
}