{
    "term": "precious",
    "meanings": [
        {
            "definition": "Of great value or high price",
            "pos": "adjective",
            "sent1": "Her precious necklace was a gift from her grandmother.",
            "sent2": "The diamond ring was very precious to the family.",
            "sent3": "The cat's precious toy mouse went missing again.",
            "sent4": "In her eyes, time was the most precious commodity.",
            "sent5": "The sunlight cast a precious glow on the garden flowers."
        },
        {
            "definition": "Highly esteemed or cherished",
            "pos": "adjective",
            "sent1": "The old photo albums held precious memories of their childhood.",
            "sent2": "The teacher's kind words were precious to the student.",
            "sent3": "The dog's precious spot on the couch was always taken by the cat.",
            "sent4": "Her smile was as precious as a rare gem.",
            "sent5": "The laughter of children is a precious sound in the park."
        },
        {
            "definition": "Affectionate or loving",
            "pos": "adjective",
            "sent1": "She gave her precious dog a big hug.",
            "sent2": "The mother's lullabies were filled with precious words of love.",
            "sent3": "The cat's purring was a precious sound to the lonely man.",
            "sent4": "His precious gesture of holding her hand warmed her heart.",
            "sent5": "The child's precious smile melted the teacher's heart."
        },
        {
            "definition": "Used as an intensifier to emphasize the value or importance of something",
            "pos": "adjective",
            "sent1": "The precious little kitten was too cute to resist.",
            "sent2": "The precious moment of silence before the announcement held everyone's attention.",
            "sent3": "The precious seconds before the clock struck midnight felt like an eternity.",
            "sent4": "The precious few words he spoke carried great weight in the room.",
            "sent5": "The precious silence in the library was broken by a loud sneeze."
        }
    ]
}