{
    "term": "precedence",
    "meanings": [
        {
            "definition": "The condition of being considered more important than someone or something else.",
            "pos": "noun",
            "sent1": "In our class, the teacher always gives precedence to students who raise their hands.",
            "sent2": "The CEO's opinion takes precedence in important company decisions.",
            "sent3": "At the pizza party, the pepperoni slices seemed to have precedence over the cheese ones.",
            "sent4": "During emergencies, safety takes precedence over everything else.",
            "sent5": "The safety of the passengers should always be given precedence over other concerns."
        },
        {
            "definition": "The right to take precedence over others in a particular situation.",
            "pos": "noun",
            "sent1": "As the team captain, Sarah had precedence in choosing the team's strategy.",
            "sent2": "The senior citizens were granted precedence in boarding the bus.",
            "sent3": "The birthday girl had precedence in picking the first game to play.",
            "sent4": "The king's decree gave him precedence over all other nobles.",
            "sent5": "The winner of the race earned the precedence to lead the victory parade."
        },
        {
            "definition": "The order to be followed in a sequence or series.",
            "pos": "noun",
            "sent1": "In baking, the recipe's steps must be followed in precedence to achieve the perfect cake.",
            "sent2": "The traffic lights dictate the precedence of vehicles at the intersection.",
            "sent3": "The alphabet song helps children learn the precedence of letters in the alphabet.",
            "sent4": "The rules of the game outline the precedence of moves players can make.",
            "sent5": "Understanding the precedence of historical events helps make sense of timelines."
        }
    ]
}