{
    "term": "precedency",
    "meanings": [
        {
            "definition": "The condition of being considered more important than someone or something else.",
            "pos": "noun",
            "sent1": "In the meeting, the boss's precedency was evident as everyone listened attentively to his words.",
            "sent2": "The precedency of the president was clear as he entered the room and everyone stood up to greet him.",
            "sent3": "At the party, the cat seemed to claim precedency over the dog by sitting on the most comfortable chair.",
            "sent4": "The precedency of the sun in the sky is a reminder of its dominance over the day.",
            "sent5": "The precedency of safety in the workplace should always be a top priority for employers."
        },
        {
            "definition": "The act or fact of preceding in time or order.",
            "pos": "noun",
            "sent1": "Before the concert, the precedency of setting up the stage and equipment is crucial for a successful show.",
            "sent2": "The precedency of finishing homework before playing video games is a good habit to develop.",
            "sent3": "The precedency of eating dessert before dinner may seem odd, but it was a fun experiment.",
            "sent4": "The precedency of the first snowflake falling signaled the start of winter.",
            "sent5": "The precedency of the morning routine sets the tone for the rest of the day."
        },
        {
            "definition": "The right to go before others.",
            "pos": "noun",
            "sent1": "As a VIP guest, she had the precedency to enter the event before the general audience.",
            "sent2": "The precedency to board the plane first is often given to passengers with young children.",
            "sent3": "The cat claimed precedency to be fed first by meowing loudly at the food bowl.",
            "sent4": "In the race, the athlete fought for the precedency to take the lead from the start.",
            "sent5": "The precedency to choose the movie for movie night was given to the birthday person."
        }
    ]
}