{
    "term": "predatory",
    "meanings": [
        {
            "definition": "Preying on other animals for food.",
            "pos": "noun",
            "sent1": "The lion's predatory instincts kicked in as it hunted for its next meal.",
            "sent2": "The documentary showed the cheetah's predatory behavior as it chased down its prey.",
            "sent3": "The predatory eagle swooped down to catch a fish, but ended up with a boot instead!",
            "sent4": "Her predatory gaze scanned the room, searching for any signs of weakness.",
            "sent5": "The shark's predatory nature was evident as it circled its unsuspecting target."
        },
        {
            "definition": "Involving or characterized by plundering or pillaging.",
            "pos": "adjective",
            "sent1": "The pirates had a predatory look in their eyes as they approached the merchant ship.",
            "sent2": "The viking warriors were known for their predatory raids on coastal villages.",
            "sent3": "The raccoon's predatory behavior towards the bird feeder was both impressive and annoying.",
            "sent4": "The company's predatory pricing strategy put many small businesses out of operation.",
            "sent5": "The storm's predatory winds tore through the town, leaving destruction in its wake."
        },
        {
            "definition": "Seeking to exploit or harm others for personal gain.",
            "pos": "adjective",
            "sent1": "The con artist had a predatory smile as he targeted unsuspecting victims.",
            "sent2": "The predatory loan shark preyed on vulnerable individuals in need of quick cash.",
            "sent3": "The cat's predatory behavior towards the toy mouse was both amusing and adorable.",
            "sent4": "The politician's predatory tactics in the election campaign were met with public outrage.",
            "sent5": "The spider's predatory web was a masterpiece of deception, luring insects to their doom."
        }
    ]
}