{
    "term": "predive",
    "meanings": [
        {
            "definition": "To dive before or ahead of someone or something.",
            "pos": "verb",
            "sent1": "The eager swimmer decided to predive into the pool before his friends.",
            "sent2": "She always likes to predive into the water before anyone else during swimming practice.",
            "sent3": "The dolphin thought it would be funny to predive in front of the seal, surprising it.",
            "sent4": "The bird seemed to predive through the air, swooping down gracefully to catch its prey.",
            "sent5": "The idea of predive made the synchronized swimmers stand out in their routine."
        },
        {
            "definition": "Occurring before a dive.",
            "pos": "adjective",
            "sent1": "The predive stretching exercises helped the diver warm up before the competition.",
            "sent2": "The coach emphasized the importance of predive preparation to avoid injuries.",
            "sent3": "The predive snack of a banana gave the diver a boost of energy before the big event.",
            "sent4": "The predive nerves made the diver feel both excited and anxious at the same time.",
            "sent5": "The predive checklist ensured that all equipment was ready for the upcoming dive."
        },
        {
            "definition": "A dive that is done before another dive.",
            "pos": "noun",
            "sent1": "The synchronized team executed a perfect predive before their main routine.",
            "sent2": "The judges were impressed by the synchronization of the predive performed by the divers.",
            "sent3": "The predive became the highlight of the show, setting the tone for the rest of the performance.",
            "sent4": "The predive symbolized the unity and precision of the diving team.",
            "sent5": "The audience held their breath as they watched the predive unfold with grace and skill."
        }
    ]
}