{
    "term": "preen",
    "meanings": [
        {
            "definition": "To groom oneself, especially by smoothing and cleaning feathers or fur.",
            "pos": "verb",
            "sent1": "The bird would preen its feathers after bathing in the pond.",
            "sent2": "She likes to preen her cat's fur to keep it clean and shiny.",
            "sent3": "The squirrel decided to preen itself in front of the mirror, admiring its fluffy tail.",
            "sent4": "Watching the swan preen its feathers was like witnessing a delicate dance of beauty.",
            "sent5": "The peacock would preen its colorful plumage before strutting around the garden."
        },
        {
            "definition": "To pride oneself on one's appearance or achievements.",
            "pos": "verb",
            "sent1": "He would preen with satisfaction after receiving compliments on his artwork.",
            "sent2": "She tends to preen when praised for her excellent grades in school.",
            "sent3": "The cat seemed to preen when its owner called it the 'cutest pet in the neighborhood'.",
            "sent4": "The actor couldn't help but preen when the audience applauded his performance.",
            "sent5": "The student would preen with pride as she received her award for academic excellence."
        },
        {
            "definition": "To make oneself look attractive or tidy.",
            "pos": "verb",
            "sent1": "She would preen in front of the mirror before going out on a date.",
            "sent2": "The dog would preen itself by licking its paws and smoothing its fur.",
            "sent3": "The child tried to preen before the family photo, fixing his hair and adjusting his shirt.",
            "sent4": "The flower seemed to preen in the sunlight, showing off its vibrant colors.",
            "sent5": "The model would preen backstage before stepping onto the runway, ensuring every hair was in place."
        }
    ]
}