{
    "term": "prees",
    "meanings": [
        {
            "definition": "To exert pressure or force on something.",
            "pos": "verb",
            "sent1": "She preesed the door to open it.",
            "sent2": "He preesed the ball to make it bounce higher.",
            "sent3": "The cat preesed against the window to get a better view.",
            "sent4": "The wind preesed against the sails, propelling the boat forward.",
            "sent5": "The weight of the books preesed down on the shelf, causing it to bend."
        },
        {
            "definition": "To squeeze or compress something.",
            "pos": "verb",
            "sent1": "Mom preesed the toothpaste tube to get the last bit out.",
            "sent2": "He preesed the clay between his fingers to shape it into a figure.",
            "sent3": "The chef preesed the dough gently to form perfect cookies.",
            "sent4": "The hiker's backpack preesed uncomfortably against his shoulders.",
            "sent5": "The child preesed the playdough into different shapes with delight."
        },
        {
            "definition": "To push or move something forward.",
            "pos": "verb",
            "sent1": "She preesed the swing to make it go higher.",
            "sent2": "The worker preesed the cart along the warehouse aisle.",
            "sent3": "The students preesed their desks closer to the front of the class.",
            "sent4": "The river preesed the debris downstream after the storm.",
            "sent5": "The car preesed through the thick fog, slowly making its way forward."
        },
        {
            "definition": "To urge or encourage someone to do something.",
            "pos": "verb",
            "sent1": "The coach preesed the team to give their best effort.",
            "sent2": "She preesed her friend to join her on the adventure.",
            "sent3": "The teacher preesed the students to complete their assignments on time.",
            "sent4": "The parents preesed their child to study hard for the exam.",
            "sent5": "The mentor preesed the mentee to pursue their dreams with determination."
        }
    ]
}