{
    "term": "prejudicialnesses",
    "meanings": [
        {
            "definition": "The quality or state of being prejudicial.",
            "pos": "noun",
            "sent1": "Her prejudicialnesses towards certain groups made it difficult for her to see the good in people.",
            "sent2": "The prejudicialnesses of the decision had a negative impact on the outcome.",
            "sent3": "Despite his prejudicialnesses, he always tried to be fair in his judgments.",
            "sent4": "The cloud of prejudicialnesses hung over the courtroom, affecting everyone's perception.",
            "sent5": "The prejudicialnesses in her words left a lasting impression on those who heard them."
        },
        {
            "definition": "Actions or behaviors that are harmful or detrimental to someone's interests.",
            "pos": "noun",
            "sent1": "His prejudicialnesses towards his colleagues led to conflicts in the workplace.",
            "sent2": "The company's decision had unintended prejudicialnesses on its employees.",
            "sent3": "The cat's playful prejudicialnesses towards the mouse always ended in a chase.",
            "sent4": "The storm's prejudicialnesses towards the crops devastated the farmer's harvest.",
            "sent5": "The prejudicialnesses of the bully's actions were finally addressed by the school principal."
        },
        {
            "definition": "The tendency to judge or treat others unfairly based on preconceived notions.",
            "pos": "noun",
            "sent1": "Her prejudicialnesses often stemmed from misunderstandings and stereotypes.",
            "sent2": "The prejudicialnesses in his tone made it clear he had already made up his mind.",
            "sent3": "The comedian's humor played on the audience's prejudicialnesses in a lighthearted way.",
            "sent4": "The shadow of prejudicialnesses loomed over the community, causing division.",
            "sent5": "The prejudicialnesses in her actions were a barrier to building trust with others."
        }
    ]
}