{
    "term": "prejudices",
    "meanings": [
        {
            "definition": "Preconceived opinion that is not based on reason or actual experience.",
            "pos": "noun",
            "sent1": "Her prejudices against certain foods made it difficult for her to try new dishes.",
            "sent2": "His prejudices prevented him from seeing the truth about the situation.",
            "sent3": "The cat's prejudices against the vacuum cleaner led to a hilarious chase around the house.",
            "sent4": "The wall of prejudices between the two groups seemed impossible to break down.",
            "sent5": "The teacher's prejudices against technology hindered the students' learning experience."
        },
        {
            "definition": "A dislike, hostility, or unjust behavior deriving from preconceived and unfounded opinions.",
            "pos": "noun",
            "sent1": "Their prejudices towards people from different cultures caused unnecessary conflicts.",
            "sent2": "The prejudices of the bully made school a difficult place for many students.",
            "sent3": "The dog's prejudices towards the mailman resulted in comical barking fits every morning.",
            "sent4": "The shadow of prejudices loomed over the peaceful town, stirring up tension.",
            "sent5": "The company's prejudices against hiring older employees limited their pool of talent."
        },
        {
            "definition": "To cause harm or injury to someone due to preconceived opinions.",
            "pos": "verb",
            "sent1": "She prejudices her own success by constantly doubting her abilities.",
            "sent2": "He prejudices his relationships by always assuming the worst in people.",
            "sent3": "The mischievous squirrel prejudices the bird feeder by stealing all the seeds.",
            "sent4": "The storm prejudices the fragile flowers, bending them under its force.",
            "sent5": "The negative comments prejudices the team's morale, affecting their performance."
        }
    ]
}