{
    "term": "prejudice",
    "meanings": [
        {
            "definition": "Preconceived opinion that is not based on reason or actual experience.",
            "pos": "noun",
            "sent1": "Her prejudice against spiders made her scream whenever she saw one.",
            "sent2": "The teacher warned the students about the dangers of prejudice and discrimination.",
            "sent3": "Despite his prejudice against vegetables, he tried a salad and actually enjoyed it.",
            "sent4": "The darkness of the cave created a sense of prejudice, making her hesitant to enter.",
            "sent5": "The prejudice in her mind was like a heavy fog, clouding her judgment."
        },
        {
            "definition": "Harm or injury that results or may result from some action or judgment.",
            "pos": "noun",
            "sent1": "The car accident caused great prejudice to the passengers, resulting in severe injuries.",
            "sent2": "The new law was designed to prevent any prejudice to the environment.",
            "sent3": "The clumsy waiter's actions led to a comical prejudice of spilled drinks and broken plates.",
            "sent4": "The storm brought prejudice to the small town, leaving behind a trail of destruction.",
            "sent5": "The prejudice of the harsh winter weather made it difficult for the animals to find food."
        },
        {
            "definition": "To give rise to prejudice in someone; make biased.",
            "pos": "verb",
            "sent1": "The constant negative news coverage can prejudice people against certain groups.",
            "sent2": "She didn't want to prejudice the jury by sharing her personal opinions before the trial.",
            "sent3": "His habit of always wearing blue socks started to prejudice his friends' fashion choices.",
            "sent4": "The politician's dishonesty began to prejudice the public's trust in government officials.",
            "sent5": "The misleading advertisement was designed to prejudice consumers into buying unnecessary products."
        }
    ]
}