{
    "term": "prejudicing",
    "meanings": [
        {
            "definition": "To cause harm or injury to someone's rights or interests.",
            "pos": "verb",
            "sent1": "By prejudicing the case, the lawyer made it difficult for the defendant to receive a fair trial.",
            "sent2": "The biased judge was prejudicing the outcome of the trial by favoring one side.",
            "sent3": "The cat was prejudicing the dog's chances of getting treats by stealing them all.",
            "sent4": "The storm was prejudicing the fragile roof, causing it to leak.",
            "sent5": "The bully's actions were prejudicing the victim's sense of safety and well-being."
        },
        {
            "definition": "To have a harmful effect on someone's opinion or judgment.",
            "pos": "verb",
            "sent1": "Her negative comments were prejudicing my view of the movie before I even watched it.",
            "sent2": "The misleading advertisement was prejudicing customers into buying a product that didn't work as promised.",
            "sent3": "The loud music was prejudicing my ability to concentrate on my homework.",
            "sent4": "The constant gossiping was prejudicing her reputation among her peers.",
            "sent5": "The biased news report was prejudicing the public's perception of the event."
        },
        {
            "definition": "To influence someone unfairly or negatively.",
            "pos": "verb",
            "sent1": "The false rumors were prejudicing her classmates against her.",
            "sent2": "The competitive coworker was prejudicing the boss's opinion of her work.",
            "sent3": "The broken clock was prejudicing their ability to tell time accurately.",
            "sent4": "The harsh criticism was prejudicing his self-esteem and confidence.",
            "sent5": "The biased article was prejudicing readers to believe false information."
        }
    ]
}