{
    "term": "prenatal",
    "meanings": [
        {
            "definition": "Occurring or existing before birth",
            "pos": "adjective",
            "sent1": "The prenatal vitamins are important for the baby's development before birth.",
            "sent2": "The doctor recommended some prenatal tests to ensure the baby's health before birth.",
            "sent3": "The prenatal class helped the parents prepare for the baby's arrival before birth.",
            "sent4": "The prenatal care provided by the hospital was crucial for the mother's well-being before birth.",
            "sent5": "The prenatal ultrasound revealed the baby's gender before birth, bringing joy to the parents."
        },
        {
            "definition": "Relating to the period before birth",
            "pos": "adjective",
            "sent1": "The prenatal check-ups monitor the baby's growth during the period before birth.",
            "sent2": "The prenatal classes educate expecting parents about the period before birth.",
            "sent3": "The prenatal yoga sessions help mothers relax during the period before birth.",
            "sent4": "The prenatal vitamins support the mother's health during the period before birth.",
            "sent5": "The prenatal care team guides the parents through the period before birth with care and expertise."
        },
        {
            "definition": "Of or relating to a fetus before birth",
            "pos": "adjective",
            "sent1": "The prenatal ultrasound provided a clear image of the fetus before birth.",
            "sent2": "The prenatal nutrition plan is designed to support the fetus before birth.",
            "sent3": "The prenatal music played to the mother's belly entertained the fetus before birth.",
            "sent4": "The prenatal screening tests ensure the health of the fetus before birth.",
            "sent5": "The prenatal development of the fetus is a fascinating process to observe before birth."
        }
    ]
}