{
    "term": "prepossession",
    "meanings": [
        {
            "definition": "A preconceived opinion or bias.",
            "pos": "noun",
            "sent1": "Her prepossession against spicy food made her avoid trying new dishes.",
            "sent2": "His prepossession towards certain brands influenced his shopping choices.",
            "sent3": "Despite his prepossession against horror movies, he found himself enjoying one by accident.",
            "sent4": "The prepossession she held towards technology was challenged when she tried the latest smartphone.",
            "sent5": "The prepossession that all politicians are corrupt is a common misconception."
        },
        {
            "definition": "The state of being preoccupied or engrossed in thought.",
            "pos": "noun",
            "sent1": "Her prepossession with solving puzzles often made her lose track of time.",
            "sent2": "His prepossession with his upcoming exam made it hard for him to focus on anything else.",
            "sent3": "His prepossession with finding the perfect gift led him to spend hours browsing online stores.",
            "sent4": "The prepossession of the detective with the case kept him up at night, analyzing every detail.",
            "sent5": "The prepossession of the artist with his latest painting consumed all his thoughts."
        },
        {
            "definition": "A previous possession or occupation.",
            "pos": "noun",
            "sent1": "The prepossession of the house by the previous owners left it in a state of disrepair.",
            "sent2": "The prepossession of the land by the ancient civilization was evident in the ruins that remained.",
            "sent3": "The prepossession of the shop by the new owner brought fresh energy and ideas to the business.",
            "sent4": "The prepossession of the car by the mechanic ensured it was in top condition for the race.",
            "sent5": "The prepossession of the office by the new team led to a complete redesign of the workspace."
        }
    ]
}