{
    "term": "prepotency",
    "meanings": [
        {
            "definition": "The quality of having superior power, influence, or force.",
            "pos": "noun",
            "sent1": "His prepotency in the company made him the go-to person for important decisions.",
            "sent2": "The king's prepotency over his subjects was unquestionable.",
            "sent3": "The prepotency of the boss in the office was so strong that even the coffee machine obeyed his commands.",
            "sent4": "Her prepotency in negotiations was akin to a lioness leading her pride.",
            "sent5": "The prepotency of the storm was evident in the way it uprooted trees and scattered debris everywhere."
        },
        {
            "definition": "The ability to produce offspring with consistent and desired traits.",
            "pos": "noun",
            "sent1": "The mare's prepotency in passing on speed to her foals made her a valuable asset to the racing stable.",
            "sent2": "Geneticists study the prepotency of certain traits in breeding programs.",
            "sent3": "The prepotency of the farmer's prized bull led to a new generation of strong and healthy calves.",
            "sent4": "The prepotency of the seed's genetics ensured a bountiful harvest for the farmer.",
            "sent5": "The prepotency of the trait for disease resistance saved the entire crop from destruction."
        },
        {
            "definition": "Dominance or predominance in a particular situation or context.",
            "pos": "noun",
            "sent1": "The prepotency of her argument swayed the jury in her favor.",
            "sent2": "In the world of sports, prepotency can often determine the outcome of a match.",
            "sent3": "The prepotency of the team captain's leadership style inspired his teammates to give their best.",
            "sent4": "The prepotency of the sun in the sky overshadowed all other celestial bodies.",
            "sent5": "The prepotency of the waterfall's roar drowned out all other sounds in the forest."
        }
    ]
}