{
    "term": "presentimental",
    "meanings": [
        {
            "definition": "Of or relating to a presentiment.",
            "pos": "adjective",
            "sent1": "Her presentimental feeling of unease grew stronger as the storm approached.",
            "sent2": "The psychic claimed to have a presentimental connection to the spirit world.",
            "sent3": "Despite her presentimental fears, she decided to go on the roller coaster and ended up having a great time.",
            "sent4": "The eerie silence in the house gave it a presentimental atmosphere, as if something unseen lurked within.",
            "sent5": "The old, abandoned mansion had a presentimental aura, making visitors feel as though they were being watched."
        },
        {
            "definition": "Having a presentiment.",
            "pos": "adjective",
            "sent1": "He couldn't shake the presentimental feeling that something bad was about to happen.",
            "sent2": "The fortune teller's presentimental prediction left her feeling anxious about the future.",
            "sent3": "His presentimental nature often led him to make decisions based on gut feelings rather than logic.",
            "sent4": "The presentimental warning bells in her mind urged her to be cautious in unfamiliar situations.",
            "sent5": "The protagonist's presentimental dreams often foreshadowed significant events in his life."
        },
        {
            "definition": "Characterized by presentiment.",
            "pos": "adjective",
            "sent1": "The movie had a presentimental tone, hinting at the tragic ending from the start.",
            "sent2": "The eerie mist that enveloped the forest gave it a presentimental appearance.",
            "sent3": "The detective's presentimental instincts helped him solve the case before anyone else.",
            "sent4": "The ominous music in the background added a presentimental touch to the suspenseful scene.",
            "sent5": "The old painting seemed to emanate a presentimental energy, as if capturing a moment of foreboding."
        }
    ]
}