{
    "term": "pressurising",
    "meanings": [
        {
            "definition": "To apply pressure to someone or something in order to persuade or force them to do something.",
            "pos": "verb",
            "sent1": "She kept pressurising her friend to join the dance class.",
            "sent2": "The salesperson was pressurising the customer to buy the expensive product.",
            "sent3": "The teacher playfully kept pressurising the students to finish their homework on time.",
            "sent4": "The constant pressurising from his boss made him feel suffocated.",
            "sent5": "The relentless pressurising from the media made the celebrity break down."
        },
        {
            "definition": "To make someone feel stressed or anxious by putting pressure on them.",
            "pos": "verb",
            "sent1": "The upcoming exam was pressurising the students to study harder.",
            "sent2": "The tight deadline was pressurising the team to complete the project quickly.",
            "sent3": "The mischievous cat was pressurising the dog by sitting on its favorite spot.",
            "sent4": "The constant pressurising at work was like a weight on her shoulders.",
            "sent5": "The looming deadline was pressurising him to finish the report before the end of the day."
        },
        {
            "definition": "To maintain a high pressure within a closed system.",
            "pos": "verb",
            "sent1": "The engineer was pressurising the container to test its durability.",
            "sent2": "The scuba diver was pressurising his suit before going underwater.",
            "sent3": "The chef was pressurising the cooker to speed up the cooking process.",
            "sent4": "The athlete felt like he was pressurising his body to perform at its best.",
            "sent5": "The mechanic was pressurising the tire to the recommended level before the long journey."
        }
    ]
}