{
    "term": "pretenses",
    "meanings": [
        {
            "definition": "A claim or assertion, especially one that is false or misleading.",
            "pos": "noun",
            "sent1": "She made pretenses of being sick to skip school.",
            "sent2": "His pretenses of wealth were quickly exposed when his debts came to light.",
            "sent3": "The cat's pretenses of innocence were shattered when the owner found feathers in its mouth.",
            "sent4": "The politician's pretenses of honesty crumbled under the weight of corruption scandals.",
            "sent5": "The magician's pretenses of magic were revealed by the hidden trapdoor on the stage."
        },
        {
            "definition": "A false show or appearance, especially one intended to deceive.",
            "pos": "noun",
            "sent1": "The elaborate pretenses of the con artist fooled many unsuspecting victims.",
            "sent2": "Her pretenses of happiness masked the deep sadness she felt inside.",
            "sent3": "The child's pretenses of being a superhero led to some amusing attempts at flying.",
            "sent4": "The crumbling mansion's pretenses of grandeur were evident in its peeling paint and broken windows.",
            "sent5": "The wolf disguised in sheep's clothing had pretenses of innocence until it attacked the flock."
        },
        {
            "definition": "The act of pretending or feigning.",
            "pos": "noun",
            "sent1": "His pretenses of bravery quickly faded when faced with real danger.",
            "sent2": "The actress's pretenses of sadness brought tears to the audience's eyes.",
            "sent3": "The dog's pretenses of being a guard dog were shattered when it ran away from a squirrel.",
            "sent4": "The student's pretenses of understanding the complex math problem were revealed when he failed the test.",
            "sent5": "The clown's pretenses of happiness hid the tears behind the painted smile."
        }
    ]
}