{
    "term": "pretentiousnesses",
    "meanings": [
        {
            "definition": "The quality of pretending to be more important or intelligent than one actually is.",
            "pos": "noun",
            "sent1": "Her constant pretentiousnesses made it difficult to have genuine conversations with her.",
            "sent2": "His pretentiousnesses were evident in the way he always name-dropped famous people.",
            "sent3": "Despite her pretentiousnesses, she couldn't fool anyone with her lack of knowledge.",
            "sent4": "The pretentiousnesses of the peacock among the pigeons was quite comical.",
            "sent5": "The pretentiousnesses of the snobbish waiter left a lasting impression on the diners."
        },
        {
            "definition": "The act of attempting to impress others by pretending to have greater knowledge or sophistication.",
            "pos": "noun",
            "sent1": "His constant pretentiousnesses in conversations were tiresome to listen to.",
            "sent2": "She used her pretentiousnesses to try to fit in with the intellectual crowd.",
            "sent3": "The pretentiousnesses of the know-it-all student were always met with eye rolls.",
            "sent4": "His pretentiousnesses were like a mask he wore to hide his insecurities.",
            "sent5": "The pretentiousnesses of the self-proclaimed expert were quickly exposed by real professionals."
        },
        {
            "definition": "The behavior of putting on airs or acting in a way that is meant to impress others.",
            "pos": "noun",
            "sent1": "Their pretentiousnesses at the party were so obvious that no one took them seriously.",
            "sent2": "He adopted pretentiousnesses to try to gain respect from his colleagues.",
            "sent3": "The pretentiousnesses of the actor were so over-the-top that the audience burst into laughter.",
            "sent4": "Her pretentiousnesses were like a costume she wore to play a role in society.",
            "sent5": "The pretentiousnesses of the socialite were like a shield to hide her true self from others."
        }
    ]
}