{
    "term": "pretenders",
    "meanings": [
        {
            "definition": "A person who claims or aspires to a particular position or quality without possessing the necessary qualifications or fulfilling the requirements.",
            "pos": "noun",
            "sent1": "The pretenders tried to act like they were in charge, but everyone knew they were not qualified.",
            "sent2": "The pretenders at the talent show pretended to be skilled musicians, but they were just amateurs.",
            "sent3": "The pretenders in the costume contest wore fake crowns and robes, fooling no one.",
            "sent4": "The pretenders in the race wore fake medals around their necks, hoping to deceive the judges.",
            "sent5": "The pretenders in the play wore oversized hats and carried fake scepters, trying to look important."
        },
        {
            "definition": "A person who professes beliefs or opinions that they do not hold or adhere to.",
            "pos": "noun",
            "sent1": "The pretenders in the debate claimed to support one side, but their true beliefs were different.",
            "sent2": "The pretenders in the group pretended to like a certain type of music, even though they actually disliked it.",
            "sent3": "The pretenders at the meeting nodded along to the speaker's words, though they disagreed in secret.",
            "sent4": "The pretenders in the class raised their hands in agreement, but their eyes revealed their true thoughts.",
            "sent5": "The pretenders in the conversation smiled and nodded, hiding their real opinions."
        },
        {
            "definition": "A person who simulates or feigns something for the purpose of deception or fraud.",
            "pos": "noun",
            "sent1": "The pretenders in the magic show amazed the audience with their illusions.",
            "sent2": "The pretenders in the scam pretended to be bank officials to steal people's money.",
            "sent3": "The pretenders at the party wore masks and pretended to be famous celebrities.",
            "sent4": "The pretenders in the con artist's scheme acted like they were wealthy to gain trust.",
            "sent5": "The pretenders in the disguise fooled everyone with their clever act."
        }
    ]
}