{
    "term": "prevaricated",
    "meanings": [
        {
            "definition": "Speak or act in an evasive way.",
            "pos": "verb",
            "sent1": "During the interrogation, the suspect prevaricated when asked about his whereabouts.",
            "sent2": "She prevaricated when her mom asked if she had finished her homework.",
            "sent3": "The politician prevaricated about his stance on the new law, causing confusion among voters.",
            "sent4": "His excuses prevaricated like a winding river, never quite reaching the truth.",
            "sent5": "Her words prevaricated around the issue, leaving everyone unsure of what she really meant."
        },
        {
            "definition": "Avoid telling the truth by not directly answering a question.",
            "pos": "verb",
            "sent1": "When asked about his grades, he prevaricated by talking about his favorite subjects instead.",
            "sent2": "Politicians often prevaricate during interviews to avoid giving direct answers.",
            "sent3": "The child prevaricated about eating cookies before dinner by saying he was just checking if they were fresh.",
            "sent4": "Her responses prevaricated around the truth, never giving a clear answer.",
            "sent5": "The witness prevaricated under cross-examination, making it hard to determine what really happened."
        },
        {
            "definition": "Deviate from the truth.",
            "pos": "verb",
            "sent1": "The student prevaricated in his essay by adding false information to make it sound better.",
            "sent2": "She prevaricated about her age to join the club meant for older kids.",
            "sent3": "The cat prevaricated about catching the mouse, pretending to be asleep when the owner asked.",
            "sent4": "His stories always prevaricated from reality, making them more exciting but less believable.",
            "sent5": "The weather forecast prevaricated, promising sunshine but delivering rain instead."
        }
    ]
}