{
    "term": "prevaricate",
    "meanings": [
        {
            "definition": "Speak or act in an evasive way.",
            "pos": "verb",
            "sent1": "When asked about his whereabouts, he would often prevaricate to avoid telling the truth.",
            "sent2": "Politicians sometimes prevaricate when they don't want to commit to a clear answer.",
            "sent3": "The child tried to prevaricate about eating cookies before dinner, but the crumbs on his face gave him away.",
            "sent4": "Her excuses were like a tangled web of prevarication, impossible to unravel.",
            "sent5": "The detective saw through the suspect's prevarication and knew he was hiding something."
        },
        {
            "definition": "Avoid giving a direct answer.",
            "pos": "verb",
            "sent1": "She would prevaricate whenever her parents asked about her grades.",
            "sent2": "During the interview, the politician continued to prevaricate instead of addressing the question directly.",
            "sent3": "The student tried to prevaricate by changing the topic whenever the teacher asked about the missing homework.",
            "sent4": "His tendency to prevaricate made it difficult for others to trust his words.",
            "sent5": "The suspect's constant prevarication only raised more suspicion about his involvement in the crime."
        },
        {
            "definition": "Lie or deceive.",
            "pos": "verb",
            "sent1": "It is never a good idea to prevaricate about your qualifications on a job application.",
            "sent2": "Some people prevaricate to cover up their mistakes instead of admitting the truth.",
            "sent3": "The cat tried to prevaricate by pretending the broken vase was already like that when the owner came home.",
            "sent4": "Her smile was a mask of prevarication, hiding the truth behind a facade of innocence.",
            "sent5": "The con artist's prevarication was so convincing that even the most cautious fell for his lies."
        }
    ]
}