{
    "term": "prex",
    "meanings": [
        {
            "definition": "A prayer or supplication",
            "pos": "noun",
            "sent1": "During the ceremony, the community gathered to offer a prex for peace and harmony.",
            "sent2": "Every night, she whispered a prex before going to bed, hoping for a better tomorrow.",
            "sent3": "The prex for good weather seemed to work as the sun shone brightly on the wedding day.",
            "sent4": "Her prex for success echoed in the empty room, filling her with determination.",
            "sent5": "The prex for healing was written on a small piece of paper and tucked under the pillow."
        },
        {
            "definition": "A prefix or title used before a name",
            "pos": "noun",
            "sent1": "The prex 'Dr.' before his name indicated his profession as a medical doctor.",
            "sent2": "In the document, the prex 'Ms.' was used to address the recipient respectfully.",
            "sent3": "She jokingly added the prex 'Queen' before her name on the online forum.",
            "sent4": "The prex 'Sir' bestowed upon him a sense of authority and respect.",
            "sent5": "The prex 'Mr.' was commonly used to address male individuals in formal settings."
        },
        {
            "definition": "A president, especially of a college or university",
            "pos": "noun",
            "sent1": "The prex of the university welcomed the new students during the orientation.",
            "sent2": "As the prex of the college, she was responsible for making important decisions.",
            "sent3": "The prex of the university surprised everyone by joining the student choir for a performance.",
            "sent4": "Being the prex of the college, he had to attend numerous meetings and events.",
            "sent5": "The prex of the university was known for his inspiring speeches during graduation ceremonies."
        }
    ]
}