{
    "term": "preyed",
    "meanings": [
        {
            "definition": "Hunted and killed for food",
            "pos": "noun",
            "sent1": "The lion's preyed consisted of zebras and antelopes.",
            "sent2": "The predator caught its preyed swiftly in the wild.",
            "sent3": "The chef's specialty was preparing dishes with fresh preyed.",
            "sent4": "The hunter's eyes gleamed as he spotted his preyed in the distance.",
            "sent5": "The circle of life involves predators and their preyed."
        },
        {
            "definition": "Exert harmful or damaging influence on",
            "pos": "verb",
            "sent1": "Negative thoughts preyed on her mind, making her anxious.",
            "sent2": "The virus preyed on the weakened immune system.",
            "sent3": "The persistent rain preyed on the outdoor picnic plans.",
            "sent4": "Doubt began to preyed on his confidence, affecting his performance.",
            "sent5": "The scam artist preyed on unsuspecting victims for personal gain."
        },
        {
            "definition": "Engage in predatory behavior",
            "pos": "verb",
            "sent1": "The cunning fox preyed on the unsuspecting rabbits in the field.",
            "sent2": "The hawk preyed on smaller birds for its meals.",
            "sent3": "The sneaky cat preyed on the birds at the feeder.",
            "sent4": "The con artist preyed on the vulnerable elderly for money.",
            "sent5": "The shark silently preyed on the fish swimming nearby."
        },
        {
            "definition": "Cause mental or physical suffering to",
            "pos": "verb",
            "sent1": "Guilt preyed on her conscience after the mistake.",
            "sent2": "The chronic illness preyed on his body, causing pain.",
            "sent3": "The suspense in the movie preyed on the audience's nerves.",
            "sent4": "The bully preyed on the smaller kids at school, causing fear.",
            "sent5": "The haunting memories preyed on his peace of mind, keeping him awake at night."
        }
    ]
}