{
    "term": "prickle",
    "meanings": [
        {
            "definition": "A small, sharp pointed outgrowth on the skin or plant",
            "pos": "noun",
            "sent1": "The cactus had a sharp prickle that could hurt if touched.",
            "sent2": "I carefully avoided the prickle on the rose stem.",
            "sent3": "The hedgehog's prickles made it look like a tiny porcupine.",
            "sent4": "The prickle on the thorn bush caught my sleeve as I passed by.",
            "sent5": "The prickle on the caterpillar's back served as its defense mechanism."
        },
        {
            "definition": "To cause a tingling or stinging sensation",
            "pos": "verb",
            "sent1": "The cold wind made my skin prickle with goosebumps.",
            "sent2": "The thought of the upcoming exam made me prickle with anxiety.",
            "sent3": "The unexpected compliment made her skin prickle with happiness.",
            "sent4": "The eerie silence in the haunted house made my senses prickle with fear.",
            "sent5": "The anticipation of the roller coaster ride made my whole body prickle with excitement."
        },
        {
            "definition": "To feel a sensation like pricking",
            "pos": "verb",
            "sent1": "As I sat on the grass, I felt my skin prickle from the tiny bugs crawling on me.",
            "sent2": "The new fabric of the shirt made my skin prickle uncomfortably.",
            "sent3": "The spooky story made my imagination prickle with fear.",
            "sent4": "The suspenseful movie made my nerves prickle with anticipation.",
            "sent5": "The icy water made my skin prickle with cold."
        },
        {
            "definition": "To cover or be covered with prickles",
            "pos": "verb",
            "sent1": "The bushes in the garden prickle my hands when I try to trim them.",
            "sent2": "The cat's fur prickle against my skin when I pet it the wrong way.",
            "sent3": "The rough surface of the fruit prickle my fingers as I peel it.",
            "sent4": "The thorny vines prickle the legs of anyone who walks through the overgrown area.",
            "sent5": "The dry grass in the field prickle my feet as I walk barefoot."
        }
    ]
}