{
    "term": "prick",
    "meanings": [
        {
            "definition": "A small, sharp point",
            "pos": "noun",
            "sent1": "The cactus had a prick that could hurt you.",
            "sent2": "I accidentally sat on a prick from the rose bush.",
            "sent3": "The sewing needle's prick made me jump!",
            "sent4": "The prick of the thorn reminded me of life's little pains.",
            "sent5": "The prick of the pin left a tiny mark on my finger."
        },
        {
            "definition": "To make a small hole in something",
            "pos": "verb",
            "sent1": "I used a needle to prick a hole in the paper.",
            "sent2": "She used a pin to prick the balloon and make it pop.",
            "sent3": "He tried to prick a hole in the tough fabric but failed.",
            "sent4": "The raindrops prick the soil, creating tiny puddles.",
            "sent5": "The chef used a fork to prick holes in the dough before baking."
        },
        {
            "definition": "To cause a sharp pain",
            "pos": "verb",
            "sent1": "The thorn can prick your finger if you touch it.",
            "sent2": "The bee's sting can prick and cause discomfort.",
            "sent3": "The icy wind can prick your skin and make you shiver.",
            "sent4": "His words seemed to prick her heart, making her sad.",
            "sent5": "The sharp rock can prick your foot if you step on it."
        },
        {
            "definition": "A rude or annoying person",
            "pos": "noun",
            "sent1": "Don't be a prick and interrupt others while they speak.",
            "sent2": "He can be a real prick when he's in a bad mood.",
            "sent3": "The prick at the store refused to help the customer.",
            "sent4": "She thought of him as a prick for his disrespectful behavior.",
            "sent5": "The boss's attitude made him come off as a prick to his employees."
        }
    ]
}