{
    "term": "priesthood",
    "meanings": [
        {
            "definition": "The office or position of a priest.",
            "pos": "noun",
            "sent1": "In our church, the priesthood is responsible for leading the congregation in prayer.",
            "sent2": "The priesthood plays a vital role in performing religious ceremonies.",
            "sent3": "The priesthood decided to have a potluck instead of a traditional service, causing quite a stir.",
            "sent4": "Her dedication to her role in the priesthood shines like a beacon of faith.",
            "sent5": "The solemnity of the priesthood ceremony left a lasting impression on the attendees."
        },
        {
            "definition": "The body of priests in a particular religion.",
            "pos": "noun",
            "sent1": "The priesthood gathered to discuss the upcoming festival.",
            "sent2": "Members of the priesthood often provide guidance and support to the community.",
            "sent3": "During the annual retreat, the priesthood challenged each other to a friendly game of volleyball.",
            "sent4": "The unity within the priesthood is as strong as the foundation of the church itself.",
            "sent5": "The traditions of the priesthood have been passed down for generations, preserving our beliefs."
        },
        {
            "definition": "The order or class of priests in a religion.",
            "pos": "noun",
            "sent1": "The priesthood follows a strict code of conduct to uphold their values.",
            "sent2": "Within the priesthood, there are different ranks based on experience and knowledge.",
            "sent3": "The annual priesthood bake-off competition always brings out the competitive spirit.",
            "sent4": "The bond between members of the priesthood transcends mere friendship.",
            "sent5": "The history of the priesthood dates back centuries, shaping the faith of many generations."
        }
    ]
}