{
    "term": "prime",
    "meanings": [
        {
            "definition": "Of the best quality or condition; first in importance",
            "pos": "adjective",
            "sent1": "The cake was at its prime when it was fresh out of the oven.",
            "sent2": "She always wears her prime jewelry for special occasions.",
            "sent3": "The prime cupcakes disappeared within minutes at the party.",
            "sent4": "His prime skills in painting shone through in every stroke.",
            "sent5": "The prime sunset painted the sky in vibrant colors."
        },
        {
            "definition": "A period of greatest strength, vigor, or success",
            "pos": "noun",
            "sent1": "During his prime, he could run faster than anyone else.",
            "sent2": "The company experienced its prime during the economic boom.",
            "sent3": "The prime of the movie was the thrilling car chase scene.",
            "sent4": "In the prime of summer, the flowers bloomed beautifully.",
            "sent5": "The athlete's prime was evident in his record-breaking performance."
        },
        {
            "definition": "To prepare or make ready for a particular purpose",
            "pos": "verb",
            "sent1": "She had to prime the canvas before starting the painting.",
            "sent2": "They needed to prime the engine before starting the boat.",
            "sent3": "He decided to prime himself with a cup of coffee before the meeting.",
            "sent4": "The chef had to prime the ingredients before cooking the dish.",
            "sent5": "The team had to prime their strategy before the important game."
        },
        {
            "definition": "To apply a coat of primer to (a surface)",
            "pos": "verb",
            "sent1": "He had to prime the walls before painting them a new color.",
            "sent2": "The carpenter needed to prime the wood before adding the final coat.",
            "sent3": "She carefully primed the metal surface before applying the paint.",
            "sent4": "The artist primed the canvas with a layer of white before starting the artwork.",
            "sent5": "Before painting the fence, they had to prime it to ensure the paint would stick."
        }
    ]
}