{
    "term": "primogeniture",
    "meanings": [
        {
            "definition": "The state of being the firstborn child in a family.",
            "pos": "noun",
            "sent1": "In some families, primogeniture determines who will inherit the family's belongings.",
            "sent2": "Primogeniture is the status of being the oldest child in a family.",
            "sent3": "The family joked that primogeniture meant the eldest child always got the biggest slice of cake.",
            "sent4": "To the parents, primogeniture was like a crown passed down through generations.",
            "sent5": "The concept of primogeniture is deeply rooted in many cultures around the world."
        },
        {
            "definition": "The system of inheritance where the eldest child receives the largest share of the parent's estate.",
            "pos": "noun",
            "sent1": "Under primogeniture, the oldest child inherits most of the family's wealth.",
            "sent2": "In some societies, primogeniture dictates how property is passed down in a family.",
            "sent3": "The siblings playfully argued about the fairness of primogeniture in their family.",
            "sent4": "Primogeniture can sometimes lead to family disputes over inheritance.",
            "sent5": "The tradition of primogeniture has shaped inheritance laws for centuries."
        },
        {
            "definition": "The right of the firstborn child to inherit the parent's property.",
            "pos": "noun",
            "sent1": "Primogeniture grants the eldest child the privilege of inheriting the family's assets.",
            "sent2": "In some cultures, primogeniture is a legal entitlement for the oldest child.",
            "sent3": "The parents explained to their children the concept of primogeniture and its significance.",
            "sent4": "The idea of primogeniture symbolizes the passing of responsibility from one generation to the next.",
            "sent5": "The eldest daughter understood the weight of primogeniture as she prepared to inherit the family estate."
        }
    ]
}