{
    "term": "primus",
    "meanings": [
        {
            "definition": "First in rank or importance",
            "pos": "adjective",
            "sent1": "Being the primus student in the class, she always got the highest grades.",
            "sent2": "The primus rule in our family is to always be kind to others.",
            "sent3": "The primus cake at the party was so delicious that everyone wanted a second slice.",
            "sent4": "Her primus position in the company made her a role model for others to follow.",
            "sent5": "The primus star in the sky shone the brightest, guiding us through the night."
        },
        {
            "definition": "The leader of a group",
            "pos": "noun",
            "sent1": "As the primus of the team, he made sure everyone worked together smoothly.",
            "sent2": "The lion was considered the primus of the pride, protecting them from danger.",
            "sent3": "The primus of the book club always picked the most interesting novels to read.",
            "sent4": "In the jungle, the primus of the monkeys was a wise old ape who kept them safe.",
            "sent5": "The primus of the orchestra directed the musicians with skill and passion."
        },
        {
            "definition": "A type of stove or burner",
            "pos": "noun",
            "sent1": "We used a primus to cook our meals while camping in the woods.",
            "sent2": "The scout brought a primus to the campsite to boil water for tea.",
            "sent3": "The primus in the kitchen sputtered and hissed as it heated up the soup.",
            "sent4": "The old primus in the cabin gave off a comforting warmth on cold nights.",
            "sent5": "The primus glowed red as it efficiently cooked the food for the hungry hikers."
        },
        {
            "definition": "A type of beer",
            "pos": "noun",
            "sent1": "At the pub, they served a delicious primus that was a favorite among patrons.",
            "sent2": "The brewery's special primus had a unique flavor that set it apart from other beers.",
            "sent3": "The primus at the party flowed freely, making everyone merry and relaxed.",
            "sent4": "After a long day's work, he enjoyed a cold primus to unwind and relax.",
            "sent5": "The primus had a rich aroma and a smooth taste that made it a popular choice among beer enthusiasts."
        }
    ]
}