{
    "term": "primary",
    "meanings": [
        {
            "definition": "First in order or time; earliest.",
            "pos": "adjective",
            "sent1": "The primary task is to wake up early.",
            "sent2": "The primary reason for the delay was traffic.",
            "sent3": "It was a primary joy to see the sunrise every morning.",
            "sent4": "Her smile was as bright as the primary light of dawn.",
            "sent5": "The primary moment of the day was when the birds started chirping."
        },
        {
            "definition": "Of chief importance; principal.",
            "pos": "adjective",
            "sent1": "Health is primary for a happy life.",
            "sent2": "Safety is a primary concern for parents.",
            "sent3": "The primary cake ingredient is love, of course!",
            "sent4": "Her primary goal was to spread kindness wherever she went.",
            "sent5": "The primary rule in our house is to always be kind to others."
        },
        {
            "definition": "Not derived from anything else; basic or fundamental.",
            "pos": "adjective",
            "sent1": "The primary colors are red, blue, and yellow.",
            "sent2": "The primary shapes are circle, square, and triangle.",
            "sent3": "His primary dance move was the simple two-step.",
            "sent4": "The primary building blocks of life are cells.",
            "sent5": "Learning the primary alphabet is the first step to reading."
        },
        {
            "definition": "Of or relating to primary school education.",
            "pos": "adjective",
            "sent1": "Primary teachers play a crucial role in children's development.",
            "sent2": "Primary education focuses on basic skills like reading and math.",
            "sent3": "The primary school bus driver always had a joke ready.",
            "sent4": "Her primary goal as a teacher was to inspire her students.",
            "sent5": "The primary classroom was filled with colorful posters and books."
        },
        {
            "definition": "A primary color.",
            "pos": "noun",
            "sent1": "Red is a primary in the color wheel.",
            "sent2": "Mixing blue and yellow creates a primary.",
            "sent3": "The primary on the flag symbolizes courage.",
            "sent4": "Her artwork used every primary to create a vibrant scene.",
            "sent5": "The artist's palette included all the primary colors for the masterpiece."
        }
    ]
}