{
    "term": "prints",
    "meanings": [
        {
            "definition": "A mark or impression made by a stamp, seal, or hand.",
            "pos": "noun",
            "sent1": "The teacher praised the neat prints of the student's handwriting.",
            "sent2": "The detective examined the prints left at the crime scene.",
            "sent3": "The playful puppy left tiny prints all over the freshly mopped floor.",
            "sent4": "Her unique style prints a lasting memory in everyone's mind.",
            "sent5": "The artist's prints on the canvas captured the essence of nature beautifully."
        },
        {
            "definition": "A design or picture produced by a printing process.",
            "pos": "noun",
            "sent1": "The art gallery displayed colorful prints of famous paintings.",
            "sent2": "She bought a print of the city skyline to hang in her living room.",
            "sent3": "The child proudly showed off his finger-paint prints to his parents.",
            "sent4": "The intricate prints on the fabric resembled a work of art.",
            "sent5": "The photographer's prints of the landscape were breathtakingly detailed."
        },
        {
            "definition": "To produce a copy of a document or image by pressing it onto a surface.",
            "pos": "verb",
            "sent1": "The office assistant prints multiple copies of the report for distribution.",
            "sent2": "He prints out the boarding pass before heading to the airport.",
            "sent3": "The mischievous student prints a funny message on the school printer.",
            "sent4": "His dedication to perfection prints a flawless image every time.",
            "sent5": "The machine prints the text with precision and clarity."
        },
        {
            "definition": "To leave a mark or impression on a surface.",
            "pos": "verb",
            "sent1": "The muddy shoes prints a trail across the clean floor.",
            "sent2": "The cat prints its paw on the wet paint of the fence.",
            "sent3": "The child giggles as he prints his hand on the foggy window.",
            "sent4": "Her kindness prints a warm feeling in everyone's heart.",
            "sent5": "The memory of their laughter prints joy in his mind forever."
        }
    ]
}