{
    "term": "principalities",
    "meanings": [
        {
            "definition": "A territory ruled by a prince.",
            "pos": "noun",
            "sent1": "In the fairy tale, the prince inherited many principalities from his father.",
            "sent2": "The prince's principalities were scattered across the kingdom.",
            "sent3": "The prince's principalities were so vast that he needed a map to keep track of them all.",
            "sent4": "The principalities under the prince's control were like pieces on a chessboard, each with its own strategic importance.",
            "sent5": "The principalities were like jewels in the crown of the prince's realm."
        },
        {
            "definition": "The rank or office of a prince.",
            "pos": "noun",
            "sent1": "The principalities gathered for the royal ceremony, each prince dressed in regal attire.",
            "sent2": "The principalities of the land convened to discuss matters of governance.",
            "sent3": "The principalities competed in a friendly joust to determine the most skilled prince.",
            "sent4": "The principalities vied for the favor of the king, each prince seeking to prove his worth.",
            "sent5": "The principalities stood united under the leadership of the wise prince."
        },
        {
            "definition": "The authority or jurisdiction of a prince.",
            "pos": "noun",
            "sent1": "The prince's principalities extended far and wide, his rule unquestioned.",
            "sent2": "The principalities of the prince were respected by neighboring kingdoms.",
            "sent3": "The prince's principalities enforced strict laws to maintain order in the realm.",
            "sent4": "The principalities granted the prince the power to make decisions that affected the entire kingdom.",
            "sent5": "The principalities symbolized the prince's control over his domain."
        }
    ]
}