{
    "term": "printable",
    "meanings": [
        {
            "definition": "Capable of being printed.",
            "pos": "adjective",
            "sent1": "The worksheet is printable, so you can easily make a copy.",
            "sent2": "The printable coloring pages are perfect for kids.",
            "sent3": "I found a printable recipe online, but it printed out in a funny font.",
            "sent4": "Her smile was like a printable picture, clear and easy to see.",
            "sent5": "The instructions were so clear, they were practically printable in my mind."
        },
        {
            "definition": "Suitable for printing.",
            "pos": "adjective",
            "sent1": "The paper quality is printable, making it great for flyers.",
            "sent2": "The printable invitations turned out beautifully.",
            "sent3": "He wore a printable shirt with a quirky design to the party.",
            "sent4": "Her words were like a printable message, easy to understand and share.",
            "sent5": "The map was so detailed, it was practically printable in its accuracy."
        },
        {
            "definition": "Able to be reproduced by printing.",
            "pos": "adjective",
            "sent1": "The logo is printable on various materials for branding.",
            "sent2": "The printable labels make organizing a breeze.",
            "sent3": "She had a printable copy of the contract ready for signing.",
            "sent4": "His memory was like a printable document, easily retrievable.",
            "sent5": "The information was so clear, it was practically printable in its clarity."
        },
        {
            "definition": "A document or image that can be printed.",
            "pos": "noun",
            "sent1": "I need a printable of the schedule for the meeting.",
            "sent2": "The teacher handed out printables for the class activity.",
            "sent3": "He always carries a few printables in his bag for reference.",
            "sent4": "The map was like a printable guide, leading us through the city.",
            "sent5": "The recipe was so easy to follow, it was practically a printable in itself."
        }
    ]
}