{
    "term": "prince",
    "meanings": [
        {
            "definition": "A male member of a royal family",
            "pos": "noun",
            "sent1": "The prince waved to the crowd from the palace balcony.",
            "sent2": "The prince inherited the throne after his father passed away.",
            "sent3": "The prince tried to ride a horse but fell off comically.",
            "sent4": "The prince's kindness shone like a beacon in the kingdom.",
            "sent5": "The prince's golden crown sparkled in the sunlight."
        },
        {
            "definition": "A ruler or monarch",
            "pos": "noun",
            "sent1": "The prince governed the land with wisdom and fairness.",
            "sent2": "The prince's decree was law throughout the kingdom.",
            "sent3": "The prince's royal robe got caught on a tree branch and tore.",
            "sent4": "The prince's authority was as solid as the castle walls.",
            "sent5": "The prince's scepter symbolized his power and rule."
        },
        {
            "definition": "A nobleman of high rank",
            "pos": "noun",
            "sent1": "The prince wore elegant attire befitting his noble status.",
            "sent2": "The prince attended the grand ball at the palace.",
            "sent3": "The prince's loyal dog followed him everywhere, even to the throne room.",
            "sent4": "The prince's manners were as refined as the finest silverware.",
            "sent5": "The prince's portrait hung in the gallery among other noble figures."
        },
        {
            "definition": "A person of high status or importance",
            "pos": "noun",
            "sent1": "The prince was a respected figure in the community.",
            "sent2": "The prince's arrival at the event caused a stir among the guests.",
            "sent3": "The prince's favorite dessert was a simple apple pie.",
            "sent4": "The prince's influence reached far beyond the kingdom's borders.",
            "sent5": "The prince's generosity knew no bounds, helping all in need."
        }
    ]
}