{
    "term": "prismatoid",
    "meanings": [
        {
            "definition": "A solid figure with parallel ends and all other faces parallelograms.",
            "pos": "noun",
            "sent1": "The prismatoid on the table had a rectangular base and slanted sides.",
            "sent2": "The architect designed a prismatoid building with a triangular top and a square base.",
            "sent3": "The prismatoid rolled off the shelf and landed on its side, looking like a tilted box.",
            "sent4": "Her mind was a prismatoid of thoughts, each side representing a different idea.",
            "sent5": "The prismatoid shape of the crystal made it refract light in beautiful patterns."
        },
        {
            "definition": "A geometric figure with parallel sides and a polygonal base.",
            "pos": "noun",
            "sent1": "The prismatoid in the math book had a hexagonal base and straight sides.",
            "sent2": "The jewelry box was a prismatoid, with a square base and four rectangular sides.",
            "sent3": "The prismatoid cookie cutter made cookies in the shape of parallelograms.",
            "sent4": "His yard was a prismatoid of different flower beds, each with a unique polygonal shape.",
            "sent5": "The prismatoid pattern on the rug added a modern touch to the room."
        },
        {
            "definition": "A three-dimensional figure with parallel polygonal bases and lateral faces that are parallelograms.",
            "pos": "noun",
            "sent1": "The prismatoid model in the classroom had a triangular base and slanted sides.",
            "sent2": "The prismatoid tent was easy to set up, with its rectangular base and sloping sides.",
            "sent3": "The prismatoid cake looked like a delicious stack of parallelogram layers.",
            "sent4": "Her bookshelf was a prismatoid of books, neatly arranged in parallel rows.",
            "sent5": "The prismatoid structure of the building made it stand out among the rest."
        }
    ]
}