{
    "term": "prizefightings",
    "meanings": [
        {
            "definition": "The act of engaging in a physical fight for a reward or prize.",
            "pos": "noun",
            "sent1": "In the old days, prizefightings were common among knights for honor.",
            "sent2": "The town hosted prizefightings every summer to entertain the locals.",
            "sent3": "The prizefightings at the fair were so intense, even the chickens were watching!",
            "sent4": "Her determination in the prizefightings was like a lion defending its territory.",
            "sent5": "The sound of the bell marked the beginning of the prizefightings, echoing through the arena."
        },
        {
            "definition": "The sport or activity of participating in organized fighting matches for a monetary reward.",
            "pos": "noun",
            "sent1": "Fans eagerly awaited the prizefightings to see who would emerge victorious.",
            "sent2": "He trained hard to excel in the world of prizefightings and earn his living.",
            "sent3": "The prizefightings were so popular that even the mayor wanted a front-row seat.",
            "sent4": "Her dedication to the prizefightings was like a marathon runner pushing through the pain.",
            "sent5": "The atmosphere in the arena crackled with excitement during the prizefightings."
        },
        {
            "definition": "The practice of competing in boxing matches for a championship title or monetary prize.",
            "pos": "noun",
            "sent1": "His dream was to win the championship in the world of prizefightings.",
            "sent2": "The gym was filled with aspiring boxers training for their prizefightings.",
            "sent3": "The prizefightings were so intense that even the referees were sweating.",
            "sent4": "Her strategy in the prizefightings was like a chess player planning their moves.",
            "sent5": "The crowd erupted in cheers as the champion entered the ring for the prizefightings."
        }
    ]
}