{
    "term": "pro",
    "meanings": [
        {
            "definition": "In favor of something; supporting or approving",
            "pos": "adjective",
            "sent1": "She is a pro supporter of the new policy.",
            "sent2": "Being pro the idea, he actively campaigned for it.",
            "sent3": "The pro team cheered loudly for their favorite player.",
            "sent4": "Her pro stance on the issue was unwavering.",
            "sent5": "The pro attitude towards change was refreshing."
        },
        {
            "definition": "A professional, especially in sports or entertainment",
            "pos": "noun",
            "sent1": "The basketball pro scored the winning shot.",
            "sent2": "She aspired to be a pro in the music industry.",
            "sent3": "The comedy pro had the audience in stitches.",
            "sent4": "He was a pro at handling high-pressure situations.",
            "sent5": "The pro's performance left the crowd in awe."
        },
        {
            "definition": "An advantage or benefit",
            "pos": "noun",
            "sent1": "One pro of living in the city is easy access to amenities.",
            "sent2": "The pro of studying early is better retention of information.",
            "sent3": "The unexpected discount was a nice pro of shopping there.",
            "sent4": "Having a supportive team is a major pro in this job.",
            "sent5": "The pro of exercise is improved overall health."
        },
        {
            "definition": "To be in favor of something; to support or approve",
            "pos": "verb",
            "sent1": "She will pro the new initiative at the meeting.",
            "sent2": "He proed the idea wholeheartedly during the discussion.",
            "sent3": "They decided to pro the charity event with enthusiasm.",
            "sent4": "The community came together to pro the local business.",
            "sent5": "The group agreed to pro the plan for a better future."
        }
    ]
}