{
    "term": "probes",
    "meanings": [
        {
            "definition": "A long, slender surgical instrument used for exploring wounds or body cavities.",
            "pos": "noun",
            "sent1": "The doctor used probes to check inside the patient's body.",
            "sent2": "The probes in the medical kit helped the surgeon during the operation.",
            "sent3": "The probes looked like tiny wands exploring the mysteries of the human body.",
            "sent4": "Her curiosity was a probe, delving into the secrets hidden within.",
            "sent5": "The probes illuminated the dark corners of the patient's body, revealing the source of pain."
        },
        {
            "definition": "An investigation into unfamiliar or questionable activities.",
            "pos": "noun",
            "sent1": "The detectives conducted probes to uncover the truth behind the crime.",
            "sent2": "The government launched probes to understand the strange occurrences in the area.",
            "sent3": "The probes into the missing cookies led to a surprising discovery in the kitchen.",
            "sent4": "Her questions were like probes, seeking out the hidden answers in the situation.",
            "sent5": "The probes of the investigators shed light on the mysterious events that took place."
        },
        {
            "definition": "To physically explore or examine with a probe.",
            "pos": "verb",
            "sent1": "She carefully probes the soil to find buried treasure.",
            "sent2": "The scientist probes the rock formations to understand their composition.",
            "sent3": "He probes the cake with a fork to check if it's baked perfectly.",
            "sent4": "The detective probes the crime scene for any overlooked clues.",
            "sent5": "The explorer probes the depths of the cave, searching for ancient artifacts."
        },
        {
            "definition": "To investigate or examine thoroughly.",
            "pos": "verb",
            "sent1": "The journalist probes the corruption scandal to uncover the truth.",
            "sent2": "The researcher probes the data to find patterns and trends.",
            "sent3": "She probes her memory to recall where she left her keys.",
            "sent4": "The teacher probes the students' understanding by asking thought-provoking questions.",
            "sent5": "The scientist probes the mysteries of the universe, seeking answers to age-old questions."
        }
    ]
}