{
    "term": "proboscides",
    "meanings": [
        {
            "definition": "A long, flexible snout or trunk, especially of an elephant.",
            "pos": "noun",
            "sent1": "The elephant used its proboscides to reach for leaves high up in the trees.",
            "sent2": "The proboscides of the elephant are strong and versatile, helping it to gather food.",
            "sent3": "The elephant's proboscides made it look like it had an extra arm, which amused the children at the zoo.",
            "sent4": "Her proboscides of curiosity led her to explore every corner of the library.",
            "sent5": "The proboscides of the elephant swung gracefully as it walked, leaving a lasting impression on the spectators."
        },
        {
            "definition": "A tubular organ used for feeding or sucking in certain invertebrates.",
            "pos": "noun",
            "sent1": "The tiny insect extended its proboscides to sip nectar from the flower.",
            "sent2": "The proboscides of the butterfly are perfectly adapted for extracting nectar from flowers.",
            "sent3": "The mosquito's proboscides were like tiny straws, allowing it to enjoy a drink of blood.",
            "sent4": "Her proboscides of hunger led her to the buffet table at the party.",
            "sent5": "The proboscides of the butterfly delicately touched the petals as it fed, showcasing its beauty."
        },
        {
            "definition": "A long, protruding nose or snout.",
            "pos": "noun",
            "sent1": "The anteater's proboscides helped it sniff out ants hidden beneath the ground.",
            "sent2": "The proboscides of the tapir twitched as it searched for food in the forest.",
            "sent3": "His proboscides for gossip always seemed to lead him to the juiciest stories.",
            "sent4": "The detective's proboscides for clues never failed to solve the mystery.",
            "sent5": "The proboscides of the anteater wiggled excitedly when it detected the scent of its favorite food."
        }
    ]
}