{
    "term": "probity",
    "meanings": [
        {
            "definition": "The quality of having strong moral principles; honesty and decency.",
            "pos": "noun",
            "sent1": "Her probity shone through when she returned the lost wallet with all the money inside.",
            "sent2": "The community admired his probity as he always stood up for what was right.",
            "sent3": "Even in a game of make-believe, her probity never wavered as she played the role of the noble knight.",
            "sent4": "His probity was a lighthouse in the stormy sea of corruption, guiding others towards honesty.",
            "sent5": "The probity of the old librarian was like a beacon of light, illuminating the path of righteousness for all."
        },
        {
            "definition": "A person who demonstrates honesty and integrity in their actions.",
            "pos": "noun",
            "sent1": "As a probity, he was trusted by all to handle important matters with fairness.",
            "sent2": "The probity of the judge was unquestionable, earning respect from everyone in the courtroom.",
            "sent3": "The mischievous child tried to imitate the probity of the wise elder, but often ended up in funny situations.",
            "sent4": "She was a probity in a world of deceit, a shining example of truthfulness and honor.",
            "sent5": "In the land of make-believe, the probity was always the hero, saving the day with honesty and integrity."
        },
        {
            "definition": "The state of being truthful and upright in character.",
            "pos": "noun",
            "sent1": "His probity was evident in every word he spoke, never uttering a falsehood.",
            "sent2": "The probity of her actions spoke louder than any words, earning her the trust of all around.",
            "sent3": "Even the mischievous cat seemed to admire the probity of the loyal dog next door.",
            "sent4": "In a world of shadows, his probity was a ray of light, cutting through the darkness of deceit.",
            "sent5": "The probity of the young hero was his greatest weapon, shining brighter than any sword or shield."
        }
    ]
}