{
    "term": "procedure",
    "meanings": [
        {
            "definition": "A series of actions conducted in a certain order.",
            "pos": "noun",
            "sent1": "Following the procedure for baking a cake ensures it turns out delicious.",
            "sent2": "In school, we learn the procedure for solving math problems step by step.",
            "sent3": "The robot tried to follow the baking procedure but ended up making a mess in the kitchen.",
            "sent4": "Her daily routine had become a well-oiled procedure, like clockwork.",
            "sent5": "The procedure for assembling the furniture was so clear that even a child could do it."
        },
        {
            "definition": "The established way of doing something.",
            "pos": "noun",
            "sent1": "It is important to follow the safety procedure when using the laboratory equipment.",
            "sent2": "The company has a strict procedure for handling customer complaints.",
            "sent3": "The cat seemed to have its own procedure for catching mice, always hiding behind the bushes.",
            "sent4": "His morning coffee ritual was a comforting procedure that set the tone for the day.",
            "sent5": "The traditional tea ceremony was a beautiful and intricate procedure to observe."
        },
        {
            "definition": "A medical or surgical operation.",
            "pos": "noun",
            "sent1": "The doctor explained the procedure before the surgery to calm the patient's nerves.",
            "sent2": "The emergency room was busy with medical procedures being performed on injured patients.",
            "sent3": "The clumsy nurse accidentally mixed up the procedure for taking blood samples with urine samples.",
            "sent4": "The delicate procedure required steady hands and focused attention from the surgeon.",
            "sent5": "The groundbreaking procedure revolutionized the way heart surgeries were conducted."
        }
    ]
}