{
    "term": "procuratorial",
    "meanings": [
        {
            "definition": "Relating to the office or duties of a procurator.",
            "pos": "adjective",
            "sent1": "The procuratorial role involves managing legal matters for an organization.",
            "sent2": "Her procuratorial responsibilities include overseeing legal affairs within the company.",
            "sent3": "The procuratorial tasks kept him busy with legal paperwork all day.",
            "sent4": "In the procuratorial realm, she was the go-to person for legal advice.",
            "sent5": "The procuratorial duties required attention to detail and knowledge of legal procedures."
        },
        {
            "definition": "Of or relating to the act of procuring or obtaining something.",
            "pos": "adjective",
            "sent1": "His procuratorial skills helped secure the necessary supplies for the project.",
            "sent2": "The team's procuratorial efforts resulted in acquiring the needed resources on time.",
            "sent3": "She had a knack for making procuratorial deals that saved the company money.",
            "sent4": "The procuratorial negotiations led to a successful partnership with the supplier.",
            "sent5": "Procuratorial strategies were essential in obtaining the required permits for construction."
        },
        {
            "definition": "Involving the legal representation of a government agency in court.",
            "pos": "adjective",
            "sent1": "The procuratorial team defended the government agency in the high-profile case.",
            "sent2": "His expertise in procuratorial matters made him a valuable asset to the legal team.",
            "sent3": "The procuratorial proceedings were intense but necessary for justice.",
            "sent4": "She handled the procuratorial aspects of the case with professionalism and dedication.",
            "sent5": "Procuratorial advocacy ensured the government's interests were protected in court."
        }
    ]
}