{
    "term": "productive",
    "meanings": [
        {
            "definition": "Producing or able to produce large amounts of goods, crops, or other commodities.",
            "pos": "adjective",
            "sent1": "The farmer's productive fields yielded a bountiful harvest.",
            "sent2": "The factory workers were very productive, making many toys each day.",
            "sent3": "The busy bees were so productive that they had honey to spare for the lazy ants.",
            "sent4": "Her mind was a productive garden, blooming with creative ideas.",
            "sent5": "The sun's rays were like productive hands, nurturing the plants to grow tall and strong."
        },
        {
            "definition": "Achieving or producing a significant amount or result.",
            "pos": "adjective",
            "sent1": "The students had a productive study session and aced their exam.",
            "sent2": "The team's brainstorming session was very productive, leading to innovative ideas.",
            "sent3": "The squirrel was so productive in gathering nuts that it had a stockpile for winter.",
            "sent4": "Her voice was a productive tool, captivating the audience with its melodious tone.",
            "sent5": "The clock's ticking was a productive reminder of time passing by swiftly."
        },
        {
            "definition": "Effective in yielding results, benefits, or profits.",
            "pos": "adjective",
            "sent1": "The new marketing strategy proved to be very productive, increasing sales significantly.",
            "sent2": "Regular exercise is productive for maintaining good health and fitness.",
            "sent3": "The magician's hat was so productive that it kept pulling out endless scarves.",
            "sent4": "Her smile was a productive charm, bringing joy to everyone around her.",
            "sent5": "The river's flow was like a productive force, carving through the rocks over time."
        }
    ]
}