{
    "term": "prodigal",
    "meanings": [
        {
            "definition": "Wastefully extravagant",
            "pos": "adjective",
            "sent1": "The prodigal prince bought a golden carriage for his cat.",
            "sent2": "She regretted her prodigal spending spree when she saw her empty bank account.",
            "sent3": "The prodigal squirrel buried more acorns than it could ever eat.",
            "sent4": "Her laughter was a prodigal display of joy, filling the room with warmth.",
            "sent5": "The prodigal use of glitter on the costume made it sparkle like a thousand stars."
        },
        {
            "definition": "One who spends money recklessly",
            "pos": "noun",
            "sent1": "The prodigal at the casino lost all his savings in one night.",
            "sent2": "Becoming a prodigal can lead to financial ruin if not controlled.",
            "sent3": "The prodigal shopper bought ten pairs of shoes in one hour.",
            "sent4": "He was known as the prodigal of the family, always splurging on unnecessary items.",
            "sent5": "The prodigal's wallet was always empty from impulsive purchases."
        },
        {
            "definition": "Lavish or extravagant in spending",
            "pos": "adjective",
            "sent1": "The prodigal wedding had a five-tiered cake and fireworks.",
            "sent2": "She admired the prodigal decorations at the luxurious party.",
            "sent3": "The prodigal use of jewels on the dress made it shine like a rainbow.",
            "sent4": "His prodigal generosity knew no bounds, always giving more than expected.",
            "sent5": "The prodigal feast left everyone in awe of the host's opulence."
        },
        {
            "definition": "Abundant or profuse in growth or quantity",
            "pos": "adjective",
            "sent1": "The prodigal garden was filled with colorful flowers and lush greenery.",
            "sent2": "The prodigal harvest this year yielded an abundance of fruits and vegetables.",
            "sent3": "The prodigal rain poured down, flooding the streets with water.",
            "sent4": "The prodigal forest stretched as far as the eye could see, teeming with life.",
            "sent5": "The prodigal stars in the night sky twinkled brightly, a sight to behold."
        }
    ]
}