{
    "term": "profile",
    "meanings": [
        {
            "definition": "An outline of an object, person, or building as seen from one side.",
            "pos": "noun",
            "sent1": "I drew a profile of the tree, showing its shape from the side.",
            "sent2": "The artist sketched a profile of the woman's face in great detail.",
            "sent3": "The detective examined the profile of the suspect, trying to match it with the witness's description.",
            "sent4": "The profile of the mountain against the sunset looked like a giant silhouette.",
            "sent5": "She recognized him by the profile of his distinctive hat."
        },
        {
            "definition": "A short description of someone's life, character, or achievements.",
            "pos": "noun",
            "sent1": "The online dating site asked for a profile that highlighted her interests and hobbies.",
            "sent2": "The author's profile in the magazine revealed his early struggles and eventual success.",
            "sent3": "His profile on social media made him seem like a superhero with all his accomplishments.",
            "sent4": "The profile of the famous actress painted a picture of a humble and hardworking individual.",
            "sent5": "The teacher asked the students to write a profile of their favorite historical figure."
        },
        {
            "definition": "A set of characteristics or qualities that identify a type or category.",
            "pos": "noun",
            "sent1": "The company's target market profile includes young professionals who value sustainability.",
            "sent2": "The customer feedback helped create a profile of the ideal product user.",
            "sent3": "The profile of a successful entrepreneur often includes traits like resilience and innovation.",
            "sent4": "The profile of a good leader should encompass qualities like empathy and decisiveness.",
            "sent5": "The detective built a profile of the criminal based on the evidence collected at the scene."
        }
    ]
}