{
    "term": "prog",
    "meanings": [
        {
            "definition": "To continue or carry on with an activity or process",
            "pos": "verb",
            "sent1": "She will prog with her painting after dinner.",
            "sent2": "He likes to prog with his daily exercise routine.",
            "sent3": "The ants decided to prog with their march, even in the rain.",
            "sent4": "Time seemed to prog slowly as they waited for the results.",
            "sent5": "The river progged steadily towards the sea, never stopping."
        },
        {
            "definition": "A person who supports or advocates for a cause or policy",
            "pos": "noun",
            "sent1": "She is a dedicated prog for animal rights.",
            "sent2": "The community came together to support the local progs.",
            "sent3": "The little girl dressed up as a prog for Halloween.",
            "sent4": "He was a silent but effective prog for change in the company.",
            "sent5": "The progs gathered outside the courthouse to protest peacefully."
        },
        {
            "definition": "A television program or series",
            "pos": "noun",
            "sent1": "They watched their favorite prog every evening.",
            "sent2": "The new sci-fi prog has gained a lot of viewers.",
            "sent3": "The comedy prog made everyone laugh out loud.",
            "sent4": "The reality prog was more dramatic than they expected.",
            "sent5": "The historical prog taught them about ancient civilizations."
        },
        {
            "definition": "To train or teach someone in a particular skill or subject",
            "pos": "verb",
            "sent1": "He will prog the new employees on company policies.",
            "sent2": "She enjoys proging young children in reading and writing.",
            "sent3": "The coach decided to prog the team on advanced techniques.",
            "sent4": "The professor will prog the students on the basics of chemistry.",
            "sent5": "The mentor progged her protege in the art of negotiation."
        }
    ]
}