{
    "term": "programme",
    "meanings": [
        {
            "definition": "A planned series of events or performances.",
            "pos": "noun",
            "sent1": "The school's talent show programme featured singing, dancing, and comedy acts.",
            "sent2": "The theatre programme listed all the upcoming plays and musicals.",
            "sent3": "The programme for the birthday party included games, cake, and a magic show.",
            "sent4": "Her daily routine had become a programme of waking up, going to work, and watching TV.",
            "sent5": "The summer camp programme was filled with exciting outdoor activities like hiking and swimming."
        },
        {
            "definition": "A set of instructions for a computer to follow.",
            "pos": "noun",
            "sent1": "The software engineer wrote a programme to automate the data analysis process.",
            "sent2": "The coding bootcamp taught students how to create programmes using different programming languages.",
            "sent3": "The computer programme kept crashing due to a bug in the code.",
            "sent4": "His mind was like a complex programme, processing information at lightning speed.",
            "sent5": "Learning to code involves understanding how to write programmes that computers can execute."
        },
        {
            "definition": "A broadcasted television or radio show.",
            "pos": "noun",
            "sent1": "The popular cooking programme featured celebrity chefs competing in challenges.",
            "sent2": "Every evening, she tuned in to watch her favorite talk show programme.",
            "sent3": "The radio programme about mysteries always kept listeners on the edge of their seats.",
            "sent4": "Her life felt like a reality TV programme with all its ups and downs.",
            "sent5": "The children's educational programme taught valuable lessons through fun animations."
        }
    ]
}