{
    "term": "prohibitory",
    "meanings": [
        {
            "definition": "Prohibiting or forbidding something",
            "pos": "adjective",
            "sent1": "The teacher's prohibitory rules prevented students from using their phones in class.",
            "sent2": "The sign had a prohibitory message, warning people not to enter the restricted area.",
            "sent3": "The cat's prohibitory glare kept the mischievous kitten away from its favorite toy.",
            "sent4": "The storm clouds cast a prohibitory shadow over the picnic, signaling rain was imminent.",
            "sent5": "The security guard's prohibitory stance indicated that no one was allowed past the gate."
        },
        {
            "definition": "Serving to prohibit or forbid",
            "pos": "adjective",
            "sent1": "The new law had a prohibitory effect on smoking in public places.",
            "sent2": "The prohibitory measures put in place aimed to maintain order and safety.",
            "sent3": "The prohibitory sign on the door made the curious child wonder what was behind it.",
            "sent4": "The prohibitory barrier blocked access to the construction site for safety reasons.",
            "sent5": "The prohibitory tone in the announcement made it clear that certain behaviors were not allowed."
        },
        {
            "definition": "Involving or relating to prohibition",
            "pos": "adjective",
            "sent1": "The history lesson discussed the prohibitory laws during the Prohibition era.",
            "sent2": "The documentary highlighted the prohibitory measures taken to combat illegal activities.",
            "sent3": "The prohibitory theme of the party was evident from the 'No Entry' signs everywhere.",
            "sent4": "The prohibitory nature of the contract restricted the company from disclosing sensitive information.",
            "sent5": "The prohibitory atmosphere at the event discouraged rowdy behavior among attendees."
        }
    ]
}