{
    "term": "proof",
    "meanings": [
        {
            "definition": "Evidence or argument establishing a fact or the truth of a statement.",
            "pos": "noun",
            "sent1": "The fingerprints found at the crime scene were clear proof of the suspect's presence.",
            "sent2": "The DNA test provided undeniable proof of the biological relationship between the siblings.",
            "sent3": "The detective chuckled, saying, 'Well, that's the proof we needed to crack the case!'",
            "sent4": "Her success in the competition was living proof of her dedication and hard work.",
            "sent5": "The old photograph served as a poignant proof of their long-lasting friendship."
        },
        {
            "definition": "A trial print of a page, taken from type or film and used for making corrections before final printing.",
            "pos": "noun",
            "sent1": "The author carefully examined the proof of the book before giving the final approval for printing.",
            "sent2": "The proof revealed a few typos that needed to be corrected before mass production.",
            "sent3": "The printer joked, 'I wish all proofs were as error-free as this one!'",
            "sent4": "The proof showed a slight misalignment that needed adjustment before the final print.",
            "sent5": "The graphic designer always double-checks the proofs to ensure perfection in the final product."
        },
        {
            "definition": "A measure of the strength of an alcoholic drink.",
            "pos": "noun",
            "sent1": "The bartender explained that the alcohol proof of the whiskey was 80, indicating its potency.",
            "sent2": "The label on the bottle displayed the proof of the vodka, revealing its high alcohol content.",
            "sent3": "At the party, he jokingly said, 'Let's see who can handle a drink with the highest proof!'",
            "sent4": "The cocktail's low proof made it a popular choice among those looking for a milder option.",
            "sent5": "She preferred beverages with lower proof to enjoy the flavors without the strong alcohol taste."
        }
    ]
}