{
    "term": "proportional",
    "meanings": [
        {
            "definition": "Corresponding in size, amount, or degree",
            "pos": "adjective",
            "sent1": "The amount of sugar in the recipe is proportional to the sweetness of the dessert.",
            "sent2": "Her height is proportional to her age, as she grows taller each year.",
            "sent3": "The clown's shoes were so big that they looked proportional to his tiny car.",
            "sent4": "The student's effort was proportional to the improvement in his grades.",
            "sent5": "The number of guests at the party was directly proportional to the amount of food prepared."
        },
        {
            "definition": "Having a constant ratio or relation",
            "pos": "adjective",
            "sent1": "The gears in the machine move at a proportional speed to each other.",
            "sent2": "The ingredients in the mixture must be in a proportional ratio for the cake to rise properly.",
            "sent3": "The siblings' heights were so proportional that they often confused strangers.",
            "sent4": "The teacher explained that the sides of a square are always proportional to each other.",
            "sent5": "The artist ensured that the colors used in the painting were proportional to create balance."
        },
        {
            "definition": "Distributing or allocating in proportion to something else",
            "pos": "verb",
            "sent1": "The charity organization is proportional in distributing resources to those in need.",
            "sent2": "The teacher will proportional the candies among the students for the game.",
            "sent3": "The chef decided to proportional the spices based on the size of the dish.",
            "sent4": "The manager will proportional the budget according to the sales of each department.",
            "sent5": "The coach will proportional the playing time based on the players' performance in practice."
        }
    ]
}