{
    "term": "proprium",
    "meanings": [
        {
            "definition": "A characteristic or quality that is specific to a particular person or thing.",
            "pos": "noun",
            "sent1": "Her kindness is her proprium, always putting others before herself.",
            "sent2": "The bright red color of the cardinal is its proprium, making it easily recognizable.",
            "sent3": "His love for spicy food is his proprium, even though he can't handle the heat.",
            "sent4": "The melody's haunting beauty was its proprium, lingering in the listener's mind long after it ended.",
            "sent5": "The mountain's towering height was its proprium, dominating the landscape."
        },
        {
            "definition": "A sense of ownership or possession.",
            "pos": "noun",
            "sent1": "The old house gave her a strong proprium, feeling like it belonged to her.",
            "sent2": "He felt a deep proprium over the antique watch, passed down through generations.",
            "sent3": "The cat's proprium over the sunny spot on the windowsill was undisputed by the other pets.",
            "sent4": "The artist's proprium of the masterpiece was evident in the way he carefully protected it.",
            "sent5": "The farmer's proprium of the land was reflected in the way he tended to every crop with care."
        },
        {
            "definition": "A term used in psychology to refer to a person's sense of self.",
            "pos": "noun",
            "sent1": "Her proprium was shaken after the criticism, causing her to doubt her abilities.",
            "sent2": "He worked on building a strong proprium through self-reflection and personal growth.",
            "sent3": "The comedian's proprium was evident in his ability to laugh at himself on stage.",
            "sent4": "The athlete's proprium was unbreakable, driving her to push past her limits in every competition.",
            "sent5": "The child's proprium blossomed as she discovered her unique talents and interests."
        }
    ]
}