{
    "term": "proprietorial",
    "meanings": [
        {
            "definition": "Of or relating to ownership or control",
            "pos": "adjective",
            "sent1": "Her proprietorial attitude towards her belongings was evident in the way she labeled everything with her name.",
            "sent2": "The company's proprietorial rights over the software prevented others from using it without permission.",
            "sent3": "The cat's proprietorial behavior towards its favorite toy made everyone laugh.",
            "sent4": "The old house had a proprietorial air, as if it held secrets from centuries past.",
            "sent5": "The farmer's proprietorial pride in his land was clear from the meticulous care he took of every plant."
        },
        {
            "definition": "Showing ownership or possessiveness",
            "pos": "adjective",
            "sent1": "His proprietorial grip on the steering wheel made his passengers nervous.",
            "sent2": "The dog's proprietorial growl warned others to stay away from its food bowl.",
            "sent3": "The toddler's proprietorial claim on the teddy bear led to a playful tug-of-war.",
            "sent4": "The artist's proprietorial gaze over his latest masterpiece hinted at his attachment to it.",
            "sent5": "The queen's proprietorial stance over the throne symbolized her authority and possession of power."
        },
        {
            "definition": "Acting as an owner or proprietor",
            "pos": "adjective",
            "sent1": "The proprietorial duties of the shopkeeper included managing inventory and handling customer complaints.",
            "sent2": "The CEO's proprietorial decisions shaped the direction of the company's future.",
            "sent3": "The robot's proprietorial control over the factory ensured efficient production.",
            "sent4": "The landlord's proprietorial demeanor made tenants feel secure in their rented space.",
            "sent5": "The teacher's proprietorial pride in her classroom was reflected in the colorful displays and organized desks."
        }
    ]
}