{
    "term": "proposals",
    "meanings": [
        {
            "definition": "A plan or suggestion put forward for consideration or discussion.",
            "pos": "noun",
            "sent1": "The team presented their proposals for the new project during the meeting.",
            "sent2": "She carefully reviewed all the proposals before making a decision.",
            "sent3": "The proposals for a surprise party were almost ruined when the guest of honor walked in early.",
            "sent4": "His proposals were like seeds planted in the minds of his colleagues, waiting to grow into great ideas.",
            "sent5": "The colorful visual aids made the proposals stand out and capture everyone's attention."
        },
        {
            "definition": "The act of making a proposal.",
            "pos": "noun",
            "sent1": "Her proposals were always well thought out and presented with confidence.",
            "sent2": "The proposals for the new policy were discussed at length in the board meeting.",
            "sent3": "The proposals for a new playground design sparked a friendly competition among the architects.",
            "sent4": "His proposals were like arrows hitting the target, precise and effective.",
            "sent5": "The proposals were like puzzle pieces fitting perfectly together to form a complete picture."
        },
        {
            "definition": "An offer of marriage.",
            "pos": "noun",
            "sent1": "He nervously rehearsed his proposals before finally asking her to marry him.",
            "sent2": "The romantic proposals under the starry sky left her speechless.",
            "sent3": "His proposals were so elaborate that she couldn't help but say yes.",
            "sent4": "The proposals of love bloomed like flowers in the garden of their relationship.",
            "sent5": "The heartfelt proposals echoed in her mind, filling her with joy and excitement."
        }
    ]
}