{
    "term": "proper",
    "meanings": [
        {
            "definition": "Suitable or appropriate in the circumstances",
            "pos": "adjective",
            "sent1": "Wearing a proper outfit to a wedding is important.",
            "sent2": "It is proper to say 'thank you' when someone helps you.",
            "sent3": "He thought it would be proper to wear a superhero costume to the job interview.",
            "sent4": "Her smile was the proper response to his joke, genuine and warm.",
            "sent5": "The proper way to address a king is with respect and humility."
        },
        {
            "definition": "Strictly following rules or conventions",
            "pos": "adjective",
            "sent1": "Following proper etiquette at the dinner table is essential.",
            "sent2": "It is not proper to talk loudly in a library.",
            "sent3": "She always made sure to follow the proper steps when baking a cake.",
            "sent4": "The dancer's movements were so proper, as if each step was carefully measured.",
            "sent5": "The proper way to greet someone is with a smile and a handshake."
        },
        {
            "definition": "Real; genuine",
            "pos": "adjective",
            "sent1": "The painting was a proper masterpiece, admired by all who saw it.",
            "sent2": "Her proper concern for others made her a beloved friend.",
            "sent3": "He told a proper funny joke that had everyone laughing.",
            "sent4": "The proper love between the couple was evident in every glance they shared.",
            "sent5": "The proper joy in her eyes was unmistakable as she opened the gift."
        },
        {
            "definition": "In a satisfactory or correct manner",
            "pos": "adverb",
            "sent1": "She completed the task properly and received praise for her work.",
            "sent2": "It is important to speak properly in a formal setting.",
            "sent3": "He danced around the room properly, making everyone smile.",
            "sent4": "The gears in the clock turned properly, keeping perfect time.",
            "sent5": "The puzzle was solved properly, with each piece fitting perfectly."
        }
    ]
}