{
    "term": "prop",
    "meanings": [
        {
            "definition": "A support or brace used to hold something in position.",
            "pos": "noun",
            "sent1": "The prop kept the shelf from falling.",
            "sent2": "The actor leaned on the prop during the play.",
            "sent3": "The prop wobbled comically as the actor tried to balance on it.",
            "sent4": "Her smile was like a prop, holding up her confidence.",
            "sent5": "The prop, a sturdy wooden beam, stood tall against the wall."
        },
        {
            "definition": "An object used on a stage or set to enhance a performance.",
            "pos": "noun",
            "sent1": "The colorful prop added a festive touch to the play.",
            "sent2": "The prop gun looked realistic under the stage lights.",
            "sent3": "The prop flower sprayed water unexpectedly, causing laughter.",
            "sent4": "His words were like a prop, setting the scene for their conversation.",
            "sent5": "The prop, a sparkling crystal ball, captured the audience's attention."
        },
        {
            "definition": "To support or keep in position with a prop.",
            "pos": "verb",
            "sent1": "He had to prop the ladder against the wall to reach the top shelf.",
            "sent2": "She propped the door open with a rock.",
            "sent3": "The wind threatened to close the window, so she quickly propped it open.",
            "sent4": "His determination propped him up through the tough times.",
            "sent5": "The idea of success propped him up like a strong pillar."
        },
        {
            "definition": "To support or sustain.",
            "pos": "verb",
            "sent1": "She propped up her friend when they felt down.",
            "sent2": "The tree branches propped up the heavy snow during the storm.",
            "sent3": "His enthusiasm propped up the team's spirits during the game.",
            "sent4": "Hope propped her up like a gentle hand on her shoulder.",
            "sent5": "The memories of laughter propped him up in times of sadness."
        }
    ]
}