{
    "term": "prophethoods",
    "meanings": [
        {
            "definition": "The state, office, or character of a prophet.",
            "pos": "noun",
            "sent1": "In the ancient tales, the prophethoods were revered and respected by all.",
            "sent2": "The prophethoods of old often guided their people with wisdom and foresight.",
            "sent3": "The town's children loved to play pretend prophethoods, wearing makeshift robes and speaking in mysterious tones.",
            "sent4": "Her kindness and compassion gave her an aura of prophethoods, as if she could foresee the needs of others.",
            "sent5": "The prophethoods of the past left behind a legacy of hope and enlightenment for future generations."
        },
        {
            "definition": "The collective body of prophets.",
            "pos": "noun",
            "sent1": "Legends speak of the prophethoods gathering to discuss the fate of the world.",
            "sent2": "Throughout history, the prophethoods have been instrumental in shaping the course of events.",
            "sent3": "The prophethoods held a grand feast to celebrate their successful predictions, laughing and sharing stories late into the night.",
            "sent4": "The prophethoods stood united, a beacon of light in a world filled with darkness and uncertainty.",
            "sent5": "The prophethoods stood shoulder to shoulder, a formidable force against the tides of chaos."
        },
        {
            "definition": "The teachings or predictions of prophets.",
            "pos": "noun",
            "sent1": "The prophethoods' words echoed through the valley, carrying messages of peace and harmony.",
            "sent2": "Scholars pored over the ancient scrolls, seeking wisdom in the prophethoods' prophecies.",
            "sent3": "The village elder jokingly claimed to have the prophethoods' gift of foresight, much to the amusement of the townsfolk.",
            "sent4": "Her words rang with the authority of the prophethoods, commanding attention and respect.",
            "sent5": "The prophethoods' teachings were like a guiding light, illuminating the path to a better future."
        }
    ]
}