{
    "term": "prorogated",
    "meanings": [
        {
            "definition": "Extend or prolong (a session of a legislative body)",
            "pos": "verb",
            "sent1": "The government prorogated the parliament session to allow for further discussions.",
            "sent2": "The decision to prorogate the meeting was made to accommodate all members' schedules.",
            "sent3": "The unexpected power outage prorogated the council session, much to everyone's annoyance.",
            "sent4": "The debate prorogated into the night, with neither side willing to back down.",
            "sent5": "The speaker's gavel echoed through the chamber as he prorogated the assembly."
        },
        {
            "definition": "Postpone or defer (an action or event)",
            "pos": "verb",
            "sent1": "I had to prorogate my dentist appointment due to a sudden work emergency.",
            "sent2": "The outdoor event was prorogated to the following weekend because of bad weather.",
            "sent3": "She decided to prorogate her study session to binge-watch her favorite show.",
            "sent4": "The team captain prorogated the match to give injured players more time to recover.",
            "sent5": "The teacher had to prorogate the test to the next day due to technical issues."
        },
        {
            "definition": "Continue or carry on (a practice or tradition)",
            "pos": "verb",
            "sent1": "The family prorogated the tradition of baking cookies together every Christmas.",
            "sent2": "Despite the challenges, the community prorogated the annual charity event.",
            "sent3": "The school prorogated the tradition of a talent show to showcase student skills.",
            "sent4": "The company prorogated the practice of recognizing outstanding employees every month.",
            "sent5": "The club prorogated the tradition of planting a tree for every new member."
        }
    ]
}