{
    "term": "prosimians",
    "meanings": [
        {
            "definition": "A type of primate that includes lemurs, lorises, and tarsiers.",
            "pos": "noun",
            "sent1": "The zoo had a special exhibit featuring prosimians from different regions.",
            "sent2": "Scientists study the behavior of prosimians to learn more about their unique characteristics.",
            "sent3": "The prosimians at the sanctuary loved to play hide-and-seek with the caretakers.",
            "sent4": "In the dense forest, the prosimians moved swiftly through the trees like shadows.",
            "sent5": "The prosimians' large eyes help them see clearly in the dark forests where they live."
        },
        {
            "definition": "Relating to or characteristic of prosimians.",
            "pos": "adjective",
            "sent1": "The prosimian features of the lemur made it stand out among other primates.",
            "sent2": "Her research focused on the prosimian species found in the remote jungles.",
            "sent3": "The prosimian-like behavior of the curious child amused the adults around.",
            "sent4": "The prosimian markings on the butterfly's wings were intricate and beautiful.",
            "sent5": "The prosimian traits of agility and adaptability helped the species survive in various habitats."
        },
        {
            "definition": "Study of prosimians.",
            "pos": "noun",
            "sent1": "She decided to pursue a career in prosimian research to protect these unique primates.",
            "sent2": "The university offered a specialized course in prosimian studies for aspiring biologists.",
            "sent3": "The prosimianology conference brought together experts from around the world.",
            "sent4": "Her passion for prosimianology led her to publish groundbreaking research.",
            "sent5": "The field of prosimianology continues to uncover new insights into primate evolution."
        }
    ]
}