{
    "term": "prostatectomy",
    "meanings": [
        {
            "definition": "The surgical removal of all or part of the prostate gland.",
            "pos": "noun",
            "sent1": "After the prostatectomy, the patient felt relieved from the discomfort.",
            "sent2": "The doctor recommended a prostatectomy to treat the prostate issue.",
            "sent3": "During the prostatectomy, the surgeon accidentally dropped a tool, causing a brief moment of panic.",
            "sent4": "The prostatectomy was like removing a troublesome obstacle from the body's path to health.",
            "sent5": "The prostatectomy was a life-changing procedure that improved the patient's quality of life."
        },
        {
            "definition": "A procedure to treat prostate cancer by removing the prostate gland.",
            "pos": "noun",
            "sent1": "His father underwent a prostatectomy to combat the cancer.",
            "sent2": "The oncologist recommended a prostatectomy as part of the treatment plan.",
            "sent3": "After the prostatectomy, the patient joked that he was now 'prostate-free'.",
            "sent4": "The prostatectomy was a decisive step in fighting the cancer invading his body.",
            "sent5": "The successful prostatectomy marked the beginning of the patient's recovery journey."
        },
        {
            "definition": "The removal of the prostate to treat benign prostatic hyperplasia.",
            "pos": "noun",
            "sent1": "The urologist suggested a prostatectomy to alleviate the symptoms.",
            "sent2": "After the prostatectomy, the patient experienced improved urinary flow.",
            "sent3": "The prostatectomy turned out to be the solution to his persistent discomfort.",
            "sent4": "The prostatectomy was a key step towards regaining normal prostate function.",
            "sent5": "The successful prostatectomy brought relief to the patient's daily life."
        }
    ]
}