{
    "term": "prostration",
    "meanings": [
        {
            "definition": "The act of lying face down in a show of submission or respect.",
            "pos": "noun",
            "sent1": "During the ceremony, the king performed a deep prostration before the elders.",
            "sent2": "In some cultures, a prostration is a sign of deep reverence.",
            "sent3": "The prostration of the puppy in front of the treat was both adorable and amusing.",
            "sent4": "Her prostration before the majestic mountain symbolized her humility in nature's presence.",
            "sent5": "The soldier's prostration before the general displayed his loyalty and obedience."
        },
        {
            "definition": "Extreme physical weakness or exhaustion.",
            "pos": "noun",
            "sent1": "After running the marathon, he collapsed in prostration at the finish line.",
            "sent2": "The hiker's prostration after climbing the steep mountain was evident in his heavy breathing.",
            "sent3": "The prostration of the old car after years of use was a clear sign it needed rest.",
            "sent4": "Her prostration on the couch after a long day of work was like a rock sinking in water.",
            "sent5": "The prostration of the exhausted athlete highlighted the grueling nature of the competition."
        },
        {
            "definition": "The state of being completely overcome or overwhelmed.",
            "pos": "noun",
            "sent1": "In the face of the unexpected news, she fell into a state of prostration.",
            "sent2": "The prostration of emotions after the breakup left her feeling drained and lost.",
            "sent3": "The prostration of the student when faced with a difficult exam was palpable.",
            "sent4": "His prostration in the presence of his idol showed the depth of his admiration.",
            "sent5": "The prostration of grief at the funeral was a heavy weight on everyone's shoulders."
        }
    ]
}