{
    "term": "proscriptions",
    "meanings": [
        {
            "definition": "A prohibition or ban on something.",
            "pos": "noun",
            "sent1": "The school's proscriptions against chewing gum were strictly enforced.",
            "sent2": "The government's proscriptions on smoking in public places aim to protect people's health.",
            "sent3": "Ignoring the proscriptions on using cell phones during the exam led to a comical mix-up.",
            "sent4": "Her proscriptions on junk food were as strict as a locked gate.",
            "sent5": "The proscriptions on entering the restricted area were painted in bold red letters."
        },
        {
            "definition": "An action or practice that is forbidden or discouraged.",
            "pos": "noun",
            "sent1": "His proscriptions against skipping class were well-known among the students.",
            "sent2": "The company's proscriptions on unethical behavior were outlined in the employee handbook.",
            "sent3": "The proscriptions on eating dessert before dinner seemed like a silly rule to the children.",
            "sent4": "The proscriptions on gossiping were like a heavy weight on her conscience.",
            "sent5": "The proscriptions on playing music loudly after midnight were clearly stated in the lease agreement."
        },
        {
            "definition": "Rules or guidelines that dictate what is not allowed.",
            "pos": "noun",
            "sent1": "The proscriptions in the club's code of conduct were followed by all members.",
            "sent2": "The proscriptions regarding attire were strictly adhered to at the formal event.",
            "sent3": "The proscriptions on using slang in academic writing made the students giggle.",
            "sent4": "The proscriptions on entering the building without a badge were like a fortress protecting its secrets.",
            "sent5": "The proscriptions on bringing outside food into the restaurant were clearly displayed at the entrance."
        }
    ]
}