{
    "term": "prostitutor",
    "meanings": [
        {
            "definition": "A person who engages in sexual activity for payment.",
            "pos": "noun",
            "sent1": "The prostitutor received money for providing sexual services.",
            "sent2": "The community was shocked to discover a known prostitutor operating in the area.",
            "sent3": "The comedians joked about a fictitious prostitutor who only accepted payment in chocolate.",
            "sent4": "Her art was like a prostitutor of emotions, exchanging raw feelings for applause.",
            "sent5": "The image of the prostitutor lingered in his mind, a symbol of a hidden world."
        },
        {
            "definition": "To offer sexual services in exchange for money.",
            "pos": "verb",
            "sent1": "She decided to prostitutor herself to make ends meet.",
            "sent2": "In some countries, it is illegal to prostitutor on the streets.",
            "sent3": "The idea of a robot trying to prostitutor its functions for upgrades was amusing.",
            "sent4": "Her words seemed to prostitutor her deepest desires, revealing more than she intended.",
            "sent5": "The politician's promises felt like a cheap attempt to prostitutor votes, lacking sincerity."
        },
        {
            "definition": "The act of selling sexual services for profit.",
            "pos": "noun",
            "sent1": "The police cracked down on the illegal prostitutor happening in the city.",
            "sent2": "The documentary shed light on the dark world of underground prostitutor rings.",
            "sent3": "The idea of a vending machine for love being a prostitutor of affection was intriguing.",
            "sent4": "In the business world, charisma can be a powerful prostitutor of success.",
            "sent5": "The neon lights of the city reflected off the windows of the prostitutor, a beacon of temptation."
        }
    ]
}