{
    "term": "proscription",
    "meanings": [
        {
            "definition": "The action of forbidding something.",
            "pos": "noun",
            "sent1": "The proscription of sugary snacks in school helps promote healthier eating habits.",
            "sent2": "The proscription against littering in the park keeps the environment clean.",
            "sent3": "The proscription of wearing pajamas to work may seem strict, but it ensures a professional atmosphere.",
            "sent4": "The proscription on using cell phones during the exam was strictly enforced.",
            "sent5": "The proscription on smoking in public places has led to cleaner air for everyone."
        },
        {
            "definition": "A decree or law that prohibits something.",
            "pos": "noun",
            "sent1": "The king issued a proscription against hunting in the royal forest.",
            "sent2": "The proscription on parking in front of the fire hydrant is to ensure quick access for firefighters.",
            "sent3": "The proscription against eating ice cream for breakfast may seem harsh, but it's for our own good.",
            "sent4": "The proscription on using unauthorized software in the office was strictly followed.",
            "sent5": "The proscription on swimming in the dangerous waters saved many lives."
        },
        {
            "definition": "The act of denouncing or condemning something.",
            "pos": "noun",
            "sent1": "The proscription of cheating in exams is necessary to maintain academic integrity.",
            "sent2": "The proscription against bullying in schools aims to create a safe environment for all students.",
            "sent3": "The proscription of using foul language in the library may lead to some quiet humor.",
            "sent4": "The proscription on dishonesty in the workplace is crucial for building trust among colleagues.",
            "sent5": "The proscription on unfair treatment of employees ensures a harmonious work environment."
        }
    ]
}