{
    "term": "protractive",
    "meanings": [
        {
            "definition": "Causing something to last longer than necessary.",
            "pos": "adjective",
            "sent1": "The protractive meeting dragged on for hours, making everyone tired.",
            "sent2": "The protractive movie seemed to never end, testing the audience's patience.",
            "sent3": "The protractive wait for the bus made Sarah start telling jokes to pass the time.",
            "sent4": "The protractive rainstorm felt like a never-ending curtain of water falling from the sky.",
            "sent5": "The protractive lecture felt like it was stretching time itself, making minutes feel like hours."
        },
        {
            "definition": "Extending or lengthening in time or duration.",
            "pos": "adjective",
            "sent1": "The protractive winter seemed to linger well into spring, delaying the arrival of warm weather.",
            "sent2": "The protractive process of getting a visa made the travelers anxious about their trip.",
            "sent3": "The protractive game of hide-and-seek had the children giggling as they searched for each other.",
            "sent4": "The protractive shadows of the evening stretched across the lawn, signaling the approach of night.",
            "sent5": "The protractive yawn of the tired student echoed through the quiet classroom, signaling the end of the day."
        },
        {
            "definition": "Delaying or prolonging a process or event.",
            "pos": "verb",
            "sent1": "She protractively postponed the meeting to buy more time for preparation.",
            "sent2": "The negotiations were protractively extended to ensure all parties were satisfied.",
            "sent3": "He protractively stalled the game by pretending to tie his shoelaces, much to the annoyance of his friends.",
            "sent4": "The detective protractively questioned the suspect to extract more information.",
            "sent5": "The chef protractively marinated the meat to enhance its flavor before cooking."
        }
    ]
}