{
    "term": "protectorate",
    "meanings": [
        {
            "definition": "A state that is controlled and protected by another.",
            "pos": "noun",
            "sent1": "The small island nation became a protectorate of the powerful empire.",
            "sent2": "The protectorate provided military support and guidance to the vulnerable country.",
            "sent3": "The protectorate of the neighboring kingdom always made sure to bring delicious treats during their visits.",
            "sent4": "The mentor acted as a protectorate, shielding the young apprentice from harm and danger.",
            "sent5": "The protectorate's shield symbolized the strong bond between the two nations."
        },
        {
            "definition": "The office or position of a protector.",
            "pos": "noun",
            "sent1": "She was honored to be appointed to the protectorate, responsible for ensuring the safety of the citizens.",
            "sent2": "The protectorate's duties included safeguarding important documents and artifacts.",
            "sent3": "The protectorate's desk was always neatly organized, showing a sense of order and responsibility.",
            "sent4": "In the play, the character held the protectorate with grace and authority, commanding respect from all.",
            "sent5": "The protectorate's badge gleamed proudly on the uniform, signifying their role in protecting others."
        },
        {
            "definition": "The relationship between a protector and a protected state.",
            "pos": "noun",
            "sent1": "The strong bond between the protector and the protectorate was evident in times of crisis.",
            "sent2": "The protectorate relied on the protector for guidance and support during difficult times.",
            "sent3": "The protectorate and the protector shared a special connection, like a guardian angel watching over its charge.",
            "sent4": "The protectorate flourished under the care and guidance of the protector, growing stronger and more resilient.",
            "sent5": "The protectorate's gratitude towards the protector was expressed through acts of loyalty and trust."
        }
    ]
}