{
    "term": "protectorates",
    "meanings": [
        {
            "definition": "A state that is controlled and protected by another.",
            "pos": "noun",
            "sent1": "The protectorates relied on the stronger nation for safety and guidance.",
            "sent2": "The protectorates flourished under the watchful care of their guardian state.",
            "sent3": "The protectorates threw a surprise party for their protector, showing their appreciation.",
            "sent4": "The protectorates were like fledglings under the wing of a powerful eagle.",
            "sent5": "The protectorates were like precious gems in the crown of their protector."
        },
        {
            "definition": "The relationship between a protector and a protectorate.",
            "pos": "noun",
            "sent1": "The bond between the protector and the protectorates was unbreakable.",
            "sent2": "The protectorates valued the trust and support of their guardian.",
            "sent3": "The protectorates and their protector shared a secret handshake to seal their alliance.",
            "sent4": "The protectorates and their guardian were like two peas in a pod.",
            "sent5": "The protectorates and their protector were like a well-oiled machine, working in harmony."
        },
        {
            "definition": "The territory of a protectorate.",
            "pos": "noun",
            "sent1": "The protectorates' lands were rich in resources and beauty.",
            "sent2": "The protectorates' territories expanded over time with the help of their guardian.",
            "sent3": "The protectorates' lands were like a colorful patchwork quilt, each piece unique.",
            "sent4": "The protectorates' territories were like a puzzle, fitting perfectly under the protection of their guardian.",
            "sent5": "The protectorates' lands were like a treasure map waiting to be explored by their protector."
        }
    ]
}