{
    "term": "provisioned",
    "meanings": [
        {
            "definition": "Supply with food, drink, or equipment, especially for a journey.",
            "pos": "verb",
            "sent1": "The hikers provisioned themselves with snacks and water before starting the trail.",
            "sent2": "The ship was provisioned with enough supplies for the long voyage across the ocean.",
            "sent3": "Before the camping trip, they provisioned so much food that they could barely fit it all in the car.",
            "sent4": "She provisioned her backpack as if preparing for a survival mission in the wilderness.",
            "sent5": "The army provisioned the soldiers with ammunition and rations for the upcoming battle."
        },
        {
            "definition": "The action of providing or supplying something for use.",
            "pos": "noun",
            "sent1": "The provisioned tools in the workshop were neatly organized for easy access.",
            "sent2": "The provisioned medical supplies were essential during the emergency situation.",
            "sent3": "The provisioned snacks for the party disappeared within minutes of being set out.",
            "sent4": "The provisioned materials for the project arrived just in time for the deadline.",
            "sent5": "The provisioned equipment in the gym helped the athletes train effectively."
        },
        {
            "definition": "The action or process of making preparations beforehand.",
            "pos": "noun",
            "sent1": "The provisioned arrangements for the event ensured everything ran smoothly.",
            "sent2": "The provisioned schedule allowed for flexibility in case of unexpected changes.",
            "sent3": "Their provisioned plans for the trip included backup options for any disruptions.",
            "sent4": "The provisioned list of tasks helped them stay organized and on track.",
            "sent5": "The provisioned strategies for the project proved to be effective in achieving the goals."
        }
    ]
}