{
    "term": "provocations",
    "meanings": [
        {
            "definition": "The act of provoking or inciting",
            "pos": "noun",
            "sent1": "Her constant provocations towards her brother led to arguments every day.",
            "sent2": "The political speech was full of provocations aimed at stirring up emotions.",
            "sent3": "The cat's playful provocation of the dog always ended in a chase around the yard.",
            "sent4": "The artist's bold use of color was a provocation to traditional painting styles.",
            "sent5": "The teacher's strict rules were a constant provocation to the students' rebellious nature."
        },
        {
            "definition": "Something that provokes, arouses, or stimulates",
            "pos": "noun",
            "sent1": "The mysterious letter was a strange provocation that piqued her curiosity.",
            "sent2": "The thrilling movie was filled with exciting provocations that kept the audience engaged.",
            "sent3": "The unexpected gift was a delightful provocation that brought a smile to her face.",
            "sent4": "The beautiful sunset was a natural provocation for feelings of peace and contentment.",
            "sent5": "The challenging puzzle was a mental provocation that tested her problem-solving skills."
        },
        {
            "definition": "The state or quality of being provoked or incited",
            "pos": "noun",
            "sent1": "The crowd's provocation reached a peak, leading to a chaotic scene.",
            "sent2": "The provocation of his anger was evident in the way he clenched his fists.",
            "sent3": "The playful banter between friends was a lighthearted provocation of laughter.",
            "sent4": "The provocation of the storm brought about a sense of urgency in the preparations.",
            "sent5": "The provocation of injustice fueled their determination to fight for equality."
        }
    ]
}