{
    "term": "proxy",
    "meanings": [
        {
            "definition": "A person authorized to act on behalf of another.",
            "pos": "noun",
            "sent1": "My friend couldn't attend the meeting, so I went as her proxy.",
            "sent2": "The proxy voted on behalf of the absent member during the election.",
            "sent3": "The proxy showed up at the party pretending to be my friend - what a mix-up!",
            "sent4": "In the play, the character served as a proxy for the king, making decisions in his absence.",
            "sent5": "The proxy, with a mask and a cape, symbolized the absent hero in the school play."
        },
        {
            "definition": "The authority to represent someone else, especially in voting.",
            "pos": "noun",
            "sent1": "She held the proxy to cast votes on behalf of her elderly neighbor.",
            "sent2": "The shareholders granted their proxies to the board members for the annual meeting.",
            "sent3": "The proxy for the class president election accidentally voted for the wrong candidate!",
            "sent4": "The proxy's power to decide the fate of the company's future was a heavy responsibility.",
            "sent5": "With the proxy in hand, she confidently entered the voting booth to make her choice."
        },
        {
            "definition": "A document giving someone the power to act for another.",
            "pos": "noun",
            "sent1": "Make sure to bring the proxy with you to the legal meeting.",
            "sent2": "The lawyer drafted a proxy to authorize the transfer of property on behalf of the client.",
            "sent3": "The proxy got lost in the pile of papers on the desk, causing a moment of panic.",
            "sent4": "The proxy, a piece of paper with immense authority, changed the course of the business deal.",
            "sent5": "With the signed proxy in hand, she was ready to make decisions on behalf of her sister."
        }
    ]
}