{
    "term": "proximities",
    "meanings": [
        {
            "definition": "Nearness in space or time.",
            "pos": "noun",
            "sent1": "The proximities of the two houses made it easy for the neighbors to chat over the fence.",
            "sent2": "The city's parks are popular due to their proximities to residential areas.",
            "sent3": "The proximities of the two rival teams on the leaderboard led to a friendly competition.",
            "sent4": "The proximities of the stars in the night sky create a breathtaking view.",
            "sent5": "The proximities of the train station and the bus stop make commuting convenient."
        },
        {
            "definition": "The state of being close to someone or something.",
            "pos": "noun",
            "sent1": "In the crowded elevator, the uncomfortable proximities made everyone feel cramped.",
            "sent2": "The proximities of the siblings showed in their strong bond and constant support for each other.",
            "sent3": "The proximities of the two rival teams on the leaderboard led to a friendly competition.",
            "sent4": "The proximities of the puzzle pieces made it easier to complete the picture.",
            "sent5": "The proximities of the teacher's desk and the chalkboard made it easy for students to follow along."
        },
        {
            "definition": "The quality of being close to something in distance.",
            "pos": "noun",
            "sent1": "The proximities of the grocery store and the apartment complex made shopping convenient for the residents.",
            "sent2": "The proximities of the mountains to the town provided a stunning backdrop for the locals.",
            "sent3": "The proximities of the two rival teams on the leaderboard led to a friendly competition.",
            "sent4": "The proximities of the flowers to the garden gate welcomed visitors with a sweet fragrance.",
            "sent5": "The proximities of the playground to the school allowed for easy access to outdoor playtime."
        }
    ]
}