{
    "term": "pruinose",
    "meanings": [
        {
            "definition": "Covered with a powdery bloom, as certain fruits.",
            "pos": "adjective",
            "sent1": "The peach was pruinose, looking like it had been dusted with powdered sugar.",
            "sent2": "The plum had a pruinose skin, making it appear frosted and delicate.",
            "sent3": "The pruinose apple seemed to have gotten into a flour fight with the other fruits.",
            "sent4": "Her cheeks were pruinose with a light dusting of blush, giving her a rosy glow.",
            "sent5": "The pruinose grapes glistened in the sunlight, resembling tiny sugar-coated gems."
        },
        {
            "definition": "Having a frosty or powdery appearance.",
            "pos": "adjective",
            "sent1": "The car's pruinose windshield made it difficult to see through the frost.",
            "sent2": "The mountain peak had a pruinose look, as if it was covered in a layer of powdered snow.",
            "sent3": "The pruinose mirror reflected a distorted image due to the frosty coating.",
            "sent4": "Her breath formed pruinose patterns on the cold window, creating intricate designs.",
            "sent5": "The pruinose leaves crunched underfoot, resembling a frosty carpet in the forest."
        },
        {
            "definition": "Covered with a white, powdery substance.",
            "pos": "adjective",
            "sent1": "The mushrooms were pruinose, looking as if they had been sprinkled with white powder.",
            "sent2": "The statue's pruinose surface gave it an ancient and weathered appearance.",
            "sent3": "The pruinose cake was a hit at the party, with its unique powdered sugar topping.",
            "sent4": "Her hands were pruinose after working with the chalk, leaving white marks everywhere.",
            "sent5": "The pruinose clouds hung low in the sky, casting a soft white veil over the landscape."
        }
    ]
}