{
    "term": "pseudoclassic",
    "meanings": [
        {
            "definition": "Imitating or resembling the style of classical antiquity.",
            "pos": "adjective",
            "sent1": "The artist created a pseudoclassic sculpture for the museum exhibit.",
            "sent2": "The building's facade had a pseudoclassic design with columns and intricate carvings.",
            "sent3": "The pseudoclassic painting fooled many into thinking it was from ancient times.",
            "sent4": "Her dress was a pseudoclassic masterpiece, blending modern and ancient styles.",
            "sent5": "The garden was transformed into a pseudoclassic paradise with marble statues and fountains."
        },
        {
            "definition": "A work of art or literature that imitates the style of classical antiquity.",
            "pos": "noun",
            "sent1": "The museum displayed a pseudoclassic vase from the Roman era.",
            "sent2": "She enjoyed reading pseudoclassic novels that transported her to ancient times.",
            "sent3": "The play was a pseudoclassic comedy, mixing modern humor with ancient themes.",
            "sent4": "His poetry collection was a pseudoclassic treasure trove of ancient-inspired verses.",
            "sent5": "The library had a section dedicated to pseudoclassic literature, attracting history enthusiasts."
        },
        {
            "definition": "Falsely or erroneously considered to be a classic.",
            "pos": "adjective",
            "sent1": "The pseudoclassic car was actually a replica made in the 2000s.",
            "sent2": "The painting was deemed pseudoclassic by mistake due to its aged appearance.",
            "sent3": "He proudly displayed his pseudoclassic watch, unaware of its true origin.",
            "sent4": "The vase turned out to be pseudoclassic, fooling even the experts at the auction.",
            "sent5": "The antique dealer mistakenly labeled the mirror as pseudoclassic, leading to confusion among buyers."
        }
    ]
}