{
    "term": "psychokineses",
    "meanings": [
        {
            "definition": "The ability to move objects with the mind.",
            "pos": "noun",
            "sent1": "She amazed everyone with her psychokineses, effortlessly moving the book across the table.",
            "sent2": "The superhero's psychokineses allowed him to lift heavy objects without touching them.",
            "sent3": "During the magic show, the magician pretended to have psychokineses and made a toy car 'float'.",
            "sent4": "Her psychokineses were so strong that she could rearrange the furniture in the room just by thinking about it.",
            "sent5": "The child's eyes widened in wonder as he witnessed his favorite character using psychokineses to control a toy train."
        },
        {
            "definition": "The paranormal ability to influence physical objects without physical interaction.",
            "pos": "noun",
            "sent1": "The ghost's psychokineses caused the objects in the room to move on their own.",
            "sent2": "Many people believe in the existence of psychokineses as a supernatural power.",
            "sent3": "In the horror movie, the villain possessed psychokineses and used it to scare the protagonist.",
            "sent4": "The mysterious force of psychokineses seemed to defy the laws of physics.",
            "sent5": "The psychic claimed to have psychokineses and demonstrated it by making a pencil roll off the table without touching it."
        },
        {
            "definition": "The power to manipulate objects using mental energy.",
            "pos": "noun",
            "sent1": "With intense focus, she harnessed her psychokineses to lift the cup without touching it.",
            "sent2": "The ancient legend spoke of a sorcerer who possessed the power of psychokineses.",
            "sent3": "The mischievous child joked that he had psychokineses and tried to 'move' his toy using only his mind.",
            "sent4": "Her psychokineses were so precise that she could stack blocks in a perfect tower without touching them.",
            "sent5": "The scientist was fascinated by the concept of psychokineses and conducted experiments to understand its potential."
        }
    ]
}