{
    "term": "psychasthenics",
    "meanings": [
        {
            "definition": "A condition characterized by extreme mental and physical fatigue.",
            "pos": "noun",
            "sent1": "After a long day of work, she felt overwhelmed by psychasthenics.",
            "sent2": "Psychasthenics can make it hard to concentrate and stay alert.",
            "sent3": "The comedy show depicted a character struggling with psychasthenics, falling asleep in funny situations.",
            "sent4": "The weight of her worries felt like psychasthenics dragging her down.",
            "sent5": "Psychasthenics felt like carrying a heavy backpack full of exhaustion."
        },
        {
            "definition": "The study and treatment of mental and physical fatigue.",
            "pos": "noun",
            "sent1": "Researchers in psychasthenics are looking for new ways to help people overcome fatigue.",
            "sent2": "Psychasthenics involves understanding the causes of exhaustion and finding solutions.",
            "sent3": "The university offered a course on psychasthenics, teaching students how to combat tiredness.",
            "sent4": "In the field of psychasthenics, knowledge is the key to unlocking energy reserves.",
            "sent5": "The book on psychasthenics provided valuable insights into managing fatigue effectively."
        },
        {
            "definition": "A person who experiences mental and physical fatigue.",
            "pos": "noun",
            "sent1": "As a psychasthenics, he struggled to keep up with daily tasks.",
            "sent2": "Psychasthenics often find it challenging to maintain high levels of energy.",
            "sent3": "The group of friends jokingly called themselves the 'Psychasthenics Club' due to their constant tiredness.",
            "sent4": "She felt like a psychasthenics, dragging her feet through the day.",
            "sent5": "The psychasthenics in the office relied on coffee to get through the afternoon slump."
        }
    ]
}