{
    "term": "psychotic",
    "meanings": [
        {
            "definition": "Suffering from a severe mental disorder causing abnormal behavior and a loss of touch with reality.",
            "pos": "adjective",
            "sent1": "The man's psychotic behavior made it difficult for him to distinguish between what was real and what was not.",
            "sent2": "The psychiatrist diagnosed the patient as psychotic after observing his erratic actions and delusional beliefs.",
            "sent3": "Despite his psychotic episodes, the clown always managed to put on a smile for the children at the hospital.",
            "sent4": "Her mind felt like a chaotic maze, each turn leading to a different psychotic reality.",
            "sent5": "The eerie silence of the abandoned asylum echoed with the memories of past psychotic patients."
        },
        {
            "definition": "Relating to or suffering from psychosis.",
            "pos": "adjective",
            "sent1": "The hospital specialized in treating psychotic patients with compassionate care.",
            "sent2": "The research focused on understanding the genetic factors that contribute to psychotic disorders.",
            "sent3": "The detective's psychotic theory about the crime scene turned out to be surprisingly accurate.",
            "sent4": "The stormy weather matched the psychotic mood of the protagonist in the novel.",
            "sent5": "The artist's painting captured the essence of a psychotic mind with its swirling colors and distorted shapes."
        },
        {
            "definition": "Characterized by or relating to psychosis.",
            "pos": "adjective",
            "sent1": "The movie portrayed a psychotic character who struggled with inner demons.",
            "sent2": "The professor's lecture delved into the history of psychotic disorders and their treatment.",
            "sent3": "The comedian's jokes took a psychotic turn, leaving the audience in stitches.",
            "sent4": "The city streets at night had a mysterious and somewhat psychotic atmosphere.",
            "sent5": "The haunted house was designed to evoke a sense of psychotic terror in its visitors."
        }
    ]
}