{
    "term": "psychos",
    "meanings": [
        {
            "definition": "A person who is mentally unstable or insane.",
            "pos": "noun",
            "sent1": "The town was terrified of the psychos who roamed the streets at night.",
            "sent2": "The police were called to deal with the psychos causing trouble at the mall.",
            "sent3": "The comedy show featured a hilarious skit about a group of psychos trying to run a bakery.",
            "sent4": "Her mind was a chaotic mess, a swirling storm of psychos battling for control.",
            "sent5": "The horror movie depicted a house haunted by vengeful psychos from the past."
        },
        {
            "definition": "Informal term for someone who is reckless or dangerous.",
            "pos": "noun",
            "sent1": "The reckless psychos on motorcycles sped through the neighborhood, causing chaos.",
            "sent2": "The gang leader was known as the most dangerous psycho in the city.",
            "sent3": "The children giggled as they pretended to be daring psychos exploring a forbidden cave.",
            "sent4": "His eyes gleamed with a wild light, like a predator among the psychos of the jungle.",
            "sent5": "The stormy sea was a playground for the fearless psychos on their surfboards."
        },
        {
            "definition": "Plural form of 'psycho', referring to individuals with psychopathic tendencies.",
            "pos": "noun",
            "sent1": "The psychos in the movie were portrayed as cunning and manipulative characters.",
            "sent2": "The detective was on the trail of a group of psychos responsible for a series of crimes.",
            "sent3": "The board game featured players taking on the roles of psychos trying to outwit each other.",
            "sent4": "In the dark alley, she felt surrounded by unseen psychos lurking in the shadows.",
            "sent5": "The city was on edge as reports of dangerous psychos on the loose spread through the news."
        }
    ]
}