{
    "term": "puffs",
    "meanings": [
        {
            "definition": "A short, quick blast or gust of air or smoke.",
            "pos": "noun",
            "sent1": "The wind carried tiny puffs of smoke from the chimney.",
            "sent2": "She blew out puffs of air to cool her soup.",
            "sent3": "The dragon sneezed, sending puffs of smoke everywhere!",
            "sent4": "The clouds looked like fluffy puffs of cotton in the sky.",
            "sent5": "The magician made colorful puffs of smoke appear out of thin air."
        },
        {
            "definition": "A light, fluffy pastry or dessert.",
            "pos": "noun",
            "sent1": "The bakery displayed fresh puffs filled with cream.",
            "sent2": "She enjoyed the sweet taste of the chocolate puff.",
            "sent3": "The puffs on the plate disappeared in seconds at the party.",
            "sent4": "The chef created a masterpiece with layers of delicate pastry puffs.",
            "sent5": "The warm apple puff melted in her mouth with each bite."
        },
        {
            "definition": "A soft, round mass or shape.",
            "pos": "noun",
            "sent1": "The kitten curled up into a cozy puff of fur.",
            "sent2": "The clouds formed fluffy white puffs in the sky.",
            "sent3": "The pillow was so fluffy, it felt like resting on a cloud puff.",
            "sent4": "She picked up a small puff of cotton from the ground.",
            "sent5": "The dandelion released its seeds in a gentle puff of air."
        },
        {
            "definition": "To emit or give off puffs of air or smoke.",
            "pos": "verb",
            "sent1": "The old train puffs steam as it chugs along the tracks.",
            "sent2": "The teapot puffs out steam when it's boiling.",
            "sent3": "The tired hiker puffs heavily as he reaches the mountain peak.",
            "sent4": "The chimney puffs smoke into the clear blue sky.",
            "sent5": "The locomotive puffs loudly as it pulls the heavy cargo."
        },
        {
            "definition": "To swell or expand in a rounded shape.",
            "pos": "verb",
            "sent1": "The dough puffs up in the oven to become golden brown.",
            "sent2": "Her cheeks puffed out when she blew up the balloon.",
            "sent3": "The frog puffs itself up to appear bigger to its predators.",
            "sent4": "The balloon puffs out as more air is blown into it.",
            "sent5": "The pastry dough puffs beautifully as it bakes to perfection."
        }
    ]
}