{
    "term": "puff",
    "meanings": [
        {
            "definition": "A short, quick burst of breath or wind.",
            "pos": "noun",
            "sent1": "She let out a little puff of air to blow out the candle.",
            "sent2": "The wind carried the puff of smoke away quickly.",
            "sent3": "The little girl giggled as she blew a puff of air at her friend.",
            "sent4": "The steam rose in a puff from the teapot, like a tiny cloud.",
            "sent5": "With a puff, the dandelion seeds scattered in the breeze."
        },
        {
            "definition": "A light pastry shell filled with cream or other filling.",
            "pos": "noun",
            "sent1": "The bakery displayed a tray of delicious cream puffs.",
            "sent2": "She enjoyed a sweet puff filled with chocolate cream.",
            "sent3": "The puff pastry melted in her mouth, leaving a delightful taste.",
            "sent4": "The cream puff was as light as a feather, almost floating in her hand.",
            "sent5": "Each bite of the cream puff was a burst of flavor in her mouth."
        },
        {
            "definition": "To emit smoke, vapor, or steam in puffs.",
            "pos": "verb",
            "sent1": "The old train chugged along, puffing out white smoke.",
            "sent2": "The chimney of the house puffed out thick gray smoke.",
            "sent3": "The teapot puffed steam like a little engine, making her smile.",
            "sent4": "The factory chimney puffed out pollution, darkening the sky.",
            "sent5": "The steam engine puffed rhythmically as it pulled the train."
        },
        {
            "definition": "To swell or bulge out in a spherical shape.",
            "pos": "verb",
            "sent1": "The frog's throat puffed up as it croaked loudly.",
            "sent2": "Her cheeks puffed out as she blew up the balloon.",
            "sent3": "The balloon puffed out round and full, ready for the party.",
            "sent4": "The cat puffed up its fur to look bigger and scarier.",
            "sent5": "The pastry dough puffed up in the oven, turning golden brown."
        }
    ]
}