{
    "term": "pullup",
    "meanings": [
        {
            "definition": "An exercise in which a person hangs from a bar and pulls their body up until their chin is level with the bar.",
            "pos": "noun",
            "sent1": "During gym class, Sarah did a pullup and impressed everyone with her strength.",
            "sent2": "John's goal is to do ten pullups in a row to improve his upper body strength.",
            "sent3": "The monkey at the zoo showed off by effortlessly doing a pullup on the tree branch.",
            "sent4": "In the army, recruits are often required to do multiple pullups to test their physical fitness.",
            "sent5": "The sound of the pullup bar rattling echoed through the gym as people worked out."
        },
        {
            "definition": "A type of diaper that can be pulled up like underwear.",
            "pos": "noun",
            "sent1": "When changing the baby, the pullup made the process quick and easy.",
            "sent2": "Parents find pullups convenient for toddlers who are learning to use the potty.",
            "sent3": "The cartoon characters on the pullup made the toddler giggle during diaper change time.",
            "sent4": "The pullup design prevents leaks and keeps the baby dry throughout the night.",
            "sent5": "In the store, the pullup aisle had a variety of sizes for different ages of children."
        },
        {
            "definition": "A type of window shade that can be pulled up to let light in.",
            "pos": "noun",
            "sent1": "In the morning, she pulled up the window pullup to welcome the sunshine into the room.",
            "sent2": "During the sunset, the golden rays filtered through the pulled up pullup, creating a warm glow.",
            "sent3": "The mischievous cat tried to climb the window pullup when it was halfway up, causing a commotion.",
            "sent4": "As she pulled up the pullup, the room transformed from dim to bright with natural light.",
            "sent5": "The elegant fabric of the pullup added a touch of sophistication to the room decor."
        }
    ]
}