{
    "term": "pullus",
    "meanings": [
        {
            "definition": "A young animal, especially a young bird.",
            "pos": "noun",
            "sent1": "The pullus chirped softly in its nest.",
            "sent2": "The pullus learned to fly from its mother.",
            "sent3": "The pullus tried to imitate the adult birds' songs.",
            "sent4": "The pullus was like a fluffy ball of feathers.",
            "sent5": "The pullus had bright, eager eyes as it explored the world."
        },
        {
            "definition": "A dish made with chicken or poultry.",
            "pos": "noun",
            "sent1": "The chef prepared a delicious pullus stew for dinner.",
            "sent2": "The restaurant's specialty was the pullus curry.",
            "sent3": "The pullus dish was so tasty, it disappeared in minutes.",
            "sent4": "The aroma of the pullus roast filled the kitchen.",
            "sent5": "The pullus soup warmed the diners on a cold evening."
        },
        {
            "definition": "To draw or haul something towards oneself.",
            "pos": "verb",
            "sent1": "He used a rope to pullus the heavy box across the room.",
            "sent2": "She had to pullus the stubborn door to open it.",
            "sent3": "The children played tug-of-war to see who could pullus harder.",
            "sent4": "The magnet seemed to pullus the metal objects towards it.",
            "sent5": "The tractor was able to pullus the plow through the field easily."
        },
        {
            "definition": "To attract or draw in a particular direction.",
            "pos": "verb",
            "sent1": "The colorful sign outside the store pullus customers inside.",
            "sent2": "The bright lights pullus moths towards them at night.",
            "sent3": "The catchy jingle pullus people to the ice cream truck.",
            "sent4": "Her smile seemed to pullus everyone's attention in the room.",
            "sent5": "The interesting story pullus listeners in and keeps them engaged."
        },
        {
            "definition": "To remove something by force.",
            "pos": "verb",
            "sent1": "He had to pullus the weed out of the ground with all his strength.",
            "sent2": "The strong wind pullus the leaves off the trees in autumn.",
            "sent3": "She tried to pullus the sticker off the paper, but it tore instead.",
            "sent4": "The magician seemed to pullus a rabbit out of an empty hat.",
            "sent5": "The detective had to pullus the truth out of the suspect during questioning."
        }
    ]
}