{
    "term": "puller",
    "meanings": [
        {
            "definition": "A person or thing that pulls.",
            "pos": "noun",
            "sent1": "The strong puller helped move the heavy box.",
            "sent2": "The tractor is a powerful puller on the farm.",
            "sent3": "The little puller tried to move the giant rock.",
            "sent4": "Her determination was the puller that brought success.",
            "sent5": "The tugboat was a reliable puller in the harbor."
        },
        {
            "definition": "A device or mechanism used for pulling.",
            "pos": "noun",
            "sent1": "The pulley is a simple puller that lifts heavy objects.",
            "sent2": "The winch is a useful puller for towing vehicles.",
            "sent3": "The puller made the task of moving furniture much easier.",
            "sent4": "The magnet acted as a puller for the metal objects.",
            "sent5": "The rope was a reliable puller in the rescue operation."
        },
        {
            "definition": "A person who pulls a particular type of vehicle or animal.",
            "pos": "noun",
            "sent1": "The horse puller guided the carriage through the streets.",
            "sent2": "The sled puller led the team of dogs through the snow.",
            "sent3": "The truck puller had a strong bond with his vehicle.",
            "sent4": "The dog acted as a puller for the sled in the race.",
            "sent5": "The ox was a steady puller in the field."
        },
        {
            "definition": "A person who removes something by pulling it.",
            "pos": "noun",
            "sent1": "The tooth puller gently removed the loose tooth.",
            "sent2": "The nail puller is handy for taking out nails.",
            "sent3": "The zipper puller made it easy to open the bag.",
            "sent4": "The weed puller helped clear the garden of unwanted plants.",
            "sent5": "The cork puller was essential for opening the wine bottle."
        }
    ]
}