{
    "term": "pulus",
    "meanings": [
        {
            "definition": "A small, soft, edible fruit.",
            "pos": "noun",
            "sent1": "I picked a pulus from the tree and enjoyed its sweetness.",
            "sent2": "The pulus was ripe and juicy, perfect for a snack.",
            "sent3": "The pulus rolled off the table and into my lap, making me laugh.",
            "sent4": "Her laughter was like a pulus, sweet and infectious.",
            "sent5": "The pulus was so small and delicate, like a precious gem."
        },
        {
            "definition": "A small, round object used in games.",
            "pos": "noun",
            "sent1": "The children played with a colorful pulus in the park.",
            "sent2": "The pulus rolled across the floor as they tried to catch it.",
            "sent3": "The pulus bounced off the wall and surprised everyone.",
            "sent4": "His eyes followed the pulus like a hawk tracking its prey.",
            "sent5": "The pulus was the perfect size for their game, easy to handle."
        },
        {
            "definition": "To push or thrust forcefully.",
            "pos": "verb",
            "sent1": "He used all his strength to pulus the heavy door open.",
            "sent2": "She pulused the box onto the shelf with a grunt.",
            "sent3": "The cat tried to pulus the toy mouse under the couch.",
            "sent4": "The waves pulused against the shore, relentless and powerful.",
            "sent5": "The wind pulused through the trees, bending them with its force."
        },
        {
            "definition": "A sudden strong wind.",
            "pos": "noun",
            "sent1": "The pulus swept through the town, knocking over signs.",
            "sent2": "People held onto their hats as the pulus blew fiercely.",
            "sent3": "The pulus carried the leaves high into the air, swirling them around.",
            "sent4": "The pulus howled like a wild beast, echoing through the valley.",
            "sent5": "The pulus was so strong, it felt like nature's own breath."
        }
    ]
}