{
    "term": "pumping",
    "meanings": [
        {
            "definition": "To move rhythmically up and down",
            "pos": "verb",
            "sent1": "The kids were pumping on the swings at the park.",
            "sent2": "The heart keeps pumping blood throughout the body.",
            "sent3": "The dancers were pumping to the beat of the music.",
            "sent4": "The piston was pumping up and down in the engine.",
            "sent5": "The seesaw was pumping up and down with each child's movement."
        },
        {
            "definition": "To fill with air or liquid",
            "pos": "verb",
            "sent1": "Dad was pumping air into the bicycle tire.",
            "sent2": "The mechanic was pumping oil into the car engine.",
            "sent3": "The balloon was pumping up with helium for the party.",
            "sent4": "The firefighter was pumping water into the hose.",
            "sent5": "The swimmer was pumping air into the inflatable pool float."
        },
        {
            "definition": "To operate a pump",
            "pos": "verb",
            "sent1": "The farmer was pumping water from the well.",
            "sent2": "The engineer was pumping fuel into the aircraft.",
            "sent3": "The gardener was pumping fertilizer into the soil.",
            "sent4": "The worker was pumping air into the scuba tank.",
            "sent5": "The lifeguard was pumping air into the rescue buoy."
        },
        {
            "definition": "To increase or raise rapidly",
            "pos": "verb",
            "sent1": "The company was pumping up its profits this quarter.",
            "sent2": "The excitement was pumping up in the crowd at the concert.",
            "sent3": "The gossip was pumping up around the office.",
            "sent4": "The adrenaline was pumping up as the race began.",
            "sent5": "The energy was pumping up during the sports game."
        },
        {
            "definition": "To deliver or supply continuously",
            "pos": "verb",
            "sent1": "The factory was pumping out products all day.",
            "sent2": "The bakery was pumping out fresh bread for the customers.",
            "sent3": "The printer was pumping out copies of the report.",
            "sent4": "The station was pumping out music for the listeners.",
            "sent5": "The kitchen was pumping out delicious smells during dinner preparation."
        }
    ]
}