{
    "term": "punch",
    "meanings": [
        {
            "definition": "A quick blow with the fist.",
            "pos": "noun",
            "sent1": "He gave the bully a punch in the arm.",
            "sent2": "The boxer delivered a powerful punch to his opponent's jaw.",
            "sent3": "The clown's punch landed on his own nose by mistake.",
            "sent4": "Her words packed a punch that left everyone speechless.",
            "sent5": "The sound of the punch echoed through the room."
        },
        {
            "definition": "A tool used for making holes or impressions in a surface.",
            "pos": "noun",
            "sent1": "She used a punch to create holes in the leather belt.",
            "sent2": "The metalworker used a punch to mark the design on the sheet.",
            "sent3": "The craftswoman's punch made perfect holes in the paper.",
            "sent4": "His idea was like a punch that left a lasting impression.",
            "sent5": "The punch left a clear mark on the wood."
        },
        {
            "definition": "A drink made with fruit juice and soda or alcohol.",
            "pos": "noun",
            "sent1": "She enjoyed a refreshing glass of punch at the party.",
            "sent2": "The bartender served a colorful punch with floating fruit slices.",
            "sent3": "The punch was so tasty, it disappeared in minutes.",
            "sent4": "The fruity punch was a hit at the picnic.",
            "sent5": "The punch was a sweet blend of flavors."
        },
        {
            "definition": "Energy or power.",
            "pos": "noun",
            "sent1": "The team played with great punch and determination.",
            "sent2": "His speech was full of punch and enthusiasm.",
            "sent3": "The battery had enough punch to last the entire trip.",
            "sent4": "Her presence added a punch of excitement to the event.",
            "sent5": "The music had a punch that made everyone dance."
        }
    ]
}