{
    "term": "punkish",
    "meanings": [
        {
            "definition": "Resembling or characteristic of a punk",
            "pos": "adjective",
            "sent1": "Her outfit had a punkish vibe with the leather jacket and spiked accessories.",
            "sent2": "The band's music had a punkish edge that appealed to rebellious youth.",
            "sent3": "He tried to look punkish by wearing safety pins on his shirt, but it just looked silly.",
            "sent4": "The graffiti artist's work was a punkish display of defiance against authority.",
            "sent5": "The punkish hairstyle with bright colors and spikes stood out in the crowd."
        },
        {
            "definition": "Having qualities associated with punk music or culture",
            "pos": "adjective",
            "sent1": "The club had a punkish atmosphere with loud music and mohawked patrons.",
            "sent2": "She embraced a punkish style with ripped jeans and band t-shirts.",
            "sent3": "The rebellious teenager's room was decorated in a punkish theme with posters of punk bands.",
            "sent4": "His punkish attitude clashed with the more conservative views of his classmates.",
            "sent5": "The punkish concert was a wild and energetic experience for the audience."
        },
        {
            "definition": "Showing rebellious or defiant behavior",
            "pos": "adjective",
            "sent1": "The student's punkish attitude towards authority often got him in trouble.",
            "sent2": "Her punkish defiance of societal norms made her stand out in the crowd.",
            "sent3": "The cat's punkish refusal to obey commands amused its owner.",
            "sent4": "The protest was a punkish act of resistance against the unjust law.",
            "sent5": "His punkish behavior challenged the status quo and sparked conversations."
        },
        {
            "definition": "Slightly punk in style or attitude",
            "pos": "adjective",
            "sent1": "The new employee had a punkish haircut with a hint of rebellion.",
            "sent2": "The cafe had a punkish decor with graffiti art and vintage posters.",
            "sent3": "His punkish sense of humor often involved playful pranks on his friends.",
            "sent4": "The movie had a punkish vibe with its unconventional storytelling.",
            "sent5": "The punkish fashion trend of ripped jeans and combat boots became popular among teenagers."
        }
    ]
}