{
    "term": "punks",
    "meanings": [
        {
            "definition": "A young troublemaker or delinquent.",
            "pos": "noun",
            "sent1": "The punks in the neighborhood were always causing trouble.",
            "sent2": "The teacher scolded the punks for drawing on the walls.",
            "sent3": "The punks thought it was funny to prank the neighbors by ringing their doorbell and running away.",
            "sent4": "The punks' rebellious spirit was like a wildfire, spreading mischief wherever they went.",
            "sent5": "The image of the punks spray painting graffiti on the building was hard to forget."
        },
        {
            "definition": "A person who is inexperienced or weak.",
            "pos": "noun",
            "sent1": "The new employee felt like a punk among the seasoned staff.",
            "sent2": "She was often taken advantage of because others saw her as a punk.",
            "sent3": "Despite his size, he felt like a punk when facing the school bully.",
            "sent4": "In the jungle of competitors, he was a small punk trying to survive.",
            "sent5": "The little bird looked like a punk compared to the majestic eagle."
        },
        {
            "definition": "A type of music characterized by fast, loud, and aggressive sound.",
            "pos": "noun",
            "sent1": "The concert was filled with the energetic beats of punk music.",
            "sent2": "She loved to blast punk songs in her room to feel pumped up.",
            "sent3": "The punk music blared from the speakers, making everyone want to dance.",
            "sent4": "The punk rock band's music hit the audience like a powerful wave.",
            "sent5": "The rebellious lyrics of punk songs echoed through the venue."
        },
        {
            "definition": "To act in a disrespectful or rebellious manner.",
            "pos": "verb",
            "sent1": "He decided to punk his friends by hiding their belongings as a prank.",
            "sent2": "The group of teenagers planned to punk the principal by releasing mice in his office.",
            "sent3": "She thought it would be funny to punk her brother by putting salt in his sugar jar.",
            "sent4": "The mischievous plan to punk the teacher with a fake spider was in motion.",
            "sent5": "The siblings always tried to outdo each other in punking their parents with harmless jokes."
        }
    ]
}