{
    "term": "puranas",
    "meanings": [
        {
            "definition": "Puranas: Ancient Hindu texts containing myths, legends, and historical accounts.",
            "pos": "noun",
            "sent1": "The library had a collection of puranas that told stories of ancient times.",
            "sent2": "Scholars study puranas to learn about the history and myths of Hindu culture.",
            "sent3": "Reading the puranas felt like traveling back in time to explore ancient tales.",
            "sent4": "The puranas are like time capsules, preserving the rich heritage of Hindu traditions.",
            "sent5": "The vivid illustrations in the puranas brought the ancient stories to life."
        },
        {
            "definition": "Puranas: A genre of Indian literature.",
            "pos": "noun",
            "sent1": "The bookstore had a section dedicated to puranas, showcasing diverse Indian literary works.",
            "sent2": "Students in the literature class discussed the different styles found in puranas.",
            "sent3": "The puranas genre offered a colorful array of stories that captivated readers.",
            "sent4": "Exploring the puranas was like delving into a treasure trove of Indian literary gems.",
            "sent5": "The richness of the puranas genre reflected the cultural tapestry of India."
        },
        {
            "definition": "Puranas: Stories of gods and goddesses in Hindu mythology.",
            "pos": "noun",
            "sent1": "Children enjoyed listening to puranas about the adventures of Hindu deities.",
            "sent2": "The priest narrated the puranas during the religious ceremony.",
            "sent3": "The mischievous monkey god in the puranas always brought laughter to the listeners.",
            "sent4": "The puranas painted a celestial portrait of the divine beings in Hindu mythology.",
            "sent5": "The colorful illustrations in the puranas depicted the gods and goddesses in all their glory."
        }
    ]
}