{
    "term": "pure",
    "meanings": [
        {
            "definition": "Free from anything of a different, inferior, or contaminating kind; free from extraneous matter",
            "pos": "adjective",
            "sent1": "The water in the bottle was pure and clean.",
            "sent2": "She wore a pure white dress to the party.",
            "sent3": "The pure joy on his face was contagious.",
            "sent4": "Her voice was as pure as a crystal-clear stream.",
            "sent5": "The pure snow glistened in the sunlight."
        },
        {
            "definition": "Containing nothing that does not properly belong; unadulterated",
            "pos": "adjective",
            "sent1": "The cake was made with pure ingredients.",
            "sent2": "The artist's work was a pure expression of emotion.",
            "sent3": "His pure dedication to his craft was admirable.",
            "sent4": "The pure silence of the night was calming.",
            "sent5": "The pure joy of the children playing was heartwarming."
        },
        {
            "definition": "Free from moral fault or guilt",
            "pos": "adjective",
            "sent1": "Her intentions were pure and honest.",
            "sent2": "He had a pure heart and always helped others.",
            "sent3": "The pure kindness she showed was appreciated by all.",
            "sent4": "His pure conscience guided him to do the right thing.",
            "sent5": "The pure love between them was evident to everyone."
        },
        {
            "definition": "Absolute; utter; sheer",
            "pos": "adjective",
            "sent1": "The pure joy of winning the game was overwhelming.",
            "sent2": "The pure beauty of the sunset took her breath away.",
            "sent3": "His pure determination to succeed was inspiring.",
            "sent4": "The pure silence of the desert was eerie.",
            "sent5": "The pure happiness in her smile was contagious."
        }
    ]
}