{
    "term": "purgatorial",
    "meanings": [
        {
            "definition": "Relating to or characteristic of purgatory.",
            "pos": "adjective",
            "sent1": "The dark, purgatorial atmosphere of the haunted house sent shivers down my spine.",
            "sent2": "The eerie silence in the cemetery had a purgatorial feel to it.",
            "sent3": "The purgatorial wait for the bus seemed never-ending.",
            "sent4": "The abandoned asylum had a purgatorial aura, as if trapped souls lingered within its walls.",
            "sent5": "The flickering candle cast a purgatorial glow on the ancient book."
        },
        {
            "definition": "Involving or resembling a state of purification or cleansing.",
            "pos": "adjective",
            "sent1": "The purgatorial process of cleaning out the clutter from the attic was exhausting.",
            "sent2": "The purgatorial rain washed away the dust and grime from the streets.",
            "sent3": "She found a strange sense of satisfaction in the purgatorial task of organizing her closet.",
            "sent4": "The purgatorial ritual of spring cleaning transformed the house into a fresh sanctuary.",
            "sent5": "The purgatorial scrubbing of the kitchen floor made it sparkle like never before."
        },
        {
            "definition": "Of or pertaining to the process of purging or cleansing.",
            "pos": "adjective",
            "sent1": "The purgatorial effects of the detox cleanse left her feeling rejuvenated.",
            "sent2": "The purgatorial diet required her to eliminate all processed foods.",
            "sent3": "He jokingly referred to his intense workout as a purgatorial punishment for indulging in too many desserts.",
            "sent4": "The purgatorial process of decluttering her home brought a sense of clarity and peace.",
            "sent5": "The purgatorial experience of fasting helped him appreciate the simple joys of a meal."
        }
    ]
}