{
    "term": "purificators",
    "meanings": [
        {
            "definition": "a small piece of linen or cotton cloth used in religious ceremonies to wipe the chalice and paten",
            "pos": "noun",
            "sent1": "During the church service, the priest carefully unfolded the purificators to clean the chalice.",
            "sent2": "The altar boy handed the purificators to the priest to wipe the chalice after communion.",
            "sent3": "The mischievous squirrel mistook the purificators for a cozy napkin and tried to snuggle in it.",
            "sent4": "Her smile was like a purificators, wiping away the worries from everyone's minds.",
            "sent5": "The purificators, soft and white, were a symbol of purity and reverence in the church."
        },
        {
            "definition": "a person or thing that purifies or cleanses",
            "pos": "noun",
            "sent1": "Grandma's homemade soup was considered a purificators for the body and soul.",
            "sent2": "The waterfall in the forest was believed to be a natural purificators by the locals.",
            "sent3": "The robot vacuum cleaner thought it was a purificators, constantly cleaning up after the messy family.",
            "sent4": "Her laughter acted as a purificators, bringing joy and lightness to everyone around her.",
            "sent5": "The purificators of forgiveness washed away the grudges and brought peace to their hearts."
        },
        {
            "definition": "a device or substance used to remove impurities or contaminants",
            "pos": "noun",
            "sent1": "The water filter in the kitchen was an essential purificators for clean drinking water.",
            "sent2": "The air purifier was a helpful purificators in removing dust and allergens from the room.",
            "sent3": "The superhero's cape seemed to act as a purificators, magically cleaning up the city streets.",
            "sent4": "Her words were like a purificators, filtering out the negativity and leaving only positivity behind.",
            "sent5": "The purificators of nature, the plants, absorbed pollutants from the air, acting as natural cleaners."
        }
    ]
}