{
    "term": "puritanical",
    "meanings": [
        {
            "definition": "Practicing or advocating strict religious or moral behavior",
            "pos": "adjective",
            "sent1": "The puritanical preacher condemned any form of entertainment in the town.",
            "sent2": "Her puritanical beliefs led her to attend church every day without fail.",
            "sent3": "The puritanical cat refused to play with any toy that wasn't made of natural materials.",
            "sent4": "His puritanical dedication to his diet made him avoid any food with even a hint of sugar.",
            "sent5": "The puritanical rules of the household forbade any form of frivolity or laughter."
        },
        {
            "definition": "Characterized by strict adherence to moral principles",
            "pos": "adjective",
            "sent1": "The puritanical community upheld their values with unwavering dedication.",
            "sent2": "His puritanical approach to honesty meant he never told a lie.",
            "sent3": "The puritanical student refused to cheat on the exam, even when tempted.",
            "sent4": "The puritanical judge's decisions were always based on his strong moral compass.",
            "sent5": "Her puritanical commitment to kindness made her a beloved figure in the neighborhood."
        },
        {
            "definition": "Excessively strict or severe in behavior or attitudes",
            "pos": "adjective",
            "sent1": "The puritanical teacher gave detention for the smallest infractions.",
            "sent2": "His puritanical views on discipline made him unpopular among his peers.",
            "sent3": "The puritanical boss expected his employees to work long hours without complaint.",
            "sent4": "Her puritanical approach to cleanliness meant the house was spotless at all times.",
            "sent5": "The puritanical coach demanded absolute obedience from his players during practice."
        }
    ]
}