{
    "term": "pushy",
    "meanings": [
        {
            "definition": "Excessively aggressive or assertive in promoting oneself or one's ideas.",
            "pos": "adjective",
            "sent1": "She was always so pushy, constantly interrupting others to share her opinions.",
            "sent2": "The salesperson was being pushy, trying to pressure customers into buying things they didn't need.",
            "sent3": "The pushy squirrel kept trying to steal the bird's food, thinking it was entitled to it.",
            "sent4": "Her pushy attitude bulldozed over everyone else's suggestions during the meeting.",
            "sent5": "The pushy car salesman wouldn't take no for an answer, following the customer around the lot."
        },
        {
            "definition": "Characterized by a forceful or insistent manner.",
            "pos": "adjective",
            "sent1": "He had a pushy way of speaking, always demanding attention from those around him.",
            "sent2": "The pushy boss expected employees to work overtime without question.",
            "sent3": "The pushy toddler insisted on having the biggest toy in the room, causing a commotion.",
            "sent4": "Her pushy behavior made it difficult for others to express their own opinions.",
            "sent5": "The pushy neighbor would often barge into conversations, making everyone uncomfortable."
        },
        {
            "definition": "Tending to push or thrust forcefully.",
            "pos": "adjective",
            "sent1": "The pushy door wouldn't stay closed, constantly swinging open with a loud creak.",
            "sent2": "The pushy waves crashed against the shore, eroding the sand over time.",
            "sent3": "The pushy wind blew the hat right off his head, sending it tumbling down the street.",
            "sent4": "The pushy child kept shoving the toy into the other's hands, wanting them to play with it.",
            "sent5": "The pushy automatic door slid open abruptly, startling the unsuspecting visitor."
        }
    ]
}