{
    "term": "pushdown",
    "meanings": [
        {
            "definition": "A downward force or pressure.",
            "pos": "noun",
            "sent1": "The heavy box required a strong pushdown to move it.",
            "sent2": "The pushdown of the weight on the scale showed the exact measurement.",
            "sent3": "The pushdown of the rain on the umbrella made a soothing sound.",
            "sent4": "The pushdown of emotions overwhelmed her like a tidal wave.",
            "sent5": "The pushdown of the hammer on the nail echoed in the room."
        },
        {
            "definition": "A type of mechanical device used to push something down.",
            "pos": "noun",
            "sent1": "The pushdown in the car engine helped regulate the airflow.",
            "sent2": "She used the pushdown on the toaster to make her toast crispy.",
            "sent3": "The pushdown on the button activated the machine with a beep.",
            "sent4": "The pushdown of the lever released the trapdoor with a click.",
            "sent5": "The pushdown of the handle locked the door securely."
        },
        {
            "definition": "A decrease in value or level.",
            "pos": "noun",
            "sent1": "The pushdown in the stock market affected many investors.",
            "sent2": "The pushdown in temperature signaled the arrival of winter.",
            "sent3": "The pushdown in prices at the store made her smile with joy.",
            "sent4": "The pushdown in morale among the team was concerning.",
            "sent5": "The pushdown in energy levels made her feel tired and drained."
        },
        {
            "definition": "The act of moving something downward with force.",
            "pos": "noun",
            "sent1": "With a quick pushdown, he closed the stubborn drawer.",
            "sent2": "The pushdown of the lever released the trapdoor with a click.",
            "sent3": "She gave the pushdown on the seesaw to lift her friend up high.",
            "sent4": "The pushdown of the button activated the fireworks display.",
            "sent5": "The pushdown of the pedal accelerated the bike down the hill."
        }
    ]
}