{
    "term": "pylon",
    "meanings": [
        {
            "definition": "A tall vertical structure used to support overhead power lines.",
            "pos": "noun",
            "sent1": "The pylon stood tall against the sky, holding up the power lines.",
            "sent2": "Drivers passed by the pylon as they traveled along the highway.",
            "sent3": "The birds perched on the pylon, pretending to be kings of the world.",
            "sent4": "The pylon loomed like a giant guardian over the city, protecting it with its strength.",
            "sent5": "In the storm, the lightning struck the pylon, lighting up the night with a fierce glow."
        },
        {
            "definition": "A marking post or tower at the side of a road or alongside a body of water.",
            "pos": "noun",
            "sent1": "The pylon by the river guided the boats safely along the water.",
            "sent2": "The road workers painted the pylon with bright colors for visibility.",
            "sent3": "The mischievous kids played hide-and-seek around the pylon, giggling with joy.",
            "sent4": "The pylon at the edge of the road stood like a silent sentinel, watching over the passing cars.",
            "sent5": "The sunset painted the pylon in hues of orange and pink, creating a beautiful scene by the lake."
        },
        {
            "definition": "A structure used to mark the turning point in a race.",
            "pos": "noun",
            "sent1": "The athletes sprinted towards the pylon, eager to reach the finish line.",
            "sent2": "Spectators cheered as the runners circled the pylon in the final lap.",
            "sent3": "The playful dog ran circles around the pylon, thinking it was a new friend.",
            "sent4": "The pylon at the race track symbolized the moment of victory, inspiring the competitors.",
            "sent5": "As the runners approached the pylon, the crowd erupted in excitement, urging them on to the end."
        }
    ]
}