{
    "term": "pyramids",
    "meanings": [
        {
            "definition": "A monumental structure with a square or triangular base and sloping sides that meet at a point.",
            "pos": "noun",
            "sent1": "The ancient Egyptians built impressive pyramids as tombs for their pharaohs.",
            "sent2": "Tourists from around the world visit the famous pyramids in Egypt.",
            "sent3": "I tried stacking my toys to make a tiny pyramid, but it kept falling over.",
            "sent4": "Her achievements in the company formed the foundation of the corporate pyramid.",
            "sent5": "The towering pyramids against the desert backdrop were a breathtaking sight."
        },
        {
            "definition": "A solid figure with a polygonal base and triangular faces that meet at a point.",
            "pos": "noun",
            "sent1": "The children constructed pyramids with building blocks during playtime.",
            "sent2": "The chef skillfully crafted a delicate chocolate pyramid for the dessert.",
            "sent3": "The stack of books on the table looked like a messy pyramid waiting to topple.",
            "sent4": "The mountain peak resembled a natural pyramid against the clear blue sky.",
            "sent5": "The glass pyramid on the city square shimmered in the sunlight."
        },
        {
            "definition": "A group or hierarchy of levels, stages, or categories arranged in a pyramid shape.",
            "pos": "noun",
            "sent1": "The corporate structure followed a strict pyramid with the CEO at the top.",
            "sent2": "In school, the students were organized in a pyramid based on their academic performance.",
            "sent3": "The pyramid of snacks at the party disappeared within minutes.",
            "sent4": "The social media influencer's followers formed a pyramid of engagement levels.",
            "sent5": "The age group distribution formed a population pyramid in the demographic study."
        }
    ]
}