{
    "term": "pyres",
    "meanings": [
        {
            "definition": "A heap of combustibles for burning a dead body as a funeral rite.",
            "pos": "noun",
            "sent1": "The villagers gathered around the pyres to bid farewell to their loved ones.",
            "sent2": "The funeral procession solemnly approached the pyres where the deceased would be cremated.",
            "sent3": "As the pyres crackled with flames, the mourners shared stories of the departed.",
            "sent4": "The pyres stood tall like silent sentinels, carrying the spirits of the departed to the heavens.",
            "sent5": "The flickering flames of the pyres painted the night sky with an orange glow."
        },
        {
            "definition": "A pile of wood or other combustible material for burning a corpse as a funeral rite.",
            "pos": "noun",
            "sent1": "The pyres were carefully constructed to ensure a proper cremation ceremony.",
            "sent2": "The crackling sound of the pyres echoed through the night as the funeral rites began.",
            "sent3": "The mischievous children played hide-and-seek around the pyres, unaware of their significance.",
            "sent4": "The pyres blazed brightly, sending smoke signals to the ancestors in the sky.",
            "sent5": "The warmth of the pyres comforted the grieving family members in the cold night."
        },
        {
            "definition": "A pile of combustible materials for burning a dead body as a funeral rite.",
            "pos": "noun",
            "sent1": "The pyres were lit at dusk, marking the beginning of the sacred funeral ceremony.",
            "sent2": "The villagers gathered dry branches and leaves to build the pyres for the cremation.",
            "sent3": "The crackling of the pyres sounded like a chorus of tiny fireworks celebrating a life well-lived.",
            "sent4": "The flames of the pyres danced in the wind, carrying the soul of the departed on their journey.",
            "sent5": "The glow of the pyres illuminated the faces of the mourners, reflecting both sorrow and acceptance."
        }
    ]
}