{
    "term": "pyrethrums",
    "meanings": [
        {
            "definition": "A type of flower used for insect repellent.",
            "pos": "noun",
            "sent1": "The garden was filled with beautiful pyrethrums that kept the bugs away.",
            "sent2": "Farmers plant pyrethrums around their crops to protect them from pests.",
            "sent3": "The mischievous squirrel wore a tiny hat made of pyrethrums to keep insects away.",
            "sent4": "Her laughter was like a field of pyrethrums, driving away all worries.",
            "sent5": "The aroma of pyrethrums in bloom was a natural shield against mosquitoes."
        },
        {
            "definition": "The dried flower heads of certain chrysanthemums, used as an insecticide.",
            "pos": "noun",
            "sent1": "The store sold bags of dried pyrethrums for natural pest control.",
            "sent2": "The farmer sprinkled crushed pyrethrums around the barn to keep insects at bay.",
            "sent3": "The magician's hat was filled with pyrethrums, making bugs disappear with a wave.",
            "sent4": "Her words were like pyrethrums, repelling negativity effortlessly.",
            "sent5": "The field shimmered with the silver glow of pyrethrums, a silent protector against pests."
        },
        {
            "definition": "A substance derived from the dried flower heads of certain chrysanthemums, used as an insecticide.",
            "pos": "noun",
            "sent1": "The organic pyrethrums spray was safe for pets and effective against bugs.",
            "sent2": "The scientist studied the chemical composition of pyrethrums for a new insect repellent.",
            "sent3": "The chef sprinkled powdered pyrethrums on the cake to keep flies away from the dessert table.",
            "sent4": "His smile was a natural pyrethrums, warding off any negative vibes around him.",
            "sent5": "The air was filled with the scent of pyrethrums, a fragrant shield against unwanted guests."
        }
    ]
}