{
    "term": "pyrethrins",
    "meanings": [
        {
            "definition": "A natural insecticide derived from chrysanthemum flowers.",
            "pos": "noun",
            "sent1": "The gardeners sprayed pyrethrins to protect their plants from bugs.",
            "sent2": "Farmers use pyrethrins to keep insects away from their crops.",
            "sent3": "The mischievous squirrels thought the pyrethrins were a new type of flower food.",
            "sent4": "The pyrethrins acted like a shield, repelling all unwanted pests from the garden.",
            "sent5": "The sweet scent of pyrethrins filled the air, warding off any insects that dared to come close."
        },
        {
            "definition": "A group of organic compounds found in certain plants, used for pest control.",
            "pos": "noun",
            "sent1": "Researchers are studying the effectiveness of different plants' pyrethrins in repelling insects.",
            "sent2": "The company developed a new pesticide using pyrethrins as the main ingredient.",
            "sent3": "The pyrethrins in the garden seemed to have a secret meeting, plotting against the bugs.",
            "sent4": "Her words were like pyrethrins, driving away any doubts that lingered in his mind.",
            "sent5": "The pyrethrins' power to deter pests amazed the farmers, leading to a bountiful harvest."
        },
        {
            "definition": "The active ingredient in many insect repellents.",
            "pos": "noun",
            "sent1": "Before going camping, make sure to apply insect repellent with pyrethrins to avoid bites.",
            "sent2": "The hikers sprayed themselves with a pyrethrins-based repellent to keep mosquitoes at bay.",
            "sent3": "The mosquitoes, after encountering pyrethrins, decided to find a different picnic to bother.",
            "sent4": "Her determination was like pyrethrins, keeping negativity away from her goals.",
            "sent5": "The pyrethrins in the spray formed an invisible barrier, protecting the campers from insect intruders."
        }
    ]
}