{
    "term": "pyrolyzes",
    "meanings": [
        {
            "definition": "to decompose or transform a material by heating it in the absence of oxygen.",
            "pos": "verb",
            "sent1": "When you heat wood without oxygen, it pyrolyzes and turns into charcoal.",
            "sent2": "During the experiment, the scientist observed how the plastic pyrolyzes under extreme heat.",
            "sent3": "The marshmallow accidentally pyrolyzed over the campfire, creating a gooey mess.",
            "sent4": "The old documents pyrolyzed in the scorching sun, fading away into history.",
            "sent5": "The artist used a blowtorch to pyrolyze the metal sculpture, giving it a unique texture."
        },
        {
            "definition": "undergoes a chemical change due to high temperatures.",
            "pos": "verb",
            "sent1": "The ice cube slowly pyrolyzes in the warm room, turning into water.",
            "sent2": "The candle wax pyrolyzes when exposed to the flame, releasing a pleasant scent.",
            "sent3": "The chocolate bar accidentally pyrolyzed in the car, creating a sticky mess.",
            "sent4": "The plastic bottle pyrolyzed under the intense heat of the sun, deforming its shape.",
            "sent5": "The metal wire pyrolyzes when heated, changing its properties for electrical conductivity."
        },
        {
            "definition": "breaks down into simpler substances through heating.",
            "pos": "verb",
            "sent1": "The sugar pyrolyzes when caramelizing, transforming into a golden syrup.",
            "sent2": "The organic matter pyrolyzes in the compost pile, turning into nutrient-rich soil.",
            "sent3": "The plastic bag accidentally pyrolyzed in the microwave, emitting a strong odor.",
            "sent4": "The wood pyrolyzed in the fire, releasing fragrant smoke into the air.",
            "sent5": "The chemical compound pyrolyzes when exposed to heat, producing different compounds."
        }
    ]
}