{
    "term": "pyros",
    "meanings": [
        {
            "definition": "A combining form meaning “fire,” “heat,” “high temperature,” used in the formation of compound words.",
            "pos": "noun",
            "sent1": "The campers gathered around the pyros to warm themselves by the fire.",
            "sent2": "The firefighter bravely faced the pyros to save the trapped cat.",
            "sent3": "The chef skillfully handled the pyros to cook the perfect marshmallows.",
            "sent4": "The sunset painted the sky with vibrant pyros, creating a breathtaking view.",
            "sent5": "The dragon's breath unleashed a torrent of blazing pyros upon the village."
        },
        {
            "definition": "A person who has a compulsion to set things on fire.",
            "pos": "noun",
            "sent1": "The pyros in the movie couldn't resist lighting matches everywhere.",
            "sent2": "The authorities were on high alert for any signs of the pyros in the area.",
            "sent3": "The pyros accidentally set off the fire alarm while trying to cook dinner.",
            "sent4": "The pyros' eyes gleamed with excitement as they watched the flames dance.",
            "sent5": "The pyros' passion for fire was both dangerous and fascinating to onlookers."
        },
        {
            "definition": "A substance that ignites spontaneously when exposed to air.",
            "pos": "noun",
            "sent1": "The scientists studied the properties of the pyros to understand its behavior.",
            "sent2": "The warehouse stored the pyros carefully to prevent any accidental fires.",
            "sent3": "The pyros caused quite a commotion when it unexpectedly burst into flames.",
            "sent4": "The pyros' reaction with oxygen was so rapid, it amazed the researchers.",
            "sent5": "The pyros' ability to ignite instantly made it a valuable tool in emergency situations."
        }
    ]
}