{
    "term": "quadrupole",
    "meanings": [
        {
            "definition": "A type of magnet with four poles",
            "pos": "noun",
            "sent1": "The quadrupole magnet helped steer the particles in the experiment.",
            "sent2": "The scientist studied the behavior of the quadrupole magnet in the lab.",
            "sent3": "When the quadrupole magnet went on strike, the particles went haywire!",
            "sent4": "Her mind was like a quadrupole magnet, attracting both positive and negative thoughts.",
            "sent5": "The quadrupole magnet hummed softly as it worked its magic on the particles."
        },
        {
            "definition": "A molecule with four poles",
            "pos": "noun",
            "sent1": "The quadrupole molecule showed unique properties under the microscope.",
            "sent2": "Chemists analyzed the structure of the quadrupole molecule in the lab.",
            "sent3": "The quadrupole molecule threw a party for its polar friends.",
            "sent4": "In her story, emotions swirled around him like a quadrupole molecule.",
            "sent5": "The quadrupole molecule stood out among its single-poled peers."
        },
        {
            "definition": "A type of mass spectrometer with four rods",
            "pos": "noun",
            "sent1": "The quadrupole mass spectrometer detected the presence of rare elements.",
            "sent2": "Researchers calibrated the quadrupole mass spectrometer for accurate readings.",
            "sent3": "The quadrupole mass spectrometer challenged the other instruments to a race.",
            "sent4": "His eyes scanned the room like a quadrupole mass spectrometer, searching for any anomalies.",
            "sent5": "The quadrupole mass spectrometer buzzed with activity as it analyzed the samples."
        },
        {
            "definition": "A type of ion trap with four electrodes",
            "pos": "noun",
            "sent1": "The quadrupole ion trap captured ions for further analysis.",
            "sent2": "Scientists fine-tuned the quadrupole ion trap to improve its efficiency.",
            "sent3": "The quadrupole ion trap played hide-and-seek with the ions.",
            "sent4": "Her smile acted like a quadrupole ion trap, drawing people in with its charm.",
            "sent5": "The quadrupole ion trap emitted a soft glow as it trapped the charged particles."
        }
    ]
}