{
    "term": "quadrupoles",
    "meanings": [
        {
            "definition": "A group or set of four poles or points.",
            "pos": "noun",
            "sent1": "The children arranged the quadrupoles in a square formation during the game.",
            "sent2": "The construction workers used quadrupoles to mark the corners of the building foundation.",
            "sent3": "The quadrupoles at the park formed a perfect square, making it easy for visitors to navigate.",
            "sent4": "Her house was like a compass, with each room acting as a quadrupole pointing in a different direction.",
            "sent5": "The quadrupoles in the garden stood tall and proud, creating a unique focal point."
        },
        {
            "definition": "A type of magnet with four poles.",
            "pos": "noun",
            "sent1": "The scientist used quadrupoles to manipulate the magnetic field in the experiment.",
            "sent2": "The quadrupoles in the lab were carefully calibrated for maximum efficiency.",
            "sent3": "When the magnets malfunctioned, the quadrupoles started attracting random objects in the room.",
            "sent4": "The quadrupoles hummed softly, creating a symphony of magnetic forces in the air.",
            "sent5": "The quadrupoles on the fridge held up multiple papers with ease, showcasing their strength."
        },
        {
            "definition": "A type of lens with four poles.",
            "pos": "noun",
            "sent1": "The camera lens had quadrupoles that allowed for precise focusing of the image.",
            "sent2": "Photographers often prefer using quadrupoles for capturing detailed shots.",
            "sent3": "The special lens with quadrupoles made everything appear four times clearer than usual.",
            "sent4": "Her glasses acted like quadrupoles, helping her see the world with enhanced clarity.",
            "sent5": "The binoculars with quadrupoles provided a unique perspective of the distant mountains."
        }
    ]
}