{
    "term": "quadruplet",
    "meanings": [
        {
            "definition": "One of four children born at the same time to the same mother.",
            "pos": "noun",
            "sent1": "The hospital celebrated the birth of a quadruplet, a baby born with three siblings at the same time.",
            "sent2": "The quadruplet siblings always had each other's backs growing up.",
            "sent3": "The quadruplet babies caused quite a stir in the maternity ward, surprising everyone with their arrival.",
            "sent4": "The quadruplet of siblings formed an unbreakable bond that lasted a lifetime.",
            "sent5": "The quadruplet's arrival brought joy and chaos to the family, but they were loved immensely."
        },
        {
            "definition": "A group or set of four similar things.",
            "pos": "noun",
            "sent1": "The store offered a discount on a quadruplet of books, perfect for book lovers.",
            "sent2": "The quadruplet of trees in the park provided a beautiful sight in all seasons.",
            "sent3": "The quadruplet of cupcakes disappeared quickly at the party, showing how popular they were.",
            "sent4": "The quadruplet of seasons brought changes in weather and nature throughout the year.",
            "sent5": "The quadruplet of puppies wagged their tails in unison, a delightful sight for onlookers."
        },
        {
            "definition": "A combination of four notes played together in music.",
            "pos": "noun",
            "sent1": "The musician played a lovely quadruplet of notes on the piano, creating a harmonious melody.",
            "sent2": "The quadruplet of musical notes added depth and richness to the song.",
            "sent3": "The quadruplet of notes danced in the air, enchanting the audience with their melody.",
            "sent4": "The quadruplet of musical tones resonated in perfect harmony, captivating all who listened.",
            "sent5": "The quadruplet of notes lingered in the room, leaving a peaceful atmosphere behind."
        }
    ]
}