{
    "term": "quadricentennial",
    "meanings": [
        {
            "definition": "A quadricentennial is a period of 400 years.",
            "pos": "noun",
            "sent1": "The town celebrated its quadricentennial with a big parade.",
            "sent2": "The country marked the quadricentennial of its independence with fireworks.",
            "sent3": "The quadricentennial of the ancient tree falling was a somber occasion.",
            "sent4": "The quadricentennial of the treaty signing felt like a distant memory.",
            "sent5": "The quadricentennial of the comet's appearance was a once-in-a-lifetime event."
        },
        {
            "definition": "A quadricentennial is a 400th anniversary.",
            "pos": "noun",
            "sent1": "We celebrated the quadricentennial of the school's founding with a special assembly.",
            "sent2": "The quadricentennial of the famous author's birth was commemorated with a new edition of their book.",
            "sent3": "The quadricentennial of the invention of the wheel was a milestone in human history.",
            "sent4": "The quadricentennial of the city's establishment was a time for reflection on its growth.",
            "sent5": "The quadricentennial of the discovery of electricity revolutionized the way we live."
        },
        {
            "definition": "A quadricentennial is an event that occurs every 400 years.",
            "pos": "noun",
            "sent1": "The comet's return was a quadricentennial event that astronomers eagerly awaited.",
            "sent2": "The quadricentennial of the rare flower blooming was a sight to behold.",
            "sent3": "The quadricentennial of the volcano erupting was a reminder of nature's power.",
            "sent4": "The quadricentennial of the solar eclipse was a celestial spectacle.",
            "sent5": "The quadricentennial of the planetary alignment was a cosmic phenomenon."
        }
    ]
}