{
    "term": "quais",
    "meanings": [
        {
            "definition": "A structure built along the edge of a body of water, used for loading and unloading ships.",
            "pos": "noun",
            "sent1": "The quais by the harbor were bustling with activity as ships docked for unloading.",
            "sent2": "The workers carried crates along the quais to the waiting ships.",
            "sent3": "The seagulls perched on the quais, hoping for a snack from the fishermen.",
            "sent4": "The quais stood like loyal guardians, guiding the ships safely to shore.",
            "sent5": "The salty breeze danced along the quais, carrying tales of distant lands."
        },
        {
            "definition": "The plural form of the word 'quai', meaning a platform or landing place at a port or harbor.",
            "pos": "noun",
            "sent1": "The sailors gathered at the quais to prepare for their voyage.",
            "sent2": "Tourists strolled along the quais, admiring the view of the harbor.",
            "sent3": "The children played hide-and-seek among the quais, giggling with delight.",
            "sent4": "The quais welcomed the ships like old friends returning home.",
            "sent5": "The lanterns lit up the quais, casting a warm glow over the harbor."
        },
        {
            "definition": "The plural form of the word 'quai', meaning a street or road along the edge of a body of water.",
            "pos": "noun",
            "sent1": "The cafes along the quais offered a perfect view of the sunset over the water.",
            "sent2": "Couples walked hand in hand along the quais, enjoying the peaceful evening.",
            "sent3": "The vendors set up stalls along the quais, selling fresh seafood to passersby.",
            "sent4": "The lights from the boats reflected on the quais, creating a magical atmosphere.",
            "sent5": "The sound of laughter echoed along the quais, blending with the gentle lapping of the waves."
        }
    ]
}