{
    "term": "quarterly",
    "meanings": [
        {
            "definition": "Occurring or produced four times a year",
            "pos": "adjective",
            "sent1": "The company's financial report is released quarterly to show its performance throughout the year.",
            "sent2": "The school holds quarterly meetings to discuss student progress and upcoming events.",
            "sent3": "I can't wait for the quarterly bake sale; I always look forward to trying new treats!",
            "sent4": "The quarterly changes in weather make it challenging to plan outdoor activities.",
            "sent5": "The quarterly exams are a good way to track your learning progress over time."
        },
        {
            "definition": "A periodical publication issued every three months",
            "pos": "noun",
            "sent1": "I enjoy reading the quarterly magazine as it provides updates on the latest fashion trends.",
            "sent2": "The library subscribes to several quarterly journals for students to access research articles.",
            "sent3": "The quarterly arrived in the mail today, and I can't wait to see what articles are featured.",
            "sent4": "The quarterly always includes a section on healthy living tips to inspire readers.",
            "sent5": "The quarterly publication covers a wide range of topics to cater to different interests."
        },
        {
            "definition": "Divided into four equal parts",
            "pos": "adjective",
            "sent1": "The quarterly budget report breaks down expenses into manageable sections for analysis.",
            "sent2": "The project timeline is divided into quarterly milestones to track progress effectively.",
            "sent3": "The cake was cut into quarterly slices so that everyone at the party could have an equal share.",
            "sent4": "The garden was designed with a quarterly layout, with each section dedicated to different types of plants.",
            "sent5": "The puzzle pieces were sorted into quarterly groups to make it easier to assemble."
        }
    ]
}