{
    "term": "quarry",
    "meanings": [
        {
            "definition": "A place, typically a large, deep pit, from which stone or other materials are or have been extracted.",
            "pos": "noun",
            "sent1": "The workers dug deep into the quarry to find valuable stones.",
            "sent2": "The quarry provided the town with building materials for years.",
            "sent3": "The mischievous kids played hide-and-seek in the abandoned quarry.",
            "sent4": "Her mind was a quarry of memories waiting to be unearthed.",
            "sent5": "The quarry echoed with the sound of pickaxes hitting rocks."
        },
        {
            "definition": "A person or animal pursued by another.",
            "pos": "noun",
            "sent1": "The deer sprinted through the forest, trying to escape the quarry.",
            "sent2": "The quarry ran as fast as he could, but the hunter was gaining on him.",
            "sent3": "The playful puppy turned the tables and became the quarry in the game of tag.",
            "sent4": "She felt like a quarry being chased by deadlines at work.",
            "sent5": "The quarry's heart raced as he heard the footsteps closing in behind him."
        },
        {
            "definition": "To extract stone or other materials from a quarry.",
            "pos": "verb",
            "sent1": "The workers quarry the rocks carefully to avoid damaging them.",
            "sent2": "They quarry limestone to use in the construction of buildings.",
            "sent3": "He tried to quarry the perfect piece of marble for his sculpture.",
            "sent4": "She could quarry memories from her childhood with remarkable clarity.",
            "sent5": "The artist quarried the clay from the riverbank to mold into pottery."
        },
        {
            "definition": "To search for or pursue something relentlessly.",
            "pos": "verb",
            "sent1": "The detective continued to quarry for clues long after others had given up.",
            "sent2": "She quarried through the old documents to find evidence of the historical event.",
            "sent3": "The cat quarried after the elusive red dot, determined to catch it.",
            "sent4": "His thoughts quarried for a solution to the complex problem.",
            "sent5": "The journalist quarried for the truth behind the mysterious disappearance."
        }
    ]
}