{
    "term": "quartersawn",
    "meanings": [
        {
            "definition": "(adjective) Cut from a log radially so that the growth rings are approximately perpendicular to the face of the board.",
            "pos": "adjective",
            "sent1": "The carpenter used quartersawn oak for the table, ensuring its durability.",
            "sent2": "The quartersawn wood displayed a beautiful pattern due to its unique cutting method.",
            "sent3": "The quartersawn planks stood proudly in the workshop, ready to be crafted into fine furniture.",
            "sent4": "The quartersawn timber whispered stories of the forest with each grain pattern.",
            "sent5": "The quartersawn lumber gleamed in the sunlight, showcasing its quality."
        },
        {
            "definition": "(verb) To saw a log into quartersawn boards.",
            "pos": "verb",
            "sent1": "The sawmill workers quartersawn the logs efficiently to maximize the wood's strength.",
            "sent2": "He decided to quartersawn the timber to create unique patterns in the finished product.",
            "sent3": "As the saw buzzed, the log was quartersawn into perfect boards for the project.",
            "sent4": "She carefully quartersawned the wood, ensuring each board was of the highest quality.",
            "sent5": "The carpenter quartersawned the oak logs with precision, readying them for use."
        },
        {
            "definition": "(noun) Wood that has been cut in a quartersawn manner.",
            "pos": "noun",
            "sent1": "The furniture maker preferred to work with quartersawn due to its stability.",
            "sent2": "The quartersawn displayed a unique grain pattern that set it apart from other cuts.",
            "sent3": "The carpenter's workshop was filled with the rich scent of quartersawn.",
            "sent4": "The table was crafted from beautiful quartersawn, showcasing the wood's quality.",
            "sent5": "The quartersawn planks were stacked neatly, awaiting their transformation into fine furniture."
        }
    ]
}