{
    "term": "quartered",
    "meanings": [
        {
            "definition": "Divided into four equal parts.",
            "pos": "adjective",
            "sent1": "The cake was cut into quartered pieces for everyone to enjoy.",
            "sent2": "The quartered pizza had a slice for each of us at the party.",
            "sent3": "The quartered sandwich looked like a delicious puzzle waiting to be solved.",
            "sent4": "The quartered field resembled a neat checkerboard from above.",
            "sent5": "The quartered apple made a perfect snack for the afternoon."
        },
        {
            "definition": "To provide lodging or accommodations for someone.",
            "pos": "verb",
            "sent1": "The innkeeper quartered the weary travelers for the night.",
            "sent2": "The hotel generously quartered the guests during the busy holiday season.",
            "sent3": "The camp counselor quartered the campers in cozy cabins for the week.",
            "sent4": "The kind neighbor quartered the visiting family in their spare room.",
            "sent5": "The landlord quartered the new tenant in the cozy apartment."
        },
        {
            "definition": "To divide or separate into four parts.",
            "pos": "verb",
            "sent1": "The teacher quartered the class into small groups for the project.",
            "sent2": "The chef quartered the ingredients before adding them to the recipe.",
            "sent3": "The gardener quartered the flowerbed to plant different blooms in each section.",
            "sent4": "The architect quartered the blueprint to show the layout of the building.",
            "sent5": "The mechanic quartered the engine to inspect each part thoroughly."
        },
        {
            "definition": "To cut or divide into four equal parts.",
            "pos": "verb",
            "sent1": "The tailor quartered the fabric to create symmetrical patterns.",
            "sent2": "The butcher quartered the meat to prepare it for cooking.",
            "sent3": "The sculptor quartered the clay to shape it into a masterpiece.",
            "sent4": "The farmer quartered the field to plant different crops in each section.",
            "sent5": "The artist quartered the canvas to paint four distinct scenes."
        }
    ]
}