{
    "term": "quintas",
    "meanings": [
        {
            "definition": "A type of rural property or estate in Portugal or Spain.",
            "pos": "noun",
            "sent1": "In Portugal, many families own beautiful quintas in the countryside.",
            "sent2": "The quintas in Spain are known for their vineyards and olive groves.",
            "sent3": "The farmer decided to turn his small quinta into a luxurious resort for tourists.",
            "sent4": "Her quinta was a peaceful sanctuary away from the bustling city life.",
            "sent5": "The old quinta had a charming rustic charm that attracted many visitors."
        },
        {
            "definition": "A unit of currency in Nicaragua, equal to one fifth of a cordoba.",
            "pos": "noun",
            "sent1": "She exchanged her dollars for quintas to use during her trip to Nicaragua.",
            "sent2": "The local market only accepted quintas as payment for fresh produce.",
            "sent3": "He accidentally paid with a handful of quintas instead of cordobas, causing confusion.",
            "sent4": "The value of quintas fluctuated with the changing economic conditions.",
            "sent5": "The shopkeeper handed back the quintas with a smile, grateful for the exact change."
        },
        {
            "definition": "A plural form of the word 'quinta', meaning a musical interval spanning five diatonic scale degrees.",
            "pos": "noun",
            "sent1": "The musicians harmonized beautifully, creating quintas that resonated throughout the hall.",
            "sent2": "The composer added a series of quintas to the melody, enhancing its depth.",
            "sent3": "The band members joked that they needed more quintas to reach the perfect harmony.",
            "sent4": "Her voice soared through the quintas, captivating the audience with its purity.",
            "sent5": "The music teacher explained the concept of quintas using simple examples from popular songs."
        }
    ]
}