{
    "term": "quins",
    "meanings": [
        {
            "definition": "A five-dollar bill",
            "pos": "noun",
            "sent1": "I found a quins in my wallet and used it to buy some candy.",
            "sent2": "The cashier handed me a quins as change for my purchase.",
            "sent3": "I accidentally dropped my quins on the ground, and a kind stranger picked it up for me.",
            "sent4": "The quins in my pocket felt like a small treasure waiting to be spent.",
            "sent5": "The shiny quins caught my eye as I reached for it to pay for my drink."
        },
        {
            "definition": "A set of five",
            "pos": "noun",
            "sent1": "She bought a quins of colorful balloons for the party.",
            "sent2": "The package contained a quins of markers in different colors.",
            "sent3": "The quins of cupcakes disappeared quickly at the school bake sale.",
            "sent4": "The quins of puppies played happily in the yard.",
            "sent5": "I counted a quins of stars in the night sky above me."
        },
        {
            "definition": "A five-pointed star",
            "pos": "noun",
            "sent1": "The children crafted a quins out of paper and glitter for the holiday decoration.",
            "sent2": "The flag proudly displayed a quins at its center.",
            "sent3": "The quins on top of the Christmas tree sparkled in the light.",
            "sent4": "She wished upon a quins for good luck.",
            "sent5": "The quins shone brightly in the night sky, guiding the lost travelers."
        },
        {
            "definition": "A five-year-old horse",
            "pos": "noun",
            "sent1": "The quins trotted gracefully around the paddock.",
            "sent2": "The farmer trained the quins for the upcoming race.",
            "sent3": "The quins nuzzled its caretaker affectionately.",
            "sent4": "The quins galloped across the field, mane flowing in the wind.",
            "sent5": "The quins won the blue ribbon at the county fair."
        }
    ]
}