{
    "term": "quixote",
    "meanings": [
        {
            "definition": "A visionary or impractical person",
            "pos": "noun",
            "sent1": "The young boy was a quixote, always dreaming of building a spaceship to explore the stars.",
            "sent2": "She admired his determination, even though others saw him as a quixote with his big ideas.",
            "sent3": "The quixote in the story believed he could fly by flapping his arms like wings.",
            "sent4": "Her brother's quixote nature led him to attempt to build a time machine out of cardboard boxes.",
            "sent5": "The image of the quixote, tilting at windmills, has become a symbol of idealism."
        },
        {
            "definition": "A person who is motivated by idealism and acts in pursuit of unreachable goals",
            "pos": "noun",
            "sent1": "Despite the challenges, she remained a quixote, striving to make the world a better place.",
            "sent2": "The quixote's relentless pursuit of justice inspired those around him.",
            "sent3": "The young activist was a quixote, fighting for causes that seemed impossible to achieve.",
            "sent4": "In a world full of cynics, she stood out as a quixote, believing in the power of kindness.",
            "sent5": "His unwavering optimism marked him as a true quixote in the eyes of his friends."
        },
        {
            "definition": "To act in a chivalrous or idealistic manner",
            "pos": "verb",
            "sent1": "He decided to quixote his way through life, always helping those in need.",
            "sent2": "She would often quixote by standing up for the underdog in any situation.",
            "sent3": "The knight vowed to quixote against injustice wherever he found it.",
            "sent4": "In the face of adversity, she chose to quixote and remain true to her values.",
            "sent5": "The teacher encouraged her students to quixote by treating others with respect and kindness."
        }
    ]
}