{
    "term": "rabatos",
    "meanings": [
        {
            "definition": "A stiffened collar or ruff worn in the 16th and 17th centuries.",
            "pos": "noun",
            "sent1": "In the play, the actor wore elaborate rabatos to portray a noble character.",
            "sent2": "During the Renaissance, rabatos were fashionable accessories among the aristocracy.",
            "sent3": "The tailor mistakenly sewed the rabatos upside down, causing a comical fashion mishap.",
            "sent4": "Her rabatos stood tall like the walls of a fortress, framing her face with grandeur.",
            "sent5": "The intricate lacework on the rabatos shimmered under the candlelight, catching everyone's eye."
        },
        {
            "definition": "A type of collar or ruff worn in the 16th and 17th centuries.",
            "pos": "noun",
            "sent1": "The portrait of the queen displayed her wearing ornate rabatos, symbolizing her status.",
            "sent2": "Artists often depicted noblemen with lavish rabatos in their paintings.",
            "sent3": "The mischievous puppy tugged on the rabatos, causing them to unravel in a playful mess.",
            "sent4": "His rabatos were like a halo around his neck, adding an air of sophistication to his attire.",
            "sent5": "The tailor meticulously crafted each rabatos, ensuring every detail was perfect for the royal event."
        },
        {
            "definition": "A stiffened collar or ruff worn in the 16th and 17th centuries.",
            "pos": "noun",
            "sent1": "The historical reenactment featured actors dressed in authentic rabatos, transporting the audience back in time.",
            "sent2": "Rabatos were a symbol of elegance and refinement during the Elizabethan era.",
            "sent3": "The mischievous squirrel stole a rabatos from the costume shop, creating a hilarious chase scene.",
            "sent4": "Her rabatos were like a shield, protecting her delicate neck from the harsh winter winds.",
            "sent5": "The tailor's skillful hands crafted the rabatos with precision, ensuring a perfect fit for the noblewoman."
        }
    ]
}