{
    "term": "races",
    "meanings": [
        {
            "definition": "A competition of speed, as in running or driving.",
            "pos": "noun",
            "sent1": "The school held a races to see who could run the fastest.",
            "sent2": "The annual marathon is a popular races in our town.",
            "sent3": "During the races, the tortoise challenged the hare to a rematch.",
            "sent4": "In the races of life, sometimes it's not about speed but endurance.",
            "sent5": "The cheers of the crowd filled the air as the runners sprinted in the races."
        },
        {
            "definition": "A group of people sharing common ancestry or physical characteristics.",
            "pos": "noun",
            "sent1": "The different races in the world have unique cultures.",
            "sent2": "She felt a sense of belonging when she found her race.",
            "sent3": "At the family reunion, all members of the race gathered for a group photo.",
            "sent4": "Despite our differences, we are all part of the human race.",
            "sent5": "The race celebrated their heritage with traditional music and dance."
        },
        {
            "definition": "To compete in a race.",
            "pos": "verb",
            "sent1": "He races in marathons to challenge himself.",
            "sent2": "The cars will race around the track for the championship.",
            "sent3": "She decided to race against the clock to finish her homework.",
            "sent4": "The siblings would often race each other to the park.",
            "sent5": "The friends agreed to race to the top of the hill for fun."
        },
        {
            "definition": "To move swiftly.",
            "pos": "verb",
            "sent1": "The wind races through the trees on a stormy night.",
            "sent2": "Time seems to race by when you're having fun.",
            "sent3": "The squirrel races up the tree to escape the chasing dog.",
            "sent4": "His heart races with excitement as he opens the gift.",
            "sent5": "The river races over the rocks, creating a soothing sound."
        }
    ]
}