{
    "term": "race",
    "meanings": [
        {
            "definition": "A competition of speed",
            "pos": "noun",
            "sent1": "The children had a fun race in the park.",
            "sent2": "The marathon is a famous race that many people participate in.",
            "sent3": "The snails decided to have a race to see who could reach the lettuce first.",
            "sent4": "Life is like a race, always moving forward.",
            "sent5": "The race between the tortoise and the hare teaches us about perseverance."
        },
        {
            "definition": "A group of people sharing common ancestry",
            "pos": "noun",
            "sent1": "My family is part of the human race.",
            "sent2": "The indigenous tribes form a unique race in this region.",
            "sent3": "It's a race to see who can trace their family tree the farthest back.",
            "sent4": "In this race, we all start from the same origin.",
            "sent5": "The race of Vikings is known for their seafaring skills."
        },
        {
            "definition": "A category of human beings based on physical characteristics",
            "pos": "noun",
            "sent1": "The doctor explained the concept of race to the students.",
            "sent2": "There are different races with diverse physical features.",
            "sent3": "It's a race to determine which group has the tallest members.",
            "sent4": "The race of people with blue eyes is becoming rarer.",
            "sent5": "The study of race helps us understand human diversity."
        },
        {
            "definition": "To compete in a race",
            "pos": "verb",
            "sent1": "She will race in the swimming competition next week.",
            "sent2": "The athletes train hard to race in the upcoming tournament.",
            "sent3": "Let's race to see who can finish their homework first.",
            "sent4": "He will race against the clock to complete the task on time.",
            "sent5": "The cars will race down the track in a thrilling competition."
        }
    ]
}