{
    "term": "rach",
    "meanings": [
        {
            "definition": "A spine or backbone.",
            "pos": "noun",
            "sent1": "The rach of the book kept the pages together.",
            "sent2": "The cat stretched its rach before curling up to sleep.",
            "sent3": "The tree's rach provided a sturdy support for the swing.",
            "sent4": "The rach of the mountain range was visible from afar.",
            "sent5": "The rach of the chair creaked as he leaned back."
        },
        {
            "definition": "A line of nerve fibers in the central nervous system.",
            "pos": "noun",
            "sent1": "The doctor studied the patient's rach for any abnormalities.",
            "sent2": "The rach in the brain helps transmit signals for movement.",
            "sent3": "The rach in the spinal cord is crucial for relaying messages to the brain.",
            "sent4": "The intricate rach of nerves resembled a complex network.",
            "sent5": "The delicate rach in the body is essential for feeling sensations."
        },
        {
            "definition": "A ridge or groove in a surface.",
            "pos": "noun",
            "sent1": "She ran her fingers along the rach of the wooden table.",
            "sent2": "The tractor left a deep rach in the field as it passed.",
            "sent3": "The sculptor carved a beautiful design into the rach of the statue.",
            "sent4": "The rach in the sand dunes created interesting patterns.",
            "sent5": "The hiker followed the rach in the trail to reach the summit."
        },
        {
            "definition": "To scold or reprimand harshly.",
            "pos": "verb",
            "sent1": "The teacher had to rach the students for misbehaving in class.",
            "sent2": "She didn't mean to rach at him, but she was frustrated.",
            "sent3": "The coach would rach at the players to push them to do better.",
            "sent4": "He felt guilty after raching at his little sister for breaking his toy.",
            "sent5": "The boss would often rach at employees for small mistakes."
        }
    ]
}