{
    "term": "racialise",
    "meanings": [
        {
            "definition": "To categorize or divide people or groups based on race.",
            "pos": "verb",
            "sent1": "In the past, some societies would racialise individuals solely based on their skin color.",
            "sent2": "It is not right to racialise people and treat them differently because of their race.",
            "sent3": "At the silly costume party, they decided to racialise everyone by assigning them colors based on their outfits.",
            "sent4": "The media often racialises crime statistics, leading to biased perceptions of different racial groups.",
            "sent5": "The teacher used a creative exercise to racialise the students into teams based on their favorite colors."
        },
        {
            "definition": "To attribute characteristics or behaviors to a particular race.",
            "pos": "verb",
            "sent1": "Some people racialise intelligence, wrongly believing certain races are smarter than others.",
            "sent2": "It is harmful to racialise negative traits to specific racial groups.",
            "sent3": "In the comedy show, they humorously racialised the ability to dance well to a specific race.",
            "sent4": "The advertisement subtly racialised success by only showing one race achieving their goals.",
            "sent5": "The author's book aimed to racialise bravery as a trait inherent in one particular race."
        },
        {
            "definition": "To make something about race or racial differences.",
            "pos": "verb",
            "sent1": "The politician tried to racialise the debate by bringing up irrelevant racial issues.",
            "sent2": "It is important not to racialise every aspect of a person's identity.",
            "sent3": "During the game, they jokingly racialised the choice of food based on each player's race.",
            "sent4": "The artist's painting subtly racialised the concept of beauty by portraying only one race as attractive.",
            "sent5": "The movie director decided to racialise the storyline by adding unnecessary racial conflicts."
        }
    ]
}