{
    "term": "racialised",
    "meanings": [
        {
            "definition": "To categorize or differentiate based on race.",
            "pos": "verb",
            "sent1": "In the past, people often racialised others without understanding the harm it caused.",
            "sent2": "The study aimed to understand how society racialised individuals in various contexts.",
            "sent3": "When the aliens landed, they racialised the different species based on their appearance.",
            "sent4": "The artist racialised the colors in the painting to represent the diversity of the community.",
            "sent5": "The teacher used a map to racialise the different regions based on their populations."
        },
        {
            "definition": "To attribute characteristics or behaviors to a particular race.",
            "pos": "verb",
            "sent1": "She racialised the group by assuming they all shared the same interests.",
            "sent2": "The media often racialises certain groups by portraying stereotypes.",
            "sent3": "The comedian racialised the animals in his jokes, giving them human-like traits.",
            "sent4": "The author racialised the characters in the story to challenge stereotypes.",
            "sent5": "The scientist racialised the behavior of the birds based on their feather colors."
        },
        {
            "definition": "To treat or view someone in a certain way based on their race.",
            "pos": "verb",
            "sent1": "The company racialised employees by offering different opportunities based on race.",
            "sent2": "It is important not to racialise individuals and instead treat everyone equally.",
            "sent3": "The children racialised their classmates by forming exclusive groups based on race.",
            "sent4": "The coach racialised the players, giving preferential treatment to certain races.",
            "sent5": "The politician racialised the voters, making promises based on race rather than policies."
        }
    ]
}