{
    "term": "racism",
    "meanings": [
        {
            "definition": "Prejudice, discrimination, or antagonism directed against someone of a different race based on the belief that one's own race is superior.",
            "pos": "noun",
            "sent1": "Racism is when someone is treated unfairly because of their race.",
            "sent2": "The community came together to fight against racism and promote equality.",
            "sent3": "At the silly costume party, the clown accused the magician of racism for wearing a top hat.",
            "sent4": "The roots of racism run deep in society, like tangled vines choking progress.",
            "sent5": "The impact of racism on individuals can be devastating, leaving scars that may never fully heal."
        },
        {
            "definition": "The belief that all members of each race possess characteristics or abilities specific to that race, especially so as to distinguish it as inferior or superior to another race.",
            "pos": "noun",
            "sent1": "Some people hold onto racism because they think certain races are better at certain things.",
            "sent2": "His speech was filled with racism, claiming one race was inherently smarter than another.",
            "sent3": "The cat's racism towards the dog was evident when it refused to share the sunny spot on the couch.",
            "sent4": "In the garden of humanity, racism is a weed that must be uprooted to let compassion bloom.",
            "sent5": "The poison of racism seeped into every interaction, poisoning even the sweetest moments with bitterness."
        },
        {
            "definition": "The belief that race accounts for differences in human character or ability and that a particular race is superior to others.",
            "pos": "noun",
            "sent1": "Racism suggests that one race is better than another based solely on skin color.",
            "sent2": "The history books are filled with examples of racism leading to tragic consequences.",
            "sent3": "The rivalry between the two sports teams was fueled by playful racism, each teasing the other about their race.",
            "sent4": "In the battle against ignorance, racism is the enemy that must be defeated for peace to prevail.",
            "sent5": "The fire of racism burns bright, but the light of understanding can extinguish it if we let it shine."
        }
    ]
}