{
    "term": "rackingly",
    "meanings": [
        {
            "definition": "In a manner that causes extreme physical or mental pain or distress.",
            "pos": "adverb",
            "sent1": "She cried rackingly as the pain in her stomach became unbearable.",
            "sent2": "The athlete pushed himself rackingly to finish the marathon despite the exhaustion.",
            "sent3": "The comedian joked rackingly about his fear of spiders, making the audience laugh.",
            "sent4": "The memories of the accident haunted her rackingly, like a relentless ghost.",
            "sent5": "The sound of her sobs echoed rackingly in the empty room, a symphony of sorrow."
        },
        {
            "definition": "In a way that is extremely difficult or challenging.",
            "pos": "adverb",
            "sent1": "He tackled the complex puzzle rackingly, trying to fit the pieces together.",
            "sent2": "The students worked rackingly to solve the math problem before the bell rang.",
            "sent3": "The hiker faced the steep mountain trail rackingly, determined to reach the summit.",
            "sent4": "Navigating through the dense forest was like moving rackingly through a maze of trees.",
            "sent5": "The writer struggled rackingly to find the right words to express his thoughts on paper."
        },
        {
            "definition": "In a manner that is characterized by intense or severe discomfort.",
            "pos": "adverb",
            "sent1": "The tight shoes pinched her feet rackingly, causing blisters to form.",
            "sent2": "The room was filled with an awkward silence that lingered rackingly.",
            "sent3": "The spicy food burned rackingly in his mouth, making him reach for water.",
            "sent4": "The tension in the air grew rackingly, like a storm brewing on the horizon.",
            "sent5": "The cold wind blew rackingly through the open window, chilling the room to the bone."
        }
    ]
}