{
    "term": "racks",
    "meanings": [
        {
            "definition": "A framework or stand for holding or displaying items",
            "pos": "noun",
            "sent1": "The store had metal racks to hold all the shoes neatly.",
            "sent2": "She placed the books on the wooden rack by the window.",
            "sent3": "The rack in the kitchen kept the pots and pans organized.",
            "sent4": "The rack in the garage stood tall like a soldier, ready to store tools.",
            "sent5": "The colorful rack in the toy store caught the children's attention immediately."
        },
        {
            "definition": "A pair of antlers on a male deer",
            "pos": "noun",
            "sent1": "The majestic deer proudly displayed its large racks in the forest.",
            "sent2": "The hunter admired the impressive racks mounted on the cabin wall.",
            "sent3": "The deer's racks looked like intricate branches growing from its head.",
            "sent4": "The sunlight glinted off the deer's racks, creating a beautiful sight.",
            "sent5": "The racks on the deer symbolized strength and grace in the wild."
        },
        {
            "definition": "To cause extreme pain or distress",
            "pos": "verb",
            "sent1": "The loud noise from the construction site racks my ears.",
            "sent2": "Seeing her cry like that really racks my heart.",
            "sent3": "His terrible singing voice could rack anyone's patience.",
            "sent4": "The thought of losing her pet racks her with worry.",
            "sent5": "The guilt of his actions racks his conscience every day."
        },
        {
            "definition": "To place in or on a rack",
            "pos": "verb",
            "sent1": "She racks the freshly baked cookies on the cooling rack.",
            "sent2": "He racks the weights neatly on the gym equipment rack.",
            "sent3": "The chef racks the spices in alphabetical order for easy access.",
            "sent4": "The librarian racks the returned books on the shelves quickly.",
            "sent5": "He racks the colorful fruits on the display rack at the market."
        }
    ]
}