{
    "term": "racket",
    "meanings": [
        {
            "definition": "A loud noise or clamor",
            "pos": "noun",
            "sent1": "The children playing outside made a racket with their laughter and shouting.",
            "sent2": "The construction site created a racket with all the machinery and tools at work.",
            "sent3": "The monkeys in the zoo started a racket by banging on their cages.",
            "sent4": "The thunderstorm outside sounded like a racket of drums in the sky.",
            "sent5": "The fireworks display ended with a racket of explosions that lit up the night sky."
        },
        {
            "definition": "A dishonest or illegal scheme",
            "pos": "noun",
            "sent1": "The scam artist was involved in a racket to cheat people out of their money.",
            "sent2": "The mafia was running a racket involving illegal gambling operations.",
            "sent3": "The group of thieves planned a racket to steal valuable paintings from the museum.",
            "sent4": "The corrupt politician was caught in a racket to embezzle public funds.",
            "sent5": "The fraudulent investment scheme turned out to be a racket that fooled many unsuspecting investors."
        },
        {
            "definition": "A type of sports equipment used in games like tennis or badminton",
            "pos": "noun",
            "sent1": "She swung her racket and hit the tennis ball over the net.",
            "sent2": "The badminton player's racket broke during the intense match.",
            "sent3": "The new racket he bought had a unique design that caught everyone's attention.",
            "sent4": "His old tennis racket was like an extension of his arm, perfectly balanced and reliable.",
            "sent5": "The professional player's racket was customized to suit his playing style and preferences."
        },
        {
            "definition": "A lively social gathering or event",
            "pos": "noun",
            "sent1": "The neighborhood block party turned into a lively racket with music and dancing.",
            "sent2": "The wedding reception was a joyful racket of laughter and celebration.",
            "sent3": "The annual festival brought together people in a colorful racket of costumes and performances.",
            "sent4": "The school carnival was a bustling racket of games, food stalls, and laughter.",
            "sent5": "The beach party became a vibrant racket of beach volleyball, bonfires, and music."
        }
    ]
}