{
    "term": "racketing",
    "meanings": [
        {
            "definition": "A loud, disturbing noise or clamor.",
            "pos": "noun",
            "sent1": "The children's racketing in the playground could be heard from far away.",
            "sent2": "The racketing of the construction work next door kept me awake all night.",
            "sent3": "The racketing of pots and pans in the kitchen signaled that dinner was almost ready.",
            "sent4": "The racketing of the thunderstorm outside made the windows shake.",
            "sent5": "The racketing of the alarm clock woke me up abruptly in the morning."
        },
        {
            "definition": "To make a loud, disturbing noise.",
            "pos": "verb",
            "sent1": "The wind racketing through the trees sounded like a ghostly whisper.",
            "sent2": "The kids racketing with their toys in the living room were having a great time.",
            "sent3": "The old car engine started racketing loudly after sitting unused for years.",
            "sent4": "The fireworks racketing in the sky painted a beautiful display of colors.",
            "sent5": "The drums racketing in the distance signaled the start of the parade."
        },
        {
            "definition": "A fraudulent scheme or illegal activity.",
            "pos": "noun",
            "sent1": "The authorities uncovered a complex racketing involving multiple businesses.",
            "sent2": "The scam artist was arrested for his involvement in a racketing operation.",
            "sent3": "The comedy movie portrayed a hilarious racketing gone wrong.",
            "sent4": "The novel's plot twist revealed a shocking racketing at the heart of the story.",
            "sent5": "The news report exposed a nationwide racketing that had deceived many people."
        },
        {
            "definition": "To engage in fraudulent schemes or illegal activities.",
            "pos": "verb",
            "sent1": "The criminals were racketing behind the scenes, planning their next move.",
            "sent2": "The group of hackers was caught racketing into sensitive government databases.",
            "sent3": "The con artists were racketing unsuspecting victims with their clever schemes.",
            "sent4": "The corrupt officials were racketing public funds for their personal gain.",
            "sent5": "The gang members were racketing in the shadows, avoiding detection by the police."
        }
    ]
}