{
    "term": "rack",
    "meanings": [
        {
            "definition": "A framework for holding and storing items",
            "pos": "noun",
            "sent1": "The metal rack in the garage keeps our tools organized.",
            "sent2": "She placed the books neatly on the wooden rack.",
            "sent3": "The rack in the pantry decided it wanted to be a shelf instead.",
            "sent4": "The rack of shelves in the store reached towards the ceiling.",
            "sent5": "The rack in the kitchen displayed a colorful array of spices."
        },
        {
            "definition": "To cause extreme pain or suffering",
            "pos": "verb",
            "sent1": "The loud noise can rack your ears if you're not careful.",
            "sent2": "The guilt of his actions began to rack his conscience.",
            "sent3": "The spicy food threatened to rack his taste buds with heat.",
            "sent4": "The suspense of the movie continued to rack her nerves.",
            "sent5": "The loss of her pet would rack her heart with sorrow."
        },
        {
            "definition": "A pair of antlers on a male deer",
            "pos": "noun",
            "sent1": "The majestic deer proudly displayed its impressive rack.",
            "sent2": "The hunter admired the size of the buck's rack.",
            "sent3": "The deer with the large rack seemed to be showing off.",
            "sent4": "The sunlight glinted off the deer's rack in the forest.",
            "sent5": "The rack of antlers on the deer was a sight to behold."
        },
        {
            "definition": "To stretch or strain something",
            "pos": "verb",
            "sent1": "She had to rack her brain to remember where she left her keys.",
            "sent2": "The athlete needed to rack his muscles before the race.",
            "sent3": "Trying to remember the answer made him rack his brain.",
            "sent4": "The tightrope walker had to rack her balance to stay upright.",
            "sent5": "He had to rack his memory to recall the details of the story."
        },
        {
            "definition": "A piece of equipment used for cooking or drying food",
            "pos": "noun",
            "sent1": "The baker placed the dough in the oven rack to bake.",
            "sent2": "She used the drying rack to hang the freshly washed clothes.",
            "sent3": "The spice rack in the kitchen decided to take a vacation.",
            "sent4": "The cooling rack allowed the cookies to cool evenly.",
            "sent5": "The rack in the kitchen held various pots and pans for cooking."
        }
    ]
}