{
    "term": "racon",
    "meanings": [
        {
            "definition": "A navigational aid consisting of a radar beacon mounted on a fixed structure.",
            "pos": "noun",
            "sent1": "The sailors relied on the racon to guide their ship safely through the foggy waters.",
            "sent2": "The lighthouse had a racon that helped ships navigate the rocky coastline.",
            "sent3": "The mischievous seagull perched on the racon, pretending to be a lookout for incoming ships.",
            "sent4": "Her smile was like a comforting racon in the stormy sea of uncertainty.",
            "sent5": "The bright red color of the racon made it easily visible from afar, like a beacon of hope."
        },
        {
            "definition": "A radar transponder used for navigation and collision avoidance.",
            "pos": "noun",
            "sent1": "The pilot activated the racon to alert nearby aircraft of their presence in the airspace.",
            "sent2": "The racon on the plane responded to the radar signals, ensuring a safe flight path.",
            "sent3": "The playful dog mistook the racon for a toy, chasing after its blinking lights.",
            "sent4": "Her laughter echoed through the room, a racon of joy in the midst of a dull meeting.",
            "sent5": "The racon beeped urgently, warning of an approaching storm and guiding the ships to safety."
        },
        {
            "definition": "To mark or indicate with a racon.",
            "pos": "verb",
            "sent1": "The captain decided to racon the dangerous rocks to prevent future shipwrecks.",
            "sent2": "She carefully raconed the path with glowing markers to guide the hikers through the forest.",
            "sent3": "The mischievous squirrel tried to racon the tree with acorns, thinking it was a treasure map.",
            "sent4": "His words raconed a path of wisdom for the young students to follow in their journey of learning.",
            "sent5": "The artist raconed the canvas with vibrant colors, creating a masterpiece that captured everyone's attention."
        }
    ]
}