{
    "term": "radars",
    "meanings": [
        {
            "definition": "A system for detecting the presence, direction, distance, and speed of aircraft, ships, and other objects, by sending out pulses of high-frequency electromagnetic waves that are reflected off the object back to the source.",
            "pos": "noun",
            "sent1": "The radars on the ship helped the crew spot nearby vessels.",
            "sent2": "The military base installed new radars to monitor the airspace.",
            "sent3": "The radars at the airport played a game of 'hide and seek' with the incoming planes.",
            "sent4": "Her intuition acted like radars, sensing danger before it approached.",
            "sent5": "The radars hummed softly, scanning the horizon for any signs of danger."
        },
        {
            "definition": "The equipment used in radar.",
            "pos": "noun",
            "sent1": "The technician carefully calibrated the radars before the mission.",
            "sent2": "The radars were essential tools for tracking weather patterns.",
            "sent3": "The radars in the lab seemed to have a mind of their own, beeping randomly.",
            "sent4": "His eyes were like radars, constantly scanning the room for any movement.",
            "sent5": "The radars gleamed in the sunlight, a symbol of advanced technology."
        },
        {
            "definition": "The ability to detect or be detected by radar.",
            "pos": "noun",
            "sent1": "The stealth aircraft had a special coating to evade radars.",
            "sent2": "Birds use their keen sense of hearing as natural radars to avoid collisions.",
            "sent3": "The cat's whiskers acted like radars, alerting it to any nearby movement.",
            "sent4": "Her smile was like a radar, instantly drawing attention in a crowded room.",
            "sent5": "The radars of the security system picked up the slightest motion in the dark."
        }
    ]
}