{
    "term": "radiological",
    "meanings": [
        {
            "definition": "Relating to or using radiation, especially X-rays.",
            "pos": "adjective",
            "sent1": "The radiological report showed a clear image of the broken bone.",
            "sent2": "The hospital has advanced radiological equipment for diagnosing illnesses.",
            "sent3": "The radiological technician accidentally turned into a glowing superhero after exposure to X-rays.",
            "sent4": "Her smile was as bright as a radiological scan, lighting up the room.",
            "sent5": "The radiological glow of the sunset painted the sky in vibrant colors."
        },
        {
            "definition": "Involving the use of radiology for medical imaging.",
            "pos": "adjective",
            "sent1": "The radiological department at the hospital is always busy with patients.",
            "sent2": "Doctors rely on radiological tests to accurately diagnose various conditions.",
            "sent3": "The radiological team had a contest to see who could take the most creative X-ray.",
            "sent4": "Her mind was a radiological machine, processing images with precision.",
            "sent5": "The radiological images revealed the hidden secrets of the body's inner workings."
        },
        {
            "definition": "Pertaining to the study or treatment of diseases using radiation.",
            "pos": "adjective",
            "sent1": "The radiological oncologist specializes in treating cancer with radiation therapy.",
            "sent2": "Researchers are constantly improving radiological techniques to combat diseases.",
            "sent3": "The radiological lab mice glowed in the dark after the experiment.",
            "sent4": "His words were like radiological beams, targeting the heart of the issue.",
            "sent5": "The radiological treatment successfully shrunk the tumor without surgery."
        }
    ]
}