{
    "term": "radiosurgeries",
    "meanings": [
        {
            "definition": "The use of radiation therapy to treat tumors and other medical conditions.",
            "pos": "noun",
            "sent1": "Radiosurgeries are often used to target cancer cells with precision.",
            "sent2": "The hospital offers radiosurgeries as a treatment option for patients with brain tumors.",
            "sent3": "During the superhero's battle, his secret weapon was the power of radiosurgeries to defeat the alien invaders.",
            "sent4": "Her kindness acted like radiosurgeries, healing the emotional wounds of those around her.",
            "sent5": "The doctor's skill in radiosurgeries saved countless lives during the outbreak."
        },
        {
            "definition": "The process of performing surgery using radiation as a tool.",
            "pos": "noun",
            "sent1": "In radiosurgeries, surgeons use radiation beams to precisely remove tumors.",
            "sent2": "The advancement of technology has made radiosurgeries a safer option for certain procedures.",
            "sent3": "The magician's trick involved performing radiosurgeries on a deck of cards to make them disappear.",
            "sent4": "Her words were like radiosurgeries, cutting through the confusion to reveal the truth.",
            "sent5": "The artist's precision in radiosurgeries transformed a blank canvas into a masterpiece."
        },
        {
            "definition": "The practice of using radiosurgery techniques in medical procedures.",
            "pos": "noun",
            "sent1": "Hospitals worldwide are adopting radiosurgeries to improve patient outcomes.",
            "sent2": "Doctors are trained in radiosurgeries to provide minimally invasive treatments.",
            "sent3": "The chef's secret recipe included a dash of radiosurgeries to enhance the flavors.",
            "sent4": "His determination was like radiosurgeries, cutting through obstacles to reach his goals.",
            "sent5": "The teacher's guidance was a beacon, leading students through the maze of radiosurgeries."
        }
    ]
}