{
    "term": "radiometers",
    "meanings": [
        {
            "definition": "A device that measures radiant energy",
            "pos": "noun",
            "sent1": "The radiometers in the lab helped scientists study sunlight.",
            "sent2": "The radiometers on the spacecraft detected the heat from the sun.",
            "sent3": "The radiometers at the beach were so accurate, they could even measure the warmth of a sandcastle.",
            "sent4": "Her passion for science was like a radiometer, always absorbing new knowledge.",
            "sent5": "The radiometers hummed softly as they recorded the energy from the stars above."
        },
        {
            "definition": "A tool used to detect and measure electromagnetic radiation",
            "pos": "noun",
            "sent1": "The radiometers in the lab beeped when they detected radiation.",
            "sent2": "Scientists use radiometers to measure the strength of radio waves.",
            "sent3": "The radiometers at the space station were so sensitive, they could even detect signals from alien radios.",
            "sent4": "Her intuition acted like a radiometer, always sensing the hidden signals around her.",
            "sent5": "The radiometers glowed brightly as they picked up signals from deep space."
        },
        {
            "definition": "Instruments that determine the intensity of radiation",
            "pos": "noun",
            "sent1": "The radiometers displayed the high intensity of the radiation in the room.",
            "sent2": "Radiometers are essential tools for measuring the strength of X-rays.",
            "sent3": "The radiometers at the nuclear plant were so precise, they could even measure the intensity of a single gamma ray.",
            "sent4": "His focus was like a radiometer, always pinpointing the most intense areas of a problem.",
            "sent5": "The radiometers buzzed with activity as they analyzed the radiation levels in the environment."
        }
    ]
}