{
    "term": "radioactivity",
    "meanings": [
        {
            "definition": "The emission of ionizing radiation or particles caused by the spontaneous disintegration of atomic nuclei.",
            "pos": "noun",
            "sent1": "The radioactivity from the nuclear plant was carefully monitored.",
            "sent2": "Scientists study radioactivity to understand its effects on health.",
            "sent3": "The party theme was 'glow in the dark' due to the radioactivity of the decorations.",
            "sent4": "Her enthusiasm for the project was like radioactivity, spreading to everyone around her.",
            "sent5": "The eerie glow of radioactivity illuminated the abandoned laboratory."
        },
        {
            "definition": "The property or phenomenon of being radioactive.",
            "pos": "noun",
            "sent1": "The danger of radioactivity in the area forced residents to evacuate.",
            "sent2": "The radioactivity of the substance was detected using a Geiger counter.",
            "sent3": "The cat's playful behavior had a hint of radioactivity, making it impossible to ignore.",
            "sent4": "The excitement in the room was like radioactivity, electrifying the atmosphere.",
            "sent5": "The radioactivity of the material made it glow ominously in the dark."
        },
        {
            "definition": "The process by which certain unstable atomic nuclei lose energy by emitting radiation.",
            "pos": "noun",
            "sent1": "Understanding radioactivity is crucial in nuclear physics.",
            "sent2": "The decay of radioactive elements is a natural process.",
            "sent3": "The comedian's jokes had a level of radioactivity that left the audience laughing uncontrollably.",
            "sent4": "The news of the scandal spread through the office like radioactivity, causing chaos.",
            "sent5": "The radioactivity of the substance was evident in the glowing test tube."
        }
    ]
}