{
    "term": "radiation",
    "meanings": [
        {
            "definition": "The process in which energy is emitted as particles or waves",
            "pos": "noun",
            "sent1": "The radiation from the sun warms the Earth.",
            "sent2": "Doctors use radiation to treat cancer patients.",
            "sent3": "The radiation from the microwave made the popcorn pop!",
            "sent4": "Her smile was like radiation, spreading joy to everyone around her.",
            "sent5": "The radiation emitted by the fireflies lit up the night sky."
        },
        {
            "definition": "The energy that is radiated or transmitted in the form of rays, waves, or particles",
            "pos": "noun",
            "sent1": "The radiation from the heater kept the room warm.",
            "sent2": "The radiation from the nuclear reactor can be dangerous if not controlled.",
            "sent3": "The radiation from the TV remote magically changed the channel.",
            "sent4": "His kindness was like radiation, spreading positivity to all.",
            "sent5": "The radiation of love filled the room with warmth and happiness."
        },
        {
            "definition": "The act or process of radiating",
            "pos": "noun",
            "sent1": "The radiation of heat from the fire felt comforting.",
            "sent2": "The radiation of light from the lamp illuminated the room.",
            "sent3": "The radiation of laughter from the comedy show was contagious.",
            "sent4": "Her confidence was like radiation, shining brightly for all to see.",
            "sent5": "The radiation of excitement in the air was palpable before the concert."
        },
        {
            "definition": "The emission of energy as electromagnetic waves or as moving subatomic particles, especially high-energy particles that cause ionization",
            "pos": "noun",
            "sent1": "The radiation from the nuclear power plant can be harmful if not contained.",
            "sent2": "The radiation from the X-ray machine helps doctors see inside the body.",
            "sent3": "The radiation from the glowing stars in the sky was mesmerizing.",
            "sent4": "His anger was like radiation, causing tension in the room.",
            "sent5": "The radiation of creativity sparked new ideas in the team meeting."
        }
    ]
}