{
    "term": "radioactivities",
    "meanings": [
        {
            "definition": "The emission of ionizing radiation or particles caused by the decay of atomic nuclei.",
            "pos": "noun",
            "sent1": "Scientists study radioactivities to understand how radiation is released from atomic nuclei.",
            "sent2": "The Geiger counter measures radioactivities in the laboratory.",
            "sent3": "The radioactive cat accidentally caused a spike in radioactivities in the room.",
            "sent4": "The radioactivities in the old building were like whispers of danger echoing through the walls.",
            "sent5": "The glowing substance revealed the presence of radioactivities in the dark."
        },
        {
            "definition": "The property of being radioactive.",
            "pos": "noun",
            "sent1": "The radioactivities of the material made it unsafe for human contact.",
            "sent2": "The scientist analyzed the radioactivities of the rock sample.",
            "sent3": "The radioactivities of the banana surprised the students in the science class.",
            "sent4": "The radioactivities of the area were so high that it glowed like a forbidden treasure.",
            "sent5": "The warning sign indicated the presence of radioactivities in the vicinity."
        },
        {
            "definition": "The process of emitting radiation.",
            "pos": "noun",
            "sent1": "Understanding the radioactivities of the sun helps in predicting solar flares.",
            "sent2": "The radioactivities from the reactor were carefully monitored by the technicians.",
            "sent3": "The radioactivities of the firefly fascinated the children in the park.",
            "sent4": "The radioactivities of the volcano were like a fiery dance of danger.",
            "sent5": "The protective suit shielded the worker from harmful radioactivities during the cleanup."
        }
    ]
}