{
    "term": "radiated",
    "meanings": [
        {
            "definition": "Emitting energy in the form of waves or particles",
            "pos": "adjective",
            "sent1": "The warm sun felt radiated on my skin.",
            "sent2": "The radiated heat from the fire kept us warm.",
            "sent3": "The radiated glow of the fireflies lit up the night.",
            "sent4": "Her smile radiated happiness like a bright light.",
            "sent5": "The radiated energy from the sun made the plants grow."
        },
        {
            "definition": "Spread out from a central point",
            "pos": "verb",
            "sent1": "The sound radiated from the speaker in all directions.",
            "sent2": "The smell of fresh bread radiated from the bakery.",
            "sent3": "Laughter radiated from the classroom, making everyone smile.",
            "sent4": "Hope radiated from her words, filling the room with positivity.",
            "sent5": "The news of the victory radiated through the town, spreading joy."
        },
        {
            "definition": "Displaying a glowing or bright light",
            "pos": "adjective",
            "sent1": "The radiated stars shone brightly in the night sky.",
            "sent2": "The radiated moonlight illuminated the path ahead.",
            "sent3": "The radiated lanterns lit up the garden beautifully.",
            "sent4": "Her radiated smile brightened up the room.",
            "sent5": "The radiated fireworks painted the sky with colors."
        },
        {
            "definition": "Projecting or sending out in all directions",
            "pos": "adjective",
            "sent1": "The radiated sound filled the room with music.",
            "sent2": "The radiated scent of flowers perfumed the air.",
            "sent3": "His radiated enthusiasm was contagious to everyone around.",
            "sent4": "The radiated joy in her eyes was infectious.",
            "sent5": "The radiated energy of the crowd fueled the team to victory."
        }
    ]
}