{
    "term": "raffles",
    "meanings": [
        {
            "definition": "A type of lottery where people buy tickets for a chance to win a prize.",
            "pos": "noun",
            "sent1": "At the school fair, they organized a raffles to raise money for charity.",
            "sent2": "My neighbor won the grand prize in the raffles at the community event.",
            "sent3": "The raffles at the fundraiser had everyone excited to see who would win.",
            "sent4": "Participating in the raffles felt like a thrilling adventure with a surprise waiting at the end.",
            "sent5": "The colorful tickets for the raffles fluttered in the air, creating an atmosphere of anticipation."
        },
        {
            "definition": "To conduct a raffle.",
            "pos": "verb",
            "sent1": "The school principal raffles off a new bicycle every year during the assembly.",
            "sent2": "She raffles the gift baskets at the event with enthusiasm and a big smile.",
            "sent3": "He raffles quickly and efficiently, making sure everyone has a fair chance to win.",
            "sent4": "The magician raffles off a mysterious box, adding an element of surprise to the show.",
            "sent5": "The auctioneer raffles the rare painting to a lucky bidder, creating an exciting moment for all."
        },
        {
            "definition": "A game of chance where players draw tickets to determine a winner.",
            "pos": "noun",
            "sent1": "The raffles at the carnival had children eagerly waiting to see if they would win a prize.",
            "sent2": "In the raffles at the party, everyone hoped to draw the lucky ticket for the grand prize.",
            "sent3": "The raffles at the family reunion turned into a fun competition among relatives.",
            "sent4": "Playing the raffles felt like being on a rollercoaster of excitement and anticipation.",
            "sent5": "The atmosphere at the raffles was filled with cheers and laughter as winners were announced."
        }
    ]
}