{
    "term": "rage",
    "meanings": [
        {
            "definition": "Violent, uncontrollable anger",
            "pos": "noun",
            "sent1": "Her face turned red with rage when she found out she had been lied to.",
            "sent2": "The man's eyes were filled with rage as he shouted at the top of his lungs.",
            "sent3": "Despite her rage, she couldn't help but laugh at the silly mistake.",
            "sent4": "The storm outside matched the rage brewing inside him.",
            "sent5": "The rage in his heart burned brighter than a thousand suns."
        },
        {
            "definition": "A fit of intense anger",
            "pos": "noun",
            "sent1": "After losing the game, he threw a rage and slammed the controller down.",
            "sent2": "She experienced a sudden rage when she realized her phone was missing.",
            "sent3": "His rage over losing the bet was so dramatic, it was almost comical.",
            "sent4": "The rage in her voice was like a thunderclap in the silent room.",
            "sent5": "The child's rage was like a storm passing through the house."
        },
        {
            "definition": "To speak or act with great anger",
            "pos": "verb",
            "sent1": "He began to rage at the unfairness of the situation, his words sharp and cutting.",
            "sent2": "The customer started to rage at the poor service he received at the restaurant.",
            "sent3": "She would often rage about the smallest inconveniences, much to the amusement of her friends.",
            "sent4": "The fire raged through the forest, consuming everything in its path.",
            "sent5": "His anger raged like a wildfire, spreading quickly and uncontrollably."
        },
        {
            "definition": "To move violently or uncontrollably",
            "pos": "verb",
            "sent1": "The waves raged against the shore, crashing with immense power.",
            "sent2": "The wind raged through the trees, causing them to sway and creak.",
            "sent3": "The fire raged through the building, leaving destruction in its wake.",
            "sent4": "The storm raged on, lightning flashing and thunder booming.",
            "sent5": "The river raged after the heavy rainfall, its waters turbulent and fierce."
        }
    ]
}