{
    "term": "ragworms",
    "meanings": [
        {
            "definition": "A type of marine worm commonly used as bait for fishing.",
            "pos": "noun",
            "sent1": "Fishermen often use ragworms as bait to catch fish.",
            "sent2": "I saw a fisherman putting a ragworm on his hook before casting it into the water.",
            "sent3": "Why did the fish refuse to bite the ragworm? Because it wanted to go on a diet!",
            "sent4": "The ragworm wriggled on the hook like a tiny dancer performing for the fish.",
            "sent5": "The squirming ragworm on the hook looked like a wiggly piece of spaghetti."
        },
        {
            "definition": "Small, slender worms with bristles along their bodies.",
            "pos": "noun",
            "sent1": "The ragworms in the jar had tiny bristles that tickled my fingers.",
            "sent2": "Children love to observe the ragworms crawling on the ground with their bristles shining in the sun.",
            "sent3": "The ragworms had a party and invited all the other worms to join in the bristle dance!",
            "sent4": "The ragworm's bristles stood out like a row of soldiers ready for inspection.",
            "sent5": "The bristly ragworms felt like soft brushes when held gently in the palm of the hand."
        },
        {
            "definition": "Worms that burrow in sand or mud.",
            "pos": "noun",
            "sent1": "The ragworms disappeared into the sand as soon as I placed them on the beach.",
            "sent2": "After the rain, the ragworms emerged from their burrows in the mud, leaving tiny trails behind.",
            "sent3": "Why did the ragworms throw a party in the sand? Because they heard it was the coolest place to hang out!",
            "sent4": "The ragworms burrowed through the sand like tiny bulldozers creating underground tunnels.",
            "sent5": "The mud was alive with the wriggling of ragworms as they dug their way deeper into the earth."
        }
    ]
}