{
    "term": "rahs",
    "meanings": [
        {
            "definition": "A loud, harsh, grating noise.",
            "pos": "noun",
            "sent1": "The rahs of the thunder scared the little dog.",
            "sent2": "The car made a loud rahs as it screeched to a stop.",
            "sent3": "The rahs of the alarm clock woke me up too early.",
            "sent4": "The rahs of the chalk on the blackboard was like nails on a chalkboard.",
            "sent5": "The rahs of the fire alarm was ear-piercing and alarming."
        },
        {
            "definition": "A wild or frenzied state of mind.",
            "pos": "noun",
            "sent1": "During the game, he entered a rahs and couldn't focus.",
            "sent2": "Her mind was in a rahs of confusion after the unexpected news.",
            "sent3": "The rahs of excitement before the concert was palpable.",
            "sent4": "In the rahs of anger, he said things he later regretted.",
            "sent5": "The rahs of fear gripped her as she walked through the dark alley."
        },
        {
            "definition": "To make a harsh, grating noise.",
            "pos": "verb",
            "sent1": "The old door rahsed loudly when opened.",
            "sent2": "The rusty gate rahsed as it was pushed open.",
            "sent3": "The fork rahsed against the plate, making an unpleasant sound.",
            "sent4": "The car brakes rahsed as the driver slammed on them.",
            "sent5": "The wind rahsed through the trees, creating an eerie sound."
        },
        {
            "definition": "To act or move in a wild or frenzied manner.",
            "pos": "verb",
            "sent1": "The children rahsed around the playground, full of energy.",
            "sent2": "She rahsed through the house looking for her lost keys.",
            "sent3": "The puppy rahsed in circles chasing its tail.",
            "sent4": "The protestors rahsed through the streets, demanding change.",
            "sent5": "The dancers rahsed across the stage with passion and intensity."
        }
    ]
}