{
    "term": "rai",
    "meanings": [
        {
            "definition": "A monetary unit of Albania, equal to 100 qintars.",
            "pos": "noun",
            "sent1": "I exchanged ten rai for a new book.",
            "sent2": "The market vendor accepted rai as payment for the fruits.",
            "sent3": "The piggy bank was filled with shiny rai coins.",
            "sent4": "Her savings grew like a pile of rai under the mattress.",
            "sent5": "The sound of rai jingling in his pocket made him smile."
        },
        {
            "definition": "A traditional form of Japanese music played with a shamisen.",
            "pos": "noun",
            "sent1": "The melody of the rai filled the room with tranquility.",
            "sent2": "She learned to play the rai beautifully on the shamisen.",
            "sent3": "The cat seemed mesmerized by the soothing rai music.",
            "sent4": "The rai notes danced in the air like colorful butterflies.",
            "sent5": "Listening to the rai was like floating on a peaceful river."
        },
        {
            "definition": "A traditional dance of Samoa.",
            "pos": "noun",
            "sent1": "The energetic rai captivated the audience.",
            "sent2": "The dancers moved gracefully to the rhythm of the rai.",
            "sent3": "The rai performance brought smiles to everyone's faces.",
            "sent4": "Her feet moved as swiftly as the wind in the rai dance.",
            "sent5": "The spirit of the island was alive in the joyful rai dance."
        },
        {
            "definition": "A type of tropical bird found in Southeast Asia.",
            "pos": "noun",
            "sent1": "The colorful rai perched on the branch, chirping happily.",
            "sent2": "We spotted a rare rai during our bird-watching expedition.",
            "sent3": "The mischievous rai stole a piece of fruit from the picnic.",
            "sent4": "Her laughter echoed through the forest like the call of a rai.",
            "sent5": "The vibrant feathers of the rai shimmered in the sunlight."
        }
    ]
}