{
    "term": "railbuses",
    "meanings": [
        {
            "definition": "A railbus is a type of bus designed to run on railway tracks.",
            "pos": "noun",
            "sent1": "The railbuses traveled smoothly on the train tracks.",
            "sent2": "I took the railbus to reach the station quickly.",
            "sent3": "The railbuses on wheels chugged along the metal path.",
            "sent4": "The railbuses raced like tiny trains on the rails.",
            "sent5": "Children waved excitedly as the railbuses passed by."
        },
        {
            "definition": "Railbuses are often used for short-distance passenger transportation.",
            "pos": "noun",
            "sent1": "Many people prefer railbuses for short trips.",
            "sent2": "The railbuses stop frequently to pick up passengers.",
            "sent3": "The railbuses zipped through the city streets with ease.",
            "sent4": "Passengers enjoyed the scenic views from the railbuses.",
            "sent5": "The railbuses hummed softly as they carried passengers."
        },
        {
            "definition": "The railbuses were crowded with commuters during rush hour.",
            "pos": "noun",
            "sent1": "During rush hour, the railbuses were packed with people.",
            "sent2": "Passengers squeezed into the railbuses to get home quickly.",
            "sent3": "The railbuses resembled sardine cans during peak times.",
            "sent4": "Commuters chatted animatedly in the crowded railbuses.",
            "sent5": "The railbuses rumbled noisily as they carried the commuters."
        },
        {
            "definition": "The railbuses were equipped with comfortable seating for passengers.",
            "pos": "noun",
            "sent1": "The plush seats in the railbuses made the journey pleasant.",
            "sent2": "Passengers relaxed in the cozy railbuses during the trip.",
            "sent3": "The railbuses felt like a comfy living room on wheels.",
            "sent4": "Passengers dozed off in the soft seats of the railbuses.",
            "sent5": "The railbuses provided a smooth ride with cushioned seats."
        }
    ]
}