{
    "term": "railroad",
    "meanings": [
        {
            "definition": "A track or set of tracks made of steel rails along which trains run.",
            "pos": "noun",
            "sent1": "The railroad tracks stretched far into the distance.",
            "sent2": "The train chugged along the railroad, carrying passengers to their destination.",
            "sent3": "I dreamt of a giant squirrel running along the railroad tracks collecting acorns.",
            "sent4": "Her thoughts traveled along the railroad of memories, stopping at each station of the past.",
            "sent5": "The sound of the train whistle echoed through the valley, a lonely cry along the steel railroad tracks."
        },
        {
            "definition": "To transport or convey by railroad.",
            "pos": "verb",
            "sent1": "They decided to railroad the goods to the city for faster delivery.",
            "sent2": "The company used to railroad supplies to remote areas before the road was built.",
            "sent3": "The mischievous raccoon tried to railroad the picnic basket away from the campers.",
            "sent4": "Her words seemed to railroad him into agreeing with her, even though he had his doubts.",
            "sent5": "The excitement of the journey railroaded her thoughts, leaving no room for worries about the destination."
        },
        {
            "definition": "To force (someone) into doing something.",
            "pos": "verb",
            "sent1": "The group tried to railroad him into joining their club against his will.",
            "sent2": "She felt like her boss was trying to railroad her into working overtime again.",
            "sent3": "The mischievous kitten railroaded the dog into chasing its tail instead of napping.",
            "sent4": "The fear of failure railroaded him into making a hasty decision.",
            "sent5": "The hypnotic rhythm of the music railroaded the audience into a state of euphoria."
        }
    ]
}