{
    "term": "rainbirds",
    "meanings": [
        {
            "definition": "A device used to water lawns or gardens automatically.",
            "pos": "noun",
            "sent1": "The rainbirds in our garden turn on every morning to water the plants.",
            "sent2": "I bought a new rainbirds system to keep my lawn green during the dry season.",
            "sent3": "The mischievous squirrel thought the rainbirds were a fun toy to play with.",
            "sent4": "The rainbirds danced gracefully, showering the garden with water like a gentle rain.",
            "sent5": "The sound of the rainbirds clicking on was a soothing lullaby for the flowers."
        },
        {
            "definition": "A type of sprinkler system.",
            "pos": "noun",
            "sent1": "During summer, the rainbirds keep our lawn fresh and green.",
            "sent2": "The rainbirds in the park make the children squeal with delight as they run through them.",
            "sent3": "The rainbirds seemed to have a mind of their own, surprising everyone with their random bursts.",
            "sent4": "The rainbow appeared as the sun shone through the mist created by the rainbirds.",
            "sent5": "The rhythmic sound of the rainbirds was like a song playing in the background of our picnic."
        },
        {
            "definition": "A mechanism that releases water in a controlled manner.",
            "pos": "noun",
            "sent1": "The farmer used rainbirds to ensure each crop received the right amount of water.",
            "sent2": "The rainbirds sprayed water evenly across the field, nourishing the thirsty plants.",
            "sent3": "The mischievous cat pawed at the rainbirds, trying to catch the water droplets.",
            "sent4": "The rainbirds hummed softly as they worked, creating a peaceful atmosphere in the garden.",
            "sent5": "The garden sparkled under the sunlight as the rainbirds showered it with water."
        }
    ]
}