{
    "term": "raised",
    "meanings": [
        {
            "definition": "To lift or move to a higher position",
            "pos": "verb",
            "sent1": "She raised her hand in class to answer the question.",
            "sent2": "He raised the flag up the pole.",
            "sent3": "The cat raised its paw to bat at the toy.",
            "sent4": "The sun raised higher in the sky as the day went on.",
            "sent5": "The crane raised the heavy load effortlessly."
        },
        {
            "definition": "To cause to grow or develop",
            "pos": "verb",
            "sent1": "Watering the plants regularly raised their height.",
            "sent2": "Good nutrition can raise a child's overall health.",
            "sent3": "The magic potion raised the tiny seed into a giant tree overnight.",
            "sent4": "Her encouragement raised his confidence to new levels.",
            "sent5": "Reading books can raise your knowledge and imagination."
        },
        {
            "definition": "To increase in amount or level",
            "pos": "verb",
            "sent1": "The price of the house raised significantly after the renovations.",
            "sent2": "The temperature raised by ten degrees in just an hour.",
            "sent3": "The excitement in the room raised as the concert started.",
            "sent4": "His hard work raised his grades from a C to an A.",
            "sent5": "The noise level raised as more people joined the party."
        },
        {
            "definition": "To bring up or rear",
            "pos": "verb",
            "sent1": "She raised her children with love and care.",
            "sent2": "The orphanage raised many children who found loving families.",
            "sent3": "The farmer raised a herd of cows on his land.",
            "sent4": "The teacher raised important topics during the class discussion.",
            "sent5": "The mentor raised the young artist to fame with guidance."
        },
        {
            "definition": "To build or construct",
            "pos": "verb",
            "sent1": "The workers raised the new building in record time.",
            "sent2": "They raised a barn for the community to use.",
            "sent3": "The team raised a monument in memory of their victory.",
            "sent4": "The architect raised a beautiful structure that amazed everyone.",
            "sent5": "The volunteers raised a shelter for the homeless in the city."
        },
        {
            "definition": "To collect or gather funds",
            "pos": "verb",
            "sent1": "The charity event raised thousands of dollars for the cause.",
            "sent2": "They raised enough money to support the local school.",
            "sent3": "The bake sale raised funds for the animal shelter.",
            "sent4": "The community raised donations for the disaster relief efforts.",
            "sent5": "The marathon raised awareness and funds for cancer research."
        },
        {
            "definition": "To elevate in rank or status",
            "pos": "verb",
            "sent1": "His hard work and dedication raised him to the position of manager.",
            "sent2": "The promotion raised her status within the company.",
            "sent3": "The award ceremony raised the athletes to national recognition.",
            "sent4": "The successful project raised the team's reputation in the industry.",
            "sent5": "The royal decree raised the knight to the title of baron."
        }
    ]
}