{
    "term": "raising",
    "meanings": [
        {
            "definition": "To lift or move to a higher position",
            "pos": "verb",
            "sent1": "She is raising her hand to ask a question.",
            "sent2": "The sun is raising in the sky.",
            "sent3": "The magician is raising a rabbit out of his hat.",
            "sent4": "The crane is raising the heavy load effortlessly.",
            "sent5": "The elevator is raising us to the top floor."
        },
        {
            "definition": "To increase in amount or level",
            "pos": "verb",
            "sent1": "He is raising his grades by studying hard.",
            "sent2": "The company is raising the prices of their products.",
            "sent3": "The chef is raising the heat to make the dish spicier.",
            "sent4": "The teacher is raising the difficulty level of the test.",
            "sent5": "The farmer is raising more crops this year."
        },
        {
            "definition": "The act of bringing up or nurturing",
            "pos": "noun",
            "sent1": "Parenting involves the raising of children.",
            "sent2": "The raising of a pet requires love and care.",
            "sent3": "The raising of a plant from a seed is a rewarding process.",
            "sent4": "The raising of a family is a fulfilling experience.",
            "sent5": "The raising of awareness about a cause is important."
        },
        {
            "definition": "The act of constructing or building",
            "pos": "noun",
            "sent1": "The raising of a new house in the neighborhood is exciting.",
            "sent2": "The raising of a skyscraper requires careful planning.",
            "sent3": "The raising of a barn in the countryside is a community effort.",
            "sent4": "The raising of a bridge over the river is a major project.",
            "sent5": "The raising of a fence around the garden is necessary for protection."
        },
        {
            "definition": "The act of causing something to occur or exist",
            "pos": "noun",
            "sent1": "The raising of suspicions led to an investigation.",
            "sent2": "The raising of funds for charity is a noble cause.",
            "sent3": "The raising of a question sparked a lively debate.",
            "sent4": "The raising of an issue brought attention to an important matter.",
            "sent5": "The raising of an alarm alerted everyone to the danger."
        }
    ]
}