{
    "term": "raisers",
    "meanings": [
        {
            "definition": "A person or thing that raises something.",
            "pos": "noun",
            "sent1": "The raisers lifted the heavy box together.",
            "sent2": "The crane is a type of raisers used in construction.",
            "sent3": "The little girl pretended to be a raisers and lifted her toy blocks.",
            "sent4": "Her encouragement acted as a raisers, lifting his spirits.",
            "sent5": "The sun is the ultimate raisers of the temperature in summer."
        },
        {
            "definition": "A device used for lifting or elevating.",
            "pos": "noun",
            "sent1": "The raisers in the garage helped lift the car for repairs.",
            "sent2": "A forklift is a common type of raisers in warehouses.",
            "sent3": "The magical raisers in the story could lift objects with a wave of a wand.",
            "sent4": "The elevator is like a raisers, taking people up and down the building.",
            "sent5": "The hot air balloon served as a colorful raisers in the sky."
        },
        {
            "definition": "A person who raises animals or crops.",
            "pos": "noun",
            "sent1": "The raisers on the farm take care of the cows and chickens.",
            "sent2": "A farmer is a well-known raisers of crops and livestock.",
            "sent3": "The raisers joked that the chickens were their alarm clocks.",
            "sent4": "She was a dedicated raisers, nurturing the plants with love.",
            "sent5": "The raisers' hard work resulted in a bountiful harvest."
        },
        {
            "definition": "A bet made in poker to increase the stakes.",
            "pos": "noun",
            "sent1": "He decided to make a bold raisers to challenge the other players.",
            "sent2": "In poker, a raisers can add excitement to the game.",
            "sent3": "The raisers made everyone at the table sit up with interest.",
            "sent4": "Her unexpected raisers caught the other players off guard.",
            "sent5": "The raisers raised the tension in the room as the cards were revealed."
        }
    ]
}