{
    "term": "raises",
    "meanings": [
        {
            "definition": "Lifts or moves to a higher position",
            "pos": "verb",
            "sent1": "Dad raises the flag every morning.",
            "sent2": "She raises her hand to ask a question in class.",
            "sent3": "The crane raises the heavy load effortlessly.",
            "sent4": "The sun raises the temperature as the day goes on.",
            "sent5": "The elevator raises us to the top floor quickly."
        },
        {
            "definition": "Increases in amount or level",
            "pos": "noun",
            "sent1": "Her salary raises every year.",
            "sent2": "The raises in prices affect our budget.",
            "sent3": "The sudden raises in volume startled the audience.",
            "sent4": "The raises in attendance at the event were impressive.",
            "sent5": "The raises in temperature made it feel like summer."
        },
        {
            "definition": "Promotes to a higher rank or position",
            "pos": "verb",
            "sent1": "The boss raises hardworking employees.",
            "sent2": "She raises him to manager after his dedication.",
            "sent3": "The magician raises the humble rabbit to stardom.",
            "sent4": "The mentor raises the mentee to leadership roles.",
            "sent5": "The teacher raises students to achieve their potential."
        },
        {
            "definition": "Builds or constructs",
            "pos": "verb",
            "sent1": "The team raises a new building in the city.",
            "sent2": "He raises a fence around his garden.",
            "sent3": "The children raise a fort out of blankets and pillows.",
            "sent4": "The workers raise a scaffold for the construction project.",
            "sent5": "The artist raises a sculpture from a block of marble."
        },
        {
            "definition": "Nurtures or cares for",
            "pos": "verb",
            "sent1": "She raises plants in her garden with love.",
            "sent2": "The mother raises her children with kindness.",
            "sent3": "The nurse raises the patient's spirits with a smile.",
            "sent4": "He raises a puppy with patience and training.",
            "sent5": "The community raises funds to support those in need."
        },
        {
            "definition": "Produces or causes to occur",
            "pos": "verb",
            "sent1": "The chef raises a delicious aroma in the kitchen.",
            "sent2": "The storm raises strong winds and heavy rain.",
            "sent3": "The music raises emotions in the listeners.",
            "sent4": "The speech raises cheers and applause from the crowd.",
            "sent5": "The artist raises inspiration in those who view the painting."
        }
    ]
}