{
    "term": "raise",
    "meanings": [
        {
            "definition": "To lift or move to a higher position",
            "pos": "verb",
            "sent1": "Please raise your hand if you have a question.",
            "sent2": "He used a crane to raise the heavy box to the top shelf.",
            "sent3": "The magician tried to raise the rabbit out of the hat, but it was too big.",
            "sent4": "Her laughter seemed to raise the spirits of everyone in the room.",
            "sent5": "The sun's rays slowly raise over the horizon, signaling the start of a new day."
        },
        {
            "definition": "To increase in amount or level",
            "pos": "verb",
            "sent1": "The company decided to raise the prices of their products.",
            "sent2": "Studying hard can raise your grades in school.",
            "sent3": "The chef added extra spices to raise the flavor of the dish.",
            "sent4": "Her promotion will raise her status within the organization.",
            "sent5": "The cheers from the crowd raise in volume as the team scores a goal."
        },
        {
            "definition": "To bring up or rear (children)",
            "pos": "verb",
            "sent1": "She worked hard to raise her children with good values.",
            "sent2": "It takes a village to raise a child, they say.",
            "sent3": "The grandparents help raise the grandchildren with love and care.",
            "sent4": "The community center offers workshops on how to raise kids effectively.",
            "sent5": "Raising a child requires patience, understanding, and lots of love."
        },
        {
            "definition": "To build or construct",
            "pos": "verb",
            "sent1": "The workers will raise a new building in the empty lot.",
            "sent2": "They plan to raise a bridge over the river for easier access.",
            "sent3": "The team of architects will raise a modern skyscraper in the city center.",
            "sent4": "The volunteers helped raise a playground for the local children.",
            "sent5": "The construction crew will raise the walls of the house before sunset."
        },
        {
            "definition": "To cause to rise or stand up",
            "pos": "verb",
            "sent1": "The coach's speech always raises the team's motivation before a game.",
            "sent2": "The loud noise made the cat raise its ears in alert.",
            "sent3": "The unexpected news made her raise from her seat in surprise.",
            "sent4": "The music was so catchy that it made everyone raise to dance.",
            "sent5": "The smell of fresh bread baking in the oven raised everyone's appetite."
        }
    ]
}