{
    "term": "raked",
    "meanings": [
        {
            "definition": "To gather, draw, or pull together (leaves, refuse, etc.) with a rake.",
            "pos": "verb",
            "sent1": "She raked the fallen leaves into a neat pile.",
            "sent2": "The gardener raked the soil before planting the seeds.",
            "sent3": "The wind raked the leaves into a messy heap.",
            "sent4": "His words raked up painful memories from the past.",
            "sent5": "The comb raked through her tangled hair, removing knots effortlessly."
        },
        {
            "definition": "To clear, smooth, or level with a rake.",
            "pos": "verb",
            "sent1": "He raked the sand in the sandbox to make it even.",
            "sent2": "The groundskeeper raked the gravel path in the park.",
            "sent3": "The chef raked the chocolate drizzle on the dessert for a fancy presentation.",
            "sent4": "The storm raked the beach, leaving it pristine and smooth.",
            "sent5": "The artist raked the paint across the canvas, creating beautiful strokes."
        },
        {
            "definition": "To search thoroughly through (a place, receptacle, etc.).",
            "pos": "verb",
            "sent1": "The detective raked through the suspect's belongings for clues.",
            "sent2": "She raked through her bag looking for her keys.",
            "sent3": "The kids raked through the toy box, excitedly searching for their favorite game.",
            "sent4": "His eyes raked through the crowd, trying to find his friend.",
            "sent5": "The archaeologist raked through the ancient ruins, hoping to uncover hidden artifacts."
        },
        {
            "definition": "To scrape or scratch, as with a rake.",
            "pos": "verb",
            "sent1": "The cat raked its claws against the scratching post.",
            "sent2": "He accidentally raked his hand against the rough wall.",
            "sent3": "The branches raked against the window during the storm.",
            "sent4": "The thorns raked across his skin, leaving small scratches.",
            "sent5": "The rough fabric raked against her skin, causing irritation."
        }
    ]
}