{
    "term": "raking",
    "meanings": [
        {
            "definition": "To gather, collect, or move with a rake.",
            "pos": "verb",
            "sent1": "She was raking the leaves into a pile.",
            "sent2": "The gardener enjoys raking the fallen petals.",
            "sent3": "The kids were raking up all the toys in a hurry.",
            "sent4": "His voice raked through the silence like a sharp rake.",
            "sent5": "The wind was raking the sand across the beach."
        },
        {
            "definition": "To search thoroughly or vigorously.",
            "pos": "verb",
            "sent1": "The detective was raking through the evidence for clues.",
            "sent2": "She was raking the bookshelves for her missing keys.",
            "sent3": "The cat was raking through the closet looking for its toy.",
            "sent4": "His eyes raked the room, searching for any sign of movement.",
            "sent5": "The archaeologist was raking the site for ancient artifacts."
        },
        {
            "definition": "To scrape or scratch.",
            "pos": "verb",
            "sent1": "The branches were raking against the window in the wind.",
            "sent2": "She winced as the thorns raked her skin.",
            "sent3": "The rough fabric raked against his sensitive skin.",
            "sent4": "The cat's claws raked the furniture as it stretched.",
            "sent5": "The rough terrain was raking against the hiker's boots."
        },
        {
            "definition": "To cover or fill with something.",
            "pos": "verb",
            "sent1": "She was raking the cake with frosting.",
            "sent2": "The artist was raking the canvas with vibrant colors.",
            "sent3": "The chef was raking the dish with herbs for flavor.",
            "sent4": "The storm was raking the fields with rain.",
            "sent5": "The sun was raking the room with warm light."
        }
    ]
}