{
    "term": "ram",
    "meanings": [
        {
            "definition": "A male sheep.",
            "pos": "noun",
            "sent1": "The ram grazed peacefully in the meadow.",
            "sent2": "The shepherd herded the ram back to the barn.",
            "sent3": "The ram challenged the fence, but it stood strong.",
            "sent4": "His stubbornness was like a ram against a castle wall.",
            "sent5": "The ram's horns curled gracefully, a symbol of strength."
        },
        {
            "definition": "To strike or push with great force.",
            "pos": "verb",
            "sent1": "He tried to ram the door open with his shoulder.",
            "sent2": "The battering ram broke down the old gate easily.",
            "sent3": "The kids playfully pretended to ram into each other.",
            "sent4": "The storm waves rammed against the shore relentlessly.",
            "sent5": "The car rammed into the tree, causing a loud crash."
        },
        {
            "definition": "A device used for storing data in a computer.",
            "pos": "noun",
            "sent1": "The technician upgraded the computer's RAM for better performance.",
            "sent2": "Make sure your new laptop has enough RAM for smooth operation.",
            "sent3": "The RAM in the computer worked tirelessly to store all the files.",
            "sent4": "Her mind was like a RAM, storing memories and information.",
            "sent5": "The RAM chip hummed softly, processing data efficiently."
        },
        {
            "definition": "A male bighorn sheep.",
            "pos": "noun",
            "sent1": "The majestic ram stood proudly on the rocky cliff.",
            "sent2": "The ram skillfully navigated the steep mountain terrain.",
            "sent3": "The ram's impressive horns caught the sunlight, gleaming.",
            "sent4": "The ram's call echoed through the valley, a sound of wilderness.",
            "sent5": "The ram's agility on the mountain was a sight to behold."
        }
    ]
}