{
    "term": "ranges",
    "meanings": [
        {
            "definition": "A series of mountains or hills in a line",
            "pos": "noun",
            "sent1": "The beautiful ranges stretched across the horizon.",
            "sent2": "We hiked through the ranges and enjoyed the stunning views.",
            "sent3": "The ranges looked like a giant sleeping dragon.",
            "sent4": "The sun set behind the ranges, painting the sky in hues of orange and pink.",
            "sent5": "The snow-capped ranges stood majestically against the blue sky."
        },
        {
            "definition": "The area of variation between upper and lower limits",
            "pos": "noun",
            "sent1": "The price ranges of the products were clearly displayed.",
            "sent2": "Her test scores fell within the ranges of average performance.",
            "sent3": "The temperature ranges in this city are quite unpredictable.",
            "sent4": "The emotion on his face ranges from joy to sorrow in an instant.",
            "sent5": "The color ranges of the painting added depth and interest."
        },
        {
            "definition": "To vary within specific limits",
            "pos": "verb",
            "sent1": "His mood ranges from excitement to disappointment.",
            "sent2": "The temperature ranges between hot and cold throughout the day.",
            "sent3": "Her singing voice ranges from soft whispers to powerful notes.",
            "sent4": "The flavors in the dish range from sweet to savory.",
            "sent5": "The difficulty of the puzzles ranges from easy to challenging."
        },
        {
            "definition": "To move or extend in a particular direction",
            "pos": "verb",
            "sent1": "The river ranges through the forest, creating a peaceful atmosphere.",
            "sent2": "The road ranges from the city center to the outskirts.",
            "sent3": "His gaze ranges across the crowded room, searching for familiar faces.",
            "sent4": "Her voice ranges effortlessly from low to high notes.",
            "sent5": "The colors of the sunset range from golden to crimson."
        }
    ]
}