{
    "term": "rantingly",
    "meanings": [
        {
            "definition": "In a loud, aggressive, or passionate manner while speaking or writing.",
            "pos": "adverb",
            "sent1": "She spoke rantingly during the debate, trying to make her point heard.",
            "sent2": "He always talks rantingly when he gets upset about something.",
            "sent3": "The teacher pretended to speak rantingly to show the students how not to behave.",
            "sent4": "Her words echoed rantingly in the empty hall, emphasizing her frustration.",
            "sent5": "The politician's speech rang out rantingly across the crowd, stirring emotions.",
            "sent6": "Excitedly, she began to speak rantingly about her favorite book.",
            "sent7": "Rantingly, he expressed his strong opinions on the matter.",
            "sent8": "The child giggled as he imitated speaking rantingly like a grown-up.",
            "sent9": "The wind howled rantingly through the trees, creating an eerie atmosphere.",
            "sent10": "The coach shouted rantingly to motivate his team during the game."
        },
        {
            "definition": "Characterized by angry or impassioned speech or writing.",
            "pos": "adjective",
            "sent1": "Her rantingly tone made it clear she was not happy with the situation.",
            "sent2": "The article was filled with rantingly language, expressing strong opinions.",
            "sent3": "The cat gave her owner a rantingly look when he forgot to feed her.",
            "sent4": "The storm clouds gathered in a rantingly manner, foretelling a downpour.",
            "sent5": "His rantingly behavior scared off the other students in the class.",
            "sent6": "Angrily, she responded in a rantingly manner to the criticism.",
            "sent7": "The man's face turned red as he spoke rantingly about the injustice.",
            "sent8": "Rantingly, the dog barked at the mailman approaching the house.",
            "sent9": "The toddler stomped around the room in a rantingly fashion, upset about his toy.",
            "sent10": "The dark clouds moved rantingly across the sky, signaling a storm."
        }
    ]
}