{
    "term": "ranted",
    "meanings": [
        {
            "definition": "To speak or declaim extravagantly or violently; talk in a wild or vehement way.",
            "pos": "verb",
            "sent1": "She ranted about the unfairness of the situation to anyone who would listen.",
            "sent2": "He always ranted about politics during family dinners.",
            "sent3": "The parrot ranted in a comical way, mimicking the angry neighbor.",
            "sent4": "The storm ranted outside, matching her inner turmoil.",
            "sent5": "His rants echoed through the empty hallways, leaving a lasting impression.",
            "sent6": "After she ranted for hours, her voice grew hoarse.",
            "sent7": "The toddler ranted about not getting his favorite toy.",
            "sent8": "In the play, the villain ranted about his evil plans to the captive audience.",
            "sent9": "The teacher ranted about the importance of studying for the upcoming test.",
            "sent10": "The politician ranted on stage, trying to win over the crowd."
        },
        {
            "definition": "To utter or express in a ranting manner.",
            "pos": "verb",
            "sent1": "She ranted her frustrations to the empty room, hoping for relief.",
            "sent2": "He ranted his opinions on the matter without considering others' views.",
            "sent3": "The cat ranted at the closed door, demanding to be let out.",
            "sent4": "The wind ranted through the trees, carrying whispers of ancient stories.",
            "sent5": "His words ranted on, filling the room with intensity.",
            "sent6": "After she ranted about her day, she felt a weight lifted off her shoulders.",
            "sent7": "The child ranted about not wanting to go to bed yet.",
            "sent8": "In frustration, she ranted her complaints to the unresponsive computer screen.",
            "sent9": "He ranted his excitement for the upcoming concert to his friends.",
            "sent10": "The actor ranted his lines with passion, captivating the audience."
        },
        {
            "definition": "A speech or piece of writing that is full of angry or violent language.",
            "pos": "noun",
            "sent1": "His rant against the government was filled with fiery words.",
            "sent2": "The article was a rant against the injustices of society.",
            "sent3": "The comedian's rant about airline food had the audience in stitches.",
            "sent4": "Her rant in the meeting shocked everyone with its intensity.",
            "sent5": "The letter was a passionate rant against the company's policies.",
            "sent6": "The teacher's rant about students' behavior was overheard by the whole class.",
            "sent7": "The politician's rant on social media caused a stir among his followers.",
            "sent8": "In the play, the character's rant revealed his inner turmoil to the audience.",
            "sent9": "The customer's rant at the store manager drew attention from other shoppers.",
            "sent10": "The blogger's rant about the latest fashion trends went viral on the internet."
        }
    ]
}