{
    "term": "rap",
    "meanings": [
        {
            "definition": "A quick, sharp knock or blow",
            "pos": "noun",
            "sent1": "He heard a loud rap on the door.",
            "sent2": "The teacher gave the table a rap with her ruler to get the students' attention.",
            "sent3": "The rap on the window startled the cat, making it jump.",
            "sent4": "The rap of the drumsticks against the drum created a rhythmic beat.",
            "sent5": "The rap of the hammer against the nail echoed through the room."
        },
        {
            "definition": "A type of music characterized by rhythmic speech or vocal delivery",
            "pos": "noun",
            "sent1": "She enjoys listening to rap music on her way to school.",
            "sent2": "The party had a great atmosphere with rap music playing in the background.",
            "sent3": "The rap lyrics were so catchy that everyone started singing along.",
            "sent4": "His speech had a rhythmic flow, almost like a rap song.",
            "sent5": "The rap artist's performance was energetic and engaging."
        },
        {
            "definition": "To strike quickly and sharply",
            "pos": "verb",
            "sent1": "He had to rap the table to stop the argument.",
            "sent2": "The boxer's opponent tried to rap him on the chin.",
            "sent3": "She jokingly threatened to rap him on the head with a pillow.",
            "sent4": "The storm began to rap against the windows, causing them to shake.",
            "sent5": "The woodpecker continued to rap on the tree trunk searching for insects."
        },
        {
            "definition": "To talk or chat in a casual or familiar manner",
            "pos": "verb",
            "sent1": "They would often rap about their favorite movies during lunch.",
            "sent2": "Friends enjoy rapping about their weekend plans.",
            "sent3": "The group decided to rap about their pets' funny antics.",
            "sent4": "The neighbors would often rap over the fence about gardening tips.",
            "sent5": "She loves to rap with her grandma about old family stories."
        }
    ]
}