{
    "term": "rapacious",
    "meanings": [
        {
            "definition": "Aggressively greedy or grasping",
            "pos": "adjective",
            "sent1": "The rapacious businessman always wanted more money, never satisfied with what he had.",
            "sent2": "The wolf's rapacious nature drove it to hunt for food relentlessly.",
            "sent3": "The rapacious squirrel hoarded all the nuts in the park, leaving none for the other animals.",
            "sent4": "Her rapacious appetite for success led her to step on others to climb the corporate ladder.",
            "sent5": "The rapacious landlord raised the rent every month, making it impossible for the tenants to save any money."
        },
        {
            "definition": "Predatory or plundering",
            "pos": "adjective",
            "sent1": "The rapacious vulture circled overhead, searching for its next meal.",
            "sent2": "Pirates were known for their rapacious behavior, looting ships on the high seas.",
            "sent3": "The rapacious raccoon snuck into the campsite and stole all the food from the cooler.",
            "sent4": "The rapacious storm swept through the town, leaving destruction in its wake.",
            "sent5": "The rapacious thief stole priceless artifacts from the museum, leaving chaos behind."
        },
        {
            "definition": "Eager to seize or grasp wealth or possessions",
            "pos": "adjective",
            "sent1": "The rapacious child grabbed all the toys at once, unwilling to share with others.",
            "sent2": "The explorer's rapacious desire for treasure led him deep into the jungle.",
            "sent3": "The rapacious magpie collected shiny objects and kept them hidden in its nest.",
            "sent4": "Her rapacious ambition drove her to work long hours to achieve financial success.",
            "sent5": "The rapacious collector would stop at nothing to add rare items to his collection."
        }
    ]
}