{
    "term": "raping",
    "meanings": [
        {
            "definition": "To force someone to have sexual intercourse against their will.",
            "pos": "verb",
            "sent1": "The villain was caught raping the innocent victim in the dark alley.",
            "sent2": "The criminal was arrested for raping a young woman in the park.",
            "sent3": "The movie plot involved a superhero saving the city from a villain who was trying to take over by raping everyone's minds.",
            "sent4": "The invasive thoughts kept raping her peace of mind, leaving her restless and anxious.",
            "sent5": "The news report described the horrifying incident of a predator raping the trust of a community."
        },
        {
            "definition": "To plunder or pillage.",
            "pos": "verb",
            "sent1": "The pirates were known for raping ships along the coast, stealing all the valuable cargo.",
            "sent2": "During the war, enemy soldiers would often go from village to village, raping and looting everything in sight.",
            "sent3": "The raccoons in the neighborhood seemed to be on a mission, constantly raping the garbage cans for food.",
            "sent4": "The tornado ripped through the town, raping the landscape of its trees and homes.",
            "sent5": "The vandals were caught red-handed, raping the public park of its beauty and tranquility."
        },
        {
            "definition": "To criticize or berate harshly.",
            "pos": "verb",
            "sent1": "The strict teacher was always raping her students for not completing their homework on time.",
            "sent2": "The coach was known for raping his players during practice, pushing them to their limits.",
            "sent3": "The food critic seemed to enjoy raping the restaurant's dishes, leaving no room for improvement.",
            "sent4": "The harsh words kept raping his self-esteem, making him doubt his abilities.",
            "sent5": "The judge's verdict felt like a sentence raping the defendant's character in front of the whole courtroom."
        }
    ]
}