{
    "term": "rapped",
    "meanings": [
        {
            "definition": "To strike sharply or vigorously",
            "pos": "verb",
            "sent1": "He rapped the table to get everyone's attention.",
            "sent2": "The carpenter rapped the nail into place with his hammer.",
            "sent3": "The teacher rapped the board to quiet down the noisy class.",
            "sent4": "The thunder rapped the windows, making the whole house shake.",
            "sent5": "She rapped the door with urgency, hoping someone would answer."
        },
        {
            "definition": "To criticize sharply",
            "pos": "verb",
            "sent1": "She rapped his behavior, pointing out all his mistakes.",
            "sent2": "The movie critic rapped the film for its poor acting.",
            "sent3": "He rapped her cooking skills, but she just laughed it off.",
            "sent4": "The judge rapped the defendant's excuses, demanding the truth.",
            "sent5": "The boss rapped his employee's performance, pushing for improvement."
        },
        {
            "definition": "To perform rap music",
            "pos": "verb",
            "sent1": "The rapper rapped his latest song at the concert.",
            "sent2": "She rapped about social issues in her powerful lyrics.",
            "sent3": "The kids rapped along with the music, enjoying the beat.",
            "sent4": "The artist rapped his emotions, connecting with the audience.",
            "sent5": "He rapped with passion, pouring his heart into every verse."
        },
        {
            "definition": "To talk or chat in a relaxed or informal way",
            "pos": "verb",
            "sent1": "They rapped about their favorite movies for hours.",
            "sent2": "The friends rapped about their weekend plans over coffee.",
            "sent3": "She rapped with her best friend, sharing stories and laughter.",
            "sent4": "He rapped with his colleagues during the lunch break.",
            "sent5": "The neighbors rapped over the fence, catching up on news."
        }
    ]
}