{
    "term": "ras",
    "meanings": [
        {
            "definition": "A sweet, edible fruit of a rose plant.",
            "pos": "noun",
            "sent1": "I picked a ripe ras from the rose bush.",
            "sent2": "The ras was juicy and delicious.",
            "sent3": "The ras made a perfect addition to my fruit salad.",
            "sent4": "Her smile was as bright and sweet as a ras.",
            "sent5": "The aroma of the ras filled the room with a delightful fragrance."
        },
        {
            "definition": "The act of scraping or abrading the skin.",
            "pos": "noun",
            "sent1": "Be careful not to get a ras while climbing the tree.",
            "sent2": "The ras on his knee stung a little.",
            "sent3": "She joked that the ras on her elbow was a battle scar.",
            "sent4": "The rough sandpaper felt like a ras against his palm.",
            "sent5": "The ras from falling off the bike left a small mark on his leg."
        },
        {
            "definition": "A unit of measurement equal to 1/32 of an inch.",
            "pos": "noun",
            "sent1": "The carpenter measured the wood with a ras.",
            "sent2": "The precision required a ras to ensure accuracy.",
            "sent3": "He chuckled at the tiny size of a ras.",
            "sent4": "The distance was so short, it felt like a ras away.",
            "sent5": "The seamstress used a ras to make precise cuts in the fabric."
        },
        {
            "definition": "A traditional Ethiopian and Eritrean music genre.",
            "pos": "noun",
            "sent1": "The rhythmic beats of the ras filled the air.",
            "sent2": "She danced gracefully to the sounds of the ras.",
            "sent3": "The lively ras music had everyone on their feet.",
            "sent4": "The ras transported me to a different world.",
            "sent5": "The vibrant colors of the costumes matched the energy of the ras performance."
        }
    ]
}