{
    "term": "raser",
    "meanings": [
        {
            "definition": "To shave off or scrape off",
            "pos": "verb",
            "sent1": "I need to raser the old paint off the wall.",
            "sent2": "She carefully rasered the excess clay from the sculpture.",
            "sent3": "The barber accidentally rasered off more hair than intended.",
            "sent4": "The chef rasered the truffle into delicate slices.",
            "sent5": "The woodworker used a sharp tool to raser the rough edges of the table."
        },
        {
            "definition": "A tool for shaving or scraping",
            "pos": "noun",
            "sent1": "The raser is used to smooth out the surface of the wood.",
            "sent2": "He reached for the raser to remove the rust from the metal.",
            "sent3": "The old raser had seen many years of hard work.",
            "sent4": "She held the raser with a steady hand, ready to begin sculpting.",
            "sent5": "The artist's favorite raser was a gift from a dear friend."
        },
        {
            "definition": "A person who shaves or scrapes",
            "pos": "noun",
            "sent1": "The skilled raser carefully removed the excess material.",
            "sent2": "The raser at the barbershop always gives a clean shave.",
            "sent3": "The clumsy raser accidentally nicked his own skin.",
            "sent4": "The professional raser worked swiftly and efficiently.",
            "sent5": "The old raser shared stories of his trade with the young apprentices."
        },
        {
            "definition": "A person who shaves or scrapes",
            "pos": "noun",
            "sent1": "The raser at the salon is known for her precision.",
            "sent2": "He trained as a raser to follow in his father's footsteps.",
            "sent3": "The raser's steady hand ensured a smooth finish.",
            "sent4": "The experienced raser could work with any type of material.",
            "sent5": "The young raser learned the art of shaving from his mentor."
        },
        {
            "definition": "A person who shaves or scrapes",
            "pos": "noun",
            "sent1": "The raser in the kitchen expertly peeled the potatoes.",
            "sent2": "She admired the skill of the raser as he worked on the sculpture.",
            "sent3": "The raser's tools were always kept sharp and ready.",
            "sent4": "The raser's precision was unmatched in the village.",
            "sent5": "The young apprentice watched the master raser with awe."
        }
    ]
}