{
    "term": "rash",
    "meanings": [
        {
            "definition": "Acting or done without careful consideration",
            "pos": "adjective",
            "sent1": "She made a rash decision to skip her homework and play outside instead.",
            "sent2": "He regretted his rash choice to buy the expensive toy without saving money.",
            "sent3": "The squirrel's rash attempt to steal the nuts ended in a comical chase around the tree.",
            "sent4": "The reckless driver's rash behavior on the road endangered everyone around him.",
            "sent5": "The hasty and rash action of pressing the red button caused the machine to malfunction."
        },
        {
            "definition": "A series of red, raised spots on the skin",
            "pos": "noun",
            "sent1": "After playing in the grass, she developed a rash on her arms and legs.",
            "sent2": "The doctor diagnosed the red rash on his face as an allergic reaction.",
            "sent3": "The itchy rash on her back made her feel like a human connect-the-dots puzzle.",
            "sent4": "The rash of mosquito bites on his ankles resembled a constellation in the night sky.",
            "sent5": "The sudden appearance of a rash on her neck alarmed her and led her to seek medical advice."
        },
        {
            "definition": "A sudden and widespread occurrence of something harmful",
            "pos": "noun",
            "sent1": "The rash of flu cases in the school caused many students to stay home.",
            "sent2": "The sudden rash of thunderstorms caught everyone off guard during the picnic.",
            "sent3": "The rash of spilled milk cartons in the cafeteria led to slippery floors and laughter.",
            "sent4": "The unexpected rash of car accidents on the highway caused a traffic jam for hours.",
            "sent5": "The rapid and widespread rash of rumors about the new teacher spread like wildfire among the students."
        }
    ]
}