{
    "term": "rashie",
    "meanings": [
        {
            "definition": "A rashie is a type of clothing worn for protection against sunburn while swimming.",
            "pos": "noun",
            "sent1": "I wore my rashie to the beach to keep my skin safe from the sun.",
            "sent2": "She put on her rashie before jumping into the pool to avoid getting sunburned.",
            "sent3": "The rashie was like a shield against the sun, making me feel like a superhero.",
            "sent4": "Her rashie was her trusty armor in the battle against the scorching sun.",
            "sent5": "The bright blue rashie stood out against the water, a beacon of sun protection."
        },
        {
            "definition": "Rashie can refer to a person who acts impulsively or without thinking.",
            "pos": "noun",
            "sent1": "He's such a rashie, always making quick decisions without considering the consequences.",
            "sent2": "Being a rashie can sometimes lead to trouble if you don't think things through.",
            "sent3": "The rashie in our group always keeps us on our toes with their spontaneous ideas.",
            "sent4": "Her friend's impulsiveness was like a rashie, adding excitement to their adventures.",
            "sent5": "The rashie's impulsive nature made every day an unpredictable adventure."
        },
        {
            "definition": "Rashie can also mean a skin irritation or outbreak of red spots.",
            "pos": "noun",
            "sent1": "After the hike, I developed a rashie on my arm from brushing against a plant.",
            "sent2": "The allergic reaction caused a rashie on her face, making her uncomfortable.",
            "sent3": "The rashie on his leg made him itch like crazy, driving him to seek relief.",
            "sent4": "The rashie spread like wildfire across her back, causing discomfort and concern.",
            "sent5": "The sudden appearance of the rashie was a red flag for a possible allergic reaction."
        }
    ]
}