{
    "term": "rasp",
    "meanings": [
        {
            "definition": "A coarse file or tool with a roughened surface for smoothing or shaping wood or metal.",
            "pos": "noun",
            "sent1": "The carpenter used a rasp to smooth the rough edges of the wooden table.",
            "sent2": "I need to buy a new rasp for my woodworking projects.",
            "sent3": "The rasp made a loud noise as it worked on the metal pipe.",
            "sent4": "The rasp's rough surface was like a tiny mountain range on the tool.",
            "sent5": "The rasp's teeth bit into the wood, leaving a trail of sawdust behind."
        },
        {
            "definition": "A harsh, grating noise.",
            "pos": "noun",
            "sent1": "The rasp of the chainsaw echoed through the forest.",
            "sent2": "The rusty gate made a loud rasp every time it opened.",
            "sent3": "The rasp of the old door sounded like a cat trying to sing.",
            "sent4": "The rasp of the car engine signaled trouble ahead.",
            "sent5": "The rasp of the chalk on the blackboard made everyone cringe."
        },
        {
            "definition": "To scrape or grate with a rough tool.",
            "pos": "verb",
            "sent1": "She had to rasp the rust off the metal before painting it.",
            "sent2": "I will rasp the cheese for the pasta dish.",
            "sent3": "He tried to rasp the ice off the windshield with a spatula.",
            "sent4": "The wind seemed to rasp against the windowpanes all night.",
            "sent5": "The saw rasp against the tree trunk, sending wood chips flying."
        },
        {
            "definition": "To make a harsh, grating noise.",
            "pos": "verb",
            "sent1": "The old hinges began to rasp as the door swung open.",
            "sent2": "The violinist made the bow rasp against the strings for a unique sound.",
            "sent3": "The wind started to rasp against the shutters, creating an eerie atmosphere.",
            "sent4": "Her voice seemed to rasp with emotion as she sang the blues.",
            "sent5": "The metal chair legs rasp against the tiled floor, causing a screeching sound."
        }
    ]
}