{
    "term": "rath",
    "meanings": [
        {
            "definition": "A circular earthen fortification",
            "pos": "noun",
            "sent1": "The ancient tribe built a rath to protect themselves from enemies.",
            "sent2": "The soldiers gathered at the rath to strategize their defense.",
            "sent3": "The children played hide-and-seek around the rath, imagining it as a magical castle.",
            "sent4": "Her kindness was a rath, shielding me from the harshness of the world.",
            "sent5": "The rath stood proudly on the hill, a symbol of strength and security."
        },
        {
            "definition": "A mound or hill",
            "pos": "noun",
            "sent1": "The cows grazed peacefully on the lush rath.",
            "sent2": "We hiked to the top of the rath to enjoy the breathtaking view.",
            "sent3": "The rath looked like a giant sleeping turtle in the middle of the field.",
            "sent4": "The rath of books in the library seemed to touch the sky with knowledge.",
            "sent5": "The rath glowed golden in the setting sun, a majestic sight to behold."
        },
        {
            "definition": "A type of rodent",
            "pos": "noun",
            "sent1": "The mischievous rath scurried across the kitchen floor, looking for crumbs.",
            "sent2": "I saw a cute rath nibbling on a piece of cheese near the barn.",
            "sent3": "The rath peeked out from behind the wall, its whiskers twitching with curiosity.",
            "sent4": "Her pet rath was as quick as lightning, darting around the room with glee.",
            "sent5": "The tiny rath stood on its hind legs, surveying its surroundings with beady eyes."
        },
        {
            "definition": "A unit of currency in ancient Ireland",
            "pos": "noun",
            "sent1": "The merchant traded goods for a handful of rath.",
            "sent2": "In the olden days, people used rath to buy food and clothes.",
            "sent3": "He pretended to be a wealthy noble, tossing bags of rath to the beggars.",
            "sent4": "The rath jingled in her purse, a reminder of the wealth she had amassed.",
            "sent5": "The rath gleamed in the sunlight, a symbol of prosperity and power in those times."
        }
    ]
}