{
    "term": "ratter",
    "meanings": [
        {
            "definition": "A person or animal that catches rats.",
            "pos": "noun",
            "sent1": "The brave ratter quickly caught the sneaky rat in the barn.",
            "sent2": "The farm dog was an excellent ratter, keeping the barn free of rodents.",
            "sent3": "The little ratter chased the rat around the yard, causing quite a commotion.",
            "sent4": "She was like a skilled ratter, hunting down the truth in every situation.",
            "sent5": "The ratter's sharp eyes and quick reflexes made it a formidable opponent for any rat."
        },
        {
            "definition": "A device used to kill rats.",
            "pos": "noun",
            "sent1": "The old-fashioned ratter snapped shut, trapping the rat inside.",
            "sent2": "The farmer set up multiple ratters around the barn to keep the rodents away.",
            "sent3": "The mechanical ratter malfunctioned and started chasing the cat instead of the rat.",
            "sent4": "The ratter lay in wait, ready to strike at any unsuspecting rodent that crossed its path.",
            "sent5": "The powerful jaws of the ratter made quick work of the rat, ending the infestation in no time."
        },
        {
            "definition": "A computer program designed to detect and remove computer viruses.",
            "pos": "noun",
            "sent1": "The new ratter software quickly scanned the computer and eliminated the virus.",
            "sent2": "She installed a reliable ratter on her laptop to keep it safe from online threats.",
            "sent3": "The ratter program worked tirelessly, like a digital superhero protecting the computer.",
            "sent4": "The advanced ratter algorithm was like a shield, defending the system from harmful viruses.",
            "sent5": "With the ratter running in the background, the computer was always safeguarded against malicious software."
        }
    ]
}