{
    "term": "rattle",
    "meanings": [
        {
            "definition": "Make or cause to make a rapid succession of short, sharp knocking sounds.",
            "pos": "verb",
            "sent1": "The loose window pane would rattle in the wind.",
            "sent2": "The old train would rattle along the tracks.",
            "sent3": "The pots and pans in the kitchen seemed to rattle a lively tune.",
            "sent4": "His teeth would rattle together from the cold.",
            "sent5": "The hailstones would rattle against the roof like tiny drums."
        },
        {
            "definition": "A rapid succession of short, sharp knocking sounds.",
            "pos": "noun",
            "sent1": "The sudden rattle of thunder startled the children.",
            "sent2": "The snake's warning rattle could be heard from a distance.",
            "sent3": "The rattle of the dice added excitement to the game.",
            "sent4": "The rattle of the chains echoed through the dungeon.",
            "sent5": "The rattle of the tambourine filled the room with music."
        },
        {
            "definition": "A toy that makes a rattling sound when shaken.",
            "pos": "noun",
            "sent1": "The baby was entertained by the colorful rattle.",
            "sent2": "The kitten played with the small rattle for hours.",
            "sent3": "The mischievous puppy thought the rattle was a new chew toy.",
            "sent4": "The clown's oversized rattle added humor to the act.",
            "sent5": "The toddler's rattle made a cheerful noise as she shook it."
        },
        {
            "definition": "Shake or cause to shake in a rapid, irregular manner.",
            "pos": "verb",
            "sent1": "The earthquake would rattle the dishes on the shelves.",
            "sent2": "The strong wind would rattle the windows of the house.",
            "sent3": "The unexpected news seemed to rattle her composure.",
            "sent4": "The loud music would rattle the walls of the concert hall.",
            "sent5": "The intense thunderstorm would rattle the entire neighborhood."
        }
    ]
}