{
    "term": "rattened",
    "meanings": [
        {
            "definition": "To make a rattling noise.",
            "pos": "verb",
            "sent1": "The old windows rattened in the wind.",
            "sent2": "The loose coins rattened in the tin can.",
            "sent3": "The toy snake rattened as it slithered across the floor.",
            "sent4": "The hail rattened against the roof like a drumbeat.",
            "sent5": "The keys rattened in his pocket as he walked."
        },
        {
            "definition": "To shake or vibrate with a rapid succession of sounds.",
            "pos": "verb",
            "sent1": "The train rattened as it passed by the station.",
            "sent2": "The earthquake rattened the dishes on the shelves.",
            "sent3": "The excited puppy rattened with joy when its owner returned home.",
            "sent4": "Her heart rattened with fear as she approached the dark alley.",
            "sent5": "The thunder rattened through the valley, shaking the windows."
        },
        {
            "definition": "To cause to make a rattling noise.",
            "pos": "verb",
            "sent1": "She rattened the tambourine to the beat of the music.",
            "sent2": "The construction work rattened the entire neighborhood.",
            "sent3": "The mischievous child rattened the jar of marbles, making a mess.",
            "sent4": "The wind rattened the shutters, creating a spooky atmosphere.",
            "sent5": "The chef rattened the pots and pans while cooking up a storm."
        },
        {
            "definition": "To move with a rapid succession of sounds.",
            "pos": "verb",
            "sent1": "The leaves rattened as the squirrel dashed through the bushes.",
            "sent2": "The skateboard rattened along the pavement as he rode down the street.",
            "sent3": "The beads rattened on her bracelet as she gestured animatedly.",
            "sent4": "The rain rattened on the umbrella as she hurried through the storm.",
            "sent5": "The wheels of the bicycle rattened on the gravel path."
        }
    ]
}