{
    "term": "rave",
    "meanings": [
        {
            "definition": "To talk wildly or incoherently",
            "pos": "verb",
            "sent1": "During the meeting, he would rave about his favorite TV show, not making much sense.",
            "sent2": "She tends to rave about her weekend adventures to anyone who will listen.",
            "sent3": "The parrot started to rave in gibberish, mimicking the sounds it heard.",
            "sent4": "Her mind would often rave like a river overflowing its banks, with thoughts rushing everywhere.",
            "sent5": "His feverish delirium caused him to rave about imaginary creatures lurking in the shadows."
        },
        {
            "definition": "To speak or write with great enthusiasm",
            "pos": "verb",
            "sent1": "The teacher would rave about the importance of reading to her students every day.",
            "sent2": "Fans would rave about the performance of their favorite singer long after the concert ended.",
            "sent3": "She would rave enthusiastically about her new hobby of painting, showing off her colorful creations.",
            "sent4": "His eyes would rave with excitement as he talked about his upcoming trip to the amusement park.",
            "sent5": "The children would rave with joy when they saw the magician perform his tricks."
        },
        {
            "definition": "An all-night dance party with electronic music",
            "pos": "noun",
            "sent1": "The group of friends decided to attend a rave to dance all night to electronic beats.",
            "sent2": "She had never been to a rave before, but the idea of dancing under the stars excited her.",
            "sent3": "The farm animals accidentally stumbled upon the rave in the barn, causing chaos among the dancers.",
            "sent4": "The city transformed into a neon-lit wonderland during the annual rave festival.",
            "sent5": "The rave pulsed with energy as the DJ played the latest electronic tracks, keeping the crowd moving."
        }
    ]
}