{
    "term": "rawin",
    "meanings": [
        {
            "definition": "To prepare or process (food) in its natural state without cooking or heating.",
            "pos": "verb",
            "sent1": "I prefer to rawin my vegetables for a fresh and crunchy salad.",
            "sent2": "She likes to rawin fruits for a healthy snack.",
            "sent3": "The chef decided to rawin the ingredients for a unique dish.",
            "sent4": "The idea to rawin the fish before serving was a stroke of genius.",
            "sent5": "Rawin your food to retain all the nutrients and flavors."
        },
        {
            "definition": "Unprocessed or unrefined.",
            "pos": "adjective",
            "sent1": "The rawin sugar gave the dessert a natural sweetness.",
            "sent2": "She bought rawin honey from the local market.",
            "sent3": "His rawin talent for painting was evident in every stroke.",
            "sent4": "The rawin beauty of the untouched landscape took her breath away.",
            "sent5": "The rawin materials were perfect for the rustic design."
        },
        {
            "definition": "Inexperienced or untrained.",
            "pos": "adjective",
            "sent1": "As a rawin hiker, he struggled with the difficult trail.",
            "sent2": "She felt rawin in her new job but was eager to learn.",
            "sent3": "The rawin intern made a few mistakes but improved quickly.",
            "sent4": "His rawin skills in cooking were evident, but he was eager to improve.",
            "sent5": "The rawin team needed guidance to complete the project."
        },
        {
            "definition": "A tool used for drawing or marking lines.",
            "pos": "noun",
            "sent1": "She used a rawin to draw straight lines on the paper.",
            "sent2": "The artist's favorite rawin was a fine-tipped marker.",
            "sent3": "The rawin was essential for creating precise sketches.",
            "sent4": "He misplaced his rawin and struggled to mark the measurements.",
            "sent5": "The architect's rawin was always kept sharp for accurate drawings."
        }
    ]
}