{
    "term": "raws",
    "meanings": [
        {
            "definition": "Not cooked",
            "pos": "adjective",
            "sent1": "The raws meat needs to be cooked thoroughly before eating.",
            "sent2": "I prefer my vegetables raws rather than cooked.",
            "sent3": "He tried to eat the raws pasta, but it was too hard to chew!",
            "sent4": "Her raws talent in the kitchen shone through as she prepared the meal effortlessly.",
            "sent5": "The raws steak sizzled on the grill, tempting everyone with its juicy aroma."
        },
        {
            "definition": "Unprocessed materials",
            "pos": "noun",
            "sent1": "The construction workers unloaded the raws for the new building.",
            "sent2": "The artist used raws like wood and clay to create his masterpiece.",
            "sent3": "The raws of metal lay scattered across the workshop floor, waiting to be shaped.",
            "sent4": "The raws of nature provided endless inspiration for the photographer's work.",
            "sent5": "The raws of fabric were carefully selected to create the beautiful dress."
        },
        {
            "definition": "Unedited footage",
            "pos": "noun",
            "sent1": "The documentary included raws from the scene of the accident.",
            "sent2": "The filmmaker spent hours editing the raws to create a compelling story.",
            "sent3": "The raws footage captured the true essence of the event, unfiltered and real.",
            "sent4": "Viewers were captivated by the raws of the wildlife in their natural habitat.",
            "sent5": "The raws footage revealed the raw beauty of the untouched landscape."
        },
        {
            "definition": "Unrefined emotions",
            "pos": "noun",
            "sent1": "His raws were evident in the way he expressed himself during the argument.",
            "sent2": "She struggled to control her raws of anger after the disappointing news.",
            "sent3": "The raws of joy bubbled up inside her, making her dance with happiness.",
            "sent4": "The raws of sadness overwhelmed him as he listened to the heartbreaking story.",
            "sent5": "The raws of love in her heart shone brightly in her kind actions towards others."
        }
    ]
}