{
    "term": "rax",
    "meanings": [
        {
            "definition": "To stretch or strain",
            "pos": "verb",
            "sent1": "I need to rax my arms after sitting for so long.",
            "sent2": "She always raxes before starting her workout routine.",
            "sent3": "Trying to reach that high shelf made me rax like a rubber band.",
            "sent4": "The old bridge raxed under the weight of the heavy truck.",
            "sent5": "The yoga instructor encouraged us to rax our bodies to improve flexibility."
        },
        {
            "definition": "A physical injury or strain",
            "pos": "noun",
            "sent1": "He suffered a rax in his back from lifting heavy boxes.",
            "sent2": "The athlete had to sit out due to a severe rax in his leg.",
            "sent3": "The clumsy fall resulted in a painful rax in her ankle.",
            "sent4": "The sudden movement caused a sharp rax in his shoulder.",
            "sent5": "The doctor recommended rest to heal the muscle rax."
        },
        {
            "definition": "To extend or reach out",
            "pos": "verb",
            "sent1": "The cat tried to rax its paw to grab the toy.",
            "sent2": "She raxes her hand to greet everyone warmly.",
            "sent3": "The tree branches raxed towards the sky in search of sunlight.",
            "sent4": "The vine raxed across the wall to find support.",
            "sent5": "The child raxes out to catch the falling balloon."
        },
        {
            "definition": "A framework for holding something",
            "pos": "noun",
            "sent1": "The artist used a wooden rax to display her paintings.",
            "sent2": "The bookshelf had a sturdy rax to hold all the books.",
            "sent3": "The metal rax in the garage stored all the tools neatly.",
            "sent4": "The kitchen had a hanging rax for pots and pans.",
            "sent5": "The store had a display rax for showcasing new products."
        },
        {
            "definition": "To arrange or organize",
            "pos": "verb",
            "sent1": "She likes to rax her desk before starting work.",
            "sent2": "The librarian raxes the books alphabetically on the shelves.",
            "sent3": "He decided to rax his thoughts before making a decision.",
            "sent4": "The event planner raxes the seating chart for the guests.",
            "sent5": "The teacher asked the students to rax their ideas for the project."
        }
    ]
}