{
    "term": "ray",
    "meanings": [
        {
            "definition": "A narrow beam of light",
            "pos": "noun",
            "sent1": "The sun's ray shone through the window.",
            "sent2": "She followed the ray of light to find her lost earring.",
            "sent3": "The mischievous cat chased the ray of light around the room.",
            "sent4": "Her smile was like a warm ray of light on a cold day.",
            "sent5": "The golden ray illuminated the dark forest, revealing hidden treasures."
        },
        {
            "definition": "A line of light radiating from a central point",
            "pos": "noun",
            "sent1": "The starburst had many colorful rays spreading out.",
            "sent2": "The fireworks created a beautiful display of rays in the night sky.",
            "sent3": "The artist painted rays of light bursting from the sun in the corner of the canvas.",
            "sent4": "Her laughter spread out like rays of sunshine, brightening everyone's day.",
            "sent5": "The lighthouse sent out its guiding ray to help ships navigate safely through the storm."
        },
        {
            "definition": "A type of fish with a flat body and long tail",
            "pos": "noun",
            "sent1": "The ray gracefully glided through the water with its long tail trailing behind.",
            "sent2": "The aquarium had a tank dedicated to showcasing different species of rays.",
            "sent3": "The children were fascinated by the unique appearance of the ray swimming in circles.",
            "sent4": "The ray camouflaged itself against the sandy ocean floor, blending in perfectly.",
            "sent5": "The ray's gentle movements mesmerized the onlookers, who watched in awe."
        },
        {
            "definition": "To emit light in a narrow beam",
            "pos": "verb",
            "sent1": "The lighthouse rayed out across the stormy sea, guiding ships to safety.",
            "sent2": "The flashlight rayed into the dark cave, revealing hidden treasures.",
            "sent3": "The disco ball rayed light in all directions, creating a dazzling effect.",
            "sent4": "Her smile rayed warmth and happiness to everyone around her.",
            "sent5": "The campfire rayed flickering light, casting shadows on the trees around."
        },
        {
            "definition": "To extend outward in a straight line",
            "pos": "verb",
            "sent1": "The road rayed out in front of them, leading to unknown destinations.",
            "sent2": "The tree branches rayed out in all directions, providing shade in the park.",
            "sent3": "The cracks in the wall rayed out like spiderwebs, indicating structural damage.",
            "sent4": "Her influence rayed out to touch the lives of many people in the community.",
            "sent5": "The river rayed out from the mountain, carving its path through the valley."
        }
    ]
}