{
    "term": "rearrange",
    "meanings": [
        {
            "definition": "To change the position or order of things.",
            "pos": "verb",
            "sent1": "I will rearrange the books on the shelf to make them look neater.",
            "sent2": "She likes to rearrange her room every few months for a fresh look.",
            "sent3": "The mischievous elf decided to rearrange the furniture in the house while everyone was asleep.",
            "sent4": "Her thoughts were like puzzle pieces that she needed to rearrange to find the solution.",
            "sent5": "The magician could rearrange the cards in a blink of an eye, leaving the audience amazed."
        },
        {
            "definition": "To organize or arrange differently.",
            "pos": "verb",
            "sent1": "Let's rearrange the schedule to fit in more time for breaks.",
            "sent2": "She had to rearrange the flowers in the vase to create a more balanced arrangement.",
            "sent3": "The chef had to rearrange the ingredients after realizing she forgot a key element.",
            "sent4": "The words in the poem seemed to rearrange themselves into a beautiful verse.",
            "sent5": "The students were asked to rearrange themselves in alphabetical order for the class photo."
        },
        {
            "definition": "To adjust or move things around.",
            "pos": "verb",
            "sent1": "He needed to rearrange the furniture in the living room to make space for the new TV.",
            "sent2": "The teacher asked the students to rearrange their desks into a circle for group work.",
            "sent3": "The squirrel tried to rearrange the nuts in its stash to make them more organized.",
            "sent4": "The wind seemed to rearrange the fallen leaves into intricate patterns on the ground.",
            "sent5": "She had to rearrange her plans when unexpected guests arrived at her doorstep."
        }
    ]
}