{
    "term": "rearguard",
    "meanings": [
        {
            "definition": "The soldiers stationed at the rear of a military formation.",
            "pos": "noun",
            "sent1": "During the battle, the rearguard protected the back of the army.",
            "sent2": "The rearguard stayed alert to watch for any enemies approaching from behind.",
            "sent3": "The rearguard joked that they were the 'guardians of the back' in the army.",
            "sent4": "The rearguard stood firm like a shield, shielding the rest of the troops.",
            "sent5": "In the army, the rearguard's duty was to ensure no enemy could surprise them from behind."
        },
        {
            "definition": "A person or group that defends against attacks from behind.",
            "pos": "noun",
            "sent1": "The rearguard swiftly responded to any threats coming from the rear.",
            "sent2": "The rearguard was always ready to protect the team from sneak attacks.",
            "sent3": "The rearguard playfully called themselves the 'back protectors' of the group.",
            "sent4": "The rearguard shielded the team like a fortress, keeping them safe.",
            "sent5": "With the rearguard on watch, the team felt secure from any surprise attacks from behind."
        },
        {
            "definition": "The last line of defense or protection.",
            "pos": "noun",
            "sent1": "The rearguard was the final shield against any threats approaching from behind.",
            "sent2": "In the castle, the rearguard was the last line of defense against intruders.",
            "sent3": "The rearguard humorously referred to themselves as the 'backstop' of safety.",
            "sent4": "The rearguard stood strong like a fortress wall, protecting the rest.",
            "sent5": "The rearguard's role was crucial as the ultimate defense against rear attacks."
        },
        {
            "definition": "A position or role of protecting against threats from behind.",
            "pos": "noun",
            "sent1": "The rearguard's duty was to ensure no harm came from the rear.",
            "sent2": "In the team, the rearguard was responsible for guarding against back threats.",
            "sent3": "The rearguard jokingly called themselves the 'rear defenders' of the group.",
            "sent4": "The rearguard acted as a shield, safeguarding the team from behind.",
            "sent5": "With the rearguard in place, the team felt secure from any rear dangers."
        }
    ]
}