{
    "term": "rebounds",
    "meanings": [
        {
            "definition": "To bounce back after hitting a surface.",
            "pos": "verb",
            "sent1": "The ball rebounds off the wall.",
            "sent2": "After falling, he quickly rebounds and stands up.",
            "sent3": "The rubber ball always rebounds when thrown on the ground.",
            "sent4": "Her enthusiasm rebounds after a brief moment of disappointment.",
            "sent5": "The boxer rebounds from a punch and counterattacks."
        },
        {
            "definition": "To recover from a setback or failure.",
            "pos": "verb",
            "sent1": "She rebounds from a tough loss and continues to work hard.",
            "sent2": "After a difficult period, he rebounds and achieves success.",
            "sent3": "His mood rebounds after a disappointing day at work.",
            "sent4": "The team rebounds from a losing streak with a series of wins.",
            "sent5": "He rebounds from a mistake by learning from it and improving."
        },
        {
            "definition": "The act of bouncing back after hitting a surface.",
            "pos": "noun",
            "sent1": "The rebound of the ball off the floor was impressive.",
            "sent2": "The rebound of the tennis ball off the racket was swift.",
            "sent3": "The rebound of the ball off the wall surprised the players.",
            "sent4": "The rebound of the basketball off the backboard led to a score.",
            "sent5": "The rebound of the ball off the ground was high and energetic."
        },
        {
            "definition": "The recovery of a basketball after a missed shot.",
            "pos": "noun",
            "sent1": "The player grabbed the rebound and passed it to a teammate.",
            "sent2": "The rebound was crucial in giving the team another scoring opportunity.",
            "sent3": "The rebound of the ball after a missed shot changed the game's momentum.",
            "sent4": "The rebound off the rim was caught by the opposing team.",
            "sent5": "The rebound secured by the center helped the team maintain possession."
        }
    ]
}