{
    "term": "rec",
    "meanings": [
        {
            "definition": "Abbreviation for 'recommendation'",
            "pos": "noun",
            "sent1": "I always follow my doctor's rec for a healthy lifestyle.",
            "sent2": "She gave me a great rec for a new book to read.",
            "sent3": "His rec to wear socks with sandals was quite amusing.",
            "sent4": "Her rec to take a deep breath before speaking was metaphorically enlightening.",
            "sent5": "The rec to drink water regularly was ingrained in my mind."
        },
        {
            "definition": "Abbreviation for 'recreation'",
            "pos": "noun",
            "sent1": "We enjoy going to the park for some rec on weekends.",
            "sent2": "Playing board games is a fun rec for family time.",
            "sent3": "Their rec of playing tag indoors was amusingly chaotic.",
            "sent4": "The rec to relax and unwind was a striking reminder of self-care.",
            "sent5": "The rec to go for a walk in nature was vividly refreshing."
        },
        {
            "definition": "Abbreviation for 'record'",
            "pos": "noun",
            "sent1": "I need to check the rec to see what time the store closes.",
            "sent2": "The rec of my favorite song is scratched from playing it too much.",
            "sent3": "His rec of the meeting was amusingly detailed.",
            "sent4": "The rec of her achievements was metaphorically a roadmap to success.",
            "sent5": "The rec of the race was vividly etched in my memory."
        },
        {
            "definition": "Abbreviation for 'reception'",
            "pos": "noun",
            "sent1": "The rec area in the hotel was beautifully decorated.",
            "sent2": "She waited nervously in the rec for her job interview.",
            "sent3": "Their rec of the event was amusingly exaggerated.",
            "sent4": "The rec of guests was metaphorically like welcoming old friends.",
            "sent5": "The rec of the party was vividly festive."
        },
        {
            "definition": "Abbreviation for 'recovery'",
            "pos": "noun",
            "sent1": "After surgery, the doctor recommended a slow rec process.",
            "sent2": "His rec from the flu was quicker than expected.",
            "sent3": "Their rec from the embarrassing moment was amusingly swift.",
            "sent4": "The rec from heartbreak was metaphorically like finding a new beginning.",
            "sent5": "The rec from the injury was vividly empowering."
        }
    ]
}