{
    "term": "recapitalize",
    "meanings": [
        {
            "definition": "To provide with more capital by issuing additional shares or by increasing the par value of existing shares.",
            "pos": "verb",
            "sent1": "The company decided to recapitalize by issuing more shares to raise funds.",
            "sent2": "After careful consideration, the board voted to recapitalize the business through a share issuance.",
            "sent3": "The CEO joked that they would recapitalize by turning the office coffee machine into a share dispenser.",
            "sent4": "The decision to recapitalize the company was like adding fuel to a struggling engine.",
            "sent5": "In order to survive, the business had to recapitalize and inject fresh capital into its operations."
        },
        {
            "definition": "To change a company's capital structure by increasing the proportion of capital that is in the form of shares rather than debt.",
            "pos": "verb",
            "sent1": "By selling off some assets, the company aimed to recapitalize and shift towards a share-based structure.",
            "sent2": "The financial advisor suggested that the best way to recapitalize was to convert debt into shares.",
            "sent3": "The shareholders were surprised when the company announced plans to recapitalize by turning debts into shares.",
            "sent4": "The decision to recapitalize the business was like rearranging the pieces on a financial chessboard.",
            "sent5": "In a bold move, the company decided to recapitalize and rebalance its financial structure towards shares."
        },
        {
            "definition": "To restore a company's capital to an adequate level by injecting additional funds.",
            "pos": "verb",
            "sent1": "In a strategic move, the investors decided to recapitalize the struggling company with fresh funds.",
            "sent2": "The company's survival depended on the ability to recapitalize and infuse much-needed capital.",
            "sent3": "The accountant suggested a creative way to recapitalize by turning office supplies into cash injections.",
            "sent4": "The decision to recapitalize the business was like giving it a much-needed financial boost.",
            "sent5": "With determination, the management set out to recapitalize and revitalize the company's financial health."
        }
    ]
}