{
    "term": "recalcitrances",
    "meanings": [
        {
            "definition": "Stubbornness or resistance to authority or control.",
            "pos": "noun",
            "sent1": "Her recalcitrances towards her parents often led to arguments.",
            "sent2": "Dealing with the recalcitrances of a toddler can be challenging.",
            "sent3": "The cat's recalcitrances towards taking a bath provided comic relief for the family.",
            "sent4": "The recalcitrances of the old tree roots made it difficult to build the new road.",
            "sent5": "The recalcitrances of the wild horse made it impossible to tame."
        },
        {
            "definition": "The quality or state of being difficult to manage or control.",
            "pos": "noun",
            "sent1": "The recalcitrances of the computer system caused delays in the project.",
            "sent2": "The recalcitrances of the weather made outdoor events unpredictable.",
            "sent3": "The recalcitrances of the puzzle added an extra layer of challenge to the game night.",
            "sent4": "The recalcitrances of the river's current made it hard for the boat to navigate.",
            "sent5": "The recalcitrances of the wild animals in the zoo required extra safety measures."
        },
        {
            "definition": "Unwillingness to obey rules or follow instructions.",
            "pos": "noun",
            "sent1": "His recalcitrances in class resulted in frequent visits to the principal's office.",
            "sent2": "The employee's recalcitrances towards safety protocols raised concerns among the team.",
            "sent3": "The robot's recalcitrances to shut down at the end of the day caused amusement among the engineers.",
            "sent4": "The recalcitrances of the weeds to be pulled out made the garden look unkempt.",
            "sent5": "The recalcitrances of the student to submit assignments on time affected their grades negatively."
        }
    ]
}