{
    "term": "recessives",
    "meanings": [
        {
            "definition": "Relating to or denoting heritable characteristics controlled by genes that are expressed in offspring only when inherited from both parents.",
            "pos": "adjective",
            "sent1": "The child inherited his mother's recessives traits, making his eyes the same color as hers.",
            "sent2": "In genetics, recessives traits are only visible when both parents pass them on to their children.",
            "sent3": "The recessives features in the family always skipped a generation, causing much confusion during family reunions.",
            "sent4": "Her kindness was a recessives quality that shone brightly among her more dominant traits.",
            "sent5": "The recessives characteristics in the puppies made them stand out from the rest of the litter."
        },
        {
            "definition": "Tending to go or move back.",
            "pos": "adjective",
            "sent1": "The recessives tide slowly pulled the boat away from the shore.",
            "sent2": "The car's recessives motion surprised the driver as it started rolling backward.",
            "sent3": "The recessives flow of the river made it difficult for the swimmers to reach the other side.",
            "sent4": "His recessives steps retraced the path he had taken earlier that day.",
            "sent5": "The recessives wind blew the leaves back towards the tree they had fallen from."
        },
        {
            "definition": "A recessive gene or trait.",
            "pos": "noun",
            "sent1": "The genetic counselor explained the concept of recessives to the expectant parents.",
            "sent2": "The presence of recessives in the family history influenced the likelihood of certain traits appearing.",
            "sent3": "The recessives in his family tree were a mystery until a DNA test revealed the hidden traits.",
            "sent4": "The recessives in the gene pool became more apparent as generations passed.",
            "sent5": "The study of recessives played a crucial role in understanding genetic inheritance."
        }
    ]
}