{
    "term": "reciting",
    "meanings": [
        {
            "definition": "Repeat aloud from memory.",
            "pos": "verb",
            "sent1": "She enjoys reciting stories to her friends.",
            "sent2": "He is reciting his favorite poem in front of the class.",
            "sent3": "The parrot started reciting the alphabet after hearing it once.",
            "sent4": "The old clock seemed to be reciting the hours with its steady ticking.",
            "sent5": "Reciting the multiplication table helped her learn it by heart."
        },
        {
            "definition": "Recite a poem.",
            "pos": "verb",
            "sent1": "They will be reciting a famous poem at the event.",
            "sent2": "During the competition, each student had to recite a different poem.",
            "sent3": "The cat seemed to be reciting a poem as it meowed rhythmically.",
            "sent4": "The wind whispered through the trees, reciting a poem of nature.",
            "sent5": "Reciting a poem in front of an audience can be nerve-wracking."
        },
        {
            "definition": "Reciting a prayer.",
            "pos": "noun",
            "sent1": "The monk's daily reciting of prayers brought peace to the monastery.",
            "sent2": "Attending the reciting of prayers at the temple was a calming experience.",
            "sent3": "The reciting of prayers echoed through the quiet chapel.",
            "sent4": "The reciting of prayers seemed to lift a burden off her shoulders.",
            "sent5": "The reciting of prayers united the community in a moment of reflection."
        },
        {
            "definition": "Reciting a list of names.",
            "pos": "verb",
            "sent1": "She was reciting a long list of names for the roll call.",
            "sent2": "Reciting a list of names quickly can be challenging.",
            "sent3": "The robot was reciting a list of names in a mechanical voice.",
            "sent4": "The teacher was reciting a list of names while checking attendance.",
            "sent5": "Reciting a list of names accurately is important for record-keeping."
        }
    ]
}