{
    "term": "reclaim",
    "meanings": [
        {
            "definition": "Retrieve or recover (something previously lost, given, or paid)",
            "pos": "verb",
            "sent1": "I need to reclaim my lost keys from the couch.",
            "sent2": "She wants to reclaim her borrowed book from the library.",
            "sent3": "After searching everywhere, I finally reclaim my missing sock.",
            "sent4": "He was able to reclaim his stolen bike from the thief.",
            "sent5": "The detective worked hard to reclaim the stolen jewels."
        },
        {
            "definition": "Bring (waste land or land formerly under water) into or back into cultivation",
            "pos": "verb",
            "sent1": "Farmers reclaim barren fields to grow crops.",
            "sent2": "The community worked together to reclaim the flooded farmland.",
            "sent3": "With determination, they reclaim the dry desert into a lush garden.",
            "sent4": "The settlers reclaimed the swampy area for their new town.",
            "sent5": "The gardener's goal is to reclaim the neglected garden and make it beautiful again."
        },
        {
            "definition": "Make (someone) admit to a fault or mistake",
            "pos": "verb",
            "sent1": "The evidence will eventually reclaim the culprit's guilt.",
            "sent2": "She tried to reclaim her brother's involvement in the prank.",
            "sent3": "The teacher's clever question helped reclaim the student's error.",
            "sent4": "The detective's interrogation tactics finally reclaimed the suspect's confession.",
            "sent5": "The parent's gentle approach helped reclaim the child's honesty about the broken vase."
        },
        {
            "definition": "Convert (waste materials) into reusable material",
            "pos": "verb",
            "sent1": "The company aims to reclaim plastic bottles for recycling.",
            "sent2": "They plan to reclaim old newspapers to make new paper products.",
            "sent3": "The artist's project is to reclaim scrap metal into beautiful sculptures.",
            "sent4": "The initiative encourages people to reclaim glass jars for repurposing.",
            "sent5": "The workshop teaches how to reclaim old fabric into trendy clothing items."
        }
    ]
}