{
    "term": "recoaling",
    "meanings": [
        {
            "definition": "To supply with coal again.",
            "pos": "verb",
            "sent1": "After the long journey, the steam engine needed recoaling to continue.",
            "sent2": "The workers were recoaling the furnace to keep it running smoothly.",
            "sent3": "The train conductor joked that recoaling the engine was like giving it a warm hug.",
            "sent4": "The ship recoaling at the port resembled a hungry beast devouring its meal.",
            "sent5": "The process of recoaling the locomotive was as essential as breathing for its operation."
        },
        {
            "definition": "To refuel with coal.",
            "pos": "verb",
            "sent1": "The old steamboat was recoaling before setting off on its next voyage.",
            "sent2": "The miners were recoaling their lanterns before descending into the dark mine shaft.",
            "sent3": "The captain announced they would be recoaling the ship before heading out to sea.",
            "sent4": "The locomotive recoaling at the station looked like a giant metal dragon breathing in coal.",
            "sent5": "Recoaling the furnace was a routine task for the workers to keep the factory running smoothly."
        },
        {
            "definition": "The act of refueling with coal.",
            "pos": "noun",
            "sent1": "The recoaling of the steamship was a crucial part of its maintenance.",
            "sent2": "Witnessing the recoaling of the train was a fascinating sight for the passengers.",
            "sent3": "The recoaling of the furnace was like a dance of efficiency and precision for the workers.",
            "sent4": "The recoaling process at the coal plant was a well-oiled machine, ensuring constant energy supply.",
            "sent5": "The recoaling operation at the dock was a synchronized effort of the crew, keeping the ship ready for its next voyage."
        }
    ]
}