{
    "term": "recognition",
    "meanings": [
        {
            "definition": "The action or process of recognizing or being recognized.",
            "pos": "noun",
            "sent1": "Her face lit up with recognition when she saw her old friend.",
            "sent2": "The employee received a certificate in recognition of his hard work.",
            "sent3": "The cat meowed in recognition when its owner walked through the door.",
            "sent4": "The teacher's recognition of the student's effort was like a ray of sunshine in the classroom.",
            "sent5": "The child's eyes widened in recognition as she spotted her favorite toy on the shelf."
        },
        {
            "definition": "Acknowledgment of something's existence, validity, or legality.",
            "pos": "noun",
            "sent1": "The court's recognition of the document as evidence was crucial for the case.",
            "sent2": "The company's recognition of the new policy brought about positive changes.",
            "sent3": "The dog barked in recognition of the mail carrier approaching the house.",
            "sent4": "The recognition of the law's importance was like a beacon guiding society.",
            "sent5": "The student's recognition of the rules helped maintain order in the classroom."
        },
        {
            "definition": "Identification of someone or something from previous encounters or knowledge.",
            "pos": "noun",
            "sent1": "The detective's quick recognition of the suspect led to a swift arrest.",
            "sent2": "The teacher's recognition of the student's handwriting helped grade the papers.",
            "sent3": "The parrot squawked in recognition of its favorite song playing on the radio.",
            "sent4": "The recognition of the mountain peak from afar filled the hikers with excitement.",
            "sent5": "The scientist's recognition of the rare plant species was a significant discovery."
        }
    ]
}