{
    "term": "recrowns",
    "meanings": [
        {
            "definition": "To crown again",
            "pos": "verb",
            "sent1": "After the king lost his crown in battle, the royal jeweler recrowns him with a new one.",
            "sent2": "The dentist recrowns the tooth that had a damaged crown to protect it.",
            "sent3": "The magician recrowns the volunteer from the audience with a hat made of flowers.",
            "sent4": "As the sun sets, the sky recrowns the mountains with a golden glow.",
            "sent5": "The artist recrowns the statue with a shiny new crown, making it look majestic."
        },
        {
            "definition": "To restore or regain a crown",
            "pos": "verb",
            "sent1": "The archaeologist recrowns the ancient statue with its missing crown found in the ruins.",
            "sent2": "The rightful heir recrowns himself after years of exile, reclaiming his throne.",
            "sent3": "The mischievous squirrel recrowns itself with the bird's nest, pretending to be the king of the tree.",
            "sent4": "The champion recrowns himself with the trophy, feeling the weight of victory once more.",
            "sent5": "The storm recrowns the old lighthouse with crashing waves, showing its power over the sea."
        },
        {
            "definition": "To place a crown on someone or something again",
            "pos": "verb",
            "sent1": "The queen recrowns her loyal advisor during the ceremony, honoring his service.",
            "sent2": "The jeweler recrowns the statue of the goddess with a sparkling tiara for the festival.",
            "sent3": "The playful child recrowns the cat with a toy crown, making it the king of the house.",
            "sent4": "The gardener recrowns the rose bush with a wreath of flowers, enhancing its beauty.",
            "sent5": "The chef recrowns the cake with a layer of frosting, making it ready for the celebration."
        }
    ]
}