{
    "term": "recruits",
    "meanings": [
        {
            "definition": "New members enlisted in the armed forces.",
            "pos": "noun",
            "sent1": "The recruits trained hard to become soldiers.",
            "sent2": "The army received a batch of new recruits last week.",
            "sent3": "The recruits joked about their matching uniforms.",
            "sent4": "The recruits were like fresh seeds planted in the military garden.",
            "sent5": "The recruits stood tall, ready to defend their country."
        },
        {
            "definition": "Fresh supplies or reinforcements.",
            "pos": "noun",
            "sent1": "The troops eagerly awaited the arrival of recruits.",
            "sent2": "The recruits brought much-needed ammunition to the battlefield.",
            "sent3": "The recruits were like a breath of fresh air in the stale camp.",
            "sent4": "The recruits were the lifeblood that rejuvenated the exhausted soldiers.",
            "sent5": "The recruits were a welcome sight for the weary army."
        },
        {
            "definition": "To enlist new members.",
            "pos": "verb",
            "sent1": "The military actively recruits young individuals.",
            "sent2": "She recruits talented people to join her team.",
            "sent3": "He recruits new players for the soccer team every season.",
            "sent4": "The company recruits fresh graduates for their internship program.",
            "sent5": "The school recruits volunteers to help with the event."
        },
        {
            "definition": "To seek to enroll new members.",
            "pos": "verb",
            "sent1": "The organization recruits volunteers for community projects.",
            "sent2": "They recruit passionate individuals to support their cause.",
            "sent3": "She recruits helpers for the charity event.",
            "sent4": "He recruits participants for the study through advertisements.",
            "sent5": "The team recruits members who share their values."
        }
    ]
}