{
    "term": "rector",
    "meanings": [
        {
            "definition": "A person who is in charge of a church or parish.",
            "pos": "noun",
            "sent1": "The rector led the Sunday service at the church.",
            "sent2": "The rector is responsible for overseeing the activities of the parish.",
            "sent3": "The rector accidentally mixed up the hymn numbers and caused a bit of confusion.",
            "sent4": "The rector's presence in the church was like a guiding light for the congregation.",
            "sent5": "The rector's kind smile and warm welcome made everyone feel at home in the church."
        },
        {
            "definition": "The head of certain universities or colleges.",
            "pos": "noun",
            "sent1": "As the rector of the university, he made important decisions about academic programs.",
            "sent2": "The rector announced the new scholarship opportunities for students.",
            "sent3": "The rector's hat flew off in the wind, causing a funny moment during the graduation ceremony.",
            "sent4": "The rector's vision for the university was like a beacon of progress and innovation.",
            "sent5": "The rector's passion for education inspired everyone on campus to strive for excellence."
        },
        {
            "definition": "A person appointed to manage an educational institution.",
            "pos": "noun",
            "sent1": "The rector worked closely with the faculty to improve the school's curriculum.",
            "sent2": "Students respected the rector for his dedication to the school's success.",
            "sent3": "The rector's love for coffee was well-known among the staff, earning him the nickname 'The Caffeine Rector'.",
            "sent4": "The rector's leadership style was like a steady hand guiding the ship of education.",
            "sent5": "The rector's door was always open to students seeking advice or support."
        }
    ]
}