{
    "term": "recurve",
    "meanings": [
        {
            "definition": "To curve or bend outward or backward",
            "pos": "verb",
            "sent1": "She watched the tree branch recurve after the strong wind passed.",
            "sent2": "The road seemed to recurve sharply ahead, making it hard to see what was coming.",
            "sent3": "The bend in the river decided to recurve just for fun, surprising the fish swimming by.",
            "sent4": "His back pain made him feel like he needed to recurve his body to find relief.",
            "sent5": "The gymnast's body seemed to naturally recurve as she performed her routine."
        },
        {
            "definition": "A bow with curved limbs that curve away from the archer",
            "pos": "noun",
            "sent1": "The skilled archer preferred using a recurve bow for its accuracy.",
            "sent2": "The recurve bow was beautifully crafted with intricate designs on its limbs.",
            "sent3": "The curious child pretended a tree branch was a recurve bow, aiming at imaginary targets.",
            "sent4": "In the ancient tale, the hero wielded a powerful recurve bow to defeat the dragon.",
            "sent5": "The recurve bow's elegant design made it a favorite among archers in the competition."
        },
        {
            "definition": "A type of fishing hook with a curved point",
            "pos": "noun",
            "sent1": "The fisherman carefully selected a recurve hook for his fishing trip.",
            "sent2": "The recurve hook ensured that the fish stayed securely on the line.",
            "sent3": "The mischievous cat tried to play with the shiny recurve hook, mistaking it for a toy.",
            "sent4": "The fisherman's luck changed when he switched to a recurve hook and caught a big fish.",
            "sent5": "The old fisherman's favorite story was about the one that got away because of a recurve hook failure."
        }
    ]
}