{
    "term": "rededicated",
    "meanings": [
        {
            "definition": "To dedicate again",
            "pos": "verb",
            "sent1": "After the storm destroyed the playground, the community rededicated their efforts to rebuild it.",
            "sent2": "The team rededicated their championship trophy to their coach for his unwavering support.",
            "sent3": "The forgetful student rededicated his time to studying after realizing the exam was the next day.",
            "sent4": "She rededicated her life to helping others, like a beacon of hope in a dark world.",
            "sent5": "The old library was rededicated as a community center, breathing new life into the neighborhood."
        },
        {
            "definition": "To commit or devote oneself anew",
            "pos": "verb",
            "sent1": "Feeling inspired by the marathon, she rededicated herself to training for the next race.",
            "sent2": "The soldier rededicated his service to his country after a life-changing experience.",
            "sent3": "After a weekend of indulgence, he rededicated himself to his diet and exercise routine.",
            "sent4": "She rededicated her heart to love, opening up to new possibilities and experiences.",
            "sent5": "The artist rededicated himself to his craft, creating masterpieces that captured the soul."
        },
        {
            "definition": "To pledge or consecrate once more",
            "pos": "verb",
            "sent1": "The couple rededicated their vows on their 25th wedding anniversary, reaffirming their love.",
            "sent2": "The temple was rededicated with a special ceremony, honoring its historical significance.",
            "sent3": "The team rededicated their efforts to winning the championship, determined to succeed.",
            "sent4": "She rededicated her faith after a period of doubt, finding solace in prayer.",
            "sent5": "The leader rededicated the organization to its original mission, refocusing on its core values."
        }
    ]
}