{
    "term": "rededicate",
    "meanings": [
        {
            "definition": "To dedicate again",
            "pos": "verb",
            "sent1": "After the fire destroyed the church, the community came together to rededicate the rebuilt sanctuary.",
            "sent2": "Every year on their anniversary, the couple would rededicate their love to each other.",
            "sent3": "The forgetful professor had to rededicate his office key for the third time this month.",
            "sent4": "She decided to rededicate herself to her studies, like a warrior sharpening her sword for battle.",
            "sent5": "The artist would rededicate each brush stroke to the memory of her late mentor."
        },
        {
            "definition": "To commit or devote oneself again",
            "pos": "verb",
            "sent1": "Feeling inspired by the cause, she promised to rededicate herself to helping those in need.",
            "sent2": "After a period of distraction, he knew it was time to rededicate himself to his fitness goals.",
            "sent3": "The cat, after a brief nap, decided to rededicate itself to chasing the elusive red dot.",
            "sent4": "Just like a phoenix rising from the ashes, she was ready to rededicate herself to her passion for music.",
            "sent5": "The athlete would rededicate each training session to his dream of winning the championship."
        },
        {
            "definition": "To pledge or promise again",
            "pos": "verb",
            "sent1": "In their wedding vows, they rededicated their commitment to stand by each other through thick and thin.",
            "sent2": "The students gathered to rededicate their support for the school's anti-bullying campaign.",
            "sent3": "The siblings had to rededicate their promise not to eat the last cookie in the jar.",
            "sent4": "As the new year began, she decided to rededicate her resolution to live a healthier lifestyle.",
            "sent5": "The team captain rededicated his loyalty to his teammates, promising to always have their backs on the field."
        }
    ]
}