{
    "term": "redlining",
    "meanings": [
        {
            "definition": "The practice of denying services or loans to certain neighborhoods based on their racial or ethnic composition.",
            "pos": "noun",
            "sent1": "Redlining is unfair because it stops people from getting help in some areas.",
            "sent2": "The bank's redlining policy made it difficult for residents in certain neighborhoods to access loans.",
            "sent3": "I heard a joke that redlining is like drawing a line around a neighborhood and saying, 'No help for you!'",
            "sent4": "The impact of redlining can be seen in the unequal distribution of resources across different communities.",
            "sent5": "Redlining is like a barrier that keeps some neighborhoods from progressing."
        },
        {
            "definition": "To mark or designate certain areas on a map in red to indicate where services or loans will be denied.",
            "pos": "verb",
            "sent1": "The city council decided to redline specific regions on the map to show where services would not be provided.",
            "sent2": "Real estate agents sometimes redline areas to control property values.",
            "sent3": "I accidentally redlined my own neighborhood on the map, making it look off-limits.",
            "sent4": "Redlining areas on a map can have a significant impact on the community's access to resources.",
            "sent5": "The government's decision to redline certain zones affected the residents' ability to receive essential services."
        },
        {
            "definition": "The act of discriminating against certain individuals or groups based on their race or ethnicity.",
            "pos": "noun",
            "sent1": "Redlining based on race is a form of unfair treatment.",
            "sent2": "The company's redlining of job applicants raised concerns about discrimination.",
            "sent3": "It's ridiculous how some people still practice redlining in this day and age.",
            "sent4": "The consequences of redlining can perpetuate inequality in society.",
            "sent5": "Redlining is a harmful practice that divides communities along racial lines."
        }
    ]
}