{
    "term": "redline",
    "meanings": [
        {
            "definition": "The maximum safe engine speed at which an internal combustion engine can operate without causing damage.",
            "pos": "noun",
            "sent1": "When the car's engine reached the redline, it was running at its fastest speed.",
            "sent2": "The mechanic warned not to push the engine past the redline to avoid any harm.",
            "sent3": "The race car driver joked that he could hear the redline calling his name as he accelerated.",
            "sent4": "The redline of the engine was like a barrier, protecting it from going too fast and breaking down.",
            "sent5": "The redline on the tachometer was a clear indicator of when to shift gears for optimal performance."
        },
        {
            "definition": "To mark or highlight something in red.",
            "pos": "verb",
            "sent1": "She used a red pen to redline the important sections of the document.",
            "sent2": "The teacher asked the students to redline any errors in their essays.",
            "sent3": "The artist decided to redline the outline of the painting to make it stand out more.",
            "sent4": "The editor's job was to redline the errors in the manuscript before it went to print.",
            "sent5": "He carefully redlined the key points in the presentation to ensure they were noticed by the audience."
        },
        {
            "definition": "To set a limit or boundary that should not be crossed.",
            "pos": "verb",
            "sent1": "The coach had to redline the rules to prevent any cheating during the game.",
            "sent2": "It's important to redline your spending to stay within your budget.",
            "sent3": "The teacher had to redline the time for the test to ensure fairness for all students.",
            "sent4": "The company decided to redline the number of attendees for safety reasons.",
            "sent5": "The government had to redline the speed limit to maintain road safety for everyone."
        }
    ]
}