{
    "term": "redshifted",
    "meanings": [
        {
            "definition": "(verb) to shift towards longer wavelengths in the electromagnetic spectrum due to the Doppler effect",
            "pos": "verb",
            "sent1": "The star redshifted as it moved away from us, making its light appear more red.",
            "sent2": "The galaxy's light redshifted, indicating it was moving away from Earth.",
            "sent3": "The alien spaceship redshifted its signal to communicate with its distant home planet.",
            "sent4": "Her laughter redshifted across the room, reaching everyone with its infectious joy.",
            "sent5": "The music slowly redshifted, creating a calming and soothing atmosphere in the room."
        },
        {
            "definition": "(adjective) having a shift towards longer wavelengths in the electromagnetic spectrum",
            "pos": "adjective",
            "sent1": "The astronomers observed the redshifted light from the distant galaxy.",
            "sent2": "The telescope captured images of the redshifted stars in the night sky.",
            "sent3": "The redshifted signal was a clear indication of the object's distance from Earth.",
            "sent4": "The redshifted sunset painted the sky with hues of orange and pink.",
            "sent5": "The redshifted glow of the fireflies lit up the dark forest with a magical aura."
        },
        {
            "definition": "(adverb) in a manner that indicates a shift towards longer wavelengths in the electromagnetic spectrum",
            "pos": "adverb",
            "sent1": "The light traveled redshifted through the vacuum of space.",
            "sent2": "The signal from the satellite transmitted redshifted, showing its distance from Earth.",
            "sent3": "The data was sent redshifted to ensure accurate measurements.",
            "sent4": "The sound echoed redshifted through the empty hallways of the old mansion.",
            "sent5": "The colors of the rainbow appeared redshifted as the sun set over the horizon."
        }
    ]
}