{
    "term": "reefing",
    "meanings": [
        {
            "definition": "To shorten sail by taking in one or more reefs.",
            "pos": "verb",
            "sent1": "The sailor was reefing the sail to make it smaller.",
            "sent2": "The captain instructed the crew to start reefing the sails as the storm approached.",
            "sent3": "While reefing the sail, the sailor accidentally got tangled in the ropes.",
            "sent4": "As the wind picked up, the sailor knew it was time to start reefing the sail to stay safe.",
            "sent5": "Reefing the sail quickly became second nature to the experienced sailor."
        },
        {
            "definition": "A portion of a sail rolled and tied up to reduce the area exposed to the wind.",
            "pos": "noun",
            "sent1": "The sailor secured the reefing to keep the sail from flapping in the wind.",
            "sent2": "During the storm, the crew quickly tied down the reefing to prevent damage to the sail.",
            "sent3": "The colorful reefing on the sail added a touch of flair to the boat.",
            "sent4": "The neatly tied reefing on the sail reminded the crew of the importance of proper sail maintenance.",
            "sent5": "The old sail had intricate reefing that showed the craftsmanship of its maker."
        },
        {
            "definition": "A chain of rocks or coral lying at or near the surface of the water.",
            "pos": "noun",
            "sent1": "The divers explored the vibrant reefing teeming with marine life.",
            "sent2": "The boat carefully navigated around the shallow reefing to avoid running aground.",
            "sent3": "The shimmering colors of the reefing beneath the water's surface were mesmerizing.",
            "sent4": "The fragile ecosystem of the reefing required protection from human activities.",
            "sent5": "The sunlight danced on the surface of the clear water above the reefing."
        }
    ]
}