{
    "term": "reests",
    "meanings": [
        {
            "definition": "To pull up by the roots.",
            "pos": "verb",
            "sent1": "She carefully reests the weeds from the garden.",
            "sent2": "The gardener reests the old plants to make space for new ones.",
            "sent3": "The mischievous rabbit reests the carrots from the ground before anyone notices.",
            "sent4": "The storm's strong winds reests the trees from the earth, leaving a barren landscape.",
            "sent5": "With determination, she reests the stubborn tree from the soil, one root at a time."
        },
        {
            "definition": "To tear up by the roots.",
            "pos": "verb",
            "sent1": "The storm's fury reests the flowers from the garden.",
            "sent2": "The farmer reests the old crops to prepare the field for planting.",
            "sent3": "The playful puppy reests the toy from its owner's hands and runs around happily.",
            "sent4": "The strong emotions reests her heart, leaving her feeling raw and exposed.",
            "sent5": "The tornado's power reests the houses from their foundations, scattering debris everywhere."
        },
        {
            "definition": "To uproot or remove completely.",
            "pos": "verb",
            "sent1": "The decision to move reests her from her familiar surroundings.",
            "sent2": "The team reests the invasive species to protect the native plants.",
            "sent3": "The magician's trick seems to reests the coin from thin air.",
            "sent4": "The sudden change in plans reests all sense of stability from the situation.",
            "sent5": "The detective's discovery reests the suspect's alibi, revealing the truth."
        },
        {
            "definition": "A tangled mass of roots and branches.",
            "pos": "noun",
            "sent1": "The fallen tree created a reests of branches and roots in the forest.",
            "sent2": "The old house was hidden behind a reests of overgrown bushes.",
            "sent3": "The explorer encountered a mysterious reests blocking the path through the jungle.",
            "sent4": "The storm left a reests of fallen trees across the road, making it impassable.",
            "sent5": "The ancient tree's roots formed a massive reests that seemed to hold the earth together."
        }
    ]
}