{
    "term": "referring",
    "meanings": [
        {
            "definition": "To mention or allude to someone or something.",
            "pos": "verb",
            "sent1": "She kept referring to her favorite book during the conversation.",
            "sent2": "When discussing movies, he enjoys referring to classic films.",
            "sent3": "The cat kept referring to the empty food bowl, hoping for a refill.",
            "sent4": "His paintings often refer to the beauty of nature, using vibrant colors.",
            "sent5": "The teacher's lesson plan made referring to historical events easy to understand."
        },
        {
            "definition": "To direct someone to a source of information.",
            "pos": "verb",
            "sent1": "The librarian was referring students to the reference section for research materials.",
            "sent2": "When lost, asking a local for directions is a helpful way of referring to a map.",
            "sent3": "The GPS humorously kept referring the driver to take a U-turn, even in an open field.",
            "sent4": "In the digital age, search engines are like modern-day sages, referring us to endless knowledge.",
            "sent5": "The tour guide excelled in referring tourists to hidden gems off the beaten path."
        },
        {
            "definition": "To be relevant or applicable to a particular subject or situation.",
            "pos": "verb",
            "sent1": "Her experience in marketing was directly referring to the job opening.",
            "sent2": "During the debate, the speaker made a point referring to current events.",
            "sent3": "The joke about the broken pencil was surprisingly referring to the math teacher's sense of humor.",
            "sent4": "The old saying 'time is money' cleverly refers to the importance of efficiency.",
            "sent5": "The symbol of the dove referring to peace is recognized worldwide."
        }
    ]
}