{
    "term": "reflexive",
    "meanings": [
        {
            "definition": "Directed or turned back on itself",
            "pos": "adjective",
            "sent1": "The mirror showed a reflexive image of the room.",
            "sent2": "The snake's reflexive behavior saved it from danger.",
            "sent3": "The cat's reflexive fascination with its tail entertained the children.",
            "sent4": "Her reflexive thoughts circled back to the same worries.",
            "sent5": "The river's reflexive surface mirrored the sky perfectly."
        },
        {
            "definition": "Of, relating to, or constituting a reflex",
            "pos": "adjective",
            "sent1": "The doctor explained the reflexive response of the knee.",
            "sent2": "The baby's reflexive grasp surprised everyone.",
            "sent3": "The dog's reflexive bark startled the sleeping cat.",
            "sent4": "His reflexive actions in emergencies were impressive.",
            "sent5": "The plant's reflexive movement towards the sunlight was fascinating."
        },
        {
            "definition": "Marked by or capable of reflection",
            "pos": "adjective",
            "sent1": "Her reflexive nature led her to ponder life's mysteries.",
            "sent2": "The writer's reflexive style resonated with readers.",
            "sent3": "The professor's reflexive humor lightened the lecture.",
            "sent4": "His reflexive decision-making process was thorough.",
            "sent5": "The artist's reflexive paintings revealed deep emotions."
        },
        {
            "definition": "Produced by a reflex action",
            "pos": "adjective",
            "sent1": "The reflexive movement of the hand surprised him.",
            "sent2": "The reflexive sneeze caught her off guard.",
            "sent3": "The reflexive jump at the scary movie made everyone laugh.",
            "sent4": "His reflexive flinch at sudden noises was endearing.",
            "sent5": "The reflexive twitch of the cat's tail showed its annoyance."
        }
    ]
}