{
    "term": "reflagging",
    "meanings": [
        {
            "definition": "To replace a flag on a ship or vessel with a new one.",
            "pos": "verb",
            "sent1": "The sailors were reflagging the ship before setting sail.",
            "sent2": "The crew spent the afternoon reflagging the vessel for the upcoming voyage.",
            "sent3": "After accidentally tearing the flag, they had to quickly start reflagging the ship.",
            "sent4": "The old flag was a symbol of the past, so reflagging represented a fresh start.",
            "sent5": "The process of reflagging made the ship look brand new and ready for adventure."
        },
        {
            "definition": "The act of changing the nationality or registration of a ship by replacing its flag.",
            "pos": "noun",
            "sent1": "The reflagging of the ship was necessary to reflect its new ownership.",
            "sent2": "The reflagging ceremony was a solemn event attended by many dignitaries.",
            "sent3": "During the reflagging, the crew accidentally dropped the new flag into the water.",
            "sent4": "The reflagging of the ship was like giving it a new identity in the vast ocean.",
            "sent5": "The colorful reflagging process brought a sense of pride to the sailors and passengers alike."
        },
        {
            "definition": "The process of updating or renewing a flag on a ship or vessel.",
            "pos": "noun",
            "sent1": "The reflagging of the ship was a routine maintenance task.",
            "sent2": "The captain oversaw the reflagging to ensure it was done correctly.",
            "sent3": "During the reflagging, the crew discovered a hidden message in the old flag.",
            "sent4": "The reflagging process symbolized the ship's commitment to tradition.",
            "sent5": "The meticulous reflagging made the ship stand out among the others in the harbor."
        }
    ]
}