{
    "term": "reflationary",
    "meanings": [
        {
            "definition": "Relating to or characterized by reflation.",
            "pos": "adjective",
            "sent1": "The government implemented a reflationary policy to boost the economy.",
            "sent2": "The central bank's decision to lower interest rates had a reflationary effect on the market.",
            "sent3": "The reflationary measures taken by the authorities made everyone hopeful for better times.",
            "sent4": "Her reflationary approach to managing finances helped her save more money.",
            "sent5": "The reflationary strategy proved successful in stimulating consumer spending."
        },
        {
            "definition": "Tending to promote economic reflation.",
            "pos": "adjective",
            "sent1": "Investing in infrastructure projects can have a reflationary impact on the economy.",
            "sent2": "The company's expansion plans are reflationary in nature, aiming to increase profits.",
            "sent3": "The reflationary policies led to a surge in job opportunities for many.",
            "sent4": "Her reflationary mindset encouraged others to invest in growth-oriented assets.",
            "sent5": "The reflationary measures were crucial in reviving the struggling industry."
        },
        {
            "definition": "Involving or causing a return to a previous level of inflation.",
            "pos": "adjective",
            "sent1": "The reflationary pressures in the market signaled a potential rise in prices.",
            "sent2": "The government's decision to increase spending could have a reflationary impact on the economy.",
            "sent3": "The reflationary trend in the housing market surprised many analysts.",
            "sent4": "Her reflationary forecast turned out to be accurate as prices started to climb.",
            "sent5": "The reflationary environment created opportunities for investors to capitalize on inflation."
        }
    ]
}