{
    "term": "reflexed",
    "meanings": [
        {
            "definition": "Bent or turned backward",
            "pos": "adjective",
            "sent1": "The reflexed leaf pointed in the opposite direction.",
            "sent2": "The reflexed petals of the flower added a unique touch.",
            "sent3": "The reflexed umbrella kept turning inside out in the wind.",
            "sent4": "His reflexed decision to retreat surprised everyone.",
            "sent5": "The reflexed road sign led us in the wrong direction."
        },
        {
            "definition": "Bent or turned back on itself",
            "pos": "adjective",
            "sent1": "The reflexed hose twisted back on itself, causing a kink.",
            "sent2": "The reflexed ribbon formed a loop at the end.",
            "sent3": "The reflexed phone cord tangled up in a funny shape.",
            "sent4": "Her reflexed hair tie created a unique pattern.",
            "sent5": "The reflexed wire formed a perfect circle."
        },
        {
            "definition": "Bent or turned back",
            "pos": "adjective",
            "sent1": "The reflexed edge of the paper curled back slightly.",
            "sent2": "The reflexed corner of the book caught her attention.",
            "sent3": "The reflexed curtain hem fluttered in the breeze.",
            "sent4": "His reflexed arm reached behind to grab the object.",
            "sent5": "The reflexed tree branch bent gracefully in the wind."
        },
        {
            "definition": "Bent or turned back",
            "pos": "adjective",
            "sent1": "The reflexed tail of the cat curled up in contentment.",
            "sent2": "The reflexed handle of the mug fit perfectly in her hand.",
            "sent3": "The reflexed blanket edge kept flipping over.",
            "sent4": "His reflexed elbow accidentally knocked over the cup.",
            "sent5": "The reflexed wire twisted back on itself."
        },
        {
            "definition": "Bent or turned back on itself",
            "pos": "adjective",
            "sent1": "The reflexed hose looped back on itself, creating a knot.",
            "sent2": "The reflexed ribbon formed a beautiful bow.",
            "sent3": "The reflexed phone cord tangled up in a mess.",
            "sent4": "Her reflexed hair tie twisted into a spiral.",
            "sent5": "The reflexed wire coiled back on itself."
        }
    ]
}