{
    "term": "reflectivity",
    "meanings": [
        {
            "definition": "The property of reflecting light or sound.",
            "pos": "noun",
            "sent1": "The reflectivity of the mirror made it perfect for checking your appearance.",
            "sent2": "The reflectivity of the lake's surface made it difficult to see beneath.",
            "sent3": "The magician's cape had such high reflectivity that it seemed to glow on its own.",
            "sent4": "The reflectivity of the glass building made it blend with the sky, creating a stunning effect.",
            "sent5": "The reflectivity of the flashlight beam off the wall helped us find our way in the dark."
        },
        {
            "definition": "The ability to reflect or mirror an image.",
            "pos": "noun",
            "sent1": "Her reflectivity in the polished metal surface showed a clear image.",
            "sent2": "The reflectivity of the water allowed the swans to see their own reflections.",
            "sent3": "The funhouse mirror exaggerated her reflectivity, making her look like a cartoon character.",
            "sent4": "His reflectivity in the car window made him realize he needed a shave.",
            "sent5": "The reflectivity of the makeup mirror helped her apply her lipstick perfectly."
        },
        {
            "definition": "The measure of how much light is reflected by a surface.",
            "pos": "noun",
            "sent1": "The high reflectivity of the snow made sunglasses necessary to avoid glare.",
            "sent2": "The reflectivity of the polished silver plate made it a popular choice for serving food.",
            "sent3": "The low reflectivity of the black wall made the room feel cozy and warm.",
            "sent4": "The reflectivity of the diamond was so intense that it sparkled like a star.",
            "sent5": "The reflectivity of the moon on the water created a magical shimmering effect."
        }
    ]
}