{
    "term": "reflexion",
    "meanings": [
        {
            "definition": "The act of reflecting or the state of being reflected.",
            "pos": "noun",
            "sent1": "Looking at her reflexion in the mirror, she fixed her hair.",
            "sent2": "The lake showed a clear reflexion of the mountains in the distance.",
            "sent3": "His reflexion in the window made him realize he had lipstick on his teeth.",
            "sent4": "The city lights created a beautiful reflexion on the water's surface.",
            "sent5": "The artist captured the reflexion of the sunset in her painting."
        },
        {
            "definition": "A thought occurring in consideration or meditation.",
            "pos": "noun",
            "sent1": "Her reflexion on the matter led her to a decision.",
            "sent2": "During her reflexion, she found a solution to the problem.",
            "sent3": "His reflexion on what to have for dinner was interrupted by a loud noise.",
            "sent4": "In her reflexion, she discovered a new perspective on the issue.",
            "sent5": "The reflexion on her past mistakes helped her grow as a person."
        },
        {
            "definition": "An image produced by reflection.",
            "pos": "noun",
            "sent1": "The reflexion of the tree in the pond looked like a painting.",
            "sent2": "The camera captured a perfect reflexion of the bridge in the water.",
            "sent3": "The distorted reflexion in the funhouse mirror made everyone laugh.",
            "sent4": "The reflexion of the moon on the lake was mesmerizing.",
            "sent5": "The artist painted a beautiful reflexion of the city skyline."
        },
        {
            "definition": "A bending or folding back.",
            "pos": "noun",
            "sent1": "The reflexion of the light off the glass created a rainbow.",
            "sent2": "The reflexion of the road in the mirror made it look longer.",
            "sent3": "The reflexion of the paper airplane showed it flying backwards.",
            "sent4": "The reflexion of the fabric made it seem like it was moving.",
            "sent5": "The reflexion of the ribbon gave the illusion of a loop."
        }
    ]
}