{
    "term": "refractoriness",
    "meanings": [
        {
            "definition": "Stubbornness or resistance to authority or control.",
            "pos": "noun",
            "sent1": "Her refractoriness towards following rules often led to conflicts with her teachers.",
            "sent2": "The child's refractoriness towards bedtime made it challenging for the parents to establish a routine.",
            "sent3": "The cat's refractoriness to wearing a leash resulted in a comical chase around the house.",
            "sent4": "His refractoriness to change was like a solid wall, impossible to break through.",
            "sent5": "The mountain's refractoriness to erosion stood as a testament to its strength and endurance."
        },
        {
            "definition": "The quality of being difficult to manage or control.",
            "pos": "noun",
            "sent1": "The horse's refractoriness made it hard for the trainer to teach it new tricks.",
            "sent2": "The wild nature of the forest added to the refractoriness of the terrain for the hikers.",
            "sent3": "The toddler's refractoriness to nap time turned into a playful game of hide-and-seek.",
            "sent4": "The storm's refractoriness to predictions kept meteorologists on their toes.",
            "sent5": "The puzzle's refractoriness to solving challenged even the most experienced players."
        },
        {
            "definition": "The state of being unmanageable or unruly.",
            "pos": "noun",
            "sent1": "The classroom descended into chaos due to the students' refractoriness during the substitute teacher's lesson.",
            "sent2": "The garden's overgrown plants displayed a certain refractoriness to pruning.",
            "sent3": "The puppy's refractoriness to training turned into a playful game of fetch.",
            "sent4": "The river's refractoriness to stay within its banks caused frequent flooding in the area.",
            "sent5": "The toddler's refractoriness to bedtime turned into a nightly battle of wills with the parents."
        }
    ]
}