{
    "term": "refractorinesses",
    "meanings": [
        {
            "definition": "The quality or state of being refractory.",
            "pos": "noun",
            "sent1": "Her refractorinesses made it challenging to convince her to try new things.",
            "sent2": "The horse's refractorinesses towards training frustrated the owner.",
            "sent3": "The cat's refractorinesses to wearing a costume on Halloween was quite amusing.",
            "sent4": "His refractorinesses to following the rules was like trying to hold back a storm.",
            "sent5": "The child's refractorinesses to bedtime turned into a nightly battle of wills."
        },
        {
            "definition": "The tendency to resist authority or control.",
            "pos": "noun",
            "sent1": "The student's refractorinesses towards the teacher's instructions caused disruptions in class.",
            "sent2": "The prisoner's refractorinesses led to frequent clashes with the prison guards.",
            "sent3": "The toddler's refractorinesses to nap time always resulted in a playful standoff.",
            "sent4": "Her refractorinesses to conforming were like a rebellious melody in a quiet room.",
            "sent5": "The employee's refractorinesses to following the company policies created tension in the workplace."
        },
        {
            "definition": "The quality of being difficult to manage or control.",
            "pos": "noun",
            "sent1": "The puppy's refractorinesses during obedience training required extra patience from the owner.",
            "sent2": "The wildfire's refractorinesses challenged the firefighters' efforts to contain it.",
            "sent3": "The car's refractorinesses to starting on cold mornings was always a hassle.",
            "sent4": "Her refractorinesses to change were like trying to navigate through a maze blindfolded.",
            "sent5": "The plant's refractorinesses to blooming in winter puzzled the gardener."
        }
    ]
}