{
    "term": "regality",
    "meanings": [
        {
            "definition": "The quality or state of being regal.",
            "pos": "noun",
            "sent1": "Her regality shone through in the way she carried herself.",
            "sent2": "The queen's regality was evident in her elegant attire and graceful demeanor.",
            "sent3": "At the costume party, his regality as a king was a hit with everyone admiring his majestic robe.",
            "sent4": "The regality of the ancient castle was a reminder of a bygone era of grandeur and power.",
            "sent5": "The regality of the lion as it walked through the savannah left a lasting impression on the spectators."
        },
        {
            "definition": "Royal status or power.",
            "pos": "noun",
            "sent1": "The king's regality was unquestioned by all his subjects.",
            "sent2": "In the fairy tale, the princess longed for the regality of her royal heritage.",
            "sent3": "The regality of the crown jewels sparkled in the sunlight, captivating all who beheld them.",
            "sent4": "The regality of the grand palace symbolized the authority and influence of the royal family.",
            "sent5": "The regality of the royal procession impressed upon the people the majesty of their rulers."
        },
        {
            "definition": "The rights or privileges of a king or queen.",
            "pos": "noun",
            "sent1": "The regality of the monarch included the power to decree laws and grant titles.",
            "sent2": "The queen's regality allowed her to host grand banquets and diplomatic events.",
            "sent3": "The regality of the royal decree brought both joy and concern to the kingdom's subjects.",
            "sent4": "The regality of the royal pardon granted clemency to the convicted criminal.",
            "sent5": "The regality of the royal charter bestowed new freedoms and opportunities upon the citizens."
        }
    ]
}