{
    "term": "regard",
    "meanings": [
        {
            "definition": "Consideration or attention",
            "pos": "noun",
            "sent1": "She showed great regard for his feelings.",
            "sent2": "In school, teachers always expect students to pay regard to the rules.",
            "sent3": "The cat looked at the mouse with regard, wondering if it would be a good playmate.",
            "sent4": "His regard for nature was evident in the way he carefully tended to his garden.",
            "sent5": "The regard she had for her grandmother was evident in the way she listened to her stories."
        },
        {
            "definition": "Respect or admiration",
            "pos": "noun",
            "sent1": "He held his grandfather in high regard for his wisdom.",
            "sent2": "The community had great regard for the brave firefighters who saved their homes.",
            "sent3": "The puppy wagged its tail in regard for the kind stranger who petted it.",
            "sent4": "Her regard for the talented artist was so great that she collected all his paintings.",
            "sent5": "The regard she had for her mentor was so deep that she followed his advice without question."
        },
        {
            "definition": "Relation or connection",
            "pos": "noun",
            "sent1": "The regard between siblings was evident in their shared laughter.",
            "sent2": "The regard of friendship between them was strong, built on years of trust.",
            "sent3": "The regard of the two countries was strained, leading to tense diplomatic talks.",
            "sent4": "Their regard as cousins meant they always supported each other through thick and thin.",
            "sent5": "The regard of the team members was clear as they worked together seamlessly to achieve their goal."
        },
        {
            "definition": "Gaze or look",
            "pos": "verb",
            "sent1": "She would regard the stars every night before going to bed.",
            "sent2": "The artist regarded the blank canvas, envisioning the masterpiece he would create.",
            "sent3": "The child regarded the mountain of toys with wide eyes, unsure where to start playing.",
            "sent4": "He regarded the old photograph with a mix of nostalgia and sadness.",
            "sent5": "The detective regarded the suspect with a scrutinizing gaze, trying to read his expression."
        }
    ]
}