{
    "term": "regent",
    "meanings": [
        {
            "definition": "A person appointed to administer a country because the monarch is a minor or is absent.",
            "pos": "noun",
            "sent1": "The regent took over the responsibilities of ruling the kingdom in the king's absence.",
            "sent2": "The regent was chosen to govern the land while the young prince grew up.",
            "sent3": "The regent made sure the kingdom ran smoothly even when the king was away.",
            "sent4": "The regent was like a caretaker for the kingdom, ensuring everything was in order.",
            "sent5": "The regent's role was crucial in maintaining stability during the king's absence."
        },
        {
            "definition": "A member of the governing body of a university or other academic institution.",
            "pos": "noun",
            "sent1": "The regent attended the meeting to discuss important decisions for the university.",
            "sent2": "The regent was responsible for overseeing academic matters at the institution.",
            "sent3": "The regent was known for always bringing a sense of wisdom to the university meetings.",
            "sent4": "The regent's influence on the academic policies was highly regarded by the faculty.",
            "sent5": "The regent's dedication to education was evident in every decision made for the university."
        },
        {
            "definition": "Acting as a ruler or governor.",
            "pos": "adjective",
            "sent1": "The regent leader made decisions on behalf of the council.",
            "sent2": "The regent governor was respected for their fair and just rule.",
            "sent3": "The regent ruler's decisions were always met with approval from the people.",
            "sent4": "The regent's leadership style was firm yet compassionate towards the citizens.",
            "sent5": "The regent's authority as a ruler was unquestioned by the kingdom's subjects."
        }
    ]
}