{
    "term": "registrar",
    "meanings": [
        {
            "definition": "An official in charge of keeping records or accounts.",
            "pos": "noun",
            "sent1": "The registrar at the school keeps track of all the students' grades.",
            "sent2": "The hospital registrar ensured that all patient records were up to date.",
            "sent3": "The registrar had a hard time keeping up with all the paperwork during finals week.",
            "sent4": "She was like a human registrar, storing memories and details with precision.",
            "sent5": "The registrar's office was filled with files and documents, like a treasure trove of information."
        },
        {
            "definition": "A person who is responsible for registering students or participants in an event.",
            "pos": "noun",
            "sent1": "The registrar helped new students sign up for classes at orientation.",
            "sent2": "The conference registrar welcomed attendees and provided them with name tags.",
            "sent3": "The registrar made sure everyone was registered for the charity run, even the dogs!",
            "sent4": "She acted as a registrar, ushering in participants and ensuring a smooth registration process.",
            "sent5": "The friendly registrar greeted each student with a smile, making the registration process easy and efficient."
        },
        {
            "definition": "A book or official list of names or events.",
            "pos": "noun",
            "sent1": "The registrar contained a detailed list of all the club members.",
            "sent2": "The wedding registrar recorded the names of the bride, groom, and witnesses.",
            "sent3": "The registrar was so full of names, it looked like a phone book!",
            "sent4": "The registrar served as a historical document, chronicling the important events of the town.",
            "sent5": "The old registrar was a treasure trove of information, revealing the past through its pages."
        }
    ]
}