{
    "term": "registrars",
    "meanings": [
        {
            "definition": "An official in charge of keeping records or accounts.",
            "pos": "noun",
            "sent1": "The registrars at the hospital ensure all patient records are accurately maintained.",
            "sent2": "The registrars at the town hall handle birth and death certificates.",
            "sent3": "The registrars had a race to see who could organize the files the fastest.",
            "sent4": "She was like a human computer, functioning as the registrars of all the family's important documents.",
            "sent5": "The registrars were the unsung heroes of the office, quietly organizing everything behind the scenes."
        },
        {
            "definition": "A person who is responsible for registering students at a school or university.",
            "pos": "noun",
            "sent1": "The registrars at the college helped new students sign up for classes.",
            "sent2": "The registrars processed the enrollment forms for the incoming freshmen.",
            "sent3": "The registrars threw a party to celebrate the end of registration season.",
            "sent4": "She was the gatekeeper of knowledge, acting as the registrars for all the eager learners.",
            "sent5": "The registrars welcomed each student with a smile, making the registration process a breeze."
        },
        {
            "definition": "A person who is responsible for maintaining official records or documents.",
            "pos": "noun",
            "sent1": "The registrars meticulously organized the historical archives in the library.",
            "sent2": "The registrars ensured that all legal documents were securely stored.",
            "sent3": "The registrars joked that they had a secret handshake for accessing the files.",
            "sent4": "He became the family's memory keeper, serving as the registrars of their important papers.",
            "sent5": "The registrars were like the guardians of the past, preserving the documents for future generations."
        }
    ]
}