{
    "term": "reguluses",
    "meanings": [
        {
            "definition": "A small or petty king.",
            "pos": "noun",
            "sent1": "In the story, the reguluses ruled over a tiny kingdom.",
            "sent2": "The reguluses of that land were known for their strict rules.",
            "sent3": "The reguluses thought they were mighty rulers of their small realm.",
            "sent4": "The reguluses' power was like that of a toy crown, easily taken away.",
            "sent5": "The image of the reguluses sitting on their miniature thrones stuck in my mind."
        },
        {
            "definition": "A small or petty ruler.",
            "pos": "noun",
            "sent1": "The reguluses of the neighborhood park enforced the rules strictly.",
            "sent2": "As a reguluses, he made sure everyone followed his commands.",
            "sent3": "The reguluses of the office took their job way too seriously.",
            "sent4": "She acted like a reguluses, trying to control everything around her.",
            "sent5": "The reguluses' authority was comically exaggerated in the small town."
        },
        {
            "definition": "A small or petty prince.",
            "pos": "noun",
            "sent1": "The reguluses of the tiny kingdom was just a young prince.",
            "sent2": "The reguluses' son was being groomed to take over the throne.",
            "sent3": "The reguluses' princely behavior was more like a child playing dress-up.",
            "sent4": "He acted like a reguluses, but his kingdom was no bigger than a dollhouse.",
            "sent5": "The image of the reguluses' son pretending to be a prince was quite amusing."
        },
        {
            "definition": "A small or petty sovereign.",
            "pos": "noun",
            "sent1": "The reguluses of the backyard was the self-proclaimed sovereign of the ants.",
            "sent2": "As the reguluses of the garden, she made sure everything was in order.",
            "sent3": "The reguluses' claim of being a sovereign was met with laughter by the others.",
            "sent4": "She ruled over her reguluses with an iron fist, though they were just toys.",
            "sent5": "The reguluses' reign as a sovereign was as fleeting as a passing breeze."
        }
    ]
}