{
    "term": "regular",
    "meanings": [
        {
            "definition": "Arranged in or constituting a constant or definite pattern, especially with the same space between individual instances.",
            "pos": "adjective",
            "sent1": "The teacher always sits in the regular chair during class.",
            "sent2": "The flowers in the garden grow in a regular pattern.",
            "sent3": "The ants formed a regular line to carry the food.",
            "sent4": "The stars in the sky twinkled in a regular sequence.",
            "sent5": "The clock's ticking was a regular sound in the room."
        },
        {
            "definition": "Following a set rule or pattern; consistent.",
            "pos": "adjective",
            "sent1": "She has a regular routine for her morning exercises.",
            "sent2": "The train arrives at the station at regular intervals.",
            "sent3": "The cat's meows were so regular, it seemed like a song.",
            "sent4": "His heartbeat was as regular as the ticking of a clock.",
            "sent5": "The waves crashing on the shore had a regular rhythm."
        },
        {
            "definition": "Having the same shape or form as others of its kind.",
            "pos": "adjective",
            "sent1": "The cookies were all regular circles.",
            "sent2": "The houses in the neighborhood had regular roofs.",
            "sent3": "The clouds looked like regular cotton candy in the sky.",
            "sent4": "Her handwriting was so regular, it almost looked printed.",
            "sent5": "The trees had regular, symmetrical branches."
        },
        {
            "definition": "Occurring at fixed intervals; periodic.",
            "pos": "adjective",
            "sent1": "The bus arrives at the stop at regular times.",
            "sent2": "The birds' chirping was a regular morning occurrence.",
            "sent3": "The clock's alarm went off at regular intervals.",
            "sent4": "The waves hitting the shore had a regular ebb and flow.",
            "sent5": "The streetlights turned on at regular intervals as the sun set."
        },
        {
            "definition": "Conforming to a standard or pattern; usual, typical, or expected.",
            "pos": "adjective",
            "sent1": "Her grades were regular and consistent throughout the semester.",
            "sent2": "The store had regular business hours every day.",
            "sent3": "The dog's barking was so regular, it became background noise.",
            "sent4": "The flowers bloomed in a regular cycle each season.",
            "sent5": "The clock's ticking was a regular reminder of the passing time."
        }
    ]
}