{
    "term": "rehabilitator",
    "meanings": [
        {
            "definition": "A person who helps someone recover from illness or injury.",
            "pos": "noun",
            "sent1": "The kind rehabilitator assisted the injured bird in getting better.",
            "sent2": "The rehabilitator at the hospital guided the patient through physical therapy.",
            "sent3": "The rehabilitator joked that even the broken toy needed some TLC to heal.",
            "sent4": "She was a rehabilitator of broken hearts, always there to mend the pain.",
            "sent5": "The dedicated rehabilitator worked tirelessly to aid in the recovery process."
        },
        {
            "definition": "A facility or program that helps individuals overcome addiction or other issues.",
            "pos": "noun",
            "sent1": "The local rehabilitator provided counseling services for those struggling with addiction.",
            "sent2": "The rehab center offered various programs to support the residents' journey to sobriety.",
            "sent3": "At the support group, the rehabilitator shared success stories to inspire others.",
            "sent4": "The rehab facility was a beacon of hope for those seeking a fresh start.",
            "sent5": "The community praised the efforts of the rehabilitator in helping people turn their lives around."
        },
        {
            "definition": "The act of restoring someone to health or normal life.",
            "pos": "noun",
            "sent1": "Her rehabilitator after the surgery was diligent in ensuring a smooth recovery.",
            "sent2": "The rehabilitator of the old building brought it back to its former glory.",
            "sent3": "The garden's rehabilitator, the gardener, worked hard to revive the dying plants.",
            "sent4": "The rehabilitator of the antique clock carefully repaired it to its working condition.",
            "sent5": "The rehabilitator of the neglected park transformed it into a vibrant community space."
        }
    ]
}