{
    "term": "reincurring",
    "meanings": [
        {
            "definition": "To happen again",
            "pos": "verb",
            "sent1": "The movie's theme of friendship reincurring throughout the story was heartwarming.",
            "sent2": "The rain kept reincurring every afternoon during the monsoon season.",
            "sent3": "The reincurring visits from the friendly neighborhood cat always brought a smile to my face.",
            "sent4": "Her laughter was like a reincurring melody that brightened up the room.",
            "sent5": "The sound of the church bells reincurring in the distance signaled the start of the evening service."
        },
        {
            "definition": "To occur repeatedly",
            "pos": "verb",
            "sent1": "The issue of pollution reincurring in the city needs urgent attention.",
            "sent2": "His bad habit of procrastination kept reincurring despite his efforts to change.",
            "sent3": "The reincurring jokes from the comedian had the audience in stitches every time.",
            "sent4": "The feeling of deja vu was like a reincurring dream that haunted her thoughts.",
            "sent5": "The reincurring nightmares about falling off a cliff made him dread going to sleep."
        },
        {
            "definition": "To experience again and again",
            "pos": "verb",
            "sent1": "The joy of winning the championship reincurring each year was a testament to their hard work.",
            "sent2": "The feeling of nostalgia kept reincurring whenever she visited her childhood home.",
            "sent3": "The reincurring taste of her grandmother's apple pie brought back fond memories of family gatherings.",
            "sent4": "His kindness was a reincurring theme in the stories shared by those who knew him.",
            "sent5": "The reincurring sound of waves crashing against the shore was a soothing lullaby to her ears."
        }
    ]
}