{
    "term": "reinvested",
    "meanings": [
        {
            "definition": "Invested again",
            "pos": "verb",
            "sent1": "After selling his old car, he reinvested the money in a new business venture.",
            "sent2": "She always reinvested her earnings to grow her savings.",
            "sent3": "The magician reinvested the disappearing coin back into his pocket for another trick.",
            "sent4": "The seeds of hard work he planted in the past were reinvested into a flourishing career.",
            "sent5": "The student reinvested her time and effort into studying for the exam, hoping for better results."
        },
        {
            "definition": "Put money back into an investment",
            "pos": "verb",
            "sent1": "He decided to reinvested his profits from the stock market into buying more shares.",
            "sent2": "The wise investor always reinvested the dividends to maximize returns.",
            "sent3": "The squirrel reinvested its acorn stash back into burying them for the winter.",
            "sent4": "She reinvested her savings into a new business opportunity, hoping for growth.",
            "sent5": "The farmer reinvested his earnings into purchasing new equipment for the farm."
        },
        {
            "definition": "Used profits to make further investments",
            "pos": "verb",
            "sent1": "The entrepreneur reinvested the profits from his first venture into expanding his business.",
            "sent2": "They always reinvested their earnings to create more wealth for the future.",
            "sent3": "The chef reinvested the extra income from the restaurant into experimenting with new recipes.",
            "sent4": "The artist reinvested the money earned from selling paintings into buying better art supplies.",
            "sent5": "The company reinvested its profits into research and development for innovative products."
        }
    ]
}