{
    "term": "reinterring",
    "meanings": [
        {
            "definition": "To bury (a dead body) again.",
            "pos": "verb",
            "sent1": "After the storm, they decided to reinterring their beloved pet in the backyard.",
            "sent2": "The archaeologists were tasked with reinterring the ancient remains in a respectful manner.",
            "sent3": "The ghost joked that it was tired of people reinterring it every Halloween.",
            "sent4": "The memories of the past haunted her, reinterring painful emotions she thought she had buried long ago.",
            "sent5": "The act of reinterring the time capsule symbolized a new beginning for the community."
        },
        {
            "definition": "To place (something) in a grave or tomb.",
            "pos": "verb",
            "sent1": "The family gathered to reinterring the precious heirlooms with their ancestor.",
            "sent2": "The ancient civilization had a tradition of reinterring valuable artifacts with their rulers.",
            "sent3": "The pirate captain insisted on reinterring his treasure map with him when he died.",
            "sent4": "She felt like reinterring her hopes and dreams in a place where they could rest undisturbed.",
            "sent5": "The act of reinterring the time capsule symbolized a new beginning for the community."
        },
        {
            "definition": "To inter again.",
            "pos": "verb",
            "sent1": "The cemetery workers were tasked with reinterring the remains that were accidentally unearthed.",
            "sent2": "The family decided to reinterring the time capsule to mark a special anniversary.",
            "sent3": "The magician's failed trick led to him reinterring the rabbit for a second time.",
            "sent4": "The old tradition of reinterring the deceased in family crypts was still practiced in the village.",
            "sent5": "The act of reinterring the time capsule symbolized a new beginning for the community."
        }
    ]
}