{
    "term": "reincur",
    "meanings": [
        {
            "definition": "To incur again",
            "pos": "verb",
            "sent1": "After paying off his debts, he managed to reincur them by overspending.",
            "sent2": "She was careful not to reincur any unnecessary expenses after learning from her past mistakes.",
            "sent3": "The cat seemed to reincur the wrath of the dog every time it entered the yard.",
            "sent4": "His reckless behavior caused him to reincur the anger of his boss, leading to a second warning.",
            "sent5": "The old bridge's weakened structure made it likely to reincur damage during the storm."
        },
        {
            "definition": "To bring upon oneself again",
            "pos": "verb",
            "sent1": "By ignoring the doctor's advice, he would reincur the risk of getting sick.",
            "sent2": "She didn't want to reincur the disappointment of her friends, so she made sure to keep her promise.",
            "sent3": "The mischievous squirrel managed to reincur the frustration of the gardener by stealing more nuts.",
            "sent4": "Her careless actions would reincur the suspicion of her parents, making it harder to earn their trust.",
            "sent5": "The faulty wiring in the house could reincur a fire if not fixed promptly."
        },
        {
            "definition": "To become liable to again",
            "pos": "verb",
            "sent1": "If he didn't follow the rules, he would reincur the penalty for breaking them.",
            "sent2": "She hoped to reincur the favor of her neighbor by returning the borrowed tools promptly.",
            "sent3": "The forgetful student managed to reincur the teacher's disappointment by forgetting his homework again.",
            "sent4": "Ignoring the warning signs would reincur the danger of getting lost in the forest.",
            "sent5": "The old car was likely to reincur mechanical issues if not properly maintained."
        }
    ]
}