{
    "term": "relaunder",
    "meanings": [
        {
            "definition": "To wash clothes or linens again.",
            "pos": "verb",
            "sent1": "After the rain, I had to relaunder my clothes to get rid of the mud stains.",
            "sent2": "She decided to relaunder the bedsheets to make sure they were extra clean.",
            "sent3": "I accidentally spilled juice on my freshly washed shirt, so I had to relaunder it.",
            "sent4": "The river water was so dirty that it seemed like it could relaunder anything thrown into it.",
            "sent5": "The washing machine broke down, forcing me to relaunder everything by hand."
        },
        {
            "definition": "To process money obtained illegally to make it appear legitimate.",
            "pos": "verb",
            "sent1": "The criminals tried to relaunder the stolen money through various businesses.",
            "sent2": "The investigation revealed a complex scheme to relaunder the illicit funds.",
            "sent3": "The movie plot involved a group of thieves trying to relaunder their loot.",
            "sent4": "The accountant was caught attempting to relaunder company funds for personal gain.",
            "sent5": "The bank implemented strict measures to prevent customers from trying to relaunder money."
        },
        {
            "definition": "A person who launders money.",
            "pos": "noun",
            "sent1": "The authorities arrested the notorious relaunder who had been operating in the city.",
            "sent2": "The relaunder's identity was finally uncovered after months of investigation.",
            "sent3": "In the crime novel, the relaunder turned out to be the least suspected character.",
            "sent4": "The relaunder's lavish lifestyle raised suspicions among the neighbors.",
            "sent5": "The undercover agent posed as a potential client to gather evidence against the relaunder."
        }
    ]
}