{
    "term": "relegate",
    "meanings": [
        {
            "definition": "Consign or dismiss to an inferior rank or position.",
            "pos": "verb",
            "sent1": "The coach decided to relegate the young player to the bench for the next game.",
            "sent2": "In the company, they often relegate new employees to less challenging tasks at first.",
            "sent3": "When the cat refused to catch the mouse, the mouse jokingly threatened to relegate the cat to mouse duty.",
            "sent4": "The old typewriter was relegated to a corner of the attic, gathering dust and memories.",
            "sent5": "The teacher's harsh words seemed to relegate the student to a state of perpetual embarrassment."
        },
        {
            "definition": "Transfer to a less important position.",
            "pos": "verb",
            "sent1": "The manager had to relegate some of the staff to different departments due to budget cuts.",
            "sent2": "After the promotion, she was reluctant to relegate her previous responsibilities to someone else.",
            "sent3": "The superhero accidentally used his powers to relegate his cape to the laundry pile.",
            "sent4": "The fading sunlight seemed to relegate the once vibrant flowers to shadows in the garden.",
            "sent5": "The storm's strong winds threatened to relegate the fragile tent to a crumpled mess."
        },
        {
            "definition": "Assign an inferior rank or position to.",
            "pos": "verb",
            "sent1": "The king would often relegate those who displeased him to the dungeons.",
            "sent2": "She didn't want to relegate her loyal assistant to a lower role, but the decision had to be made.",
            "sent3": "The mischievous elf tried to relegate the grumpy gnome to the role of chief cookie taster.",
            "sent4": "The artist's new masterpiece seemed to relegate all previous works to mere sketches in comparison.",
            "sent5": "The powerful storm threatened to relegate the sturdy tree to a pile of splintered branches."
        }
    ]
}