{
    "term": "relents",
    "meanings": [
        {
            "definition": "To soften in feeling, temper, or determination",
            "pos": "verb",
            "sent1": "After seeing the puppy's sad eyes, she relents and allows it to sleep on the bed.",
            "sent2": "As the sun set, the harsh teacher relents and gives the students a break from studying.",
            "sent3": "The grumpy cat finally relents and purrs contentedly when given a warm blanket.",
            "sent4": "The icy wind relents its fierce blowing, allowing the flowers to sway gently in the breeze.",
            "sent5": "The stubborn rock finally relents to the constant pressure of the flowing river, slowly wearing away over time."
        },
        {
            "definition": "To become less severe or intense",
            "pos": "verb",
            "sent1": "The storm relents, and the rain turns into a light drizzle.",
            "sent2": "When the fever relents, the child's forehead feels cooler to the touch.",
            "sent3": "The angry customer's shouting relents into a quiet grumble as the issue is resolved.",
            "sent4": "As the day progresses, the heat relents, and a cool breeze sweeps through the town.",
            "sent5": "The pain in her ankle finally relents after applying an ice pack for a while."
        },
        {
            "definition": "To give in to someone's wishes or feelings",
            "pos": "verb",
            "sent1": "Despite his initial refusal, he eventually relents and agrees to go to the party.",
            "sent2": "She always relents to her sister's requests for borrowing clothes.",
            "sent3": "The strict parent finally relents and allows their child to stay up past bedtime for a special occasion.",
            "sent4": "The company CEO relents to the demands of the employees for better working conditions.",
            "sent5": "After much persuasion, the landlord relents and lowers the rent for the struggling tenant."
        }
    ]
}