{
    "term": "relegations",
    "meanings": [
        {
            "definition": "The act of relegating someone or something to a lower rank or position.",
            "pos": "noun",
            "sent1": "After the team's poor performance, the coach made several relegations to the bench.",
            "sent2": "The relegations of certain employees led to a more efficient work environment.",
            "sent3": "The relegations of the old toys to the attic made room for new ones in the playroom.",
            "sent4": "Her relegations of outdated ideas allowed for fresh perspectives to emerge.",
            "sent5": "The relegations of the old furniture to the garage created a cozy space in the living room."
        },
        {
            "definition": "The process of transferring a sports team to a lower division.",
            "pos": "noun",
            "sent1": "The relegations of the soccer team disappointed their loyal fans.",
            "sent2": "The relegations of the baseball team affected their chances of winning.",
            "sent3": "The relegations of the chess club to the beginner's league sparked new interest in the game.",
            "sent4": "The relegations of the swim team to a lower division motivated them to train harder.",
            "sent5": "The relegations of the basketball team to a lower league surprised many sports enthusiasts."
        },
        {
            "definition": "The act of assigning someone or something to a less important role or status.",
            "pos": "noun",
            "sent1": "Her relegations of tasks to the intern helped lighten her workload.",
            "sent2": "The relegations of responsibilities to the new employee boosted his confidence.",
            "sent3": "The relegations of dessert duty to the kids brought joy to the family gatherings.",
            "sent4": "His relegations of minor decisions to his assistant allowed him to focus on major issues.",
            "sent5": "The relegations of cleaning chores to the robot vacuum saved time for the homeowners."
        }
    ]
}