{
    "term": "religion",
    "meanings": [
        {
            "definition": "The belief in and worship of a superhuman controlling power, especially a personal God or gods.",
            "pos": "noun",
            "sent1": "Her family practices the same religion every Sunday at the church.",
            "sent2": "Many people find comfort in their religion during difficult times.",
            "sent3": "The cat seemed to have a religion for napping in the sun every afternoon.",
            "sent4": "To him, football was not just a sport but a religion that consumed his thoughts.",
            "sent5": "The religion of kindness and compassion guided her actions towards others."
        },
        {
            "definition": "A particular system of faith and worship.",
            "pos": "noun",
            "sent1": "The ancient civilization had a unique religion that involved multiple deities.",
            "sent2": "Learning about different religions around the world can be fascinating.",
            "sent3": "His religion of always wearing mismatched socks made his friends laugh.",
            "sent4": "In her eyes, music was not just a hobby but a religion that connected souls.",
            "sent5": "The religion of nature's beauty inspired him to protect the environment."
        },
        {
            "definition": "A pursuit or interest to which someone ascribes supreme importance.",
            "pos": "noun",
            "sent1": "For him, fishing was not just a hobby but a religion he followed religiously.",
            "sent2": "Her religion of collecting stamps brought her joy and fulfillment.",
            "sent3": "His religion of always being early to appointments impressed his colleagues.",
            "sent4": "To her, reading was not just a pastime but a religion that enriched her mind.",
            "sent5": "The religion of spreading positivity and kindness brightened the atmosphere around her."
        }
    ]
}