{
    "term": "remanence",
    "meanings": [
        {
            "definition": "The state of being left behind after something has been removed or lost.",
            "pos": "noun",
            "sent1": "The remanence of the cake was the only evidence of the delicious treat that once existed.",
            "sent2": "The remanence of the old building could still be seen in the form of its crumbling walls.",
            "sent3": "As the party ended, only the remanence of laughter and joy lingered in the air.",
            "sent4": "The remanence of her perfume filled the room long after she had left.",
            "sent5": "The remanence of his presence haunted her, like a ghost from the past."
        },
        {
            "definition": "The quality of being enduring or persistent.",
            "pos": "noun",
            "sent1": "Her remanence in the company was a testament to her dedication and hard work.",
            "sent2": "The remanence of his love for her never faded, even after all these years.",
            "sent3": "The remanence of his stubbornness made her smile, knowing he would never change.",
            "sent4": "His remanence in the community was like a rock, unwavering and solid.",
            "sent5": "The remanence of her kindness touched everyone she met, leaving a lasting impact."
        },
        {
            "definition": "The act of remaining or staying behind.",
            "pos": "noun",
            "sent1": "His remanence at the bus stop surprised his friends who thought he had left.",
            "sent2": "The remanence of the students in the classroom indicated they had extra questions.",
            "sent3": "The remanence of the team after the game showed they were discussing their strategy.",
            "sent4": "The remanence of the guests at the party suggested they were enjoying the music.",
            "sent5": "The remanence of the leaves on the tree signaled the arrival of autumn."
        }
    ]
}