{
    "term": "remained",
    "meanings": [
        {
            "definition": "Stayed in the same place",
            "pos": "verb",
            "sent1": "The cat remained on the windowsill all day.",
            "sent2": "She remained seated during the entire meeting.",
            "sent3": "The toy car remained stuck in the mud, refusing to move.",
            "sent4": "His words remained etched in her memory long after he left.",
            "sent5": "The old tree remained rooted in the ground, unmoving for years."
        },
        {
            "definition": "Continued to be in a particular state",
            "pos": "verb",
            "sent1": "The smile remained on her face even in tough times.",
            "sent2": "Despite the challenges, their friendship remained strong.",
            "sent3": "The stain on the shirt remained stubbornly, resisting all attempts to remove it.",
            "sent4": "His passion for music remained unwavering throughout his life.",
            "sent5": "The aroma of freshly baked cookies remained tantalizing in the kitchen."
        },
        {
            "definition": "Stayed behind",
            "pos": "verb",
            "sent1": "He remained at the park while the others went home.",
            "sent2": "The soldier remained behind to cover his team's retreat.",
            "sent3": "The forgotten umbrella remained on the bus stop bench.",
            "sent4": "The mystery novel remained on the shelf, waiting to be read.",
            "sent5": "The lone flower remained in the field, a splash of color in the vast green."
        },
        {
            "definition": "Still in existence",
            "pos": "adjective",
            "sent1": "The remained books on the shelf were old and dusty.",
            "sent2": "Despite the fire, a few remained houses stood strong.",
            "sent3": "The remained ruins of the castle attracted many tourists.",
            "sent4": "In the forest, the remained trees provided shelter for various animals.",
            "sent5": "The remained memories of her childhood brought a smile to her face."
        }
    ]
}