{
    "term": "remembrancer",
    "meanings": [
        {
            "definition": "A person or thing that reminds or helps one remember something.",
            "pos": "noun",
            "sent1": "My sister is like a helpful remembrancer, always reminding me of important tasks.",
            "sent2": "The sticky notes on my desk act as useful remembrancers for my daily to-do list.",
            "sent3": "The friendly parrot became the family's unofficial remembrancer, repeating important messages.",
            "sent4": "Her smile was a constant remembrancer of the joy she brought into our lives.",
            "sent5": "The old clock on the wall served as a reliable remembrancer of the passage of time."
        },
        {
            "definition": "An official who reminds people of important dates or events.",
            "pos": "noun",
            "sent1": "The town crier was the traditional remembrancer for announcing royal proclamations.",
            "sent2": "The calendar on the office wall is a helpful remembrancer for upcoming meetings.",
            "sent3": "The forgetful mayor appointed a town jester as the official remembrancer for important events.",
            "sent4": "The church bells served as a solemn remembrancer of the passing of each hour.",
            "sent5": "The museum guide acted as a knowledgeable remembrancer of historical facts and dates."
        },
        {
            "definition": "A legal document that serves as a reminder or record of a debt or obligation.",
            "pos": "noun",
            "sent1": "The receipt from the store acted as a clear remembrancer of the purchase I made.",
            "sent2": "The contract served as a legal remembrancer of the terms agreed upon by both parties.",
            "sent3": "The old ticket stub became a sentimental remembrancer of the concert I attended.",
            "sent4": "The unpaid bill was a constant remembrancer of the financial obligation hanging over my head.",
            "sent5": "The handwritten note on the fridge served as a personal remembrancer of the groceries to buy."
        }
    ]
}