{
    "term": "remittable",
    "meanings": [
        {
            "definition": "Capable of being remitted.",
            "pos": "adjective",
            "sent1": "The error was remittable and easily corrected.",
            "sent2": "The fee was remittable upon completion of the task.",
            "sent3": "The teacher found the student's mistake quite remittable.",
            "sent4": "Her kindness was a remittable gesture that touched everyone's hearts.",
            "sent5": "The sunset painted the sky in a remittable array of colors."
        },
        {
            "definition": "That may be remitted.",
            "pos": "adjective",
            "sent1": "The overdue payment was finally remittable.",
            "sent2": "The fine for the library book was remittable with a valid excuse.",
            "sent3": "The judge considered the parking ticket to be quite remittable.",
            "sent4": "His guilt was a heavy burden, but it felt remittable after he apologized.",
            "sent5": "The tension in the room was remittable once the joke broke the ice."
        },
        {
            "definition": "Capable of being sent back.",
            "pos": "adjective",
            "sent1": "The package was remittable to the sender for a refund.",
            "sent2": "The faulty product was remittable for a replacement.",
            "sent3": "The boomerang was a fun and remittable toy to play with.",
            "sent4": "His words were like a remittable echo in her mind, repeating over and over.",
            "sent5": "The bird's call was a remittable sound that echoed through the forest."
        },
        {
            "definition": "That may be sent back.",
            "pos": "adjective",
            "sent1": "The defective item was remittable for a full refund.",
            "sent2": "The unwanted gift was remittable to the store for store credit.",
            "sent3": "The lost dog was remittable to its owner thanks to its collar.",
            "sent4": "Her thoughts were like remittable messages sent out into the universe.",
            "sent5": "The memories flooded back like remittable waves crashing on the shore."
        }
    ]
}