{
    "term": "remise",
    "meanings": [
        {
            "definition": "To give up or surrender",
            "pos": "verb",
            "sent1": "She had to remise her dream of becoming an astronaut.",
            "sent2": "The soldier decided to remise his weapon to the enemy.",
            "sent3": "After a long debate, she finally had to remise her argument.",
            "sent4": "In the game of chess, sometimes you have to remise your queen to win.",
            "sent5": "The decision to remise control was difficult but necessary."
        },
        {
            "definition": "To restore or return",
            "pos": "verb",
            "sent1": "He promised to remise the borrowed book by the end of the week.",
            "sent2": "The museum will remise the ancient artifact to its rightful owner.",
            "sent3": "The magician's trick was to remise the vanished coin back into the spectator's hand.",
            "sent4": "The rain helped remise life to the dry, wilted plants.",
            "sent5": "The kind gesture of remising the lost wallet was greatly appreciated."
        },
        {
            "definition": "A place where carriages are kept",
            "pos": "noun",
            "sent1": "The stable was a remise for the horse-drawn carriages.",
            "sent2": "The old mansion had a beautiful remise for the vintage carriages.",
            "sent3": "The remise was filled with the sound of horses neighing and carriages rolling.",
            "sent4": "The remise smelled of hay and leather from the carriages.",
            "sent5": "Visitors were amazed by the grandeur of the remise housing the carriages."
        },
        {
            "definition": "A fencing term for a renewed attack",
            "pos": "noun",
            "sent1": "The fencer surprised his opponent with a quick remise.",
            "sent2": "Her coach taught her the perfect technique for a successful remise.",
            "sent3": "During the fencing match, his remise caught his opponent off guard.",
            "sent4": "The remise was executed with precision and speed.",
            "sent5": "The final point was scored with a powerful remise."
        }
    ]
}