{
    "term": "remonstrating",
    "meanings": [
        {
            "definition": "To say or plead in protest, objection, or disapproval.",
            "pos": "verb",
            "sent1": "She was remonstrating with her parents about staying out late.",
            "sent2": "The students were remonstrating with the principal about the new school rules.",
            "sent3": "The cat was remonstrating with the closed door, demanding to be let in.",
            "sent4": "The thunderstorm outside seemed to be remonstrating with the windows, shaking them violently.",
            "sent5": "The toddler's loud cries were a form of remonstrating, expressing his displeasure at being put to bed."
        },
        {
            "definition": "To argue or reason against something.",
            "pos": "verb",
            "sent1": "He was remonstrating against the idea of cutting down the old tree.",
            "sent2": "The lawyer was remonstrating against the unfair treatment of his client.",
            "sent3": "The dog was remonstrating against the vacuum cleaner, barking loudly at it.",
            "sent4": "The waves crashing against the shore seemed to be remonstrating against the incoming storm.",
            "sent5": "The child was remonstrating with his friends, trying to convince them to play a different game."
        },
        {
            "definition": "To express strong disapproval or disagreement.",
            "pos": "verb",
            "sent1": "She was remonstrating strongly against the new company policy.",
            "sent2": "The protesters were remonstrating loudly outside the government building.",
            "sent3": "The cat was remonstrating with the empty food bowl, meowing in disapproval.",
            "sent4": "The wind was remonstrating with the trees, causing them to sway back and forth.",
            "sent5": "The teacher was remonstrating with the students, unhappy with their lack of effort in class."
        }
    ]
}