{
    "term": "remonstrate",
    "meanings": [
        {
            "definition": "To say or plead in protest, objection, or disapproval.",
            "pos": "verb",
            "sent1": "She remonstrated with her brother for taking her toy without asking.",
            "sent2": "The students remonstrated against the school's decision to cancel the field trip.",
            "sent3": "The cat seemed to remonstrate with the new brand of cat food by refusing to eat it.",
            "sent4": "His loud music was a constant remonstration against the peace and quiet of the neighborhood.",
            "sent5": "The teacher's stern look was a clear remonstration for the students to be quiet."
        },
        {
            "definition": "To argue or reason against something.",
            "pos": "verb",
            "sent1": "He remonstrated with his friend about the dangers of speeding.",
            "sent2": "The lawyer remonstrated against the unfair treatment of his client in court.",
            "sent3": "The toddler tried to remonstrate with his parents about bedtime, but they were firm.",
            "sent4": "Her actions were a silent remonstration against the unjust rules of the company.",
            "sent5": "The scientist's research findings remonstrated against the commonly held beliefs in the field."
        },
        {
            "definition": "To express strong disapproval or disagreement.",
            "pos": "verb",
            "sent1": "The community remonstrated loudly when the city council proposed a new tax increase.",
            "sent2": "She remonstrated with her friend for making a hurtful comment.",
            "sent3": "The dog seemed to remonstrate with the rain by refusing to go outside.",
            "sent4": "His resignation letter was a clear remonstration against the unethical practices of the company.",
            "sent5": "The protesters' signs remonstrated against the government's decision to cut funding for education."
        }
    ]
}