{
    "term": "rencontre",
    "meanings": [
        {
            "definition": "A meeting or encounter between two or more people.",
            "pos": "noun",
            "sent1": "At the park, the unexpected rencontre between old friends brought smiles to their faces.",
            "sent2": "The business rencontre scheduled for tomorrow is crucial for finalizing the deal.",
            "sent3": "During the chance rencontre at the grocery store, they both reached for the same apple.",
            "sent4": "The annual family reunion was a joyous rencontre of laughter and shared memories.",
            "sent5": "In the crowded city streets, a random rencontre with a stranger can lead to new friendships."
        },
        {
            "definition": "A casual or unexpected meeting.",
            "pos": "noun",
            "sent1": "The brief rencontre with a former classmate at the cafe was a pleasant surprise.",
            "sent2": "Their daily morning walk often turned into a spontaneous rencontre with neighbors.",
            "sent3": "At the bookstore, the unexpected rencontre with the author made her day.",
            "sent4": "In the bustling city, a chance rencontre with a street performer can brighten your day.",
            "sent5": "During the picnic, the sudden rencontre with a squirrel stole the spotlight for a moment."
        },
        {
            "definition": "A romantic or sexual encounter.",
            "pos": "noun",
            "sent1": "Their first romantic rencontre under the stars was a moment they would never forget.",
            "sent2": "The steamy romantic rencontre in the movie left the audience in awe.",
            "sent3": "In the romantic comedy, the main characters' first rencontre was filled with awkward charm.",
            "sent4": "The novel described the passionate rencontre between the two lovers in vivid detail.",
            "sent5": "The unexpected romantic rencontre in the rain felt like a scene from a movie."
        }
    ]
}