{
    "term": "renne",
    "meanings": [
        {
            "definition": "To run swiftly",
            "pos": "verb",
            "sent1": "The cheetah can renne across the savannah.",
            "sent2": "I saw the kids renne to catch the ice cream truck.",
            "sent3": "The wind made the leaves renne in circles.",
            "sent4": "Her heart seemed to renne with excitement.",
            "sent5": "The river renne over the rocks, bubbling with energy."
        },
        {
            "definition": "A female deer",
            "pos": "noun",
            "sent1": "The renne gracefully moved through the forest.",
            "sent2": "I spotted a renne with her fawn in the clearing.",
            "sent3": "The renne's ears perked up at the sound of a twig snapping.",
            "sent4": "The renne's coat blended perfectly with the autumn leaves.",
            "sent5": "The renne's gentle eyes watched us from a distance."
        },
        {
            "definition": "To guide or direct a ship",
            "pos": "verb",
            "sent1": "The captain will renne the ship safely into the harbor.",
            "sent2": "He learned how to renne the boat through rough waters.",
            "sent3": "She tried to renne the canoe but ended up going in circles.",
            "sent4": "The lighthouse helped renne the ships away from the dangerous rocks.",
            "sent5": "The experienced sailor can renne any vessel with ease."
        },
        {
            "definition": "To make a loud, harsh noise",
            "pos": "verb",
            "sent1": "The thunder renne through the night, waking everyone up.",
            "sent2": "The old door renne loudly whenever it was opened.",
            "sent3": "The lion's roar seemed to renne through the entire jungle.",
            "sent4": "The alarm clock renne, signaling the start of a new day.",
            "sent5": "The fireworks renne in the sky, lighting up the darkness."
        }
    ]
}