{
    "term": "rentability",
    "meanings": [
        {
            "definition": "The quality or state of being able to be rented.",
            "pos": "noun",
            "sent1": "The rentability of the apartment was high due to its convenient location.",
            "sent2": "Investors consider the rentability of a property before purchasing it.",
            "sent3": "The landlord joked about the rentability of the haunted house, saying ghosts pay rent too.",
            "sent4": "The rentability of the beachfront property was like a golden ticket for the owner.",
            "sent5": "The real estate agent emphasized the rentability of the commercial space to attract potential tenants."
        },
        {
            "definition": "The capacity to generate income through renting.",
            "pos": "noun",
            "sent1": "The rentability of the vacation home was evident from the steady stream of rental bookings.",
            "sent2": "Property owners rely on the rentability of their assets to supplement their income.",
            "sent3": "The rentability of the storage unit business was booming, making the owner quite happy.",
            "sent4": "The rentability of the car rental service was like a well-oiled money-making machine.",
            "sent5": "Understanding the rentability of different properties is crucial for successful real estate investment."
        },
        {
            "definition": "The profitability or financial viability of renting out a property.",
            "pos": "noun",
            "sent1": "The landlord assessed the rentability of the house to determine its potential income.",
            "sent2": "The rentability of the office space was a key factor in the decision to lease it out.",
            "sent3": "The rentability of the old warehouse surprised everyone when it turned out to be a cash cow.",
            "sent4": "The rentability of the apartment complex was the foundation of the property management company's success.",
            "sent5": "Maximizing the rentability of rental properties requires strategic pricing and marketing strategies."
        }
    ]
}