{
    "term": "renunciatory",
    "meanings": [
        {
            "definition": "Of or relating to renunciation.",
            "pos": "adjective",
            "sent1": "Her renunciatory decision to give up sweets for a month surprised her friends.",
            "sent2": "The renunciatory vows taken by the monks showed their dedication to a simple life.",
            "sent3": "The renunciatory act of selling all his belongings to live in a tiny cabin amused his neighbors.",
            "sent4": "Her renunciatory attitude towards material possessions was like a breath of fresh air in our consumerist society.",
            "sent5": "The renunciatory lifestyle of the minimalist guru inspired many to declutter their lives."
        },
        {
            "definition": "Expressing or involving renunciation.",
            "pos": "adjective",
            "sent1": "His renunciatory speech about letting go of past grievances moved the audience.",
            "sent2": "The renunciatory tone of her letter indicated her willingness to move on from the situation.",
            "sent3": "The renunciatory song lyrics about leaving behind the past resonated with listeners.",
            "sent4": "Her renunciatory gestures of forgiveness towards her ex-partner were truly heartfelt.",
            "sent5": "The renunciatory message of the painting was clear: sometimes we must release what no longer serves us."
        },
        {
            "definition": "Tending to renounce.",
            "pos": "adjective",
            "sent1": "His renunciatory behavior towards unhealthy habits impressed his family.",
            "sent2": "The renunciatory nature of her decisions showed her commitment to self-improvement.",
            "sent3": "The renunciatory way he avoided temptations by focusing on his goals was admirable.",
            "sent4": "Her renunciatory approach to negative influences in her life was a key factor in her success.",
            "sent5": "The renunciatory mindset of letting go of distractions helped him achieve his dreams."
        }
    ]
}