{
    "term": "rep",
    "meanings": [
        {
            "definition": "A reputation or standing, especially in a particular field.",
            "pos": "noun",
            "sent1": "Her rep as a talented artist grew quickly.",
            "sent2": "His rep as a reliable mechanic is well-known in the neighborhood.",
            "sent3": "Despite his silly jokes, his rep as a serious student remained intact.",
            "sent4": "The company's rep for quality products attracted many customers.",
            "sent5": "The singer's rep for powerful performances drew large crowds to her concerts."
        },
        {
            "definition": "A representative or agent.",
            "pos": "noun",
            "sent1": "The rep from the company explained the new product features.",
            "sent2": "She works as a rep for a popular clothing brand.",
            "sent3": "The little dog acted as a rep for the larger breed during the competition.",
            "sent4": "The lawyer served as a rep for the defendant in court.",
            "sent5": "The student council rep voiced the concerns of the classmates during the meeting."
        },
        {
            "definition": "To represent or act on behalf of someone or something.",
            "pos": "verb",
            "sent1": "I will rep you at the meeting if you can't make it.",
            "sent2": "She decided to rep her friend's interests in the negotiation.",
            "sent3": "The cat tried to rep its owner by meowing at the door.",
            "sent4": "The actor had to rep the character's emotions convincingly on stage.",
            "sent5": "He always makes sure to rep his family's traditions during the holidays."
        },
        {
            "definition": "To do a specified number of repetitions in exercise.",
            "pos": "verb",
            "sent1": "Make sure to rep each exercise ten times for maximum benefit.",
            "sent2": "She repped the weights with ease at the gym.",
            "sent3": "The dog tried to rep the jumping trick but got distracted by a squirrel.",
            "sent4": "He aimed to rep more push-ups than yesterday to improve his strength.",
            "sent5": "The fitness trainer demonstrated how to rep the proper form for the squat."
        }
    ]
}