{
    "term": "repelled",
    "meanings": [
        {
            "definition": "To drive or force back",
            "pos": "verb",
            "sent1": "The strong wind repelled the leaves from the tree.",
            "sent2": "The knight repelled the enemy troops with his sword.",
            "sent3": "The cat was repelled by the taste of the bitter medicine.",
            "sent4": "Her determination to succeed repelled any doubts that came her way.",
            "sent5": "The repellent spray effectively repelled the mosquitoes."
        },
        {
            "definition": "To cause aversion or distaste in",
            "pos": "verb",
            "sent1": "The foul smell repelled the guests from entering the room.",
            "sent2": "The spoiled food repelled everyone at the picnic.",
            "sent3": "The idea of eating bugs may repel some, but it's a delicacy in other cultures.",
            "sent4": "The gruesome scene in the movie repelled the audience.",
            "sent5": "The taste of the medicine was so repelling that she couldn't swallow it."
        },
        {
            "definition": "To resist or oppose",
            "pos": "verb",
            "sent1": "She repelled the temptation to eat the entire cake.",
            "sent2": "The superhero repelled the villain's attack with ease.",
            "sent3": "The magnet repelled the other magnet when they tried to connect.",
            "sent4": "His strong beliefs repelled any attempts to sway his opinion.",
            "sent5": "The repellent smell of the garbage repelled the rodents from entering the house."
        },
        {
            "definition": "To push away or keep at a distance",
            "pos": "verb",
            "sent1": "The mother bird repelled the predator from her nest.",
            "sent2": "He used a stick to repel the stray dog approaching him.",
            "sent3": "The force field repelled any objects trying to pass through it.",
            "sent4": "The strong magnetic field repelled the metal objects around it.",
            "sent5": "The repellent spray helped repel the ants from invading the kitchen."
        }
    ]
}