{
    "term": "repeater",
    "meanings": [
        {
            "definition": "A person or thing that repeats.",
            "pos": "noun",
            "sent1": "The teacher asked the student to be a repeater and say the answer aloud.",
            "sent2": "The parrot was a repeater, mimicking every word its owner said.",
            "sent3": "The broken record player turned into a repeater, playing the same song over and over.",
            "sent4": "Her little brother was a repeater, echoing her words in a playful manner.",
            "sent5": "The echo in the mountains acted like a repeater, bouncing the sound back to us."
        },
        {
            "definition": "A device that amplifies and retransmits a signal.",
            "pos": "noun",
            "sent1": "The repeater boosted the Wi-Fi signal in the house, making it stronger.",
            "sent2": "The radio station used a repeater to broadcast its signal to a wider area.",
            "sent3": "The repeater in the movie theater made the sound effects extra loud, startling the audience.",
            "sent4": "The repeater in the communication system acted like a messenger, relaying the messages back and forth.",
            "sent5": "The repeater on the mountain peak extended the reach of the emergency distress signal."
        },
        {
            "definition": "A firearm that can fire multiple rounds without reloading.",
            "pos": "noun",
            "sent1": "The soldier carried a repeater during the battle, ready to shoot multiple times.",
            "sent2": "The cowboy's repeater rifle was his trusted companion on the ranch.",
            "sent3": "In the wild west show, the actor's repeater gun shot out confetti instead of bullets.",
            "sent4": "The repeater in the action movie never seemed to run out of bullets, making it seem unreal.",
            "sent5": "The repeater rifle in the museum exhibit showcased the advancements in firearm technology."
        }
    ]
}