{
    "term": "repel",
    "meanings": [
        {
            "definition": "To drive or force back",
            "pos": "verb",
            "sent1": "The strong smell of the garbage can repel pests.",
            "sent2": "The scarecrow helped repel the birds from the cornfield.",
            "sent3": "The idea of eating bugs might repel some people, but they are a good source of protein.",
            "sent4": "Her confidence seemed to repel any doubts that others had about her abilities.",
            "sent5": "The bright colors and loud noises were meant to repel the intruders."
        },
        {
            "definition": "To cause aversion or distaste in",
            "pos": "verb",
            "sent1": "The bitter taste of the medicine can repel children.",
            "sent2": "The foul smell of the garbage can repel visitors from the park.",
            "sent3": "The idea of eating a worm might repel some, but it's a delicacy in some cultures.",
            "sent4": "The gruesome scene in the movie was meant to repel the audience.",
            "sent5": "The strong odor of the cheese seemed to repel even the hungriest of mice."
        },
        {
            "definition": "To resist or oppose",
            "pos": "verb",
            "sent1": "The superhero can repel any attack with her shield.",
            "sent2": "The magnet repels the metal objects due to its polarity.",
            "sent3": "The cat tried to repel the advances of the playful puppy.",
            "sent4": "His determination to succeed seemed to repel any obstacles in his way.",
            "sent5": "The repellent spray is designed to repel mosquitoes and other insects."
        },
        {
            "definition": "To ward off or keep away",
            "pos": "verb",
            "sent1": "The strong scent of the flowers can repel certain insects.",
            "sent2": "The bright light is used to repel the darkness in the room.",
            "sent3": "The scarecrow's job is to repel the birds from the crops.",
            "sent4": "The security system is in place to repel any potential intruders.",
            "sent5": "The strong gust of wind helped repel the rain clouds."
        }
    ]
}