{
    "term": "repped",
    "meanings": [
        {
            "definition": "Represented",
            "pos": "verb",
            "sent1": "She repped her team at the competition.",
            "sent2": "The lawyer repped her client in court.",
            "sent3": "The cat repped its owner by bringing a gift.",
            "sent4": "The sun repped the sky with its bright rays.",
            "sent5": "The flag repped the country's colors proudly."
        },
        {
            "definition": "Reputation",
            "pos": "noun",
            "sent1": "His repped image was well-known in the town.",
            "sent2": "The company's repped suffered after the scandal.",
            "sent3": "The rumor about the ghost repped quickly through the village.",
            "sent4": "Her repped as a talented artist preceded her.",
            "sent5": "The repped of the haunted house kept people away."
        },
        {
            "definition": "Reputation",
            "pos": "noun",
            "sent1": "The restaurant's repped for delicious food attracted many customers.",
            "sent2": "His repped as a reliable mechanic brought in repeat customers.",
            "sent3": "The repped of the old mansion as haunted scared off potential buyers.",
            "sent4": "Her repped as a kind teacher made her students adore her.",
            "sent5": "The repped of the famous actor drew a large crowd to the premiere."
        },
        {
            "definition": "Reputation",
            "pos": "noun",
            "sent1": "The repped of the hotel for excellent service spread far and wide.",
            "sent2": "His repped as a skilled craftsman was well-deserved.",
            "sent3": "The repped of the superhero saving the day was celebrated by all.",
            "sent4": "Her repped as a top chef landed her a cooking show.",
            "sent5": "The repped of the legendary warrior inspired many tales."
        }
    ]
}