{
    "term": "repressive",
    "meanings": [
        {
            "definition": "Inhibiting or restraining a person or group from expressing themselves freely.",
            "pos": "adjective",
            "sent1": "The strict teacher's rules were repressive, not allowing any creativity in the classroom.",
            "sent2": "Living under a repressive government, the citizens had to be careful about what they said.",
            "sent3": "The repressive rain poured down so heavily that even the umbrellas were struggling to stay upright.",
            "sent4": "The repressive grip of fear held the town in its icy embrace, stifling any dissent.",
            "sent5": "The repressive atmosphere in the office made it feel like a suffocating blanket, stifling any sense of individuality."
        },
        {
            "definition": "Characterized by the suppression of freedom or rights.",
            "pos": "adjective",
            "sent1": "The repressive regime cracked down on any form of protest, silencing dissenting voices.",
            "sent2": "The repressive laws limited the citizens' ability to speak out against injustice.",
            "sent3": "The repressive cake frosting refused to let the sprinkles have any fun, keeping them firmly in place.",
            "sent4": "The repressive shadow of oppression loomed over the land, casting a dark pall over the people.",
            "sent5": "The repressive chains of tyranny bound the people, preventing them from reaching their full potential."
        },
        {
            "definition": "Exerting control over someone or something in a harsh or cruel manner.",
            "pos": "adjective",
            "sent1": "The repressive boss constantly monitored his employees, never allowing them any freedom.",
            "sent2": "The repressive dictator ruled with an iron fist, crushing any opposition mercilessly.",
            "sent3": "The repressive alarm clock refused to let anyone hit the snooze button, forcing them out of bed.",
            "sent4": "The repressive grip of addiction held him in its clutches, refusing to let go.",
            "sent5": "The repressive heat of the desert sun beat down relentlessly, sapping their strength with each passing hour."
        }
    ]
}