{
    "term": "res",
    "meanings": [
        {
            "definition": "The thing that is left over after other parts have been taken away.",
            "pos": "noun",
            "sent1": "After eating most of the pizza, only a small res was left for me.",
            "sent2": "She picked up the res of the broken vase and tried to glue it back together.",
            "sent3": "The res of the cake was so tiny, it looked like a crumb!",
            "sent4": "His lonely res in the corner reminded him of the party that once filled the room.",
            "sent5": "The res of the sunset painted the sky in hues of pink and orange."
        },
        {
            "definition": "A particular thing that is referred to.",
            "pos": "noun",
            "sent1": "The res of the story was the mysterious treasure hidden in the old mansion.",
            "sent2": "In the article, the author kept mentioning a res that intrigued the readers.",
            "sent3": "The res of the conversation was the upcoming school dance.",
            "sent4": "Her eyes sparkled as she talked about the res of her dreams.",
            "sent5": "The res of the legend was the magical sword that could only be wielded by the chosen one."
        },
        {
            "definition": "A particular thing that is needed or wanted.",
            "pos": "noun",
            "sent1": "Water is a res for survival in the desert.",
            "sent2": "The lost hiker's res was a warm shelter for the night.",
            "sent3": "His res for the camping trip was a sturdy tent.",
            "sent4": "Love was the res she longed for in her lonely heart.",
            "sent5": "In the cold winter, a cozy fireplace became a res for many."
        },
        {
            "definition": "A particular thing that is done or used.",
            "pos": "noun",
            "sent1": "The chef's secret res in the recipe made the dish unforgettable.",
            "sent2": "Her special res in the dance routine was a graceful twirl.",
            "sent3": "The magician's res for the trick was a hidden compartment in the table.",
            "sent4": "His res for success was hard work and determination.",
            "sent5": "In the play, the sword was a crucial res for the hero to defeat the villain."
        }
    ]
}