{
    "term": "reserve",
    "meanings": [
        {
            "definition": "To keep back or save for future use.",
            "pos": "verb",
            "sent1": "I will reserve some snacks for the movie later.",
            "sent2": "She likes to reserve some money for emergencies.",
            "sent3": "Please reserve your excitement for the surprise party.",
            "sent4": "He tends to reserve his emotions like a tightly sealed jar.",
            "sent5": "The squirrel will reserve nuts for the winter in its cozy burrow."
        },
        {
            "definition": "A supply of something that is stored for future use.",
            "pos": "noun",
            "sent1": "The hotel has a reserve of extra towels for guests.",
            "sent2": "The country keeps a reserve of food for times of need.",
            "sent3": "The reserve of jokes in his mind seemed endless.",
            "sent4": "Her kindness was a reserve that never seemed to run out.",
            "sent5": "The reserve of energy in the battery kept the flashlight bright."
        },
        {
            "definition": "To refrain from using or disclosing.",
            "pos": "verb",
            "sent1": "He decided to reserve his opinion on the matter.",
            "sent2": "She will reserve her comments until after the meeting.",
            "sent3": "The magician will reserve the secret of his trick.",
            "sent4": "She tried to reserve her laughter but couldn't help it.",
            "sent5": "The detective will reserve revealing the suspect's name for later."
        },
        {
            "definition": "A place set aside for a specific purpose.",
            "pos": "noun",
            "sent1": "The park has a reserve for picnics and gatherings.",
            "sent2": "The library has a reserve section for rare books.",
            "sent3": "The secret club had a reserve room for special meetings.",
            "sent4": "The garden had a reserve of flowers for the annual festival.",
            "sent5": "The museum had a reserve of artifacts waiting to be displayed."
        }
    ]
}