{
    "term": "resentences",
    "meanings": [
        {
            "definition": "To impose a new sentence on someone who has already been sentenced for a crime.",
            "pos": "verb",
            "sent1": "The judge decided to resentences the criminal for a harsher punishment.",
            "sent2": "After the appeal, the court chose to resentences the convicted individual.",
            "sent3": "The criminal's lawyer joked, 'Looks like they want to resentences your vacation plans!'",
            "sent4": "The new law allows the court to resentences those who break the rules more severely.",
            "sent5": "The decision to resentences the offender was met with mixed reactions from the public."
        },
        {
            "definition": "To express bitterness or indignation at a perceived injustice or insult.",
            "pos": "verb",
            "sent1": "She resentences the unfair treatment she received at work.",
            "sent2": "He often resentences the way he was treated by his former boss.",
            "sent3": "The child pouted and resentences the fact that he had to go to bed early.",
            "sent4": "Her eyes flashed with resentment as she resentences the rude comment.",
            "sent5": "The protestors gathered to resentences the government's actions against the environment."
        },
        {
            "definition": "To rephrase or rewrite a sentence for clarity or emphasis.",
            "pos": "verb",
            "sent1": "The editor decided to resentences the confusing paragraph for the readers.",
            "sent2": "She always resentences her emails before sending them out.",
            "sent3": "The teacher asked the student to resentences the thesis statement for better understanding.",
            "sent4": "He had to resentences the speech to make it more impactful.",
            "sent5": "The author took time to resentences the ending of the story for a stronger impact."
        }
    ]
}