{
    "term": "reservations",
    "meanings": [
        {
            "definition": "Doubts or hesitations about something",
            "pos": "noun",
            "sent1": "Her reservations about the plan were evident in her furrowed brow.",
            "sent2": "His reservations about the new job opportunity made him hesitant to accept it.",
            "sent3": "Despite her reservations, she decided to give the new restaurant a try.",
            "sent4": "The dark clouds looming overhead cast a shadow of reservations over the picnic.",
            "sent5": "The howling wind outside mirrored the reservations she felt about the upcoming storm."
        },
        {
            "definition": "Arrangements made in advance to secure a service or place",
            "pos": "noun",
            "sent1": "She made reservations at the restaurant for their anniversary dinner.",
            "sent2": "The hotel reservations were confirmed with a quick phone call.",
            "sent3": "His reservations for the flight were all set, but he forgot his passport.",
            "sent4": "The reservations for the concert tickets ensured they had great seats.",
            "sent5": "Making reservations for the tour bus made their vacation planning much smoother."
        },
        {
            "definition": "A feeling of caution or reluctance",
            "pos": "noun",
            "sent1": "His reservations about swimming in the deep ocean were understandable.",
            "sent2": "She approached the unfamiliar task with a sense of reservations.",
            "sent3": "Despite his reservations, he decided to take a leap of faith and try something new.",
            "sent4": "The reservations in her voice indicated her uncertainty about the decision.",
            "sent5": "The subtle reservations in his smile hinted at his hidden concerns."
        },
        {
            "definition": "An area of land set aside for a specific purpose",
            "pos": "noun",
            "sent1": "The national park had a large wildlife reservation for endangered species.",
            "sent2": "The government designated a new reservation for the indigenous community.",
            "sent3": "The reservation for the nature reserve was carefully protected by park rangers.",
            "sent4": "The reservation for the botanical garden showcased a variety of rare plants.",
            "sent5": "Visiting the reservation for the bird sanctuary was a peaceful experience."
        }
    ]
}