{
    "term": "resistants",
    "meanings": [
        {
            "definition": "Having the ability to resist or withstand something.",
            "pos": "adjective",
            "sent1": "The strong metal door was very resistants to any attempts to break it down.",
            "sent2": "The waterproof jacket was designed to be resistants to rain and keep the wearer dry.",
            "sent3": "The little turtle felt very resistants when the raindrops bounced off its shell.",
            "sent4": "Her resolve to finish the marathon was as resistants as a mountain against the wind.",
            "sent5": "The superhero's shield was so resistants that no villain could penetrate it."
        },
        {
            "definition": "A substance that resists a particular process or condition.",
            "pos": "noun",
            "sent1": "The new coating applied to the walls acted as a resistants against stains.",
            "sent2": "The material used in the experiment proved to be a reliable resistants to high temperatures.",
            "sent3": "The cake batter seemed to have a mind of its own, behaving like a resistants to the baking pan.",
            "sent4": "The ancient armor was a resistants against the arrows of the enemy archers.",
            "sent5": "The special paint acted as a resistants to corrosion, keeping the metal surface pristine."
        },
        {
            "definition": "People who resist or oppose something.",
            "pos": "noun",
            "sent1": "The resistants gathered in the town square to protest against the new law.",
            "sent2": "The brave resistants stood firm in their beliefs despite facing criticism.",
            "sent3": "The group of resistants decided to wear matching hats to their peaceful demonstration.",
            "sent4": "The resistants were like a wall of determination against the unjust ruler.",
            "sent5": "The history books praised the resistants for their courage in standing up for what was right."
        }
    ]
}