{
    "term": "resistance",
    "meanings": [
        {
            "definition": "The refusal to accept or comply with something.",
            "pos": "noun",
            "sent1": "Her resistance to change made it difficult to introduce new ideas.",
            "sent2": "The resistance of the group to the new policy was evident in their protests.",
            "sent3": "His resistance to trying new foods led to a comical dinner conversation.",
            "sent4": "The resistance to authority in the story symbolized the characters' fight for freedom.",
            "sent5": "The resistance to change was like a stubborn rock in the river, unyielding and strong."
        },
        {
            "definition": "The ability not to be affected by something.",
            "pos": "noun",
            "sent1": "The plant showed resistance to the harsh weather conditions.",
            "sent2": "His resistance to stress helped him stay calm in difficult situations.",
            "sent3": "The superhero's resistance to bullets was a surprising plot twist.",
            "sent4": "Her resistance to peer pressure was like a shield protecting her from harm.",
            "sent5": "The vaccine provided resistance against the flu virus, keeping him healthy."
        },
        {
            "definition": "The act of fighting against something.",
            "pos": "noun",
            "sent1": "The resistance of the soldiers in battle was commendable.",
            "sent2": "Their resistance to the enemy's advances was crucial for victory.",
            "sent3": "The resistance of the kittens against bath time was adorable.",
            "sent4": "The resistance of the protestors against injustice was inspiring.",
            "sent5": "The resistance of the boxer in the ring was a sight to behold."
        },
        {
            "definition": "The measure of opposition to the flow of an electric current.",
            "pos": "noun",
            "sent1": "The high resistance in the circuit caused a drop in voltage.",
            "sent2": "The resistance of the wire affected the efficiency of the electrical system.",
            "sent3": "The resistance in the circuit made the light bulb flicker.",
            "sent4": "The resistance in the circuit acted like a barrier to the flow of electricity.",
            "sent5": "The resistance in the wire was crucial for controlling the current in the circuit."
        }
    ]
}