{
    "term": "resist",
    "meanings": [
        {
            "definition": "To withstand the action or effect of",
            "pos": "verb",
            "sent1": "The strong walls could resist the wind's force.",
            "sent2": "The umbrella can resist the rain.",
            "sent3": "The superhero's cape could resist even the strongest gusts of wind.",
            "sent4": "Her resolve to resist temptation was as solid as a rock.",
            "sent5": "The armor was designed to resist any attack."
        },
        {
            "definition": "To refrain from yielding to",
            "pos": "verb",
            "sent1": "She tried to resist eating the tempting chocolate cake.",
            "sent2": "It's hard to resist the urge to check your phone constantly.",
            "sent3": "He had to resist the temptation to press all the buttons in the elevator.",
            "sent4": "The child tried to resist the temptation of opening the present early.",
            "sent5": "Resist the temptation to peek before Christmas morning!"
        },
        {
            "definition": "To strive against",
            "pos": "verb",
            "sent1": "The team will resist their opponents with all their might.",
            "sent2": "She had to resist the urge to give up during the marathon.",
            "sent3": "The little engine that could resist the steep hill.",
            "sent4": "He had to resist the strong current while swimming in the river.",
            "sent5": "The plants will resist the harsh weather conditions."
        },
        {
            "definition": "To oppose or withstand",
            "pos": "verb",
            "sent1": "The protestors will resist the new law.",
            "sent2": "The tree roots can resist the force of the storm.",
            "sent3": "The cat tried to resist the bath by clinging to the edge of the tub.",
            "sent4": "The old building managed to resist the earthquake.",
            "sent5": "The team will resist the opponent's attacks in the game."
        },
        {
            "definition": "To refuse to accept or comply with",
            "pos": "verb",
            "sent1": "She will resist the unfair treatment at work.",
            "sent2": "The workers decided to resist the company's new policy.",
            "sent3": "The students will resist the strict rules imposed by the teacher.",
            "sent4": "The community chose to resist the construction of the new highway.",
            "sent5": "The citizens will resist any attempts to limit their freedom."
        }
    ]
}