{
    "term": "resignations",
    "meanings": [
        {
            "definition": "The act of resigning or giving up a position or job.",
            "pos": "noun",
            "sent1": "Many employees submitted their resignations after the company announced layoffs.",
            "sent2": "The CEO's resignation shocked the entire company.",
            "sent3": "When the robot boss demanded resignations from the human workers, chaos ensued.",
            "sent4": "Her resignation from the chess club left her feeling like a pawn in the game of life.",
            "sent5": "The resignations of the entire board of directors made headlines across the city."
        },
        {
            "definition": "The formal statement of giving up a position or job.",
            "pos": "noun",
            "sent1": "The resignations were written on official letterheads and handed to the HR department.",
            "sent2": "After signing the resignation, she felt a mix of relief and uncertainty.",
            "sent3": "The resignation letter was so eloquent that it brought tears to the boss's eyes.",
            "sent4": "His resignation was like a legal contract closing one chapter and opening another.",
            "sent5": "The resignation form had a line for the reason, but she left it blank in silent protest."
        },
        {
            "definition": "The acceptance of fate or a situation without resistance.",
            "pos": "noun",
            "sent1": "Their resignations to the inevitable storm showed their bravery in the face of danger.",
            "sent2": "In the resignation to the reality of the situation, they found peace.",
            "sent3": "The resignation to the rainy weather led to an impromptu indoor picnic.",
            "sent4": "She approached the challenge with a resignation that it was beyond her control.",
            "sent5": "His resignation to the fact that he couldn't change the past allowed him to move forward with hope."
        }
    ]
}