{
    "term": "resistances",
    "meanings": [
        {
            "definition": "The act or power of resisting, opposing, or withstanding",
            "pos": "noun",
            "sent1": "Her resistances to change made it challenging to introduce new ideas.",
            "sent2": "The metal's resistances to bending made it ideal for constructing sturdy structures.",
            "sent3": "The stubborn door showed its resistances by refusing to open for anyone.",
            "sent4": "His resistances to authority were like a shield protecting his independence.",
            "sent5": "The tree's resistances to strong winds showcased its strength and resilience."
        },
        {
            "definition": "The opposition offered by one thing to another",
            "pos": "noun",
            "sent1": "The resistances between the two magnets made them repel each other.",
            "sent2": "The resistances of the puzzle pieces made it challenging to fit them together.",
            "sent3": "The resistances of the rival teams created an intense and exciting match.",
            "sent4": "The resistances of the conflicting ideas clashed in a battle of opinions.",
            "sent5": "The resistances of the traffic jam caused delays for commuters."
        },
        {
            "definition": "The ability to withstand or recover quickly from difficult conditions",
            "pos": "noun",
            "sent1": "His physical resistances allowed him to recover swiftly after the intense workout.",
            "sent2": "The plant's resistances to drought helped it survive in arid environments.",
            "sent3": "The superhero's resistances to extreme temperatures made them almost invincible.",
            "sent4": "The athlete's mental resistances enabled them to push through the toughest challenges.",
            "sent5": "The community's resistances to adversity brought them closer together in times of need."
        }
    ]
}