{
    "term": "resistless",
    "meanings": [
        {
            "definition": "Impossible to resist or oppose.",
            "pos": "adjective",
            "sent1": "The temptation was resistless, and I couldn't help but eat the delicious cake.",
            "sent2": "The magnet's pull was resistless, drawing the metal objects towards it effortlessly.",
            "sent3": "The resistless urge to dance in the rain overtook me, and I twirled around joyfully.",
            "sent4": "Her smile was like a resistless force, brightening up the room instantly.",
            "sent5": "The music's rhythm had a resistless quality that made everyone get up and dance."
        },
        {
            "definition": "Having no resistance or opposition.",
            "pos": "adjective",
            "sent1": "The smooth surface of the ice was resistless, allowing the skater to glide effortlessly.",
            "sent2": "The resistless flow of the river carried the boat downstream without any hindrance.",
            "sent3": "The resistless vacuum cleaner sucked up all the dust and dirt in seconds.",
            "sent4": "Her argument was so resistless that no one dared to challenge her point of view.",
            "sent5": "The resistless wind blew through the open window, scattering papers around the room."
        },
        {
            "definition": "Overpowering in force or effect.",
            "pos": "adjective",
            "sent1": "The resistless storm swept through the town, leaving destruction in its wake.",
            "sent2": "The resistless impact of the news left everyone in shock and disbelief.",
            "sent3": "The resistless laughter of the baby was contagious, making everyone smile.",
            "sent4": "His passion for music was resistless, driving him to practice for hours every day.",
            "sent5": "The resistless aroma of freshly baked bread filled the kitchen, making everyone hungry."
        }
    ]
}