{
    "term": "resistivity",
    "meanings": [
        {
            "definition": "The measure of a material's ability to resist the flow of electric current.",
            "pos": "noun",
            "sent1": "The resistivity of the wire determines how easily electricity can pass through it.",
            "sent2": "Copper has low resistivity, allowing electricity to flow efficiently.",
            "sent3": "The resistivity of the rubber band made it a poor choice for conducting electricity in the science experiment.",
            "sent4": "Her determination to finish the project was like the resistivity of a strong metal against electricity.",
            "sent5": "The resistivity of the material was so high that even a lightning bolt couldn't pass through."
        },
        {
            "definition": "The property of a substance that hinders the flow of heat through it.",
            "pos": "noun",
            "sent1": "Insulation works by increasing the resistivity of the walls, keeping the heat inside.",
            "sent2": "The resistivity of the ceramic material made it ideal for keeping the coffee warm.",
            "sent3": "The resistivity of the ice cube was so high that it refused to melt even in the sun.",
            "sent4": "The resistivity of the blanket was like a shield against the cold winter air.",
            "sent5": "The resistivity of the fabric was so effective that it blocked out all the heat from the sun."
        },
        {
            "definition": "The degree to which a material opposes the passage of magnetic flux.",
            "pos": "noun",
            "sent1": "The resistivity of the metal affected how easily the magnetic field could pass through it.",
            "sent2": "The resistivity of the iron core altered the strength of the electromagnet.",
            "sent3": "The resistivity of the paperclip made it challenging for the magnet to pick it up.",
            "sent4": "The resistivity of the material created a magnetic barrier that repelled the magnets.",
            "sent5": "The resistivity of the substance was so strong that it created a magnetic force field around it."
        }
    ]
}