{
    "term": "resolutions",
    "meanings": [
        {
            "definition": "A firm decision to do or not to do something.",
            "pos": "noun",
            "sent1": "My New Year's resolutions include exercising more and eating healthier.",
            "sent2": "She made a list of resolutions to improve her time management skills.",
            "sent3": "His resolution to wake up early lasted only one day.",
            "sent4": "The resolution to quit smoking was a tough challenge for him.",
            "sent5": "Setting clear resolutions helps in achieving personal goals."
        },
        {
            "definition": "The action of solving a problem, dispute, or contentious matter.",
            "pos": "noun",
            "sent1": "The peaceful resolution of the conflict brought relief to both parties.",
            "sent2": "The team worked together to find a resolution to the issue at hand.",
            "sent3": "Their resolution to decide the matter through a dance-off was unexpected.",
            "sent4": "The resolution of the puzzle required careful attention to detail.",
            "sent5": "The swift resolution of the case impressed everyone involved."
        },
        {
            "definition": "The quality of being determined or resolute.",
            "pos": "noun",
            "sent1": "Her resolution to succeed in her studies was unwavering.",
            "sent2": "His resolution to overcome his fears inspired others around him.",
            "sent3": "The cat showed great resolution in catching the elusive mouse.",
            "sent4": "The mountain climber's resolution to reach the summit was admirable.",
            "sent5": "The resolution in her eyes showed her strong determination."
        },
        {
            "definition": "The process of reducing or separating something into its components.",
            "pos": "noun",
            "sent1": "The resolution of the mixture into its individual substances was complex.",
            "sent2": "Chemists use various techniques for the resolution of chemical compounds.",
            "sent3": "The resolution of the painting revealed hidden details.",
            "sent4": "The resolution of the data into categories made analysis easier.",
            "sent5": "The microscope allowed for the resolution of tiny particles."
        }
    ]
}