{
    "term": "resolves",
    "meanings": [
        {
            "definition": "Settle or find a solution to (a problem or dispute)",
            "pos": "verb",
            "sent1": "She resolves the argument by listening to both sides and finding a fair solution.",
            "sent2": "He always resolves conflicts peacefully, without resorting to violence.",
            "sent3": "The clever cat resolves the dispute between the two dogs by distracting them with a toy.",
            "sent4": "Her calm demeanor resolves conflicts like a gentle breeze dispersing dark clouds.",
            "sent5": "The detective's keen eye resolves mysteries that baffle others."
        },
        {
            "definition": "Decide firmly on a course of action",
            "pos": "verb",
            "sent1": "After much thought, she resolves to pursue her dream of becoming a doctor.",
            "sent2": "He resolves to start exercising regularly to improve his health.",
            "sent3": "The indecisive squirrel finally resolves to climb the tallest tree in the forest.",
            "sent4": "Like a mountain peak, his determination resolves to never waver in the face of challenges.",
            "sent5": "Her unwavering resolve to succeed shines brightly in all her actions."
        },
        {
            "definition": "Make up one's mind",
            "pos": "verb",
            "sent1": "She resolves to go on the trip despite the rainy weather forecast.",
            "sent2": "He finally resolves on the blue paint color for his bedroom walls.",
            "sent3": "The cat takes a long time to resolve between napping in the sun or chasing a butterfly.",
            "sent4": "His mind resolves like a puzzle coming together, making decisions with ease.",
            "sent5": "Her quick resolve in making decisions impresses everyone around her."
        },
        {
            "definition": "Separate or cause to separate into constituent parts or elements",
            "pos": "verb",
            "sent1": "The chemist resolves the mixture into its individual components for analysis.",
            "sent2": "He resolves the tangled wires into neat bundles for better organization.",
            "sent3": "The magician's trick involves resolving a single scarf into multiple scarves.",
            "sent4": "Her ability to resolve complex problems into simple steps amazes her colleagues.",
            "sent5": "The artist's brushstrokes resolve chaos into a beautiful masterpiece."
        }
    ]
}