{
    "term": "resorters",
    "meanings": [
        {
            "definition": "A person who stays at a resort for vacation.",
            "pos": "noun",
            "sent1": "During the summer, many resorters enjoy relaxing by the pool.",
            "sent2": "The resorters checked in at the front desk before heading to their rooms.",
            "sent3": "The resorters joked about having to go back to reality after their vacation.",
            "sent4": "The resorters were like bees buzzing around the resort, exploring every corner.",
            "sent5": "The resorters' laughter filled the air as they shared stories of their day."
        },
        {
            "definition": "A group of people who frequent resorts.",
            "pos": "noun",
            "sent1": "The resorters gathered for their annual trip to the beach resort.",
            "sent2": "The resorters often book their vacations together to enjoy each other's company.",
            "sent3": "The resorters teased each other about who would win the sandcastle building contest.",
            "sent4": "The resorters were a flock of birds migrating to their favorite resort for the season.",
            "sent5": "The resorters' excitement was contagious as they planned their next getaway."
        },
        {
            "definition": "A company that operates resorts.",
            "pos": "noun",
            "sent1": "The resorters' company announced the opening of a new luxury resort in the Caribbean.",
            "sent2": "The resorters' company prided itself on providing top-notch service at all their resorts.",
            "sent3": "The resorters' company CEO dressed up as a resort mascot for the annual employee party.",
            "sent4": "The resorters' company was a well-oiled machine, managing multiple resorts with ease.",
            "sent5": "The resorters' company's success soared as more and more people chose their resorts for vacations."
        }
    ]
}