{
    "term": "resolution",
    "meanings": [
        {
            "definition": "A firm decision to do or not to do something.",
            "pos": "noun",
            "sent1": "After much thought, she made a resolution to exercise every day.",
            "sent2": "His resolution to quit smoking was finally successful.",
            "sent3": "His resolution to eat only vegetables for a month made his friends laugh.",
            "sent4": "Her resolution to be kind to everyone shone brightly in her actions.",
            "sent5": "The resolution to save money for a vacation was a motivating goal."
        },
        {
            "definition": "The action of solving a problem, dispute, or contentious matter.",
            "pos": "noun",
            "sent1": "The peaceful resolution of the conflict brought relief to both parties.",
            "sent2": "The resolution of the puzzle required careful thinking.",
            "sent3": "Their resolution to decide who gets the last cookie turned into a fun game.",
            "sent4": "The resolution of the mystery left everyone in awe.",
            "sent5": "The resolution of the math problem was a satisfying achievement."
        },
        {
            "definition": "The quality of being determined or resolute.",
            "pos": "noun",
            "sent1": "Her resolution to succeed in her studies was unwavering.",
            "sent2": "His resolution in pursuing his dreams inspired others.",
            "sent3": "Their resolution to climb the mountain despite the rain showed their determination.",
            "sent4": "The resolution in her eyes reflected her strong will.",
            "sent5": "The resolution in his voice conveyed his determination clearly."
        },
        {
            "definition": "The smallest interval measurable by a scientific (especially optical) instrument; the degree of sharpness of an image or sound.",
            "pos": "noun",
            "sent1": "The camera's high resolution captured every detail of the landscape.",
            "sent2": "The screen resolution of the new phone made images appear crisp.",
            "sent3": "The resolution of the microscope allowed for precise examination of cells.",
            "sent4": "The high resolution of the telescope revealed distant stars clearly.",
            "sent5": "The resolution of the monitor made watching movies a delightful experience."
        }
    ]
}