{
    "term": "resolving",
    "meanings": [
        {
            "definition": "Settling or finding a solution to a problem or conflict.",
            "pos": "noun",
            "sent1": "Her resolving of the argument brought peace to the group.",
            "sent2": "The resolving of the issue required compromise from both sides.",
            "sent3": "The resolving of the disagreement led to laughter and understanding.",
            "sent4": "His resolving of the conflict was like a key unlocking a door to harmony.",
            "sent5": "The resolving of the puzzle was a satisfying challenge."
        },
        {
            "definition": "Determining or analyzing the components of something.",
            "pos": "verb",
            "sent1": "She was resolving the ingredients needed for the recipe.",
            "sent2": "The scientist spent hours resolving the data from the experiment.",
            "sent3": "The detective was resolving the clues to solve the mystery.",
            "sent4": "His mind was like a computer, resolving the complex equations effortlessly.",
            "sent5": "The artist was resolving the colors to create a beautiful painting."
        },
        {
            "definition": "Making a firm decision or commitment.",
            "pos": "adjective",
            "sent1": "Her resolving attitude made her a reliable friend.",
            "sent2": "The team captain showed a resolving spirit in the face of adversity.",
            "sent3": "His resolving nature made him a trustworthy leader.",
            "sent4": "The oak tree stood tall, its trunk a symbol of strength and resolving power.",
            "sent5": "The old watch had a resolving mechanism that never failed."
        },
        {
            "definition": "Separating into individual components or parts.",
            "pos": "verb",
            "sent1": "The machine was resolving the materials into distinct piles.",
            "sent2": "She was resolving the mixture into its original elements.",
            "sent3": "The magician was resolving the handkerchief into multiple pieces.",
            "sent4": "The artist was resolving the painting into its basic colors.",
            "sent5": "The chef was resolving the dish into separate servings."
        }
    ]
}