{
    "term": "resourced",
    "meanings": [
        {
            "definition": "Provide with resources or necessary supplies.",
            "pos": "verb",
            "sent1": "The teacher resourced the students with new books for the project.",
            "sent2": "The company resourced the team with updated software to improve efficiency.",
            "sent3": "The chef resourced the kitchen with fresh ingredients, making the pantry overflow with possibilities.",
            "sent4": "The coach resourced the team with motivation, fueling their drive to succeed.",
            "sent5": "The gardener resourced the soil with nutrients, transforming the garden into a vibrant oasis."
        },
        {
            "definition": "To equip with resources.",
            "pos": "verb",
            "sent1": "The organization resourced the volunteers with tools for the community cleanup.",
            "sent2": "The IT department resourced the employees with new laptops for remote work.",
            "sent3": "The explorer resourced himself with a map and compass, ready to conquer the unknown terrain.",
            "sent4": "The artist resourced her studio with paints and brushes, preparing to create a masterpiece.",
            "sent5": "The scientist resourced the lab with advanced equipment, ready to conduct groundbreaking experiments."
        },
        {
            "definition": "To supply with resources.",
            "pos": "verb",
            "sent1": "The charity resourced the shelter with blankets and food for the homeless.",
            "sent2": "The government resourced the school with educational materials for the students.",
            "sent3": "The captain resourced the ship with provisions, ensuring a smooth voyage ahead.",
            "sent4": "The farmer resourced the fields with water, nurturing the crops to grow.",
            "sent5": "The librarian resourced the library with new books, expanding the collection for readers."
        }
    ]
}