{
    "term": "resplitting",
    "meanings": [
        {
            "definition": "To split again",
            "pos": "verb",
            "sent1": "After realizing the cake was too big, she decided to resplit it into smaller pieces.",
            "sent2": "The carpenter had to resplit the wood to make it fit the measurements.",
            "sent3": "The magician attempted to resplit the rabbit into two, but ended up with a hat full of carrots instead.",
            "sent4": "Her heart felt like resplitting into a million tiny shards when she heard the sad news.",
            "sent5": "The thunder resplit the silence of the night, startling the sleeping cat."
        },
        {
            "definition": "The act of splitting again",
            "pos": "noun",
            "sent1": "The resplitting of the document caused confusion among the team members.",
            "sent2": "The resplitting of the cake led to equal portions for everyone at the party.",
            "sent3": "The resplitting of the river into multiple streams created a beautiful natural landscape.",
            "sent4": "The resplitting of the atom unleashed immense energy, changing the course of history.",
            "sent5": "The resplitting of the clouds allowed the sun to peek through, brightening up the gloomy day."
        },
        {
            "definition": "To divide into smaller parts again",
            "pos": "verb",
            "sent1": "She had to resplit the large pizza into smaller slices to share with her friends.",
            "sent2": "The chef decided to resplit the ingredients to make individual portions of the dish.",
            "sent3": "The teacher had to resplit the class into smaller groups for the group project.",
            "sent4": "The storm resplit the tree into multiple branches, scattering leaves everywhere.",
            "sent5": "The artist resplit the canvas into sections to work on different parts of the painting."
        }
    ]
}