{
    "term": "resting",
    "meanings": [
        {
            "definition": "Cease work or movement in order to relax or recover strength.",
            "pos": "verb",
            "sent1": "After a long day of playing outside, the tired dog was resting in the shade.",
            "sent2": "I like to spend my weekends resting at home, watching movies and reading books.",
            "sent3": "The busy bee finally decided to take a break, resting on a colorful flower.",
            "sent4": "Her mind was constantly racing with thoughts until she found peace in resting by the calm lake.",
            "sent5": "The old tree, with its branches reaching out, seemed to be resting after years of standing tall."
        },
        {
            "definition": "Be placed or supported so as to stay in a specified position.",
            "pos": "verb",
            "sent1": "The cup was resting on the edge of the table, ready to be knocked over.",
            "sent2": "The book was resting on the shelf, waiting to be picked up and read.",
            "sent3": "The umbrella was resting against the wall, forgotten by its owner.",
            "sent4": "The boat was resting on the calm waters of the lake, gently swaying with the breeze.",
            "sent5": "The cat was resting on the windowsill, enjoying the warmth of the sun on its fur."
        },
        {
            "definition": "Remain or be left in a specified condition.",
            "pos": "verb",
            "sent1": "The decision was resting on his shoulders, causing him great stress.",
            "sent2": "The responsibility of taking care of the garden now rested on her, as her parents were away.",
            "sent3": "The fate of the lost ring rested in the hands of the honest stranger who found it.",
            "sent4": "The success of the project rested on the collaboration of the entire team.",
            "sent5": "The hopes of the town for a bountiful harvest rested on the weather forecast."
        }
    ]
}