{
    "term": "restrict",
    "meanings": [
        {
            "definition": "To limit or control the actions or movements of someone or something.",
            "pos": "verb",
            "sent1": "The teacher had to restrict the students from running in the hallway.",
            "sent2": "The new rules restrict how late we can stay out on school nights.",
            "sent3": "Trying to restrict a cat's curiosity is like trying to hold water in your hands.",
            "sent4": "The boundaries of the game restrict players to certain areas of the field.",
            "sent5": "The magician used a magic spell to restrict the movements of his assistant."
        },
        {
            "definition": "To prevent someone from doing something or limit their ability to do something.",
            "pos": "verb",
            "sent1": "The lock on the door is meant to restrict unauthorized access to the building.",
            "sent2": "The doctor advised him to restrict his sugar intake to improve his health.",
            "sent3": "The mischievous squirrel tried to restrict the birds from reaching the bird feeder.",
            "sent4": "The storm's damage may restrict our ability to travel for a while.",
            "sent5": "The strict diet plan restricts her from eating any sweets."
        },
        {
            "definition": "To impose limitations or constraints on something.",
            "pos": "verb",
            "sent1": "The company decided to restrict the use of company vehicles to work-related purposes only.",
            "sent2": "The government may restrict the amount of water people can use during a drought.",
            "sent3": "The chef's attempt to restrict the ingredients in the recipe led to an interesting new dish.",
            "sent4": "The artist chose to restrict her color palette to black and white for this painting.",
            "sent5": "The software update will restrict access to certain features for security reasons."
        }
    ]
}