{
    "term": "restruck",
    "meanings": [
        {
            "definition": "To strike again",
            "pos": "verb",
            "sent1": "He restruck the nail to make it secure.",
            "sent2": "The blacksmith restruck the hot iron to shape it perfectly.",
            "sent3": "The drummer restruck the drum so hard, he almost broke it!",
            "sent4": "Her words restruck him like a bolt of lightning, making him rethink everything.",
            "sent5": "The teacher restruck the chalkboard to emphasize the important point."
        },
        {
            "definition": "Made by striking again",
            "pos": "adjective",
            "sent1": "The restruck coin had a shiny, fresh appearance.",
            "sent2": "The restruck statue looked even more detailed than the original.",
            "sent3": "The restruck bell had a unique sound that echoed through the valley.",
            "sent4": "Her restruck painting captured the essence of the scene in a new light.",
            "sent5": "The restruck key fit perfectly in the lock, opening the door smoothly."
        },
        {
            "definition": "To impress again",
            "pos": "verb",
            "sent1": "The speaker restruck the audience with his powerful words.",
            "sent2": "The singer restruck the crowd with her beautiful voice.",
            "sent3": "The magician restruck the audience with his amazing tricks.",
            "sent4": "Her kindness restruck him, leaving a lasting impact on his heart.",
            "sent5": "The sunset restruck her, reminding her of the beauty in the world."
        },
        {
            "definition": "To mint again",
            "pos": "verb",
            "sent1": "The mint restruck the coin to improve its quality.",
            "sent2": "The collector restruck the rare coin to increase its value.",
            "sent3": "The jeweler restruck the necklace to add a new design element.",
            "sent4": "The artist restruck the medal, creating a limited edition piece.",
            "sent5": "The company restruck the badge with a new logo for the event."
        }
    ]
}