{
    "term": "rests",
    "meanings": [
        {
            "definition": "To cease work or movement in order to relax or recover strength.",
            "pos": "verb",
            "sent1": "After a long day of playing outside, the tired puppy rests in its cozy bed.",
            "sent2": "Every night, after dinner, my grandfather rests in his favorite armchair.",
            "sent3": "The busy bee decided to rest on a flower and take a break from buzzing around.",
            "sent4": "As the sun sets, the weary traveler finally rests his aching feet by the campfire.",
            "sent5": "The athlete rests before the big race, focusing on conserving energy for the competition."
        },
        {
            "definition": "The remaining part or portion.",
            "pos": "noun",
            "sent1": "After sharing the cake with her friends, only a small piece rests on the plate.",
            "sent2": "When the storm passed, only a few scattered clouds were left as the rest disappeared.",
            "sent3": "The puzzle was almost complete, with only a few pieces left to find where they rest.",
            "sent4": "In the forest, the fallen leaves covered the ground, with the rest still clinging to the trees.",
            "sent5": "As the day ended, the sun dipped below the horizon, leaving the rest of the sky dark and starry."
        },
        {
            "definition": "A support or prop.",
            "pos": "noun",
            "sent1": "The tired hiker leaned on a sturdy tree trunk, using it as a rest during the long trek.",
            "sent2": "The injured bird found a safe rest on the branch, away from predators on the ground.",
            "sent3": "The wobbly table needed a book under one leg to act as a rest and keep it steady.",
            "sent4": "The painter placed his brush on the rest to prevent it from rolling off the table.",
            "sent5": "The musician adjusted the instrument on the rest, ensuring it stayed in the correct position while playing."
        }
    ]
}