{
    "term": "restrainer",
    "meanings": [
        {
            "definition": "A person or thing that restrains or holds back.",
            "pos": "noun",
            "sent1": "The restrainer gently held the excited puppy back from running into the street.",
            "sent2": "The seatbelt in the car acts as a restrainer to keep passengers safe during sudden stops.",
            "sent3": "The mischievous kitten saw the restrainer as a fun challenge to escape from.",
            "sent4": "Her fear of failure was a heavy restrainer on her dreams of becoming an artist.",
            "sent5": "The restrainer's grip on the balloon prevented it from floating away."
        },
        {
            "definition": "A device used to limit or control movement.",
            "pos": "noun",
            "sent1": "The horse's reins acted as a restrainer, guiding its direction.",
            "sent2": "The lock on the gate served as a restrainer to prevent unauthorized entry.",
            "sent3": "The squirmy toddler saw the child safety gate as a fun restrainer to climb over.",
            "sent4": "The thick fog acted as a natural restrainer, limiting visibility on the road.",
            "sent5": "The handcuffs were a strong restrainer, preventing the criminal from escaping."
        },
        {
            "definition": "A person who enforces rules or regulations.",
            "pos": "noun",
            "sent1": "The security guard acted as a restrainer, ensuring only authorized personnel entered the building.",
            "sent2": "The referee in the game served as a restrainer, making sure players followed the rules.",
            "sent3": "The strict teacher was seen as a restrainer by the students who tried to bend the rules.",
            "sent4": "The strict traffic officer was a visible restrainer on the busy intersection.",
            "sent5": "The librarian was a helpful restrainer, ensuring quiet in the reading area."
        }
    ]
}