{
    "term": "resurface",
    "meanings": [
        {
            "definition": "To come to the surface again.",
            "pos": "verb",
            "sent1": "After the storm, the sun made the colorful fish resurface in the pond.",
            "sent2": "The bubbles caused by the diver's movements made the treasure chest resurface.",
            "sent3": "The magician made the coin resurface in an unexpected place, surprising the audience.",
            "sent4": "Her memories of childhood would resurface like bubbles in a fizzy drink, sudden and effervescent.",
            "sent5": "The truth always finds a way to resurface, like a determined swimmer coming up for air."
        },
        {
            "definition": "To appear again after a period of absence.",
            "pos": "verb",
            "sent1": "The stars resurface in the night sky after the passing of the clouds.",
            "sent2": "After years of silence, his old friend finally resurfaced with a phone call.",
            "sent3": "The missing sock decided to resurface in the laundry basket, much to everyone's relief.",
            "sent4": "His childhood fears resurfaced like ghosts in the dark, haunting his dreams.",
            "sent5": "The forgotten memories resurfaced in her mind like old photographs, vivid and nostalgic."
        },
        {
            "definition": "To repair or replace the surface of something.",
            "pos": "verb",
            "sent1": "The workers will resurface the road to make it smooth and safe for driving.",
            "sent2": "It's time to resurface the old wooden table to give it a fresh look.",
            "sent3": "The artist decided to resurface the canvas with a new layer of paint, transforming the artwork.",
            "sent4": "She needed to resurface the swimming pool to fix the cracks and leaks.",
            "sent5": "The carpenter will resurface the floorboards to restore the beauty of the old house."
        }
    ]
}