{
    "term": "resurrectionists",
    "meanings": [
        {
            "definition": "A person who revives or brings back to life.",
            "pos": "noun",
            "sent1": "The talented magician was known as a skilled resurrectionist, able to bring a dead bird back to life.",
            "sent2": "The ancient legend spoke of a powerful sorcerer who was a renowned resurrectionist, capable of resurrecting fallen warriors.",
            "sent3": "At the circus, the clown jokingly referred to himself as a resurrectionist, claiming he could bring laughter back to life.",
            "sent4": "Her kind words acted as a resurrectionist, reviving his spirits after a long and tiring day.",
            "sent5": "The sun rising in the morning sky seemed like a resurrectionist, bringing light and warmth back to the world."
        },
        {
            "definition": "A group of individuals who believe in the resurrection of the dead.",
            "pos": "noun",
            "sent1": "The small community of believers gathered every Sunday as resurrectionists, sharing their faith in life after death.",
            "sent2": "The ancient civilization was known for its group of resurrectionists, who held ceremonies to honor their ancestors.",
            "sent3": "The children playing make-believe pretended to be resurrectionists, imagining they could bring their toys back to life.",
            "sent4": "The music festival attendees felt like resurrectionists, coming together to celebrate the rebirth of live music.",
            "sent5": "The garden blooming in spring was a sight that made the villagers feel like resurrectionists, witnessing new life after the cold winter."
        },
        {
            "definition": "Those who engage in the practice of stealing corpses for medical research.",
            "pos": "noun",
            "sent1": "The dark alley was rumored to be frequented by resurrectionists, who sold stolen bodies to underground labs.",
            "sent2": "In the olden days, stories of resurrectionists roaming graveyards spread fear among the townsfolk.",
            "sent3": "The mischievous children teased each other, pretending to be resurrectionists sneaking around the cemetery.",
            "sent4": "The shadows cast by the moonlight made the trees look like resurrectionists, reaching out for unsuspecting passersby.",
            "sent5": "The eerie silence of the abandoned mansion made it seem like a place where resurrectionists would hide their ghastly deeds."
        }
    ]
}