{
    "term": "resurrect",
    "meanings": [
        {
            "definition": "To bring back to life or existence.",
            "pos": "verb",
            "sent1": "The scientist used a special serum to resurrect the plant that had withered away.",
            "sent2": "The community came together to resurrect the old library and turn it into a vibrant community center.",
            "sent3": "After the power outage, the technician had to resurrect the computer by restarting it.",
            "sent4": "The rain helped resurrect the dried-up river, bringing life back to the surrounding ecosystem.",
            "sent5": "The magical spell was able to resurrect the ancient statue, making it appear as good as new."
        },
        {
            "definition": "To revive or revitalize.",
            "pos": "verb",
            "sent1": "The rain helped resurrect the wilted flowers in the garden.",
            "sent2": "The new marketing campaign was able to resurrect interest in the old product.",
            "sent3": "The comedian's jokes never failed to resurrect laughter from the audience.",
            "sent4": "The music from her childhood was able to resurrect memories of happier times.",
            "sent5": "The coach's pep talk was able to resurrect the team's fighting spirit."
        },
        {
            "definition": "To raise from the dead.",
            "pos": "verb",
            "sent1": "In the movie, the evil sorcerer tried to resurrect an army of zombies to do his bidding.",
            "sent2": "Legends say that a powerful artifact has the ability to resurrect the deceased.",
            "sent3": "The Halloween costume contest featured a creative zombie makeup that looked like it could resurrect the dead.",
            "sent4": "The ancient ritual was believed to have the power to resurrect the pharaohs from their tombs.",
            "sent5": "The ghostly figure seemed to have the ability to resurrect the spirits of the departed."
        }
    ]
}