{
    "term": "retain",
    "meanings": [
        {
            "definition": "To keep possession of",
            "pos": "verb",
            "sent1": "I will retain this book on my shelf.",
            "sent2": "She likes to retain her favorite toys.",
            "sent3": "The magician tried to retain the disappearing rabbit, but it kept vanishing.",
            "sent4": "He tried to retain his balance on the wobbly bridge.",
            "sent5": "The fortress walls retain the ancient secrets within."
        },
        {
            "definition": "To keep in one's memory",
            "pos": "verb",
            "sent1": "I will retain the story you told me.",
            "sent2": "She retains all the lyrics to her favorite songs.",
            "sent3": "I tried to retain the phone number, but it slipped from my mind.",
            "sent4": "The melody retains its place in my memory.",
            "sent5": "The smell of fresh cookies will retain in your memory forever."
        },
        {
            "definition": "To employ by paying a retainer",
            "pos": "verb",
            "sent1": "The lawyer will retain his services for the case.",
            "sent2": "She decided to retain the services of a personal trainer.",
            "sent3": "The company will retain the graphic designer for future projects.",
            "sent4": "He chose to retain the accountant for tax purposes.",
            "sent5": "The artist will retain the services of a model for the painting."
        },
        {
            "definition": "To hold secure",
            "pos": "verb",
            "sent1": "Please retain the door closed for safety.",
            "sent2": "The lock will retain the valuables inside.",
            "sent3": "The fence helps retain the dog in the yard.",
            "sent4": "The seatbelt will retain you in the car during the ride.",
            "sent5": "The net will retain the soccer ball from going out of bounds."
        },
        {
            "definition": "To keep in place",
            "pos": "verb",
            "sent1": "The glue will retain the pieces together.",
            "sent2": "She used pins to retain the fabric in place.",
            "sent3": "The magnet will retain the paper on the fridge.",
            "sent4": "The clamp will retain the wood during the project.",
            "sent5": "The roots retain the tree firmly in the ground."
        }
    ]
}