{
    "term": "retaining",
    "meanings": [
        {
            "definition": "To keep possession of",
            "pos": "verb",
            "sent1": "She is retaining her favorite toy.",
            "sent2": "He is retaining ownership of the house.",
            "sent3": "The magician's trick involves retaining the coin in his hand.",
            "sent4": "The fortress is like a guardian, retaining its treasures within.",
            "sent5": "The key to success is retaining focus on your goals."
        },
        {
            "definition": "To hold back",
            "pos": "verb",
            "sent1": "The dam is retaining the water flow.",
            "sent2": "He is retaining his emotions during the argument.",
            "sent3": "The teacher had a hard time retaining the students' attention.",
            "sent4": "Her smile was like a dam, retaining the flood of tears.",
            "sent5": "The barrier is crucial for retaining the crowd at the event."
        },
        {
            "definition": "To support or maintain",
            "pos": "verb",
            "sent1": "The pillars are retaining the weight of the roof.",
            "sent2": "She is retaining the balance on the tightrope.",
            "sent3": "The tree is retaining the swing without any issues.",
            "sent4": "His friendship acts as a pillar, retaining her spirits high.",
            "sent5": "The foundation is crucial for retaining the stability of the building."
        },
        {
            "definition": "To remember or recall",
            "pos": "verb",
            "sent1": "He is retaining the lyrics of the song.",
            "sent2": "She is retaining the details of the story.",
            "sent3": "The old man had trouble retaining the names of his grandchildren.",
            "sent4": "Her memory is like a vault, retaining all the important moments.",
            "sent5": "The diary is essential for retaining the memories of the past."
        },
        {
            "definition": "To keep in place",
            "pos": "verb",
            "sent1": "The fence is retaining the animals in the pasture.",
            "sent2": "He is retaining the lid on the jar.",
            "sent3": "The glue is retaining the pieces of the puzzle together.",
            "sent4": "His words acted as a barrier, retaining her from leaving.",
            "sent5": "The lock is crucial for retaining the door closed securely."
        }
    ]
}