{
    "term": "retine",
    "meanings": [
        {
            "definition": "To hold or keep",
            "pos": "verb",
            "sent1": "She will retine the book tightly in her hands.",
            "sent2": "Please retine the door closed to prevent it from swinging open.",
            "sent3": "He tried to retine his laughter during the serious meeting.",
            "sent4": "The old tree roots retine the soil, preventing erosion.",
            "sent5": "The magician's spell seemed to retine time itself."
        },
        {
            "definition": "To retain possession of",
            "pos": "verb",
            "sent1": "I will retine my favorite toy forever.",
            "sent2": "He managed to retine ownership of the family heirloom.",
            "sent3": "The squirrel tried to retine the acorn from the mischievous raccoon.",
            "sent4": "Her smile could retine the attention of everyone in the room.",
            "sent5": "The ancient artifact seemed to retine its mystical powers."
        },
        {
            "definition": "To keep in mind or memory",
            "pos": "verb",
            "sent1": "I will retine your birthday in my memory forever.",
            "sent2": "It's important to retine important dates in your mind.",
            "sent3": "She tried to retine the complex equation in her mind during the test.",
            "sent4": "The melody of the song will retine in your memory long after it ends.",
            "sent5": "The wise words of her grandmother always retine in her heart."
        },
        {
            "definition": "To keep in place",
            "pos": "verb",
            "sent1": "Please retine the vase on the table to prevent it from falling.",
            "sent2": "The sticky tape will retine the poster on the wall.",
            "sent3": "He had to retine the mischievous puppy in its playpen.",
            "sent4": "The strong roots retine the tree firmly in the ground.",
            "sent5": "The anchor will retine the boat in place during the storm."
        },
        {
            "definition": "To keep back or hold back",
            "pos": "verb",
            "sent1": "She had to retine her tears during the sad movie.",
            "sent2": "He tried to retine his anger during the argument.",
            "sent3": "The comedian couldn't retine his laughter during the funny skit.",
            "sent4": "The dam helps retine the flow of water in the river.",
            "sent5": "The soldier had to retine his fear in the face of danger."
        }
    ]
}