{
    "term": "retrofire",
    "meanings": [
        {
            "definition": "To ignite a rocket engine in order to slow down a spacecraft and bring it back to Earth.",
            "pos": "verb",
            "sent1": "The astronauts will retrofire the engines to safely return to Earth.",
            "sent2": "The mission required the crew to retrofire the engines for a smooth landing.",
            "sent3": "The retrofire maneuver made the spaceship look like it was doing a graceful dance in space.",
            "sent4": "The retrofire of the engines was like hitting the brakes on a speeding car.",
            "sent5": "With a loud roar, the retrofire of the engines echoed through the vast emptiness of space."
        },
        {
            "definition": "The act of firing a rocket engine in the opposite direction of travel to slow down a spacecraft.",
            "pos": "noun",
            "sent1": "The retrofire was crucial for the safe reentry of the spacecraft.",
            "sent2": "During the retrofire, the engines worked against the ship's motion.",
            "sent3": "The retrofire of the engines looked like the spaceship was doing a space dance.",
            "sent4": "The retrofire was a bold move to bring the spacecraft back to Earth.",
            "sent5": "The retrofire of the engines created a stunning visual in the night sky."
        },
        {
            "definition": "The process of using a rocket engine to decelerate a spacecraft in order to re-enter the Earth's atmosphere.",
            "pos": "noun",
            "sent1": "The retrofire was necessary to slow down the spacecraft for reentry.",
            "sent2": "The retrofire marked the beginning of the journey back to Earth.",
            "sent3": "The retrofire made the spaceship look like it was tap dancing in space.",
            "sent4": "The retrofire was like hitting the brakes before entering the atmosphere.",
            "sent5": "The retrofire of the engines signaled the start of the descent towards Earth."
        }
    ]
}