{
    "term": "retrogrades",
    "meanings": [
        {
            "definition": "Move backward",
            "pos": "verb",
            "sent1": "The car retrogrades slowly down the hill.",
            "sent2": "She retrogrades a few steps to pick up her fallen book.",
            "sent3": "The cat retrogrades playfully when chasing its tail.",
            "sent4": "His stubbornness retrogrades any progress we make.",
            "sent5": "The river's flow retrogrades after hitting a rock, creating a small whirlpool."
        },
        {
            "definition": "Go back to an earlier state",
            "pos": "verb",
            "sent1": "The software retrogrades to its previous version due to bugs.",
            "sent2": "After the upgrade failed, the system retrogrades to its old settings.",
            "sent3": "The clock retrogrades to show the wrong time after a power outage.",
            "sent4": "Her mood retrogrades to sadness after hearing the bad news.",
            "sent5": "The town's infrastructure retrogrades to its original design for historical preservation."
        },
        {
            "definition": "Decline or deteriorate",
            "pos": "verb",
            "sent1": "His health retrogrades as he neglects his diet and exercise.",
            "sent2": "The old building retrogrades over time without proper maintenance.",
            "sent3": "The quality of the product retrogrades after using it for a while.",
            "sent4": "Their relationship retrogrades due to constant arguments and misunderstandings.",
            "sent5": "The fabric retrogrades in color after being exposed to sunlight for too long."
        },
        {
            "definition": "To move in a direction opposite to the usual one",
            "pos": "verb",
            "sent1": "The salmon retrogrades upstream to spawn.",
            "sent2": "The hiker retrogrades along the trail to find his lost backpack.",
            "sent3": "The ants retrograde from the picnic area after being disturbed.",
            "sent4": "The satellite retrogrades in orbit before adjusting its trajectory.",
            "sent5": "The caterpillar retrogrades along the branch before turning into a butterfly."
        }
    ]
}