{
    "term": "retractable",
    "meanings": [
        {
            "definition": "Capable of being drawn back or in",
            "pos": "adjective",
            "sent1": "The retractable leash allowed the dog to move freely within a certain distance.",
            "sent2": "The retractable antenna on the radio could be extended for better reception.",
            "sent3": "The retractable straw was a hit at the party, making everyone curious to try it.",
            "sent4": "Her retractable smile faded as soon as she heard the bad news.",
            "sent5": "The retractable roof of the stadium opened up like a giant umbrella, revealing the clear blue sky above."
        },
        {
            "definition": "Able to be withdrawn or pulled back",
            "pos": "adjective",
            "sent1": "The retractable seatbelt kept the passengers safe during the sudden stop.",
            "sent2": "The retractable ladder made it easy for the firefighters to reach the top floor.",
            "sent3": "The retractable pen amused the students, who kept clicking it in and out during the lecture.",
            "sent4": "His retractable offer was quickly taken back once he realized the consequences.",
            "sent5": "The retractable bridge allowed the castle to be protected from invaders, as it could be pulled back at any moment."
        },
        {
            "definition": "That can be retracted or drawn back",
            "pos": "adjective",
            "sent1": "The retractable table saved space in the small apartment when not in use.",
            "sent2": "The retractable claws of the cat helped it catch prey without causing harm to itself.",
            "sent3": "The retractable belt buckle provided a fun distraction for the child during the long car ride.",
            "sent4": "His retractable excuses were running out as he tried to avoid taking responsibility.",
            "sent5": "The retractable stairs folded neatly into the wall, revealing a hidden passage to the attic."
        }
    ]
}