{
    "term": "retrograde",
    "meanings": [
        {
            "definition": "Moving or directed backward",
            "pos": "adjective",
            "sent1": "The retrograde motion of the car surprised everyone.",
            "sent2": "The retrograde satellite orbited in the opposite direction.",
            "sent3": "It was a retrograde decision to turn back on the road.",
            "sent4": "The retrograde flow of the river seemed to defy logic.",
            "sent5": "The retrograde movement of the clock's hands was mesmerizing."
        },
        {
            "definition": "Declining or deteriorating",
            "pos": "adjective",
            "sent1": "The retrograde condition of the old building was evident.",
            "sent2": "His health took a retrograde turn after the accident.",
            "sent3": "The retrograde state of the banana made it perfect for banana bread.",
            "sent4": "The retrograde quality of the painting added a sense of history.",
            "sent5": "The retrograde trend in sales was concerning to the company."
        },
        {
            "definition": "To move or go backward",
            "pos": "verb",
            "sent1": "The army had to retrograde to avoid the enemy's ambush.",
            "sent2": "She decided to retrograde a few steps to get a better view.",
            "sent3": "I had to retrograde in the game to find the hidden treasure.",
            "sent4": "The decision to retrograde in negotiations proved to be wise.",
            "sent5": "The team had to retrograde to reassess their strategy."
        },
        {
            "definition": "To decline or deteriorate",
            "pos": "verb",
            "sent1": "His health began to retrograde after neglecting his diet.",
            "sent2": "The company started to retrograde due to poor management.",
            "sent3": "The relationship seemed to retrograde after the argument.",
            "sent4": "The project's progress began to retrograde unexpectedly.",
            "sent5": "The economy continued to retrograde despite efforts to stabilize it."
        }
    ]
}