{
    "term": "retractor",
    "meanings": [
        {
            "definition": "A device or instrument used to hold back organs or tissues during surgery.",
            "pos": "noun",
            "sent1": "The surgeon used a retractor to keep the liver out of the way during the operation.",
            "sent2": "The nurse handed the retractor to the doctor before the surgery.",
            "sent3": "The retractor decided to take a break and let the organs roam free for a moment.",
            "sent4": "Her words acted as a retractor, pulling back the emotions she had let out.",
            "sent5": "The retractor was like a superhero cape, keeping the organs safe from harm."
        },
        {
            "definition": "A person or thing that retracts or withdraws something.",
            "pos": "noun",
            "sent1": "He was known as the retractor of secrets, always keeping information to himself.",
            "sent2": "The retractor of the offer left everyone surprised and disappointed.",
            "sent3": "The retractor of the story made everyone curious about what was being hidden.",
            "sent4": "Her silence was a powerful retractor, pulling back any chance of further discussion.",
            "sent5": "The retractor of the curtain revealed a hidden treasure behind it."
        },
        {
            "definition": "A muscle that draws a part back.",
            "pos": "noun",
            "sent1": "The retractor muscle in his arm helped him pull the heavy weight closer to his body.",
            "sent2": "The retractor muscle in her leg contracted, bringing her foot back towards her body.",
            "sent3": "The retractor muscle in his jaw twitched as he clenched his teeth in frustration.",
            "sent4": "Her retractor muscle was like a spring, quickly retracting her hand from the hot surface.",
            "sent5": "The retractor muscle in the cat's paw retracted the sharp claws, avoiding any harm."
        }
    ]
}