{
    "term": "retrofired",
    "meanings": [
        {
            "definition": "retrofired: past tense of retrofire",
            "pos": "verb",
            "sent1": "Yesterday, the rocket retrofired during the test.",
            "sent2": "The engine retrofired unexpectedly during the launch.",
            "sent3": "The rocket retrofired, surprising everyone at the space station.",
            "sent4": "His plan retrofired, causing chaos in the control room.",
            "sent5": "The rocket retrofired with a loud bang, leaving a trail of smoke behind."
        },
        {
            "definition": "retrofired: to ignite or cause to ignite in a retro manner",
            "pos": "verb",
            "sent1": "She retrofired the old stove to cook dinner.",
            "sent2": "The mechanic retrofired the engine to check for any issues.",
            "sent3": "The chef retrofired the gas burner, creating a vintage cooking atmosphere.",
            "sent4": "The fireworks retrofired beautifully in the night sky.",
            "sent5": "He retrofired the lantern, casting a warm glow in the room."
        },
        {
            "definition": "retrofired: experiencing a firing process in reverse",
            "pos": "adjective",
            "sent1": "The retrofired engine puzzled the engineers.",
            "sent2": "The retrofired gun malfunctioned due to its unique design.",
            "sent3": "The retrofired machine seemed to be operating in a time loop.",
            "sent4": "The retrofired system caused confusion among the technicians.",
            "sent5": "The retrofired device emitted sparks in an unusual pattern."
        },
        {
            "definition": "retrofired: to undergo a retroactive firing action",
            "pos": "verb",
            "sent1": "The employee retrofired due to a mistake in the project.",
            "sent2": "The rocket retrofired after the countdown was completed.",
            "sent3": "The plan retrofired, leading to a humorous situation.",
            "sent4": "The engine retrofired unexpectedly, surprising the crew.",
            "sent5": "The system retrofired, causing a delay in the mission."
        }
    ]
}