{
    "term": "retracted",
    "meanings": [
        {
            "definition": "To pull back or in",
            "pos": "verb",
            "sent1": "She retracted her hand quickly from the hot stove.",
            "sent2": "The turtle retracted its head into its shell for protection.",
            "sent3": "The magician retracted the scarf, but it had disappeared completely!",
            "sent4": "The cat retracted its claws, ready to pounce.",
            "sent5": "The curtains retracted smoothly, revealing a breathtaking view."
        },
        {
            "definition": "To take back or withdraw",
            "pos": "verb",
            "sent1": "He retracted his statement after realizing it was incorrect.",
            "sent2": "The company retracted their offer of employment due to budget cuts.",
            "sent3": "The child retracted the toy from his friend, causing a playful chase.",
            "sent4": "The tide retracted, revealing hidden treasures on the beach.",
            "sent5": "She retracted her promise, unable to fulfill it."
        },
        {
            "definition": "To disavow or deny",
            "pos": "verb",
            "sent1": "The politician retracted his previous support for the bill.",
            "sent2": "She retracted her involvement in the prank, claiming innocence.",
            "sent3": "The student retracted his confession, blaming it on a dare.",
            "sent4": "The suspect retracted his alibi under pressure from the detectives.",
            "sent5": "The witness retracted her testimony, fearing retaliation."
        },
        {
            "definition": "To draw back or shrink",
            "pos": "verb",
            "sent1": "The cat retracted from the unfamiliar noise in the room.",
            "sent2": "The flower retracted its petals as the sun set.",
            "sent3": "The dog retracted from the bath, not wanting to get wet.",
            "sent4": "The crowd retracted as the police sirens approached.",
            "sent5": "The shadow retracted into the darkness, hiding from the light."
        },
        {
            "definition": "To recant or revoke",
            "pos": "verb",
            "sent1": "The scientist retracted his theory after new evidence emerged.",
            "sent2": "The author retracted the controversial chapter from the book.",
            "sent3": "The chef retracted the menu item due to low customer demand.",
            "sent4": "The government retracted the law following public outcry.",
            "sent5": "The artist retracted the painting from the exhibition for further revisions."
        }
    ]
}