{
    "term": "return",
    "meanings": [
        {
            "definition": "Come or go back to a place.",
            "pos": "verb",
            "sent1": "After playing outside, the children will return home for dinner.",
            "sent2": "I need to return the library books before they are due.",
            "sent3": "The lost dog will return to its owner after a long adventure.",
            "sent4": "Her thoughts always return to the peaceful days of her childhood.",
            "sent5": "The migrating birds will return to this area every spring."
        },
        {
            "definition": "Give, put, or send something back to a place or person.",
            "pos": "verb",
            "sent1": "Please return the borrowed tools to the neighbor when you're done.",
            "sent2": "I will return the package to the post office for a refund.",
            "sent3": "The magician asked the audience to return the vanished coin with a wave of his wand.",
            "sent4": "She decided to return the favor by helping her friend move to a new apartment.",
            "sent5": "The kind stranger returned the lost wallet to its grateful owner."
        },
        {
            "definition": "A profit made on an investment.",
            "pos": "noun",
            "sent1": "The stock market experienced a significant return on investment this quarter.",
            "sent2": "He was pleased with the return he received from investing in the company.",
            "sent3": "The unexpected return on the lottery ticket left him speechless.",
            "sent4": "The return on the property sale exceeded their expectations.",
            "sent5": "The return on the antique vase was much higher than anticipated."
        },
        {
            "definition": "An act of going or coming back.",
            "pos": "noun",
            "sent1": "The return journey from the beach was filled with laughter and memories.",
            "sent2": "She looked forward to the return trip to her favorite vacation spot.",
            "sent3": "The return of the prodigal son brought tears of joy to his family.",
            "sent4": "The return of the astronauts from space was celebrated worldwide.",
            "sent5": "The return of the migrating geese signaled the arrival of spring."
        }
    ]
}