{
    "term": "reurge",
    "meanings": [
        {
            "definition": "To rise or swell again, as a wave.",
            "pos": "verb",
            "sent1": "After the storm passed, the waves began to reurge, crashing against the shore.",
            "sent2": "The water reurged with great force, reaching higher than before.",
            "sent3": "The playful children giggled as they watched the waves reurge, splashing them with salty water.",
            "sent4": "Memories of the past reurged in her mind like a powerful wave, overwhelming her with emotion.",
            "sent5": "The sound of the ocean reurging against the rocks was both soothing and invigorating."
        },
        {
            "definition": "To surge back or overflow.",
            "pos": "verb",
            "sent1": "As the dam broke, the water began to reurge, flooding the valley below.",
            "sent2": "The river reurged after the heavy rain, causing the banks to overflow.",
            "sent3": "The excitement in the stadium reurged as the home team scored a last-minute goal.",
            "sent4": "Emotions reurged within her like a tidal wave, threatening to overwhelm her.",
            "sent5": "The cheers of the crowd reurged with renewed energy as the band took the stage."
        },
        {
            "definition": "To bring back or revive.",
            "pos": "verb",
            "sent1": "The archaeologists hoped to reurge ancient traditions through their discoveries.",
            "sent2": "The museum's restoration efforts aimed to reurge the beauty of the historic paintings.",
            "sent3": "The old recipe was reurged by the chef, creating a nostalgic dish for the customers.",
            "sent4": "Her passion for painting was reurged after visiting an art exhibition, inspiring her to create again.",
            "sent5": "The community worked together to reurge the neglected park, turning it into a vibrant green space."
        }
    ]
}