{
    "term": "reverses",
    "meanings": [
        {
            "definition": "To move backward or in the opposite direction.",
            "pos": "verb",
            "sent1": "The car reverses slowly out of the parking spot.",
            "sent2": "She always reverses carefully when driving in reverse.",
            "sent3": "The cat reverses its steps when it realizes it's going the wrong way.",
            "sent4": "His decision to reverse the car's direction saved them from a collision.",
            "sent5": "The teacher demonstrated how to reverse the toy car with precision."
        },
        {
            "definition": "To change to an opposite position, direction, or course.",
            "pos": "verb",
            "sent1": "The wind suddenly reverses and blows from the east.",
            "sent2": "The team decided to reverse their strategy for the game.",
            "sent3": "The magician reverses the direction of the spinning coin.",
            "sent4": "Her mood quickly reverses from happy to sad.",
            "sent5": "The river's current can reverse its flow during heavy rains."
        },
        {
            "definition": "To turn inside out or upside down.",
            "pos": "verb",
            "sent1": "She carefully reverses the shirt to check the tag.",
            "sent2": "The tornado can reverse trees and houses in its path.",
            "sent3": "The mischievous puppy reverses the laundry basket for fun.",
            "sent4": "The storm's strength can reverse umbrellas in an instant.",
            "sent5": "He accidentally reverses his backpack while searching for his keys."
        },
        {
            "definition": "To revoke or annul.",
            "pos": "verb",
            "sent1": "The judge reverses the previous ruling after new evidence is presented.",
            "sent2": "They had to reverse the decision due to a legal technicality.",
            "sent3": "The student tries to reverse the failing grade by studying harder.",
            "sent4": "The company's board decides to reverse the unpopular policy.",
            "sent5": "The mayor's announcement to reverse the curfew was met with relief."
        },
        {
            "definition": "To cause to go in the opposite direction.",
            "pos": "verb",
            "sent1": "The strong current reverses the boat's course.",
            "sent2": "He reverses the flow of traffic to clear the accident scene.",
            "sent3": "The unexpected gust of wind reverses the kite's path.",
            "sent4": "The sudden change in temperature can reverse the river's flow.",
            "sent5": "The coach instructs the players to reverse their positions on the field."
        }
    ]
}