{
    "term": "revolutionary",
    "meanings": [
        {
            "definition": "Involving or causing a complete or dramatic change",
            "pos": "adjective",
            "sent1": "The new technology was revolutionary in the way it transformed communication.",
            "sent2": "The invention of the wheel was a revolutionary advancement for early humans.",
            "sent3": "The idea of a robot vacuum cleaner seemed revolutionary at first, but now it's a common household item.",
            "sent4": "Her innovative approach to problem-solving was truly revolutionary in the business world.",
            "sent5": "The impact of the internet on society can be described as nothing short of revolutionary."
        },
        {
            "definition": "A person who advocates or engages in revolution",
            "pos": "noun",
            "sent1": "The revolutionary led the protest against unfair working conditions.",
            "sent2": "Many revolutionaries throughout history fought for freedom and equality.",
            "sent3": "The young revolutionary had big dreams of changing the world with their ideas.",
            "sent4": "The revolutionary's speeches inspired others to join the movement for change.",
            "sent5": "The revolutionary's bold actions sparked a wave of activism in the community."
        },
        {
            "definition": "Of or relating to a revolution",
            "pos": "adjective",
            "sent1": "The country underwent a period of revolutionary upheaval during the war.",
            "sent2": "The revolutionary changes in government policies brought hope to the citizens.",
            "sent3": "The chef's new recipe was so delicious, it was like a revolutionary taste explosion.",
            "sent4": "The artist's use of color was truly revolutionary, creating a vibrant and dynamic painting.",
            "sent5": "The revolutionary spirit of the people could be felt in the air during the protests."
        }
    ]
}