{
    "term": "rheumatisms",
    "meanings": [
        {
            "definition": "A disease marked by inflammation and pain in the joints.",
            "pos": "noun",
            "sent1": "My grandmother suffers from rheumatisms in her knees, making it hard for her to walk.",
            "sent2": "Doctors often recommend gentle exercises to manage rheumatisms effectively.",
            "sent3": "The rheumatisms in my fingers make it challenging to open jars.",
            "sent4": "The rheumatisms in the old house's creaky doors reminded me of my grandmother's joints.",
            "sent5": "The sharp pain of rheumatisms felt like tiny needles poking my joints."
        },
        {
            "definition": "A condition characterized by stiffness and pain in the muscles or joints.",
            "pos": "noun",
            "sent1": "After gardening all day, I felt the familiar ache of rheumatisms in my back.",
            "sent2": "Warm baths can help alleviate the discomfort caused by rheumatisms.",
            "sent3": "Trying to dance with rheumatisms felt like moving through thick mud.",
            "sent4": "The weight of the world seemed to rest on my shoulders, like rheumatisms in my muscles.",
            "sent5": "The relentless stiffness of rheumatisms made every movement a struggle."
        },
        {
            "definition": "Inflammation of the joints or muscles.",
            "pos": "noun",
            "sent1": "The doctor prescribed medication to reduce the inflammation caused by rheumatisms.",
            "sent2": "Regular stretching can help prevent the onset of rheumatisms in the joints.",
            "sent3": "The sudden onset of rheumatisms in my shoulders surprised me during the cold weather.",
            "sent4": "The redness and swelling of rheumatisms in my knees made them look like ripe tomatoes.",
            "sent5": "The throbbing pain of rheumatisms felt like a constant drumbeat in my joints."
        }
    ]
}