{
    "term": "riantly",
    "meanings": [
        {
            "definition": "In a radiant manner.",
            "pos": "adverb",
            "sent1": "She smiled riantly at her friend, showing her happiness.",
            "sent2": "The sun shone riantly over the meadow, making everything glow.",
            "sent3": "The little girl skipped riantly down the path, her joy infectious.",
            "sent4": "His laughter echoed riantly through the room, filling it with warmth.",
            "sent5": "The fireworks lit up the sky riantly, painting it with colors."
        },
        {
            "definition": "Emitting light or heat.",
            "pos": "adjective",
            "sent1": "The riant stars twinkled in the night sky, guiding the lost travelers.",
            "sent2": "The cozy fireplace gave off a riant warmth, comforting everyone in the room.",
            "sent3": "The riant lanterns illuminated the garden, creating a magical atmosphere.",
            "sent4": "The riant candles flickered in the dark, casting dancing shadows on the walls.",
            "sent5": "The riant sunflowers basked in the sunlight, absorbing its energy."
        },
        {
            "definition": "Bright and shining.",
            "pos": "adjective",
            "sent1": "Her riant smile lit up the room, spreading joy to everyone present.",
            "sent2": "The riant gemstones sparkled in the sunlight, catching everyone's eye.",
            "sent3": "The riant moon reflected on the calm lake, creating a serene scene.",
            "sent4": "The riant dewdrops glistened on the grass, like tiny diamonds.",
            "sent5": "The riant eyes of the child gleamed with innocence and wonder."
        },
        {
            "definition": "Characterized by happiness or joy.",
            "pos": "adjective",
            "sent1": "The riant laughter of the children filled the playground with merriment.",
            "sent2": "The riant music lifted everyone's spirits, making them dance with delight.",
            "sent3": "The riant festival brought the whole town together in celebration.",
            "sent4": "The riant faces of the crowd showed their excitement and happiness.",
            "sent5": "The riant atmosphere of the party made everyone feel welcomed and cheerful."
        }
    ]
}