{
    "term": "riffraff",
    "meanings": [
        {
            "definition": "Disreputable or undesirable people.",
            "pos": "noun",
            "sent1": "The town's sheriff warned the residents to stay away from the riffraff hanging out near the abandoned building.",
            "sent2": "The teacher made sure to keep an eye on the riffraff in the back of the classroom.",
            "sent3": "The riffraff tried to sneak into the fancy party, but their mismatched clothes gave them away.",
            "sent4": "The alley was filled with riffraff, making it a place to avoid after dark.",
            "sent5": "The movie depicted the city's underworld filled with dangerous riffraff."
        },
        {
            "definition": "Worthless or unwanted material.",
            "pos": "noun",
            "sent1": "The old shed was full of broken tools and other riffraff that needed to be thrown away.",
            "sent2": "The garage sale had a section for riffraff items that were priced very low.",
            "sent3": "The artist used the riffraff from the junkyard to create a unique sculpture.",
            "sent4": "The attic was cluttered with riffraff that no one had touched in years.",
            "sent5": "The beach was littered with riffraff washed ashore by the storm."
        },
        {
            "definition": "A group of people regarded as disreputable or worthless.",
            "pos": "noun",
            "sent1": "The wealthy neighborhood looked down on the riffraff living in the run-down apartments nearby.",
            "sent2": "The exclusive club had strict rules to keep out the riffraff from entering.",
            "sent3": "The riffraff gathered at the park, causing a disturbance with their loud music.",
            "sent4": "The politician promised to clean up the city by removing the riffraff from the streets.",
            "sent5": "The historical novel portrayed the clash between the elite and the riffraff during the revolution."
        }
    ]
}