{
    "term": "riffled",
    "meanings": [
        {
            "definition": "To turn over pages quickly and casually, especially in a book or magazine.",
            "pos": "verb",
            "sent1": "She riffled through the pages of her favorite book to find her favorite chapter.",
            "sent2": "He riffled through the magazine at the doctor's office while waiting for his appointment.",
            "sent3": "The mischievous kitten riffled through the pages of the important document, leaving tiny paw prints behind.",
            "sent4": "The wind riffled the pages of the old journal, as if trying to read the forgotten words.",
            "sent5": "Her fingers riffled the edges of the paper, creating a soft rustling sound."
        },
        {
            "definition": "To create a series of quick, short, and lively musical phrases.",
            "pos": "verb",
            "sent1": "The guitarist riffled through the chords, creating a catchy melody.",
            "sent2": "The pianist riffled through the keys, producing a beautiful composition.",
            "sent3": "The band riffled through their setlist, trying to decide on the perfect song to start with.",
            "sent4": "The music riffled through the air, filling the room with energy and joy.",
            "sent5": "His fingers riffled across the strings, producing a mesmerizing tune."
        },
        {
            "definition": "Having a wavy or rippled appearance.",
            "pos": "adjective",
            "sent1": "The lake looked calm, but upon closer inspection, it had a riffled surface.",
            "sent2": "The fabric had a riffled texture that added depth to the design.",
            "sent3": "The artist painted a riffled pattern on the canvas, giving it a unique look.",
            "sent4": "The sunlight created a riffled effect on the water, sparkling like diamonds.",
            "sent5": "Her hair had a riffled quality, flowing in gentle waves down her back."
        }
    ]
}