{
    "term": "riffles",
    "meanings": [
        {
            "definition": "A rapid, shallow section of a stream or river with rough water caused by many small, irregular rocks.",
            "pos": "noun",
            "sent1": "The hikers enjoyed the sound of the riffles as they crossed the stream.",
            "sent2": "The canoe navigated through the riffles, creating splashes of water.",
            "sent3": "The playful otters splashed around in the riffles, having a great time.",
            "sent4": "The riffles of the river danced over the rocks like a lively orchestra.",
            "sent5": "The riffles sparkled under the sunlight, inviting swimmers to cool off."
        },
        {
            "definition": "To flip quickly through the pages of a book or magazine.",
            "pos": "verb",
            "sent1": "She riffles through the pages of her favorite novel, eager to find out what happens next.",
            "sent2": "During the exam, he nervously riffles the textbook pages to review the answers.",
            "sent3": "The mischievous cat loves to riffle through the magazines, leaving them in disarray.",
            "sent4": "The wind riffles the pages of the book, creating a soft rustling sound.",
            "sent5": "As she riffles through the cookbook, she discovers a new recipe to try."
        },
        {
            "definition": "To shuffle or mix playing cards by dividing them into two parts and riffling them together.",
            "pos": "verb",
            "sent1": "He riffles the cards expertly, preparing for a game of poker with friends.",
            "sent2": "The magician's hands move quickly as he riffles the cards for his next trick.",
            "sent3": "In a hurry, she tries to riffle the cards but accidentally drops them all over the table.",
            "sent4": "The sound of riffling cards filled the room as the players prepared for the game.",
            "sent5": "With a swift motion, he riffles the cards, ready to deal them out for blackjack."
        }
    ]
}