{
    "term": "rig",
    "meanings": [
        {
            "definition": "To assemble or set up equipment or machinery",
            "pos": "verb",
            "sent1": "Dad will rig the tent for our camping trip.",
            "sent2": "The workers will rig the stage for the concert.",
            "sent3": "Tom tried to rig the game of hide and seek by hiding in the same spot every time.",
            "sent4": "She managed to rig the puzzle pieces together in a way that they didn't fit.",
            "sent5": "The mechanic showed me how to rig the engine so it would start smoothly."
        },
        {
            "definition": "A large truck or lorry",
            "pos": "noun",
            "sent1": "The rig carried heavy logs from the forest.",
            "sent2": "The oil rig parked outside the factory was massive.",
            "sent3": "The circus clown drove the colorful rig around the ring, making everyone laugh.",
            "sent4": "The rig rumbled down the highway like a giant metal beast.",
            "sent5": "The delivery rig arrived just in time with all the supplies we needed."
        },
        {
            "definition": "A trick or scheme",
            "pos": "noun",
            "sent1": "The magician's rig amazed the audience with its illusions.",
            "sent2": "She saw through his rig and refused to be fooled.",
            "sent3": "The kids came up with a clever rig to get extra candy on Halloween.",
            "sent4": "His rig to win the race involved a secret shortcut through the woods.",
            "sent5": "The elaborate rig to prank their teacher involved fake spiders and hidden cameras."
        },
        {
            "definition": "To manipulate dishonestly",
            "pos": "verb",
            "sent1": "The con artist tried to rig the card game in his favor.",
            "sent2": "She suspected someone was rigging the competition results.",
            "sent3": "The students tried to rig the test by passing notes with answers.",
            "sent4": "He managed to rig the election by bribing voters.",
            "sent5": "The chef was caught trying to rig the cooking contest by sneaking in pre-made dishes."
        },
        {
            "definition": "A set of clothing or equipment for a particular activity",
            "pos": "noun",
            "sent1": "The scuba diver put on his rig before diving into the ocean.",
            "sent2": "The astronaut's rig included a spacesuit and oxygen tank.",
            "sent3": "The detective's rig had all the tools needed to solve the mystery.",
            "sent4": "Her hiking rig consisted of sturdy boots and a backpack.",
            "sent5": "The firefighter's rig was heavy with gear but essential for saving lives."
        }
    ]
}