{
    "term": "rigg",
    "meanings": [
        {
            "definition": "A set of equipment or tools used for a specific purpose.",
            "pos": "noun",
            "sent1": "The fisherman carried his rigg of fishing gear down to the dock.",
            "sent2": "The mechanic organized his rigg of tools on the workbench.",
            "sent3": "The chef's rigg of cooking utensils clattered noisily as he prepared dinner.",
            "sent4": "The explorer's rigg of camping supplies was neatly packed for the journey.",
            "sent5": "The artist's rigg of paintbrushes and canvases filled the small studio."
        },
        {
            "definition": "To manipulate or control dishonestly for personal gain.",
            "pos": "verb",
            "sent1": "The con artist tried to rigg the game in his favor.",
            "sent2": "She was caught trying to rigg the election results.",
            "sent3": "The mischievous raccoon attempted to rigg the squirrel's food stash.",
            "sent4": "The villain's plan to rigg the stock market was foiled by the authorities.",
            "sent5": "The student was expelled for trying to rigg the exam."
        },
        {
            "definition": "To fit or equip with sails, masts, etc.",
            "pos": "verb",
            "sent1": "The sailors worked together to rigg the ship for the long voyage.",
            "sent2": "They needed to rigg the boat with extra sails for the strong winds.",
            "sent3": "The pirates decided to rigg their ship with black sails for a stealthy approach.",
            "sent4": "The captain ordered the crew to rigg the vessel with sturdy masts.",
            "sent5": "The fishermen had to rigg their small boat with a new sail to catch more fish."
        },
        {
            "definition": "A ridge or raised strip of land.",
            "pos": "noun",
            "sent1": "The hikers followed the rigg along the mountain trail.",
            "sent2": "The farmer plowed the field next to the rigg to plant crops.",
            "sent3": "The children loved to play on the rigg in the park.",
            "sent4": "The rigg provided a natural barrier between the two properties.",
            "sent5": "The rigg offered a stunning view of the valley below."
        }
    ]
}