{
    "term": "riggs",
    "meanings": [
        {
            "definition": "A surname",
            "pos": "noun",
            "sent1": "The Riggs family had a big reunion last weekend.",
            "sent2": "Mr. Riggs is my neighbor and a very kind man.",
            "sent3": "Why did the Riggs family bring so many pies to the picnic?",
            "sent4": "The Riggs surname is well-known in this small town.",
            "sent5": "The Riggs name has been passed down for generations."
        },
        {
            "definition": "A type of fishing boat",
            "pos": "noun",
            "sent1": "The fishermen took the riggs out to sea early in the morning.",
            "sent2": "The riggs were painted in bright colors to be easily spotted.",
            "sent3": "The riggs bobbed up and down on the waves like colorful toys.",
            "sent4": "The riggs lined up along the shore, ready for a day of fishing.",
            "sent5": "The riggs were filled with nets and fishing gear."
        },
        {
            "definition": "To manipulate dishonestly",
            "pos": "verb",
            "sent1": "He tried to riggs the game by changing the rules secretly.",
            "sent2": "The company was accused of riggsing the competition to win the contract.",
            "sent3": "She always tries to riggs situations to her advantage.",
            "sent4": "The politician was caught riggsing the election results.",
            "sent5": "It's not fair to riggs the outcome in your favor."
        },
        {
            "definition": "A slang term for a person's clothing or outfit",
            "pos": "noun",
            "sent1": "She wore a stylish riggs to the party last night.",
            "sent2": "His riggs were mismatched but somehow looked cool.",
            "sent3": "Why are you wearing such fancy riggs to the park?",
            "sent4": "Her riggs always stand out in a crowd.",
            "sent5": "He changed his riggs three times before deciding on an outfit."
        }
    ]
}