{
    "term": "rigging",
    "meanings": [
        {
            "definition": "The ropes, chains, and other equipment used to support and control the sails and masts on a ship.",
            "pos": "noun",
            "sent1": "The sailors quickly adjusted the rigging to catch the wind and move the ship forward.",
            "sent2": "The rigging on the sailboat was well-maintained and sturdy.",
            "sent3": "As the storm approached, the rigging danced in the wind like a group of lively snakes.",
            "sent4": "The rigging of the ship held the weight of the massive sails like a strong, reliable friend.",
            "sent5": "The intricate rigging of the ship resembled a complex spider web against the sky."
        },
        {
            "definition": "The act of setting up or manipulating something in a dishonest or fraudulent way.",
            "pos": "noun",
            "sent1": "The company was caught in rigging the prices to deceive customers.",
            "sent2": "Rigging the election results is illegal and unethical.",
            "sent3": "The magician was accused of rigging the card game to win every time.",
            "sent4": "The students were caught rigging the test by sharing answers.",
            "sent5": "The detective uncovered the rigging of evidence to frame an innocent person."
        },
        {
            "definition": "The equipment, machinery, or apparatus used in a particular activity or industry.",
            "pos": "noun",
            "sent1": "The theater crew worked together to set up the rigging for the stage production.",
            "sent2": "The construction workers used heavy rigging to lift the steel beams into place.",
            "sent3": "The chef's rigging of kitchen tools was so organized that cooking became a breeze.",
            "sent4": "The rigging in the factory was essential for moving heavy equipment safely.",
            "sent5": "The mountain climbers relied on their rigging to secure them as they ascended the peak."
        }
    ]
}