{
    "term": "rightism",
    "meanings": [
        {
            "definition": "The political ideology or movement that supports conservative or traditional values.",
            "pos": "noun",
            "sent1": "Rightism is often associated with upholding traditional beliefs.",
            "sent2": "Many people in the country follow rightism and its conservative principles.",
            "sent3": "The debate between leftism and rightism can get quite heated at times.",
            "sent4": "In a world of change, rightism stands firm like a sturdy oak tree.",
            "sent5": "The essence of rightism lies in preserving time-honored customs and ideas."
        },
        {
            "definition": "The belief in or advocacy for a system of government based on individual rights and limited government intervention.",
            "pos": "noun",
            "sent1": "Rightism emphasizes the importance of individual freedoms within society.",
            "sent2": "Citizens who value rightism advocate for a government that respects personal rights.",
            "sent3": "Some say rightism is like having a personal bodyguard for your freedoms.",
            "sent4": "In the realm of politics, rightism shines as a beacon of liberty.",
            "sent5": "The spirit of rightism champions the rights of every person, big or small."
        },
        {
            "definition": "The practice of adhering to or promoting right-wing policies or viewpoints.",
            "pos": "noun",
            "sent1": "Rightism involves supporting policies that lean towards the right side of the spectrum.",
            "sent2": "Politicians often engage in debates over the merits of rightism versus leftism.",
            "sent3": "Some people find humor in the clash between rightism and leftism.",
            "sent4": "In the arena of ideas, rightism stands tall like a mighty fortress.",
            "sent5": "The concept of rightism is like a compass guiding towards conservative principles."
        }
    ]
}