{
    "term": "rigor",
    "meanings": [
        {
            "definition": "Strictness or severity in judgment or behavior",
            "pos": "noun",
            "sent1": "The teacher's rigor in grading assignments ensures fairness.",
            "sent2": "The court applied rigor in sentencing the criminal.",
            "sent3": "His rigor in following rules even in games made him a tough opponent.",
            "sent4": "The rigor of the law left no room for leniency.",
            "sent5": "The rigor of the coach pushed the team to perform their best."
        },
        {
            "definition": "Harsh inflexibility in opinion, temper, or judgment",
            "pos": "noun",
            "sent1": "Her rigor in sticking to her beliefs sometimes alienated others.",
            "sent2": "The manager's rigor in decision-making led to conflicts.",
            "sent3": "His rigor in always being right made him a difficult person to argue with.",
            "sent4": "The rigor of his stubbornness was unmatched.",
            "sent5": "The rigor of her stubbornness was like a wall impossible to break."
        },
        {
            "definition": "A condition that makes life difficult, challenging, or uncomfortable",
            "pos": "noun",
            "sent1": "Living in poverty brings a certain rigor to daily life.",
            "sent2": "The rigor of the harsh winter affected the crops.",
            "sent3": "The unexpected rigor of the test caught the students off guard.",
            "sent4": "The rigor of the mountain terrain tested their endurance.",
            "sent5": "The rigor of the situation forced them to adapt quickly."
        },
        {
            "definition": "The quality of being extremely thorough, exhaustive, or accurate",
            "pos": "noun",
            "sent1": "The scientist's rigor in conducting experiments led to groundbreaking discoveries.",
            "sent2": "The writer's rigor in research made the book highly informative.",
            "sent3": "The chef's rigor in following the recipe precisely resulted in a delicious dish.",
            "sent4": "The rigor of his attention to detail was evident in every aspect of his work.",
            "sent5": "The rigor of her analysis left no room for error."
        }
    ]
}