{
    "term": "ring",
    "meanings": [
        {
            "definition": "A circular band worn as an ornament or a token of marriage.",
            "pos": "noun",
            "sent1": "She proudly displayed her new diamond ring.",
            "sent2": "The wedding ring symbolizes their commitment to each other.",
            "sent3": "He pretended to propose with a candy ring as a joke.",
            "sent4": "The ring of gold on her finger shone brightly in the sunlight.",
            "sent5": "The ring sparkled like a tiny galaxy on her hand."
        },
        {
            "definition": "A resonant sound or series of sounds.",
            "pos": "noun",
            "sent1": "The bell's ring echoed through the church.",
            "sent2": "The phone's ring interrupted the meeting.",
            "sent3": "The joyful ring of laughter filled the room.",
            "sent4": "The ring of the wind chimes soothed her restless mind.",
            "sent5": "The ring of the alarm clock woke him up abruptly."
        },
        {
            "definition": "To encircle or surround something.",
            "pos": "verb",
            "sent1": "She used a rope to ring the tree for support.",
            "sent2": "The mountains ring the valley, creating a natural barrier.",
            "sent3": "The cat tried to ring the mouse in a playful chase.",
            "sent4": "The city lights ringed the horizon in a beautiful glow.",
            "sent5": "The fence will ring the garden to keep out pests."
        },
        {
            "definition": "A group of people or things arranged in a circle.",
            "pos": "noun",
            "sent1": "The children formed a ring around the teacher.",
            "sent2": "The circus performers danced in a colorful ring.",
            "sent3": "The birds flew in a perfect ring formation in the sky.",
            "sent4": "The audience formed a ring around the stage for the performance.",
            "sent5": "The knights stood in a protective ring around the king."
        },
        {
            "definition": "To make a phone call.",
            "pos": "verb",
            "sent1": "I will ring you as soon as I reach home.",
            "sent2": "She forgot to ring her friend on her birthday.",
            "sent3": "He decided to ring his parents to share the good news.",
            "sent4": "Don't forget to ring the office before your meeting.",
            "sent5": "She promised to ring her sister after work."
        }
    ]
}