{
    "term": "rise",
    "meanings": [
        {
            "definition": "Move from a lower position to a higher one.",
            "pos": "verb",
            "sent1": "I rise from my chair to reach the top shelf.",
            "sent2": "The sun will rise in the east tomorrow morning.",
            "sent3": "The balloon started to rise slowly, surprising everyone.",
            "sent4": "Her spirits began to rise as she achieved her goal.",
            "sent5": "The hot air balloon's rise into the sky was breathtaking."
        },
        {
            "definition": "Increase in number, size, amount, or degree.",
            "pos": "verb",
            "sent1": "The number of students will rise after the holidays.",
            "sent2": "Prices tend to rise during the holiday season.",
            "sent3": "The excitement started to rise as the concert drew near.",
            "sent4": "Her voice rose above the noise of the crowd.",
            "sent5": "The tide began to rise, covering the sandy beach."
        },
        {
            "definition": "Get up from lying, sitting, or kneeling.",
            "pos": "verb",
            "sent1": "I rise early every morning to start my day.",
            "sent2": "The cat will rise from its nap when it hears the food bowl.",
            "sent3": "He pretended to rise from the dead during the play.",
            "sent4": "The superhero will rise from the ground to save the day.",
            "sent5": "The bread will rise in the oven, creating a delicious smell."
        },
        {
            "definition": "Become more powerful or influential.",
            "pos": "verb",
            "sent1": "The new leader will rise to guide the nation.",
            "sent2": "Her confidence will rise as she gains more experience.",
            "sent3": "The magician will rise to fame with his amazing tricks.",
            "sent4": "The hero will rise against all odds to defeat the villain.",
            "sent5": "The sun will rise, casting light over the land."
        },
        {
            "definition": "Increase in value or price.",
            "pos": "noun",
            "sent1": "The rise in property values made homeowners happy.",
            "sent2": "Investors hope for a rise in the stock market.",
            "sent3": "The sudden rise in prices shocked the customers.",
            "sent4": "The rise in demand led to higher prices for the product.",
            "sent5": "The rise in the cost of living affected many families."
        }
    ]
}