{
    "term": "rising",
    "meanings": [
        {
            "definition": "Moving upward.",
            "pos": "adverb",
            "sent1": "The balloon was slowly rising into the sky.",
            "sent2": "The sun was rising in the east.",
            "sent3": "The elevator was rising so slowly that it felt like a snail's pace.",
            "sent4": "Her spirits were rising like a bird taking flight.",
            "sent5": "The hot air balloon was rising majestically above the trees."
        },
        {
            "definition": "Increasing in amount or intensity.",
            "pos": "adjective",
            "sent1": "The rising demand for the product led to higher sales.",
            "sent2": "The rising temperature made everyone seek shade.",
            "sent3": "The rising excitement in the room was palpable.",
            "sent4": "His rising anger was like a storm brewing inside him.",
            "sent5": "The rising tide engulfed the shore with each passing minute."
        },
        {
            "definition": "Emerging or becoming visible.",
            "pos": "adjective",
            "sent1": "The rising sun painted the sky with vibrant colors.",
            "sent2": "The rising moon cast a soft glow over the landscape.",
            "sent3": "The rising stars twinkled in the dark night sky.",
            "sent4": "Her rising talent as an artist was evident in every brushstroke.",
            "sent5": "The rising mist revealed the hidden beauty of the valley."
        },
        {
            "definition": "Advancing in rank or position.",
            "pos": "adjective",
            "sent1": "The rising star in the company quickly climbed the corporate ladder.",
            "sent2": "The rising politician gained popularity among the voters.",
            "sent3": "The rising student was soon at the top of the class.",
            "sent4": "Her rising status in society brought new responsibilities.",
            "sent5": "The rising general led his troops to victory in battle."
        }
    ]
}