{
    "term": "riva",
    "meanings": [
        {
            "definition": "A person or thing that is regarded as an equal to another.",
            "pos": "noun",
            "sent1": "In the game, Sarah found a worthy riva to challenge her skills.",
            "sent2": "The two friends were always seen as rivas in their academic achievements.",
            "sent3": "At the baking contest, the flour and sugar were playful rivas, trying to outshine each other.",
            "sent4": "The sun and the moon are eternal rivas, each taking turns to light up the sky.",
            "sent5": "The mountain and the valley stood as silent rivas, one towering high while the other lay low."
        },
        {
            "definition": "A person or thing that is in competition with another.",
            "pos": "noun",
            "sent1": "The company's new product became a tough riva for their competitor.",
            "sent2": "The two siblings were constant rivas, always vying for their parents' attention.",
            "sent3": "The two squirrels playfully chased each other, acting as friendly rivas in the forest.",
            "sent4": "The river and the stream flowed side by side, like peaceful rivas in nature's symphony.",
            "sent5": "The red and blue crayons were artistic rivas, each coloring the paper in its unique way."
        },
        {
            "definition": "To be equal to or in competition with someone or something.",
            "pos": "verb",
            "sent1": "John always strives to riva his brother in sports.",
            "sent2": "The young artist hoped to riva the famous painters of the past.",
            "sent3": "The two teams will riva fiercely in the upcoming championship match.",
            "sent4": "Her determination to succeed allowed her to riva the challenges that came her way.",
            "sent5": "The student aimed to riva the top score in the class by studying diligently."
        }
    ]
}