{
    "term": "roaching",
    "meanings": [
        {
            "definition": "To engage in dishonest or unethical behavior.",
            "pos": "verb",
            "sent1": "She was caught roaching by taking credit for someone else's work.",
            "sent2": "He roaching by lying about his qualifications on his resume.",
            "sent3": "The student tried roaching by copying his friend's answers during the test.",
            "sent4": "The politician was known for roaching by accepting bribes.",
            "sent5": "The company had strict policies to prevent employees from roaching in any way."
        },
        {
            "definition": "The act of smoking marijuana.",
            "pos": "noun",
            "sent1": "After school, they would gather for a roaching session in the park.",
            "sent2": "He was caught by the police for roaching in the alley.",
            "sent3": "The group of friends enjoyed roaching together on weekends.",
            "sent4": "She found a peaceful spot in the forest for roaching alone.",
            "sent5": "The smell of roaching lingered in the room long after they left."
        },
        {
            "definition": "A method of styling hair.",
            "pos": "noun",
            "sent1": "The hairstylist used a unique roaching technique for the fashion show.",
            "sent2": "She learned a new roaching style from a tutorial online.",
            "sent3": "The salon offered a special discount for roaching services.",
            "sent4": "Her roaching skills were in high demand for weddings and events.",
            "sent5": "The celebrity's roaching look became a trend among young people."
        },
        {
            "definition": "The act of bending or curving.",
            "pos": "noun",
            "sent1": "The roaching of the tree branches created a natural archway.",
            "sent2": "He admired the graceful roaching of the dancer's body.",
            "sent3": "The artist captured the beauty of roaching in his sculpture.",
            "sent4": "The road took a sharp roaching, leading them into the mountains.",
            "sent5": "The gentle roaching of the river made it a peaceful place to relax."
        }
    ]
}