{
    "term": "rocaille",
    "meanings": [
        {
            "definition": "An ornamental style of decoration using rock and shell motifs.",
            "pos": "noun",
            "sent1": "The garden was adorned with rocaille sculptures made of rocks and shells.",
            "sent2": "The rocaille design on the fireplace added a touch of elegance to the room.",
            "sent3": "The artist created a rocaille masterpiece using colorful rocks and delicate shells.",
            "sent4": "Her jewelry box was a rocaille treasure chest filled with precious stones and seashells.",
            "sent5": "The intricate rocaille patterns on the ceiling made it look like a magical underwater cave."
        },
        {
            "definition": "A style of architecture characterized by elaborate ornamentation.",
            "pos": "noun",
            "sent1": "The rocaille architecture of the palace featured intricate carvings and detailed decorations.",
            "sent2": "Visitors marveled at the rocaille details on the columns of the building.",
            "sent3": "The rocaille building looked like a gingerbread house come to life.",
            "sent4": "The rocaille facade of the church sparkled in the sunlight like a jewel.",
            "sent5": "The rocaille style of architecture transformed the city into a fairy tale land."
        },
        {
            "definition": "A type of decorative art popular in the 18th century.",
            "pos": "noun",
            "sent1": "The rocaille paintings in the museum captured the essence of the 18th century.",
            "sent2": "Art collectors sought after rocaille pieces to add to their collections.",
            "sent3": "The rocaille artwork was like a time machine to the elegant 18th century.",
            "sent4": "The rocaille designs on the furniture reflected the opulence of the era.",
            "sent5": "Walking through the rocaille exhibit felt like stepping back in time to a lavish period."
        }
    ]
}