{
    "term": "rockoon",
    "meanings": [
        {
            "definition": "A rocket carrying scientific instruments and launched from a balloon.",
            "pos": "noun",
            "sent1": "The rockoon soared high above, collecting data for the scientists.",
            "sent2": "The rockoon was a unique combination of a rocket and a balloon.",
            "sent3": "The rockoon looked like a flying laboratory, floating gracefully in the sky.",
            "sent4": "The rockoon was a marvel of modern engineering, blending the best of both worlds.",
            "sent5": "The rockoon's mission was to explore the upper atmosphere in a revolutionary way."
        },
        {
            "definition": "A rocket launched from a balloon.",
            "pos": "noun",
            "sent1": "Scientists watched in awe as the rockoon ascended into the sky.",
            "sent2": "Launching a rockoon from a balloon required precise timing and coordination.",
            "sent3": "The rockoon's journey began with a gentle lift from the balloon, propelling it towards space.",
            "sent4": "The rockoon's launch was a breathtaking sight, defying gravity with each passing second.",
            "sent5": "The rockoon's ascent marked a new chapter in aerial exploration, blending two technologies seamlessly."
        },
        {
            "definition": "A balloon-borne rocket.",
            "pos": "noun",
            "sent1": "The balloon carried the rockoon steadily towards the upper atmosphere.",
            "sent2": "The rockoon's design allowed it to be lifted by a balloon before igniting its engines.",
            "sent3": "As the balloon rose, the rockoon prepared for its rocket-powered journey.",
            "sent4": "The rockoon's balloon ride was just the beginning of its exciting space adventure.",
            "sent5": "The rockoon's balloon launch was a spectacle, marking the start of its mission beyond the clouds."
        }
    ]
}