{
    "term": "rockabies",
    "meanings": [
        {
            "definition": "Rockabies: a contagious disease caused by a virus",
            "pos": "noun",
            "sent1": "The doctor warned everyone about the dangers of rockabies spreading in the community.",
            "sent2": "The outbreak of rockabies in the city led to a quarantine.",
            "sent3": "The silly cartoon character caught rockabies and started sneezing glitter everywhere.",
            "sent4": "The rockabies of rumors infected the small town, spreading faster than wildfire.",
            "sent5": "Protect yourself from rockabies by washing your hands regularly and avoiding crowded places."
        },
        {
            "definition": "Rockabies: to move back and forth in a gentle, swaying motion",
            "pos": "verb",
            "sent1": "The trees outside the window rockabies in the breeze, creating a calming sight.",
            "sent2": "The boat began to rockabies as it floated on the peaceful lake.",
            "sent3": "The toddler's crib seemed to rockabies itself, lulling the baby to sleep.",
            "sent4": "The hammock started to rockabies as the person settled into it for a nap.",
            "sent5": "The swing set in the park always makes children giggle as they rockabies back and forth."
        },
        {
            "definition": "Rockabies: a type of music characterized by a strong beat and amplified instruments",
            "pos": "noun",
            "sent1": "The concert was filled with energetic rockabies that made everyone dance.",
            "sent2": "The radio station played classic rockabies from the 80s all afternoon.",
            "sent3": "The cat seemed to enjoy the rockabies coming from the garage band next door.",
            "sent4": "The city streets echoed with the rockabies of a live performance.",
            "sent5": "The gym playlist was full of upbeat rockabies to keep the energy high during workouts."
        }
    ]
}