{
    "term": "rodomontade",
    "meanings": [
        {
            "definition": "Boastful or inflated talk or behavior.",
            "pos": "noun",
            "sent1": "His rodomontade about his achievements was tiresome to listen to.",
            "sent2": "She couldn't stand his constant rodomontade about his wealth.",
            "sent3": "The rodomontade of the little squirrel claiming to have climbed the tallest tree was quite amusing.",
            "sent4": "The rodomontade of the storm, boasting about its power, was followed by a gentle rain.",
            "sent5": "The rodomontade of the lion, declaring itself the king of the jungle, echoed through the savannah."
        },
        {
            "definition": "Bragging or blustering speech.",
            "pos": "noun",
            "sent1": "Her rodomontade about her cooking skills was met with skepticism by her friends.",
            "sent2": "The politician's rodomontade during the debate failed to impress the audience.",
            "sent3": "The rodomontade of the cat, claiming to catch the biggest mice, made everyone chuckle.",
            "sent4": "The rodomontade of the wind, howling through the night, kept the children awake.",
            "sent5": "The rodomontade of the peacock, showing off its colorful feathers, attracted many admirers."
        },
        {
            "definition": "A bragging or boastful person.",
            "pos": "noun",
            "sent1": "He was known in the village as a rodomontade who always exaggerated his hunting stories.",
            "sent2": "The office was filled with the rodomontade of the new employee, bragging about his previous successes.",
            "sent3": "The rodomontade of the parrot, claiming to speak ten languages, amused the visitors.",
            "sent4": "The rodomontade of the sun, boasting its brightness, warmed the earth.",
            "sent5": "The rodomontade of the river, bragging about its length, flowed steadily towards the sea."
        }
    ]
}