{
    "term": "rollovers",
    "meanings": [
        {
            "definition": "The act of rolling over or turning over",
            "pos": "noun",
            "sent1": "During the circus performance, the acrobat executed multiple rollovers in mid-air.",
            "sent2": "The gymnast's flawless rollovers impressed the audience.",
            "sent3": "The playful puppy's rollovers on the grass brought smiles to everyone watching.",
            "sent4": "The waves in the ocean resembled gentle rollovers, creating a calming effect.",
            "sent5": "The gymnastics routine included intricate rollovers that showcased the athlete's agility."
        },
        {
            "definition": "A type of vehicle accident where a vehicle flips onto its side or roof",
            "pos": "noun",
            "sent1": "The car crash resulted in multiple rollovers, causing significant damage.",
            "sent2": "The safety features in the car helped protect the passengers during the rollovers.",
            "sent3": "The cartoon character's car always ended up in rollovers, adding humor to the show.",
            "sent4": "The action movie featured intense rollovers that kept viewers on the edge of their seats.",
            "sent5": "The driver lost control, leading to a series of rollovers on the highway."
        },
        {
            "definition": "A feature in web design where an element changes appearance when hovered over with a cursor",
            "pos": "noun",
            "sent1": "The website's rollovers enhanced user experience by providing interactive elements.",
            "sent2": "The designer added creative rollovers to make the website more engaging.",
            "sent3": "The playful animation of the rollovers on the webpage entertained visitors.",
            "sent4": "The subtle rollovers on the buttons gave the website a modern touch.",
            "sent5": "The interactive map had rollovers that revealed additional information when clicked."
        }
    ]
}