{
    "term": "roll",
    "meanings": [
        {
            "definition": "To move by turning over and over",
            "pos": "verb",
            "sent1": "The cat will roll on the grass.",
            "sent2": "I like to roll down the hill for fun.",
            "sent3": "The playful puppy will roll around in the mud.",
            "sent4": "The waves roll onto the shore gently.",
            "sent5": "The snowball will roll down the hill quickly."
        },
        {
            "definition": "A small piece of bread",
            "pos": "noun",
            "sent1": "I enjoy having a roll with my soup.",
            "sent2": "She made delicious rolls for breakfast.",
            "sent3": "The bakery sells fresh rolls every morning.",
            "sent4": "The dinner table was set with warm rolls.",
            "sent5": "The sandwich was made with a soft roll."
        },
        {
            "definition": "A list of names or items",
            "pos": "noun",
            "sent1": "The teacher called out the roll for attendance.",
            "sent2": "I need to check the roll to see who is present.",
            "sent3": "The roll of students was neatly organized.",
            "sent4": "The roll of ingredients needed for the recipe was long.",
            "sent5": "The roll of guests invited to the party was extensive."
        },
        {
            "definition": "To make a loud, deep sound",
            "pos": "verb",
            "sent1": "The thunder will roll across the sky.",
            "sent2": "The drums roll loudly during the performance.",
            "sent3": "The old truck will roll down the street with a loud noise.",
            "sent4": "The sound of the train will roll through the valley.",
            "sent5": "The thunderstorm will roll in the distance."
        },
        {
            "definition": "To register or be registered officially",
            "pos": "verb",
            "sent1": "I need to roll for the upcoming event.",
            "sent2": "The students will roll for their classes online.",
            "sent3": "The participants will roll for the competition by tomorrow.",
            "sent4": "The athletes will roll for the tournament next week.",
            "sent5": "The voters will roll for the election in November."
        }
    ]
}