{
    "term": "rollover",
    "meanings": [
        {
            "definition": "The act of turning over or rotating.",
            "pos": "noun",
            "sent1": "The rollover of the ball down the hill was slow and steady.",
            "sent2": "I watched the rollover of the log as it tumbled down the slope.",
            "sent3": "The rollover of the pancake in the pan made me hungry for breakfast.",
            "sent4": "The rollover of the clouds in the sky signaled an approaching storm.",
            "sent5": "The rollover of the dice determined the winner of the game."
        },
        {
            "definition": "A feature in a software program that allows data to be carried over from one period to the next.",
            "pos": "noun",
            "sent1": "The rollover of the data saved me time when working on my project.",
            "sent2": "Make sure to use the rollover function to transfer information easily.",
            "sent3": "The rollover of the files between folders was seamless and efficient.",
            "sent4": "The rollover of the settings from the old version to the new one was flawless.",
            "sent5": "The rollover of the information ensured nothing was lost during the update."
        },
        {
            "definition": "A type of vehicle accident in which a vehicle flips onto its side or roof.",
            "pos": "noun",
            "sent1": "The rollover of the car was a scary experience for the passengers.",
            "sent2": "The rollover of the truck caused a traffic jam on the highway.",
            "sent3": "The rollover of the bus in the movie was a thrilling action scene.",
            "sent4": "The rollover of the SUV was captured on the dashcam footage.",
            "sent5": "The rollover of the van was a reminder to drive safely on slippery roads."
        },
        {
            "definition": "A type of financial transaction in which funds from one retirement account are transferred to another account without incurring tax penalties.",
            "pos": "noun",
            "sent1": "The rollover of the funds helped me consolidate my retirement savings.",
            "sent2": "I completed the rollover of my IRA to a new investment account.",
            "sent3": "The rollover of the pension funds was a smart financial move.",
            "sent4": "The rollover of the 401(k) was done smoothly by the financial advisor.",
            "sent5": "The rollover of the retirement funds allowed for better investment options."
        }
    ]
}