{
    "term": "rollup",
    "meanings": [
        {
            "definition": "A type of food consisting of ingredients rolled up inside a tortilla or other flatbread.",
            "pos": "noun",
            "sent1": "For lunch, I enjoyed a delicious rollup filled with chicken and vegetables.",
            "sent2": "I ordered a chicken rollup from the food truck for a quick meal.",
            "sent3": "My friend tried to eat a giant rollup in one bite and ended up with food all over his face.",
            "sent4": "The rollup was like a little flavor bomb exploding in my mouth.",
            "sent5": "The aroma of the freshly baked rollup made my mouth water."
        },
        {
            "definition": "A summary or compilation of information or data.",
            "pos": "noun",
            "sent1": "The quarterly rollup of sales figures showed a significant increase.",
            "sent2": "I presented a detailed rollup of the project's progress to the team.",
            "sent3": "The rollup of the meeting minutes was so concise that it fit on one page.",
            "sent4": "The rollup of customer feedback highlighted areas for improvement.",
            "sent5": "The CEO's rollup of the company's performance painted a clear picture for investors."
        },
        {
            "definition": "To move by turning over and over.",
            "pos": "verb",
            "sent1": "The playful puppy would rollup in the grass for hours.",
            "sent2": "I watched the gymnast rollup across the mat with grace and precision.",
            "sent3": "The clumsy clown tried to rollup on the unicycle but ended up falling off.",
            "sent4": "The waves rollup onto the shore, carrying shells and seaweed.",
            "sent5": "I love to rollup in my blanket and relax on the couch."
        },
        {
            "definition": "To increase or accumulate.",
            "pos": "verb",
            "sent1": "My savings account continues to rollup with each paycheck.",
            "sent2": "As time passed, the snowball started to rollup more snow on its way down the hill.",
            "sent3": "The excitement started to rollup in the crowd as the concert drew closer.",
            "sent4": "The tension began to rollup in the room as the deadline approached.",
            "sent5": "The cheers from the audience began to rollup like a wave of sound."
        }
    ]
}