{
    "term": "rollicking",
    "meanings": [
        {
            "definition": "Exuberantly lively and amusing",
            "pos": "adjective",
            "sent1": "The children had a rollicking time at the birthday party, laughing and playing games.",
            "sent2": "The circus was a rollicking event, with clowns, acrobats, and music filling the air.",
            "sent3": "The rollicking puppy chased its tail in circles, bringing smiles to everyone watching.",
            "sent4": "The rollicking waves crashed against the shore, creating a symphony of sound.",
            "sent5": "The rollicking dance performance left the audience in awe with its energy and joy."
        },
        {
            "definition": "Engaging in boisterous merrymaking or festivity",
            "pos": "adjective",
            "sent1": "The rollicking crowd at the concert cheered and danced to the music all night.",
            "sent2": "The rollicking parade filled the streets with colorful floats and cheerful participants.",
            "sent3": "The rollicking family reunion was filled with laughter, hugs, and shared memories.",
            "sent4": "The rollicking laughter of the friends echoed through the park as they enjoyed a picnic.",
            "sent5": "The rollicking celebration of the team's victory could be heard from miles away."
        },
        {
            "definition": "Characterized by high-spirited fun or excitement",
            "pos": "adjective",
            "sent1": "The rollicking atmosphere at the fair was contagious, spreading joy to all who attended.",
            "sent2": "The rollicking game of tag in the backyard had everyone running and laughing.",
            "sent3": "The rollicking movie night with friends included popcorn fights and silly jokes.",
            "sent4": "The rollicking thunderstorm lit up the sky with flashes of light and booming sounds.",
            "sent5": "The rollicking roller coaster ride left everyone breathless and exhilarated."
        }
    ]
}