{
    "term": "rollie",
    "meanings": [
        {
            "definition": "A small, cylindrical cigarette",
            "pos": "noun",
            "sent1": "After dinner, he enjoyed a rollie on the porch.",
            "sent2": "She always carries a pack of rollies in her pocket.",
            "sent3": "The detective found a rollie butt at the crime scene.",
            "sent4": "The rollie smoke curled into the night sky like a tiny dragon.",
            "sent5": "The smell of a fresh rollie lingered in the air."
        },
        {
            "definition": "A type of pastry filled with meat or vegetables",
            "pos": "noun",
            "sent1": "The bakery sold out of their famous rollies quickly.",
            "sent2": "She baked delicious rollies for the party.",
            "sent3": "The rollie flaky crust melted in his mouth.",
            "sent4": "The warm rollie oozed with savory filling.",
            "sent5": "The golden brown rollie tempted everyone at the table."
        },
        {
            "definition": "To move by turning over and over",
            "pos": "verb",
            "sent1": "The playful puppy loved to rollie down the hill.",
            "sent2": "She watched the gymnast rollie across the mat with grace.",
            "sent3": "The clumsy clown tried to rollie but ended up in a heap.",
            "sent4": "The log began to rollie down the slope, gaining speed.",
            "sent5": "The ball started to rollie faster and faster down the street."
        },
        {
            "definition": "A small, round bread typically served with dinner",
            "pos": "noun",
            "sent1": "She placed a warm rollie on each plate before dinner.",
            "sent2": "The bakery's fresh rollies were a hit at the event.",
            "sent3": "The rollie soaked up the delicious gravy on the plate.",
            "sent4": "The butter melted on the hot rollie, creating a tasty treat.",
            "sent5": "The aroma of the baking rollie filled the kitchen with warmth."
        }
    ]
}