{
    "term": "romantics",
    "meanings": [
        {
            "definition": "A person with romantic beliefs or attitudes.",
            "pos": "noun",
            "sent1": "She is a true romantics, always believing in love stories.",
            "sent2": "The romantics in the group planned a surprise candlelit dinner.",
            "sent3": "The romantics insisted on writing love letters in the digital age.",
            "sent4": "Her heart danced with joy like a flock of romantics under the moonlight.",
            "sent5": "The old book was filled with tales of romantics chasing after their dreams."
        },
        {
            "definition": "A person who is idealistic or impractical.",
            "pos": "noun",
            "sent1": "He was often seen as a romantics, dreaming of changing the world overnight.",
            "sent2": "The romantics among us believed in fairy tale endings.",
            "sent3": "The romantics thought they could build a castle in a day.",
            "sent4": "Her ideas were as wild and untamed as a field of romantics in bloom.",
            "sent5": "In his mind, he was a lone romantics fighting against the harsh reality."
        },
        {
            "definition": "Of, relating to, or characteristic of romanticism.",
            "pos": "adjective",
            "sent1": "The painting had a romantics touch, with soft colors and dreamy scenes.",
            "sent2": "The room was decorated in a romantics style, with lace curtains and floral patterns.",
            "sent3": "The romantics theme party was filled with candles and roses.",
            "sent4": "Her voice had a romantics quality, soft and full of emotion.",
            "sent5": "The sunset painted the sky in romantics hues of pink and gold."
        },
        {
            "definition": "A person who is inclined toward or has an affinity for romance.",
            "pos": "noun",
            "sent1": "She was known as the office romantics, always swooning over love stories.",
            "sent2": "The romantics in the group organized a surprise proposal.",
            "sent3": "The romantics blushed at the sight of a handwritten love note.",
            "sent4": "His heart beat like a drum in the chest of a romantics awaiting a kiss.",
            "sent5": "The garden was a haven for romantics, with its blooming flowers and hidden nooks."
        }
    ]
}