{
    "term": "romances",
    "meanings": [
        {
            "definition": "A feeling of excitement and mystery associated with love.",
            "pos": "noun",
            "sent1": "The young girl felt a sense of romances when she received a love letter from her crush.",
            "sent2": "Their eyes met across the crowded room, sparking a sense of romances between them.",
            "sent3": "The romances in the air during the Valentine's Day dance made everyone giddy with joy.",
            "sent4": "The romances of the past lingered in the old love letters found in the attic.",
            "sent5": "The romances in the air were palpable, like a soft breeze carrying whispers of love."
        },
        {
            "definition": "A love affair.",
            "pos": "noun",
            "sent1": "Their secret romances blossomed under the moonlit sky.",
            "sent2": "The scandalous romances between the two actors were the talk of the town.",
            "sent3": "The forbidden romances in the royal court led to many whispered rumors.",
            "sent4": "Their passionate romances burned brightly but faded quickly like a shooting star.",
            "sent5": "The tumultuous romances of the past haunted their memories like ghostly whispers."
        },
        {
            "definition": "A novel or other prose narrative depicting heroic or marvelous deeds, pageantry, romantic exploits, etc., usually in a historical or imaginary setting.",
            "pos": "noun",
            "sent1": "The medieval romances often featured brave knights rescuing damsels in distress.",
            "sent2": "She enjoyed reading romantic romances set in exotic locations filled with adventure.",
            "sent3": "The fantastical romances she read transported her to magical realms beyond imagination.",
            "sent4": "The epic romances of old were like colorful tapestries woven with threads of valor and love.",
            "sent5": "The enchanting romances of the storyteller painted vivid pictures of love and heroism in the listener's mind."
        }
    ]
}