{
    "term": "rosacea",
    "meanings": [
        {
            "definition": "A chronic skin condition characterized by redness and visible blood vessels on the face.",
            "pos": "noun",
            "sent1": "Her rosacea made her cheeks look red and her skin sensitive.",
            "sent2": "The dermatologist diagnosed her with rosacea after noticing the redness on her face.",
            "sent3": "Even though she tried to cover it up with makeup, her rosacea always peeked through.",
            "sent4": "To her, rosacea felt like a constant spotlight shining on her face.",
            "sent5": "The rosacea on her face was like a permanent blush that never faded."
        },
        {
            "definition": "A condition that causes small, red, pus-filled bumps on the skin.",
            "pos": "noun",
            "sent1": "The rosacea on his skin made him self-conscious about his appearance.",
            "sent2": "She applied a soothing cream to calm the rosacea on her cheeks.",
            "sent3": "His rosacea acted up whenever he was stressed, creating a bumpy texture on his skin.",
            "sent4": "The red bumps of rosacea seemed to multiply overnight, surprising him each morning.",
            "sent5": "The rosacea bumps felt like tiny volcanoes erupting on his face."
        },
        {
            "definition": "A disorder that can cause the nose to become swollen and bumpy.",
            "pos": "noun",
            "sent1": "Her rosacea affected not only her cheeks but also caused her nose to swell.",
            "sent2": "The doctor explained that the bumpy nose was a result of her rosacea.",
            "sent3": "His rosacea made his nose look like a small, red mountain on his face.",
            "sent4": "The swollen nose from rosacea made it difficult for her to wear glasses comfortably.",
            "sent5": "The bumpy nose caused by rosacea felt like a constant reminder of her skin condition."
        }
    ]
}