{
    "term": "rostrate",
    "meanings": [
        {
            "definition": "Having a beak or beak-like projection.",
            "pos": "adjective",
            "sent1": "The bird had a rostrate bill for catching fish.",
            "sent2": "The rostrate shape of the seed helped it attach to passing animals.",
            "sent3": "The rostrate squirrel sculpture in the park made everyone smile.",
            "sent4": "Her rostrate gaze pierced through the crowd, searching for her lost friend.",
            "sent5": "The rostrate mountain peak stood tall against the blue sky."
        },
        {
            "definition": "Having a beak-shaped or beak-like structure.",
            "pos": "adjective",
            "sent1": "The rostrate flower petals attracted hummingbirds with their shape.",
            "sent2": "The insect's rostrate mouthpart was perfect for sipping nectar.",
            "sent3": "The rostrate design of the building made it look like a giant birdhouse.",
            "sent4": "Her rostrate hairpin held her bun in place like a tiny beak.",
            "sent5": "The rostrate pattern on the fabric resembled a row of tiny beaks."
        },
        {
            "definition": "Having a beak or beak-like projection.",
            "pos": "adjective",
            "sent1": "The dinosaur's rostrate skull was a fearsome sight.",
            "sent2": "The rostrate tip of the pen made it easy to draw fine lines.",
            "sent3": "The rostrate umbrella handle looked like a bird ready to take flight.",
            "sent4": "Her rostrate shadow on the wall seemed to have a sharp beak.",
            "sent5": "The rostrate icicles hanging from the roof glistened in the sun."
        },
        {
            "definition": "Having a beak-shaped or beak-like structure.",
            "pos": "adjective",
            "sent1": "The rostrate prow of the ship cut through the waves effortlessly.",
            "sent2": "The rostrate end of the key fit perfectly into the lock.",
            "sent3": "The rostrate design of the mask made it look like a bird in disguise.",
            "sent4": "Her rostrate earrings dangled elegantly like tiny beaks.",
            "sent5": "The rostrate pattern on the wallpaper gave the room a unique charm."
        }
    ]
}