{
    "term": "rot",
    "meanings": [
        {
            "definition": "Decompose or decay",
            "pos": "verb",
            "sent1": "Leaves left on the ground too long will slowly rot away.",
            "sent2": "The fruit started to rot after being left out in the sun.",
            "sent3": "The forgotten sandwich in my bag began to rot, creating a terrible smell.",
            "sent4": "Neglected dreams can rot in the corners of our minds, fading away.",
            "sent5": "The abandoned house stood silent, its walls beginning to rot from neglect."
        },
        {
            "definition": "Nonsense or foolish talk",
            "pos": "noun",
            "sent1": "Don't listen to his rot; he's just making things up.",
            "sent2": "She dismissed his words as mere rot and continued with her work.",
            "sent3": "The comedian's rot had the audience laughing uncontrollably.",
            "sent4": "His excuses were nothing but rot, and no one believed him.",
            "sent5": "The teacher could easily spot the rot in the student's explanation."
        },
        {
            "definition": "To deteriorate or become unsound",
            "pos": "verb",
            "sent1": "If you leave metal out in the rain, it will slowly rot over time.",
            "sent2": "The old wooden fence began to rot, needing immediate repair.",
            "sent3": "His trust in people started to rot after being betrayed multiple times.",
            "sent4": "The foundation of the building started to rot, causing structural issues.",
            "sent5": "Neglect can cause relationships to slowly rot away, leading to misunderstandings."
        },
        {
            "definition": "To undergo decay or decomposition",
            "pos": "verb",
            "sent1": "The fallen tree trunk will eventually rot and return to the earth.",
            "sent2": "Food left in the fridge for too long will start to rot and smell bad.",
            "sent3": "The abandoned ship began to rot away in the harbor, forgotten by all.",
            "sent4": "Time causes all things to slowly rot and fade into memory.",
            "sent5": "Neglected gardens will rot and become overgrown with weeds."
        }
    ]
}