{
    "term": "rouge",
    "meanings": [
        {
            "definition": "A red powder or cream used as a cosmetic for coloring the cheeks or lips.",
            "pos": "noun",
            "sent1": "She applied a touch of rouge to her cheeks before going out.",
            "sent2": "The actress wore rouge to enhance her natural beauty on stage.",
            "sent3": "The clown accidentally spilled rouge all over his face, creating a comical look.",
            "sent4": "The sunset painted the sky with hues of rouge, resembling a giant blush brush.",
            "sent5": "The vibrant rouge on her lips made her smile even more radiant."
        },
        {
            "definition": "A dishonest or unprincipled person, especially a gambler or swindler.",
            "pos": "noun",
            "sent1": "The rouge at the poker table tried to bluff his way to victory.",
            "sent2": "Beware of the rouge who promises easy money but only brings trouble.",
            "sent3": "The rouge thought he could outsmart everyone, but his tricks were soon exposed.",
            "sent4": "His smile was as fake as a rouge's charm in a game of chance.",
            "sent5": "The rouge's deceitful ways caught up with him, leading to his downfall."
        },
        {
            "definition": "To color with rouge.",
            "pos": "verb",
            "sent1": "She carefully rouged her cheeks to add a rosy glow to her complexion.",
            "sent2": "The makeup artist rouged the model's lips for the photoshoot.",
            "sent3": "He playfully rouged his friend's nose with the cosmetic powder.",
            "sent4": "The artist rouged the canvas with bold strokes of red, creating a striking contrast.",
            "sent5": "The flowers in the garden rouged the landscape with their vibrant colors."
        },
        {
            "definition": "To cheat or deceive.",
            "pos": "verb",
            "sent1": "He tried to rouge his way out of the situation by telling lies.",
            "sent2": "The scammer rouged unsuspecting victims with false promises of wealth.",
            "sent3": "She rouged her resume to make herself seem more qualified for the job.",
            "sent4": "The con artist rouged his words with charm to manipulate others.",
            "sent5": "The politician rouged the truth to gain more support from the public."
        }
    ]
}