{
    "term": "rough",
    "meanings": [
        {
            "definition": "Having an uneven or irregular surface",
            "pos": "adjective",
            "sent1": "The rough road made the car bump up and down.",
            "sent2": "She used sandpaper to smooth out the rough edges of the wood.",
            "sent3": "The rough surface of the sidewalk made it hard to ride a skateboard.",
            "sent4": "The rough terrain of the mountain tested the hiker's endurance.",
            "sent5": "The rough texture of the fabric scratched my skin."
        },
        {
            "definition": "Not smooth or level",
            "pos": "adjective",
            "sent1": "The rough table wobbled because one leg was shorter.",
            "sent2": "The painter applied a second coat to cover the rough spots on the wall.",
            "sent3": "The rough ground caused the ball to bounce unpredictably.",
            "sent4": "The rough sea made the boat sway back and forth.",
            "sent5": "The rough path was difficult to walk on in the dark."
        },
        {
            "definition": "Harsh or unpleasant in sound",
            "pos": "adjective",
            "sent1": "The rough sound of the alarm clock woke me up abruptly.",
            "sent2": "The rough voice of the singer grated on my ears.",
            "sent3": "The rough noise of the construction site disturbed the peace of the neighborhood.",
            "sent4": "The rough music blared from the car speakers, causing a commotion.",
            "sent5": "The rough tone of his speech made everyone uncomfortable."
        },
        {
            "definition": "Not gentle or careful",
            "pos": "adjective",
            "sent1": "He handled the delicate vase with a rough touch and it broke.",
            "sent2": "The rough handling of the fragile package caused it to tear open.",
            "sent3": "The rough play of the puppies knocked over the flower pot.",
            "sent4": "The rough treatment of the book led to its pages getting torn.",
            "sent5": "The rough manner in which he spoke hurt her feelings."
        },
        {
            "definition": "Violent or turbulent in nature",
            "pos": "adjective",
            "sent1": "The rough storm uprooted trees and caused power outages.",
            "sent2": "The rough waves crashed against the shore during the hurricane.",
            "sent3": "The rough wind howled through the night, keeping everyone awake.",
            "sent4": "The rough river currents made it dangerous to swim.",
            "sent5": "The rough behavior of the crowd escalated into chaos."
        }
    ]
}