{
    "term": "roughout",
    "meanings": [
        {
            "definition": "A rough or unfinished surface",
            "pos": "noun",
            "sent1": "The table had a roughout that needed to be smoothed.",
            "sent2": "The carpenter sanded the roughout to make it smooth.",
            "sent3": "The artist's painting had a unique roughout that added character.",
            "sent4": "The roughout of the wall resembled a rugged mountain landscape.",
            "sent5": "The roughout of the fabric felt coarse to the touch."
        },
        {
            "definition": "To make rough or uneven",
            "pos": "verb",
            "sent1": "She used sandpaper to roughout the edges of the wood.",
            "sent2": "The storm's strong winds roughouted the once smooth sand dunes.",
            "sent3": "The chef decided to roughout the dough to give the bread a rustic look.",
            "sent4": "His careless handling roughouted the delicate flower petals.",
            "sent5": "The sculptor gently roughouted the clay to create texture in the sculpture."
        },
        {
            "definition": "A preliminary sketch or version",
            "pos": "noun",
            "sent1": "The architect presented a roughout of the building design.",
            "sent2": "The writer shared the roughout of the story with the editor.",
            "sent3": "The roughout of the play had the actors laughing at its simplicity.",
            "sent4": "The roughout of the song lyrics captured the essence of the singer's emotions.",
            "sent5": "The roughout of the map helped plan the hiking route more effectively."
        },
        {
            "definition": "To treat roughly or harshly",
            "pos": "verb",
            "sent1": "The bully would roughout the smaller kids on the playground.",
            "sent2": "The strict coach would roughout the players during practice.",
            "sent3": "The comedian would roughout the audience with his sharp jokes.",
            "sent4": "The angry customer demanded to speak to the manager after being roughouted by the cashier.",
            "sent5": "The teacher warned the students not to roughout the classroom supplies."
        }
    ]
}