{
    "term": "roughleg",
    "meanings": [
        {
            "definition": "A type of hawk with feathers on its legs that extend down to its toes.",
            "pos": "noun",
            "sent1": "The roughleg soared high in the sky, its unique feathers shining in the sunlight.",
            "sent2": "I spotted a roughleg perched on a tree branch, its leg feathers fluttering in the breeze.",
            "sent3": "The roughleg hawk decided to wear tiny boots on its leg feathers for a fancy bird party.",
            "sent4": "As majestic as a roughleg's leg feathers, the dancer's flowing gown swept across the stage.",
            "sent5": "The roughleg's leg feathers were like delicate strands of silk, adding grace to its flight."
        },
        {
            "definition": "To grab or handle something roughly or clumsily.",
            "pos": "verb",
            "sent1": "Please don't roughleg the fragile vase when you move it to the shelf.",
            "sent2": "He tends to roughleg his tools, causing them to wear out quickly.",
            "sent3": "The chef had to roughleg the dough to get it into the pan, resulting in a misshapen pie.",
            "sent4": "She roughlegged the suitcase into the car, not realizing it was filled with delicate glassware.",
            "sent5": "The child tried to roughleg the puzzle pieces together, but they wouldn't fit properly."
        },
        {
            "definition": "A person who is unrefined or uncouth in behavior.",
            "pos": "noun",
            "sent1": "The roughleg at the party spoke loudly and chewed with their mouth open.",
            "sent2": "She always avoided inviting the roughleg to social gatherings due to their rude manners.",
            "sent3": "The roughleg at the museum mistook a sculpture for a seat and tried to sit on it.",
            "sent4": "In a room full of elegance, the roughleg stood out with their boorish behavior.",
            "sent5": "The roughleg's lack of manners was as noticeable as a neon sign in a dark alley."
        }
    ]
}