{
    "term": "rouges",
    "meanings": [
        {
            "definition": "A red powder or cream used as a cosmetic for coloring the cheeks or lips.",
            "pos": "noun",
            "sent1": "She applied rouges to her cheeks before going out.",
            "sent2": "The makeup artist used rouges to give her a rosy glow.",
            "sent3": "The little girl got into her mother's makeup and ended up with rouges all over her face.",
            "sent4": "The sunset painted the sky with rouges of pink and orange.",
            "sent5": "The artist's palette held a variety of rouges for different skin tones."
        },
        {
            "definition": "A dishonest or unprincipled person, especially a man.",
            "pos": "noun",
            "sent1": "Beware of rouges who try to scam you.",
            "sent2": "The town was wary of the new stranger, fearing he might be a rouge.",
            "sent3": "The movie villain was portrayed as a charming rouge who deceived everyone.",
            "sent4": "The political candidate turned out to be a rouge, betraying the trust of his supporters.",
            "sent5": "In the story, the cunning fox was depicted as a sly rouge."
        },
        {
            "definition": "To color with rouge.",
            "pos": "verb",
            "sent1": "She rouges her cheeks lightly for a natural look.",
            "sent2": "The actress rouges her lips before going on stage.",
            "sent3": "The clown playfully rouges his nose to entertain the children.",
            "sent4": "The artist carefully rouges the cheeks of the portrait to add a touch of color.",
            "sent5": "The dancer rouges her face to enhance her stage presence."
        },
        {
            "definition": "To cheat or swindle.",
            "pos": "verb",
            "sent1": "He rouges unsuspecting customers by selling fake products.",
            "sent2": "The con artist rouges people out of their hard-earned money.",
            "sent3": "The magician rouges the audience with his clever tricks.",
            "sent4": "The scammer rouges his way into gaining people's trust before deceiving them.",
            "sent5": "The fraudster rouges his business partners by manipulating financial records."
        }
    ]
}