{
    "term": "roughs",
    "meanings": [
        {
            "definition": "Roughs: plural noun meaning people who are tough or uncivilized",
            "pos": "noun",
            "sent1": "The roughs in the neighborhood always caused trouble.",
            "sent2": "The roughs at the bar were known for starting fights.",
            "sent3": "The roughs decided to have a dance-off instead of a fight.",
            "sent4": "The roughs of the forest roamed freely, like wild animals.",
            "sent5": "The roughs' intimidating presence made everyone uneasy."
        },
        {
            "definition": "Roughs: verb meaning to handle or treat something in a rough or careless manner",
            "pos": "verb",
            "sent1": "He roughs up his toys when he plays too roughly.",
            "sent2": "Please don't rough the delicate fabric while washing.",
            "sent3": "She accidentally roughs up her hair while trying to untangle it.",
            "sent4": "The storm roughs the sea, making it dangerous for sailors.",
            "sent5": "The chef roughs the dough to create a rustic texture."
        },
        {
            "definition": "Roughs: adjective meaning having an uneven or irregular surface",
            "pos": "adjective",
            "sent1": "The roughs road made the journey bumpy and uncomfortable.",
            "sent2": "His hands felt the roughs texture of the unfinished wood.",
            "sent3": "The roughs edges of the puzzle pieces made it challenging to assemble.",
            "sent4": "The roughs terrain of the mountain required experienced climbers.",
            "sent5": "The roughs surface of the rock provided a good grip for climbing."
        },
        {
            "definition": "Roughs: adverb meaning in a rough or harsh manner",
            "pos": "adverb",
            "sent1": "He handled the situation roughs, causing unnecessary conflict.",
            "sent2": "The wind blew roughs through the trees, making them sway.",
            "sent3": "She spoke roughs to her friend, unintentionally hurting their feelings.",
            "sent4": "The waves crashed roughs against the shore during the storm.",
            "sent5": "The car drove roughs over the pothole-filled road."
        }
    ]
}