{
    "term": "roughers",
    "meanings": [
        {
            "definition": "A person who roughens or makes rough.",
            "pos": "noun",
            "sent1": "The roughers in the construction crew used sandpaper to make the surface rough.",
            "sent2": "The painter was a skilled roughers, adding texture to the walls with a special tool.",
            "sent3": "The roughers at the pottery class accidentally made the clay too rough, creating a unique design.",
            "sent4": "Her hands were like roughers, smoothing out the edges of the wooden sculpture.",
            "sent5": "The roughers in the workshop were known for their ability to create intricate patterns on metal."
        },
        {
            "definition": "A tool or machine used for roughening.",
            "pos": "noun",
            "sent1": "The carpenter used a roughers to create a textured finish on the wood.",
            "sent2": "The metalworker's favorite roughers was a wire brush for adding a rough surface.",
            "sent3": "The roughers in the garage made the car look old by using a special tool.",
            "sent4": "The roughers in the factory hummed as it smoothed out the rough edges of the metal sheets.",
            "sent5": "The roughers in the workshop were essential for preparing the surface before painting."
        },
        {
            "definition": "A type of worker in the mining industry.",
            "pos": "noun",
            "sent1": "The roughers in the mine were responsible for breaking down the rocks.",
            "sent2": "The experienced roughers knew how to handle the heavy machinery in the mine.",
            "sent3": "The roughers joked about their job, saying they were experts in making things rough.",
            "sent4": "The roughers were like artists, shaping the rough terrain into a functional mine.",
            "sent5": "The roughers were always covered in dust after a long day of work in the mine."
        }
    ]
}