{
    "term": "rouleaus",
    "meanings": [
        {
            "definition": "A roll or coil of fabric or paper.",
            "pos": "noun",
            "sent1": "She carefully unrolled the rouleaus of colorful fabric to choose the perfect one for her project.",
            "sent2": "The artist used rouleaus of paper to create a unique sculpture.",
            "sent3": "The rouleaus of paper decided to have a race to see who could reach the finish line first.",
            "sent4": "Her thoughts were like rouleaus of fabric, neatly organized and ready to be put into action.",
            "sent5": "The classroom was filled with rouleaus of paper, each holding a different story waiting to be told."
        },
        {
            "definition": "A roll of coins or banknotes.",
            "pos": "noun",
            "sent1": "He exchanged his rouleaus of coins for a larger denomination at the bank.",
            "sent2": "The cashier counted the rouleaus of coins carefully before depositing them into the safe.",
            "sent3": "The rouleaus of coins in his pocket jingled as he walked, making him feel like a walking piggy bank.",
            "sent4": "Her savings grew slowly, one rouleau of coins at a time, until she could afford her dream vacation.",
            "sent5": "The rouleaus of coins in the charity box would make a difference in the lives of many."
        },
        {
            "definition": "A roll of hair.",
            "pos": "noun",
            "sent1": "Her long rouleaus of hair cascaded down her back, shining in the sunlight.",
            "sent2": "The stylist carefully styled her rouleaus of hair into an elegant updo for the special occasion.",
            "sent3": "The rouleaus of hair on the doll's head were perfect for braiding and styling.",
            "sent4": "The actress's rouleaus of hair framed her face beautifully, enhancing her natural beauty.",
            "sent5": "The princess's rouleaus of hair were the envy of all the ladies at the royal ball."
        }
    ]
}