{
    "term": "rounds",
    "meanings": [
        {
            "definition": "A circular route or path",
            "pos": "noun",
            "sent1": "The children ran around the playground in rounds.",
            "sent2": "The track team practiced running rounds around the field.",
            "sent3": "The squirrel followed a rounds path around the tree trunk.",
            "sent4": "The earth revolves in rounds around the sun.",
            "sent5": "The wheels on the bus go rounds and rounds."
        },
        {
            "definition": "A series of drinks or shots served to a group of people",
            "pos": "noun",
            "sent1": "The bartender prepared rounds of shots for the birthday party.",
            "sent2": "The friends enjoyed taking rounds of drinks at the bar.",
            "sent3": "The rounds of shots made the party more lively.",
            "sent4": "The rounds of drinks flowed like a river at the celebration.",
            "sent5": "The rounds of cocktails were colorful and delicious."
        },
        {
            "definition": "A single discharge of a firearm",
            "pos": "noun",
            "sent1": "The hunter took aim and fired a rounds at the target.",
            "sent2": "The police officer heard a rounds coming from the distance.",
            "sent3": "The cowboy's rounds echoed through the canyon.",
            "sent4": "The sound of the rounds startled the birds in the forest.",
            "sent5": "The rounds from the gun rang out in the quiet night."
        },
        {
            "definition": "A stage in a competition or game where each participant takes a turn",
            "pos": "noun",
            "sent1": "The chess tournament reached the final rounds of play.",
            "sent2": "The basketball game went into overtime rounds.",
            "sent3": "The spelling bee rounds became more challenging with each turn.",
            "sent4": "The debate rounds showcased the students' public speaking skills.",
            "sent5": "The karate tournament had intense rounds of sparring."
        },
        {
            "definition": "A series of visits or inspections by a doctor or nurse",
            "pos": "noun",
            "sent1": "The doctor made daily rounds to check on the patients.",
            "sent2": "The nurse completed her rounds in the hospital ward.",
            "sent3": "The hospital rounds kept the medical staff busy throughout the day.",
            "sent4": "The doctor's rounds included checking vital signs and medications.",
            "sent5": "The nurse's rounds ensured all patients received proper care."
        }
    ]
}