{
    "term": "roust",
    "meanings": [
        {
            "definition": "To wake or stir up",
            "pos": "verb",
            "sent1": "The loud noise outside will roust the sleeping cat from its nap.",
            "sent2": "Every morning, the alarm clock rousts me from my slumber.",
            "sent3": "The smell of bacon cooking in the kitchen roused the entire household from their beds.",
            "sent4": "The inspiring speech by the coach roused the team to victory.",
            "sent5": "The sudden thunderstorm roused the birds from their nests in the trees."
        },
        {
            "definition": "To force out of bed",
            "pos": "verb",
            "sent1": "My mom had to roust me out of bed for school this morning.",
            "sent2": "The persistent alarm clock finally roused him out of bed.",
            "sent3": "The mischievous puppy roused the kids out of bed by licking their faces.",
            "sent4": "The urgent phone call roused her out of bed in a panic.",
            "sent5": "The smell of pancakes cooking downstairs roused him out of bed with excitement."
        },
        {
            "definition": "To drive or force out",
            "pos": "verb",
            "sent1": "The strong wind roused the leaves from the tree branches.",
            "sent2": "The landlord had to roust the noisy tenants from the apartment building.",
            "sent3": "The police officer had to roust the protesters from the street.",
            "sent4": "The sudden flood roused the animals from their burrows.",
            "sent5": "The loud music roused the neighbors from their homes."
        },
        {
            "definition": "To rouse or provoke into action",
            "pos": "verb",
            "sent1": "The coach's pep talk roused the team to play their best.",
            "sent2": "The inspiring movie scene roused the audience to cheer.",
            "sent3": "The challenge of the race roused her competitive spirit.",
            "sent4": "The urgent call to action roused the community to come together.",
            "sent5": "The passionate speech roused the crowd to support the cause."
        }
    ]
}