{
    "term": "rouser",
    "meanings": [
        {
            "definition": "A person or thing that rouses or stirs up excitement or enthusiasm.",
            "pos": "noun",
            "sent1": "The energetic cheerleader was a real rouser at the game, getting everyone excited.",
            "sent2": "The concert was a real rouser, with the crowd cheering and clapping loudly.",
            "sent3": "The puppy's playful antics were a rouser, making everyone smile and laugh.",
            "sent4": "The surprise party was a rouser, catching everyone off guard and full of excitement.",
            "sent5": "The fireworks display was a rouser, lighting up the night sky with bursts of color."
        },
        {
            "definition": "A loud noise or disturbance that wakes someone up.",
            "pos": "noun",
            "sent1": "The thunderstorm outside was a sudden rouser, waking everyone in the house.",
            "sent2": "The alarm clock served as a reliable rouser every morning, ensuring he woke up on time.",
            "sent3": "The barking dog next door was a constant rouser, interrupting their peaceful sleep.",
            "sent4": "The fire alarm blaring was a necessary rouser, alerting everyone to evacuate the building.",
            "sent5": "The noisy garbage truck passing by was an early morning rouser, disrupting the quiet street."
        },
        {
            "definition": "To wake someone up or stir them from sleep.",
            "pos": "verb",
            "sent1": "She gently rousered her brother from his nap, so they could play together.",
            "sent2": "The loud noise outside rousered the entire household from their slumber.",
            "sent3": "The smell of pancakes cooking rousered him from his deep sleep with a growling stomach.",
            "sent4": "The urgent phone call rousered her from a peaceful dream, leaving her disoriented.",
            "sent5": "The bright sunlight streaming through the window rousered her awake, signaling the start of a new day."
        }
    ]
}