{
    "term": "rousts",
    "meanings": [
        {
            "definition": "To wake or stir up",
            "pos": "verb",
            "sent1": "The loud noise rousts the sleeping cat from its nap.",
            "sent2": "Every morning, the alarm clock rousts me from my slumber.",
            "sent3": "The smell of bacon cooking in the kitchen rousts everyone in the house.",
            "sent4": "The unexpected thunderstorm rousts the birds from their nests.",
            "sent5": "The urgent phone call rousts him from his thoughts."
        },
        {
            "definition": "To rouse to action or effort",
            "pos": "verb",
            "sent1": "The coach rousts the team to give their best performance.",
            "sent2": "The inspiring speech rousts the audience to stand up and applaud.",
            "sent3": "The promise of a reward rousts the students to complete their assignments.",
            "sent4": "The challenge of the race rousts her competitive spirit.",
            "sent5": "The urgent plea for help rousts the community into action."
        },
        {
            "definition": "To drive out or expel",
            "pos": "verb",
            "sent1": "The scarecrow rousts the pesky crows from the cornfield.",
            "sent2": "The security guard rousts the intruders from the premises.",
            "sent3": "The loud music rousts the unwanted guests from the party.",
            "sent4": "The bright light rousts the insects from their hiding spots.",
            "sent5": "The barking dog rousts the stray cat from the backyard."
        },
        {
            "definition": "To disturb or disperse",
            "pos": "verb",
            "sent1": "The wind rousts the fallen leaves in all directions.",
            "sent2": "The argument rousts the peaceful atmosphere of the room.",
            "sent3": "The unexpected visitor rousts the quiet solitude of the library.",
            "sent4": "The loud noise rousts the pigeons from their perches.",
            "sent5": "The commotion outside rousts the baby from its nap."
        }
    ]
}