{
    "term": "routs",
    "meanings": [
        {
            "definition": "A disorderly retreat of defeated troops.",
            "pos": "noun",
            "sent1": "During the battle, the soldiers fled in routs, leaving chaos behind.",
            "sent2": "The army's routs led to their ultimate defeat in the war.",
            "sent3": "The routs of the soldiers looked like a chaotic dance on the battlefield.",
            "sent4": "The routs of the defeated troops echoed through the valley, a symphony of despair.",
            "sent5": "The image of the routs haunted the survivors for years to come."
        },
        {
            "definition": "A decisive defeat.",
            "pos": "noun",
            "sent1": "The team suffered a humiliating routs in the championship game.",
            "sent2": "The routs of the enemy army marked the end of the war.",
            "sent3": "The routs in the final match left the fans in disbelief.",
            "sent4": "The routs on the battlefield were a harsh reminder of the cost of war.",
            "sent5": "The routs in the decisive battle were etched in history forever."
        },
        {
            "definition": "To defeat decisively.",
            "pos": "verb",
            "sent1": "The skilled general routs the enemy with strategic maneuvers.",
            "sent2": "The team routs their opponents in every match they play.",
            "sent3": "The underdog managed to rout the reigning champions in a surprising upset.",
            "sent4": "She routs her opponents with a combination of speed and precision.",
            "sent5": "The champion boxer routs his challengers with ease."
        },
        {
            "definition": "To dig up or turn over with the snout.",
            "pos": "verb",
            "sent1": "The pig routs the ground in search of truffles.",
            "sent2": "The dog routs through the garden looking for buried bones.",
            "sent3": "The curious raccoon routs through the trash cans in the neighborhood.",
            "sent4": "The squirrel routs through the fallen leaves for hidden acorns.",
            "sent5": "The bear routs through the forest floor, seeking out insects to eat."
        }
    ]
}