{
    "term": "rout",
    "meanings": [
        {
            "definition": "A disorderly retreat of defeated troops.",
            "pos": "noun",
            "sent1": "After the battle, the soldiers fled in a rout, leaving behind their weapons.",
            "sent2": "The army suffered a humiliating rout, causing chaos on the battlefield.",
            "sent3": "The soldiers' rout resembled a chaotic parade as they hurriedly retreated.",
            "sent4": "The rout of the troops was like a river overflowing its banks, unstoppable and destructive.",
            "sent5": "The image of the defeated soldiers in full rout was etched in his memory forever."
        },
        {
            "definition": "A decisive defeat.",
            "pos": "noun",
            "sent1": "The team's loss was not just a defeat but a complete rout by their opponents.",
            "sent2": "The rout in the championship game was a harsh blow to their morale.",
            "sent3": "The rout in the final match left the fans in disbelief.",
            "sent4": "Their defeat was a rout that echoed through the entire league.",
            "sent5": "The rout in the decisive game was a bitter pill to swallow for the players."
        },
        {
            "definition": "To defeat decisively.",
            "pos": "verb",
            "sent1": "The army managed to rout the enemy forces with a surprise attack.",
            "sent2": "The team's strategy was to rout their opponents early in the game.",
            "sent3": "The underdog team managed to rout the reigning champions in a stunning upset.",
            "sent4": "The general's plan was to rout the enemy quickly and decisively.",
            "sent5": "The superhero was able to rout the villains and save the city from destruction."
        },
        {
            "definition": "To dig up or turn over with the snout.",
            "pos": "verb",
            "sent1": "The pig began to rout the ground in search of truffles.",
            "sent2": "The dog tried to rout the soil in the garden, looking for buried bones.",
            "sent3": "The curious raccoon attempted to rout the dirt in the backyard.",
            "sent4": "The squirrel used its paws to rout the leaves in search of hidden nuts.",
            "sent5": "The farmer watched as the chickens tried to rout the earth for insects."
        }
    ]
}