{
    "term": "roven",
    "meanings": [
        {
            "definition": "Past participle of 'rove': to wander or travel without a specific destination",
            "pos": "verb",
            "sent1": "After the storm, the lost dog had roven through the forest looking for its owner.",
            "sent2": "Yesterday, I roven around the city, exploring new streets and parks.",
            "sent3": "The curious cat roven into the neighbor's garden and got stuck in a bush.",
            "sent4": "Her thoughts rovened like a ship lost at sea, drifting aimlessly without direction.",
            "sent5": "The old man's memories rovened back to his childhood, vividly recalling each adventure."
        },
        {
            "definition": "Simple past tense of 'rove': to move aimlessly or without a fixed course",
            "pos": "verb",
            "sent1": "The clouds roven across the sky, casting shadows over the fields.",
            "sent2": "As a child, I roven through the meadow, chasing butterflies and picking flowers.",
            "sent3": "The ball rovened off the wall and landed right in the basket, scoring a point.",
            "sent4": "Her eyes rovened around the room, searching for any sign of the missing keys.",
            "sent5": "The wind rovened through the trees, whispering secrets to the leaves."
        },
        {
            "definition": "Simple past tense of 'rove': to raid or plunder in search of spoils",
            "pos": "verb",
            "sent1": "The pirates roven the coastal villages, taking treasures and valuables.",
            "sent2": "Long ago, barbarians rovened the lands, leaving destruction in their wake.",
            "sent3": "The raccoons rovened the campsite, stealing food from the unsuspecting campers.",
            "sent4": "The invaders rovened the kingdom, leaving chaos and despair in their path.",
            "sent5": "The bandits rovened the trade route, ambushing merchants for their goods."
        }
    ]
}