{
    "term": "row",
    "meanings": [
        {
            "definition": "A line of seats in a theater or auditorium.",
            "pos": "noun",
            "sent1": "In the theater, we sat in the front row to see the play better.",
            "sent2": "The audience filled every row in the cinema for the movie premiere.",
            "sent3": "During the concert, a row broke out over who had the best view.",
            "sent4": "The rows of chairs in the stadium resembled a colorful rainbow.",
            "sent5": "The row of seats was so close to the stage, we could almost touch the actors."
        },
        {
            "definition": "A noisy argument or fight.",
            "pos": "noun",
            "sent1": "There was a loud row between the neighbors about the noisy parties.",
            "sent2": "The siblings often got into a row over who got to use the TV first.",
            "sent3": "The row over the last piece of cake ended with laughter instead of anger.",
            "sent4": "The row in the cafeteria echoed through the entire school building.",
            "sent5": "The row in the playground attracted a crowd of curious onlookers."
        },
        {
            "definition": "To propel a boat with oars.",
            "pos": "verb",
            "sent1": "We rowed across the calm lake to reach the island.",
            "sent2": "The team had to row quickly to win the rowing competition.",
            "sent3": "He tried to row in circles, making everyone on the boat laugh.",
            "sent4": "The rowing motion of the oars created ripples in the water.",
            "sent5": "She rowed with such strength that the boat glided smoothly through the water."
        },
        {
            "definition": "To arrange in a line or series.",
            "pos": "verb",
            "sent1": "She helped to row the books on the shelf in alphabetical order.",
            "sent2": "The students were asked to row themselves in a straight line for the class photo.",
            "sent3": "He decided to row the colorful flowers in a zigzag pattern for the garden.",
            "sent4": "The chef would row the ingredients neatly on the kitchen counter before cooking.",
            "sent5": "The artist would row the paint tubes according to their colors for easy access."
        }
    ]
}