{
    "term": "rowed",
    "meanings": [
        {
            "definition": "past tense of row (verb): to propel a boat using oars",
            "pos": "verb",
            "sent1": "Yesterday, we rowed across the lake in a small boat.",
            "sent2": "The team rowed together smoothly in the rowing competition.",
            "sent3": "The ducks rowed faster than the turtles in the race.",
            "sent4": "She rowed through her problems with determination and strength.",
            "sent5": "The rhythmic sound of rowed oars echoed across the calm water."
        },
        {
            "definition": "past participle of row (verb): to have propelled a boat using oars",
            "pos": "verb",
            "sent1": "Having rowed for hours, they finally reached the shore.",
            "sent2": "She had rowed across the river before the storm hit.",
            "sent3": "The tired rowed sailors celebrated their successful journey.",
            "sent4": "His determination had rowed him through the toughest times.",
            "sent5": "The rowed boat gently rocked in the peaceful waters."
        },
        {
            "definition": "plural form of row (noun): a line of objects or people",
            "pos": "noun",
            "sent1": "The rowed of trees stretched along the path for miles.",
            "sent2": "They stood in a neat rowed waiting for the bus.",
            "sent3": "The rowed of colorful books on the shelf caught her eye.",
            "sent4": "The rowed of students marched in perfect unison.",
            "sent5": "The rowed of candles illuminated the dark room."
        },
        {
            "definition": "past tense of row (noun): a noisy argument or dispute",
            "pos": "noun",
            "sent1": "After the rowed, they both needed some time to cool off.",
            "sent2": "The rowed between the siblings could be heard from the next room.",
            "sent3": "The rowed over the last piece of cake was quite entertaining.",
            "sent4": "Their rowed echoed through the halls of the school.",
            "sent5": "The rowed ended with laughter and apologies."
        }
    ]
}