{
    "term": "rowings",
    "meanings": [
        {
            "definition": "The act of propelling a boat with oars.",
            "pos": "noun",
            "sent1": "During the rowings, the rowers worked together to move the boat forward.",
            "sent2": "She enjoyed watching the rowings on the lake every morning.",
            "sent3": "The rowings in the race were so intense that the spectators couldn't look away.",
            "sent4": "His dedication to perfecting his rowings made him a champion rower.",
            "sent5": "The rhythmic sound of the rowings echoed across the water."
        },
        {
            "definition": "The result of rowing, such as a race or competition.",
            "pos": "noun",
            "sent1": "The rowings of the regatta brought excitement to the town.",
            "sent2": "Winning the rowings was a dream come true for the team.",
            "sent3": "The rowings of the competition left everyone on the edge of their seats.",
            "sent4": "The rowings of the race determined the ultimate champion.",
            "sent5": "The rowings ended with cheers and celebrations."
        },
        {
            "definition": "The process of arranging objects in a line or series.",
            "pos": "noun",
            "sent1": "Her meticulous rowings of books on the shelf impressed everyone.",
            "sent2": "The rowings of chairs in the room made it look organized.",
            "sent3": "The rowings of toys on the floor made it difficult to walk.",
            "sent4": "The rowings of flowers in the garden created a beautiful pattern.",
            "sent5": "The rowings of cars in the parking lot were perfectly aligned."
        },
        {
            "definition": "The act of engaging in a heated argument or dispute.",
            "pos": "noun",
            "sent1": "The rowings between the siblings over the TV remote were loud.",
            "sent2": "Their rowings often ended with both parties feeling frustrated.",
            "sent3": "The rowings between the neighbors were a daily occurrence.",
            "sent4": "The rowings in the meeting led to a decision being made.",
            "sent5": "The rowings in the courtroom were intense and emotional."
        }
    ]
}