{
    "term": "rows",
    "meanings": [
        {
            "definition": "A line of seats in a theater or auditorium.",
            "pos": "noun",
            "sent1": "The audience sat in neat rows during the play.",
            "sent2": "The rows of seats were comfortable and spacious.",
            "sent3": "The rows of seats seemed to be having a meeting of their own.",
            "sent4": "The rows of seats stretched out like a welcoming embrace.",
            "sent5": "The rows of seats resembled soldiers standing in formation."
        },
        {
            "definition": "A line of houses in a street.",
            "pos": "noun",
            "sent1": "The rows of houses on Maple Street were all painted different colors.",
            "sent2": "The rows of houses had beautifully manicured gardens in front.",
            "sent3": "The rows of houses whispered secrets to each other in the night.",
            "sent4": "The rows of houses stood like loyal friends side by side.",
            "sent5": "The rows of houses looked like a colorful parade down the street."
        },
        {
            "definition": "A linear arrangement of objects or people.",
            "pos": "noun",
            "sent1": "The rows of books on the shelf were neatly organized by genre.",
            "sent2": "The rows of students sat quietly during the exam.",
            "sent3": "The rows of trees in the forest danced in the wind.",
            "sent4": "The rows of candles flickered in unison, creating a mesmerizing sight.",
            "sent5": "The rows of cars in the parking lot gleamed under the sun."
        },
        {
            "definition": "To propel a boat with oars.",
            "pos": "verb",
            "sent1": "He rows the boat gracefully across the calm lake.",
            "sent2": "She rows every morning to stay fit and enjoy the sunrise.",
            "sent3": "The ducks watched in amusement as he rows in circles.",
            "sent4": "She rows through life's challenges with determination and strength.",
            "sent5": "The rhythmic sound of oars rowing through the water was soothing."
        },
        {
            "definition": "To engage in a noisy quarrel.",
            "pos": "verb",
            "sent1": "They rows loudly about who should do the dishes.",
            "sent2": "The neighbors rows late into the night, disturbing everyone.",
            "sent3": "The siblings rows over the last piece of cake.",
            "sent4": "He rows with his boss about working overtime without pay.",
            "sent5": "The politicians rows during the debate, trying to outshout each other."
        }
    ]
}