{
    "term": "royal",
    "meanings": [
        {
            "definition": "Of or relating to a king or queen",
            "pos": "adjective",
            "sent1": "The royal crown sparkled in the sunlight.",
            "sent2": "The royal family attended the grand ball at the palace.",
            "sent3": "The royal robe was so long, it tripped the king as he walked.",
            "sent4": "Her kindness was a royal gesture that touched everyone's hearts.",
            "sent5": "The royal banquet was a feast fit for a king."
        },
        {
            "definition": "A member of a royal family",
            "pos": "noun",
            "sent1": "The young royal waved to the cheering crowd.",
            "sent2": "The royal greeted the visiting dignitaries with a smile.",
            "sent3": "The royal's pet corgi stole the show at the palace garden party.",
            "sent4": "She felt like a royal among commoners in the bustling marketplace.",
            "sent5": "The royal's portrait hung proudly in the grand hall of the castle."
        },
        {
            "definition": "Befitting a king or queen",
            "pos": "adjective",
            "sent1": "The royal treatment at the spa made her feel like a queen.",
            "sent2": "The royal banquet featured the finest delicacies from the kingdom.",
            "sent3": "The royal purple curtains added a touch of elegance to the room.",
            "sent4": "His royal manners impressed all who met him.",
            "sent5": "The royal carriage glided through the streets with grace and majesty."
        },
        {
            "definition": "A royal person; a king or queen",
            "pos": "noun",
            "sent1": "The royal was known for his wise decisions and fair rule.",
            "sent2": "The royal's portrait hung prominently in the great hall.",
            "sent3": "The royal's crown was too heavy for his head, causing it to tilt.",
            "sent4": "She felt like a royal as she walked down the red carpet.",
            "sent5": "The royal's presence commanded respect and admiration from all."
        }
    ]
}