{
    "term": "royalism",
    "meanings": [
        {
            "definition": "Support for a monarch or monarchy.",
            "pos": "noun",
            "sent1": "Many people in the country showed their royalism by attending the king's coronation.",
            "sent2": "Her family's royalism was evident in their collection of royal memorabilia.",
            "sent3": "The town's royalism was so strong that even the pets wore crowns on the king's birthday.",
            "sent4": "His royalism was like a shining crown, guiding his decisions with regal grace.",
            "sent5": "The royalism of the citizens was like a majestic river flowing through the kingdom."
        },
        {
            "definition": "The principles or practices of royalists.",
            "pos": "noun",
            "sent1": "The book delved into the history of royalism and its impact on society.",
            "sent2": "She studied the art of royalism to better understand the mindset of monarch supporters.",
            "sent3": "The club's royalism-themed party was a fun way to celebrate their beliefs.",
            "sent4": "In her eyes, his royalism was a badge of honor, a symbol of tradition and loyalty.",
            "sent5": "The painting captured the essence of royalism, with its rich colors and ornate details."
        },
        {
            "definition": "Adherence to or advocacy of a royal system of government.",
            "pos": "noun",
            "sent1": "His speeches were filled with passionate calls for royalism and the preservation of the monarchy.",
            "sent2": "The group's royalism extended beyond mere support, evolving into a movement for change.",
            "sent3": "The comedian's joke about royalism had the audience laughing at the absurdity of it all.",
            "sent4": "In the political arena, his royalism was a powerful force, shaping policies and decisions.",
            "sent5": "The flag waved proudly, a symbol of their unwavering royalism and dedication to the crown."
        }
    ]
}