{
    "term": "rubberneckers",
    "meanings": [
        {
            "definition": "A person who turns their head to stare at something of interest.",
            "pos": "noun",
            "sent1": "The rubberneckers gathered around the street performer to watch the magic show.",
            "sent2": "The rubberneckers slowed down traffic as they stared at the parade passing by.",
            "sent3": "The rubberneckers couldn't resist peeking over the fence to see the cute puppies playing.",
            "sent4": "She felt like a rubbernecker at the zoo, captivated by the lions' majestic presence.",
            "sent5": "The group of rubberneckers outside the store window ogled at the latest gadgets on display."
        },
        {
            "definition": "A group of people who slow down traffic by looking at an accident.",
            "pos": "noun",
            "sent1": "The rubberneckers caused a traffic jam as they craned their necks to see the car crash.",
            "sent2": "Drivers became rubberneckers, causing delays on the highway as they stared at the overturned truck.",
            "sent3": "The rubberneckers on the bridge couldn't help but pause to watch the rescue operation below.",
            "sent4": "The line of rubberneckers on the sidewalk created a bottleneck as they observed the fire across the street.",
            "sent5": "The curious rubberneckers on the bus strained to catch a glimpse of the commotion ahead."
        },
        {
            "definition": "To gawk or stare at something in a nosy or intrusive manner.",
            "pos": "verb",
            "sent1": "She rubbernecked at her neighbor's new car parked in the driveway.",
            "sent2": "The tourists rubbernecked at the tall skyscrapers in the city, amazed by their height.",
            "sent3": "He rubbernecked at the menu board, trying to decide what to order for lunch.",
            "sent4": "The kids rubbernecked at the strange creature in the pond, wondering what it could be.",
            "sent5": "As they walked through the museum, they rubbernecked at the priceless artifacts on display."
        }
    ]
}