{
    "term": "rubrication",
    "meanings": [
        {
            "definition": "The act of adding red letters or decorations to a manuscript.",
            "pos": "noun",
            "sent1": "The rubrication in the ancient book made the text stand out.",
            "sent2": "The calligrapher used rubrication to enhance the beauty of the manuscript.",
            "sent3": "The rubrication on the pages seemed to dance in the flickering candlelight.",
            "sent4": "Her artistic rubrication transformed the plain document into a work of art.",
            "sent5": "The rubrication, like drops of blood, added a dramatic flair to the text."
        },
        {
            "definition": "A set of instructions or rules for conducting a religious service.",
            "pos": "noun",
            "sent1": "The priest followed the rubrication carefully during the ceremony.",
            "sent2": "The rubrication provided a clear guide for the order of worship.",
            "sent3": "The rubrication for the service was so detailed, it felt like a script for a play.",
            "sent4": "She treated the rubrication as a sacred text, never deviating from its instructions.",
            "sent5": "The rubrication acted as a roadmap, leading the congregation through the service."
        },
        {
            "definition": "The process of grading or evaluating student work using a predetermined set of criteria.",
            "pos": "noun",
            "sent1": "Teachers use rubrication to assess assignments consistently.",
            "sent2": "The rubrication helped students understand how their work would be evaluated.",
            "sent3": "The students joked that the rubrication was like a strict judge handing out scores.",
            "sent4": "In the world of education, rubrication is the compass that guides assessment.",
            "sent5": "The rubrication system made grading transparent and fair for all students."
        }
    ]
}