{
    "term": "rubying",
    "meanings": [
        {
            "definition": "The act of rubbing something.",
            "pos": "noun",
            "sent1": "I felt the rough rubying of the sandpaper against my skin.",
            "sent2": "She used gentle rubying to clean the dusty bookshelf.",
            "sent3": "The cat's rubying of its face against the carpet left a trail of fur behind.",
            "sent4": "The constant rubying of the door against the frame caused it to squeak loudly.",
            "sent5": "The rhythmic rubying of the massage therapist's hands helped relax the tense muscles."
        },
        {
            "definition": "The process of applying a substance to a surface by rubbing.",
            "pos": "noun",
            "sent1": "The rubying of sunscreen onto the skin helps protect from sunburn.",
            "sent2": "She demonstrated the proper rubying of wax onto the car's surface.",
            "sent3": "The rubying of glue onto the paper caused it to stick instantly.",
            "sent4": "The rubying of oil onto the hinges made the door swing smoothly.",
            "sent5": "The rubying of lotion onto dry hands left them feeling soft and moisturized."
        },
        {
            "definition": "The act of polishing or cleaning by rubbing.",
            "pos": "noun",
            "sent1": "Her vigorous rubying of the silverware made them shine like new.",
            "sent2": "The rubying of the shoes with a cloth removed the dirt and dust.",
            "sent3": "The rubying of the windows with a cloth left them sparkling in the sunlight.",
            "sent4": "The rubying of the floor with a mop made it gleam under the bright lights.",
            "sent5": "The rubying of the car's exterior with a sponge restored its glossy finish."
        },
        {
            "definition": "The act of causing friction by rubbing.",
            "pos": "noun",
            "sent1": "The rubying of the balloon against the wall created static electricity.",
            "sent2": "The constant rubying of the tires against the road wore them out quickly.",
            "sent3": "The rubying of the match against the box ignited a flame.",
            "sent4": "The rubying of two sticks together started a campfire in no time.",
            "sent5": "The rubying of the cloth against the glass produced a squeaking sound."
        },
        {
            "definition": "The act of soothing or massaging by rubbing.",
            "pos": "noun",
            "sent1": "The gentle rubying of the baby's back put him to sleep.",
            "sent2": "She learned the art of rubying sore muscles to relieve tension.",
            "sent3": "The rubying of the temples helped alleviate the headache.",
            "sent4": "The rubying of the feet after a long day brought instant relief.",
            "sent5": "The rubying of the scalp with essential oils promoted relaxation and calmness."
        }
    ]
}