{
    "term": "rucking",
    "meanings": [
        {
            "definition": "The act of participating in a game of rugby where players try to gain possession of the ball by kicking it backwards with their feet.",
            "pos": "noun",
            "sent1": "During the rucking, the player skillfully kicked the ball to a teammate.",
            "sent2": "In rugby, rucking is a crucial part of the game to gain control of the ball.",
            "sent3": "The rucking match was intense, with players strategically kicking the ball around.",
            "sent4": "The team's success relied on their precise rucking to outmaneuver the opponents.",
            "sent5": "The coach emphasized the importance of strong rucking skills for winning matches."
        },
        {
            "definition": "The act of forming wrinkles or creases in fabric or material.",
            "pos": "noun",
            "sent1": "Her hurried folding of the shirt resulted in accidental rucking along the sleeves.",
            "sent2": "The delicate fabric showed signs of rucking after being crumpled in the suitcase.",
            "sent3": "The rucking on the tablecloth gave it a unique textured appearance.",
            "sent4": "The tailor carefully ironed out any rucking in the dress to ensure a smooth finish.",
            "sent5": "The old curtains had noticeable rucking from years of being drawn open and closed."
        },
        {
            "definition": "The act of engaging in physical contact or pushing and shoving with an opponent during a game or competition.",
            "pos": "noun",
            "sent1": "The aggressive rucking between the players led to a penalty for unnecessary roughness.",
            "sent2": "During the match, the referee closely monitored any excessive rucking on the field.",
            "sent3": "The playful rucking between the siblings during the game brought laughter to the spectators.",
            "sent4": "The coach emphasized fair play and discouraged any unsportsmanlike rucking.",
            "sent5": "The intense rucking between the teams added excitement to the already thrilling game."
        }
    ]
}