{
    "term": "ruck",
    "meanings": [
        {
            "definition": "A dense group of people or objects",
            "pos": "noun",
            "sent1": "The children formed a ruck around the teacher during storytime.",
            "sent2": "The fans created a ruck as they rushed towards the stage.",
            "sent3": "The ruck of colorful balloons made the party even more festive.",
            "sent4": "In the busy market, shoppers moved like a ruck of ants.",
            "sent5": "The ruck of fallen leaves covered the entire sidewalk."
        },
        {
            "definition": "A fold or wrinkle in fabric",
            "pos": "noun",
            "sent1": "She smoothed out the ruck in her dress before the party.",
            "sent2": "The tailor carefully ironed out the ruck in the shirt.",
            "sent3": "The ruck in the tablecloth looked like a tiny mountain.",
            "sent4": "The old map had a ruck that obscured part of the coastline.",
            "sent5": "The ruck in the curtain created interesting shadows in the room."
        },
        {
            "definition": "To gather or form into a dense group",
            "pos": "verb",
            "sent1": "The students decided to ruck together for a group project.",
            "sent2": "Let's ruck all the chairs in the center for the meeting.",
            "sent3": "The kids tried to ruck all their toys into one big pile.",
            "sent4": "She managed to ruck all the scattered papers into a neat stack.",
            "sent5": "The team will ruck near the finish line for a group photo."
        },
        {
            "definition": "A rough or disorderly fight or scuffle",
            "pos": "noun",
            "sent1": "The boys got into a ruck over who won the game.",
            "sent2": "The street was chaotic with the ruck between rival gangs.",
            "sent3": "The ruck between the puppies over the toy was adorable.",
            "sent4": "The political debate turned into a verbal ruck between the candidates.",
            "sent5": "The ruck in the schoolyard was quickly broken up by the teachers."
        }
    ]
}