{
    "term": "rued",
    "meanings": [
        {
            "definition": "Regretted",
            "pos": "verb",
            "sent1": "She rued not studying for the test.",
            "sent2": "He rued missing the opportunity to travel.",
            "sent3": "The student rued forgetting his homework on the kitchen table.",
            "sent4": "The traveler rued not packing an umbrella as the rain poured down.",
            "sent5": "The chef rued overcooking the steak and making it too tough."
        },
        {
            "definition": "Repented",
            "pos": "verb",
            "sent1": "After causing harm, he rued his actions deeply.",
            "sent2": "She rued her harsh words and apologized sincerely.",
            "sent3": "The child quickly rued breaking his favorite toy.",
            "sent4": "The thief rued stealing from the kind old lady.",
            "sent5": "The driver rued running the red light and causing an accident."
        },
        {
            "definition": "Felt sorry for",
            "pos": "verb",
            "sent1": "She rued her friend's loss and offered comfort.",
            "sent2": "He rued the stray cat's hunger and gave it some food.",
            "sent3": "The teacher rued the student's confusion and explained patiently.",
            "sent4": "The neighbor rued the family's misfortune and offered help.",
            "sent5": "The hiker rued the injured bird's plight and called for assistance."
        },
        {
            "definition": "Lamented",
            "pos": "adjective",
            "sent1": "The lamented song echoed through the empty halls.",
            "sent2": "The lamented poet's works touched many hearts.",
            "sent3": "The lamented loss of the old tree saddened the whole town.",
            "sent4": "The lamented painting captured the artist's sorrow.",
            "sent5": "The lamented hero's sacrifice was remembered by all."
        }
    ]
}