{
    "term": "ruffes",
    "meanings": [
        {
            "definition": "A type of freshwater fish.",
            "pos": "noun",
            "sent1": "The pond was full of colorful ruffes swimming gracefully.",
            "sent2": "Anglers enjoy catching ruffes in the calm river.",
            "sent3": "The ruffes in the lake had a meeting to discuss their next swimming competition.",
            "sent4": "Her thoughts swam like a school of ruffes, moving swiftly and gracefully.",
            "sent5": "The ruffes shimmered in the sunlight, a sight to behold."
        },
        {
            "definition": "To make a rough, harsh sound.",
            "pos": "verb",
            "sent1": "The old door ruffes loudly when opened.",
            "sent2": "The thunder ruffes in the distance, signaling an approaching storm.",
            "sent3": "The cat ruffes at the sight of a cucumber, startled by its presence.",
            "sent4": "The wind ruffes through the trees, creating a haunting melody.",
            "sent5": "His voice ruffes with anger as he shouted across the field."
        },
        {
            "definition": "A collar or frill worn around the neck.",
            "pos": "noun",
            "sent1": "She wore a beautiful lace ruffes with her elegant dress.",
            "sent2": "In the play, the queen's costume included a regal ruffes.",
            "sent3": "The puppy looked adorable with a tiny ruffes around its neck.",
            "sent4": "Her ruffes added a touch of sophistication to her outfit.",
            "sent5": "The historical painting showed a nobleman wearing a lavish ruffes."
        },
        {
            "definition": "To disturb the smoothness or order of.",
            "pos": "verb",
            "sent1": "The mischievous child ruffes the neatly arranged books on the shelf.",
            "sent2": "The wind can easily ruffes the surface of the calm lake.",
            "sent3": "The magician's trick was to ruffes the deck of cards before performing.",
            "sent4": "His unexpected arrival ruffes the carefully planned party.",
            "sent5": "The artist deliberately ruffes the paint to create a textured effect."
        }
    ]
}