{
    "term": "rugged",
    "meanings": [
        {
            "definition": "Having a rough, uneven, or jagged surface.",
            "pos": "adjective",
            "sent1": "The rugged mountain was difficult to climb.",
            "sent2": "The hiker enjoyed the rugged terrain of the trail.",
            "sent3": "The rugged road made the car bounce around like a popcorn kernel in a hot pan.",
            "sent4": "His rugged hands told the story of hard work and determination.",
            "sent5": "The rugged bark of the tree felt like sandpaper against his palm."
        },
        {
            "definition": "Strongly built or sturdy in construction.",
            "pos": "adjective",
            "sent1": "The rugged table could hold the weight of a small elephant.",
            "sent2": "The blacksmith crafted a rugged sword that could withstand any battle.",
            "sent3": "The rugged chair refused to break even when sat on by a sumo wrestler.",
            "sent4": "Her rugged determination to succeed inspired everyone around her.",
            "sent5": "The rugged fortress stood tall against the enemy's attacks."
        },
        {
            "definition": "Having a weathered or worn appearance.",
            "pos": "adjective",
            "sent1": "The old barn had a rugged look with its peeling paint and rusty roof.",
            "sent2": "The sailor's face was rugged from years spent at sea.",
            "sent3": "The rugged suitcase looked like it had traveled the world twice over.",
            "sent4": "Her rugged boots showed the signs of many adventures taken.",
            "sent5": "The rugged map had been folded and refolded, showing its age."
        },
        {
            "definition": "Lacking refinement or elegance.",
            "pos": "adjective",
            "sent1": "His rugged manners often startled the refined guests at the party.",
            "sent2": "The cabin's interior was intentionally rugged to give a cozy feel.",
            "sent3": "The rugged dance moves of the bear were surprisingly graceful.",
            "sent4": "Her rugged speech was a stark contrast to the eloquence of the poet.",
            "sent5": "The rugged painting captured the raw beauty of the landscape."
        }
    ]
}