{
    "term": "ruin",
    "meanings": [
        {
            "definition": "The physical destruction or disintegration of something.",
            "pos": "noun",
            "sent1": "The earthquake left a path of ruin in its wake.",
            "sent2": "The abandoned house was in complete ruin.",
            "sent3": "The kids turned the sandcastle into a ruin in minutes.",
            "sent4": "Her heart felt like a ruin after the breakup.",
            "sent5": "The ruin of the ancient city was a haunting sight."
        },
        {
            "definition": "The state of being extensively damaged or destroyed.",
            "pos": "noun",
            "sent1": "The old building stood in ruin after the fire.",
            "sent2": "The storm left a trail of ruin in its path.",
            "sent3": "The ruined cake was still delicious to eat.",
            "sent4": "The ruin of their friendship was a sad outcome.",
            "sent5": "The ruin of the once beautiful garden was heartbreaking."
        },
        {
            "definition": "To cause the downfall or destruction of something.",
            "pos": "verb",
            "sent1": "His reckless actions could ruin their plans.",
            "sent2": "One mistake could ruin everything they had worked for.",
            "sent3": "She tried to ruin the surprise party but failed.",
            "sent4": "The storm threatened to ruin their outdoor picnic.",
            "sent5": "The loud noise would ruin the peaceful atmosphere."
        },
        {
            "definition": "To bring to a state of decay or collapse.",
            "pos": "verb",
            "sent1": "Leaving food out in the sun can quickly ruin it.",
            "sent2": "Neglecting maintenance can ruin a building over time.",
            "sent3": "The rain threatened to ruin their outdoor event.",
            "sent4": "The lack of care would ruin the delicate fabric.",
            "sent5": "The constant exposure to sunlight would ruin the painting."
        }
    ]
}