{
    "term": "ruinously",
    "meanings": [
        {
            "definition": "In a manner that causes ruin or destruction.",
            "pos": "adverb",
            "sent1": "The storm hit the small town ruinously, leaving behind a path of destruction.",
            "sent2": "The old building was ruinously demolished to make way for a new skyscraper.",
            "sent3": "The mischievous puppy ruinously chewed through the sofa, much to the owner's dismay.",
            "sent4": "The wildfire spread ruinously through the forest, consuming everything in its path.",
            "sent5": "The reckless driver drove ruinously fast, endangering everyone on the road."
        },
        {
            "definition": "In a way that leads to financial ruin.",
            "pos": "adverb",
            "sent1": "The businessman invested ruinously in a failing company, losing all his savings.",
            "sent2": "She spent ruinously on unnecessary luxuries, putting herself in financial jeopardy.",
            "sent3": "The impulsive shopper ruinously maxed out her credit cards on frivolous purchases.",
            "sent4": "The gambler bet ruinously high stakes, risking everything he had.",
            "sent5": "The economic downturn affected the small business ruinously, leading to bankruptcy."
        },
        {
            "definition": "In a manner that results in complete failure.",
            "pos": "adverb",
            "sent1": "The magician's trick failed ruinously, much to the disappointment of the audience.",
            "sent2": "The student procrastinated ruinously and failed to complete the assignment on time.",
            "sent3": "The chef's attempt at a new recipe ended ruinously, resulting in a burnt dish.",
            "sent4": "The explorer's expedition ended ruinously when they got lost in the wilderness.",
            "sent5": "The plan to rescue the hostages failed ruinously, causing chaos and panic."
        }
    ]
}