{
    "term": "rumble",
    "meanings": [
        {
            "definition": "A deep, resonant sound.",
            "pos": "noun",
            "sent1": "The thunder made a loud rumble in the sky.",
            "sent2": "I heard a distant rumble of a passing train.",
            "sent3": "The rumble of the old car engine sounded like a sleepy bear.",
            "sent4": "The rumble of the waterfall echoed through the valley.",
            "sent5": "The rumble of the earthquake shook the ground beneath our feet."
        },
        {
            "definition": "To make a continuous deep, resonant sound.",
            "pos": "verb",
            "sent1": "The truck engine started to rumble as it idled.",
            "sent2": "The thunder continued to rumble in the distance.",
            "sent3": "The old fridge likes to rumble like a grumpy cat.",
            "sent4": "His stomach began to rumble loudly during the meeting.",
            "sent5": "The volcano started to rumble before the eruption."
        },
        {
            "definition": "A street fight or brawl.",
            "pos": "noun",
            "sent1": "The neighborhood kids got into a loud rumble after school.",
            "sent2": "The rumble between the two gangs caused chaos in the street.",
            "sent3": "The rumble over the last piece of cake was intense but funny.",
            "sent4": "The rumble between the rival soccer teams ended in a draw.",
            "sent5": "The rumble between the siblings over the TV remote was settled peacefully."
        },
        {
            "definition": "To engage in a street fight or brawl.",
            "pos": "verb",
            "sent1": "The two groups started to rumble in the park.",
            "sent2": "The kids decided to rumble instead of talking out their differences.",
            "sent3": "The cats began to rumble over the sunny spot by the window.",
            "sent4": "The fans started to rumble in the stands during the intense game.",
            "sent5": "The protesters began to rumble against the new law in the city square."
        }
    ]
}