{
    "term": "rumbustious",
    "meanings": [
        {
            "definition": "Unruly or boisterous in behavior",
            "pos": "adjective",
            "sent1": "The children were so rumbustious during recess that the teacher had to intervene.",
            "sent2": "The party became rumbustious as more guests arrived and the music got louder.",
            "sent3": "The rumbustious puppy knocked over the flower pot while chasing its tail.",
            "sent4": "The storm outside was as rumbustious as a wild horse galloping through the fields.",
            "sent5": "The rumbustious laughter of the friends echoed through the park."
        },
        {
            "definition": "Characterized by noisy and rough play or behavior",
            "pos": "adjective",
            "sent1": "The rumbustious puppies were rolling around in the mud, barking happily.",
            "sent2": "The street was filled with the rumbustious sounds of children playing games.",
            "sent3": "The rumbustious kittens chased each other around the room, knocking over everything in their path.",
            "sent4": "The old truck made a rumbustious noise as it struggled up the steep hill.",
            "sent5": "The rumbustious waves crashed against the shore, creating a symphony of sound."
        },
        {
            "definition": "Rowdy or disorderly in nature",
            "pos": "adjective",
            "sent1": "The rumbustious crowd at the concert pushed and shoved to get closer to the stage.",
            "sent2": "The classroom was filled with rumbustious chatter as the students worked on group projects.",
            "sent3": "The rumbustious squirrels in the park stole snacks from unsuspecting picnickers.",
            "sent4": "The rumbustious wind blew the leaves in all directions, creating a chaotic dance.",
            "sent5": "The rumbustious market was a whirlwind of activity, with vendors shouting their prices."
        }
    ]
}