{
    "term": "runaway",
    "meanings": [
        {
            "definition": "A person who has run away.",
            "pos": "noun",
            "sent1": "The runaway was found safe and sound at the park.",
            "sent2": "The police are searching for the runaway teenager.",
            "sent3": "The runaway left a note saying they needed some time alone.",
            "sent4": "Her heart felt like a runaway train when she saw the surprise party.",
            "sent5": "The runaway's disappearance left everyone worried and anxious."
        },
        {
            "definition": "A horse or other animal that has escaped.",
            "pos": "noun",
            "sent1": "The rancher had to chase after the runaway horse.",
            "sent2": "The runaway cow wandered into the neighbor's field.",
            "sent3": "The runaway pig caused quite a commotion in the village.",
            "sent4": "The runaway sheep led the farmer on a wild chase through the meadow.",
            "sent5": "The runaway dog wagged its tail happily after being caught."
        },
        {
            "definition": "A vehicle or machine that is out of control.",
            "pos": "noun",
            "sent1": "The driver struggled to regain control of the runaway car.",
            "sent2": "The mechanic fixed the brakes on the runaway truck.",
            "sent3": "The runaway lawnmower raced across the yard on its own.",
            "sent4": "The runaway rollercoaster thrilled and terrified the riders.",
            "sent5": "The runaway skateboard crashed into the fence with a loud bang."
        },
        {
            "definition": "A victory in a competition by a large margin.",
            "pos": "noun",
            "sent1": "The team celebrated their runaway win with cheers and high-fives.",
            "sent2": "The athlete secured a runaway victory in the race.",
            "sent3": "The runaway success of the play surprised everyone in the audience.",
            "sent4": "The company's runaway profits exceeded all expectations.",
            "sent5": "The student's runaway lead in the spelling bee impressed the judges."
        }
    ]
}