{
    "term": "runds",
    "meanings": [
        {
            "definition": "A circular object or shape",
            "pos": "noun",
            "sent1": "The children played with colorful runds in the park.",
            "sent2": "The artist drew a perfect runds on the canvas.",
            "sent3": "The cake was decorated with runds made of frosting.",
            "sent4": "Her eyes widened at the sight of the giant runds in the sky.",
            "sent5": "The moon shone like a silver runds in the night sky."
        },
        {
            "definition": "To run quickly and without stopping",
            "pos": "verb",
            "sent1": "The cheetah can runds faster than any other animal.",
            "sent2": "I need to runds to catch the bus before it leaves.",
            "sent3": "The squirrel decided to runds around the tree for fun.",
            "sent4": "Time seemed to runds by as we raced to the finish line.",
            "sent5": "The wind made the leaves runds along the ground."
        },
        {
            "definition": "A unit of currency in Sweden",
            "pos": "noun",
            "sent1": "In Sweden, you can buy a lot with just a few runds.",
            "sent2": "He exchanged his dollars for Swedish runds at the bank.",
            "sent3": "The tourist was excited to use the local runds for shopping.",
            "sent4": "She saved up her runds for a special souvenir from Sweden.",
            "sent5": "The runds jingled in his pocket as he walked down the street."
        },
        {
            "definition": "A type of small, round candy",
            "pos": "noun",
            "sent1": "The children enjoyed the sweet runds during the movie.",
            "sent2": "She bought a bag of colorful runds from the candy store.",
            "sent3": "The runds melted in her mouth, leaving a fruity taste.",
            "sent4": "The jar on the counter was filled with assorted runds.",
            "sent5": "The runds sparkled like tiny gems in the sunlight."
        }
    ]
}