{
    "term": "runnable",
    "meanings": [
        {
            "definition": "Capable of being run or operated.",
            "pos": "adjective",
            "sent1": "The new machine is runnable with just a push of a button.",
            "sent2": "The treadmill at the gym is always runnable for anyone to use.",
            "sent3": "The remote control was feeling playful and decided to be runnable only when it felt like it.",
            "sent4": "Her mind was a well-oiled machine, always runnable and ready for any challenge.",
            "sent5": "The idea was so exciting and full of energy, it seemed almost too runnable to resist."
        },
        {
            "definition": "Suitable or safe for running.",
            "pos": "adjective",
            "sent1": "The path through the park is always runnable, perfect for a morning jog.",
            "sent2": "The track field is designed to be runnable without any obstacles in the way.",
            "sent3": "The fluffy carpet in the living room felt so runnable that the cat couldn't resist sprinting across it.",
            "sent4": "Her heart was a runway, clear and runnable for love to take off.",
            "sent5": "The plan was so well thought out, it was as smooth and runnable as a freshly paved road."
        },
        {
            "definition": "Able to be executed or completed.",
            "pos": "adjective",
            "sent1": "The project seemed daunting at first, but it turned out to be quite runnable with the team's effort.",
            "sent2": "The task list for the day was carefully organized to ensure each item was runnable by the end.",
            "sent3": "The puzzle looked challenging, but once she started, it was surprisingly runnable to solve.",
            "sent4": "His plan was like a well-oiled machine, smoothly runnable towards success.",
            "sent5": "The goal was so clear and achievable, it felt like a perfectly runnable path to follow."
        }
    ]
}