{
    "term": "runners",
    "meanings": [
        {
            "definition": "A person who runs.",
            "pos": "noun",
            "sent1": "The runners raced to the finish line.",
            "sent2": "The marathon had many dedicated runners.",
            "sent3": "The runners in the park looked like they were in a hurry to catch a bus.",
            "sent4": "The runners on the track were like cheetahs chasing their prey.",
            "sent5": "The image of the runners sprinting will stay with me forever."
        },
        {
            "definition": "Long, narrow strips of carpet or other material used for decorating or protecting floors.",
            "pos": "noun",
            "sent1": "The runners in the hallway added a touch of elegance to the room.",
            "sent2": "She chose a red carpet runners for the stairs.",
            "sent3": "The runners in the living room made it feel cozy and warm.",
            "sent4": "The runners in the office were like colorful paths leading to different desks.",
            "sent5": "The soft texture of the runners felt comforting underfoot."
        },
        {
            "definition": "Horizontal supports on a ladder for climbing.",
            "pos": "noun",
            "sent1": "He carefully placed his foot on the ladder runners.",
            "sent2": "The painters used the ladder runners to reach the high ceiling.",
            "sent3": "The ladder runners seemed like tiny steps to reach the sky.",
            "sent4": "The ladder runners were like rungs on a giant staircase.",
            "sent5": "The ladder runners provided stability as he climbed higher."
        },
        {
            "definition": "Plants that grow horizontally along the ground and send out roots and shoots.",
            "pos": "noun",
            "sent1": "The strawberry runners spread across the garden.",
            "sent2": "The runners of the ivy plant covered the entire wall.",
            "sent3": "The runners of the creeping vine looked like nature's own carpet.",
            "sent4": "The runners of the grass intertwined to form a lush carpet.",
            "sent5": "The green runners of the plant created a beautiful pattern on the ground."
        }
    ]
}