{
    "term": "runout",
    "meanings": [
        {
            "definition": "The act of running out or away",
            "pos": "noun",
            "sent1": "The runout of the thief was swift and silent.",
            "sent2": "During the game, the player made a runout to escape the opponent.",
            "sent3": "The squirrel's runout from the garden was comical as it carried a large nut.",
            "sent4": "Her runout from the boring meeting was like a gust of wind.",
            "sent5": "The runout of the cat from the room left a trail of overturned objects."
        },
        {
            "definition": "The final portion of a race or competition",
            "pos": "noun",
            "sent1": "The marathon runner sprinted in the runout to reach the finish line.",
            "sent2": "The audience cheered loudly as the horses approached the runout.",
            "sent3": "The runout of the race felt like the most exciting part.",
            "sent4": "The runout of the soccer match was filled with tension and anticipation.",
            "sent5": "The runout of the relay race determined the winning team."
        },
        {
            "definition": "The depletion or exhaustion of a resource",
            "pos": "noun",
            "sent1": "The runout of water in the well was a serious problem for the village.",
            "sent2": "The runout of snacks in the pantry led to a trip to the grocery store.",
            "sent3": "The runout of cookies at the party left everyone disappointed.",
            "sent4": "The runout of patience in the classroom was evident as the students grew restless.",
            "sent5": "The runout of fuel in the car stranded them on the highway."
        },
        {
            "definition": "A sudden decrease in intensity or volume, as in music or a sports play",
            "pos": "noun",
            "sent1": "The runout of the music caught everyone's attention as it faded away.",
            "sent2": "The runout of the applause signaled the end of the performance.",
            "sent3": "The runout of the cheers left the stadium in silence.",
            "sent4": "The runout of the drumbeat added a dramatic effect to the song.",
            "sent5": "The runout of the crowd noise created a moment of suspense in the game."
        }
    ]
}