{
    "term": "runs",
    "meanings": [
        {
            "definition": "Move swiftly on foot",
            "pos": "verb",
            "sent1": "He runs to catch the bus every morning.",
            "sent2": "The dog runs happily in the park.",
            "sent3": "The squirrel runs around the tree in a playful chase.",
            "sent4": "Time runs like a river, never stopping.",
            "sent5": "The wind runs through the fields, carrying whispers of stories."
        },
        {
            "definition": "A period of time in which a particular activity or operation is carried out",
            "pos": "noun",
            "sent1": "The bakery has early morning runs to prepare fresh bread.",
            "sent2": "During the school runs, traffic can be heavy.",
            "sent3": "The runs of the washing machine seem never-ending on laundry day.",
            "sent4": "The runs of the play rehearsals kept everyone busy.",
            "sent5": "The runs of the factory were smooth and efficient."
        },
        {
            "definition": "A sequence of cards in a card game",
            "pos": "noun",
            "sent1": "She had a good hand with three runs in the game.",
            "sent2": "The runs in poker can lead to exciting wins.",
            "sent3": "The runs of cards in solitaire can be tricky to complete.",
            "sent4": "His runs in the card game were unmatched by anyone.",
            "sent5": "The runs in the deck made the game more challenging."
        },
        {
            "definition": "A flow or discharge of liquid or gas",
            "pos": "noun",
            "sent1": "The water runs clear from the mountain stream.",
            "sent2": "The runs of gas from the stove were concerning.",
            "sent3": "The runs of rainwater down the window created a soothing sound.",
            "sent4": "The runs of lava from the volcano were dangerous.",
            "sent5": "The runs of ink from the pen formed beautiful patterns on the paper."
        },
        {
            "definition": "A series of successes or failures in a particular activity",
            "pos": "noun",
            "sent1": "Her recent runs in business have been profitable.",
            "sent2": "The team had a good run of successful runs in the competition.",
            "sent3": "The runs of luck in the game turned in his favor.",
            "sent4": "The runs of failures taught him valuable lessons.",
            "sent5": "The runs of achievements motivated them to aim higher."
        }
    ]
}