{
    "term": "rurus",
    "meanings": [
        {
            "definition": "A type of bird known for its colorful plumage.",
            "pos": "noun",
            "sent1": "The rurus chirped melodiously in the forest.",
            "sent2": "I spotted a beautiful rurus flying in the sky.",
            "sent3": "The mischievous cat tried to catch the rurus but failed.",
            "sent4": "Her dress was as vibrant as a rurus's feathers.",
            "sent5": "The rurus's feathers shimmered like a rainbow in the sunlight."
        },
        {
            "definition": "A type of plant with small, fragrant flowers.",
            "pos": "noun",
            "sent1": "The garden was filled with colorful rurus.",
            "sent2": "She picked a bunch of sweet-smelling rurus for her vase.",
            "sent3": "The bees buzzed happily around the blooming rurus.",
            "sent4": "The rurus in the garden danced in the gentle breeze.",
            "sent5": "The delicate petals of the rurus glowed in the moonlight."
        },
        {
            "definition": "To move quickly and energetically.",
            "pos": "verb",
            "sent1": "The children rurused across the playground with laughter.",
            "sent2": "I need to rurus to catch the bus on time.",
            "sent3": "The squirrel rurused up the tree to escape the dog.",
            "sent4": "Her heart rurused with excitement as she won the race.",
            "sent5": "Time seemed to rurus by as they enjoyed their day at the park."
        },
        {
            "definition": "A type of fabric with a smooth texture.",
            "pos": "noun",
            "sent1": "She wore a dress made of soft rurus.",
            "sent2": "The curtains in the room were made of luxurious rurus.",
            "sent3": "The tailor carefully sewed the delicate rurus into a gown.",
            "sent4": "The rurus felt like a gentle caress against her skin.",
            "sent5": "The royal robe shimmered with the sheen of fine rurus."
        }
    ]
}