{
    "term": "rush",
    "meanings": [
        {
            "definition": "A sudden quick movement towards something or someone.",
            "pos": "noun",
            "sent1": "The child made a rush towards the ice cream truck.",
            "sent2": "The football fans made a rush towards the field after the game.",
            "sent3": "In her excitement, she made a rush towards the stage to see her favorite singer.",
            "sent4": "The rush of students towards the exit at the end of the school day was like a stampede.",
            "sent5": "The sudden rush of water down the hill was a sight to behold."
        },
        {
            "definition": "A feeling of urgency or excitement.",
            "pos": "noun",
            "sent1": "She felt a rush of joy when she saw her family after a long time.",
            "sent2": "The rush of adrenaline before a roller coaster ride is thrilling.",
            "sent3": "The rush of getting ready for a surprise party was exhilarating.",
            "sent4": "The rush of emotions during a wedding ceremony is unforgettable.",
            "sent5": "The rush of happiness when she received good news was overwhelming."
        },
        {
            "definition": "To move quickly or with great haste.",
            "pos": "verb",
            "sent1": "The students rush to finish their homework before the bell rings.",
            "sent2": "I rush to catch the bus every morning.",
            "sent3": "He will rush to the store before it closes to buy some milk.",
            "sent4": "The workers rush to complete the project before the deadline.",
            "sent5": "She will rush to the airport to catch her flight on time."
        },
        {
            "definition": "To push or force one's way through a crowd.",
            "pos": "verb",
            "sent1": "The crowd rushed towards the stage to get a better view of the concert.",
            "sent2": "She had to rush through the crowd to reach the lost child.",
            "sent3": "He tried to rush through the crowd to catch the last train.",
            "sent4": "The fans rushed through the gates to enter the stadium.",
            "sent5": "The protesters rushed through the streets to make their voices heard."
        },
        {
            "definition": "A plant with slender stems and small flowers.",
            "pos": "noun",
            "sent1": "The rush by the pond added a touch of green to the landscape.",
            "sent2": "She picked a few rushes to make a simple bouquet.",
            "sent3": "The rush swayed gently in the breeze by the riverbank.",
            "sent4": "The field was filled with rushes of different colors.",
            "sent5": "The rush added a delicate beauty to the garden."
        }
    ]
}