{
    "term": "rusticated",
    "meanings": [
        {
            "definition": "To live or spend time in the countryside",
            "pos": "verb",
            "sent1": "During the summer break, my family and I rusticated in a cozy cabin near the forest.",
            "sent2": "Many people enjoy rusticated weekends away from the city to relax in nature.",
            "sent3": "The city dweller decided to rusticate for a week, but quickly missed the hustle and bustle.",
            "sent4": "The idea of rusticated life seemed like a dream until the reality of no Wi-Fi set in.",
            "sent5": "She found peace and tranquility when she rusticated in the serene countryside."
        },
        {
            "definition": "To give a rustic appearance to a building",
            "pos": "verb",
            "sent1": "The architect rusticated the exterior walls of the house to match the natural surroundings.",
            "sent2": "The old farmhouse was rusticated with wooden beams and stone walls for a charming look.",
            "sent3": "The modern building looked out of place until it was rusticated to blend in with the village.",
            "sent4": "The castle's walls were rusticated to give it a timeless and majestic appearance.",
            "sent5": "The artist's touch rusticated the plain structure into a work of art."
        },
        {
            "definition": "To suspend a student from a university as a punishment",
            "pos": "verb",
            "sent1": "The university decided to rusticate the student for breaking the code of conduct.",
            "sent2": "Being rusticated from the university was a harsh consequence for his actions.",
            "sent3": "The student regretted his actions when he was rusticated and had to return home.",
            "sent4": "Rusticating the student served as a warning to others about the consequences of misbehavior.",
            "sent5": "The student's parents were disappointed when they heard he was rusticated from his studies."
        }
    ]
}