{
    "term": "rya",
    "meanings": [
        {
            "definition": "A type of Scandinavian rug",
            "pos": "noun",
            "sent1": "My grandmother's rya rug is so soft and colorful.",
            "sent2": "The rya rug in the living room adds warmth to the space.",
            "sent3": "I accidentally spilled juice on the rya rug, creating a fruity pattern.",
            "sent4": "The rya rug was a patchwork of memories, each thread holding a story.",
            "sent5": "Walking barefoot on the rya rug felt like stepping on a cloud."
        },
        {
            "definition": "A unit of currency in Afghanistan",
            "pos": "noun",
            "sent1": "In Afghanistan, people use rya to buy goods and services.",
            "sent2": "The price of the item was 10 rya.",
            "sent3": "I found a lucky rya coin on the street.",
            "sent4": "His savings were a pile of shiny rya coins.",
            "sent5": "The sound of rya coins clinking together was music to his ears."
        },
        {
            "definition": "A type of sailing boat",
            "pos": "noun",
            "sent1": "The rya sailed smoothly across the calm waters.",
            "sent2": "We rented a rya for a relaxing day on the lake.",
            "sent3": "The rya boat had a mind of its own, taking us on unexpected adventures.",
            "sent4": "The rya glided through the waves like a graceful swan.",
            "sent5": "The rya's sails billowed in the wind, carrying us towards the horizon."
        },
        {
            "definition": "A type of knot used in macrame",
            "pos": "noun",
            "sent1": "To create the macrame design, you need to know how to tie a rya knot.",
            "sent2": "The intricate pattern was made using various rya knots.",
            "sent3": "I accidentally tied a rya knot in my shoelaces, making it impossible to untie.",
            "sent4": "The rya knot symbolized the strong bond between the two friends.",
            "sent5": "Her macrame artwork featured a beautiful rya knot at its center."
        }
    ]
}