{
    "term": "ryus",
    "meanings": [
        {
            "definition": "A type of Japanese school of martial arts.",
            "pos": "noun",
            "sent1": "In the ancient village, the ryus taught the young warriors the art of self-defense.",
            "sent2": "The ryus in Japan have a long history of passing down their martial arts techniques.",
            "sent3": "The ryus decided to host a martial arts tournament to showcase their skills.",
            "sent4": "His movements in the fight were as precise and powerful as a ryus master.",
            "sent5": "The ryus dojo was filled with the sound of students practicing their kicks and punches."
        },
        {
            "definition": "The plural form of 'ryu', meaning a school or style of martial arts.",
            "pos": "noun",
            "sent1": "Many different ryus gathered at the martial arts expo to demonstrate their unique techniques.",
            "sent2": "The students were excited to learn about the various ryus of martial arts from around the world.",
            "sent3": "The ryus' uniforms were all different colors, making them look like a rainbow of warriors.",
            "sent4": "She felt like she was part of a special ryus family, united by their love for martial arts.",
            "sent5": "The ryus' banners fluttered in the wind, each representing a different martial arts school."
        },
        {
            "definition": "A surname of Japanese origin.",
            "pos": "noun",
            "sent1": "Mr. Ryus was known for his dedication to preserving the traditions of his ancestors.",
            "sent2": "The Ryus family reunion was a joyful gathering of relatives from near and far.",
            "sent3": "The Ryus siblings always joked about starting their own martial arts school with their surname.",
            "sent4": "The Ryus clan was respected throughout the village for their wisdom and kindness.",
            "sent5": "The Ryus name was synonymous with honor and integrity in their community."
        }
    ]
}