{
    "term": "sack",
    "meanings": [
        {
            "definition": "A large bag made of a strong material such as burlap or canvas, used for storing and carrying goods.",
            "pos": "noun",
            "sent1": "I carried my books in a sack to school.",
            "sent2": "The farmer filled the sack with potatoes from the field.",
            "sent3": "The sack was so big, it looked like it could fit a whole house!",
            "sent4": "Her eyes widened as she saw the sack overflowing with shiny treasures.",
            "sent5": "The sack sagged under the weight of the groceries, threatening to tear."
        },
        {
            "definition": "To dismiss someone from employment.",
            "pos": "verb",
            "sent1": "The boss had to sack the lazy employee.",
            "sent2": "After the incident, the company decided to sack the manager.",
            "sent3": "He joked that he would sack anyone who didn't bring donuts to the meeting.",
            "sent4": "The decision to sack the team captain shocked everyone.",
            "sent5": "She felt terrible having to sack her longtime colleague."
        },
        {
            "definition": "To plunder or loot a place.",
            "pos": "verb",
            "sent1": "The pirates planned to sack the village under the cover of night.",
            "sent2": "The invaders aimed to sack the city and take all its riches.",
            "sent3": "The raccoons seemed to sack the trash cans every night for snacks.",
            "sent4": "The bandits managed to sack the bank without anyone noticing.",
            "sent5": "The Vikings were known to sack many coastal towns in their raids."
        },
        {
            "definition": "A tackle in football where the quarterback is tackled behind the line of scrimmage.",
            "pos": "noun",
            "sent1": "The quarterback was brought down in a sack by the defensive line.",
            "sent2": "The crowd cheered as the sack prevented a touchdown.",
            "sent3": "The sack on the quarterback was so forceful, it shook the stadium.",
            "sent4": "The sack was perfectly timed, disrupting the opponent's play.",
            "sent5": "The announcer shouted, 'That sack just changed the game!'"
        },
        {
            "definition": "A simple loose-fitting dress.",
            "pos": "noun",
            "sent1": "She wore a comfortable sack to the beach.",
            "sent2": "The peasant girl's sack was made of soft linen.",
            "sent3": "The fashion designer created a stylish sack for the runway.",
            "sent4": "The sack fluttered in the breeze as she walked along the meadow.",
            "sent5": "Her grandmother sewed a beautiful sack for her to wear to the picnic."
        }
    ]
}