{
    "term": "sacraria",
    "meanings": [
        {
            "definition": "A place of worship or sacred enclosure.",
            "pos": "noun",
            "sent1": "The small village had a beautiful sacraria where people gathered to pray.",
            "sent2": "The ancient temple ruins were once a grand sacraria for the community.",
            "sent3": "The children played hide-and-seek in the sacraria, pretending it was a magical castle.",
            "sent4": "Her heart felt like a sacraria, filled with love and reverence for all living beings.",
            "sent5": "The sacraria glowed with a peaceful aura, inviting all to find solace within its walls."
        },
        {
            "definition": "A container for sacred relics or objects.",
            "pos": "noun",
            "sent1": "The museum displayed the ancient sacraria holding precious artifacts.",
            "sent2": "The family heirloom was kept safe in a small wooden sacraria.",
            "sent3": "The mischievous cat knocked over the sacraria, spilling its contents on the floor.",
            "sent4": "Her eyes sparkled with tears as she opened the sacraria, revealing cherished memories.",
            "sent5": "The sacraria gleamed with gold and jewels, a testament to the faith of generations past."
        },
        {
            "definition": "The plural form of 'sacrarium', referring to a special basin used for washing sacred vessels in a church.",
            "pos": "noun",
            "sent1": "The sacristan carefully cleaned the sacraria after the church service.",
            "sent2": "The priest blessed the water in the sacraria before washing the sacred vessels.",
            "sent3": "The mischievous child mistook the sacraria for a tiny swimming pool.",
            "sent4": "The sacraria shimmered under the candlelight, a symbol of purity and devotion.",
            "sent5": "The choir sang hymns as the priest approached the sacraria, ready to perform the sacred ritual."
        }
    ]
}