{
    "term": "saddle",
    "meanings": [
        {
            "definition": "A seat for a rider on the back of a horse or other animal.",
            "pos": "noun",
            "sent1": "The cowboy placed the saddle on the horse before riding.",
            "sent2": "She adjusted the saddle on the pony to make sure it was comfortable.",
            "sent3": "The saddle looked like a cozy chair for the horse to sit on.",
            "sent4": "The saddle carried the weight of the rider like a loyal friend.",
            "sent5": "The shiny saddle gleamed in the sunlight, inviting the rider for an adventure."
        },
        {
            "definition": "A piece of leather or other material put on a horse's back for riding.",
            "pos": "noun",
            "sent1": "The old saddle creaked as the horse trotted along the trail.",
            "sent2": "The saddle smelled of leather and hay, reminding her of the stable.",
            "sent3": "The mischievous cat decided to nap on the saddle, thinking it was a bed.",
            "sent4": "The saddle hugged the horse's back snugly, like a warm embrace.",
            "sent5": "The worn-out saddle bore the marks of many journeys, each telling a story."
        },
        {
            "definition": "To put a saddle on a horse or other animal.",
            "pos": "verb",
            "sent1": "He would saddle the horse before every ride to ensure a smooth journey.",
            "sent2": "They saddled up the donkey for the children to take turns riding.",
            "sent3": "The mischievous squirrel tried to saddle a bird, thinking it could fly like a horse.",
            "sent4": "She would saddle her worries and let them ride away with the wind.",
            "sent5": "The cowboy would saddle his horse with care, knowing they were a team on the dusty trail."
        },
        {
            "definition": "To load or burden; encumber.",
            "pos": "verb",
            "sent1": "The heavy workload would saddle him with stress throughout the week.",
            "sent2": "She didn't want to saddle her friend with her problems, so she kept them to herself.",
            "sent3": "The mischievous raccoon tried to saddle its sibling with the blame for the mess.",
            "sent4": "The weight of the past mistakes seemed to saddle him, slowing his progress.",
            "sent5": "The responsibility would saddle her like a heavy backpack, but she was determined to carry it with grace."
        }
    ]
}