{
    "term": "safe",
    "meanings": [
        {
            "definition": "Secure from danger, harm, or risk",
            "pos": "adjective",
            "sent1": "The locked door kept the house safe from intruders.",
            "sent2": "Wearing a helmet while biking is a safe choice.",
            "sent3": "The cat felt safe hiding under the bed during the thunderstorm.",
            "sent4": "Her warm embrace made him feel safe and protected.",
            "sent5": "The lighthouse guided ships to safe harbor during the storm."
        },
        {
            "definition": "Not likely to cause or lead to harm or injury",
            "pos": "adjective",
            "sent1": "The playground equipment is designed to be safe for children to play on.",
            "sent2": "Double-checking the lock on the door ensures a safe home.",
            "sent3": "The bubble wrap made the fragile vase feel extra safe during the move.",
            "sent4": "Her soothing voice made him feel safe and calm.",
            "sent5": "The firefighter's gear kept him safe from the flames."
        },
        {
            "definition": "A container for keeping valuables secure",
            "pos": "noun",
            "sent1": "He placed his jewelry in the safe before going on vacation.",
            "sent2": "The bank vault had a large safe for storing important documents.",
            "sent3": "The safe in the hotel room was too small for all his belongings.",
            "sent4": "The antique safe in the museum displayed intricate craftsmanship.",
            "sent5": "The safe's combination was a mystery waiting to be solved."
        },
        {
            "definition": "A place of refuge or safety",
            "pos": "noun",
            "sent1": "The cave served as a safe for the hikers during the storm.",
            "sent2": "The library became a safe for her to escape the chaos of the city.",
            "sent3": "The treehouse was their secret safe away from prying eyes.",
            "sent4": "The cozy cabin in the woods was their safe from the hustle and bustle.",
            "sent5": "The blanket fort transformed into a safe haven for their imagination."
        }
    ]
}