{
    "term": "sage",
    "meanings": [
        {
            "definition": "A profoundly wise person",
            "pos": "noun",
            "sent1": "The village sage always had good advice for everyone.",
            "sent2": "The ancient sage shared his wisdom with the young generation.",
            "sent3": "The sage's advice was so wise that even the birds listened.",
            "sent4": "Her words were like those of a sage, guiding us through life's challenges.",
            "sent5": "The sage's presence brought a sense of calm and clarity to the room."
        },
        {
            "definition": "An aromatic herb used in cooking",
            "pos": "noun",
            "sent1": "The chef added a pinch of sage to the soup for flavor.",
            "sent2": "The recipe called for fresh sage to enhance the taste of the dish.",
            "sent3": "The sage in the garden smelled so good, it made me hungry.",
            "sent4": "The aroma of sage filled the kitchen, making mouths water.",
            "sent5": "The sage leaves added a fragrant touch to the roasted chicken."
        },
        {
            "definition": "Wise through reflection and experience",
            "pos": "adjective",
            "sent1": "His sage advice helped me make the right decision.",
            "sent2": "The sage old man had a lifetime of stories to share.",
            "sent3": "She had a sage approach to problem-solving, always thinking things through.",
            "sent4": "The sage guidance of the mentor led the young apprentice to success.",
            "sent5": "The sage wisdom of the elder was sought after by all in the village."
        },
        {
            "definition": "Showing profound wisdom",
            "pos": "adjective",
            "sent1": "The sage words of the philosopher resonated with the audience.",
            "sent2": "Her sage advice was valued by all who sought her help.",
            "sent3": "The cat's sage expression seemed to say, 'I know more than you think.'",
            "sent4": "The painting had a sage quality, as if it held secrets of the universe.",
            "sent5": "The sage decision to wait for the right moment paid off in the end."
        }
    ]
}