{
    "term": "saintlike",
    "meanings": [
        {
            "definition": "Resembling or characteristic of a saint.",
            "pos": "adjective",
            "sent1": "Her kind and gentle nature made her seem saintlike to everyone around her.",
            "sent2": "The old man's saintlike behavior towards others earned him the respect of the entire village.",
            "sent3": "Seeing the little girl help the injured bird, the neighbors jokingly called her saintlike for the day.",
            "sent4": "The way he forgave his enemies was truly saintlike, like something out of a storybook.",
            "sent5": "The saintlike aura that surrounded her made people feel at peace in her presence."
        },
        {
            "definition": "Exhibiting qualities associated with a saint.",
            "pos": "adjective",
            "sent1": "The volunteer's selfless actions were saintlike, always putting others before himself.",
            "sent2": "The nun's saintlike dedication to her work inspired those around her to do better.",
            "sent3": "Even in the chaos of the city, his saintlike patience never seemed to waver.",
            "sent4": "Her saintlike compassion towards animals was evident in the way she cared for every stray she found.",
            "sent5": "The soldier's saintlike bravery in the face of danger was admired by all who knew him."
        },
        {
            "definition": "Having the virtues or qualities of a saint.",
            "pos": "adjective",
            "sent1": "The priest's saintlike wisdom guided many through their darkest times.",
            "sent2": "The teacher's saintlike patience with her students was truly remarkable.",
            "sent3": "Despite his mischievous nature, he had a saintlike ability to always do the right thing.",
            "sent4": "Her saintlike forgiveness towards those who wronged her was a lesson in grace.",
            "sent5": "The doctor's saintlike dedication to saving lives was unwavering, even in the face of adversity."
        }
    ]
}