{
    "term": "salient",
    "meanings": [
        {
            "definition": "Most noticeable or important",
            "pos": "adjective",
            "sent1": "The bright red sign was the salient feature of the store.",
            "sent2": "Her salient point in the presentation caught everyone's attention.",
            "sent3": "The giant inflatable banana was a salient addition to the party decorations.",
            "sent4": "The salient mountain peak stood out against the clear blue sky.",
            "sent5": "The loud noise was a salient reminder to wear ear protection."
        },
        {
            "definition": "Prominent or conspicuous",
            "pos": "adjective",
            "sent1": "The salient building in the city skyline was the tallest.",
            "sent2": "His salient tie stood out among the plain ones in the office.",
            "sent3": "The bright pink flamingo was a salient sight in the gray pond.",
            "sent4": "The salient star in the sky shone brighter than the rest.",
            "sent5": "The salient smell of fresh cookies filled the kitchen."
        },
        {
            "definition": "Projecting or jutting out",
            "pos": "adjective",
            "sent1": "The salient rock formation extended out over the cliff.",
            "sent2": "The tree's salient branches reached towards the sky.",
            "sent3": "The salient umbrella handle stuck out from the pile of coats.",
            "sent4": "The salient corner of the table bumped into my knee.",
            "sent5": "The salient edge of the bookshelf was sharp to the touch."
        },
        {
            "definition": "A piece of land or section of fortification that juts out into enemy territory",
            "pos": "noun",
            "sent1": "The soldiers defended the salient against enemy attacks.",
            "sent2": "The castle's salient provided a strategic advantage in battle.",
            "sent3": "The squirrels built their nest in the salient of the tree trunk.",
            "sent4": "The fort's salient was a key point in the defensive line.",
            "sent5": "The island's salient was a challenging target for invaders."
        }
    ]
}