{
    "term": "salpae",
    "meanings": [
        {
            "definition": "A type of marine invertebrate that moves by contracting and pumping water through its gelatinous body.",
            "pos": "noun",
            "sent1": "The salpae gracefully propels itself through the water by contracting its body.",
            "sent2": "Scientists study the salpae to understand how it moves in the ocean.",
            "sent3": "The curious salpae decided to have a race with the jellyfish.",
            "sent4": "The salpae, like a tiny submarine, navigates the ocean depths.",
            "sent5": "Children at the aquarium were amazed by the transparent salpae swimming in the tank."
        },
        {
            "definition": "Plural form of salpa, a type of tunicate that forms long chains in the ocean.",
            "pos": "noun",
            "sent1": "The salpae form a long chain as they drift together in the ocean currents.",
            "sent2": "Divers observed a group of salpae floating in a beautiful chain formation.",
            "sent3": "The beachgoers were surprised to see the salpae spelling out words in the water.",
            "sent4": "The salpae chain resembled a delicate necklace adorning the ocean.",
            "sent5": "The shimmering salpae chain sparkled under the sunlight, creating a mesmerizing sight."
        },
        {
            "definition": "A group of gelatinous marine organisms that are important in the oceanic food chain.",
            "pos": "noun",
            "sent1": "The salpae play a crucial role in the oceanic food chain by providing food for other creatures.",
            "sent2": "Fishermen rely on the abundance of salpae to catch various fish species.",
            "sent3": "The mischievous seals tried to juggle the slippery salpae in the water.",
            "sent4": "The salpae, like tiny jelly snacks, are consumed by many marine animals.",
            "sent5": "The shimmering salpae glowed in the dark, attracting predators in the deep sea."
        }
    ]
}