{
    "term": "salps",
    "meanings": [
        {
            "definition": "A type of marine invertebrate that moves by contracting and pumping water through its gelatinous body.",
            "pos": "noun",
            "sent1": "The salps gracefully swam through the ocean, propelling themselves forward by contracting their bodies.",
            "sent2": "Scientists studied the salps to learn more about their unique way of moving through the water.",
            "sent3": "The curious child imagined riding on the back of a giant salp, zooming through the waves like a jellyfish scooter.",
            "sent4": "In the vast ocean, the salps danced in unison, creating a mesmerizing ballet of gelatinous creatures.",
            "sent5": "The transparent salps shimmered like underwater ghosts as they glided effortlessly through the sea."
        },
        {
            "definition": "A group of salps.",
            "pos": "noun",
            "sent1": "A school of salps drifted together in the current, forming a long chain of connected organisms.",
            "sent2": "The fishermen were amazed by the sheer size of the salps gathering near their boat.",
            "sent3": "The picnic by the beach turned into a salp-watching party as more and more of the creatures washed ashore.",
            "sent4": "The salps clung to each other like a living necklace, creating a beautiful display of unity in nature.",
            "sent5": "The ocean was filled with the rhythmic pulsing of the salps as they moved as one entity through the water."
        },
        {
            "definition": "To move or swim in a manner similar to a salp.",
            "pos": "verb",
            "sent1": "The synchronized swimmers salped gracefully across the pool, mimicking the fluid movements of the marine creatures.",
            "sent2": "The dancer's performance seemed to salp through the stage, captivating the audience with her undulating motions.",
            "sent3": "The children giggled as they tried to salp like jellyfish, waving their arms in a fluid motion.",
            "sent4": "The kite soared and dipped in the wind, appearing to salp through the sky with effortless grace.",
            "sent5": "The gymnast's routine was like watching a human salp, moving with flexibility and precision in every motion."
        }
    ]
}