{
    "term": "salp",
    "meanings": [
        {
            "definition": "A type of marine invertebrate that moves by contracting and pumping water through its gelatinous body.",
            "pos": "noun",
            "sent1": "The salp gracefully propels itself through the ocean by contracting its body.",
            "sent2": "Scientists study the salp to understand how it moves in the water.",
            "sent3": "The salp decided to have a race with the jellyfish to see who could swim faster.",
            "sent4": "The salp, like a tiny submarine, navigates the sea with its unique propulsion system.",
            "sent5": "Children at the aquarium were fascinated by the transparent salp swimming in the tank."
        },
        {
            "definition": "A gelatinous, barrel-shaped marine animal that floats in large groups in open water.",
            "pos": "noun",
            "sent1": "The salp drifted peacefully in the ocean alongside its companions.",
            "sent2": "A school of salps bobbed up and down in the waves.",
            "sent3": "The salp threw a party for all its barrel-shaped friends in the sea.",
            "sent4": "The salp colony resembled a floating village on the surface of the water.",
            "sent5": "Tourists on the boat were amazed by the sight of countless salps floating in the sea."
        },
        {
            "definition": "A transparent, barrel-shaped organism that is a major component of plankton.",
            "pos": "noun",
            "sent1": "The tiny salp played a crucial role in the ecosystem as part of the plankton.",
            "sent2": "Plankton researchers collected samples of salps to study their impact on marine life.",
            "sent3": "The salp, being see-through, often surprised other sea creatures with its appearance.",
            "sent4": "The salp, like a ghostly figure, drifted among the plankton in the water.",
            "sent5": "Under the microscope, the intricate details of the salp's transparent body were revealed."
        }
    ]
}