{
    "term": "salvoing",
    "meanings": [
        {
            "definition": "A simultaneous discharge of firearms or other weapons.",
            "pos": "noun",
            "sent1": "During the battle, the soldiers heard the salvoing of cannons in the distance.",
            "sent2": "The military demonstration ended with a grand salvoing of rifles.",
            "sent3": "The movie scene was so realistic that the audience felt the salvoing of the guns in their seats.",
            "sent4": "The thunderstorm echoed the salvoing of nature's artillery across the sky.",
            "sent5": "The celebration concluded with a magnificent salvoing of fireworks lighting up the night sky."
        },
        {
            "definition": "To fire a salute or volley of shots.",
            "pos": "verb",
            "sent1": "The soldiers will be salvoing their rifles in honor of the fallen heroes.",
            "sent2": "The hunters were salvoing their guns to scare away the birds from the crops.",
            "sent3": "The kids were salvoing water balloons at each other during the summer party.",
            "sent4": "The fireworks display seemed to be salvoing colors into the dark sky.",
            "sent5": "The orchestra conductor raised his baton, ready to start salvoing music into the concert hall."
        },
        {
            "definition": "To give a sudden burst of energy or activity.",
            "pos": "verb",
            "sent1": "After the break, the team started salvoing their efforts to catch up in the game.",
            "sent2": "The teacher's motivational speech salvoed the students into action for the school project.",
            "sent3": "The alarm clock's loud ring salvoed me out of bed in the morning.",
            "sent4": "The news of the surprise party salvoed excitement into her otherwise dull day.",
            "sent5": "The energetic music at the concert salvoed the crowd into a dancing frenzy."
        }
    ]
}