{
    "term": "saman",
    "meanings": [
        {
            "definition": "A type of hardwood tree found in tropical regions.",
            "pos": "noun",
            "sent1": "The saman tree provides shade with its wide branches.",
            "sent2": "The villagers gathered under the saman tree for their meeting.",
            "sent3": "The monkeys played hide-and-seek around the saman tree.",
            "sent4": "The saman tree stood tall like a guardian of the forest.",
            "sent5": "The saman tree's leaves rustled in the gentle breeze."
        },
        {
            "definition": "A traditional Javanese dance.",
            "pos": "noun",
            "sent1": "The dancers gracefully performed the saman at the festival.",
            "sent2": "The audience clapped along to the rhythmic beats of the saman.",
            "sent3": "The children giggled as they tried to imitate the saman movements.",
            "sent4": "The saman dance told a story of love and loss through its motions.",
            "sent5": "The colorful costumes added vibrancy to the traditional saman performance."
        },
        {
            "definition": "A type of Indian musical instrument.",
            "pos": "noun",
            "sent1": "The musician skillfully played the saman during the concert.",
            "sent2": "The sweet melody of the saman filled the room with joy.",
            "sent3": "The cat seemed intrigued by the sound of the saman coming from the house.",
            "sent4": "The saman's notes danced in the air, enchanting all who listened.",
            "sent5": "The musician's fingers moved swiftly over the strings of the saman."
        },
        {
            "definition": "A type of traditional Indian fabric.",
            "pos": "noun",
            "sent1": "She wore a beautiful sari made of saman to the wedding.",
            "sent2": "The intricate patterns on the saman fabric caught everyone's eye.",
            "sent3": "The tailor carefully measured the saman to create a custom outfit.",
            "sent4": "The soft texture of the saman fabric was a delight to touch.",
            "sent5": "The vibrant colors of the saman fabric brightened up the room."
        }
    ]
}