{
    "term": "sanctions",
    "meanings": [
        {
            "definition": "A threatened penalty for disobeying a law or rule.",
            "pos": "noun",
            "sent1": "The teacher imposed sanctions on the student for breaking the classroom rules.",
            "sent2": "The government imposed sanctions on the company for violating environmental regulations.",
            "sent3": "The mischievous cat faced sanctions for climbing onto the forbidden table.",
            "sent4": "The looming sanctions hung over the team, warning them of the consequences of cheating.",
            "sent5": "The strict sanctions made sure everyone followed the traffic laws."
        },
        {
            "definition": "Official permission or approval for an action.",
            "pos": "noun",
            "sent1": "The manager granted sanctions for the project to proceed as planned.",
            "sent2": "The city council provided sanctions for the event to take place in the park.",
            "sent3": "The playful puppy eagerly awaited sanctions to play in the garden.",
            "sent4": "The golden seal of sanctions shone brightly, allowing the expedition to begin.",
            "sent5": "The official sanctions stamped on the document indicated full authorization."
        },
        {
            "definition": "A coercive measure taken against a country that violates international law.",
            "pos": "noun",
            "sent1": "The United Nations imposed sanctions on the rogue nation for its aggressive actions.",
            "sent2": "The alliance decided to enforce sanctions on the country for its illegal trade practices.",
            "sent3": "The rebellious nation faced sanctions from the global community for its defiance.",
            "sent4": "The weight of the international sanctions pressed down on the country, urging compliance.",
            "sent5": "The powerful sanctions acted as a global warning against unlawful behavior."
        }
    ]
}