{
    "term": "sanctuaries",
    "meanings": [
        {
            "definition": "A place of refuge or safety.",
            "pos": "noun",
            "sent1": "The animal shelter provided sanctuaries for the lost pets.",
            "sent2": "During the storm, the basement served as sanctuaries for the frightened family.",
            "sent3": "The cozy blanket fort became a sanctuary for the kids during the game of hide-and-seek.",
            "sent4": "In her books, the library was always portrayed as a sanctuary of knowledge and peace.",
            "sent5": "The lighthouse stood tall, offering a guiding sanctuary to the ships lost at sea."
        },
        {
            "definition": "A holy place.",
            "pos": "noun",
            "sent1": "The ancient temple was considered one of the most sacred sanctuaries in the land.",
            "sent2": "The church was a place of worship and reflection, a sanctuary for the community.",
            "sent3": "The old oak tree was believed to be a sanctuary where wishes made at midnight would come true.",
            "sent4": "Her grandmother's garden was a sanctuary of memories, each flower holding a special moment.",
            "sent5": "The monastery atop the mountain was a sanctuary of peace and prayer, far from the chaos of the city."
        },
        {
            "definition": "A nature reserve.",
            "pos": "noun",
            "sent1": "The national park was established as one of the first wildlife sanctuaries in the country.",
            "sent2": "Visitors marveled at the beauty of the bird sanctuaries along the coast.",
            "sent3": "The forest became a sanctuary for the rare species of butterflies, protected from harm.",
            "sent4": "The wetlands served as a sanctuary for migratory birds, offering a safe haven during their journey.",
            "sent5": "The botanical garden was a sanctuary of tranquility, where nature's wonders could be admired."
        }
    ]
}