{
    "term": "sanctum",
    "meanings": [
        {
            "definition": "A sacred or holy place",
            "pos": "noun",
            "sent1": "The small chapel in the woods was considered a sanctum by the villagers.",
            "sent2": "The temple was a sanctum where people went to pray and find peace.",
            "sent3": "The children pretended the old treehouse was a sanctum where only the bravest could enter.",
            "sent4": "To her, the library was a sanctum of knowledge, a place where she could lose herself in books.",
            "sent5": "The ancient ruins held a sanctum of secrets waiting to be discovered by archaeologists."
        },
        {
            "definition": "A private or secluded place",
            "pos": "noun",
            "sent1": "The hidden garden behind the house was his sanctum, where he could relax away from the world.",
            "sent2": "She cherished her bedroom as her sanctum, a place where she could be alone and unwind.",
            "sent3": "The attic became a sanctum for the siblings to hide their secret treasures.",
            "sent4": "The cave deep in the forest was a sanctum for the rare species of bats that lived there.",
            "sent5": "The artist's studio was his sanctum, where he could create without any distractions."
        },
        {
            "definition": "A place where one is free from intrusion or disturbance",
            "pos": "noun",
            "sent1": "The soundproof room provided a sanctum for the musician to practice without interruptions.",
            "sent2": "The cozy nook by the window was her sanctum, a spot where she could read in peace.",
            "sent3": "The hammock hidden in the backyard was his sanctum, swinging gently under the shade.",
            "sent4": "The mountaintop offered a sanctum from the chaos of the city below, a peaceful retreat.",
            "sent5": "The blanket fort in the living room became their sanctum, a fortress of imagination and fun."
        }
    ]
}