{
    "term": "sancta",
    "meanings": [
        {
            "definition": "Holy or sacred",
            "pos": "adjective",
            "sent1": "The ancient temple was a sancta place for the villagers.",
            "sent2": "The sancta book was treated with utmost respect.",
            "sent3": "The sancta tree seemed to glow in the moonlight.",
            "sent4": "Her smile had a sancta quality that lit up the room.",
            "sent5": "The sancta mountain stood tall and majestic against the sky."
        },
        {
            "definition": "A place of worship or religious significance",
            "pos": "noun",
            "sent1": "The small village had a sancta where people gathered to pray.",
            "sent2": "The sancta was adorned with beautiful stained glass windows.",
            "sent3": "The sancta echoed with the sound of hymns and prayers.",
            "sent4": "The sancta was a peaceful refuge from the chaos of the city.",
            "sent5": "Visiting the sancta always brought her a sense of calm and peace."
        },
        {
            "definition": "A religious ceremony or ritual",
            "pos": "noun",
            "sent1": "The sancta included a traditional ceremony to honor the ancestors.",
            "sent2": "The sancta ritual involved chanting and incense.",
            "sent3": "During the sancta, everyone wore special robes.",
            "sent4": "The sancta ceremony was a solemn and sacred event.",
            "sent5": "The sancta ritual was performed with great reverence and devotion."
        },
        {
            "definition": "A person or object considered to be holy or sacred",
            "pos": "noun",
            "sent1": "The ancient relic was believed to be a sancta by the villagers.",
            "sent2": "The sancta was carefully preserved in a glass case.",
            "sent3": "The sancta was said to bring blessings to those who touched it.",
            "sent4": "The sancta was passed down through generations as a symbol of faith.",
            "sent5": "The sancta was the most treasured possession of the family."
        }
    ]
}