{
    "term": "sanction",
    "meanings": [
        {
            "definition": "Give official permission or approval for (an action)",
            "pos": "verb",
            "sent1": "The teacher will sanction the field trip for the students.",
            "sent2": "The city council will sanction the new construction project.",
            "sent3": "The principal decided to sanction an extra recess for the students.",
            "sent4": "The referee will sanction any player who breaks the rules.",
            "sent5": "The king will only sanction the marriage if both families agree."
        },
        {
            "definition": "A threatened penalty for disobeying a law or rule",
            "pos": "noun",
            "sent1": "The school has a sanction for students who cheat on exams.",
            "sent2": "The company faces a sanction for violating environmental regulations.",
            "sent3": "The mischievous student joked about receiving a sanction for being late.",
            "sent4": "The warning letter served as a sanction for the employee's behavior.",
            "sent5": "The fine was a heavy sanction for parking in the disabled spot."
        },
        {
            "definition": "A formal decree or law",
            "pos": "noun",
            "sent1": "The king's sanction was respected by all in the kingdom.",
            "sent2": "The government passed a sanction to protect endangered species.",
            "sent3": "The old law book contained a strange sanction about wearing hats indoors.",
            "sent4": "The ancient scroll revealed a powerful sanction against thieves.",
            "sent5": "The council's sanction was written in bold letters for all to see."
        },
        {
            "definition": "A coercive measure adopted against a country or individual to enforce international law.",
            "pos": "noun",
            "sent1": "The United Nations imposed a sanction on the country for human rights violations.",
            "sent2": "The trade sanction affected the country's economy significantly.",
            "sent3": "The diplomatic sanction was a last resort to prevent war.",
            "sent4": "The international community agreed on a sanction to stop the conflict.",
            "sent5": "The strict sanction was necessary to maintain peace and order."
        }
    ]
}