{
    "term": "sandbaggers",
    "meanings": [
        {
            "definition": "A person who engages in sandbagging.",
            "pos": "noun",
            "sent1": "The sandbaggers worked together to protect the town from flooding.",
            "sent2": "The sandbaggers were praised for their quick response during the storm.",
            "sent3": "The sandbaggers joked that they were like human beavers, building dams to hold back the water.",
            "sent4": "The sandbaggers were like silent guardians, always ready to defend against the rising waters.",
            "sent5": "The image of the sandbaggers tirelessly filling bags will forever be etched in my mind."
        },
        {
            "definition": "To act as a sandbagger.",
            "pos": "verb",
            "sent1": "She sandbaggers by strategically holding back her true abilities until the competition.",
            "sent2": "He sandbaggers by pretending to be a novice, then surprising everyone with his skill.",
            "sent3": "The cat sandbaggers by pretending to be asleep, then pouncing on the unsuspecting toy.",
            "sent4": "The clouds sandbaggers by hiding the sun, only to reveal a stunning sunset later.",
            "sent5": "The magician sandbaggers by distracting the audience, then performing an incredible trick."
        },
        {
            "definition": "The act of sandbagging.",
            "pos": "noun",
            "sent1": "The sandbaggers was necessary to prevent the river from overflowing.",
            "sent2": "After the heavy rain, the sandbaggers became a common sight along the riverbanks.",
            "sent3": "The sandbaggers at the beach competition made sure no one could build a higher sandcastle.",
            "sent4": "The sandbaggers of the team helped secure their victory by slowing down the opponents.",
            "sent5": "The sound of the sandbaggers being stacked echoed through the neighborhood as the storm approached."
        }
    ]
}