{
    "term": "sandbag",
    "meanings": [
        {
            "definition": "A bag filled with sand used for protection or as a weight.",
            "pos": "noun",
            "sent1": "During the flood, the workers placed sandbags along the riverbank to prevent water from entering the town.",
            "sent2": "The construction workers carried heavy sandbags to the building site to use as weights for holding down materials.",
            "sent3": "The mischievous kids decided to have a sandbag race, hopping inside the bags and waddling to the finish line.",
            "sent4": "Her heart felt like a sandbag, heavy and burdened with sorrow.",
            "sent5": "The sandbag, with its rough texture and weight, served as a barrier against the rushing water."
        },
        {
            "definition": "To deliberately underperform in a competition or negotiation.",
            "pos": "verb",
            "sent1": "He tried to sandbag his opponent by pretending to be tired, hoping they would underestimate his abilities.",
            "sent2": "The team decided to sandbag the first round of the tournament to lower expectations from their rivals.",
            "sent3": "The comedian decided to sandbag his performance by telling terrible jokes on purpose, much to the audience's confusion.",
            "sent4": "She didn't want to shine too brightly, so she chose to sandbag her presentation, keeping her best ideas hidden.",
            "sent5": "The boxer decided to sandbag the match, making it seem like he was weaker than he actually was."
        },
        {
            "definition": "To fortify or protect with sandbags.",
            "pos": "verb",
            "sent1": "The soldiers worked quickly to sandbag the perimeter of the camp, preparing for the incoming storm.",
            "sent2": "The residents decided to sandbag their homes as the hurricane approached, hoping to minimize damage.",
            "sent3": "The squirrel cleverly used a small sandbag to fortify its nest against the strong winds.",
            "sent4": "She felt the need to sandbag her emotions, building a protective barrier around her heart.",
            "sent5": "The gardener used sandbags to fortify the edges of the flower bed, keeping the soil in place during heavy rains."
        }
    ]
}