{
    "term": "sandman",
    "meanings": [
        {
            "definition": "A mythical character who is said to sprinkle sand in children's eyes to help them sleep.",
            "pos": "noun",
            "sent1": "Every night, the sandman visits children and helps them drift off to dreamland.",
            "sent2": "The sandman is a beloved figure in many bedtime stories.",
            "sent3": "The sandman must have been extra busy last night, as all the kids fell asleep instantly.",
            "sent4": "As the sun sets, the sandman begins his nightly journey, spreading sleep-inducing sand.",
            "sent5": "The sandman's magical sand creates the most peaceful slumber for children."
        },
        {
            "definition": "A person who puts children to bed or helps them fall asleep.",
            "pos": "noun",
            "sent1": "My grandmother is like a real-life sandman, singing lullabies to help me sleep.",
            "sent2": "The babysitter acted as a sandman, tucking the children in and reading bedtime stories.",
            "sent3": "The sandman at the daycare has a special talent for calming down even the most energetic kids.",
            "sent4": "The sandman's soothing presence made bedtime a breeze for the tired children.",
            "sent5": "The sandman's gentle touch and kind words eased the children into a peaceful slumber."
        },
        {
            "definition": "A person who works with sand, such as a sculptor or builder.",
            "pos": "noun",
            "sent1": "The sandman at the beach creates amazing sandcastles that mesmerize onlookers.",
            "sent2": "The talented sandman sculpted a beautiful mermaid out of sand.",
            "sent3": "The sandman's sand art always attracts a crowd of curious spectators.",
            "sent4": "Watching the sandman build intricate structures from sand is truly inspiring.",
            "sent5": "The sandman's creations with sand are nothing short of breathtaking."
        }
    ]
}