{
    "term": "sango",
    "meanings": [
        {
            "definition": "A type of red clay used for pottery.",
            "pos": "noun",
            "sent1": "The artist molded the vase from sango.",
            "sent2": "The potter shaped the bowl using sango.",
            "sent3": "The children pretended the sango was magical clay.",
            "sent4": "Her hands felt the warmth of sango as she sculpted.",
            "sent5": "The earthy scent of sango filled the studio."
        },
        {
            "definition": "A language spoken in the Central African Republic.",
            "pos": "noun",
            "sent1": "Learning sango can help you communicate with locals.",
            "sent2": "She practiced speaking sango with her tutor.",
            "sent3": "The tourists tried to mimic the sounds of sango for fun.",
            "sent4": "In the market, the vibrant sounds of sango surrounded her.",
            "sent5": "The melody of sango songs echoed through the village."
        },
        {
            "definition": "A type of Japanese coral tree.",
            "pos": "noun",
            "sent1": "The garden featured a beautiful sango with pink blossoms.",
            "sent2": "The sango tree stood out with its unique coral-like branches.",
            "sent3": "The birds loved to perch on the sango branches.",
            "sent4": "Under the sango's shade, she found solace.",
            "sent5": "The delicate petals of the sango danced in the breeze."
        },
        {
            "definition": "A type of fish found in the Pacific Ocean.",
            "pos": "noun",
            "sent1": "The chef prepared a delicious dish using fresh sango.",
            "sent2": "The aquarium showcased a variety of colorful sango.",
            "sent3": "The children giggled at the playful sango swimming in the tank.",
            "sent4": "The shimmering scales of the sango caught the sunlight.",
            "sent5": "The fishermen returned with a bountiful catch of sango."
        }
    ]
}