{
    "term": "sang",
    "meanings": [
        {
            "definition": "past tense of sing",
            "pos": "verb",
            "sent1": "Yesterday, she sang a beautiful song at the talent show.",
            "sent2": "The birds sang sweetly in the morning.",
            "sent3": "The cat sang along with the music, surprising everyone.",
            "sent4": "Her voice sang like a bird in the quiet forest.",
            "sent5": "The wind sang through the trees, creating a peaceful melody."
        },
        {
            "definition": "a deep red color",
            "pos": "adjective",
            "sent1": "She wore a stunning dress in a vibrant sang color.",
            "sent2": "The sunset painted the sky in shades of sang and orange.",
            "sent3": "The ripe strawberries had a deep sang hue that made them irresistible.",
            "sent4": "The old barn was painted in a sang shade that stood out in the green fields.",
            "sent5": "The roses in the garden bloomed in a rich sang tone, catching everyone's eye."
        },
        {
            "definition": "a traditional Korean drink made from rice or other grains",
            "pos": "noun",
            "sent1": "After dinner, they enjoyed a refreshing glass of sang together.",
            "sent2": "The restaurant served a variety of traditional Korean dishes, including sang.",
            "sent3": "She tried making her own batch of sang but found it challenging.",
            "sent4": "The elders shared stories over a warm cup of homemade sang.",
            "sent5": "The festival featured a booth where visitors could taste different types of sang."
        },
        {
            "definition": "a song or piece of music",
            "pos": "noun",
            "sent1": "The radio played a catchy sang that everyone recognized.",
            "sent2": "She hummed a familiar sang while walking down the street.",
            "sent3": "The children danced happily to the upbeat sang playing in the park.",
            "sent4": "The classical sang filled the concert hall with emotion and beauty.",
            "sent5": "His favorite sang always brought back memories of his childhood."
        }
    ]
}