{
    "term": "sanicles",
    "meanings": [
        {
            "definition": "A small cluster of flowers or leaves",
            "pos": "noun",
            "sent1": "In the garden, I spotted tiny sanicles of colorful flowers blooming together.",
            "sent2": "The forest floor was covered with various sanicles of leaves, creating a beautiful mosaic.",
            "sent3": "The mischievous squirrel used the sanicles of flowers to decorate its nest in a whimsical way.",
            "sent4": "Her laughter filled the room like a joyful sanicle of flowers spreading happiness.",
            "sent5": "The delicate sanicles of leaves danced in the gentle breeze, a sight to behold."
        },
        {
            "definition": "A small, rounded stone or pebble",
            "pos": "noun",
            "sent1": "As I walked along the beach, I collected smooth sanicles of colorful stones.",
            "sent2": "The children skipped the sanicles of pebbles across the calm lake, giggling with delight.",
            "sent3": "The mischievous raccoon played with the sanicles of stones, rolling them around in a playful manner.",
            "sent4": "The old well was surrounded by sanicles of stones, each holding a wish whispered by visitors.",
            "sent5": "The sanicles of pebbles crunched underfoot as we hiked along the rocky path."
        },
        {
            "definition": "A small, rounded mass or lump",
            "pos": "noun",
            "sent1": "She found a hidden treasure trove of shiny sanicles of gold in the old chest.",
            "sent2": "The baker kneaded the dough until it formed soft sanicles of bread ready for baking.",
            "sent3": "The playful puppy chased after the sanicles of crumbs that fell from the table.",
            "sent4": "The artist molded the clay into intricate sanicles of sculptures, each telling a unique story.",
            "sent5": "The warm soup was filled with savory sanicles of vegetables, making it a comforting meal."
        }
    ]
}