{
    "term": "sanitary",
    "meanings": [
        {
            "definition": "Of or relating to health or the conditions affecting health, especially with regard to cleanliness.",
            "pos": "adjective",
            "sent1": "The hospital room was kept sanitary to prevent infections.",
            "sent2": "It is important to keep the kitchen sanitary to avoid food poisoning.",
            "sent3": "The cat tried to keep its fur sanitary by grooming itself constantly.",
            "sent4": "Her mind was a sanctuary, always striving to maintain a sanitary environment.",
            "sent5": "The sanitary conditions of the swimming pool were impeccable, inviting everyone to take a dip."
        },
        {
            "definition": "Free from elements that endanger health; clean.",
            "pos": "adjective",
            "sent1": "The restaurant's kitchen was so sanitary that you could eat off the floor.",
            "sent2": "The hotel room was spotless and sanitary, making the guests feel comfortable.",
            "sent3": "The children's playroom was a disaster zone, the opposite of sanitary.",
            "sent4": "Her heart felt light and airy, as if it had been scrubbed clean and made sanitary.",
            "sent5": "The surgical tools gleamed under the lights, their surfaces perfectly sanitary for the operation ahead."
        },
        {
            "definition": "Used in or for sanitation.",
            "pos": "adjective",
            "sent1": "The sanitary wipes were essential for keeping the surfaces germ-free.",
            "sent2": "The janitor's cart was stocked with all the necessary sanitary supplies.",
            "sent3": "The superhero's secret weapon was a spray bottle of sanitary solution.",
            "sent4": "The city invested in new sanitary systems to improve public health.",
            "sent5": "The laboratory had strict rules about using only sanitary equipment to avoid contamination."
        }
    ]
}