{
    "term": "sanitariums",
    "meanings": [
        {
            "definition": "An establishment for the medical treatment of people who are convalescing or have a chronic illness.",
            "pos": "noun",
            "sent1": "The small town had a sanitariums where patients could recover from their illnesses.",
            "sent2": "My grandmother stayed at the sanitariums to get better after her surgery.",
            "sent3": "The sanitariums was so peaceful that some patients joked about never wanting to leave.",
            "sent4": "The sanitariums became a safe harbor for those seeking solace from their ailments.",
            "sent5": "The white walls of the sanitariums seemed to promise healing to all who entered."
        },
        {
            "definition": "A facility for the care and treatment of individuals with mental health disorders.",
            "pos": "noun",
            "sent1": "The city built a new sanitariums to provide better care for those with mental health issues.",
            "sent2": "The sanitariums had specialized programs to help patients manage their mental health conditions.",
            "sent3": "Some movies portray sanitariums as spooky places, but in reality, they are centers of healing.",
            "sent4": "Her mind felt like a chaotic sanitariums, with thoughts running wild and unchecked.",
            "sent5": "The sanitariums offered a sanctuary for those struggling with their inner demons."
        },
        {
            "definition": "A place for the treatment of tuberculosis patients.",
            "pos": "noun",
            "sent1": "In the early 1900s, many sanitariums were established to treat tuberculosis.",
            "sent2": "Doctors recommended that the patient be admitted to a sanitariums for specialized care.",
            "sent3": "The old sanitariums had a vintage charm that made it feel like a time capsule.",
            "sent4": "The fight against tuberculosis was waged in the quiet halls of the sanitariums.",
            "sent5": "The fresh mountain air surrounding the sanitariums was believed to aid in the patients' recovery."
        }
    ]
}