{
    "term": "sansculottic",
    "meanings": [
        {
            "definition": "Of or relating to the sansculottes, a radical group of French revolutionaries.",
            "pos": "adjective",
            "sent1": "The sansculottic attire of the revolutionaries was simple and practical.",
            "sent2": "Her sansculottic beliefs aligned with the principles of equality and liberty.",
            "sent3": "The sansculottic fashion statement at the party turned heads.",
            "sent4": "His sansculottic approach to problem-solving was refreshing in a world of complexity.",
            "sent5": "The sansculottic flag waved proudly in the wind, symbolizing freedom and unity."
        },
        {
            "definition": "Characteristic of the sansculottes, especially in terms of their revolutionary ideals.",
            "pos": "adjective",
            "sent1": "The painting captured the sansculottic spirit of rebellion and defiance.",
            "sent2": "The speech was filled with sansculottic fervor, inspiring the crowd to action.",
            "sent3": "The sansculottic graffiti on the wall added a touch of rebellion to the neighborhood.",
            "sent4": "Her eyes sparkled with a sansculottic determination to challenge the status quo.",
            "sent5": "The music echoed with a sansculottic energy that ignited the audience."
        },
        {
            "definition": "A person who supports or embodies the principles of the sansculottes.",
            "pos": "noun",
            "sent1": "She was known in the community as a true sansculottic, always fighting for justice.",
            "sent2": "The crowd cheered for the sansculottic as he spoke passionately about equality.",
            "sent3": "The little girl dressed up as a sansculottic for the school play, waving a tiny flag.",
            "sent4": "The artist portrayed the sansculottic with a fierce expression, ready for revolution.",
            "sent5": "In the history books, the sansculottic was remembered as a hero of the people."
        }
    ]
}