{
    "term": "santours",
    "meanings": [
        {
            "definition": "A musical instrument with strings that are struck with hammers.",
            "pos": "noun",
            "sent1": "The santours produced beautiful sounds when the hammers hit its strings.",
            "sent2": "She learned to play the santours at a young age.",
            "sent3": "During the concert, the santours decided to play a prank by playing a wrong note.",
            "sent4": "The santours' strings danced under the hammers like raindrops on a window.",
            "sent5": "The music from the santours echoed through the room, enchanting everyone.",
            "sent6": "With skillful hands, the musician played the santours with precision.",
            "sent7": "The santours' strings resonated with a melodic charm as the hammers struck them.",
            "sent8": "In the music store, the santours gleamed under the bright lights, inviting customers to try it out."
        },
        {
            "definition": "The act of playing music on a santours.",
            "pos": "noun",
            "sent1": "His santours playing captivated the audience with its soothing melodies.",
            "sent2": "The santours playing at the event added a touch of elegance to the atmosphere.",
            "sent3": "During the music competition, the santours playing unexpectedly turned into a lively dance.",
            "sent4": "Her santours playing was like painting a picture with musical notes.",
            "sent5": "The gentle santours playing filled the room with a sense of calm and peace.",
            "sent6": "With each note, the santours playing transported the listeners to a different world.",
            "sent7": "The santours playing echoed through the hall, leaving a lasting impression on everyone.",
            "sent8": "In the park, the santours playing blended harmoniously with the sounds of nature."
        },
        {
            "definition": "A person who plays the santours professionally.",
            "pos": "noun",
            "sent1": "The santours expert mesmerized the audience with his skillful performance.",
            "sent2": "She aspired to become a santours professional and travel the world with her music.",
            "sent3": "The santours professional surprised everyone by playing a modern pop song on the traditional instrument.",
            "sent4": "His fingers moved swiftly over the santours, showcasing his expertise as a professional musician.",
            "sent5": "The santours professional's dedication to music shone through every performance.",
            "sent6": "As a santours professional, she spent hours practicing to perfect her craft.",
            "sent7": "The santours professional's passion for music was evident in every note played.",
            "sent8": "In the concert hall, the santours professional's talent left the audience in awe."
        }
    ]
}