{
    "term": "santonins",
    "meanings": [
        {
            "definition": "A crystalline compound obtained from certain species of wormwood, used as a vermifuge.",
            "pos": "noun",
            "sent1": "The doctor prescribed santonins to help get rid of the worms in my stomach.",
            "sent2": "The santonins were effective in expelling the parasites from the patient's body.",
            "sent3": "After taking the santonins, the worms in my stomach decided to pack their bags and leave.",
            "sent4": "The santonins worked like a tiny army, marching through the body to battle the worms.",
            "sent5": "The crystalline santonins sparkled like tiny warriors fighting off the invaders."
        },
        {
            "definition": "A substance derived from santonica, used in medicine as a purgative.",
            "pos": "noun",
            "sent1": "The nurse administered santonins to help cleanse the patient's system.",
            "sent2": "The purgative effect of santonins helped relieve the patient's discomfort.",
            "sent3": "After taking the santonins, the patient felt like a river flowing freely.",
            "sent4": "The santonins acted like a gentle breeze, clearing out the toxins from the body.",
            "sent5": "The medicine worked like magic, with the santonins leading the way to purification."
        },
        {
            "definition": "A type of medication used to expel parasitic worms from the body.",
            "pos": "noun",
            "sent1": "The pharmacist recommended santonins to eliminate the worms causing the infection.",
            "sent2": "The santonins effectively removed the parasitic worms from the patient's body.",
            "sent3": "After taking the santonins, the worms felt like unwelcome guests being escorted out.",
            "sent4": "The santonins acted as a guardian, protecting the body from the invading parasites.",
            "sent5": "The medication worked wonders, with the santonins leading the charge against the worms."
        }
    ]
}