{
    "term": "sarcoidosis",
    "meanings": [
        {
            "definition": "A disease characterized by the growth of tiny collections of inflammatory cells in different parts of the body.",
            "pos": "noun",
            "sent1": "Sarcoidosis can cause small lumps of cells to form in the body.",
            "sent2": "The doctor diagnosed her with sarcoidosis after finding tiny inflammatory collections in her lungs.",
            "sent3": "When the tiny inflammatory cells throw a party in the body, it's called sarcoidosis.",
            "sent4": "Her body was like a garden where sarcoidosis grew tiny inflammatory flowers.",
            "sent5": "The growth of inflammatory cells in sarcoidosis is like a small army invading the body."
        },
        {
            "definition": "An inflammatory disease that can affect multiple organs in the body.",
            "pos": "noun",
            "sent1": "Sarcoidosis is a disease that can harm many organs in the body.",
            "sent2": "The inflammation caused by sarcoidosis can spread to different parts of the body.",
            "sent3": "When sarcoidosis decides to visit multiple organs, it throws a party in each one.",
            "sent4": "Her body felt like a battleground where sarcoidosis fought in different organs.",
            "sent5": "The impact of sarcoidosis on multiple organs is like a storm wreaking havoc inside the body."
        },
        {
            "definition": "A condition in which small lumps, known as granulomas, form in various organs.",
            "pos": "noun",
            "sent1": "Granulomas are the small lumps that develop in sarcoidosis within organs.",
            "sent2": "The formation of granulomas is a key feature of sarcoidosis affecting different organs.",
            "sent3": "When granulomas decide to party in various organs, it's called sarcoidosis.",
            "sent4": "Her organs were like a puzzle with granulomas as the missing pieces in sarcoidosis.",
            "sent5": "The presence of granulomas in sarcoidosis is like tiny marbles rolling around in different organs."
        }
    ]
}