{
    "term": "sarmenta",
    "meanings": [
        {
            "definition": "A vine shoot or runner",
            "pos": "noun",
            "sent1": "The gardener carefully trimmed the sarmenta to encourage new growth.",
            "sent2": "The grapevine sent out a sarmenta, reaching towards the sunlight.",
            "sent3": "The mischievous squirrel used the sarmenta as a swing, much to the gardener's dismay.",
            "sent4": "Her ideas spread like a sarmenta, connecting different aspects of the project.",
            "sent5": "The sarmenta's delicate tendrils wrapped around the trellis, seeking support."
        },
        {
            "definition": "A type of Roman dish made with vegetables and herbs",
            "pos": "noun",
            "sent1": "The chef prepared a delicious sarmenta for the feast, using fresh ingredients.",
            "sent2": "The aroma of the savory sarmenta filled the kitchen, making everyone hungry.",
            "sent3": "The children giggled as they pretended to serve each other imaginary sarmenta at their play tea party.",
            "sent4": "The flavors in the sarmenta danced on her taste buds, reminding her of Italy.",
            "sent5": "The colorful sarmenta looked like a painting on the plate, almost too beautiful to eat."
        },
        {
            "definition": "A type of plant used for medicinal purposes",
            "pos": "noun",
            "sent1": "The herbalist collected sarmenta from the forest to create healing potions.",
            "sent2": "The villagers relied on the sarmenta plant for its healing properties during illnesses.",
            "sent3": "The wise woman brewed a special tea with sarmenta to cure the common cold.",
            "sent4": "In her dreams, the sarmenta glowed with a healing light, bringing comfort to the dreamer.",
            "sent5": "The aroma of the crushed sarmenta leaves filled the room, promising relief from pain."
        }
    ]
}