{
    "term": "sassies",
    "meanings": [
        {
            "definition": "Sassy - impudent or disrespectful in speech or behavior",
            "pos": "adjective",
            "sent1": "The girl gave a sassies response to her teacher, which got her in trouble.",
            "sent2": "She always wears the sassies outfits to school, standing out from the rest.",
            "sent3": "When the cat knocked over the vase, it gave a sassies look as if it was proud of the mess.",
            "sent4": "The rebellious teenager's sassies attitude towards authority figures often caused conflicts.",
            "sent5": "The sassies child refused to listen to any rules, always speaking out of turn."
        },
        {
            "definition": "Sassy - stylish or fashionable in an unconventional way",
            "pos": "adjective",
            "sent1": "Her unique and sassies sense of fashion always turned heads wherever she went.",
            "sent2": "The boutique showcased the sassies clothing items that were unlike anything seen before.",
            "sent3": "The artist's painting was so sassies that it sparked a new trend in the art world.",
            "sent4": "The singer's music video featured a sassies dance routine that became viral overnight.",
            "sent5": "The fashion show displayed the sassies designs that pushed the boundaries of traditional style."
        },
        {
            "definition": "Sassy - to talk back or be cheeky in response to someone",
            "pos": "verb",
            "sent1": "The child sassies at his parents whenever they ask him to do chores.",
            "sent2": "She sassies at her boss whenever he gives her feedback on her work.",
            "sent3": "During the argument, he couldn't help but sassies at his friend's ridiculous statement.",
            "sent4": "The comedian loves to sassies at the audience, making everyone burst into laughter.",
            "sent5": "When feeling challenged, she tends to sassies at anyone who questions her decisions."
        }
    ]
}