{
    "term": "sasswood",
    "meanings": [
        {
            "definition": "A West African tree, Erythrophleum suaveolens, known for its poisonous sap.",
            "pos": "noun",
            "sent1": "The villagers warned the children to stay away from the sasswood tree.",
            "sent2": "Hunters used the strong wood of the sasswood tree to craft their deadly arrows.",
            "sent3": "The mischievous monkey thought about pranking the other animals by painting himself with sasswood sap.",
            "sent4": "The poison in her words seeped through like the sap of a sasswood tree.",
            "sent5": "The eerie glow of the moonlight on the sasswood leaves made the forest seem enchanted."
        },
        {
            "definition": "The wood of this tree, used for making poison arrows.",
            "pos": "noun",
            "sent1": "Craftsmen carefully carved the sasswood into lethal arrowheads.",
            "sent2": "Legends spoke of warriors who never missed their target with sasswood arrows.",
            "sent3": "The mischievous monkey tried to fashion a tiny sasswood bow for fun.",
            "sent4": "Her words were like sasswood arrows, piercing through his defenses.",
            "sent5": "The scent of freshly cut sasswood filled the air, a reminder of its deadly purpose."
        },
        {
            "definition": "A preparation made from the bark of this tree, used in traditional African medicine.",
            "pos": "noun",
            "sent1": "The healer brewed a potent potion using sasswood bark for the sick child.",
            "sent2": "Generations of healers passed down the knowledge of the healing properties of sasswood.",
            "sent3": "The mischievous monkey accidentally spilled the sasswood remedy all over himself.",
            "sent4": "Her soothing words acted like a dose of sasswood elixir on his troubled mind.",
            "sent5": "The warmth that spread through her body after drinking the sasswood potion was a sign of its effectiveness."
        }
    ]
}