{
    "term": "satanism",
    "meanings": [
        {
            "definition": "The worship or veneration of Satan.",
            "pos": "noun",
            "sent1": "Some people are drawn to satanism because they believe in the power of evil.",
            "sent2": "Satanism is a religion that worships Satan as a deity.",
            "sent3": "At the costume party, John jokingly claimed his love for satanism as he wore devil horns.",
            "sent4": "The darkness of satanism enveloped her mind, clouding her judgment.",
            "sent5": "The eerie chants echoed through the night, a chilling reminder of the presence of satanism."
        },
        {
            "definition": "The belief in or advocacy of the principles of Satan.",
            "pos": "noun",
            "sent1": "Her interest in satanism stemmed from a fascination with rebellion against traditional norms.",
            "sent2": "Satanism promotes individualism and self-gratification above all else.",
            "sent3": "The satanism club at school often debated the ethics of their beliefs over lunch.",
            "sent4": "In the political arena, his opponents accused him of embracing satanism for his radical views.",
            "sent5": "The allure of satanism's forbidden knowledge captivated her curious mind."
        },
        {
            "definition": "The practice of rituals or ceremonies involving Satan.",
            "pos": "noun",
            "sent1": "The group gathered in the forest to perform their secret satanism rituals.",
            "sent2": "Satanism rituals often involve symbolic acts of defiance against societal norms.",
            "sent3": "The satanism ceremony was disrupted by a sudden downpour, adding an unexpected twist.",
            "sent4": "The dark allure of satanism rituals drew in those seeking a sense of power and control.",
            "sent5": "The flickering candles cast eerie shadows during the midnight satanism ceremony."
        }
    ]
}