{
    "term": "satanisms",
    "meanings": [
        {
            "definition": "The worship or veneration of Satan.",
            "pos": "noun",
            "sent1": "Some people are drawn to satanisms due to their fascination with dark forces.",
            "sent2": "The community strongly opposes satanisms and promotes love and kindness instead.",
            "sent3": "At the costume party, Bob jokingly claimed his love for satanisms to scare his friends.",
            "sent4": "The rise of satanisms in the town was like a shadow creeping over the once peaceful streets.",
            "sent5": "The book vividly described the rituals and beliefs of satanisms, leaving readers intrigued."
        },
        {
            "definition": "Belief in or advocacy of the principles of Satan.",
            "pos": "noun",
            "sent1": "Her interest in satanisms led her to explore different philosophies and beliefs.",
            "sent2": "The group's leader preached about the importance of satanisms in their daily lives.",
            "sent3": "The comedian joked about satanisms, poking fun at extreme beliefs in a light-hearted manner.",
            "sent4": "His actions reflected a deep-rooted commitment to satanisms, influencing those around him.",
            "sent5": "The painting depicted the clash between good and evil, symbolizing the struggle within satanisms."
        },
        {
            "definition": "The practice of satanic rituals or ceremonies.",
            "pos": "noun",
            "sent1": "The abandoned house was rumored to be a site for secret satanisms gatherings.",
            "sent2": "Authorities were alerted to the suspicious activities related to satanisms in the area.",
            "sent3": "The movie portrayed a fictional cult engaging in bizarre satanisms rituals for power.",
            "sent4": "The eerie music playing from the old church hinted at the presence of satanisms ceremonies.",
            "sent5": "The dark alley was a hub for those seeking to delve into the mysteries of satanisms rituals."
        }
    ]
}