{
    "term": "savage",
    "meanings": [
        {
            "definition": "Fierce, violent, and uncontrolled",
            "pos": "adjective",
            "sent1": "The storm was savage, with howling winds and crashing thunder.",
            "sent2": "The lion's savage roar echoed through the jungle.",
            "sent3": "The toddler's tantrum was savage, but also a bit amusing in its intensity.",
            "sent4": "The savage waves relentlessly pounded the shore, eroding the cliffs over time.",
            "sent5": "The savage warrior's eyes blazed with a fierce determination in battle."
        },
        {
            "definition": "A member of a people regarded as primitive and uncivilized",
            "pos": "noun",
            "sent1": "The explorer encountered a savage tribe deep in the jungle.",
            "sent2": "In the story, the savage was depicted as living off the land in harmony with nature.",
            "sent3": "The movie portrayed the savage tribe with exaggerated rituals for comedic effect.",
            "sent4": "She felt like a savage in the concrete jungle of the city, far from her rural home.",
            "sent5": "The artist's painting depicted a group of savages dancing around a bonfire."
        },
        {
            "definition": "A brutal or cruel person",
            "pos": "noun",
            "sent1": "The savage showed no mercy to his enemies on the battlefield.",
            "sent2": "The dictator was known as a savage ruler, oppressing his people with cruelty.",
            "sent3": "The school bully's behavior was savage, but he soon learned kindness.",
            "sent4": "Her words cut through like a savage knife, leaving deep emotional wounds.",
            "sent5": "The savage's actions left a trail of destruction in their wake, causing fear among the villagers."
        },
        {
            "definition": "To attack or treat brutally or viciously",
            "pos": "verb",
            "sent1": "The wild animals would savage their prey with swift and deadly strikes.",
            "sent2": "The mob began to savage the statue, tearing it down in anger.",
            "sent3": "The chef would savage the vegetables with quick chops, preparing them for the stew.",
            "sent4": "The critics would savage the new movie, tearing apart its plot and acting.",
            "sent5": "The storm would savage the coastline, leaving destruction in its path."
        }
    ]
}