{
    "term": "save",
    "meanings": [
        {
            "definition": "Keep safe or rescue from harm or danger.",
            "pos": "verb",
            "sent1": "I will save you from the big, scary dog.",
            "sent2": "She saved the kitten from the tree.",
            "sent3": "The superhero swooped in to save the day.",
            "sent4": "His quick thinking saved the situation from disaster.",
            "sent5": "The lifeguard's quick action saved the drowning swimmer."
        },
        {
            "definition": "Avoid wasting or using up.",
            "pos": "verb",
            "sent1": "We need to save our money for a rainy day.",
            "sent2": "He tries to save water by taking shorter showers.",
            "sent3": "I always save my dessert for last.",
            "sent4": "She managed to save time by taking a shortcut.",
            "sent5": "To save energy, remember to turn off the lights when you leave the room."
        },
        {
            "definition": "Except for; other than.",
            "pos": "preposition",
            "sent1": "Everyone was invited to the party save for Tom.",
            "sent2": "All the cookies were eaten save for one.",
            "sent3": "The park was empty save for a squirrel gathering acorns.",
            "sent4": "The room was silent save for the ticking of the clock.",
            "sent5": "The garden was flourishing save for one wilting flower."
        },
        {
            "definition": "To store up or set aside for future use.",
            "pos": "verb",
            "sent1": "She likes to save her allowance to buy toys.",
            "sent2": "He decided to save some snacks for later.",
            "sent3": "I always save a little bit of my lunch for an afternoon snack.",
            "sent4": "They save extra supplies in case of emergencies.",
            "sent5": "To save for college, she started a piggy bank at a young age."
        }
    ]
}