{
    "term": "saw",
    "meanings": [
        {
            "definition": "A tool with a toothed blade used for cutting wood or other materials.",
            "pos": "noun",
            "sent1": "Dad used the saw to cut the wood for our new table.",
            "sent2": "The carpenter's saw was sharp and efficient.",
            "sent3": "The saw made a loud noise as it sliced through the thick log.",
            "sent4": "Her determination was like a saw, steadily working through obstacles.",
            "sent5": "The saw's teeth gleamed in the sunlight as it bit into the plank."
        },
        {
            "definition": "Past tense of see.",
            "pos": "verb",
            "sent1": "Yesterday, I saw a squirrel in the park.",
            "sent2": "She saw her friend across the street and waved.",
            "sent3": "I saw a cat wearing sunglasses, which made me laugh.",
            "sent4": "His words saw through my defenses, revealing the truth.",
            "sent5": "The detective saw the clue that cracked the case wide open."
        },
        {
            "definition": "To cut with a saw.",
            "pos": "verb",
            "sent1": "He sawed the branch off the tree with ease.",
            "sent2": "The lumberjack sawed through the thick trunk effortlessly.",
            "sent3": "She sawed the cake into perfect slices for the party.",
            "sent4": "The saw cut through the metal like butter, leaving a clean edge.",
            "sent5": "The sculptor sawed away at the marble to reveal the hidden figure."
        },
        {
            "definition": "A wise saying or proverb.",
            "pos": "noun",
            "sent1": "Grandma always shares a saw before bedtime.",
            "sent2": "The ancient book was filled with saws about life and love.",
            "sent3": "The wise man's saws were passed down through generations.",
            "sent4": "In times of trouble, she turned to the comforting saws of her ancestors.",
            "sent5": "The saw about patience resonated deeply with the young listeners."
        }
    ]
}