{
    "term": "scalper",
    "meanings": [
        {
            "definition": "A person who resells tickets for events at a higher price than the face value.",
            "pos": "noun",
            "sent1": "The scalper outside the concert venue was selling tickets at double the price.",
            "sent2": "The scalper made a profit by selling tickets for the football game at inflated prices.",
            "sent3": "The scalper tried to outsmart everyone by selling tickets for the sold-out show.",
            "sent4": "The scalper was like a cunning fox, preying on eager fans for profit.",
            "sent5": "The scalper's shady business practices made him infamous among concert-goers."
        },
        {
            "definition": "A person who removes the scalp of another person or animal.",
            "pos": "noun",
            "sent1": "The scalper in the horror movie wielded a sharp knife to take the scalp of his victims.",
            "sent2": "The ancient tribe's ritual involved a scalper who would collect scalps as trophies.",
            "sent3": "The scalper in the story turned out to be a misunderstood character with a unique hobby.",
            "sent4": "The scalper's actions were as brutal as a lion hunting its prey in the wild.",
            "sent5": "The scalper's collection of scalps was both gruesome and fascinating to archaeologists."
        },
        {
            "definition": "To resell tickets for events at a higher price than the face value.",
            "pos": "verb",
            "sent1": "She decided to scalper the extra tickets she had bought for the music festival.",
            "sent2": "The man planned to scalper the VIP passes to make some quick cash.",
            "sent3": "The friends joked that they should scalper their tickets and go on a luxury vacation instead.",
            "sent4": "The scalper managed to scalper all the tickets within minutes of the event announcement.",
            "sent5": "The scalper's scheme to scalper tickets was finally exposed by vigilant event organizers."
        }
    ]
}