{
    "term": "scaramouche",
    "meanings": [
        {
            "definition": "A stock character in commedia dell'arte, typically portrayed as a boastful coward or buffoon.",
            "pos": "noun",
            "sent1": "In the play, the scaramouche always made everyone laugh with his silly antics.",
            "sent2": "The scaramouche strutted around the stage, pretending to be brave but actually quite scared.",
            "sent3": "The scaramouche tried to act tough, but his friends knew he was just putting on a show.",
            "sent4": "Her little brother was a scaramouche, always talking big but running away when things got tough.",
            "sent5": "The scaramouche's exaggerated gestures and funny expressions delighted the audience."
        },
        {
            "definition": "A boastful or cowardly person.",
            "pos": "noun",
            "sent1": "Don't pay attention to that scaramouche; he's all talk and no action.",
            "sent2": "The scaramouche boasted about his achievements, but deep down, he was afraid of failure.",
            "sent3": "Despite his scaramouche behavior, he was actually quite kind and helpful to those in need.",
            "sent4": "She saw through his scaramouche facade and knew he was just trying to cover up his insecurities.",
            "sent5": "The scaramouche's constant bragging annoyed everyone around him."
        },
        {
            "definition": "To behave in a boastful or cowardly manner.",
            "pos": "verb",
            "sent1": "He would scaramouche around, pretending to be tough when he was actually scared.",
            "sent2": "She scaramouched her way through the challenge, talking big but avoiding any real action.",
            "sent3": "When faced with a difficult decision, he would often scaramouche to avoid taking responsibility.",
            "sent4": "The politician tried to scaramouche his way out of answering the tough questions.",
            "sent5": "Instead of facing his fears, he chose to scaramouche his way out of the situation."
        }
    ]
}