{
    "term": "scaring",
    "meanings": [
        {
            "definition": "To cause fear or frighten",
            "pos": "verb",
            "sent1": "The loud noise was scaring the little dog.",
            "sent2": "She was scaring her friends by jumping out from behind the door.",
            "sent3": "The haunted house was scaring visitors, but they knew it was all pretend.",
            "sent4": "The dark shadows were scaring her, making her heart race.",
            "sent5": "The sudden scream in the movie was scaring everyone in the theater."
        },
        {
            "definition": "The act of causing fear or fright",
            "pos": "noun",
            "sent1": "His scaring of the children was meant to be a harmless prank.",
            "sent2": "The scaring in the horror movie made the audience jump in their seats.",
            "sent3": "The scaring in the haunted house was so realistic that some visitors ran out.",
            "sent4": "The scaring in the story was so intense that it stayed with the readers long after.",
            "sent5": "The scaring caused by the thunderstorm kept the children awake at night."
        },
        {
            "definition": "Causing fear or fright",
            "pos": "adjective",
            "sent1": "The scaring sound of footsteps in the dark alley made her shiver.",
            "sent2": "The scaring movie scene left a lasting impression on the audience.",
            "sent3": "The scaring mask worn by the trick-or-treater made everyone laugh.",
            "sent4": "The scaring stories around the campfire made the night even more thrilling.",
            "sent5": "The scaring sight of the ghostly figure sent chills down her spine."
        },
        {
            "definition": "Fear or fright caused by something",
            "pos": "noun",
            "sent1": "The scaring from the horror movie lingered in her mind long after it ended.",
            "sent2": "The scaring from the unexpected noise made her heart race.",
            "sent3": "The scaring from the haunted house was all in good fun.",
            "sent4": "The scaring from the ghost story kept her awake at night.",
            "sent5": "The scaring from the sudden appearance of the clown startled everyone at the party."
        }
    ]
}