{
    "term": "scarification",
    "meanings": [
        {
            "definition": "The act of making shallow cuts or scratches on the skin as a form of body modification.",
            "pos": "noun",
            "sent1": "During the tribal ritual, scarification was used to mark important life events.",
            "sent2": "She chose scarification as a way to express her cultural identity.",
            "sent3": "The artist joked that scarification was like drawing on the skin with a blade.",
            "sent4": "In some cultures, scarification is seen as a symbol of bravery and strength.",
            "sent5": "The scarification process left intricate patterns on his body."
        },
        {
            "definition": "The process of breaking up the surface of soil to improve aeration and drainage.",
            "pos": "noun",
            "sent1": "Farmers use scarification to prepare the soil for planting crops.",
            "sent2": "After scarification, the soil became more suitable for growing vegetables.",
            "sent3": "The gardener found joy in the scarification process, knowing it would benefit the plants.",
            "sent4": "Scarification is like giving the soil a breath of fresh air.",
            "sent5": "The scarification technique helped the garden flourish with vibrant colors."
        },
        {
            "definition": "The formation of scars on the skin as a result of injury or surgery.",
            "pos": "noun",
            "sent1": "Her scarification was a reminder of the accident she had last year.",
            "sent2": "The scarification from the surgery gradually faded over time.",
            "sent3": "He joked that his scarification was his battle scars from a fierce pillow fight.",
            "sent4": "The emotional scarification was deeper than the physical scars on her skin.",
            "sent5": "The scarification on his face told a story of survival and resilience."
        }
    ]
}