{
    "term": "scarifications",
    "meanings": [
        {
            "definition": "The act of making shallow cuts or scratches on the skin as a form of body modification or decoration.",
            "pos": "noun",
            "sent1": "During the tribal ceremony, the scarifications were performed to honor their ancestors.",
            "sent2": "Her scarifications were intricate patterns that told the story of her tribe.",
            "sent3": "The scarifications on his arm made him look like a walking canvas.",
            "sent4": "Her scarifications were like ancient hieroglyphics etched into her skin.",
            "sent5": "The scarifications on his chest were a symbol of bravery and strength."
        },
        {
            "definition": "The resulting marks or designs left on the skin from scarifying.",
            "pos": "noun",
            "sent1": "The scarifications on her back were a beautiful display of cultural artistry.",
            "sent2": "After the scarifying ritual, intricate scarifications adorned his body.",
            "sent3": "The scarifications on his arm looked like delicate lace patterns.",
            "sent4": "Her scarifications were like nature's own tattoos, telling stories of the past.",
            "sent5": "The scarifications on his skin were a testament to his heritage and beliefs."
        },
        {
            "definition": "The process of intentionally injuring the skin to create scars for cultural or ritual purposes.",
            "pos": "noun",
            "sent1": "The scarifications were a sacred tradition passed down through generations.",
            "sent2": "The scarifications were a way to connect with their ancestors and traditions.",
            "sent3": "The scarifications ritual was both painful and meaningful for the tribe.",
            "sent4": "Her scarifications were a visible reminder of her commitment to her culture.",
            "sent5": "The scarifications symbolized the unity and strength of the community."
        }
    ]
}