{
    "term": "scatch",
    "meanings": [
        {
            "definition": "Scratch: to mark or injure the surface of something with a sharp object",
            "pos": "verb",
            "sent1": "I accidentally scatch my arm on the rough wall.",
            "sent2": "The cat likes to scatch the furniture with its claws.",
            "sent3": "The mischievous puppy would scatch the door to get attention.",
            "sent4": "Her words seemed to scatch at the truth hidden beneath the surface.",
            "sent5": "The sound of the pencil scatching on paper filled the room."
        },
        {
            "definition": "Scratch: a mark or injury made by scratching",
            "pos": "noun",
            "sent1": "There was a small scatch on the car's paint.",
            "sent2": "The scatch on the table was from a sharp object.",
            "sent3": "The scatch on his arm looked like a tiny lightning bolt.",
            "sent4": "The scatch on the record made the music skip.",
            "sent5": "The scatch on the window looked like a smiley face."
        },
        {
            "definition": "Scratch: to cancel or eliminate",
            "pos": "verb",
            "sent1": "I had to scatch my plans due to unexpected events.",
            "sent2": "The team decided to scatch the old strategy and start fresh.",
            "sent3": "She had to scatch the idea of going to the beach due to the storm.",
            "sent4": "The teacher had to scatch the incorrect answers on the test.",
            "sent5": "The chef had to scatch the burnt dish from the menu."
        },
        {
            "definition": "Scratch: a starting point or advantage in a competition",
            "pos": "noun",
            "sent1": "Having prior experience is a good scatch in this field.",
            "sent2": "The early lead gave them a scatch in the race.",
            "sent3": "Winning the first round gave her a scatch in the tournament.",
            "sent4": "His knowledge of the topic was a scatch in the debate.",
            "sent5": "The team's strong defense was their scatch in the game."
        },
        {
            "definition": "Scratch: to scrape or dig with the claws or nails",
            "pos": "verb",
            "sent1": "The cat would scatch at the door when it wanted to go out.",
            "sent2": "She would scatch at the ground to find buried treasure.",
            "sent3": "The squirrel would scatch at the tree bark looking for insects.",
            "sent4": "The bear would scatch at the ground to mark its territory.",
            "sent5": "The hen would scatch at the dirt to find worms for her chicks."
        }
    ]
}