{
    "term": "scena",
    "meanings": [
        {
            "definition": "A scene in a play or movie.",
            "pos": "noun",
            "sent1": "In the scena, the actors performed a dramatic dialogue.",
            "sent2": "The scena where the crime took place was crucial to the plot.",
            "sent3": "The scena with the funny misunderstandings had the audience laughing.",
            "sent4": "Her life felt like a chaotic scena, full of unexpected twists.",
            "sent5": "The scena was beautifully decorated, creating a magical atmosphere."
        },
        {
            "definition": "A division of an act in a play.",
            "pos": "noun",
            "sent1": "The scena change indicated a shift in the storyline.",
            "sent2": "Each scena added depth to the overall narrative of the play.",
            "sent3": "The scena break allowed the actors to catch their breath backstage.",
            "sent4": "The scena shift felt like a new chapter unfolding on stage.",
            "sent5": "The scena transition was seamless, keeping the audience engaged."
        },
        {
            "definition": "A theatrical performance or entertainment.",
            "pos": "noun",
            "sent1": "The scena captivated the audience with its vibrant costumes.",
            "sent2": "Attending a scena is always a delightful experience.",
            "sent3": "The scena ended with a surprising twist that left everyone in awe.",
            "sent4": "Her dance was a scena of grace and elegance.",
            "sent5": "The scena showcased the talents of the young actors beautifully."
        },
        {
            "definition": "A setting or location for a particular event.",
            "pos": "noun",
            "sent1": "The scena for the wedding was decorated with flowers and lights.",
            "sent2": "Choosing the perfect scena for the party was crucial for its success.",
            "sent3": "The scena for the concert had excellent acoustics, enhancing the music.",
            "sent4": "The beach was a picturesque scena for their romantic picnic.",
            "sent5": "The scena for the play was transformed into a magical forest."
        }
    ]
}