{
    "term": "scends",
    "meanings": [
        {
            "definition": "To move upward or ascend.",
            "pos": "verb",
            "sent1": "The balloon slowly scends into the sky.",
            "sent2": "The hiker scends the mountain trail with determination.",
            "sent3": "The elevator scends to the top floor, making everyone dizzy.",
            "sent4": "Hope scends in her heart as she sees the finish line.",
            "sent5": "The sun scends over the horizon, painting the sky in hues of orange and pink."
        },
        {
            "definition": "To rise or go up.",
            "pos": "verb",
            "sent1": "The hot air balloon scends gracefully above the trees.",
            "sent2": "The price of the house scends as the demand increases.",
            "sent3": "The bubbles in the soda scend rapidly to the surface.",
            "sent4": "Her spirits scend when she receives praise for her hard work.",
            "sent5": "The rocket scends into space, leaving a trail of smoke behind."
        },
        {
            "definition": "To climb or scale.",
            "pos": "verb",
            "sent1": "The cat scends the tall tree to chase a bird.",
            "sent2": "He scends the ladder carefully to reach the roof.",
            "sent3": "The spider scends down its web to catch its prey.",
            "sent4": "The mountaineer scends the icy peak, facing many challenges.",
            "sent5": "The rock climber scends the cliff with skill and agility."
        },
        {
            "definition": "To increase or grow.",
            "pos": "verb",
            "sent1": "Her excitement scends as she gets closer to her birthday.",
            "sent2": "The number of visitors to the museum scends during the holiday season.",
            "sent3": "The flowers in the garden scend beautifully in the warm sunlight.",
            "sent4": "His confidence scends with each successful presentation.",
            "sent5": "The waves scend higher and higher as the storm approaches."
        }
    ]
}