{
    "term": "scheme",
    "meanings": [
        {
            "definition": "A plan or program of action",
            "pos": "noun",
            "sent1": "The teacher had a scheme to help students learn math better.",
            "sent2": "The company's marketing scheme was successful in attracting new customers.",
            "sent3": "The squirrel's scheme to steal nuts from the bird feeder was clever.",
            "sent4": "Her scheme to organize a surprise party for her friend was a huge success.",
            "sent5": "The elaborate scheme to rescue the lost hikers involved helicopters and trained dogs."
        },
        {
            "definition": "A systematic plan or arrangement",
            "pos": "noun",
            "sent1": "The city had a scheme in place to manage traffic during rush hour.",
            "sent2": "The architect's scheme for the new building was well thought out.",
            "sent3": "The ants' scheme to gather food efficiently impressed the observers.",
            "sent4": "The scheme to color code the files made it easier to find important documents.",
            "sent5": "The scheme to rotate shifts helped improve productivity in the factory."
        },
        {
            "definition": "A secret or devious plan",
            "pos": "noun",
            "sent1": "The villain's scheme to steal the crown jewels was foiled by the brave detective.",
            "sent2": "She suspected her coworker had a scheme to sabotage her project.",
            "sent3": "The cat's scheme to catch the mouse involved hiding behind the curtains.",
            "sent4": "The evil sorcerer's scheme to curse the kingdom was stopped by the wise wizard.",
            "sent5": "The spy's scheme to infiltrate the enemy's headquarters was risky but necessary."
        },
        {
            "definition": "A diagram or representation of a system or process",
            "pos": "noun",
            "sent1": "The scheme of the water cycle was displayed in the science classroom.",
            "sent2": "The engineer drew a detailed scheme of the new electrical grid.",
            "sent3": "The artist's scheme of the human body was both educational and artistic.",
            "sent4": "The scheme of the solar system helped students understand the planets' orbits.",
            "sent5": "The scheme of the digestive system showed how food travels through the body."
        }
    ]
}