{
    "term": "schlimazel",
    "meanings": [
        {
            "definition": "A consistently unlucky or unfortunate person.",
            "pos": "noun",
            "sent1": "Poor Jerry always seems to be the schlimazel in our group, always losing his keys or tripping over things.",
            "sent2": "The schlimazel in the story could never catch a break, no matter how hard he tried.",
            "sent3": "The schlimazel at the party accidentally spilled punch on themselves, adding to their streak of bad luck.",
            "sent4": "She felt like a schlimazel with a dark cloud following her wherever she went.",
            "sent5": "The schlimazel's life was like a never-ending series of unfortunate events."
        },
        {
            "definition": "To have a string of bad luck or misfortune.",
            "pos": "verb",
            "sent1": "I hope I don't schlimazel my way through the upcoming exam like I did last time.",
            "sent2": "After losing his job, he felt like he was schlimazeling through life with no end in sight.",
            "sent3": "She seemed to schlimazel her way into one mishap after another during the camping trip.",
            "sent4": "The team's performance seemed to schlimazel as they faced one setback after another.",
            "sent5": "The car's engine continued to schlimazel, causing delays on the road trip."
        },
        {
            "definition": "Someone who is prone to experiencing bad luck.",
            "pos": "noun",
            "sent1": "As the designated schlimazel of the group, he was always the one to drop the ball.",
            "sent2": "She felt like a schlimazel magnet, attracting bad luck wherever she went.",
            "sent3": "The poor schlimazel managed to trip over their own feet even on a clear path.",
            "sent4": "He was the schlimazel of the office, always getting the faulty printer.",
            "sent5": "The schlimazel's presence seemed to bring a wave of misfortune to those around them."
        }
    ]
}