{
    "term": "schmaltz",
    "meanings": [
        {
            "definition": "Excessive sentimentality or emotionalism",
            "pos": "noun",
            "sent1": "The movie was full of schmaltz, with characters expressing their feelings in a very dramatic way.",
            "sent2": "Her speech was filled with schmaltz, making everyone in the audience tear up.",
            "sent3": "The soap opera was so full of schmaltz that even the actors couldn't help but laugh at the over-the-top emotions.",
            "sent4": "His writing was criticized for its schmaltz, as it seemed too forced and insincere.",
            "sent5": "The painting captured the essence of schmaltz, evoking strong emotions in all who viewed it."
        },
        {
            "definition": "Rendered chicken or goose fat",
            "pos": "noun",
            "sent1": "The chef used schmaltz to add flavor to the dish, giving it a rich and savory taste.",
            "sent2": "Grandma's secret recipe called for schmaltz to make the chicken extra juicy and delicious.",
            "sent3": "The restaurant proudly advertised that they cooked their fries in schmaltz for a unique twist.",
            "sent4": "The aroma of the roasted vegetables cooked in schmaltz filled the kitchen with a mouth-watering scent.",
            "sent5": "The traditional Jewish dish was made with schmaltz, creating a dish that was both comforting and flavorful."
        },
        {
            "definition": "Exaggerated or artificial emotion",
            "pos": "noun",
            "sent1": "The actor's performance was criticized for its schmaltz, as it lacked authenticity and depth.",
            "sent2": "The singer's ballad was filled with schmaltz, making it hard for the audience to connect with the lyrics.",
            "sent3": "The politician's speech was so full of schmaltz that it was hard to take his promises seriously.",
            "sent4": "Her apology seemed insincere, dripping with schmaltz that failed to convince anyone of her remorse.",
            "sent5": "The play's ending was met with eye rolls due to its schmaltz, leaving the audience feeling unsatisfied."
        }
    ]
}