{
    "term": "schottische",
    "meanings": [
        {
            "definition": "A lively round dance resembling a polka, originating in Bohemia.",
            "pos": "noun",
            "sent1": "At the village fair, everyone joined in the schottische, twirling and laughing.",
            "sent2": "The band played a cheerful schottische, setting the perfect mood for the dance.",
            "sent3": "During the schottische, Tom accidentally spun the wrong way and bumped into the mayor.",
            "sent4": "The schottische of life keeps us moving in circles, sometimes faster, sometimes slower.",
            "sent5": "The colorful dresses and energetic steps made the schottische a memorable part of the celebration."
        },
        {
            "definition": "A piece of music for this dance.",
            "pos": "noun",
            "sent1": "The lively schottische filled the room, making everyone tap their feet.",
            "sent2": "The musicians practiced the schottische, ensuring they played in perfect harmony.",
            "sent3": "The schottische melody was so catchy that it stayed in Mary's head all day.",
            "sent4": "The schottische music flowed through the air, lifting everyone's spirits.",
            "sent5": "The joyful notes of the schottische echoed through the town square, inviting people to dance."
        },
        {
            "definition": "A type of fabric with a twill weave.",
            "pos": "noun",
            "sent1": "The tailor used schottische fabric to create a durable jacket for the winter.",
            "sent2": "The elegant gown was made from a luxurious schottische material.",
            "sent3": "When Sarah accidentally spilled juice on her schottische skirt, it was easy to clean.",
            "sent4": "The schottische weave of the fabric gave it a unique texture and appearance.",
            "sent5": "The rich colors of the schottische fabric made the curtains stand out in the room."
        }
    ]
}