{
    "term": "sclerenchyma",
    "meanings": [
        {
            "definition": "A type of plant tissue that provides structural support",
            "pos": "noun",
            "sent1": "The sclerenchyma in the plant stem helps it stand tall and strong.",
            "sent2": "The tree's trunk is reinforced by sclerenchyma, keeping it sturdy.",
            "sent3": "The mischievous squirrel tried to use the sclerenchyma as a tightrope, but it was too rigid.",
            "sent4": "Her determination was like sclerenchyma, unyielding and unwavering.",
            "sent5": "The sclerenchyma fibers intertwined like a fortress around the plant's core."
        },
        {
            "definition": "Cells with thick, lignified cell walls",
            "pos": "noun",
            "sent1": "The sclerenchyma cells have tough walls that provide protection.",
            "sent2": "When examining the leaf under a microscope, the sclerenchyma cells were clearly visible.",
            "sent3": "The sclerenchyma walls were so strong, even the microscope had trouble penetrating them.",
            "sent4": "His resolve was as unyielding as the sclerenchyma cell walls.",
            "sent5": "The sclerenchyma walls stood like ancient fortifications against any harm."
        },
        {
            "definition": "Fibrous cells found in plant stems and roots",
            "pos": "noun",
            "sent1": "The sclerenchyma fibers provide reinforcement to the plant's structure.",
            "sent2": "Gardening experts study the distribution of sclerenchyma in different plant species.",
            "sent3": "The mischievous rabbit tried to use the sclerenchyma fibers as a hammock, but it was too rigid.",
            "sent4": "Her determination was like the intertwining sclerenchyma fibers, unyielding and strong.",
            "sent5": "The sclerenchyma fibers in the roots resembled a network of sturdy ropes supporting the plant."
        }
    ]
}