{
    "term": "score",
    "meanings": [
        {
            "definition": "A group or set of twenty.",
            "pos": "noun",
            "sent1": "I need a score of pencils for the class.",
            "sent2": "The baseball team had a score of runs in the game.",
            "sent3": "I accidentally bought a score of bananas, thinking they were singles.",
            "sent4": "The field was covered with a score of colorful flowers.",
            "sent5": "The farmer harvested a score of ripe pumpkins from the field."
        },
        {
            "definition": "A notch or mark made in keeping an account.",
            "pos": "noun",
            "sent1": "He kept a score on the wall to track his progress.",
            "sent2": "The score on the paper showed the total number of points earned.",
            "sent3": "I found a mysterious score on the old tree trunk.",
            "sent4": "The ancient ruins had a score carved into the stone.",
            "sent5": "The detective discovered a hidden score in the suspect's notebook."
        },
        {
            "definition": "The act of obtaining a point in a game or contest.",
            "pos": "noun",
            "sent1": "Scoring a goal in soccer earns the team a point.",
            "sent2": "The basketball player made a score from the free-throw line.",
            "sent3": "The cat made a score by catching the mouse.",
            "sent4": "Her quick thinking was a score in the trivia competition.",
            "sent5": "The final score of the match determined the winner."
        },
        {
            "definition": "To achieve or gain.",
            "pos": "verb",
            "sent1": "She hoped to score a high grade on the test.",
            "sent2": "The team worked hard to score a victory in the championship.",
            "sent3": "I managed to score a discount on the new phone.",
            "sent4": "He scored a job at the new company.",
            "sent5": "The artist scored a big commission for a mural."
        },
        {
            "definition": "To make a written mark on.",
            "pos": "verb",
            "sent1": "Please score your answers with a pencil.",
            "sent2": "The artist scored intricate patterns on the pottery.",
            "sent3": "I will score a reminder on the calendar.",
            "sent4": "She scored her name on the tree trunk.",
            "sent5": "The carpenter scored lines on the wood for cutting."
        }
    ]
}