{
    "term": "scorched",
    "meanings": [
        {
            "definition": "Burned or charred on the surface",
            "pos": "adjective",
            "sent1": "The scorched toast was black and hard.",
            "sent2": "The firefighter touched the scorched wood cautiously.",
            "sent3": "The scorched marshmallow looked like a tiny charcoal.",
            "sent4": "The scorched earth bore the scars of the wildfire's wrath.",
            "sent5": "The scorched metal glowed red in the sunlight."
        },
        {
            "definition": "Extremely hot or dry",
            "pos": "adjective",
            "sent1": "The desert was so scorched that even the cacti wilted.",
            "sent2": "The scorched pavement made walking barefoot unbearable.",
            "sent3": "The scorched air felt like a blanket of heat wrapping around us.",
            "sent4": "The scorched sand burned like fire under the noon sun.",
            "sent5": "The scorched rocks radiated intense warmth."
        },
        {
            "definition": "To burn the surface of something",
            "pos": "verb",
            "sent1": "She accidentally scorched the shirt with the iron.",
            "sent2": "The chef scorched the steak to perfection on the grill.",
            "sent3": "The sun scorched the picnic blanket, leaving a mark.",
            "sent4": "The dragon's breath scorched the castle walls.",
            "sent5": "The wildfire scorched the entire forest, leaving devastation in its wake."
        },
        {
            "definition": "To dry or parch with intense heat",
            "pos": "verb",
            "sent1": "The relentless sun scorched the fields, drying them out.",
            "sent2": "The heatwave scorched the earth, leaving it cracked.",
            "sent3": "The oven scorched the cookies, making them too crispy.",
            "sent4": "The summer sun scorched the grass, turning it yellow.",
            "sent5": "The fire scorched the land, leaving it barren and lifeless."
        }
    ]
}