{
    "term": "scotched",
    "meanings": [
        {
            "definition": "To put an end to; crush",
            "pos": "verb",
            "sent1": "The hero scotched the evil plan of the villain.",
            "sent2": "The firefighters scotched the raging flames before they could spread.",
            "sent3": "The clever detective scotched the criminal's escape with a clever trap.",
            "sent4": "The teacher scotched the rumors of a pop quiz by announcing a movie day instead.",
            "sent5": "The brave knight scotched the dragon's reign of terror with a swift strike of his sword."
        },
        {
            "definition": "To cut or score",
            "pos": "verb",
            "sent1": "She scotched the paper with a pair of scissors.",
            "sent2": "The chef scotched the vegetables for the stir-fry.",
            "sent3": "The naughty puppy scotched the sofa with its sharp claws.",
            "sent4": "The artist scotched intricate patterns into the clay vase.",
            "sent5": "The barber scotched precise lines into the customer's hair for a stylish look."
        },
        {
            "definition": "To block or impede",
            "pos": "verb",
            "sent1": "The fallen tree scotched the path through the forest.",
            "sent2": "The heavy traffic scotched their plans for a quick journey.",
            "sent3": "The stubborn lock scotched their attempts to enter the room.",
            "sent4": "The huge boulder scotched the river's flow, creating a temporary dam.",
            "sent5": "The thick fog scotched their visibility, making it hard to see ahead."
        },
        {
            "definition": "To injure or wound",
            "pos": "verb",
            "sent1": "The sharp rock scotched his knee as he fell.",
            "sent2": "The thorn bush scotched her arm as she passed by.",
            "sent3": "The playful kitten scotched the furniture with its claws.",
            "sent4": "The rusty nail scotched his finger, causing a small cut.",
            "sent5": "The barbed wire fence scotched the trespasser, leaving a painful mark."
        }
    ]
}