{
    "term": "scoup",
    "meanings": [
        {
            "definition": "To take out or up with or as if with a scoop",
            "pos": "verb",
            "sent1": "She scouped the ice cream into a cone.",
            "sent2": "The child scouped sand into a bucket at the beach.",
            "sent3": "He scouped up the spilled milk with a napkin.",
            "sent4": "The excavator scouped out a large hole in the ground.",
            "sent5": "The chef scouped out the avocado flesh with precision."
        },
        {
            "definition": "To hollow out or form with a scoop",
            "pos": "verb",
            "sent1": "She scouped out a pumpkin to make a jack-o'-lantern.",
            "sent2": "The sculptor scouped the clay into a beautiful vase.",
            "sent3": "He scouped a hole in the sand to bury his treasure.",
            "sent4": "The machine scouped the snow to clear the driveway.",
            "sent5": "The chef scouped the melon into decorative balls."
        },
        {
            "definition": "To pick up quickly or surreptitiously with or as if with a scoop",
            "pos": "verb",
            "sent1": "She scouped up the fallen coins before anyone noticed.",
            "sent2": "The cat scouped up the mouse in one swift motion.",
            "sent3": "He scouped up the last cookie when no one was looking.",
            "sent4": "The spy scouped up the classified documents without a sound.",
            "sent5": "The child scouped up the candy from the jar when no one was around."
        },
        {
            "definition": "To move or lift with a scoop or as if with a scoop",
            "pos": "verb",
            "sent1": "She scouped the baby into her arms and kissed his forehead.",
            "sent2": "The crane scouped the heavy load effortlessly.",
            "sent3": "He scouped the books off the table and onto the shelf.",
            "sent4": "The wind scouped the leaves into a swirling dance.",
            "sent5": "The chef scouped the pasta onto the plate with a flourish."
        }
    ]
}