{
    "term": "scrambling",
    "meanings": [
        {
            "definition": "Moving quickly and awkwardly",
            "pos": "adjective",
            "sent1": "The scrambling squirrel darted across the yard.",
            "sent2": "The scrambling toddler tripped over his own feet.",
            "sent3": "The scrambling puppy tried to catch its tail but kept stumbling.",
            "sent4": "The scrambling ants hurried to gather food before the rain.",
            "sent5": "The scrambling chicken flapped its wings in a frenzy."
        },
        {
            "definition": "Mixing up or jumbling",
            "pos": "verb",
            "sent1": "She was scrambling the eggs in the pan for breakfast.",
            "sent2": "The wind was scrambling the papers on the desk.",
            "sent3": "The magician was scrambling the cards for his next trick.",
            "sent4": "The chef was scrambling to find the right ingredients for the recipe.",
            "sent5": "The kids were scrambling the puzzle pieces together in excitement."
        },
        {
            "definition": "Climbing or crawling hastily",
            "pos": "adverb",
            "sent1": "The cat was scrambling up the tree to chase a bird.",
            "sent2": "He was scrambling down the hill to catch the bus.",
            "sent3": "The spider was scrambling around the web to fix a broken strand.",
            "sent4": "The hiker was scrambling over rocks to reach the summit.",
            "sent5": "The squirrel was scrambling along the fence to escape the dog."
        },
        {
            "definition": "Struggling to achieve something",
            "pos": "adjective",
            "sent1": "The scrambling student was trying hard to finish the test on time.",
            "sent2": "The scrambling athlete pushed through the pain to reach the finish line.",
            "sent3": "The scrambling chef was determined to perfect the recipe despite setbacks.",
            "sent4": "The scrambling team worked together to overcome the challenges.",
            "sent5": "The scrambling artist poured their heart into the painting despite doubts."
        }
    ]
}