{
    "term": "scraping",
    "meanings": [
        {
            "definition": "To remove or gather by scraping.",
            "pos": "verb",
            "sent1": "She was scraping the paint off the wall with a scraper.",
            "sent2": "I always start by scraping the ice off my car windshield in the winter.",
            "sent3": "The cat was scraping its claws on the scratching post, thinking it was a tree.",
            "sent4": "Her voice was like scraping nails on a chalkboard, making everyone cringe.",
            "sent5": "The sound of scraping metal echoed through the garage as he worked on his project."
        },
        {
            "definition": "To rub or scrape (a surface) with something hard or rough.",
            "pos": "verb",
            "sent1": "He was scraping the mud off his shoes before entering the house.",
            "sent2": "The chef was scraping the burnt bits off the bottom of the pan.",
            "sent3": "The kids were scraping their knees on the pavement while learning to ride their bikes.",
            "sent4": "The wind was scraping against the windows, creating an eerie sound.",
            "sent5": "She could hear the scraping of branches against the roof during the storm."
        },
        {
            "definition": "The act of scraping.",
            "pos": "noun",
            "sent1": "The scraping of the chair against the floor interrupted the meeting.",
            "sent2": "I could hear the scraping of the shovel against the pavement outside.",
            "sent3": "The scraping of the fork against the plate made everyone at the table cringe.",
            "sent4": "The scraping of the pencil sharpener echoed in the quiet classroom.",
            "sent5": "The scraping of the knife against the cutting board was rhythmic and soothing."
        },
        {
            "definition": "A small piece or amount of something.",
            "pos": "noun",
            "sent1": "She found a scraping of chocolate at the bottom of the bowl.",
            "sent2": "There was a scraping of butter left on the plate after breakfast.",
            "sent3": "He only had a scraping of paint left in the can.",
            "sent4": "The chef added a scraping of nutmeg to the soup for extra flavor.",
            "sent5": "The scraping of crumbs on the table attracted a line of ants."
        }
    ]
}