{
    "term": "scrapes",
    "meanings": [
        {
            "definition": "To remove or gather by scraping",
            "pos": "verb",
            "sent1": "She scrapes the paint off the wall with a scraper.",
            "sent2": "He scrapes the mud off his shoes before entering the house.",
            "sent3": "The cat scrapes its claws on the scratching post, thinking it's a tree.",
            "sent4": "The gardener scrapes away the weeds to reveal the hidden flowers beneath.",
            "sent5": "The chef scrapes the last bits of chocolate from the bowl to use in the dessert."
        },
        {
            "definition": "A narrow escape or difficult situation",
            "pos": "noun",
            "sent1": "The hiker had a lucky scrapes when he narrowly avoided falling off the cliff.",
            "sent2": "The spy made a daring scrapes from the enemy's headquarters.",
            "sent3": "It was a real scrapes trying to find a parking spot during rush hour.",
            "sent4": "The ship's crew faced a scrapes when they encountered a sudden storm at sea.",
            "sent5": "The detective's quick thinking saved him from a dangerous scrapes with the criminal."
        },
        {
            "definition": "A mark or injury caused by scraping",
            "pos": "noun",
            "sent1": "The child had scrapes on his knees from falling off his bike.",
            "sent2": "The table had scrapes and scratches from years of use.",
            "sent3": "The cat proudly showed off its scrapes from climbing trees.",
            "sent4": "The old car had rust and scrapes along its sides.",
            "sent5": "The athlete had scrapes and bruises from the intense game."
        },
        {
            "definition": "A sound made by scraping",
            "pos": "noun",
            "sent1": "The loud scrapes of the chair being dragged across the floor echoed in the room.",
            "sent2": "The eerie scrapes of branches against the window made her shiver.",
            "sent3": "The rhythmic scrapes of the violin bow created a beautiful melody.",
            "sent4": "The metallic scrapes of the tools in the workshop signaled the start of work.",
            "sent5": "The gentle scrapes of the pencil on paper filled the quiet classroom."
        },
        {
            "definition": "A small fight or argument",
            "pos": "noun",
            "sent1": "There was a minor scrapes between the siblings over who gets the last cookie.",
            "sent2": "The neighbors had a silly scrapes over the property line.",
            "sent3": "The group of friends laughed off their scrapes about which movie to watch.",
            "sent4": "The office had a heated scrapes about the upcoming project deadline.",
            "sent5": "The team quickly resolved their scrapes about the best strategy to win the game."
        }
    ]
}