{
    "term": "scrawlers",
    "meanings": [
        {
            "definition": "A person who writes or draws in a careless or messy manner.",
            "pos": "noun",
            "sent1": "The scrawlers left their mark on the walls with their messy doodles.",
            "sent2": "The teacher scolded the scrawlers for defacing the school property.",
            "sent3": "The scrawlers turned the blank page into a chaotic canvas of scribbles.",
            "sent4": "The scrawlers' careless strokes painted a picture of disorder on the paper.",
            "sent5": "The scrawlers' messy handwriting made it hard to decipher their notes."
        },
        {
            "definition": "A group of individuals who scribble or doodle without care.",
            "pos": "noun",
            "sent1": "The classroom was filled with scrawlers creating random drawings on their notebooks.",
            "sent2": "The scrawlers gathered around the table, each adding their messy touch to the collaborative artwork.",
            "sent3": "The scrawlers' doodles seemed to come alive, dancing across the page.",
            "sent4": "The scrawlers' collective creativity transformed the blank canvas into a colorful masterpiece.",
            "sent5": "The scrawlers' careless scribbles intertwined to form a unique pattern."
        },
        {
            "definition": "The act of writing or drawing in a messy or careless manner.",
            "pos": "noun",
            "sent1": "The scrawlers' haphazard writing made it difficult to follow their story.",
            "sent2": "The meeting room table was covered in scrawlers from the brainstorming session.",
            "sent3": "The scrawlers' messy notes looked like a secret code only they could decipher.",
            "sent4": "The scrawlers' careless sketches captured the essence of spontaneity.",
            "sent5": "The scrawlers' messy artwork reflected their free-spirited approach to creativity."
        }
    ]
}