{
    "term": "scrape",
    "meanings": [
        {
            "definition": "To remove or gather by or as if by scraping",
            "pos": "verb",
            "sent1": "I scrape the mud off my shoes before entering the house.",
            "sent2": "She used a spoon to scrape the last bit of ice cream from the container.",
            "sent3": "The raccoon tried to scrape the lid off the trash can to get to the leftovers.",
            "sent4": "His voice sounded like gravel scraping against metal.",
            "sent5": "The gardener had to scrape the weeds from the flower bed to make room for new plants."
        },
        {
            "definition": "To injure or damage by or as if by scraping",
            "pos": "verb",
            "sent1": "Be careful not to scrape your knee on the rough pavement.",
            "sent2": "The cat accidentally scrape the furniture while sharpening its claws.",
            "sent3": "The chef accidentally scrape his finger while chopping vegetables.",
            "sent4": "The branches scrape against the window during the storm, causing a scary sound.",
            "sent5": "The old car's paint was so worn that a light touch could scrape it off."
        },
        {
            "definition": "A sound made by scraping",
            "pos": "noun",
            "sent1": "The scrape of the chair against the floor echoed in the empty room.",
            "sent2": "The scrape of the shovel against the pavement could be heard from afar.",
            "sent3": "The scrape of the knife against the cutting board was rhythmic and soothing.",
            "sent4": "The scrape of the branches against the window made the dog bark in alarm.",
            "sent5": "The scrape of the pencil against the paper filled the classroom during the test."
        },
        {
            "definition": "A narrow escape",
            "pos": "noun",
            "sent1": "The hiker had a scrape with a bear but managed to escape unharmed.",
            "sent2": "The spy's scrape from the enemy's base was a close call.",
            "sent3": "The cat's scrape from the dog was a funny sight to witness.",
            "sent4": "The athlete's scrape from the falling debris was a heart-stopping moment.",
            "sent5": "The driver's scrape from the oncoming car was a reminder to always be cautious on the road."
        }
    ]
}