{
    "term": "screens",
    "meanings": [
        {
            "definition": "A flat panel or area on a device for displaying information.",
            "pos": "noun",
            "sent1": "The phone's screens showed colorful pictures.",
            "sent2": "The computer screens are used to watch videos.",
            "sent3": "The screens on the tablet made the cat look like it was dancing.",
            "sent4": "Her eyes were like screens, revealing all her emotions.",
            "sent5": "The screens in the classroom made learning more interactive."
        },
        {
            "definition": "A protective covering made of mesh or wire.",
            "pos": "noun",
            "sent1": "The window screens kept the bugs out of the house.",
            "sent2": "The fireplace screens prevented sparks from flying out.",
            "sent3": "The screens on the beekeeper's hat made him look like a spaceman.",
            "sent4": "Her laughter was like a screen, shielding her true feelings.",
            "sent5": "The screens on the tent kept the mosquitoes away during the camping trip."
        },
        {
            "definition": "To examine or test for the presence of something.",
            "pos": "verb",
            "sent1": "The doctor screens patients for any signs of illness.",
            "sent2": "The security guard screens visitors before allowing them inside.",
            "sent3": "She screens her calls to avoid telemarketers.",
            "sent4": "The detective screens the suspects for any clues.",
            "sent5": "The teacher screens the students' work for plagiarism."
        },
        {
            "definition": "To shield or protect from harm or danger.",
            "pos": "verb",
            "sent1": "The sunscreen screens the skin from the sun's harmful rays.",
            "sent2": "The bodyguard screens the celebrity from overzealous fans.",
            "sent3": "He screens his little sister from scary movies.",
            "sent4": "The umbrella screens her from the rain during the storm.",
            "sent5": "The fence screens the backyard from prying eyes."
        }
    ]
}