{
    "term": "screwer",
    "meanings": [
        {
            "definition": "A person who screws or fastens things together.",
            "pos": "noun",
            "sent1": "The screwer helped build the new bookshelf.",
            "sent2": "The carpenter always carries a screwer in his toolbox.",
            "sent3": "The friendly screwer made sure the table was sturdy.",
            "sent4": "She was the unsung hero, the silent screwer of the team.",
            "sent5": "The diligent screwer never missed a screw, ensuring everything held together."
        },
        {
            "definition": "A tool used for turning screws.",
            "pos": "noun",
            "sent1": "Dad used the screwer to fix the loose doorknob.",
            "sent2": "The mechanic's favorite tool was the trusty screwer.",
            "sent3": "The shiny screwer gleamed in the sunlight.",
            "sent4": "The old screwer had seen many projects and still worked like new.",
            "sent5": "With a twist of the screwer, the job was done in seconds."
        },
        {
            "definition": "To attach or fasten with a screw.",
            "pos": "verb",
            "sent1": "He will screwer the shelf securely to the wall.",
            "sent2": "Remember to screwer the lid tightly on the jar.",
            "sent3": "She tried to screwer the loose button back on her shirt.",
            "sent4": "The idea screwered into his mind suddenly, like a bolt of lightning.",
            "sent5": "She carefully screwered each piece together, creating a masterpiece."
        },
        {
            "definition": "To cheat or take advantage of someone.",
            "pos": "verb",
            "sent1": "He tried to screwer her out of her hard-earned money.",
            "sent2": "The scammer attempted to screwer the unsuspecting victims.",
            "sent3": "The mischievous cat tried to screwer the dog out of its treat.",
            "sent4": "The con artist's plan to screwer the wealthy businessman backfired.",
            "sent5": "She felt betrayed when she realized he was trying to screwer her all along."
        }
    ]
}