{
    "term": "screwworms",
    "meanings": [
        {
            "definition": "Larvae of a parasitic fly that infest the flesh of living mammals, including humans.",
            "pos": "noun",
            "sent1": "The screwworms burrowed into the skin of the poor deer.",
            "sent2": "Farmers must protect their animals from screwworms infesting their bodies.",
            "sent3": "The screwworms threw a party in the cow's wound, much to the cow's dismay.",
            "sent4": "The city was overrun by crime, like a swarm of screwworms infesting a field.",
            "sent5": "The screwworms wriggled and squirmed in the flesh, causing great discomfort."
        },
        {
            "definition": "A type of fly that lays its eggs in wounds or mucous membranes of animals.",
            "pos": "noun",
            "sent1": "The screwworms buzzed around the injured dog, ready to lay their eggs.",
            "sent2": "Vets need to be vigilant for any signs of screwworms in their patients.",
            "sent3": "The screwworms decided to have a picnic in the horse's wound, much to the horse's surprise.",
            "sent4": "The market was crowded with people, like a swarm of screwworms around a fresh wound.",
            "sent5": "The screwworms multiplied rapidly, causing concern among farmers."
        },
        {
            "definition": "A serious pest in livestock and wildlife.",
            "pos": "noun",
            "sent1": "Farmers struggle to control the population of screwworms in their livestock.",
            "sent2": "Wildlife experts are working to prevent the spread of screwworms in the national park.",
            "sent3": "The screwworms decided to have a dance party in the pigpen, much to the pigs' confusion.",
            "sent4": "The issue of pollution was like a swarm of screwworms, slowly damaging the ecosystem.",
            "sent5": "The screwworms posed a significant threat to the survival of the endangered species."
        }
    ]
}