{
    "term": "screen",
    "meanings": [
        {
            "definition": "A flat surface on which pictures or words are shown.",
            "pos": "noun",
            "sent1": "The movie theater had a large screen for everyone to watch.",
            "sent2": "I looked at the screen to see the latest news updates.",
            "sent3": "The screen blushed when it displayed the embarrassing photo.",
            "sent4": "Her smile lit up the screen like a beacon of happiness.",
            "sent5": "The screen glowed with vibrant colors, mesmerizing the audience."
        },
        {
            "definition": "A protective covering that keeps out insects or dirt.",
            "pos": "noun",
            "sent1": "The window screen prevented bugs from entering the house.",
            "sent2": "She carefully placed the screen over the delicate plant to shield it from dust.",
            "sent3": "The screen chuckled to itself, proud of keeping the room clean.",
            "sent4": "His words acted as a screen, shielding her from the harsh truth.",
            "sent5": "The screen acted as a faithful guardian, protecting the precious items behind it."
        },
        {
            "definition": "To examine or test someone or something.",
            "pos": "verb",
            "sent1": "The doctor will screen the patient for any signs of illness.",
            "sent2": "They will screen the job applicants to find the most qualified candidate.",
            "sent3": "The detective decided to screen the suspect's alibi for any inconsistencies.",
            "sent4": "She tried to screen his intentions, looking for any hidden motives.",
            "sent5": "The teacher will screen the students' understanding of the topic through a quiz."
        },
        {
            "definition": "To hide or protect someone or something from view.",
            "pos": "verb",
            "sent1": "She used the umbrella to screen herself from the sun's harsh rays.",
            "sent2": "He tried to screen his emotions, not wanting others to see his true feelings.",
            "sent3": "The magician used smoke to screen his disappearance from the audience.",
            "sent4": "The trees screened the house from the view of passersby.",
            "sent5": "The clouds screened the moon, casting a shadow over the landscape."
        }
    ]
}