{
    "term": "screamer",
    "meanings": [
        {
            "definition": "A person or thing that screams loudly.",
            "pos": "noun",
            "sent1": "The screamer in the haunted house scared everyone with their loud screams.",
            "sent2": "The baby was a real screamer whenever he didn't get his way.",
            "sent3": "The parrot was a little screamer, mimicking all the loud noises in the house.",
            "sent4": "The thunderstorm outside sounded like a giant screamer in the night.",
            "sent5": "The fire alarm was a relentless screamer, making sure everyone evacuated safely."
        },
        {
            "definition": "A type of roller coaster known for its intense drops and high speeds.",
            "pos": "noun",
            "sent1": "The new screamer at the amusement park was so fast that it made everyone scream with excitement.",
            "sent2": "The kids lined up eagerly to ride the famous screamer roller coaster.",
            "sent3": "The screamer roller coaster was so thrilling that even the adults felt like kids again.",
            "sent4": "The screamer coaster twisted and turned like a wild beast on the tracks.",
            "sent5": "The sound of the screamer coaster echoed through the park, drawing in thrill-seekers from all around."
        },
        {
            "definition": "A type of goal scored in soccer that is powerful and difficult for the goalkeeper to stop.",
            "pos": "noun",
            "sent1": "The striker's screamer in the final minutes of the game secured their team's victory.",
            "sent2": "The crowd erupted in cheers as the screamer goal hit the back of the net.",
            "sent3": "The screamer goal was so powerful that it left the goalkeeper stunned.",
            "sent4": "The screamer shot flew past the goalkeeper like a lightning bolt.",
            "sent5": "The screamer goal was etched in the history of the tournament as one of the best ever scored."
        }
    ]
}