{
    "term": "scrofulas",
    "meanings": [
        {
            "definition": "A disease characterized by the enlargement of the lymph nodes, especially in the neck.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with scrofulas after noticing swollen lymph nodes in their neck.",
            "sent2": "She read about scrofulas in a medical book and learned it causes lymph nodes to enlarge.",
            "sent3": "The scrofulas in the neck made the patient look like they were wearing a strange necklace.",
            "sent4": "The city's pollution seemed to spread like scrofulas, affecting everyone's health.",
            "sent5": "The image of the swollen lymph nodes in scrofulas stuck in her mind like a haunting memory."
        },
        {
            "definition": "A person afflicted with scrofula.",
            "pos": "noun",
            "sent1": "The hospital provided care for scrofulas, offering support to those afflicted with the disease.",
            "sent2": "He felt sympathy for the scrofulas in the community, knowing the challenges they faced.",
            "sent3": "The scrofulas at the support group shared stories of their experiences with the disease.",
            "sent4": "Her kindness towards the scrofulas in her neighborhood showed her compassionate nature.",
            "sent5": "The scrofulas in the town formed a close-knit group, supporting each other through their struggles."
        },
        {
            "definition": "A swelling or inflammation in the lymph nodes.",
            "pos": "noun",
            "sent1": "The doctor prescribed medication to reduce the scrofulas in the patient's lymph nodes.",
            "sent2": "She felt the scrofulas in her neck causing discomfort and sought medical advice.",
            "sent3": "The scrofulas in his lymph nodes made him hesitant to participate in physical activities.",
            "sent4": "The scrofulas in the lymph nodes seemed to pulsate with each heartbeat.",
            "sent5": "The image of the scrofulas in the medical textbook illustrated the condition clearly."
        }
    ]
}