{
    "term": "scrummaging",
    "meanings": [
        {
            "definition": "The act of searching through something in a disorderly or hasty way.",
            "pos": "noun",
            "sent1": "During the scavenger hunt, the kids were scrummaging through the park for hidden treasures.",
            "sent2": "She was scrummaging through her messy drawer to find her missing keys.",
            "sent3": "The raccoon was scrummaging through the trash cans looking for a late-night snack.",
            "sent4": "The detective was scrummaging through the old files to find a clue to solve the case.",
            "sent5": "The kids were scrummaging through the pile of leaves to find the hidden toy."
        },
        {
            "definition": "Engaging in a physical struggle or fight.",
            "pos": "verb",
            "sent1": "The two wrestlers were scrummaging fiercely on the mat, trying to pin each other down.",
            "sent2": "The siblings were scrummaging playfully in the backyard, pretending to be superheroes.",
            "sent3": "The puppies were scrummaging over a toy, wagging their tails happily.",
            "sent4": "The kids were scrummaging for the last piece of cake at the birthday party.",
            "sent5": "The players were scrummaging for the ball, trying to score a goal."
        },
        {
            "definition": "The act of pushing or shoving in a disorderly manner.",
            "pos": "noun",
            "sent1": "In the crowded market, there was a lot of scrummaging as people tried to get to the front of the line.",
            "sent2": "The fans started scrummaging to get closer to the stage during the concert.",
            "sent3": "The kids were scrummaging to get to the front of the line for the ice cream truck.",
            "sent4": "There was a scrummage near the entrance as everyone rushed to get inside before the rain started.",
            "sent5": "The protesters were scrummaging against the police barricade, demanding to be heard."
        }
    ]
}