{
    "term": "scrub",
    "meanings": [
        {
            "definition": "To clean something by rubbing its surface hard",
            "pos": "verb",
            "sent1": "I scrubbed the dishes until they sparkled.",
            "sent2": "She scrubbed the floor with a brush and soap.",
            "sent3": "After a long day, I had to scrub the kitchen clean.",
            "sent4": "The intense rain scrubbed the dirt off the sidewalk.",
            "sent5": "The determined cleaner scrubbed away all the grime."
        },
        {
            "definition": "A person who is not skilled or competent at a particular activity",
            "pos": "noun",
            "sent1": "He's a scrub when it comes to playing basketball.",
            "sent2": "The new employee is a scrub at using the software.",
            "sent3": "The scrub tried to fix the leak but made it worse.",
            "sent4": "She felt like a scrub in the advanced math class.",
            "sent5": "The team lost because they had a scrub player."
        },
        {
            "definition": "A small, stunted tree or shrub",
            "pos": "noun",
            "sent1": "The garden had a few scrubs that needed pruning.",
            "sent2": "The scrub in the corner of the yard looked lonely.",
            "sent3": "The little scrub struggled to grow in the rocky soil.",
            "sent4": "The wind bent the scrub in different directions.",
            "sent5": "The birds nested in the branches of the scrub."
        },
        {
            "definition": "A low, woody plant that grows in poor soil",
            "pos": "noun",
            "sent1": "The desert is home to many scrubs adapted to dry conditions.",
            "sent2": "The scrub provided shelter for small animals in the barren land.",
            "sent3": "The farmer planted scrubs to prevent soil erosion.",
            "sent4": "The scrub's roots reached deep into the nutrient-poor earth.",
            "sent5": "The hiker admired the resilience of the scrub in harsh environments."
        }
    ]
}