{
    "term": "scrummages",
    "meanings": [
        {
            "definition": "A disorderly struggle or fight",
            "pos": "noun",
            "sent1": "During the schoolyard scuffle, the kids got into a series of scrummages.",
            "sent2": "The alley was filled with scrummages as the two gangs clashed.",
            "sent3": "At the family reunion, the water balloon fight turned into a hilarious scrummage.",
            "sent4": "In the chaos of the protest, the crowd resembled a massive scrummage of conflicting opinions.",
            "sent5": "The medieval battle scene in the movie depicted a fierce scrummage between knights."
        },
        {
            "definition": "A practice session in rugby or American football",
            "pos": "noun",
            "sent1": "The team had a productive scrummage to prepare for the upcoming match.",
            "sent2": "Coaches often emphasize the importance of teamwork during scrummages.",
            "sent3": "During the football scrummage, the players worked on their passing skills.",
            "sent4": "The rugby scrummage resembled a strategic dance of coordinated movements.",
            "sent5": "The football team's scrummage was intense, with players giving their all on the field."
        },
        {
            "definition": "To engage in a disorderly struggle or fight",
            "pos": "verb",
            "sent1": "The kids began to scrummage over the last piece of cake at the party.",
            "sent2": "Neighbors often scrummage over parking spaces in the crowded street.",
            "sent3": "The siblings would scrummage playfully over the TV remote every evening.",
            "sent4": "The rival gangs would scrummage for control of the neighborhood.",
            "sent5": "The protesters started to scrummage with the police, leading to chaos in the streets."
        },
        {
            "definition": "To engage in a practice session in rugby or American football",
            "pos": "verb",
            "sent1": "The team decided to scrummage early in the morning to avoid the heat.",
            "sent2": "Players often scrummage to improve their skills and teamwork.",
            "sent3": "The coach encouraged the team to scrummage harder to prepare for the tournament.",
            "sent4": "The athletes would scrummage diligently to perfect their plays.",
            "sent5": "Before the big game, the team would scrummage tirelessly to refine their strategies."
        }
    ]
}