{
    "term": "scrummage",
    "meanings": [
        {
            "definition": "A disorderly struggle or fight.",
            "pos": "noun",
            "sent1": "During the scrummage, the kids playfully wrestled for the ball.",
            "sent2": "The rugby players formed a scrummage to gain possession of the ball.",
            "sent3": "At the family picnic, the scrummage for the last piece of cake turned into a fun chaos.",
            "sent4": "In the crowded market, shoppers were in a scrummage to grab the best deals.",
            "sent5": "The scrummage between the puppies over the toy was both adorable and chaotic."
        },
        {
            "definition": "To engage in a disorderly struggle or fight.",
            "pos": "verb",
            "sent1": "The kids love to scrummage around in the leaves during autumn.",
            "sent2": "The protesters began to scrummage with the police, causing chaos.",
            "sent3": "As the siblings cleaned the attic, they started to scrummage through old boxes and found forgotten treasures.",
            "sent4": "The students had to scrummage through their notes to find the answer to the surprise quiz question.",
            "sent5": "The chef had to scrummage through the pantry to find the missing ingredient for the recipe."
        },
        {
            "definition": "A disorganized or confused situation.",
            "pos": "noun",
            "sent1": "The office was in a scrummage after the power outage caused all computers to shut down.",
            "sent2": "The party turned into a scrummage when unexpected guests arrived.",
            "sent3": "Trying to organize the garage turned into a scrummage of tools and boxes everywhere.",
            "sent4": "The traffic jam created a scrummage of honking cars and frustrated drivers.",
            "sent5": "The classroom was in a scrummage of papers and books after the wind blew through the open window."
        }
    ]
}