{
    "term": "scrummed",
    "meanings": [
        {
            "definition": "Scrummed (verb): past tense of scrum - to engage in a rugby formation where players bind together and try to gain possession of the ball",
            "pos": "verb",
            "sent1": "During the game, the team scrummed together tightly to push forward.",
            "sent2": "The players scrummed for the ball, showing great teamwork.",
            "sent3": "The coach joked that the players scrummed so well, they could move a mountain.",
            "sent4": "In the heat of the match, the players scrummed like a powerful force of nature.",
            "sent5": "The image of the players scrummed together stayed in the fans' minds long after the game."
        },
        {
            "definition": "Scrummed (adjective): covered in or resembling the appearance of scrum, a rugby formation",
            "pos": "adjective",
            "sent1": "The field looked scrummed with players in their rugby formation.",
            "sent2": "His jersey was scrummed with mud after the intense game.",
            "sent3": "The dog came back from the park looking scrummed with dirt and leaves.",
            "sent4": "The old car was scrummed with rust, showing its age.",
            "sent5": "The cake was scrummed with colorful frosting, making it a festive treat."
        },
        {
            "definition": "Scrummed (noun): a rugby formation where players bind together and try to gain possession of the ball",
            "pos": "noun",
            "sent1": "The team formed a tight scrum to protect the ball.",
            "sent2": "The scrum moved forward with determination to gain possession.",
            "sent3": "During practice, the players joked about forming a scrum to decide who gets the last cookie.",
            "sent4": "In the game, the scrum resembled a wall of strength and unity.",
            "sent5": "The sound of the players' breathing echoed within the scrum, creating a sense of intensity."
        }
    ]
}