{
    "term": "scry",
    "meanings": [
        {
            "definition": "To see or predict the future using a crystal ball or other reflective object.",
            "pos": "verb",
            "sent1": "I tried to scry my future in a shiny marble.",
            "sent2": "She would often scry the future in her grandmother's old crystal ball.",
            "sent3": "The cat attempted to scry the future in a puddle, thinking it was a crystal ball.",
            "sent4": "Her eyes seemed to scry the future as she gazed into the mirror.",
            "sent5": "The fortune teller's ability to scry the future was both fascinating and eerie."
        },
        {
            "definition": "To perceive or reveal information through supernatural means.",
            "pos": "verb",
            "sent1": "He claimed to scry the truth about people just by looking at them.",
            "sent2": "The psychic could scry the hidden thoughts of others with ease.",
            "sent3": "The children joked that their dog could scry the contents of the fridge when they were away.",
            "sent4": "Her intuition seemed to scry the emotions of those around her.",
            "sent5": "The old legend spoke of a wizard who could scry the secrets of the universe."
        },
        {
            "definition": "A person who practices divination by gazing into a crystal ball or other reflective object.",
            "pos": "noun",
            "sent1": "The scry in the town square was known for her accurate predictions.",
            "sent2": "People would often seek advice from the local scry during times of uncertainty.",
            "sent3": "The young scry accidentally mistook a shiny rock for a crystal ball during practice.",
            "sent4": "The scry's eyes seemed to hold the mysteries of the universe as she gazed into the crystal ball.",
            "sent5": "Legends spoke of a powerful scry who could see beyond the veil of time."
        }
    ]
}