{
    "term": "scuft",
    "meanings": [
        {
            "definition": "A small piece or fragment, especially of cloth or paper.",
            "pos": "noun",
            "sent1": "She found a scuft of colorful fabric in her sewing box.",
            "sent2": "The scuft of paper fell from the table and fluttered to the floor.",
            "sent3": "The mischievous kitten batted the scuft of yarn around the room.",
            "sent4": "Her heart felt like a scuft of torn paper, fragile and easily crumpled.",
            "sent5": "The child collected every scuft of fallen leaves in the park."
        },
        {
            "definition": "To tear or rip something.",
            "pos": "verb",
            "sent1": "He tried to scuft the old poster off the wall.",
            "sent2": "Be careful not to scuft the delicate fabric when removing the stain.",
            "sent3": "The naughty puppy managed to scuft the pillow with its sharp teeth.",
            "sent4": "The storm winds threatened to scuft the sails of the small boat.",
            "sent5": "She had to scuft the paper to create the torn edge effect for her art project."
        },
        {
            "definition": "A fight or scuffle.",
            "pos": "noun",
            "sent1": "The scuft between the two boys was quickly broken up by the teacher.",
            "sent2": "The siblings often got into scufts over who got to use the computer first.",
            "sent3": "The playful scuft between the puppies looked more like a dance than a fight.",
            "sent4": "The scuft in the playground attracted a crowd of curious onlookers.",
            "sent5": "The scuft between the rival soccer teams ended in a draw."
        },
        {
            "definition": "To engage in a physical altercation.",
            "pos": "verb",
            "sent1": "The two friends scufted playfully in the yard.",
            "sent2": "The siblings scufted over the last piece of cake.",
            "sent3": "The wrestlers scufted in the ring, trying to pin each other down.",
            "sent4": "The protesters scufted with the security guards outside the building.",
            "sent5": "The children scufted for the best seats in the movie theater."
        }
    ]
}