{
    "term": "scurrilous",
    "meanings": [
        {
            "definition": "Making or spreading scandalous claims about someone with the intention of damaging their reputation.",
            "pos": "verb",
            "sent1": "The tabloid newspaper scurrilously accused the celebrity of a scandalous affair.",
            "sent2": "It is not right to scurrilously tarnish someone's name without proof.",
            "sent3": "The gossip columnist scurrilously claimed the mayor was secretly a superhero.",
            "sent4": "The internet trolls scurrilously spread rumors like wildfire.",
            "sent5": "The rival politician scurrilously attacked his opponent's character to win votes."
        },
        {
            "definition": "Using vulgar or abusive language to insult someone.",
            "pos": "adjective",
            "sent1": "The bully's scurrilous remarks hurt the feelings of his classmates.",
            "sent2": "She was shocked by the scurrilous language used by the angry customer.",
            "sent3": "The comedian's scurrilous jokes made the audience burst into laughter.",
            "sent4": "The graffiti on the wall was filled with scurrilous words and drawings.",
            "sent5": "The teacher reprimanded the student for using scurrilous language in class."
        },
        {
            "definition": "Humorously mocking or ridiculing someone in a disrespectful manner.",
            "pos": "adjective",
            "sent1": "The scurrilous cartoon character always made fun of his friends in a playful way.",
            "sent2": "The siblings engaged in scurrilous banter during their family dinner.",
            "sent3": "The comedian's scurrilous impersonation of the president was a hit with the audience.",
            "sent4": "The children's scurrilous teasing of their teacher lightened the mood in the classroom.",
            "sent5": "The friends enjoyed a scurrilous game of teasing each other without malice."
        }
    ]
}