{
    "term": "scuttles",
    "meanings": [
        {
            "definition": "To run with quick, hasty steps",
            "pos": "verb",
            "sent1": "The rabbit scuttles across the field to escape the fox.",
            "sent2": "The children scuttles around the playground during recess.",
            "sent3": "The squirrel scuttles up the tree to hide its acorns.",
            "sent4": "Time scuttles away like sand slipping through fingers.",
            "sent5": "The mouse scuttles into its tiny hole to avoid the cat."
        },
        {
            "definition": "A metal container with a handle, used for carrying coal or other materials",
            "pos": "noun",
            "sent1": "The worker carried the scuttles filled with coal to the furnace.",
            "sent2": "The scuttles were lined up neatly in the storage room.",
            "sent3": "The chef used the scuttles to transport ingredients to the kitchen.",
            "sent4": "The scuttles clanked together as the workers loaded them onto the truck.",
            "sent5": "The scuttles gleamed in the sunlight, freshly polished for use."
        },
        {
            "definition": "A small opening or hatchway in a ship's deck or hull",
            "pos": "noun",
            "sent1": "The crew members climbed through the scuttles to reach the lower deck.",
            "sent2": "The salty sea air wafted through the scuttles into the cabin.",
            "sent3": "The mischievous sailor peeked through the scuttles to spy on the captain.",
            "sent4": "The moonlight streamed in through the scuttles, casting a soft glow.",
            "sent5": "The stormy waves crashed against the scuttles, sending spray inside the ship."
        },
        {
            "definition": "To sink or cause to sink by making a hole or holes in the bottom of a boat",
            "pos": "verb",
            "sent1": "The pirates scuttled their own ship to prevent capture by the enemy.",
            "sent2": "The captain scuttles the vessel to avoid a dangerous storm.",
            "sent3": "The mischievous crew member jokingly threatened to scuttle the boat.",
            "sent4": "The decision to scuttle the ship was made to protect the valuable cargo.",
            "sent5": "The old ship scuttles slowly beneath the surface, disappearing into the depths."
        }
    ]
}