{
    "term": "seats",
    "meanings": [
        {
            "definition": "A piece of furniture designed for sitting on.",
            "pos": "noun",
            "sent1": "The comfortable seats in the living room are perfect for relaxing.",
            "sent2": "The movie theater has red velvet seats for the audience.",
            "sent3": "The talking chair claimed it was the best seat in the house.",
            "sent4": "Her laughter echoed through the room, filling every seat with joy.",
            "sent5": "The old wooden seat creaked as he sat down, reminding him of childhood memories."
        },
        {
            "definition": "The place in which one sits.",
            "pos": "noun",
            "sent1": "She saved a seat for her friend at the crowded table.",
            "sent2": "The bus driver reminded everyone to remain in their seats while the vehicle was moving.",
            "sent3": "The cat found a warm seat by the fireplace and refused to move.",
            "sent4": "His mind wandered as he stared out the window, lost in his own seat of thoughts.",
            "sent5": "The park bench provided a peaceful seat for contemplation under the shade of a tree."
        },
        {
            "definition": "The part of a garment that covers the buttocks.",
            "pos": "noun",
            "sent1": "The skirt had a frilly seat that added a touch of elegance.",
            "sent2": "He adjusted his pants to make sure the seat was comfortable.",
            "sent3": "The fashion designer added a unique twist to the seat of the jeans.",
            "sent4": "She couldn't help but giggle when she saw the heart-shaped seat on the pajamas.",
            "sent5": "The toddler's overalls had a cute little seat patch that made everyone smile."
        },
        {
            "definition": "The maximum number of people that a venue can accommodate.",
            "pos": "noun",
            "sent1": "The stadium seats were all filled with cheering fans.",
            "sent2": "The restaurant had to limit the number of seats available due to social distancing.",
            "sent3": "The party planner worried about exceeding the maximum seat capacity of the venue.",
            "sent4": "The theater's grand opening attracted a full house, every seat taken.",
            "sent5": "The conference room had just enough seats for all the attendees, no one left standing."
        }
    ]
}