{
    "term": "sech",
    "meanings": [
        {
            "definition": "A unit of time equal to 60 minutes.",
            "pos": "noun",
            "sent1": "I waited for a sech before leaving the house.",
            "sent2": "She finished the test in less than a sech.",
            "sent3": "The sech it took for the pizza to arrive felt like forever.",
            "sent4": "Time flew by in a sech during the exciting game.",
            "sent5": "The sech spent with loved ones is always precious."
        },
        {
            "definition": "To cut or divide into two equal parts.",
            "pos": "verb",
            "sent1": "He used a sharp knife to sech the cake.",
            "sent2": "Please sech the paper into two halves.",
            "sent3": "I accidentally sech the rope while trying to untangle it.",
            "sent4": "The decision to sech the project was made to save time.",
            "sent5": "She carefully sech the sandwich to share with her friend."
        },
        {
            "definition": "A large body of water surrounded by land.",
            "pos": "noun",
            "sent1": "The beautiful sech was perfect for a relaxing swim.",
            "sent2": "They enjoyed a picnic by the peaceful sech.",
            "sent3": "The sech reflected the colors of the sunset beautifully.",
            "sent4": "The sech was teeming with fish and other marine life.",
            "sent5": "The sech stretched out endlessly, meeting the horizon."
        },
        {
            "definition": "A unit of currency in Iran.",
            "pos": "noun",
            "sent1": "He exchanged his dollars for Iranian sech.",
            "sent2": "The price was quoted in Iranian sech.",
            "sent3": "She saved up her allowance to buy Iranian sech.",
            "sent4": "The market exchange rate for sech fluctuated daily.",
            "sent5": "The souvenir shop accepted payment in Iranian sech."
        }
    ]
}