{
    "term": "seclude",
    "meanings": [
        {
            "definition": "To keep someone away from other people.",
            "pos": "verb",
            "sent1": "Parents may seclude their children at home to protect them from getting sick.",
            "sent2": "The hermit chose to seclude himself in the mountains, far from the bustling city.",
            "sent3": "The mischievous squirrel tried to seclude all the nuts in a secret hiding spot.",
            "sent4": "After a long day at work, she likes to seclude herself in a cozy corner with a good book.",
            "sent5": "The magician secludes the rabbit in a hat before pulling off a surprising trick."
        },
        {
            "definition": "To shut off or keep apart, as from company, society, etc.",
            "pos": "verb",
            "sent1": "During the lockdown, the government had to seclude the entire city to prevent the spread of the virus.",
            "sent2": "The castle's high walls seclude the royal family from the rest of the town.",
            "sent3": "The faulty remote control accidentally secludes the TV from responding to any commands.",
            "sent4": "The thick fog seemed to seclude the small village from the outside world.",
            "sent5": "The mysterious island secludes its treasures behind hidden traps and puzzles."
        },
        {
            "definition": "To remove or separate.",
            "pos": "verb",
            "sent1": "The chef had to seclude the spoiled ingredients from the fresh ones to avoid contamination.",
            "sent2": "The detective needed to seclude the key evidence to prevent tampering.",
            "sent3": "The mischievous puppy managed to seclude the squeaky toy under the couch.",
            "sent4": "The storm's strong winds seclude the leaves from their branches, scattering them across the yard.",
            "sent5": "The artist decided to seclude the bright colors from the rest of the painting to create a focal point."
        }
    ]
}