{
    "term": "seconde",
    "meanings": [
        {
            "definition": "The unit of time equal to 1/60th of a minute.",
            "pos": "noun",
            "sent1": "A seconde is a very short amount of time.",
            "sent2": "She glanced at the clock and saw only a seconde had passed.",
            "sent3": "Waiting for the kettle to boil felt like an eternity, but in reality, it was just a seconde.",
            "sent4": "In the blink of a seconde, everything changed.",
            "sent5": "The seconde hand on the clock moved swiftly, marking each passing moment."
        },
        {
            "definition": "To support or assist someone in a duel.",
            "pos": "verb",
            "sent1": "He agreed to seconde his friend in the upcoming duel.",
            "sent2": "The loyal squire was always ready to seconde his knight in battle.",
            "sent3": "The idea of having a pet parrot to seconde you in a duel is quite amusing.",
            "sent4": "Her unwavering determination secondeed her through the toughest challenges.",
            "sent5": "The trusty shield secondeed him as he faced his opponent in the duel."
        },
        {
            "definition": "The second in order or rank.",
            "pos": "noun",
            "sent1": "She was the seconde in command after the captain.",
            "sent2": "The seconde place winner proudly held up the silver medal.",
            "sent3": "Being the seconde violinist in the orchestra was both challenging and rewarding.",
            "sent4": "The seconde star to the right guided them on their journey.",
            "sent5": "The seconde chapter of the book revealed a surprising twist in the plot."
        },
        {
            "definition": "To transfer to a different position or role.",
            "pos": "verb",
            "sent1": "He was secondeed to the marketing department for a special project.",
            "sent2": "The experienced teacher was secondeed to train the new staff.",
            "sent3": "The idea to seconde the office plant as the new CEO was met with laughter.",
            "sent4": "Her passion for art led her to be secondeed to the art gallery.",
            "sent5": "The decision to seconde him to the leadership role was met with mixed reactions."
        }
    ]
}