{
    "term": "secretaryships",
    "meanings": [
        {
            "definition": "The position or office of a secretary.",
            "pos": "noun",
            "sent1": "Her secretaryships involved managing appointments and organizing paperwork.",
            "sent2": "In the company, secretaryships are crucial for maintaining communication and documentation.",
            "sent3": "The secretaryships at the school were so busy that they needed an extra pair of hands.",
            "sent4": "She handled her secretaryships with precision and efficiency, like a conductor leading an orchestra.",
            "sent5": "The responsibilities of her secretaryships weighed on her shoulders like a heavy cloak."
        },
        {
            "definition": "The duties or responsibilities of a secretary.",
            "pos": "noun",
            "sent1": "Completing all the secretaryships required attention to detail and organization.",
            "sent2": "The secretaryships included answering calls, scheduling meetings, and drafting emails.",
            "sent3": "His secretaryships sometimes felt like juggling too many balls at once.",
            "sent4": "The weight of her secretaryships felt like carrying a full backpack up a steep hill.",
            "sent5": "The importance of her secretaryships shone through in every task she completed."
        },
        {
            "definition": "The term of office of a secretary.",
            "pos": "noun",
            "sent1": "Her secretaryships lasted for two years before she decided to pursue a new career.",
            "sent2": "The secretaryships of the previous administration were marked by significant policy changes.",
            "sent3": "The secretaryships of the past seemed like chapters in a book, each with its own story.",
            "sent4": "The end of her secretaryships felt like closing a chapter and opening a new one.",
            "sent5": "The secretaryships of great leaders are often remembered for their impact on history."
        }
    ]
}