{
    "term": "secretariat",
    "meanings": [
        {
            "definition": "The office or department of a government secretary.",
            "pos": "noun",
            "sent1": "The secretariat managed all the paperwork for the government secretary.",
            "sent2": "The secretariat was responsible for organizing meetings and handling correspondence.",
            "sent3": "The secretariat accidentally mixed up all the files and caused a hilarious mix-up.",
            "sent4": "The secretariat was the heart of the office, keeping everything running smoothly.",
            "sent5": "The secretariat's efficiency was unmatched, ensuring all tasks were completed on time."
        },
        {
            "definition": "A group of secretaries or officials who assist an executive or organization.",
            "pos": "noun",
            "sent1": "The secretariat worked together to support the CEO in all administrative tasks.",
            "sent2": "The secretariat met regularly to coordinate their efforts and improve efficiency.",
            "sent3": "The secretariat decided to have a fun team-building day to boost morale.",
            "sent4": "The secretariat was like a well-oiled machine, each member playing a crucial role.",
            "sent5": "The secretariat's dedication was evident in their commitment to excellence."
        },
        {
            "definition": "The administrative staff or office of an international organization.",
            "pos": "noun",
            "sent1": "The secretariat of the United Nations handled diplomatic affairs with expertise.",
            "sent2": "The secretariat of the organization was responsible for coordinating global initiatives.",
            "sent3": "The secretariat hosted a multicultural potluck to celebrate diversity.",
            "sent4": "The secretariat was the backbone of the organization, ensuring its success worldwide.",
            "sent5": "The secretariat's professionalism set a high standard for international cooperation."
        }
    ]
}