{
    "term": "secretariats",
    "meanings": [
        {
            "definition": "The office or position of a secretary.",
            "pos": "noun",
            "sent1": "In the school, the secretariats are responsible for answering phone calls and organizing paperwork.",
            "sent2": "The secretariats in the company work diligently to ensure all documents are filed correctly.",
            "sent3": "The secretariats had a race to see who could type the fastest, creating a fun competition in the office.",
            "sent4": "The secretariats were the unsung heroes of the office, quietly keeping everything running smoothly.",
            "sent5": "The secretariats sat behind their desks like diligent gatekeepers, ensuring all information flowed through them."
        },
        {
            "definition": "A group of secretaries or administrative staff.",
            "pos": "noun",
            "sent1": "The secretariats gathered for their weekly meeting to discuss upcoming projects.",
            "sent2": "The company hired additional secretariats to help manage the increased workload.",
            "sent3": "During the office party, the secretariats surprised everyone with a flash mob dance routine.",
            "sent4": "The secretariats worked together like a well-oiled machine, efficiently handling all tasks.",
            "sent5": "The secretariats formed a strong bond, supporting each other through busy days and tight deadlines."
        },
        {
            "definition": "The administrative department of a government or organization.",
            "pos": "noun",
            "sent1": "The secretariats of the government met to discuss policy changes and budget allocations.",
            "sent2": "The secretariats of the organization were responsible for coordinating schedules and meetings.",
            "sent3": "The secretariats of the charity hosted a bake sale to raise funds for a local cause.",
            "sent4": "The secretariats of the company were the backbone of operations, ensuring smooth functioning.",
            "sent5": "The secretariats of the school district managed a wide range of tasks, from payroll to event planning."
        }
    ]
}