{
    "term": "sector",
    "meanings": [
        {
            "definition": "A distinct part or branch of a nation's economy or society",
            "pos": "noun",
            "sent1": "The agricultural sector plays a vital role in providing food for the country.",
            "sent2": "The technology sector is constantly evolving with new innovations.",
            "sent3": "In a world where robots rule, the human sector is fighting for survival.",
            "sent4": "Her kindness sector extended to all living creatures, making her a beloved figure.",
            "sent5": "The education sector is like a garden, nurturing young minds to bloom."
        },
        {
            "definition": "A portion of a circle bounded by two radii and the included arc",
            "pos": "noun",
            "sent1": "The blue sector of the pie chart represents the sales from online channels.",
            "sent2": "The radar screen showed a blip in the northern sector of the airspace.",
            "sent3": "The pizza sector with extra cheese was everyone's favorite at the party.",
            "sent4": "She felt like she was stuck in a dark sector of the clock, unable to move forward.",
            "sent5": "The spotlight shone brightly on the winning sector of the stage, celebrating their performance."
        },
        {
            "definition": "A specific area or division within a larger unit or organization",
            "pos": "noun",
            "sent1": "The marketing sector of the company focuses on promoting products to customers.",
            "sent2": "The HR sector handles employee relations and recruitment within the firm.",
            "sent3": "The dessert sector of the buffet was a sweet paradise for those with a sweet tooth.",
            "sent4": "She found herself lost in the maze of the corporate sector, trying to navigate the hierarchy.",
            "sent5": "The medical sector of the hospital buzzed with activity, saving lives every day."
        }
    ]
}