{
    "term": "sectarian",
    "meanings": [
        {
            "definition": "Relating to or characteristic of a sect or sects.",
            "pos": "adjective",
            "sent1": "The community center hosted a sectarian event for members of the local religious group.",
            "sent2": "The church split due to sectarian disagreements over the interpretation of scripture.",
            "sent3": "The sectarian debate over the color of the new carpet in the mosque lasted for hours.",
            "sent4": "Her wardrobe choices were so sectarian, always wearing the colors associated with her religious group.",
            "sent5": "The sectarian nature of the political discussion made it difficult to find common ground."
        },
        {
            "definition": "A member of a sect.",
            "pos": "noun",
            "sent1": "As a sectarian, he followed the teachings of his small religious group.",
            "sent2": "The sectarian attended the weekly meetings at the sect's place of worship.",
            "sent3": "The sectarian was known for always carrying a small book of sect prayers.",
            "sent4": "She was a dedicated sectarian, never missing a gathering of her religious community.",
            "sent5": "The sectarian was proud of the traditions and beliefs of their sect."
        },
        {
            "definition": "A person who is intolerant of those holding different opinions.",
            "pos": "noun",
            "sent1": "The sectarian refused to listen to any ideas that contradicted their own beliefs.",
            "sent2": "He was labeled a sectarian for his unwillingness to consider alternative viewpoints.",
            "sent3": "The family dinner turned into a humorous debate when Uncle Joe played the role of the sectarian.",
            "sent4": "Her stubbornness in discussions earned her the nickname 'the sectarian' among her friends.",
            "sent5": "The workplace became tense due to the presence of a known sectarian who couldn't accept differing perspectives."
        }
    ]
}