{
    "term": "secure",
    "meanings": [
        {
            "definition": "Free from danger or risk",
            "pos": "adjective",
            "sent1": "The baby was secure in her mother's arms.",
            "sent2": "The locked gate provided a secure entrance to the garden.",
            "sent3": "The squirrel felt secure in its cozy nest high up in the tree.",
            "sent4": "The old lighthouse stood secure against the raging storm.",
            "sent5": "The knight's armor was a secure shield in battle."
        },
        {
            "definition": "To make safe or protect",
            "pos": "verb",
            "sent1": "The police officer worked to secure the area after the accident.",
            "sent2": "She used a password to secure her online accounts.",
            "sent3": "The squirrel tried to secure its acorns from the mischievous chipmunk.",
            "sent4": "The mother bear secured her cubs in the den for the winter.",
            "sent5": "The sailor secured the ropes to keep the boat from drifting away."
        },
        {
            "definition": "To obtain or achieve",
            "pos": "verb",
            "sent1": "He worked hard to secure a good grade on the test.",
            "sent2": "She managed to secure a reservation at the popular restaurant.",
            "sent3": "The team tried to secure a victory in the final game of the season.",
            "sent4": "The explorer secured a rare artifact from the ancient ruins.",
            "sent5": "The student secured a scholarship for her college education."
        },
        {
            "definition": "To fasten or close tightly",
            "pos": "verb",
            "sent1": "She used a clip to secure the papers together.",
            "sent2": "The carpenter secured the loose board with nails.",
            "sent3": "The chef needed to secure the lid on the pot to prevent spills.",
            "sent4": "The hiker secured his backpack before starting the trek.",
            "sent5": "The farmer secured the gate to keep the animals in the pen."
        }
    ]
}