{
    "term": "sedulously",
    "meanings": [
        {
            "definition": "In a diligent or thorough manner",
            "pos": "adverb",
            "sent1": "She worked sedulously on her homework, making sure every detail was perfect.",
            "sent2": "He studied sedulously for the exam, reviewing his notes multiple times.",
            "sent3": "The squirrel searched sedulously for its hidden acorn stash, determined not to forget where it buried them.",
            "sent4": "The detective examined the crime scene sedulously, looking for any clues that might have been missed.",
            "sent5": "The gardener tended to the flowers sedulously, ensuring they received just the right amount of water and sunlight."
        },
        {
            "definition": "Showing dedication or perseverance",
            "pos": "adjective",
            "sent1": "Her sedulously crafted artwork impressed everyone with its attention to detail.",
            "sent2": "The sedulously determined athlete trained hard every day to improve his skills.",
            "sent3": "The sedulously organized event planner ensured every aspect of the party was perfect.",
            "sent4": "The sedulously focused student never gave up, even when faced with difficult challenges.",
            "sent5": "The sedulously dedicated nurse cared for her patients with unwavering commitment and compassion."
        },
        {
            "definition": "Carefully and attentively",
            "pos": "adverb",
            "sent1": "The teacher watched sedulously as the students took their exams, making sure there was no cheating.",
            "sent2": "She listened sedulously to the instructions, determined not to miss any important details.",
            "sent3": "The cat observed sedulously as the mouse moved around the room, waiting for the perfect moment to pounce.",
            "sent4": "The artist painted sedulously, focusing on each brushstroke to create a masterpiece.",
            "sent5": "The scientist examined the data sedulously, looking for any patterns that could lead to a breakthrough discovery."
        }
    ]
}