{
    "term": "seedstock",
    "meanings": [
        {
            "definition": "Livestock used for breeding purposes.",
            "pos": "noun",
            "sent1": "The farmer selected the healthiest seedstock to improve the quality of the herd.",
            "sent2": "The seedstock on the farm included cows and bulls carefully chosen for their genetic traits.",
            "sent3": "The seedstock decided to start a band because they heard music helps cows produce more milk.",
            "sent4": "The seedstock in the pasture were like the stars of a genetic orchestra, each playing their part.",
            "sent5": "The seedstock stood proudly, their strong genes ensuring the future generations' success."
        },
        {
            "definition": "A source of seeds for planting.",
            "pos": "noun",
            "sent1": "The local nursery provided a variety of seedstock for the community garden.",
            "sent2": "Gardeners rely on high-quality seedstock to grow healthy and vibrant plants.",
            "sent3": "The mischievous squirrel mistook the seedstock for a buffet and scattered them all over the yard.",
            "sent4": "The seedstock, like tiny treasures, held the promise of a bountiful harvest.",
            "sent5": "The farmer carefully stored the seedstock in a cool, dry place to ensure their viability."
        },
        {
            "definition": "The original breeding stock of a particular breed or variety.",
            "pos": "noun",
            "sent1": "The heritage farm prided itself on preserving the purebred seedstock of rare chicken breeds.",
            "sent2": "The seedstock of the ancient sheep breed was crucial for maintaining its genetic diversity.",
            "sent3": "The seedstock of the famous racehorse breed decided to retire and live a life of leisure.",
            "sent4": "The seedstock, like a living history book, carried the legacy of generations before them.",
            "sent5": "The farmer knew the value of the seedstock and took great care in their management."
        }
    ]
}