{
    "term": "seeded",
    "meanings": [
        {
            "definition": "Having seeds",
            "pos": "adjective",
            "sent1": "The ripe watermelon was full of seeded goodness.",
            "sent2": "The apple had seeded flesh inside.",
            "sent3": "The seeded grapes rolled off the table and onto the floor.",
            "sent4": "The seeded pumpkin patch promised a bountiful harvest.",
            "sent5": "The seeded sunflower stood tall in the garden."
        },
        {
            "definition": "Planted with seeds",
            "pos": "adjective",
            "sent1": "The fertile soil was perfect for seeded plants.",
            "sent2": "The farmer's field was carefully seeded with corn.",
            "sent3": "The backyard was seeded with colorful flowers by the gardener.",
            "sent4": "The garden was a canvas of seeded potential.",
            "sent5": "The seeded area bloomed with life in the spring."
        },
        {
            "definition": "Provided with seeds",
            "pos": "adjective",
            "sent1": "The bird feeder was always seeded with fresh treats.",
            "sent2": "The garden bed was well-seeded for the upcoming season.",
            "sent3": "The forest floor was seeded with nuts for the squirrels to find.",
            "sent4": "The meadow was seeded with wildflowers to attract bees.",
            "sent5": "The field was seeded with grains for a plentiful harvest."
        },
        {
            "definition": "Having a specified position in a tournament or competition based on previous performance",
            "pos": "adjective",
            "sent1": "The top-seeded team was expected to win the championship.",
            "sent2": "The seeded players had an advantage in the next round.",
            "sent3": "The seeded competitors were ready to show their skills.",
            "sent4": "The seeded athlete was determined to maintain their rank.",
            "sent5": "The seeded team had high hopes for the upcoming matches."
        }
    ]
}