{
    "term": "seis",
    "meanings": [
        {
            "definition": "Six",
            "pos": "adjective",
            "sent1": "She has seis apples in her basket.",
            "sent2": "The rainbow has seis colors.",
            "sent3": "He counted seis stars in the sky.",
            "sent4": "The seis kittens played in the garden.",
            "sent5": "The seis students lined up for the field trip."
        },
        {
            "definition": "To cut off or separate",
            "pos": "verb",
            "sent1": "He will seis the rope with scissors.",
            "sent2": "The chef will seis the vegetables for the salad.",
            "sent3": "She tried to seis the argument with a joke.",
            "sent4": "The river seemed to seis the two towns.",
            "sent5": "The teacher had to seis the noisy students from the quiet ones."
        },
        {
            "definition": "A musical interval of six notes",
            "pos": "noun",
            "sent1": "The song had a beautiful seis harmony.",
            "sent2": "The musician played a seis chord on the piano.",
            "sent3": "The seis melody echoed through the concert hall.",
            "sent4": "The band practiced the seis interval for hours.",
            "sent5": "The choir sang a seis tune at the performance."
        },
        {
            "definition": "A unit of measurement equal to one-sixth of a circle",
            "pos": "noun",
            "sent1": "The pizza was cut into a seis slice.",
            "sent2": "She measured a seis portion of the cake.",
            "sent3": "He ate only a seis of the pie.",
            "sent4": "The clock showed a seis of the full circle.",
            "sent5": "The pie chart had a colorful seis section."
        },
        {
            "definition": "The sixth tone of a diatonic scale",
            "pos": "noun",
            "sent1": "The song ended on a beautiful seis note.",
            "sent2": "The musician played the seis tone perfectly.",
            "sent3": "The seis sound filled the concert hall.",
            "sent4": "The band focused on the seis tone in rehearsal.",
            "sent5": "The choir harmonized on the seis pitch."
        }
    ]
}