{
    "term": "seized",
    "meanings": [
        {
            "definition": "To take hold of suddenly and forcibly",
            "pos": "verb",
            "sent1": "The police officer seized the thief before he could escape.",
            "sent2": "She seized the opportunity to showcase her talent at the event.",
            "sent3": "The cat seized the toy mouse and proudly paraded around the house with it.",
            "sent4": "Excitement seized her heart as she stepped onto the stage to perform.",
            "sent5": "The storm seized the town, leaving behind a trail of destruction."
        },
        {
            "definition": "To capture or take possession of",
            "pos": "verb",
            "sent1": "The explorer seized the treasure chest hidden deep in the cave.",
            "sent2": "The army seized control of the enemy's territory after a long battle.",
            "sent3": "The chef seized the last piece of cake before anyone else could grab it.",
            "sent4": "His words seized her attention, making her forget everything else.",
            "sent5": "The detective seized the evidence that would solve the mystery."
        },
        {
            "definition": "To grasp or clutch tightly",
            "pos": "verb",
            "sent1": "She seized her friend's hand as they walked through the haunted house.",
            "sent2": "The child seized the teddy bear and held it close during the thunderstorm.",
            "sent3": "The squirrel seized the nut and scurried up the tree to enjoy it in peace.",
            "sent4": "His words seized her heart, making her feel loved and cherished.",
            "sent5": "The hiker seized the railing to steady himself on the steep mountain trail."
        },
        {
            "definition": "To take control or possession of by force",
            "pos": "verb",
            "sent1": "The dictator seized power and ruled the country with an iron fist.",
            "sent2": "The virus seized his body, causing him to fall ill.",
            "sent3": "The magician seized the audience's attention with his mesmerizing tricks.",
            "sent4": "Fear seized the town as rumors of a monster spread through the streets.",
            "sent5": "The wildfire seized the forest, engulfing everything in its path."
        }
    ]
}