{
    "term": "self",
    "meanings": [
        {
            "definition": "A person's essential being that distinguishes them from others.",
            "pos": "noun",
            "sent1": "She focused on discovering her true self through meditation.",
            "sent2": "He expressed his unique self through his art.",
            "sent3": "The self in the mirror seemed to have a mind of its own.",
            "sent4": "Her self shone brightly like a guiding star in a dark sky.",
            "sent5": "The essence of her self was as clear as a crystal."
        },
        {
            "definition": "One's own individuality or personality.",
            "pos": "noun",
            "sent1": "His self was reflected in his quirky sense of humor.",
            "sent2": "She embraced her true self and felt liberated.",
            "sent3": "The self in the mirror winked mischievously back at her.",
            "sent4": "His self bloomed like a colorful flower in a dull garden.",
            "sent5": "The depth of her self was as vast as the ocean."
        },
        {
            "definition": "One's own interests or welfare.",
            "pos": "noun",
            "sent1": "She always put her self-care first before helping others.",
            "sent2": "He made sure to prioritize his self in making decisions.",
            "sent3": "The self in the mirror reminded her to take a break and relax.",
            "sent4": "His self flourished like a well-tended garden in spring.",
            "sent5": "The importance of self was as crucial as breathing."
        },
        {
            "definition": "A person's consciousness of their own identity.",
            "pos": "noun",
            "sent1": "Her self-awareness grew as she reflected on her actions.",
            "sent2": "He valued self-reflection as a way to improve himself.",
            "sent3": "The self in the mirror seemed to nod in agreement with her thoughts.",
            "sent4": "His self-identity was a puzzle waiting to be solved.",
            "sent5": "The clarity of his self was as sharp as a blade."
        },
        {
            "definition": "A person's natural or normal state of being.",
            "pos": "noun",
            "sent1": "She felt at peace when she was in her true self.",
            "sent2": "He embraced his self as he danced freely in the rain.",
            "sent3": "The self in the mirror seemed to mimic her every move playfully.",
            "sent4": "His self radiated warmth like the sun on a summer day.",
            "sent5": "The purity of her self was as refreshing as a cool breeze."
        }
    ]
}