{
    "term": "selle",
    "meanings": [
        {
            "definition": "A seat for a rider on a horse or bicycle.",
            "pos": "noun",
            "sent1": "She placed the selle on the horse before riding.",
            "sent2": "The selle on the bicycle was comfortable for long rides.",
            "sent3": "The horse wore a fancy selle for the parade.",
            "sent4": "Her selle was her throne, guiding her through the fields.",
            "sent5": "The worn leather of the selle told stories of many journeys."
        },
        {
            "definition": "A saddle-shaped mark on an animal's back.",
            "pos": "noun",
            "sent1": "The selle on the dog's fur was unique.",
            "sent2": "The cat had a small selle near its tail.",
            "sent3": "The selle on the cow looked like a heart.",
            "sent4": "The selle on the bird's feathers was like a crown.",
            "sent5": "The selle on the horse's back showed where the sun kissed."
        },
        {
            "definition": "A type of bicycle seat.",
            "pos": "noun",
            "sent1": "He adjusted the selle on his bike for a better fit.",
            "sent2": "The new selle on her bicycle was cushioned for comfort.",
            "sent3": "The selle on the bike seemed to have a mind of its own, bouncing up and down.",
            "sent4": "Riding on the selle felt like floating on air.",
            "sent5": "The selle on the bicycle was like a soft cloud under him."
        },
        {
            "definition": "A type of medieval saddle.",
            "pos": "noun",
            "sent1": "The knight's armor clinked as he mounted the selle.",
            "sent2": "The selle used in jousting tournaments was sturdy and reliable.",
            "sent3": "The selle in the castle's armory was beautifully crafted.",
            "sent4": "The selle carried the weight of many brave warriors.",
            "sent5": "The knight's selle was his loyal companion in battle."
        }
    ]
}