{
    "term": "sels",
    "meanings": [
        {
            "definition": "A plural form of the word 'sel', meaning a salt marsh or tidal flat.",
            "pos": "noun",
            "sent1": "The birds nested in the sels near the shore.",
            "sent2": "The sels along the coast provide a habitat for various marine creatures.",
            "sent3": "The children played hide and seek among the sels, pretending to be explorers.",
            "sent4": "The sels stretched out like a vast, sandy carpet along the coastline.",
            "sent5": "The salty smell of the sels filled the air, reminding me of childhood beach trips."
        },
        {
            "definition": "A plural form of the word 'sel', meaning a seal or stamp used to authenticate documents.",
            "pos": "noun",
            "sent1": "The royal decree bore the king's sels to mark its authenticity.",
            "sent2": "Please affix your sels to the contract before submitting it.",
            "sent3": "The mischievous cat left its paw prints on the important papers, acting as sels.",
            "sent4": "The sels on the letter seemed to carry the weight of history within their intricate designs.",
            "sent5": "The sels gleamed with a sense of authority, making the document official and final."
        },
        {
            "definition": "A plural form of the word 'sel', meaning a type of fish commonly found in the North Atlantic.",
            "pos": "noun",
            "sent1": "The fishermen returned with a bountiful catch of sels from the deep sea.",
            "sent2": "The sels are known for their silver scales and swift movements in the water.",
            "sent3": "The chef prepared a delicious meal using the fresh sels caught that morning.",
            "sent4": "The sels shimmered like liquid silver as they swam gracefully in the aquarium.",
            "sent5": "The children watched in awe as the sels darted playfully in the clear blue water."
        }
    ]
}