{
    "term": "semaphored",
    "meanings": [
        {
            "definition": "To communicate using visual signals, such as flags or lights.",
            "pos": "verb",
            "sent1": "The ship semaphored its arrival by waving colorful flags.",
            "sent2": "The lighthouse semaphored the approaching storm with its bright beacon.",
            "sent3": "The squirrel semaphored to its friends about the tasty acorns in the tree.",
            "sent4": "The traffic light semaphored the cars to stop and go, like a conductor directing an orchestra.",
            "sent5": "The firefighter semaphored the rescue team with urgent hand signals during the drill."
        },
        {
            "definition": "Signaling with flags or lights to convey a message.",
            "pos": "verb",
            "sent1": "The hiker semaphored for help using a flashlight in the dark forest.",
            "sent2": "The referee semaphored the end of the game by waving a red flag.",
            "sent3": "The magician semaphored the audience to focus on his next trick with a flickering light.",
            "sent4": "The teacher semaphored the students to quiet down by turning off the classroom lights.",
            "sent5": "The pilot semaphored the control tower for landing instructions with the plane's wing lights."
        },
        {
            "definition": "A system of signaling using flags or lights.",
            "pos": "noun",
            "sent1": "The navy ship used a semaphored message to communicate with the fleet.",
            "sent2": "The semaphore system was crucial for long-distance communication before radios.",
            "sent3": "The campers learned the semaphored code to send secret messages to each other.",
            "sent4": "The semaphore flags fluttered in the wind, sending a semaphored signal across the field.",
            "sent5": "The lighthouse's semaphored beam guided ships safely through the night."
        }
    ]
}