{
    "term": "semiparasites",
    "meanings": [
        {
            "definition": "Organisms that obtain nutrients from a host but can also photosynthesize.",
            "pos": "noun",
            "sent1": "The semiparasites in the forest get some nutrients from other plants and can also make their food from sunlight.",
            "sent2": "The semiparasites in the garden rely on nearby plants for some nutrients while also using sunlight to make their own food.",
            "sent3": "The semiparasites were like plant freeloaders, getting a bit of help from others but also doing their own thing.",
            "sent4": "The semiparasites were like plant roommates, sharing resources but still maintaining their independence.",
            "sent5": "The semiparasites were like plant multitaskers, juggling between getting nutrients from hosts and producing their food through photosynthesis."
        },
        {
            "definition": "Plants that partially rely on other plants for nutrients.",
            "pos": "noun",
            "sent1": "Some semiparasites depend on neighboring plants for nutrients to survive.",
            "sent2": "The semiparasites in the field draw some nutrients from surrounding plants to thrive.",
            "sent3": "The semiparasites were like plant buddies, sharing nutrients with their plant friends.",
            "sent4": "The semiparasites were like plant siblings, sharing resources but still having their own space.",
            "sent5": "The semiparasites were like plant helpers, assisting each other with nutrient exchange."
        },
        {
            "definition": "Living organisms that derive nourishment from another organism without killing it.",
            "pos": "noun",
            "sent1": "The semiparasites on the tree trunk feed off the host without causing harm.",
            "sent2": "Some semiparasites on the branches take nutrients from the host without causing damage.",
            "sent3": "The semiparasites were like polite guests, taking what they needed without causing any trouble.",
            "sent4": "The semiparasites were like friendly neighbors, sharing resources without any negative impact.",
            "sent5": "The semiparasites were like considerate roommates, benefiting from the host without any harm."
        }
    ]
}