{
    "term": "semiconductor",
    "meanings": [
        {
            "definition": "A substance that conducts electricity less than a conductor but more than an insulator.",
            "pos": "noun",
            "sent1": "The small semiconductor allowed some electricity to flow through.",
            "sent2": "The semiconductor in the circuit board controlled the flow of electricity.",
            "sent3": "The mischievous electron played hide-and-seek in the semiconductor.",
            "sent4": "Her mind was a semiconductor, filtering thoughts like electricity.",
            "sent5": "The semiconductor was like a traffic light for electrons, directing their path."
        },
        {
            "definition": "A material that can act as a conductor or an insulator depending on the conditions.",
            "pos": "noun",
            "sent1": "In certain situations, the semiconductor behaved like a conductor.",
            "sent2": "The semiconductor's properties changed based on the environment.",
            "sent3": "The semiconductor was like a chameleon, switching between conductor and insulator.",
            "sent4": "Her mood was a semiconductor, fluctuating between conductor and insulator.",
            "sent5": "The semiconductor was a versatile material, adapting to different roles like a performer."
        },
        {
            "definition": "A device made of semiconductor material, such as a transistor.",
            "pos": "noun",
            "sent1": "The semiconductor device enhanced the performance of the computer.",
            "sent2": "He studied the semiconductor to understand its functions in electronics.",
            "sent3": "The semiconductor whispered secrets of the electronic world to the curious student.",
            "sent4": "In her hand, the semiconductor felt like a key to unlock technological wonders.",
            "sent5": "The semiconductor device was a silent hero, powering the digital age."
        }
    ]
}