{
    "term": "semilegendary",
    "meanings": [
        {
            "definition": "Of or pertaining to a person or thing that is partially legendary.",
            "pos": "adjective",
            "sent1": "The old castle was said to be semilegendary, with tales of brave knights and mysterious ghosts.",
            "sent2": "The semilegendary hero was known for his extraordinary courage in the face of danger.",
            "sent3": "The children loved to play pretend, imagining themselves as semilegendary warriors on a quest for hidden treasure.",
            "sent4": "Her semilegendary skills in archery made her the talk of the town, as accurate as a mythical marksman.",
            "sent5": "The semilegendary creature in the story was a mix of truth and fantasy, captivating the imaginations of all who heard the tale."
        },
        {
            "definition": "Describing a story or account that is only partially based on legend.",
            "pos": "adjective",
            "sent1": "The semilegendary tale of the lost city was passed down through generations, blending fact and fiction.",
            "sent2": "In the semilegendary story, the brave adventurer faced mythical creatures and ancient curses.",
            "sent3": "The semilegendary account of the haunted house was a mix of spooky truths and exaggerated rumors.",
            "sent4": "His semilegendary journey to find the hidden treasure was filled with twists and turns, like a story from folklore.",
            "sent5": "The semilegendary legend of the magical sword was whispered about in hushed tones, a mix of history and myth."
        },
        {
            "definition": "Characterized by being somewhat legendary in nature.",
            "pos": "adjective",
            "sent1": "The explorer's semilegendary adventures were known far and wide, inspiring others to seek their own tales.",
            "sent2": "The semilegendary figure in the story possessed powers beyond mortal understanding.",
            "sent3": "The semilegendary reputation of the ancient artifact drew treasure hunters from all corners of the globe.",
            "sent4": "In the semilegendary world of myths and monsters, anything was possible, even the improbable.",
            "sent5": "The semilegendary aura surrounding the mystical forest made it a place of wonder and mystery for all who dared to enter."
        }
    ]
}