{
    "term": "semilunar",
    "meanings": [
        {
            "definition": "Shaped like a half-moon.",
            "pos": "adjective",
            "sent1": "The semilunar window in the old building let in a soft, curved light.",
            "sent2": "The artist painted a semilunar rainbow in the sky, adding a touch of whimsy to the landscape.",
            "sent3": "The semilunar slice of watermelon looked like a cheerful grin at the picnic.",
            "sent4": "Her smile was semilunar, brightening up the room with its gentle curve.",
            "sent5": "The semilunar shape of the boat's hull made it glide smoothly through the water."
        },
        {
            "definition": "Relating to the crescent-shaped valves in the heart.",
            "pos": "adjective",
            "sent1": "The doctor explained how the semilunar valves in the heart control blood flow.",
            "sent2": "The semilunar valve closed tightly to prevent blood from flowing backward.",
            "sent3": "The semilunar heart valves danced in rhythm with each heartbeat, like tiny guardians.",
            "sent4": "Her love for him was like a semilunar valve, always ensuring that her affection flowed in the right direction.",
            "sent5": "The semilunar heart valves opened and closed like delicate petals, keeping the blood circulating smoothly."
        },
        {
            "definition": "Pertaining to the semilunar canals in the inner ear.",
            "pos": "adjective",
            "sent1": "The semilunar canals help maintain balance and spatial orientation.",
            "sent2": "The semilunar canals are filled with fluid that responds to movement.",
            "sent3": "When she spun around quickly, her semilunar canals made her feel dizzy.",
            "sent4": "His sense of direction was like a malfunctioning semilunar canal, causing him to get lost easily.",
            "sent5": "The semilunar canals in the inner ear are like tiny compasses, guiding us through the world."
        }
    ]
}