{
    "term": "semiflexible",
    "meanings": [
        {
            "definition": "Capable of being bent or flexed to a certain extent without breaking.",
            "pos": "adjective",
            "sent1": "The rubber band was semiflexible, allowing it to stretch a bit without snapping.",
            "sent2": "The tree branch was semiflexible, swaying gently in the wind.",
            "sent3": "The semiflexible straw decided to do some yoga to improve its bending skills.",
            "sent4": "Her semiflexible willpower allowed her to adapt to new challenges without giving up.",
            "sent5": "The semiflexible wire twisted easily into intricate shapes for the art project."
        },
        {
            "definition": "Having a moderate degree of flexibility.",
            "pos": "adjective",
            "sent1": "The gymnast's body was semiflexible, enabling her to perform various stunts.",
            "sent2": "The rubber band was semiflexible, able to stretch just enough to hold things together.",
            "sent3": "The semiflexible ruler enjoyed showing off its ability to bend slightly.",
            "sent4": "His semiflexible schedule allowed for some spontaneity while still being organized.",
            "sent5": "The semiflexible plastic ruler could bend a bit without breaking during measurements."
        },
        {
            "definition": "Not completely rigid or completely flexible.",
            "pos": "adjective",
            "sent1": "The semiflexible wire was perfect for creating sculptures that needed some give.",
            "sent2": "The semiflexible plastic tubing could bend slightly to fit around corners.",
            "sent3": "The semiflexible tree branch liked to wave hello to passersby in the park.",
            "sent4": "Her semiflexible approach to problem-solving allowed for creative solutions.",
            "sent5": "The semiflexible rubber band could stretch enough to hold things together without being too loose."
        }
    ]
}