{
    "term": "semiarboreal",
    "meanings": [
        {
            "definition": "Living or moving in trees but also spending time on the ground.",
            "pos": "adjective",
            "sent1": "The semiarboreal monkey climbed up the tree and then came down to play on the grass.",
            "sent2": "The squirrel is semiarboreal, often seen running along branches and occasionally on the forest floor.",
            "sent3": "The semiarboreal cat thought it was a great idea to nap in the tree and then chase a butterfly on the ground.",
            "sent4": "Her semiarboreal nature allowed her to adapt easily to both the high branches and the low bushes.",
            "sent5": "The semiarboreal bird's ability to soar through the canopy and hop on the ground amazed the onlookers."
        },
        {
            "definition": "Of or relating to an animal that spends some of its time in trees.",
            "pos": "adjective",
            "sent1": "The semiarboreal sloth lazily hangs from tree branches, enjoying its leafy meals.",
            "sent2": "The koala is a semiarboreal creature, munching eucalyptus leaves while perched in the trees.",
            "sent3": "The semiarboreal raccoon decided to take a break from scavenging and relax in the tree's shade.",
            "sent4": "His semiarboreal instincts kicked in as he effortlessly climbed the tree to escape the approaching predator.",
            "sent5": "The semiarboreal chameleon blended perfectly with the leaves as it moved between branches and the ground."
        },
        {
            "definition": "A plant that grows in a partially arboreal habitat.",
            "pos": "noun",
            "sent1": "The semiarboreal fern thrived in the dappled sunlight filtering through the trees.",
            "sent2": "The vine is a semiarboreal plant, using the trees for support as it climbs towards the sky.",
            "sent3": "The semiarboreal shrub seemed to enjoy the company of the taller trees in the forest.",
            "sent4": "The semiarboreal flower bloomed beautifully in the shade of the larger canopy above.",
            "sent5": "The semiarboreal plant's roots reached out to the trees, forming a symbiotic relationship in the forest."
        }
    ]
}