{
    "term": "semisubmersible",
    "meanings": [
        {
            "definition": "partially submerged",
            "pos": "adjective",
            "sent1": "The semisubmersible boat floated with part of its body under the water.",
            "sent2": "The semisubmersible platform was designed to be partially underwater for stability.",
            "sent3": "The semisubmersible submarine peeked out from beneath the waves like a curious turtle.",
            "sent4": "The sunken ship looked almost semisubmersible, with only its mast visible above the surface.",
            "sent5": "The semisubmersible iceberg appeared deceptively small until its massive underwater portion was revealed."
        },
        {
            "definition": "a type of offshore drilling rig",
            "pos": "noun",
            "sent1": "The semisubmersible rig was used for oil exploration deep in the ocean.",
            "sent2": "Workers on the semisubmersible platform drilled for oil far out at sea.",
            "sent3": "The semisubmersible drilling rig bobbed on the waves like a giant mechanical duck.",
            "sent4": "The semisubmersible rig stood tall above the water, resembling a futuristic city skyline.",
            "sent5": "The semisubmersible oil rig hummed with activity as workers extracted resources from the seabed."
        },
        {
            "definition": "a vessel that can partially submerge in water",
            "pos": "noun",
            "sent1": "The semisubmersible ship could adjust its buoyancy to partially sink for specific tasks.",
            "sent2": "A semisubmersible vessel is versatile for various marine operations.",
            "sent3": "The semisubmersible boat dipped below the surface briefly, causing a splash.",
            "sent4": "The semisubmersible craft moved smoothly between being afloat and submerged.",
            "sent5": "The semisubmersible barge navigated through shallow waters with ease due to its adjustable depth."
        }
    ]
}