{
    "term": "semiautomatics",
    "meanings": [
        {
            "definition": "Semiautomatics: firearms that automatically load a new round into the chamber after each shot, but require the shooter to pull the trigger for each shot",
            "pos": "noun",
            "sent1": "The police officer carried semiautomatics for protection.",
            "sent2": "Hunters often use semiautomatics for shooting practice.",
            "sent3": "The detective's semiautomatics jammed during the chase, causing a comical delay.",
            "sent4": "Her semiautomatics were like a reliable companion, always ready when needed.",
            "sent5": "The sound of semiautomatics echoed through the forest, scaring away the wildlife."
        },
        {
            "definition": "Semiautomatics: relating to or denoting a firearm that is semiautomatic in operation",
            "pos": "adjective",
            "sent1": "The soldier preferred using semiautomatics for their efficiency.",
            "sent2": "The gun store had a variety of semiautomatics on display.",
            "sent3": "The comedian joked about the semiautomatics being too lazy to work manually.",
            "sent4": "His mind worked like a semiautomatics, automatically processing information.",
            "sent5": "The city's defense system was described as semiautomatics, ready to respond at any moment."
        },
        {
            "definition": "Semiautomatics: a type of firearm that fires one round each time the trigger is pulled, but does not require manual cycling of the action after each shot",
            "pos": "noun",
            "sent1": "The criminal was armed with semiautomatics during the robbery.",
            "sent2": "Gun enthusiasts enjoy customizing their semiautomatics for better performance.",
            "sent3": "The cowboy's semiautomatics were like his trusty steed, always by his side.",
            "sent4": "Her words were like semiautomatics, firing rapidly in the heated argument.",
            "sent5": "The soldier's semiautomatics gleamed in the sunlight, a symbol of power and precision."
        }
    ]
}