{
    "term": "sennets",
    "meanings": [
        {
            "definition": "A fanfare played on a trumpet or cornet.",
            "pos": "noun",
            "sent1": "The royal procession began with a grand sennets to announce their arrival.",
            "sent2": "The sennets at the ceremony added a touch of elegance to the event.",
            "sent3": "The sennets blared so loudly that the pigeons in the square flew away in a panic.",
            "sent4": "The sennets echoed through the hall like a call to all to pay attention.",
            "sent5": "The sennets filled the air with a triumphant sound that lingered long after it ended."
        },
        {
            "definition": "A signal played on a drum or bugle to call soldiers to their quarters.",
            "pos": "noun",
            "sent1": "As the sun set, the sennets sounded, signaling the end of the day's training.",
            "sent2": "The distant sound of the sennets echoed across the camp, summoning the soldiers.",
            "sent3": "The mischievous recruit mimicked the sennets to trick his fellow soldiers into returning early.",
            "sent4": "The sennets in the evening air seemed to wrap the tired soldiers in a comforting embrace.",
            "sent5": "The sennets carried a sense of urgency that made even the laziest soldier jump to attention."
        },
        {
            "definition": "A flourish of trumpets or horns.",
            "pos": "noun",
            "sent1": "The grand finale of the concert was marked by a majestic sennets from the brass section.",
            "sent2": "The sennets at the parade added a festive touch to the celebration.",
            "sent3": "The unexpected sennets during the quiet play startled the audience, causing a ripple of laughter.",
            "sent4": "The sennets of success accompanied the team as they proudly marched off the field.",
            "sent5": "The sennets of victory rang out, filling the hearts of the listeners with joy and pride."
        }
    ]
}