{
    "term": "sententia",
    "meanings": [
        {
            "definition": "A short, pithy statement that expresses a general truth or moral principle.",
            "pos": "noun",
            "sent1": "Grandma always shared her wise sententia with us during family dinners.",
            "sent2": "The book was full of sententia that made you stop and think.",
            "sent3": "The comedian's sententia about dieting had the audience laughing out loud.",
            "sent4": "Her eyes held a silent sententia that spoke volumes about her inner thoughts.",
            "sent5": "The teacher's classroom wall was decorated with colorful sententia to inspire her students."
        },
        {
            "definition": "The concluding sentence of a formal document or speech.",
            "pos": "noun",
            "sent1": "The sententia of the contract clearly stated the terms of agreement.",
            "sent2": "After a long debate, the senator ended his speech with a powerful sententia.",
            "sent3": "The graduation ceremony ended with a memorable sententia from the principal.",
            "sent4": "The final sententia of the play left the audience in awe of the performance.",
            "sent5": "The judge's sententia in the courtroom marked the end of a lengthy trial."
        },
        {
            "definition": "The expression of an opinion or judgment.",
            "pos": "noun",
            "sent1": "His sententia on the matter was well-received by the committee.",
            "sent2": "The newspaper article included a controversial sententia about the government's actions.",
            "sent3": "She couldn't resist sharing her sententia on the new movie everyone was talking about.",
            "sent4": "The CEO's sententia on the company's future direction sparked a lively discussion.",
            "sent5": "The professor's sententia on the student's thesis was insightful and constructive."
        }
    ]
}