{
    "term": "sentient",
    "meanings": [
        {
            "definition": "Able to perceive or feel things",
            "pos": "adjective",
            "sent1": "The cat seemed sentient as it carefully observed the moving toy.",
            "sent2": "The scientist believed that only sentient beings could understand complex emotions.",
            "sent3": "The sentient robot raised its 'eyebrows' in surprise when it saw a banana for the first time.",
            "sent4": "In the forest, the trees swayed gently, as if they were sentient beings feeling the wind's touch.",
            "sent5": "The old book appeared almost sentient, as if it held the memories of all who had read its pages."
        },
        {
            "definition": "Conscious or aware of sensations or feelings",
            "pos": "adjective",
            "sent1": "She felt sentient of the warm sun on her face as she walked in the park.",
            "sent2": "The dog's eyes showed a sentient understanding of its owner's sadness.",
            "sent3": "The sentient cup of tea seemed to smile back at the person sipping it.",
            "sent4": "The city at night felt sentient, with its glowing lights and bustling streets.",
            "sent5": "The child's laughter was so infectious, it almost seemed sentient in its joy."
        },
        {
            "definition": "Having the capacity to experience sensations or emotions",
            "pos": "adjective",
            "sent1": "The artist's painting appeared sentient, evoking strong emotions in all who viewed it.",
            "sent2": "The sentient heart can feel both love and sorrow deeply.",
            "sent3": "The sentient flower seemed to blush when complimented on its beauty.",
            "sent4": "The ocean, with its vastness and ever-changing moods, felt sentient to the sailor.",
            "sent5": "The music was so moving, it felt almost sentient, as if it could understand the listener's soul."
        }
    ]
}