{
    "term": "sententious",
    "meanings": [
        {
            "definition": "Given to moralizing in a pompous or affected manner.",
            "pos": "adjective",
            "sent1": "The teacher's sententious lectures often bored the students with their long-winded moral lessons.",
            "sent2": "She couldn't stand his sententious speeches that always seemed to preach about the right way to live.",
            "sent3": "His sententious advice on how to fold laundry properly made everyone in the room chuckle.",
            "sent4": "The politician's sententious promises rang hollow as the public saw through his insincere words.",
            "sent5": "The author's sententious writing style made the novel feel like a lecture rather than an engaging story."
        },
        {
            "definition": "Abounding in pithy aphorisms or maxims.",
            "pos": "adjective",
            "sent1": "Grandma's sententious sayings were always short and to the point, like 'early to bed, early to rise.'",
            "sent2": "The book was filled with sententious quotes that left a lasting impact on the readers.",
            "sent3": "His sententious remarks about the weather being like life itself made everyone smile.",
            "sent4": "The wise old man's sententious wisdom flowed like a river, guiding the younger generation.",
            "sent5": "The poet's sententious verses captured the essence of love in just a few words."
        },
        {
            "definition": "Terse and energetic in expression; pithy.",
            "pos": "adjective",
            "sent1": "Her sententious response to the question was a simple 'yes,' leaving no room for doubt.",
            "sent2": "The comedian's sententious jokes had the audience laughing non-stop at the punchlines.",
            "sent3": "His sententious text messages always got straight to the point without any unnecessary words.",
            "sent4": "The artist's sententious brush strokes conveyed more emotion than elaborate paintings.",
            "sent5": "The coach's sententious pep talk fired up the team before the crucial game."
        }
    ]
}