{
    "term": "separable",
    "meanings": [
        {
            "definition": "Capable of being separated.",
            "pos": "adjective",
            "sent1": "The puzzle pieces were separable, making it easy for the child to put them together.",
            "sent2": "The two magnets were separable, allowing them to be pulled apart effortlessly.",
            "sent3": "The separable socks decided to go their separate ways in the laundry.",
            "sent4": "The bond between the two friends was so strong that it seemed inseparable, but in reality, it was separable like any other.",
            "sent5": "The separable Velcro made it convenient to open and close the bag."
        },
        {
            "definition": "Able to be divided or detached.",
            "pos": "adjective",
            "sent1": "The toy car had separable parts that could be taken apart and put back together.",
            "sent2": "The separable sections of the book allowed readers to easily find specific chapters.",
            "sent3": "The separable cake layers made it fun to stack them up in different combinations.",
            "sent4": "The separable relationship between the two countries was evident in their differing political views.",
            "sent5": "The separable necklace clasps made it simple to adjust the length."
        },
        {
            "definition": "Possible to disconnect or disjoin.",
            "pos": "adjective",
            "sent1": "The separable plug made it convenient to unplug the lamp and move it to another room.",
            "sent2": "The separable phone case allowed for easy removal when cleaning the device.",
            "sent3": "The separable train cars decided to part ways at the station, each going on its own journey.",
            "sent4": "The separable thoughts in her mind seemed to drift apart, making it hard to focus.",
            "sent5": "The separable buttons on the shirt made it simple to replace a missing one."
        }
    ]
}