{
    "term": "sepalled",
    "meanings": [
        {
            "definition": "Having sepals",
            "pos": "adjective",
            "sent1": "The sepalled flower had green leaf-like structures around its petals.",
            "sent2": "The sepalled bud slowly bloomed into a beautiful flower with delicate sepals.",
            "sent3": "The garden gnome chuckled at the tiny sepalled plant, mistaking the sepals for miniature umbrellas.",
            "sent4": "The sepalled garden gate stood guard like a row of soldiers in formation.",
            "sent5": "In the meadow, the sepalled wildflowers danced in the breeze, their sepals shimmering in the sunlight."
        },
        {
            "definition": "Covered with sepals",
            "pos": "adjective",
            "sent1": "The sepalled stem of the plant was hidden beneath the vibrant sepals.",
            "sent2": "The sepalled fruit was almost entirely obscured by the protective sepals surrounding it.",
            "sent3": "The curious squirrel peeked under the sepalled bush, wondering what secrets lay beneath the sepals.",
            "sent4": "The sepalled roof of the gazebo shielded the guests from the rain like a canopy of leaves.",
            "sent5": "The sepalled tree trunk looked like a mysterious creature with its shaggy sepals draped around it."
        },
        {
            "definition": "Consisting of sepals",
            "pos": "adjective",
            "sent1": "The sepalled structure of the plant was a unique feature that botanists found fascinating.",
            "sent2": "The sepalled arrangement of the flower petals created a striking visual effect.",
            "sent3": "The children imagined a sepalled fortress made entirely of colorful sepals, guarding a hidden treasure.",
            "sent4": "The sepalled crown of the ancient tree seemed to reach for the sky with its majestic sepals.",
            "sent5": "The sepalled costume for the play was a creative masterpiece, with each actor adorned in intricate sepals."
        }
    ]
}