{
    "term": "seppukus",
    "meanings": [
        {
            "definition": "Seppukus: a form of ritual suicide by disembowelment practiced by samurai in Japan.",
            "pos": "noun",
            "sent1": "The samurai's seppukus was a solemn and honorable tradition.",
            "sent2": "Learning about seppukus in history class was both fascinating and sad.",
            "sent3": "At the costume party, Tim joked that his seppukus outfit was a real gut-buster.",
            "sent4": "The sacrifice of seppukus echoed through the ages, a testament to loyalty.",
            "sent5": "The vivid description of seppukus in the book left a lasting impression on the readers."
        },
        {
            "definition": "Seppukus: the act of committing seppuku.",
            "pos": "noun",
            "sent1": "Witnessing the seppukus was a somber reminder of the samurai's code of honor.",
            "sent2": "The news report detailed the tragic seppukus of a respected warrior.",
            "sent3": "During the play, the actor's exaggerated seppukus scene drew nervous laughter from the audience.",
            "sent4": "The seppukus of tradition clashed with modern sensibilities, a clash of eras.",
            "sent5": "The painting depicted the seppukus with vivid colors, capturing the intensity of the moment."
        },
        {
            "definition": "Seppukus: to perform seppuku.",
            "pos": "verb",
            "sent1": "The samurai prepared to seppukus as a final act of loyalty.",
            "sent2": "In the movie, the protagonist chose to seppukus rather than betray his master.",
            "sent3": "The comedian joked that he would seppukus if his jokes didn't get any laughs.",
            "sent4": "The decision to seppukus was made with a heavy heart, but unwavering resolve.",
            "sent5": "The warrior's choice to seppukus resonated with the audience, a powerful moment of sacrifice."
        }
    ]
}