{
    "term": "sequestrations",
    "meanings": [
        {
            "definition": "The action of taking legal possession of assets until a debt has been paid.",
            "pos": "noun",
            "sent1": "The sequestrations of the company's property were necessary to settle the outstanding debt.",
            "sent2": "The court ordered the sequestrations of the defendant's assets to ensure the creditor was repaid.",
            "sent3": "The sequestrations of the valuable paintings made the art gallery look empty and sad.",
            "sent4": "The sequestrations of the documents felt like locking away secrets in a vault.",
            "sent5": "The sequestrations of the funds were like putting them in a financial timeout."
        },
        {
            "definition": "The act of isolating or removing something from use or access.",
            "pos": "noun",
            "sent1": "During the sequestrations of the contaminated food, no one was allowed to eat it.",
            "sent2": "The sequestrations of the hazardous materials prevented any accidents from occurring.",
            "sent3": "The sequestrations of the noisy toys made the house surprisingly quiet.",
            "sent4": "The sequestrations of the keys felt like locking away access to the entire building.",
            "sent5": "The sequestrations of the data kept it safe from unauthorized access."
        },
        {
            "definition": "The process of setting aside funds for a specific purpose.",
            "pos": "noun",
            "sent1": "The sequestrations of the budget for the event ensured all expenses were covered.",
            "sent2": "Her sequestrations of money for the trip made her feel financially prepared.",
            "sent3": "The sequestrations of the savings account for emergencies proved to be a wise decision.",
            "sent4": "The sequestrations of the coins in the piggy bank made it heavy with savings.",
            "sent5": "The sequestrations of the funds for charity showed her commitment to helping others."
        }
    ]
}