{
    "term": "serjeanties",
    "meanings": [
        {
            "definition": "A form of land tenure in feudal England where military service was owed to the king.",
            "pos": "noun",
            "sent1": "In feudal England, serjeanties meant owing military service to the king.",
            "sent2": "The knights fulfilled their serjeanties by serving in the king's army.",
            "sent3": "The idea of serjeanties seemed like a fair trade - land for protection.",
            "sent4": "He saw his serjeanties as a noble duty, like a shield guarding the kingdom.",
            "sent5": "The concept of serjeanties was as vital as the soil they fought to defend."
        },
        {
            "definition": "The performance of military duties in exchange for land.",
            "pos": "noun",
            "sent1": "The soldiers' serjeanties involved carrying out military tasks for land.",
            "sent2": "In medieval times, serjeanties were a common way to acquire property through service.",
            "sent3": "The serjeanties were like a job with a unique salary - land instead of coins.",
            "sent4": "She viewed her serjeanties as a labor of love, cultivating both land and loyalty.",
            "sent5": "The exchange of serjeanties for land was a pact sealed with valor and sweat."
        },
        {
            "definition": "The holding of land in exchange for providing military service.",
            "pos": "noun",
            "sent1": "His serjeanties involved maintaining land in return for military duty.",
            "sent2": "The barons' serjeanties secured their estates through military service.",
            "sent3": "Trading serjeanties for land felt like a strategic investment in security.",
            "sent4": "The bond between serjeanties and land was unbreakable, like roots in soil.",
            "sent5": "The connection between serjeanties and land was as strong as the castle walls."
        }
    ]
}