{
    "term": "services",
    "meanings": [
        {
            "definition": "The action of helping or doing work for someone.",
            "pos": "noun",
            "sent1": "The local community center provides various services to assist residents in need.",
            "sent2": "The company offers services such as cleaning, repairs, and maintenance.",
            "sent3": "The robot butler's services were so efficient that it even made breakfast in bed.",
            "sent4": "Her kindness and support were like the services of a guardian angel, always there when needed.",
            "sent5": "The volunteer firefighter's services saved many homes from the raging fire."
        },
        {
            "definition": "A system supplying a public need such as transport, communications, or utilities.",
            "pos": "noun",
            "sent1": "The public transportation services in the city are reliable and affordable.",
            "sent2": "The government is responsible for maintaining essential services like water and electricity.",
            "sent3": "The futuristic city had advanced services that included flying cars and instant teleportation.",
            "sent4": "The internet service provider's network was like a web connecting everyone to the world.",
            "sent5": "The emergency services responded quickly to the accident, saving lives in the process."
        },
        {
            "definition": "The performance of duties or work for another.",
            "pos": "noun",
            "sent1": "His loyal services to the company were recognized with a promotion.",
            "sent2": "The maid's services included cleaning, cooking, and running errands for the family.",
            "sent3": "The dog's services as a therapy animal brought joy to many patients in the hospital.",
            "sent4": "The teacher's services in educating the children were invaluable to the community.",
            "sent5": "The superhero's services in protecting the city made him a beloved figure among the citizens."
        }
    ]
}