{
    "term": "servile",
    "meanings": [
        {
            "definition": "Having or showing an excessive willingness to serve or please others.",
            "pos": "adjective",
            "sent1": "The servile waiter rushed to fulfill every customer's request.",
            "sent2": "She always had a servile attitude towards her boss, constantly seeking approval.",
            "sent3": "The servile puppy wagged its tail eagerly, hoping for a treat.",
            "sent4": "His servile behavior made him seem like a doormat, always bending to others' wishes.",
            "sent5": "The servile assistant never hesitated to go above and beyond to assist her colleagues."
        },
        {
            "definition": "Of or characteristic of a slave or slaves.",
            "pos": "adjective",
            "sent1": "The servile clothing worn by the workers resembled that of ancient slaves.",
            "sent2": "The servile labor demanded by the cruel master was unbearable.",
            "sent3": "The servile chains clanked loudly as the prisoners marched in unison.",
            "sent4": "The servile conditions in the mines mirrored those of historical slave camps.",
            "sent5": "The servile expressions on the faces of the captives revealed their despair and hopelessness."
        },
        {
            "definition": "Showing or expressing excessive submission or deference.",
            "pos": "adjective",
            "sent1": "Her servile behavior towards authority figures was evident in her constant agreement.",
            "sent2": "The servile tone of his voice indicated his willingness to comply without question.",
            "sent3": "The servile gestures of the court jester amused the royal court.",
            "sent4": "The servile bow of the servant was met with a dismissive wave from the queen.",
            "sent5": "The servile mannerisms of the politician were seen as insincere by the public."
        }
    ]
}