{
    "term": "serve",
    "meanings": [
        {
            "definition": "Perform duties or services for someone or something.",
            "pos": "verb",
            "sent1": "I serve my family by helping with chores.",
            "sent2": "The waiter will serve us our meals shortly.",
            "sent3": "The robot decided to serve breakfast in bed, but spilled orange juice everywhere!",
            "sent4": "Her dedication to serve her community is like a beacon of light in the darkness.",
            "sent5": "The firefighter's bravery in serving others is truly admirable."
        },
        {
            "definition": "Provide with food or drink.",
            "pos": "verb",
            "sent1": "I will serve you a delicious meal tonight.",
            "sent2": "The cafe will serve coffee and pastries in the morning.",
            "sent3": "The cat tried to serve itself some milk from the bowl, making a mess.",
            "sent4": "The hospitality of the host family served comfort to the weary travelers.",
            "sent5": "The chef's passion to serve exquisite dishes is evident in every bite."
        },
        {
            "definition": "Be of use; be adequate.",
            "pos": "verb",
            "sent1": "This old computer can still serve for basic tasks.",
            "sent2": "A hammer can serve as a makeshift tool for the job.",
            "sent3": "The broken umbrella tried to serve its purpose, but failed miserably.",
            "sent4": "Her wisdom and experience serve as a guiding light for the team.",
            "sent5": "The map served as a crucial guide through the treacherous terrain."
        },
        {
            "definition": "Hit a ball or shuttlecock to start play in a game such as tennis or badminton.",
            "pos": "verb",
            "sent1": "I will serve the tennis ball to start the match.",
            "sent2": "The player must serve the shuttlecock over the net.",
            "sent3": "The squirrel tried to serve the acorn, but it rolled away.",
            "sent4": "His powerful serve in tennis is like a cannon shot across the court.",
            "sent5": "The precise serve in badminton left the opponent stunned."
        }
    ]
}