{
    "term": "sestine",
    "meanings": [
        {
            "definition": "A type of poem consisting of six stanzas of six lines each, followed by a three-line envoy.",
            "pos": "noun",
            "sent1": "In her English class, she learned about a sestine, a special kind of poem with six stanzas.",
            "sent2": "The poet crafted a beautiful sestine that captivated the audience with its intricate structure.",
            "sent3": "The sestine walked into the poetry party fashionably late, but everyone welcomed its unique style.",
            "sent4": "Her mind was a sestine, each stanza a different thought weaving through her emotions.",
            "sent5": "The sestine danced on the page, its lines swirling like colorful ribbons in the wind."
        },
        {
            "definition": "To write a poem in the form of a sestine.",
            "pos": "verb",
            "sent1": "She decided to sestine her feelings, pouring them into the structured lines of the poem.",
            "sent2": "He sestined a heartfelt poem for his mother's birthday, carefully choosing each word.",
            "sent3": "The students giggled as they sestined silly poems about their favorite animals.",
            "sent4": "Her words sestined across the page, creating a tapestry of emotions and imagery.",
            "sent5": "The poet's pen sestined gracefully, like a dancer moving to a silent melody."
        },
        {
            "definition": "A sestine poem.",
            "pos": "noun",
            "sent1": "She held a sestine in her hands, marveling at the intricate pattern of lines and stanzas.",
            "sent2": "The library displayed a rare collection of sestines, each one a masterpiece of poetic form.",
            "sent3": "The sestine sat quietly on the bookshelf, waiting for someone to discover its hidden beauty.",
            "sent4": "His gift to her was a sestine, a token of his love expressed through carefully chosen words.",
            "sent5": "The sestine whispered secrets of the poet's soul, each line a window into their thoughts."
        }
    ]
}