{
    "term": "setup",
    "meanings": [
        {
            "definition": "The way in which something is arranged or organized.",
            "pos": "noun",
            "sent1": "The setup of the classroom includes desks in rows facing the whiteboard.",
            "sent2": "She carefully checked the setup of the table before the party.",
            "sent3": "The setup of the board game was so confusing that we ended up playing a different game instead.",
            "sent4": "The setup of the garden was like a beautiful painting, with flowers arranged in perfect harmony.",
            "sent5": "The setup of the museum exhibit made it easy for visitors to follow the historical timeline."
        },
        {
            "definition": "The process of preparing something for use.",
            "pos": "noun",
            "sent1": "Before the event, the setup of the sound system took hours to complete.",
            "sent2": "The setup of the tent for camping was done efficiently by the experienced campers.",
            "sent3": "The setup of the picnic area was so quick that they had time to play a game of frisbee before lunch.",
            "sent4": "The setup of the stage for the play was like watching a well-coordinated dance.",
            "sent5": "The setup of the computer network was crucial for the office to function smoothly."
        },
        {
            "definition": "A scheme or plan.",
            "pos": "noun",
            "sent1": "The setup for the surprise party involved coordinating with all the guests to arrive on time.",
            "sent2": "The setup for the project was detailed in the presentation slides.",
            "sent3": "The setup for the heist was so elaborate that it seemed like a scene from a movie.",
            "sent4": "The setup for the marketing campaign was innovative and captured the audience's attention.",
            "sent5": "The setup for the road trip included mapping out the route and packing snacks for the journey."
        }
    ]
}