{
    "term": "sewan",
    "meanings": [
        {
            "definition": "A type of freshwater fish.",
            "pos": "noun",
            "sent1": "The sewan swam gracefully in the clear stream.",
            "sent2": "I caught a sewan while fishing at the lake.",
            "sent3": "The sewan wore a tiny top hat and danced in the water.",
            "sent4": "Her eyes sparkled like the scales of a sewan.",
            "sent5": "The sewan's silver scales shimmered in the sunlight."
        },
        {
            "definition": "A type of edible seaweed.",
            "pos": "noun",
            "sent1": "The salad was topped with fresh sewan from the ocean.",
            "sent2": "I enjoy snacking on crispy sewan chips.",
            "sent3": "The sewan giggled as it tickled my taste buds.",
            "sent4": "The sewan waved in the ocean like a green flag.",
            "sent5": "The aroma of sewan filled the kitchen as it cooked."
        },
        {
            "definition": "A type of currency used by Native American tribes.",
            "pos": "noun",
            "sent1": "The shopkeeper accepted sewan as payment for the goods.",
            "sent2": "I traded my goods for sewan at the market.",
            "sent3": "The sewan coins jingled in my pocket as I walked.",
            "sent4": "Her kindness was worth more than all the sewan in the world.",
            "sent5": "The sewan gleamed in the sunlight, a symbol of wealth."
        },
        {
            "definition": "A type of plant used for medicinal purposes.",
            "pos": "noun",
            "sent1": "The healer brewed a tea from sewan to cure the illness.",
            "sent2": "I gathered sewan leaves to make a healing poultice.",
            "sent3": "The sewan plant whispered secrets of health and vitality.",
            "sent4": "Her energy bloomed like a field of sewan in spring.",
            "sent5": "The fragrance of sewan filled the room, bringing comfort."
        }
    ]
}