{
    "term": "sex",
    "meanings": [
        {
            "definition": "The biological characteristics that define male and female organisms.",
            "pos": "noun",
            "sent1": "In nature, the difference in sex between animals helps them reproduce.",
            "sent2": "The doctor explained that the baby's sex would be determined at birth.",
            "sent3": "The zookeeper joked that even the animals were curious about each other's sex.",
            "sent4": "The flowers relied on bees to carry their sex to other plants for pollination.",
            "sent5": "The textbook had detailed diagrams showing the differences in sex organs of various species."
        },
        {
            "definition": "Sexual activity, including intercourse.",
            "pos": "noun",
            "sent1": "Some animals engage in sex only during certain times of the year.",
            "sent2": "The movie had a scene where the characters were about to have sex.",
            "sent3": "The comedian's joke about awkward sex situations made the audience burst into laughter.",
            "sent4": "The novel described the protagonist's longing for love through passionate sex scenes.",
            "sent5": "The health class discussed the importance of safe sex practices to prevent diseases."
        },
        {
            "definition": "The classification of organisms based on reproductive functions.",
            "pos": "noun",
            "sent1": "Biologists study the different types of sex in plants and animals.",
            "sent2": "The textbook explained the concept of sex in the context of evolution.",
            "sent3": "The students found it amusing how the professor used humor to teach about sex in biology.",
            "sent4": "The documentary highlighted the diversity of sex in the animal kingdom.",
            "sent5": "The research paper explored the role of sex in maintaining genetic diversity within a species."
        },
        {
            "definition": "To determine the gender of an organism.",
            "pos": "verb",
            "sent1": "The scientist will sex the chicks to separate males from females.",
            "sent2": "In some species, it is challenging to sex individuals without specialized tools.",
            "sent3": "The farmer joked that he could easily sex the piglets just by looking at them.",
            "sent4": "The breeder carefully sexed the puppies to ensure proper documentation.",
            "sent5": "The veterinarian explained the process of sexing reptiles based on physical characteristics."
        }
    ]
}