{
    "term": "sexual",
    "meanings": [
        {
            "definition": "Relating to the instincts, physiological processes, and activities connected with physical attraction or intimate physical contact between individuals.",
            "pos": "adjective",
            "sent1": "The movie had a lot of sexual scenes that made me uncomfortable.",
            "sent2": "She felt a strong sexual attraction towards him.",
            "sent3": "The cat's obsession with grooming itself was almost like a sexual ritual.",
            "sent4": "The tension in the room was so thick, it felt almost sexual in nature.",
            "sent5": "The artist's painting captured the raw, primal essence of the sexual energy between the two figures."
        },
        {
            "definition": "Involving or characterized by sexual activity or behavior.",
            "pos": "adjective",
            "sent1": "The scandal involved a high-profile sexual affair.",
            "sent2": "They engaged in sexual activities behind closed doors.",
            "sent3": "The way the dog chased its tail almost seemed like a playful sexual game.",
            "sent4": "The tension in the air was charged with a palpable sexual energy.",
            "sent5": "The novel described the characters' complex and tumultuous sexual relationships in vivid detail."
        },
        {
            "definition": "Of or relating to the sexes or to gender.",
            "pos": "adjective",
            "sent1": "The doctor discussed the patient's sexual characteristics during the examination.",
            "sent2": "Gender studies explore various aspects of sexual identity.",
            "sent3": "The fashion show featured designs that challenged traditional sexual stereotypes.",
            "sent4": "The political debate touched on issues of sexual equality and representation.",
            "sent5": "The documentary delved into the history of sexual politics and gender roles."
        }
    ]
}