{
    "term": "shabby",
    "meanings": [
        {
            "definition": "In poor condition due to age or wear",
            "pos": "adjective",
            "sent1": "The old chair looked shabby with its torn fabric.",
            "sent2": "The shabby house needed a fresh coat of paint.",
            "sent3": "Even the cat refused to sit on the shabby couch.",
            "sent4": "Her shabby umbrella provided little protection from the rain.",
            "sent5": "The shabby bookshelf collapsed under the weight of the books."
        },
        {
            "definition": "Showing signs of neglect or disrepair",
            "pos": "adjective",
            "sent1": "The abandoned house had a shabby appearance.",
            "sent2": "The shabby garden was overgrown with weeds.",
            "sent3": "The shabby car sputtered to a stop on the side of the road.",
            "sent4": "His shabby excuse for being late was not convincing.",
            "sent5": "The shabby sign hung crookedly on the rusty gate."
        },
        {
            "definition": "Wearing worn or outdated clothing",
            "pos": "adjective",
            "sent1": "She felt shabby in her faded jeans and old t-shirt.",
            "sent2": "The shabby coat had holes in the pockets.",
            "sent3": "He looked shabby compared to his well-dressed colleagues.",
            "sent4": "Her shabby hat was a relic from another era.",
            "sent5": "The shabby scarf kept her warm despite its frayed edges."
        },
        {
            "definition": "Mean or contemptible",
            "pos": "adjective",
            "sent1": "His shabby treatment of others was unacceptable.",
            "sent2": "The shabby behavior of the bullies angered the teacher.",
            "sent3": "She gave him a shabby look after his rude comment.",
            "sent4": "The shabby lies he told were quickly exposed.",
            "sent5": "The shabby attitude of the customer made the waiter sigh."
        }
    ]
}