{
    "term": "shadowgraph",
    "meanings": [
        {
            "definition": "A photograph taken with a shadow cast by the subject.",
            "pos": "noun",
            "sent1": "The shadowgraph captured the silhouette of the tree perfectly.",
            "sent2": "I love looking at old shadowgraphs of my family from the past.",
            "sent3": "The mischievous cat tried to photobomb the shadowgraph, creating a funny image.",
            "sent4": "Her memories were like faded shadowgraphs, hinting at the past.",
            "sent5": "The artist used a unique technique to create a stunning shadowgraph of the city skyline."
        },
        {
            "definition": "A method of visualizing fluid flow using shadows.",
            "pos": "noun",
            "sent1": "Scientists use shadowgraphs to study how liquids move in different conditions.",
            "sent2": "The shadowgraph revealed the intricate patterns formed by the flowing water.",
            "sent3": "The playful children pretended the shadowgraph was a magical river on the wall.",
            "sent4": "The shadowgraph of the swirling tea in the cup resembled a whirlpool in miniature.",
            "sent5": "The shadowgraph technique helped uncover hidden details in the fluid dynamics experiment."
        },
        {
            "definition": "An image produced by casting shadows on a surface.",
            "pos": "noun",
            "sent1": "The artist created a beautiful shadowgraph by arranging objects to cast shadows.",
            "sent2": "The shadowgraph on the wall looked like a mysterious figure in the dim light.",
            "sent3": "The mischievous child made funny shadowgraphs with their hands on the projector screen.",
            "sent4": "The shadowgraph of the tree branches on the ground resembled a delicate lace pattern.",
            "sent5": "The shadowgraph of the bird in flight against the sunset was a breathtaking sight."
        }
    ]
}