{
    "term": "shaft",
    "meanings": [
        {
            "definition": "A long, narrow part or section forming the handle of a tool or weapon.",
            "pos": "noun",
            "sent1": "He gripped the shaft of the hammer tightly.",
            "sent2": "The knight wielded his sword by the shaft.",
            "sent3": "The clumsy blacksmith accidentally dropped the shaft of the axe.",
            "sent4": "Her words struck him to the core like a sharp blow from a shaft.",
            "sent5": "The shaft of the spear gleamed in the sunlight as it pierced the air."
        },
        {
            "definition": "A long, narrow, typically vertical passage sunk into the ground, especially one providing access to a mine or tunnel.",
            "pos": "noun",
            "sent1": "The miners descended into the dark shaft to extract coal.",
            "sent2": "The elevator carried workers down the mine shaft.",
            "sent3": "The adventurous explorer decided to rappel down the deep shaft for fun.",
            "sent4": "The shaft of the well seemed to lead to the center of the earth.",
            "sent5": "The shaft echoed with the sound of pickaxes as the miners worked tirelessly."
        },
        {
            "definition": "A ray of light or bolt of lightning.",
            "pos": "noun",
            "sent1": "The morning sun's shaft illuminated the room.",
            "sent2": "The lightning struck with a blinding shaft of light.",
            "sent3": "The photographer captured the perfect moment when the shaft of sunlight hit the waterfall.",
            "sent4": "The storm brought a powerful shaft of lightning that lit up the sky.",
            "sent5": "The shaft of sunlight broke through the clouds, creating a beautiful scene."
        },
        {
            "definition": "To hit or throw (a ball or missile) with a quick, hard stroke.",
            "pos": "verb",
            "sent1": "He tried to shaft the basketball into the hoop.",
            "sent2": "The pitcher shafted the ball with incredible speed.",
            "sent3": "She playfully shafted the tennis ball over the net.",
            "sent4": "The quarterback shafted the football down the field for a touchdown.",
            "sent5": "The golfer expertly shafted the ball into the hole with precision."
        }
    ]
}