{
    "term": "shafts",
    "meanings": [
        {
            "definition": "A long, narrow part or section forming the handle of a tool or weapon.",
            "pos": "noun",
            "sent1": "He gripped the sturdy shafts of the hammer tightly.",
            "sent2": "The knight's sword had an ornate shaft made of silver.",
            "sent3": "The mischievous squirrel used the hammer's shaft as a balance beam.",
            "sent4": "Her words hit him like a heavy blow from a weapon's shaft.",
            "sent5": "The shaft of the axe gleamed in the sunlight, ready for battle."
        },
        {
            "definition": "A ray of light or a beam of energy.",
            "pos": "noun",
            "sent1": "The morning sun's warm shafts illuminated the room.",
            "sent2": "The flashlight's bright shaft cut through the darkness.",
            "sent3": "The magician waved his wand, sending colorful shafts of light across the stage.",
            "sent4": "Her smile was like a shaft of sunlight on a cloudy day.",
            "sent5": "The laser beam shot out in a straight shaft, hitting the target accurately."
        },
        {
            "definition": "A long, narrow passage or tunnel.",
            "pos": "noun",
            "sent1": "The miners dug deep shafts into the earth to extract coal.",
            "sent2": "The ancient tomb had mysterious shafts leading to hidden chambers.",
            "sent3": "The adventurous explorer crawled through the dark shaft, searching for treasure.",
            "sent4": "The escape tunnel was a narrow shaft, barely wide enough to crawl through.",
            "sent5": "The shaft of the mine echoed with the sound of pickaxes hitting rock."
        },
        {
            "definition": "A long, narrow piece of wood or metal used for support or as a structural element.",
            "pos": "noun",
            "sent1": "The carpenter reinforced the structure with sturdy wooden shafts.",
            "sent2": "The ancient temple's pillars were made of marble shafts.",
            "sent3": "The children built a makeshift fort using long branches as shafts.",
            "sent4": "The metal shafts held the bridge together, ensuring its stability.",
            "sent5": "The wooden shafts of the chair creaked as he sat down."
        }
    ]
}