{
    "term": "shaggy",
    "meanings": [
        {
            "definition": "Covered with long, untidy hair",
            "pos": "adjective",
            "sent1": "The dog's shaggy fur was tangled and messy.",
            "sent2": "The shaggy bushes in the garden needed trimming.",
            "sent3": "The shaggy-haired clown made everyone laugh.",
            "sent4": "Her shaggy mane of hair flowed in the wind like a wild river.",
            "sent5": "The shaggy coat of the bear looked like a fluffy cloud."
        },
        {
            "definition": "Having a rough, unkempt appearance",
            "pos": "adjective",
            "sent1": "The old house had a shaggy roof with missing tiles.",
            "sent2": "The hiker's shaggy clothes were covered in dirt.",
            "sent3": "The shaggy lawn resembled a wild jungle.",
            "sent4": "His shaggy beard made him look like a rugged mountain man.",
            "sent5": "The shaggy path through the forest was overgrown and tangled."
        },
        {
            "definition": "A type of carpet with a deep pile",
            "pos": "noun",
            "sent1": "The living room was cozy with a soft shaggy carpet.",
            "sent2": "She loved walking barefoot on the shaggy rug.",
            "sent3": "The cat enjoyed scratching its claws on the shaggy carpet.",
            "sent4": "The shaggy carpet absorbed the sound, making the room quiet.",
            "sent5": "The shaggy carpet felt like walking on clouds."
        },
        {
            "definition": "To shake or jolt abruptly",
            "pos": "verb",
            "sent1": "The earthquake shagged the entire city, causing chaos.",
            "sent2": "She accidentally shagged the table, spilling her drink.",
            "sent3": "The sudden gust of wind shagged the tree branches violently.",
            "sent4": "The rough road shagged the car passengers around.",
            "sent5": "The storm shagged the boat, making it rock back and forth."
        }
    ]
}