{
    "term": "shag",
    "meanings": [
        {
            "definition": "A type of carpet with a deep pile.",
            "pos": "noun",
            "sent1": "The soft shag felt cozy under my feet.",
            "sent2": "I love the fluffy shag carpet in the living room.",
            "sent3": "The cat thought the shag was a perfect spot for a nap.",
            "sent4": "The shag carpet swallowed up my lost earring.",
            "sent5": "The shag carpet was like walking on a cloud."
        },
        {
            "definition": "To have sexual intercourse with someone.",
            "pos": "verb",
            "sent1": "They decided to shag in the moonlight.",
            "sent2": "In some cultures, people wait until marriage to shag.",
            "sent3": "The romantic movie ended with the couple about to shag.",
            "sent4": "The scandalous novel described a secret affair and a forbidden shag.",
            "sent5": "The characters in the play sneaked off to shag behind the curtains."
        },
        {
            "definition": "A type of seabird with a long neck and sharp beak.",
            "pos": "noun",
            "sent1": "The majestic shag soared above the ocean waves.",
            "sent2": "I spotted a shag diving for fish near the shore.",
            "sent3": "The shag's call echoed across the rocky cliffs.",
            "sent4": "The shag's wings glinted in the sunlight as it flew by.",
            "sent5": "The shag's beak was perfect for catching slippery fish."
        },
        {
            "definition": "To shake or wave something vigorously.",
            "pos": "verb",
            "sent1": "She had to shag the rug to get rid of the dust.",
            "sent2": "The dog loves to shag its favorite toy around the yard.",
            "sent3": "The chef had to shag the pan to evenly distribute the ingredients.",
            "sent4": "The wind began to shag the leaves on the trees.",
            "sent5": "The excited child started to shag the balloons at the party."
        },
        {
            "definition": "A type of dance popular in the 1920s.",
            "pos": "noun",
            "sent1": "The energetic shag was a hit at the dance hall.",
            "sent2": "Couples twirled and spun during the lively shag.",
            "sent3": "The elderly couple surprised everyone with their smooth shag moves.",
            "sent4": "The music for the shag made everyone want to get up and dance.",
            "sent5": "The shag dance brought smiles to everyone's faces."
        }
    ]
}