{
    "term": "shakes",
    "meanings": [
        {
            "definition": "To move quickly back and forth or up and down",
            "pos": "verb",
            "sent1": "The dog shakes its tail happily.",
            "sent2": "She shakes the snow off her coat before entering the house.",
            "sent3": "The earthquake shakes the ground, making everyone jump.",
            "sent4": "His laughter shakes the room with joy.",
            "sent5": "The dancer shakes with energy and rhythm on stage."
        },
        {
            "definition": "A physical trembling or quivering",
            "pos": "noun",
            "sent1": "The old man's hands have uncontrollable shakes.",
            "sent2": "She felt the shakes in her legs after the intense workout.",
            "sent3": "The cold weather gives me the shakes every morning.",
            "sent4": "The earthquake caused the building to have shakes.",
            "sent5": "The excitement of the race gave her the shakes before it started."
        },
        {
            "definition": "A milkshake or similar beverage made by shaking ingredients together",
            "pos": "noun",
            "sent1": "I love to have chocolate shakes in the summer.",
            "sent2": "The diner serves the best shakes in town.",
            "sent3": "The strawberry shake was so thick, it was like a dessert.",
            "sent4": "The vanilla shake was a cool treat on a hot day.",
            "sent5": "She ordered a large shake with extra whipped cream."
        },
        {
            "definition": "A sudden and brief spell of an illness or feeling",
            "pos": "noun",
            "sent1": "He had a few shakes of dizziness before sitting down.",
            "sent2": "After the scare, she felt the shakes of fear in her body.",
            "sent3": "The shakes of excitement before the concert were overwhelming.",
            "sent4": "The shakes of nerves made her hands tremble.",
            "sent5": "The shakes of anticipation kept her on edge."
        },
        {
            "definition": "A gesture of agreement or understanding, typically involving a handshake",
            "pos": "noun",
            "sent1": "They sealed the deal with a firm shake.",
            "sent2": "The shake of hands signified the start of their partnership.",
            "sent3": "The business meeting ended with a friendly shake.",
            "sent4": "His confident shake showed he was ready for the challenge.",
            "sent5": "The shake of hands was a symbol of mutual respect."
        }
    ]
}