{
    "term": "shames",
    "meanings": [
        {
            "definition": "A painful feeling of humiliation or distress caused by the consciousness of wrong or foolish behavior.",
            "pos": "noun",
            "sent1": "The boy felt deep shames after being caught cheating on the test.",
            "sent2": "Public speaking can sometimes lead to shames if mistakes are made.",
            "sent3": "The cat's failed attempt to catch a bird brought shames upon itself.",
            "sent4": "The dark clouds looming overhead cast a shadow of shames on the town.",
            "sent5": "The memory of the embarrassing fall at the party lingered as a cloud of shames."
        },
        {
            "definition": "A person, action, or situation that causes feelings of embarrassment, humiliation, or disgrace.",
            "pos": "noun",
            "sent1": "The comedian's jokes often turn into shames for the audience.",
            "sent2": "Being late to the important meeting was a source of shames for Sarah.",
            "sent3": "The clumsy waiter became a walking source of shames at the fancy restaurant.",
            "sent4": "The broken statue stood as a symbol of shames in the town square.",
            "sent5": "The old photo album held memories of past shames and joys."
        },
        {
            "definition": "To cause someone to feel ashamed or embarrassed.",
            "pos": "verb",
            "sent1": "His rude comment shames his friends and makes them feel bad.",
            "sent2": "The teacher's scolding tone shames the students into silence.",
            "sent3": "The mischievous puppy shames its owner by stealing socks.",
            "sent4": "The mirror reflects back and shames her for the unkempt appearance.",
            "sent5": "The public apology only serves to further shames the guilty party."
        },
        {
            "definition": "To bring dishonor or disgrace upon someone or something.",
            "pos": "verb",
            "sent1": "The scandal shames the entire family in the eyes of the community.",
            "sent2": "His reckless behavior shames his parents and disappoints them.",
            "sent3": "The graffiti on the historic building shames the city's reputation.",
            "sent4": "The broken promise shames him in front of his closest friends.",
            "sent5": "The leaked information shames the company and its employees."
        }
    ]
}