{
    "term": "shamelessness",
    "meanings": [
        {
            "definition": "The quality or state of being shameless.",
            "pos": "noun",
            "sent1": "Her shamelessness in lying about the situation was evident to everyone.",
            "sent2": "His shamelessness in cheating on the test shocked his classmates.",
            "sent3": "The comedian joked about the shamelessness of his cat stealing food from the table.",
            "sent4": "The politician's shamelessness in accepting bribes was like a dark cloud over the city.",
            "sent5": "The thief's shamelessness in stealing in broad daylight was truly astonishing."
        },
        {
            "definition": "Lack of embarrassment or remorse.",
            "pos": "noun",
            "sent1": "The criminal's shamelessness after the crime was unsettling to the witnesses.",
            "sent2": "Her shamelessness in ignoring the consequences of her actions led to trouble.",
            "sent3": "The child's shamelessness in blaming the dog for the broken vase made everyone laugh.",
            "sent4": "The CEO's shamelessness in firing employees without reason was like a cold wind in the office.",
            "sent5": "The student's shamelessness in copying homework without guilt was concerning to the teacher."
        },
        {
            "definition": "Bold or audacious behavior without regard for social norms.",
            "pos": "noun",
            "sent1": "The singer's shamelessness on stage captivated the audience.",
            "sent2": "His shamelessness in asking for a raise after just a week of work surprised his boss.",
            "sent3": "The puppy's shamelessness in stealing socks and running around the house was adorable.",
            "sent4": "The explorer's shamelessness in venturing into the unknown territories inspired many.",
            "sent5": "The artist's shamelessness in creating controversial art pieces challenged societal norms."
        }
    ]
}