{
    "term": "shammed",
    "meanings": [
        {
            "definition": "Pretended",
            "pos": "adjective",
            "sent1": "She wore a shammed smile to hide her disappointment.",
            "sent2": "The magician's shammed disappearance amazed the audience.",
            "sent3": "He shammed being a superhero by wearing a cape made of a bedsheet.",
            "sent4": "The shammed bravery of the tiny mouse facing the cat was admirable.",
            "sent5": "The shammed diamond turned out to be a cleverly crafted glass imitation."
        },
        {
            "definition": "Falsely present",
            "pos": "verb",
            "sent1": "The student shammed illness to skip the test.",
            "sent2": "The impostor shammed as a royal family member.",
            "sent3": "The cat shammed innocence after knocking over the vase.",
            "sent4": "The shadows shammed danger in the dimly lit alley.",
            "sent5": "The actor shammed happiness on stage despite personal troubles."
        },
        {
            "definition": "Deceived or tricked",
            "pos": "verb",
            "sent1": "She shammed her friend into believing the fake story.",
            "sent2": "The con artist shammed many people with his schemes.",
            "sent3": "The mischievous child shammed his way out of trouble.",
            "sent4": "The mirage shammed weary travelers in the desert.",
            "sent5": "The clever fox shammed the hunter with its cunning tactics."
        },
        {
            "definition": "To feign or pretend",
            "pos": "verb",
            "sent1": "He shammed interest in the boring conversation.",
            "sent2": "The actor shammed fear during the thrilling scene.",
            "sent3": "The child shammed sleep to avoid bedtime.",
            "sent4": "The spy shammed ignorance to gather valuable information.",
            "sent5": "The comedian shammed sadness for a comedic effect."
        },
        {
            "definition": "To deceive or mislead",
            "pos": "verb",
            "sent1": "The scammer shammed the elderly couple out of their savings.",
            "sent2": "The false advertisement shammed customers into buying the product.",
            "sent3": "The politician shammed the public with empty promises.",
            "sent4": "The fog shammed the distance, making it hard to see.",
            "sent5": "The mirroring effect shammed the true size of the room."
        }
    ]
}