{
    "term": "shanks",
    "meanings": [
        {
            "definition": "The part of the leg between the knee and the ankle.",
            "pos": "noun",
            "sent1": "She hurt her shanks while playing soccer.",
            "sent2": "He wrapped his shanks in warm socks during the cold winter.",
            "sent3": "The puppy's tiny shanks wobbled as it tried to walk.",
            "sent4": "The dancer's shanks moved gracefully on stage.",
            "sent5": "The athlete's strong shanks powered him through the race."
        },
        {
            "definition": "A cut of meat from the upper part of the leg.",
            "pos": "noun",
            "sent1": "The chef prepared a delicious stew using shanks of lamb.",
            "sent2": "The restaurant's specialty was braised beef shanks.",
            "sent3": "The butcher recommended the tender shanks for the roast.",
            "sent4": "The slow-cooked shanks were tender and flavorful.",
            "sent5": "The aroma of roasted shanks filled the kitchen."
        },
        {
            "definition": "The narrow part of a tool that connects the handle to the working end.",
            "pos": "noun",
            "sent1": "The hammer's shanks were sturdy and well-crafted.",
            "sent2": "The screwdriver's shanks allowed for precise control.",
            "sent3": "The carpenter carefully inspected the tool's shanks for any defects.",
            "sent4": "The artist used the fine shanks of the brush for intricate details.",
            "sent5": "The mechanic replaced the worn-out shanks of the wrench."
        },
        {
            "definition": "To walk.",
            "pos": "verb",
            "sent1": "She shanks to school every morning.",
            "sent2": "The hiker shanks through the forest, enjoying nature.",
            "sent3": "The penguin shanks clumsily on the ice.",
            "sent4": "The elderly couple shanks slowly in the park.",
            "sent5": "The children shanks happily in the playground."
        }
    ]
}