{
    "term": "shanking",
    "meanings": [
        {
            "definition": "The act of stabbing someone with a makeshift knife.",
            "pos": "noun",
            "sent1": "During the fight, he resorted to shanking his opponent with a sharp object.",
            "sent2": "The criminal was arrested for shanking a pedestrian in the alley.",
            "sent3": "In the movie, the villain was known for shanking unsuspecting victims in dark alleys.",
            "sent4": "The betrayal felt like a sudden shanking in the back.",
            "sent5": "The news of the shanking spread fear throughout the neighborhood."
        },
        {
            "definition": "The action of hitting a golf ball with the heel of the club, causing it to veer off course.",
            "pos": "noun",
            "sent1": "His shanking of the golf ball led to a disappointing score on the course.",
            "sent2": "The golfer's shanking technique needed improvement to avoid hitting the ball off course.",
            "sent3": "Despite practicing for hours, his shanking still caused laughter among his friends.",
            "sent4": "The sudden gust of wind resulted in a shanking that surprised everyone on the golf course.",
            "sent5": "Her frustration grew with each shanking of the ball during the game."
        },
        {
            "definition": "The process of forming a shank on a piece of metal.",
            "pos": "noun",
            "sent1": "The blacksmith demonstrated the shanking of the metal to create a sturdy handle.",
            "sent2": "The apprentice learned the art of shanking metal under the guidance of the experienced craftsman.",
            "sent3": "The shanking of the metal required precision and skill to achieve the desired shape.",
            "sent4": "The shanking process involved hammering the metal to shape it into a useful tool.",
            "sent5": "The intricate design was achieved through careful shanking of the metal piece."
        }
    ]
}