{
    "term": "sharecropping",
    "meanings": [
        {
            "definition": "a tenant farmer who gives a share of the crops grown to the landlord in exchange for the use of the land",
            "pos": "noun",
            "sent1": "The sharecropping system allowed farmers to work the land in return for a portion of the harvest.",
            "sent2": "Sharecropping was a common arrangement in the South after the Civil War.",
            "sent3": "The sharecropping agreement turned out to be a win-win situation for both the farmer and the landlord.",
            "sent4": "In the world of agriculture, sharecropping can be seen as a symbiotic relationship between the landowner and the farmer.",
            "sent5": "The concept of sharecropping can be traced back to historical farming practices."
        },
        {
            "definition": "the practice of sharecropping, typically involving a tenant farmer and a landlord",
            "pos": "noun",
            "sent1": "During the sharecropping era, many farmers relied on this system to work the land.",
            "sent2": "Sharecropping was a way for farmers to access land without owning it.",
            "sent3": "The sharecropping setup sometimes led to unexpected friendships between farmers and landlords.",
            "sent4": "In some regions, sharecropping was the backbone of the agricultural economy.",
            "sent5": "The history books are filled with stories of sharecropping families and their struggles."
        },
        {
            "definition": "to engage in the practice of sharecropping",
            "pos": "verb",
            "sent1": "Farmers would sharecrop to have access to land for cultivation.",
            "sent2": "Many families sharecropped in order to make a living off the land.",
            "sent3": "The decision to sharecrop was a pivotal moment for the struggling farmer.",
            "sent4": "Sharecropping allowed farmers to work the fields without the burden of land ownership.",
            "sent5": "To sharecrop effectively, farmers needed to understand the terms of the agreement."
        }
    ]
}