{
    "term": "sheer",
    "meanings": [
        {
            "definition": "Complete and utter",
            "pos": "adjective",
            "sent1": "The sheer joy on her face was evident to everyone.",
            "sent2": "The sheer size of the mountain took their breath away.",
            "sent3": "It was sheer luck that they found the missing key under the rug.",
            "sent4": "The sheer determination in his eyes made him unstoppable.",
            "sent5": "The sheer beauty of the sunset painted the sky in vibrant colors."
        },
        {
            "definition": "Very steep",
            "pos": "adjective",
            "sent1": "The sheer cliff towered above them, casting a shadow.",
            "sent2": "The sheer drop made their hearts race as they looked over the edge.",
            "sent3": "She let out a sheer scream as the roller coaster plunged downwards.",
            "sent4": "The sheer slope of the hill made it a challenging climb.",
            "sent5": "The sheer rock face was a daunting challenge for the climbers."
        },
        {
            "definition": "To swerve abruptly",
            "pos": "verb",
            "sent1": "The car had to sheer to avoid hitting the animal on the road.",
            "sent2": "He had to sheer the boat sharply to avoid the rocks.",
            "sent3": "The squirrel managed to sheer away just in time to avoid the falling acorn.",
            "sent4": "The cyclist had to sheer to the side to avoid the oncoming car.",
            "sent5": "The skateboarder had to sheer to avoid colliding with the pedestrian."
        },
        {
            "definition": "To cause to sheer",
            "pos": "verb",
            "sent1": "He tried to sheer the sheep towards the pen, but they scattered in different directions.",
            "sent2": "The strong wind caused the ship to sheer off course.",
            "sent3": "The magician's trick was to sheer the cards in a surprising pattern.",
            "sent4": "The loud noise made the horse sheer away in fright.",
            "sent5": "The sudden movement made the dancers sheer into a new formation."
        }
    ]
}