{
    "term": "shell",
    "meanings": [
        {
            "definition": "The hard outer covering of an egg",
            "pos": "noun",
            "sent1": "The bird laid her eggs in a cozy shell.",
            "sent2": "Carefully crack the shell to reveal the egg inside.",
            "sent3": "Why did the chicken sit on the eggshell? To keep it warm!",
            "sent4": "The fragile shell protected the chick as it grew inside.",
            "sent5": "The colorful shell of the Easter egg caught the sunlight beautifully."
        },
        {
            "definition": "A projectile fired from a gun",
            "pos": "noun",
            "sent1": "The soldier loaded the shell into the cannon.",
            "sent2": "The loud bang indicated the firing of the shell.",
            "sent3": "Why did the clam refuse to share? Because it was feeling a bit shellfish!",
            "sent4": "The artillery shell exploded in a burst of smoke and debris.",
            "sent5": "The shell whistled through the air before hitting its target."
        },
        {
            "definition": "A container typically used for holding liquids",
            "pos": "noun",
            "sent1": "The chef poured the soup into a large shell.",
            "sent2": "The seashell was repurposed as a decorative shell for the bathroom.",
            "sent3": "Why did the snail bring a tiny cup to the party? To have a shell of a time!",
            "sent4": "The shell of the coconut held refreshing coconut water.",
            "sent5": "The glass shell was filled to the brim with lemonade."
        },
        {
            "definition": "To remove the outer covering of something",
            "pos": "verb",
            "sent1": "She used a knife to shell the boiled eggs.",
            "sent2": "The chef demonstrated how to shell a lobster quickly.",
            "sent3": "Why did the squirrel learn to shell nuts? To enjoy the tasty insides!",
            "sent4": "The gardener shelled peas for dinner.",
            "sent5": "He carefully shelled the pistachios to snack on later."
        },
        {
            "definition": "To move quickly and easily",
            "pos": "verb",
            "sent1": "The athlete can shell through the obstacle course effortlessly.",
            "sent2": "The rabbit shelled away from the predator in a flash.",
            "sent3": "Why did the turtle challenge the hare to a race? To show it can shell too!",
            "sent4": "The car shelled down the highway at top speed.",
            "sent5": "The skater shelled across the ice with grace and speed."
        }
    ]
}