{
    "term": "shellac",
    "meanings": [
        {
            "definition": "A type of resin secreted by the lac insect, used to make a varnish.",
            "pos": "noun",
            "sent1": "The craftsman applied a layer of shellac to the wooden table for a shiny finish.",
            "sent2": "The antique dresser gleamed with a coat of shellac, enhancing its beauty.",
            "sent3": "The mischievous squirrel mistook the shellac for honey and got stuck in it.",
            "sent4": "Her laughter was like shellac, spreading warmth and joy to everyone around her.",
            "sent5": "The smell of shellac filled the workshop, bringing back memories of his grandfather's carpentry projects."
        },
        {
            "definition": "A thin varnish made from shellac resin, used to finish wood.",
            "pos": "noun",
            "sent1": "The carpenter carefully applied shellac to the cabinet, giving it a glossy sheen.",
            "sent2": "The old chair was restored to its former glory with a fresh coat of shellac.",
            "sent3": "The mischievous cat left paw prints in the wet shellac, creating a unique pattern.",
            "sent4": "Her smile was as bright as the freshly applied shellac on the wooden floor.",
            "sent5": "The sunlight reflected off the shellac, illuminating the room with a golden hue."
        },
        {
            "definition": "To coat or finish with shellac.",
            "pos": "verb",
            "sent1": "The carpenter will shellac the new bookshelf to protect it from scratches.",
            "sent2": "She decided to shellac the picture frame to give it a polished look.",
            "sent3": "The children giggled as they accidentally shellacked their hands together.",
            "sent4": "His words seemed to shellac the tension in the room, calming everyone down.",
            "sent5": "The artist carefully shellacs each painting to preserve its colors for years to come."
        }
    ]
}