{
    "term": "sherif",
    "meanings": [
        {
            "definition": "A Muslim ruler or official in North Africa",
            "pos": "noun",
            "sent1": "The sherif welcomed the visitors to his palace.",
            "sent2": "The sherif led the council meeting with authority.",
            "sent3": "The sherif tried to ride a unicycle in the palace courtyard for entertainment.",
            "sent4": "The sherif's wisdom shone like a beacon in the dark times.",
            "sent5": "The sherif's presence in the city was as grand as a mountain."
        },
        {
            "definition": "A title of respect for a Muslim man of high social or official status",
            "pos": "noun",
            "sent1": "People showed great respect to the sherif in the marketplace.",
            "sent2": "The sherif's words carried weight in the community.",
            "sent3": "The sherif accidentally wore mismatched socks to the royal banquet.",
            "sent4": "The sherif's influence spread like wildfire among the villagers.",
            "sent5": "The sherif's reputation was as solid as a rock."
        },
        {
            "definition": "A former Turkish gold coin",
            "pos": "noun",
            "sent1": "The merchant exchanged goods for a sherif at the bazaar.",
            "sent2": "The sherif was a valuable currency in the Ottoman Empire.",
            "sent3": "The sherif coin rolled away and caused chaos in the market.",
            "sent4": "The sherif gleamed in the sunlight, catching everyone's eye.",
            "sent5": "The sherif's worth was as precious as a rare gem."
        },
        {
            "definition": "A member of the nobility in the Ottoman Empire",
            "pos": "noun",
            "sent1": "The sherif attended the royal banquet with other nobles.",
            "sent2": "The sherif's lineage traced back to ancient times.",
            "sent3": "The sherif accidentally spilled grape juice on his elegant robe.",
            "sent4": "The sherif's presence commanded attention like a king.",
            "sent5": "The sherif's grace and poise were unmatched in the court."
        }
    ]
}