{
    "term": "shifted",
    "meanings": [
        {
            "definition": "Moved or changed position",
            "pos": "verb",
            "sent1": "She shifted the books from the table to the shelf.",
            "sent2": "The cat shifted its weight from one paw to the other.",
            "sent3": "The puzzle piece shifted unexpectedly, surprising everyone.",
            "sent4": "As the sun set, the colors in the sky shifted from blue to orange.",
            "sent5": "The sand shifted under his feet as he walked along the beach."
        },
        {
            "definition": "Changed gears in a vehicle",
            "pos": "verb",
            "sent1": "He shifted the car into reverse to park it.",
            "sent2": "The truck driver shifted gears to climb the steep hill.",
            "sent3": "The car suddenly shifted into neutral, causing a moment of panic.",
            "sent4": "The race car driver expertly shifted through the gears to gain speed.",
            "sent5": "The old car made a loud noise when he shifted gears."
        },
        {
            "definition": "Changed focus or direction",
            "pos": "verb",
            "sent1": "She shifted her attention from the book to the movie playing on TV.",
            "sent2": "The conversation shifted from work to weekend plans.",
            "sent3": "His thoughts shifted like a whirlwind, making it hard to concentrate.",
            "sent4": "The wind shifted suddenly, changing the direction of the sailboat.",
            "sent5": "The spotlight shifted to the lead singer as he began to sing."
        },
        {
            "definition": "Changed responsibility or duty",
            "pos": "noun",
            "sent1": "After the promotion, he felt the shift in his responsibilities.",
            "sent2": "The shift in duties required her to work longer hours.",
            "sent3": "The sudden shift in leadership caught everyone by surprise.",
            "sent4": "The shift of power within the company led to new challenges.",
            "sent5": "The team managed the shift in roles smoothly, without any issues."
        }
    ]
}