{
    "term": "shift",
    "meanings": [
        {
            "definition": "To move or transfer from one place to another.",
            "pos": "verb",
            "sent1": "I need to shift the books from the table to the shelf.",
            "sent2": "She will shift her focus from one project to another.",
            "sent3": "I tried to shift the blame onto my brother, but he saw through it.",
            "sent4": "The clouds seemed to shift across the sky, changing shapes as they moved.",
            "sent5": "The teacher asked us to shift our desks into a circle for group work."
        },
        {
            "definition": "A change in position or direction.",
            "pos": "noun",
            "sent1": "The shift of the Earth's plates caused an earthquake.",
            "sent2": "She felt a sudden shift in the wind as the storm approached.",
            "sent3": "The unexpected shift in plans left everyone confused.",
            "sent4": "The shift in public opinion was evident after the scandal.",
            "sent5": "The shift of power from the king to the parliament marked a significant change in governance."
        },
        {
            "definition": "To change gears in a vehicle.",
            "pos": "verb",
            "sent1": "Remember to shift to a lower gear when going uphill.",
            "sent2": "He quickly learned how to shift smoothly between gears.",
            "sent3": "I accidentally tried to shift gears without pressing the clutch.",
            "sent4": "The race car driver expertly shifted through the gears on the straightaway.",
            "sent5": "She hesitated for a moment before shifting into reverse to park the car."
        },
        {
            "definition": "A scheduled period of work.",
            "pos": "noun",
            "sent1": "His night shift at the hospital starts at midnight.",
            "sent2": "She picked up an extra shift to earn more money.",
            "sent3": "The morning shift always gets the bakery fresh and warm.",
            "sent4": "The night shift workers gathered for a quick break in the break room.",
            "sent5": "The afternoon shift is usually the busiest time at the factory."
        }
    ]
}