{
    "term": "shifters",
    "meanings": [
        {
            "definition": "A person or thing that shifts or changes something.",
            "pos": "noun",
            "sent1": "The workers in the factory are the shifters who move the heavy boxes.",
            "sent2": "The weather is a shifter that can quickly change from sunny to rainy.",
            "sent3": "The cat thinks it's a shifter when it rearranges the pillows on the couch.",
            "sent4": "Time is a mysterious shifter, altering our memories as it passes.",
            "sent5": "In the story, the wizard was a powerful shifter, able to transform objects with a wave of his hand."
        },
        {
            "definition": "A device used to change gears in a vehicle.",
            "pos": "noun",
            "sent1": "The mechanic fixed the shifters in the car to make it run smoothly.",
            "sent2": "When driving a manual car, you need to use the shifters to change gears.",
            "sent3": "The talking car in the movie had a mind of its own and would only respond to the shifters.",
            "sent4": "The shifters in the truck were like magic wands, making the vehicle go faster with a simple flick.",
            "sent5": "The old car had rusty shifters that required a strong hand to operate."
        },
        {
            "definition": "A type of bicycle component that allows the rider to change gears.",
            "pos": "noun",
            "sent1": "The cyclist adjusted the shifters on the handlebars to tackle the steep hill.",
            "sent2": "Make sure to use the shifters on the bike to find the right gear for the terrain.",
            "sent3": "The mischievous squirrel thought the shifters were tasty snacks and nibbled on them.",
            "sent4": "The shifters on the bicycle were like secret buttons, unlocking different speeds for the rider.",
            "sent5": "With a click of the shifters, the cyclist smoothly transitioned to a higher gear and sped ahead of the competition."
        }
    ]
}