{
    "term": "shigella",
    "meanings": [
        {
            "definition": "A type of bacteria that can cause severe diarrhea and dysentery in humans.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with shigella after the stool sample test.",
            "sent2": "Avoiding unclean water sources can help prevent shigella infections.",
            "sent3": "The shigella bacteria threw a party in the intestines, causing chaos and discomfort.",
            "sent4": "The shigella outbreak spread through the town like wildfire, affecting many residents.",
            "sent5": "The severity of shigella symptoms can be alarming and require immediate medical attention."
        },
        {
            "definition": "The genus of bacteria that includes various species responsible for causing shigellosis.",
            "pos": "noun",
            "sent1": "Scientists study shigella to understand how it causes shigellosis.",
            "sent2": "Shigella bacteria can be identified under a microscope in a lab setting.",
            "sent3": "The shigella family reunion turned into a shigellosis outbreak, much to everyone's surprise.",
            "sent4": "The diversity within the shigella genus is fascinating to microbiologists.",
            "sent5": "The impact of shigella on public health cannot be underestimated due to its role in shigellosis cases."
        },
        {
            "definition": "An infectious agent that can be transmitted through contaminated food or water.",
            "pos": "noun",
            "sent1": "Proper hygiene practices can help prevent the spread of shigella in communities.",
            "sent2": "Contaminated water sources are a common route for shigella transmission.",
            "sent3": "The mischievous shigella bacteria played hide-and-seek in the food supply, causing trouble.",
            "sent4": "The presence of shigella in the water supply sent alarm bells ringing throughout the town.",
            "sent5": "The ease of shigella transmission highlights the importance of food and water safety measures."
        }
    ]
}