{
    "term": "shikara",
    "meanings": [
        {
            "definition": "A type of wooden boat used in Kashmir, typically for transporting people.",
            "pos": "noun",
            "sent1": "The shikara glided smoothly across the water, carrying passengers to the other side.",
            "sent2": "Tourists enjoyed a peaceful ride on the shikara, taking in the scenic views of the lake.",
            "sent3": "The shikara driver told a funny joke to the passengers, making the boat ride even more enjoyable.",
            "sent4": "The shikara was a silent messenger, ferrying people across the shimmering lake.",
            "sent5": "The colorful shikara stood out against the serene blue waters, a symbol of tranquility."
        },
        {
            "definition": "A type of traditional houseboat in India, often used for tourism.",
            "pos": "noun",
            "sent1": "Families relaxed on the shikara, savoring the unique experience of staying on the water.",
            "sent2": "The shikara gently rocked as the guests settled in for a night of peaceful sleep.",
            "sent3": "The curious monkey peeked out from the shikara window, surprising the tourists inside.",
            "sent4": "The shikara was a floating sanctuary, offering a glimpse into a different way of life.",
            "sent5": "The ornate decorations on the shikara added a touch of elegance to the serene surroundings."
        },
        {
            "definition": "A small, flat-bottomed boat used for leisure or transportation on lakes or rivers.",
            "pos": "noun",
            "sent1": "Children laughed and played on the shikara, enjoying the simple pleasures of the water.",
            "sent2": "The shikara smoothly glided through the calm river, carrying supplies to the village.",
            "sent3": "The mischievous dog jumped off the shikara, causing a splash that surprised everyone.",
            "sent4": "The shikara was a silent guardian, watching over the peaceful waters of the lake.",
            "sent5": "The shikara's bright colors added a cheerful touch to the tranquil river scene."
        }
    ]
}