{
    "term": "shine",
    "meanings": [
        {
            "definition": "Give out a bright light.",
            "pos": "verb",
            "sent1": "The sun will shine brightly in the sky.",
            "sent2": "The stars shine at night.",
            "sent3": "The flashlight decided to shine its light on the dark path.",
            "sent4": "Her smile can shine like a beacon of happiness.",
            "sent5": "The diamond's sparkle can outshine all others."
        },
        {
            "definition": "Be very good at something.",
            "pos": "verb",
            "sent1": "She can shine in math class with her quick calculations.",
            "sent2": "He shines in sports with his speed and agility.",
            "sent3": "The chef continued to shine in the kitchen, creating delicious dishes.",
            "sent4": "Her talent for painting can shine through every stroke of the brush.",
            "sent5": "His leadership skills always shine during group projects."
        },
        {
            "definition": "Make something bright by rubbing or polishing it.",
            "pos": "verb",
            "sent1": "She used a cloth to shine her shoes before the party.",
            "sent2": "He likes to shine his car every weekend to keep it looking new.",
            "sent3": "The little girl tried to shine her toy by rubbing it with a cloth.",
            "sent4": "The jeweler will shine the silver necklace to make it sparkle.",
            "sent5": "He used a special polish to make the wooden table shine."
        },
        {
            "definition": "To be very good or impressive.",
            "pos": "verb",
            "sent1": "Her performance on stage will shine brightly in everyone's memory.",
            "sent2": "The team's effort shined through in their victory.",
            "sent3": "The student's essay managed to shine despite the tough competition.",
            "sent4": "His intelligence and wit always shine in conversations.",
            "sent5": "The beauty of the artwork can shine through even in the smallest details."
        }
    ]
}