{
    "term": "shining",
    "meanings": [
        {
            "definition": "Giving off or reflecting light",
            "pos": "adjective",
            "sent1": "The sun is shining brightly in the sky.",
            "sent2": "The stars were shining in the dark night.",
            "sent3": "The shiny disco ball was shining so much, it made everyone want to dance.",
            "sent4": "Her smile was like a shining beacon of happiness in the room.",
            "sent5": "The lighthouse's shining light guided ships safely to shore."
        },
        {
            "definition": "Bright or glowing",
            "pos": "adjective",
            "sent1": "The shining moon illuminated the path ahead.",
            "sent2": "The shining eyes of the cat glowed in the dark.",
            "sent3": "The shining stars seemed to wink at us playfully from above.",
            "sent4": "Her shining personality lit up the room wherever she went.",
            "sent5": "The shining armor of the knight reflected the sun's rays brilliantly."
        },
        {
            "definition": "To emit light",
            "pos": "verb",
            "sent1": "The lamp is shining brightly in the room.",
            "sent2": "The fireflies were shining in the garden at night.",
            "sent3": "The flashlight was shining so bright, it almost looked like a mini sun.",
            "sent4": "The glowworms shining in the dark forest created a magical atmosphere.",
            "sent5": "The streetlights were shining, casting a warm glow on the road."
        },
        {
            "definition": "To be bright or radiant",
            "pos": "verb",
            "sent1": "Her eyes were shining with joy as she opened the gift.",
            "sent2": "The bride was shining with happiness on her wedding day.",
            "sent3": "The trophy was shining so much, it almost blinded the players.",
            "sent4": "The sun was shining brightly, making everything look golden.",
            "sent5": "The gemstones in the crown were shining brilliantly under the light."
        },
        {
            "definition": "To be outstanding or excellent",
            "pos": "verb",
            "sent1": "His performance was shining among all the others.",
            "sent2": "The student's essay was shining with originality and insight.",
            "sent3": "The cake was shining with perfection, making everyone eager to taste it.",
            "sent4": "Her talent was shining brightly, capturing everyone's attention.",
            "sent5": "The team's effort was shining through their exceptional teamwork."
        }
    ]
}