{
    "term": "shisha",
    "meanings": [
        {
            "definition": "A Middle Eastern tobacco pipe with a long flexible tube connected to a container where the smoke is cooled by passing through water.",
            "pos": "noun",
            "sent1": "At the party, the guests gathered around the shisha to enjoy flavored smoke.",
            "sent2": "The shisha on the table was beautifully decorated with intricate patterns.",
            "sent3": "When the shisha started bubbling, it sounded like a tiny waterfall.",
            "sent4": "The shisha's tube resembled a graceful serpent winding its way through the room.",
            "sent5": "The aroma from the shisha filled the air with a sweet, fragrant cloud."
        },
        {
            "definition": "Flavored tobacco smoked in a shisha pipe.",
            "pos": "noun",
            "sent1": "The shop offered a variety of fruity shisha flavors for customers to try.",
            "sent2": "Friends gathered around the shisha pipe, passing it around and enjoying the flavors.",
            "sent3": "The shisha smoke danced in the air like colorful ribbons at a festival.",
            "sent4": "The scent of the shisha lingered in the room, creating a cozy atmosphere.",
            "sent5": "Each puff of the shisha brought a burst of delightful taste to the lips."
        },
        {
            "definition": "The act of smoking shisha.",
            "pos": "noun",
            "sent1": "After a long day, relaxing with friends and shisha was the perfect way to unwind.",
            "sent2": "The laughter and chatter filled the room as they enjoyed the shisha together.",
            "sent3": "Trying to blow smoke rings from the shisha became a fun challenge for the group.",
            "sent4": "The swirling smoke from the shisha enveloped them in a sense of tranquility.",
            "sent5": "The ritual of preparing and smoking shisha became a cherished tradition among friends."
        }
    ]
}