{
    "term": "shit",
    "meanings": [
        {
            "definition": "Excrement",
            "pos": "noun",
            "sent1": "The dog left a pile of shit on the sidewalk.",
            "sent2": "I stepped in dog shit while walking in the park.",
            "sent3": "I can't believe I have to clean up this shit again.",
            "sent4": "The overflowing garbage can smelled like rotting shit.",
            "sent5": "The toddler proudly showed off his diaper filled with shit."
        },
        {
            "definition": "Nonsense or foolishness",
            "pos": "noun",
            "sent1": "Don't listen to his shit about aliens visiting Earth.",
            "sent2": "Stop talking nonsense and focus on the task at hand.",
            "sent3": "His excuse for being late was pure shit.",
            "sent4": "The conspiracy theory was a load of shit.",
            "sent5": "Her story was so full of shit, no one believed her."
        },
        {
            "definition": "Something of poor quality or value",
            "pos": "noun",
            "sent1": "I can't believe I paid money for this cheap shit.",
            "sent2": "The knockoff purse turned out to be shit.",
            "sent3": "This product is shit; it broke after one use.",
            "sent4": "The movie was shit; I want my money back.",
            "sent5": "The shirt I bought online was shit quality."
        },
        {
            "definition": "To defecate",
            "pos": "verb",
            "sent1": "I need to shit before we leave the house.",
            "sent2": "Excuse me, I have to go shit in the bathroom.",
            "sent3": "The urge to shit hit me suddenly during the meeting.",
            "sent4": "He ran to the toilet, desperate to shit.",
            "sent5": "After eating spicy food, he knew he would have to shit soon."
        },
        {
            "definition": "To express anger or frustration",
            "pos": "verb",
            "sent1": "I'm so mad, I just want to shit right now.",
            "sent2": "She was so frustrated, she needed to shit out her feelings.",
            "sent3": "He tends to shit when things don't go his way.",
            "sent4": "Don't shit at me just because you're upset.",
            "sent5": "After the argument, he needed to shit to calm down."
        }
    ]
}