{
    "term": "shocker",
    "meanings": [
        {
            "definition": "A person or thing that shocks or surprises.",
            "pos": "noun",
            "sent1": "The magician's disappearing act was a real shocker for the audience.",
            "sent2": "The unexpected plot twist in the movie was a real shocker.",
            "sent3": "The talking dog at the talent show was a shocker, but everyone loved it.",
            "sent4": "The sudden thunderstorm was a shocker that caught everyone off guard.",
            "sent5": "The surprise birthday party was a shocker that left her speechless."
        },
        {
            "definition": "A sudden and violent blow or impact.",
            "pos": "noun",
            "sent1": "The boxer delivered a powerful shocker to his opponent in the ring.",
            "sent2": "The car crash caused a shocker that left the driver shaken.",
            "sent3": "The falling tree branch gave the picnic blanket a shocker of a dent.",
            "sent4": "The earthquake sent shockwaves through the city, each one a shocker.",
            "sent5": "The hammer hitting the nail made a loud shocker sound."
        },
        {
            "definition": "A device or mechanism for giving an electric shock.",
            "pos": "noun",
            "sent1": "The electric fence had a shocker to keep the animals away.",
            "sent2": "The scientist used a shocker to test the conductivity of the material.",
            "sent3": "The prankster's joy buzzer was a shocker that made everyone jump.",
            "sent4": "The defibrillator is a life-saving shocker used in emergencies.",
            "sent5": "The faulty wiring in the old house made every light switch a potential shocker."
        },
        {
            "definition": "A sensational or scandalous news story or event.",
            "pos": "noun",
            "sent1": "The tabloid newspaper always has the latest shocker about celebrities.",
            "sent2": "The political scandal was a real shocker that made headlines.",
            "sent3": "The gossip about the mayor's secret hobby was a shocker at the town meeting.",
            "sent4": "The reality TV show promised a shocker in the upcoming episode.",
            "sent5": "The exposé on corruption in the company was a shocker that led to investigations."
        }
    ]
}