{
    "term": "shook",
    "meanings": [
        {
            "definition": "past tense of shake",
            "pos": "verb",
            "sent1": "Yesterday, I shook the tree to get the apples.",
            "sent2": "She shook the rug to remove the dust.",
            "sent3": "The earthquake shook the ground so hard, even the birds were surprised.",
            "sent4": "His words shook her to the core, making her rethink everything.",
            "sent5": "The thunderstorm shook the windows, making the whole house tremble."
        },
        {
            "definition": "to cause to tremble or vibrate",
            "pos": "verb",
            "sent1": "The loud music shook the walls of the room.",
            "sent2": "The earthquake shook the entire city, causing panic.",
            "sent3": "The unexpected news shook him, making him drop his coffee.",
            "sent4": "Her laughter shook the room, spreading joy to everyone.",
            "sent5": "The train passing by shook the ground beneath our feet."
        },
        {
            "definition": "a simple past tense and past participle of shake",
            "pos": "verb",
            "sent1": "She shook the bottle before opening it.",
            "sent2": "He shook his head in disbelief.",
            "sent3": "The dog shook off the water after swimming in the lake.",
            "sent4": "The dancer shook her hips to the rhythm of the music.",
            "sent5": "The wind shook the leaves off the trees in the autumn breeze."
        },
        {
            "definition": "to disturb or agitate emotionally",
            "pos": "verb",
            "sent1": "The sad movie shook her, bringing tears to her eyes.",
            "sent2": "The unexpected news shook the entire family.",
            "sent3": "His joke shook her with laughter, brightening her day.",
            "sent4": "The heartfelt apology shook him, making him forgive instantly.",
            "sent5": "The touching story shook the audience, leaving them in awe."
        }
    ]
}