{
    "term": "shooter",
    "meanings": [
        {
            "definition": "One who shoots a gun or other weapon.",
            "pos": "noun",
            "sent1": "The shooter aimed carefully at the target.",
            "sent2": "The police officer is a skilled shooter.",
            "sent3": "The shooter's aim was so good, they hit the bullseye every time.",
            "sent4": "In the movie, the hero was a sharpshooter, never missing a shot.",
            "sent5": "The shooter's precision with the gun was impressive."
        },
        {
            "definition": "A small alcoholic drink typically consumed quickly.",
            "pos": "noun",
            "sent1": "At the party, they served shooters to the guests.",
            "sent2": "The bartender prepared a round of shooters for the group.",
            "sent3": "The friends enjoyed a few shooters before hitting the dance floor.",
            "sent4": "The colorful shooters lined up on the bar looked tempting.",
            "sent5": "The fruity shooter had a strong kick to it."
        },
        {
            "definition": "A person who takes photographs.",
            "pos": "noun",
            "sent1": "The professional shooter captured stunning images at the event.",
            "sent2": "The wildlife shooter waited patiently for the perfect shot.",
            "sent3": "The wedding shooter made sure to get all the important moments on camera.",
            "sent4": "The fashion shooter's portfolio was filled with striking photos.",
            "sent5": "The talented shooter knew how to frame a picture beautifully."
        },
        {
            "definition": "A plant stem with leaves or flowers.",
            "pos": "noun",
            "sent1": "The rose bush had a long, thorny shooter growing from its base.",
            "sent2": "The green shooter sprouted new leaves in the spring.",
            "sent3": "The tiny shooter on the succulent was starting to bloom.",
            "sent4": "The vine's shooter reached out towards the sunlight.",
            "sent5": "The delicate shooter swayed gently in the breeze."
        }
    ]
}