{
    "term": "shortchanges",
    "meanings": [
        {
            "definition": "Give (someone) less than they are owed or deserve.",
            "pos": "verb",
            "sent1": "The store shortchanges customers by not giving them the correct change.",
            "sent2": "She felt upset when the company shortchanged her on her paycheck.",
            "sent3": "The magician shortchanges the audience by making the rabbit disappear without bringing it back.",
            "sent4": "The unreliable contractor shortchanges his clients by using cheap materials for construction.",
            "sent5": "The teacher shortchanges the students by not providing enough time for the exam."
        },
        {
            "definition": "Cheat or swindle (someone) by giving them less than they are owed.",
            "pos": "verb",
            "sent1": "The scammer shortchanges unsuspecting victims by promising fake rewards.",
            "sent2": "He realized the salesman shortchanged him by selling him a faulty product.",
            "sent3": "The pickpocket shortchanges tourists by stealing their wallets without them noticing.",
            "sent4": "The con artist shortchanges his targets by manipulating them into giving him money.",
            "sent5": "The dishonest mechanic shortchanges customers by overcharging for unnecessary repairs."
        },
        {
            "definition": "To treat someone unfairly by not giving them what they deserve.",
            "pos": "verb",
            "sent1": "The coach shortchanges talented players by not giving them enough playing time.",
            "sent2": "It's not right to shortchange employees by denying them their rightful promotions.",
            "sent3": "The boss shortchanges his assistant by taking credit for all the hard work.",
            "sent4": "The landlord shortchanges tenants by neglecting to make necessary repairs in the building.",
            "sent5": "The government should not shortchange citizens by cutting essential services."
        }
    ]
}