{
    "term": "short",
    "meanings": [
        {
            "definition": "Not long in distance or time.",
            "pos": "adjective",
            "sent1": "The road trip was short, only lasting an hour.",
            "sent2": "The short walk to the park was enjoyable.",
            "sent3": "I tried to run, but my short legs couldn't keep up!",
            "sent4": "Her attention span was as short as a lightning strike.",
            "sent5": "The short break between classes felt like a fleeting moment."
        },
        {
            "definition": "Having little height.",
            "pos": "adjective",
            "sent1": "The short tree provided shade on hot days.",
            "sent2": "She was short compared to her tall friends.",
            "sent3": "The short fence couldn't keep the playful puppy in.",
            "sent4": "The short building looked like a toy in the city skyline.",
            "sent5": "The short chair made him feel like a child at the table."
        },
        {
            "definition": "Lacking in length.",
            "pos": "adjective",
            "sent1": "The short story was easy to read in one sitting.",
            "sent2": "Her short hair framed her face beautifully.",
            "sent3": "The short line at the store moved quickly.",
            "sent4": "His short explanation left us with more questions.",
            "sent5": "The short skirt fluttered in the breeze as she walked."
        },
        {
            "definition": "Brief in duration.",
            "pos": "adjective",
            "sent1": "The meeting was short, ending sooner than expected.",
            "sent2": "Their short conversation was filled with laughter.",
            "sent3": "The short rain shower caught us by surprise.",
            "sent4": "His short visit brought joy to the whole family.",
            "sent5": "The short nap refreshed her for the rest of the day."
        },
        {
            "definition": "Insufficient in amount or extent.",
            "pos": "adjective",
            "sent1": "The short supply of food made them ration carefully.",
            "sent2": "His short explanation left out important details.",
            "sent3": "The short budget forced them to get creative.",
            "sent4": "Her short patience wore thin quickly.",
            "sent5": "The short list of ingredients made cooking a challenge."
        }
    ]
}