{
    "term": "shotting",
    "meanings": [
        {
            "definition": "The act of shooting a gun or bow.",
            "pos": "noun",
            "sent1": "During the competition, his precise shotting impressed everyone.",
            "sent2": "Hunting requires skillful shotting to hit the target.",
            "sent3": "The cowboy's quick shotting saved the day in the wild west.",
            "sent4": "Her accurate shotting was like a sharpshooter in the old movies.",
            "sent5": "The sound of his shotting echoed through the forest."
        },
        {
            "definition": "The act of taking a photograph.",
            "pos": "noun",
            "sent1": "She captured the beautiful sunset with her shotting.",
            "sent2": "Photographers need good lighting for clear shotting.",
            "sent3": "His shotting skills made him the best photographer in town.",
            "sent4": "The shotting of the rare bird was a once-in-a-lifetime opportunity.",
            "sent5": "The shotting of the family portrait brought smiles to everyone."
        },
        {
            "definition": "The act of throwing or hitting a ball.",
            "pos": "noun",
            "sent1": "His powerful shotting in baseball impressed the coach.",
            "sent2": "Practice is key to improving your shotting in basketball.",
            "sent3": "The player's unique shotting style made him stand out on the field.",
            "sent4": "Her shotting of the soccer ball soared into the goal.",
            "sent5": "The crowd cheered at the player's perfect shotting during the game."
        },
        {
            "definition": "The act of injecting a drug.",
            "pos": "noun",
            "sent1": "The nurse administered the shotting to the patient.",
            "sent2": "Drug addicts often resort to illegal shotting.",
            "sent3": "His reckless shotting led to serious health issues.",
            "sent4": "The doctor explained the side effects of the shotting.",
            "sent5": "The addict's constant shotting caused harm to his body."
        },
        {
            "definition": "The act of firing a projectile.",
            "pos": "noun",
            "sent1": "The soldier's precise shotting hit the target accurately.",
            "sent2": "The ancient warriors practiced their shotting skills daily.",
            "sent3": "The pirate's shotting of the cannon scared off the enemy.",
            "sent4": "The archer's shotting was so swift it seemed like magic.",
            "sent5": "The loud shotting of the cannon echoed across the battlefield."
        }
    ]
}