{
    "term": "shotgunning",
    "meanings": [
        {
            "definition": "The act of firing a shotgun.",
            "pos": "noun",
            "sent1": "During the hunting trip, he practiced shotgunning to improve his aim.",
            "sent2": "The sound of shotgunning echoed through the forest as the hunters aimed at their targets.",
            "sent3": "The old farmer joked that his scarecrow was shotgunning away any pesky birds that came near.",
            "sent4": "The burst of feathers in the air resembled the aftermath of a rapid shotgunning of the sky.",
            "sent5": "The instructor demonstrated proper shotgunning technique to the new recruits."
        },
        {
            "definition": "The act of consuming a beverage quickly by puncturing a hole in the can or bottle.",
            "pos": "noun",
            "sent1": "At the party, they enjoyed shotgunning their sodas for a fun challenge.",
            "sent2": "She won the contest by shotgunning her energy drink in record time.",
            "sent3": "The friends laughed as they attempted shotgunning their drinks, causing spills everywhere.",
            "sent4": "The soda sprayed everywhere when he tried shotgunning it with too much force.",
            "sent5": "The group of teenagers gathered around to watch the impressive shotgunning skills of their friend."
        },
        {
            "definition": "The act of rapidly sending out multiple emails or messages.",
            "pos": "noun",
            "sent1": "The marketing team was shotgunning promotional emails to attract more customers.",
            "sent2": "He was shotgunning messages to all his friends about the upcoming party.",
            "sent3": "The boss was impressed by the employee's shotgunning of project updates to the team.",
            "sent4": "Her inbox was flooded with shotgunning of notifications from various apps.",
            "sent5": "The politician's campaign strategy involved shotgunning social media posts to reach a wider audience."
        }
    ]
}