{
    "term": "shot",
    "meanings": [
        {
            "definition": "A single photograph taken with a camera.",
            "pos": "noun",
            "sent1": "I took a shot of the sunset at the beach.",
            "sent2": "She framed the shot perfectly before clicking the camera.",
            "sent3": "The shot of the cat wearing sunglasses made me laugh.",
            "sent4": "The shot of the city skyline was breathtaking.",
            "sent5": "His shot of the rainbow was so vibrant and clear."
        },
        {
            "definition": "An attempt to hit a target with a projectile.",
            "pos": "noun",
            "sent1": "His shot at the bullseye was almost perfect.",
            "sent2": "The archer's shot landed right on the target.",
            "sent3": "The shot at the flying saucer missed by a mile.",
            "sent4": "Her shot at winning the game was successful.",
            "sent5": "The basketball player's shot from half-court was unbelievable."
        },
        {
            "definition": "A small amount of liquid, typically alcohol.",
            "pos": "noun",
            "sent1": "He poured a shot of tequila into the glass.",
            "sent2": "The bartender served a shot of whiskey to the customer.",
            "sent3": "The shot of rum in the cocktail gave it a kick.",
            "sent4": "She added a shot of vodka to the martini.",
            "sent5": "The shot of brandy warmed him up on a cold night."
        },
        {
            "definition": "A chance or opportunity to do something.",
            "pos": "noun",
            "sent1": "I'll give it a shot and see how it goes.",
            "sent2": "She decided to take a shot at learning a new language.",
            "sent3": "Taking a shot at skydiving was an exhilarating experience.",
            "sent4": "He took a shot at starting his own business.",
            "sent5": "The job interview was her shot at a better career."
        },
        {
            "definition": "A loud, sharp sound.",
            "pos": "noun",
            "sent1": "The shot of thunder startled the children.",
            "sent2": "The shot of the gun echoed through the forest.",
            "sent3": "The shot of the firecracker made everyone jump.",
            "sent4": "The shot of the cannon signaled the start of the race.",
            "sent5": "The shot of the balloon popping was unexpected."
        }
    ]
}