{
    "term": "shoulder",
    "meanings": [
        {
            "definition": "The part of the body between the neck and upper arm.",
            "pos": "noun",
            "sent1": "She felt pain in her shoulder after carrying heavy bags.",
            "sent2": "He shrugged his shoulder to show he didn't know the answer.",
            "sent3": "The little girl rested her head on her father's shoulder during the movie.",
            "sent4": "The weight of responsibility sat heavily on his shoulder.",
            "sent5": "The football player's shoulder pads protected him during the game."
        },
        {
            "definition": "A cut of meat from the upper part of an animal's foreleg.",
            "pos": "noun",
            "sent1": "The chef seasoned the shoulder of lamb before roasting it.",
            "sent2": "The butcher recommended the pork shoulder for the barbecue.",
            "sent3": "The family enjoyed a delicious roast shoulder for dinner.",
            "sent4": "The slow-cooked beef shoulder melted in your mouth.",
            "sent5": "The shoulder steak was tender and flavorful."
        },
        {
            "definition": "To carry a load on one's shoulder.",
            "pos": "verb",
            "sent1": "He would shoulder the heavy backpack during the hike.",
            "sent2": "She decided to shoulder the responsibility of organizing the event.",
            "sent3": "The young boy tried to shoulder the oversized bag but stumbled.",
            "sent4": "She had to shoulder the burden of caring for her sick grandmother.",
            "sent5": "The team worked together to shoulder the weight of the project deadline."
        },
        {
            "definition": "To push or jostle with one's shoulder.",
            "pos": "verb",
            "sent1": "He would shoulder his way through the crowded room.",
            "sent2": "She accidentally shouldered the door open with her hands full.",
            "sent3": "The playful puppy would shoulder into the other dogs during playtime.",
            "sent4": "The determined athlete shouldered past his opponents to reach the finish line.",
            "sent5": "The impatient commuter shouldered through the train station crowd."
        }
    ]
}