{
    "term": "showmanly",
    "meanings": [
        {
            "definition": "In a manner characteristic of a showman.",
            "pos": "adverb",
            "sent1": "He presented his magic tricks showmanly, with flair and excitement.",
            "sent2": "The circus performer walked showmanly across the tightrope, captivating the audience.",
            "sent3": "The magician showmanly pulled a rabbit out of his hat, much to the delight of the children.",
            "sent4": "The auctioneer's fast-talking style was showmanly, drawing in bidders with each word.",
            "sent5": "The actor delivered his lines showmanly, commanding attention on stage."
        },
        {
            "definition": "Of or relating to a showman.",
            "pos": "adjective",
            "sent1": "The showmanly costume worn by the ringmaster was adorned with sequins and feathers.",
            "sent2": "The circus tent had a showmanly atmosphere, filled with bright lights and lively music.",
            "sent3": "The showmanly smile of the magician hinted at the surprises to come during the performance.",
            "sent4": "Her showmanly gestures on stage added to the excitement of the magic show.",
            "sent5": "The showmanly voice of the announcer boomed through the arena, announcing the next act."
        },
        {
            "definition": "Displaying qualities of showmanship.",
            "pos": "adjective",
            "sent1": "The showmanly performer captivated the audience with his daring stunts.",
            "sent2": "The showmanly presentation of the product launch impressed the investors.",
            "sent3": "The showmanly behavior of the host kept the guests entertained throughout the event.",
            "sent4": "Her showmanly entrance on the red carpet turned heads and cameras alike.",
            "sent5": "The showmanly performance of the acrobat left the crowd in awe of his skills."
        }
    ]
}