{
    "term": "showgirl",
    "meanings": [
        {
            "definition": "A woman who performs in a show, typically in a glamorous or revealing costume.",
            "pos": "noun",
            "sent1": "The showgirl dazzled the audience with her sparkling costume.",
            "sent2": "The showgirl gracefully danced across the stage in her sequined outfit.",
            "sent3": "The showgirl accidentally tripped over her long feather boa during the performance.",
            "sent4": "Her presence on stage was like a radiant showgirl in a sea of ordinary performers.",
            "sent5": "The showgirl's glamorous attire shone under the bright lights, captivating everyone."
        },
        {
            "definition": "A female performer in a nightclub or cabaret show.",
            "pos": "noun",
            "sent1": "The showgirl entertained the crowd with her energetic dance moves.",
            "sent2": "In the dimly lit cabaret, the showgirl's voice filled the room with melody.",
            "sent3": "The showgirl playfully interacted with the audience, making them laugh.",
            "sent4": "She was the star of the cabaret, a showgirl shining brighter than the rest.",
            "sent5": "The showgirl's performance in the nightclub was the highlight of the evening."
        },
        {
            "definition": "A woman who dances or sings in a theatrical production.",
            "pos": "noun",
            "sent1": "The showgirl practiced her dance routine tirelessly for the upcoming play.",
            "sent2": "Her voice echoed through the theater as she sang her solo like a true showgirl.",
            "sent3": "During rehearsals, the showgirl accidentally bumped into the stage prop, causing a commotion.",
            "sent4": "She was a showgirl on stage, but offstage, she was a shy and reserved individual.",
            "sent5": "The showgirl's performance in the play left a lasting impression on the audience."
        }
    ]
}