{
    "term": "shrove",
    "meanings": [
        {
            "definition": "Past tense of shrive: to hear the confession of, assign penance to, and absolve",
            "pos": "verb",
            "sent1": "The priest shrove the sinner of his wrongdoings.",
            "sent2": "Yesterday, I shrove my sins and felt relieved.",
            "sent3": "The cat shrove itself of guilt by knocking over the vase.",
            "sent4": "The sun shrove away the morning mist, revealing a clear sky.",
            "sent5": "She shrove her fears by facing them head-on."
        },
        {
            "definition": "Simple past tense of shrive: to confess and receive absolution",
            "pos": "verb",
            "sent1": "He shrove his sins to the priest and found peace.",
            "sent2": "After the confession, she shrove herself and felt forgiven.",
            "sent3": "The naughty puppy shrove its mischief to the forgiving owner.",
            "sent4": "The rain shrove the city clean, washing away all dirt.",
            "sent5": "The apology shrove the tension between them, restoring harmony."
        },
        {
            "definition": "Simple past tense of shrive: to hear the confession of and give absolution to",
            "pos": "verb",
            "sent1": "The wise old man shrove many troubled souls in his lifetime.",
            "sent2": "The priest shrove the penitent with kindness and understanding.",
            "sent3": "The magical tree shrove the lost travelers, guiding them home.",
            "sent4": "Her words shrove his doubts, leaving him with clarity.",
            "sent5": "The forgiveness shrove the heavy burden from her heart."
        },
        {
            "definition": "Simple past tense of shrive: to confess and be absolved",
            "pos": "verb",
            "sent1": "She shrove her sins honestly and was granted forgiveness.",
            "sent2": "The guilty man shrove himself before the judgment of the court.",
            "sent3": "The river shrove its pollution as the clean water flowed in.",
            "sent4": "The truth shrove through the lies, revealing the reality.",
            "sent5": "His apology shrove the tension, paving the way for reconciliation."
        }
    ]
}