{
    "term": "shunter",
    "meanings": [
        {
            "definition": "A person or thing that shunts or moves something from one place to another.",
            "pos": "noun",
            "sent1": "The shunter quickly moved the boxes to the other side of the room.",
            "sent2": "The factory had a reliable shunter to transfer goods between departments.",
            "sent3": "The little robot acted as a shunter, zipping around the warehouse with ease.",
            "sent4": "Her hands were like skilled shunters, effortlessly rearranging the items on the shelves.",
            "sent5": "The shunter, a helpful assistant, made the task of relocating items a breeze."
        },
        {
            "definition": "A railway employee responsible for moving trains or carriages in a yard.",
            "pos": "noun",
            "sent1": "The shunter guided the train safely into the station.",
            "sent2": "The experienced shunter efficiently directed the carriages along the tracks.",
            "sent3": "The shunter's job was to make sure the trains played a game of musical chairs.",
            "sent4": "The shunter orchestrated the dance of the carriages with precision and skill.",
            "sent5": "Every morning, the shunter greeted the trains with a wave, ready to start the day's work."
        },
        {
            "definition": "A device used to move railway carriages from one track to another.",
            "pos": "noun",
            "sent1": "The shunter smoothly transferred the carriages to the correct track.",
            "sent2": "The old shunter had been in use for decades, aiding in the smooth operation of the railway yard.",
            "sent3": "The shunter hummed happily as it carried out its duty of track switching.",
            "sent4": "The shiny new shunter gleamed under the sun, ready to assist in the railway operations.",
            "sent5": "With a gentle push, the shunter nudged the carriages onto the right path, ensuring a seamless journey."
        }
    ]
}