{
    "term": "shylocked",
    "meanings": [
        {
            "definition": "To lend money at exorbitant rates of interest.",
            "pos": "verb",
            "sent1": "The greedy man shylocked his friend, demanding high interest on a small loan.",
            "sent2": "The loan shark shylocked the desperate borrower, making it hard for them to repay.",
            "sent3": "The sneaky cat shylocked the mouse, asking for extra cheese as interest.",
            "sent4": "The dark clouds shylocked the land, withholding rain until a heavy price was paid.",
            "sent5": "The sun shylocked the flowers, demanding extra warmth for their growth."
        },
        {
            "definition": "To extort money from someone by lending it at high rates of interest.",
            "pos": "verb",
            "sent1": "The villain shylocked the townspeople, forcing them to pay back double what they borrowed.",
            "sent2": "The unscrupulous lender shylocked the naive borrower, making them pay a hefty sum in interest.",
            "sent3": "The mischievous leprechaun shylocked the children, asking for gold coins as interest on borrowed toys.",
            "sent4": "The storm clouds shylocked the sky, demanding lightning as payment for lending rain.",
            "sent5": "The cold wind shylocked the trees, taking extra leaves as interest for providing shade."
        },
        {
            "definition": "To act as a ruthless moneylender.",
            "pos": "verb",
            "sent1": "The heartless banker shylocked those in need, showing no mercy in lending money.",
            "sent2": "The cruel creditor shylocked the struggling families, making it impossible for them to escape debt.",
            "sent3": "The playful puppy shylocked the other dogs, asking for extra treats as payment for lending toys.",
            "sent4": "The relentless waves shylocked the shore, taking away sand as interest for providing the beach.",
            "sent5": "The strict teacher shylocked the students, demanding extra homework as payment for lending textbooks."
        }
    ]
}