{
    "term": "sidetracked",
    "meanings": [
        {
            "definition": "Distracted or diverted from the main topic or goal.",
            "pos": "adjective",
            "sent1": "She felt sidetracked by the interesting book and forgot about her homework.",
            "sent2": "The students were sidetracked by the sudden appearance of a puppy in the classroom.",
            "sent3": "The cat seemed sidetracked by the laser pointer, chasing it around in circles.",
            "sent4": "Her mind was like a train on a sidetracked journey, exploring new thoughts and ideas.",
            "sent5": "The colorful distractions in the room left her feeling completely sidetracked from her work."
        },
        {
            "definition": "To divert onto a side track or away from the main path.",
            "pos": "verb",
            "sent1": "The hikers decided to sidetrack through the forest to explore the hidden waterfall.",
            "sent2": "The delivery truck was forced to sidetrack due to a fallen tree blocking the road.",
            "sent3": "The mischievous squirrel managed to sidetrack the dog, leading it on a chase through the park.",
            "sent4": "His thoughts would often sidetrack to memories of his childhood home, far away.",
            "sent5": "The detective had to sidetrack from the main investigation to follow a promising lead."
        },
        {
            "definition": "To cause someone to become distracted or lose focus.",
            "pos": "verb",
            "sent1": "The noisy construction outside sidetracked her from studying for the exam.",
            "sent2": "The unexpected phone call sidetracked him from finishing his work on time.",
            "sent3": "The magician used a clever trick to sidetrack the audience's attention away from his sleight of hand.",
            "sent4": "Her constant questions would sidetrack the teacher during the lesson.",
            "sent5": "The delicious smell of freshly baked cookies sidetracked her from her diet plans."
        }
    ]
}