{
    "term": "sidh",
    "meanings": [
        {
            "definition": "A fairy mound or hill in Irish folklore.",
            "pos": "noun",
            "sent1": "The children believed the sidh was where fairies lived.",
            "sent2": "The locals often spoke of the sidh with reverence.",
            "sent3": "The sidh seemed to shimmer in the moonlight, like a magical hill.",
            "sent4": "Her imagination turned the sidh into a gateway to another world.",
            "sent5": "The sidh stood out in the landscape, mysterious and enchanting."
        },
        {
            "definition": "A type of supernatural being in Celtic mythology.",
            "pos": "noun",
            "sent1": "Legends tell of the sidh appearing to travelers in the forest.",
            "sent2": "The sidh was said to possess magical powers beyond human understanding.",
            "sent3": "The mischievous sidh played pranks on unsuspecting villagers.",
            "sent4": "Her grandmother described the sidh as ethereal beings of great beauty.",
            "sent5": "The sidh's presence filled the air with an otherworldly energy."
        },
        {
            "definition": "A type of ancient Irish burial mound.",
            "pos": "noun",
            "sent1": "Archaeologists discovered an ancient sidh during their excavation.",
            "sent2": "The locals believed the sidh held the spirits of their ancestors.",
            "sent3": "The sidh was a silent witness to centuries of Irish history.",
            "sent4": "The sidh loomed on the horizon, a reminder of the past.",
            "sent5": "The sidh's presence evoked a sense of reverence and mystery."
        },
        {
            "definition": "A place or realm of the fairies in Irish mythology.",
            "pos": "noun",
            "sent1": "The sidh was said to be a magical realm hidden from mortal eyes.",
            "sent2": "Children often dreamed of visiting the sidh and meeting fairies.",
            "sent3": "The sidh was rumored to be a doorway to the fairy kingdom.",
            "sent4": "The sidh's beauty was said to rival that of the most enchanting gardens.",
            "sent5": "The sidh beckoned to those who believed in the magic of the fae."
        }
    ]
}