{
    "term": "sight",
    "meanings": [
        {
            "definition": "The ability to see",
            "pos": "noun",
            "sent1": "Her sight improved after getting glasses.",
            "sent2": "The beautiful sunset was a pleasant sight.",
            "sent3": "He couldn't believe his sight when he saw a flying pig.",
            "sent4": "The sight of the vast ocean filled her with awe.",
            "sent5": "The sight of the rainbow after the rain was breathtaking."
        },
        {
            "definition": "Something that is seen",
            "pos": "noun",
            "sent1": "The mysterious sight in the forest intrigued them.",
            "sent2": "The old ruins were a fascinating sight to explore.",
            "sent3": "The unusual sight of a cat wearing sunglasses made everyone laugh.",
            "sent4": "The shooting star was a rare sight in the night sky.",
            "sent5": "The sight of the full moon on a clear night was mesmerizing."
        },
        {
            "definition": "A device used for aiming a firearm",
            "pos": "noun",
            "sent1": "He adjusted the sight on his rifle for better accuracy.",
            "sent2": "The sniper carefully looked through the sight of his gun.",
            "sent3": "The sight on the pistol was broken, making it hard to aim.",
            "sent4": "The red dot sight helped him hit the target with precision.",
            "sent5": "The holographic sight made aiming much easier during the competition."
        },
        {
            "definition": "A view or glimpse of something",
            "pos": "noun",
            "sent1": "The hikers enjoyed the breathtaking sight from the mountaintop.",
            "sent2": "The quick sight of a shooting star brought them luck.",
            "sent3": "The unexpected sight of a rainbow in the desert amazed them.",
            "sent4": "The first sight of the city skyline took her breath away.",
            "sent5": "The sight of the rare bird species was a highlight of their trip."
        }
    ]
}