{
    "term": "signum",
    "meanings": [
        {
            "definition": "A mark or symbol indicating something",
            "pos": "noun",
            "sent1": "The teacher put a signum on the correct answers.",
            "sent2": "The stop sign is a common signum on the road.",
            "sent3": "The signum on the map led them to a hidden treasure.",
            "sent4": "Her smile was a signum of happiness.",
            "sent5": "The bright star served as a signum for the sailors to follow."
        },
        {
            "definition": "An indication or evidence of something",
            "pos": "noun",
            "sent1": "The dark clouds were a signum of an approaching storm.",
            "sent2": "A high fever can be a signum of illness.",
            "sent3": "His messy room was a signum that he needed to clean up.",
            "sent4": "The broken window was a signum of a break-in.",
            "sent5": "The footprints in the snow were a clear signum of someone passing by."
        },
        {
            "definition": "A gesture or action used to convey a message",
            "pos": "noun",
            "sent1": "A nod can be a signum of agreement.",
            "sent2": "She waved as a signum of goodbye.",
            "sent3": "His wink was a playful signum to keep a secret.",
            "sent4": "The raised hand was a signum to ask a question.",
            "sent5": "The thumbs up was a signum of approval."
        },
        {
            "definition": "A signal or warning",
            "pos": "noun",
            "sent1": "The siren blared as a signum of danger.",
            "sent2": "The red flag was a signum to stop.",
            "sent3": "The loud thunder was a signum of an approaching storm.",
            "sent4": "The flashing lights were a signum to pull over.",
            "sent5": "The ringing bell was a signum for the students to return to class."
        },
        {
            "definition": "A symbol used in music to indicate pitch or tempo",
            "pos": "noun",
            "sent1": "The conductor pointed to the signum for a change in tempo.",
            "sent2": "The signum for a high note was marked on the sheet music.",
            "sent3": "The musician missed the signum for a key change.",
            "sent4": "The signum for a crescendo indicated a gradual increase in volume.",
            "sent5": "The signum for a rest meant the musician should pause for a moment."
        }
    ]
}