{
    "term": "signories",
    "meanings": [
        {
            "definition": "A territory or domain ruled by a lord or noble.",
            "pos": "noun",
            "sent1": "The signories of the ancient king were vast lands with many villages.",
            "sent2": "The lord's signories extended across the countryside, showcasing his power.",
            "sent3": "The noble's signories were so large that he needed a map just to find his own castle!",
            "sent4": "Her influence over the signories was like a protective shield, keeping her people safe.",
            "sent5": "The signories were like puzzle pieces, each fitting perfectly into the lord's realm."
        },
        {
            "definition": "The authority or power of a lord or noble over a territory.",
            "pos": "noun",
            "sent1": "The signories granted the lord the ability to make important decisions for his people.",
            "sent2": "With great responsibility comes the authority over signories and their inhabitants.",
            "sent3": "The noble's authority over the signories was so strong that even the birds obeyed his commands!",
            "sent4": "Her power over the signories was like a beacon, guiding her subjects through troubled times.",
            "sent5": "The authority of the signories was undeniable, marking the lord as a true leader."
        },
        {
            "definition": "The office or position of a lord or noble in charge of a territory.",
            "pos": "noun",
            "sent1": "The signories required the noble to be present at all times to oversee their management.",
            "sent2": "The lord's duties in the signories included ensuring the well-being of all residents.",
            "sent3": "The noble's office in the signories was so grand that it had its own personal library!",
            "sent4": "Her position in the signories was like a crown, symbolizing her authority and responsibility.",
            "sent5": "The office of the signories was a place of honor, where the noble served with dedication and pride."
        }
    ]
}