{
    "term": "signalling",
    "meanings": [
        {
            "definition": "An act or gesture used to convey information or instructions.",
            "pos": "noun",
            "sent1": "The signalling from the lighthouse helped the ships navigate safely through the storm.",
            "sent2": "The traffic lights are important for signalling drivers when to stop and go.",
            "sent3": "The squirrel's frantic signalling with its tail warned the other animals of the approaching danger.",
            "sent4": "The teacher's raised hand was a clear signalling for the students to quiet down.",
            "sent5": "The smoke rising from the chimney was a signalling that dinner was ready."
        },
        {
            "definition": "The use of signals for communication or guidance.",
            "pos": "noun",
            "sent1": "The mountain climbers relied on the signalling of flags to communicate with each other from a distance.",
            "sent2": "The military uses various methods of signalling to coordinate movements on the battlefield.",
            "sent3": "The birds' chirping seemed like a secret signalling code to the forest creatures.",
            "sent4": "The flickering of the campfire was a comforting signalling of warmth and safety.",
            "sent5": "The bright neon sign was a clear signalling of the restaurant's location in the dark city streets."
        },
        {
            "definition": "The act of making signals.",
            "pos": "noun",
            "sent1": "The signalling of the referee indicated the end of the match.",
            "sent2": "The hiker's signalling with a mirror caught the attention of the rescue team.",
            "sent3": "The cat's tail signalling playfulness made everyone in the room smile.",
            "sent4": "The waving of the flag was a proud signalling of national unity.",
            "sent5": "The flashing lights on the police car were a clear signalling for other drivers to pull over."
        }
    ]
}