{
    "term": "sijo",
    "meanings": [
        {
            "definition": "A traditional Korean form of poetry consisting of three lines with a syllable count of 14-16-14.",
            "pos": "noun",
            "sent1": "In Korean literature, a sijo is a unique type of poem with a specific structure.",
            "sent2": "I learned about sijo poems in my Korean language class.",
            "sent3": "The sijo poem danced off the page, captivating the reader with its rhythm.",
            "sent4": "Her words in the sijo were like musical notes, creating a symphony of emotions.",
            "sent5": "The sijo painted a vivid picture of nature's beauty in just a few lines."
        },
        {
            "definition": "A type of Korean folk song typically sung in a call-and-response format.",
            "pos": "noun",
            "sent1": "The villagers gathered around the fire, singing a lively sijo together.",
            "sent2": "The sijo echoed through the mountains, carrying stories of old traditions.",
            "sent3": "The children giggled as they tried to mimic the sijo's playful melody.",
            "sent4": "The sijo's tune intertwined with the wind, creating a harmonious duet.",
            "sent5": "Listening to the sijo was like taking a musical journey through Korean culture."
        },
        {
            "definition": "A genre of Korean classical music characterized by its use of traditional instruments and melodies.",
            "pos": "noun",
            "sent1": "The concert featured a beautiful performance of a traditional sijo piece.",
            "sent2": "The sijo music filled the hall with rich, cultural sounds.",
            "sent3": "The musicians' skillful hands brought the sijo to life in a mesmerizing way.",
            "sent4": "The sijo's melody wove through the air, enchanting all who listened.",
            "sent5": "Attending a sijo concert is a delightful way to experience Korean musical heritage."
        }
    ]
}