{
    "term": "sim",
    "meanings": [
        {
            "definition": "A prefix meaning 'similar to' or 'resembling'",
            "pos": "noun",
            "sent1": "The word 'sim' is used as a prefix to show things are alike.",
            "sent2": "In science, 'sim' is added to words to mean they are similar.",
            "sent3": "When playing a word game, 'sim' can help you find words that look alike.",
            "sent4": "The artist's painting was a sim of the beautiful sunset.",
            "sent5": "The sim between the two paintings was striking."
        },
        {
            "definition": "A simulation or imitation of something",
            "pos": "noun",
            "sent1": "The flight sim on the computer felt so real!",
            "sent2": "The sim of the roller coaster ride was thrilling.",
            "sent3": "The sim of the haunted house made everyone jump.",
            "sent4": "The sim of the car race was so lifelike.",
            "sent5": "The sim of the space mission was out of this world."
        },
        {
            "definition": "A type of card game involving matching pairs",
            "pos": "noun",
            "sent1": "Let's play a quick round of sim before dinner.",
            "sent2": "The kids enjoyed playing sim during recess.",
            "sent3": "The sim tournament at the community center was a hit.",
            "sent4": "She always wins at sim because she has a good memory.",
            "sent5": "The sim deck was beautifully illustrated."
        },
        {
            "definition": "A unit of measurement for electrical conductance",
            "pos": "noun",
            "sent1": "The scientist measured the sim of the new material.",
            "sent2": "The sim of the wire determined its conductivity.",
            "sent3": "The sim of the circuit was crucial for the experiment.",
            "sent4": "The sim of the solution affected the overall performance.",
            "sent5": "The sim of the component was higher than expected."
        }
    ]
}