{
    "term": "sings",
    "meanings": [
        {
            "definition": "To make musical sounds with the voice",
            "pos": "verb",
            "sent1": "She sings beautifully in the choir.",
            "sent2": "The bird sings a lovely tune every morning.",
            "sent3": "The cat sings along with the music on TV.",
            "sent4": "The wind sings through the trees on a calm night.",
            "sent5": "His heart sings with joy when he hears her voice."
        },
        {
            "definition": "To produce musical notes by means of the voice",
            "pos": "verb",
            "sent1": "He sings his favorite song at karaoke.",
            "sent2": "The opera singer sings with great passion.",
            "sent3": "The dog sings along to the harmonica playing.",
            "sent4": "The kettle sings when the water boils.",
            "sent5": "The violin sings sweetly in the hands of the musician."
        },
        {
            "definition": "To perform songs vocally",
            "pos": "verb",
            "sent1": "The band sings at the local bar every Friday.",
            "sent2": "She sings with emotion during her solo.",
            "sent3": "The baby sings a lullaby to the teddy bear.",
            "sent4": "The stars sing a silent melody in the night sky.",
            "sent5": "The choir sings in perfect harmony at the concert."
        },
        {
            "definition": "To give voice to a melody",
            "pos": "verb",
            "sent1": "He sings a tune that touches the heart.",
            "sent2": "The children sing together in the school play.",
            "sent3": "The robot sings a mechanical song for fun.",
            "sent4": "The river sings a soothing melody as it flows.",
            "sent5": "The nightingale sings a sweet melody in the garden."
        },
        {
            "definition": "To express oneself in musical tones",
            "pos": "verb",
            "sent1": "She sings her feelings through the lyrics.",
            "sent2": "The musician sings his emotions through the guitar.",
            "sent3": "The parrot sings a funny song to entertain.",
            "sent4": "The rain sings a melancholic tune on the roof.",
            "sent5": "The heart sings a melody of love in his presence."
        }
    ]
}