{
    "term": "singed",
    "meanings": [
        {
            "definition": "To burn superficially or slightly",
            "pos": "verb",
            "sent1": "She accidentally singed the edge of her shirt while cooking.",
            "sent2": "The chef carefully singed the marshmallows on top of the cake.",
            "sent3": "The cat singed its whiskers while investigating the candle flame.",
            "sent4": "The setting sun seemed to singe the clouds with its fiery glow.",
            "sent5": "The campfire's flames leaped up to singe the overhanging branches."
        },
        {
            "definition": "To scorch or char the surface of",
            "pos": "verb",
            "sent1": "The iron was too hot and singed the fabric.",
            "sent2": "The toast was singed around the edges but still edible.",
            "sent3": "The dragon's breath singed the knight's armor, leaving black marks.",
            "sent4": "The intense heat of the desert sun seemed to singe the earth itself.",
            "sent5": "The candle flame flickered dangerously close, threatening to singe the curtains."
        },
        {
            "definition": "To burn off the feathers, bristles, or hair from",
            "pos": "verb",
            "sent1": "The chef singed the feathers off the chicken before cooking.",
            "sent2": "The farmer singed the pig's bristles before butchering it.",
            "sent3": "The barber accidentally singed off a customer's hair while styling.",
            "sent4": "The fire quickly singed the bird's feathers as it flew too close.",
            "sent5": "The candle flame danced dangerously close, threatening to singe the cat's fur."
        },
        {
            "definition": "To burn slightly or superficially",
            "pos": "verb",
            "sent1": "The match singed his fingertips as he lit the candle.",
            "sent2": "The fire singed the edges of the paper, leaving a smoky smell.",
            "sent3": "The careless camper singed the grass with a stray ember.",
            "sent4": "The hot pan singed the pancake, giving it a crispy edge.",
            "sent5": "The sparks from the bonfire seemed to singe the night sky."
        },
        {
            "definition": "To burn the ends, projections, nap, or the like, of (hair, cloth, etc.)",
            "pos": "verb",
            "sent1": "She accidentally singed the ends of her scarf while ironing.",
            "sent2": "The candle flame singed the edge of the tablecloth during dinner.",
            "sent3": "The hair stylist carefully singed the split ends of the client's hair.",
            "sent4": "The campfire singed the hem of his pants as he sat too close.",
            "sent5": "The sparks from the bonfire seemed to singe the night sky."
        }
    ]
}