{
    "term": "singles",
    "meanings": [
        {
            "definition": "A person who is not married.",
            "pos": "noun",
            "sent1": "My aunt is one of the singles in our family.",
            "sent2": "There are many singles at the event looking to meet new people.",
            "sent3": "The singles at the party were joking about the struggles of dating.",
            "sent4": "In a world full of couples, being a single can sometimes feel like being a rare gem.",
            "sent5": "The singles club organizes fun activities for unmarried individuals."
        },
        {
            "definition": "A hit in baseball that allows the batter to reach first base.",
            "pos": "noun",
            "sent1": "The player's powerful swing resulted in a singles hit.",
            "sent2": "He celebrated after getting a singles during the game.",
            "sent3": "The singles hit surprised the opposing team's pitcher.",
            "sent4": "His consistent singles hits helped the team secure a victory.",
            "sent5": "The coach praised the player for his perfect singles hit."
        },
        {
            "definition": "A type of music release with one main track.",
            "pos": "noun",
            "sent1": "The band's new singles quickly climbed the music charts.",
            "sent2": "Fans eagerly awaited the release of the latest singles from the artist.",
            "sent3": "The singles from the album became instant favorites among listeners.",
            "sent4": "The catchy singles from the band's album played on the radio all day.",
            "sent5": "The artist's singles showcased their unique musical style."
        },
        {
            "definition": "A type of tennis or badminton match with one player on each side.",
            "pos": "noun",
            "sent1": "She won the singles match with her powerful serves.",
            "sent2": "The singles game was intense as both players fought for every point.",
            "sent3": "The singles match ended with a surprising comeback from the underdog.",
            "sent4": "Playing singles requires a different strategy compared to doubles.",
            "sent5": "The singles tournament attracted top players from around the world."
        },
        {
            "definition": "A type of room in a hotel with one bed.",
            "pos": "noun",
            "sent1": "I booked a singles room for my short stay in the city.",
            "sent2": "The hotel offered comfortable singles rooms for solo travelers.",
            "sent3": "The singles room had a cozy atmosphere perfect for relaxation.",
            "sent4": "The singles room overlooked a beautiful view of the city skyline.",
            "sent5": "The hotel's singles room provided a peaceful retreat after a long day."
        }
    ]
}