{
    "term": "sinking",
    "meanings": [
        {
            "definition": "Descending below the surface of water or another liquid.",
            "pos": "adjective",
            "sent1": "The sinking ship slowly disappeared beneath the waves.",
            "sent2": "The diver watched the sinking sun reflect on the water.",
            "sent3": "The sinking feeling of losing his favorite toy made Timmy pout.",
            "sent4": "Her sinking hopes were like a shipwreck in a stormy sea.",
            "sent5": "The sinking sensation in his stomach told him he was falling fast."
        },
        {
            "definition": "Dropping or falling to a lower level.",
            "pos": "verb",
            "sent1": "The rock is sinking into the soft mud.",
            "sent2": "I can feel the ground sinking beneath my feet.",
            "sent3": "The cake started sinking in the middle as it cooled.",
            "sent4": "His heart sank as he watched his dreams sinking away.",
            "sent5": "The sun was sinking below the horizon, painting the sky in hues of orange."
        },
        {
            "definition": "Becoming weaker or less successful.",
            "pos": "adjective",
            "sent1": "The sinking company struggled to stay afloat in the market.",
            "sent2": "Her sinking grades were a cause for concern.",
            "sent3": "The sinking economy made everyone tighten their belts.",
            "sent4": "The sinking team needed a miracle to turn their luck around.",
            "sent5": "The sinking feeling of defeat lingered in the air."
        },
        {
            "definition": "Feeling sadness or despair.",
            "pos": "adjective",
            "sent1": "She had a sinking feeling in her heart as she read the sad news.",
            "sent2": "The sinking mood in the room was palpable.",
            "sent3": "His sinking spirits lifted when he saw his best friend.",
            "sent4": "The sinking clouds mirrored her gloomy thoughts.",
            "sent5": "The sinking weight of sorrow pressed down on her shoulders."
        }
    ]
}