{
    "term": "sink",
    "meanings": [
        {
            "definition": "A basin with a water supply and drainage system for washing and cooking.",
            "pos": "noun",
            "sent1": "The kitchen had a shiny white sink for washing dishes.",
            "sent2": "I filled the sink with soapy water to clean the vegetables.",
            "sent3": "The mischievous cat jumped into the sink and got all wet.",
            "sent4": "Her laughter echoed in the empty kitchen, filling the silence like water in a sink.",
            "sent5": "The sink gleamed under the bright kitchen lights, inviting me to wash my hands."
        },
        {
            "definition": "To descend or submerge in water or other liquid.",
            "pos": "verb",
            "sent1": "The boat began to sink slowly into the calm lake.",
            "sent2": "I watched the ship sink beneath the waves in the stormy sea.",
            "sent3": "As the ice cream melted, the cone started to sink into a sticky mess.",
            "sent4": "His heart sank as he realized he had missed the last train home.",
            "sent5": "The sun seemed to sink into the horizon, painting the sky with vibrant colors."
        },
        {
            "definition": "To decrease or fall to a lower level.",
            "pos": "verb",
            "sent1": "The temperature will sink overnight, so remember to bring a jacket.",
            "sent2": "After the news broke, the company's stocks began to sink rapidly.",
            "sent3": "His hopes sank when he saw the disappointing test results.",
            "sent4": "The sinking feeling in her stomach told her something was wrong.",
            "sent5": "The old building started to sink into disrepair as the years passed by."
        },
        {
            "definition": "To become embedded or stuck.",
            "pos": "verb",
            "sent1": "The key got stuck and wouldn't sink into the lock.",
            "sent2": "The heavy boots sank into the soft mud of the swamp.",
            "sent3": "She felt her feet sink into the plush carpet of the luxurious hotel.",
            "sent4": "The words of wisdom from her grandmother sank deep into her heart.",
            "sent5": "The memory of their laughter sank into her mind, bringing a smile to her face."
        }
    ]
}