{
    "term": "sinks",
    "meanings": [
        {
            "definition": "To descend or submerge in water or other liquid.",
            "pos": "verb",
            "sent1": "The boat slowly sinks into the calm lake.",
            "sent2": "When you fill the bathtub, the water sinks as you step in.",
            "sent3": "The sponge sinks in the soapy water, ready to clean.",
            "sent4": "Her heart sinks like a heavy stone in the ocean of emotions.",
            "sent5": "The sun sinks below the horizon, just like the ship in the sea."
        },
        {
            "definition": "A basin with a water supply and drainage system, used for washing hands or dishes.",
            "pos": "noun",
            "sent1": "The kitchen sink is where we wash our dirty dishes.",
            "sent2": "She filled the sink with warm water to wash her hands.",
            "sent3": "The sink in the bathroom is like a mini pool for tiny toys.",
            "sent4": "The sink in the garden collects rainwater like a thirsty bowl.",
            "sent5": "The sink in the school cafeteria is always full of noisy chatter."
        },
        {
            "definition": "To decrease or fall to a lower level.",
            "pos": "verb",
            "sent1": "As the temperature drops, the demand for ice cream sinks.",
            "sent2": "The value of the old coin sinks as time passes.",
            "sent3": "His hopes sink like a deflating balloon in the wind.",
            "sent4": "The sun sinks behind the mountains, casting long shadows.",
            "sent5": "The anchor sinks into the sand, holding the boat in place."
        },
        {
            "definition": "A feeling of sadness or despair.",
            "pos": "noun",
            "sent1": "After the loss, a deep sink of sorrow filled her heart.",
            "sent2": "The news of the accident brought a sink of gloom over the town.",
            "sent3": "His face showed a sink of disappointment when he lost the game.",
            "sent4": "The sink of loneliness enveloped her like a heavy fog.",
            "sent5": "The sink of regret weighed heavily on his mind, like a burden."
        }
    ]
}