{
    "term": "sistra",
    "meanings": [
        {
            "definition": "a musical instrument consisting of a metal frame with small metal disks or rings that jingle when shaken",
            "pos": "noun",
            "sent1": "During the parade, the dancer shook the sistrum to create joyful sounds.",
            "sent2": "The musician played the sistra beautifully, adding a magical touch to the melody.",
            "sent3": "The sistrum's jingling made everyone at the party start dancing uncontrollably.",
            "sent4": "Her laughter echoed like the jingle of a sistrum, filling the room with happiness.",
            "sent5": "The sistrum's metallic chime resonated through the hall, enchanting all who listened."
        },
        {
            "definition": "plural of sistrum, an ancient Egyptian percussion instrument",
            "pos": "noun",
            "sent1": "In the museum, you can see many ancient sistra displayed in glass cases.",
            "sent2": "Archaeologists discovered a tomb filled with various ancient sistra.",
            "sent3": "The classroom erupted in laughter when the teacher accidentally dropped the sistra.",
            "sent4": "The sound of the sistra echoed through the valley, connecting the past to the present.",
            "sent5": "The rhythmic beats of the ancient sistra transported the listeners to a bygone era."
        },
        {
            "definition": "a plural form of sistrum, a sacred rattle used in ancient Egypt in religious ceremonies",
            "pos": "noun",
            "sent1": "The priests carried the sistra with reverence during the sacred ritual.",
            "sent2": "The temple walls resonated with the sound of the sacred sistra.",
            "sent3": "The mischievous child tried to sneak a peek at the sacred sistra during the ceremony.",
            "sent4": "The sacred sistra's vibrations seemed to cleanse the air of negativity.",
            "sent5": "The sacred sistra's gentle jingle filled the temple with divine energy."
        }
    ]
}