{
    "term": "sit",
    "meanings": [
        {
            "definition": "To be seated",
            "pos": "verb",
            "sent1": "I sit on the chair during class.",
            "sent2": "Please sit down and listen to the teacher.",
            "sent3": "The cat likes to sit on my lap and purr.",
            "sent4": "The old tree seemed to sit peacefully in the meadow.",
            "sent5": "As the sun set, I found a comfortable spot to sit and watch the colors change."
        },
        {
            "definition": "To occupy a seat",
            "pos": "verb",
            "sent1": "I sit in the front row of the classroom.",
            "sent2": "The passengers sit quietly on the train.",
            "sent3": "The teddy bear always gets the best seat to sit in the toy car.",
            "sent4": "The idea seemed to sit well with the team, so they decided to move forward.",
            "sent5": "The aroma of freshly baked cookies made it hard for me to sit still in my seat."
        },
        {
            "definition": "To be in a position of rest or support",
            "pos": "verb",
            "sent1": "After a long day, I like to sit on the couch and relax.",
            "sent2": "The baby sits in the high chair during mealtime.",
            "sent3": "The tired dog would sit by the fireplace to warm up.",
            "sent4": "The memories of her childhood would sit heavily on her heart.",
            "sent5": "The old swing in the park seemed to sit there invitingly, waiting for someone to enjoy it."
        },
        {
            "definition": "To be located or situated",
            "pos": "verb",
            "sent1": "The house sits at the end of the street.",
            "sent2": "The small town sits near the mountains.",
            "sent3": "The colorful flowers sit beautifully in the garden.",
            "sent4": "The ancient ruins sit silently in the vast desert.",
            "sent5": "The old lighthouse sits proudly on the rocky cliff, guiding ships to safety."
        }
    ]
}