{
    "term": "skankers",
    "meanings": [
        {
            "definition": "Skankers (noun): A person who engages in promiscuous or immoral behavior.",
            "pos": "noun",
            "sent1": "Sheila was known as one of the local skankers for her wild parties.",
            "sent2": "The tabloids often portray celebrities as skankers for their scandalous relationships.",
            "sent3": "At the costume party, everyone jokingly called Bob a skankers for his outrageous outfit.",
            "sent4": "The gossip magazine labeled the actress as a skankers, stirring up controversy.",
            "sent5": "In the school play, the character of the skankers was played with exaggerated flair."
        },
        {
            "definition": "Skankers (verb): To dance in a lewd or provocative manner.",
            "pos": "verb",
            "sent1": "During the dance competition, she decided to skankers to impress the judges.",
            "sent2": "At the club, the dancers started to skankers when the DJ played a catchy tune.",
            "sent3": "The wedding guests were surprised when the elderly couple began to skankers on the dance floor.",
            "sent4": "The music video featured dancers skankers in neon lights, creating a mesmerizing effect.",
            "sent5": "In the movie, the protagonist learned to skankers to win the heart of their love interest."
        },
        {
            "definition": "Skankers (adjective): Describing something or someone as dirty, unkempt, or unpleasant.",
            "pos": "adjective",
            "sent1": "The abandoned house had a skankers smell that made everyone hold their noses.",
            "sent2": "The alley behind the restaurant was filled with skankers garbage bags waiting to be collected.",
            "sent3": "The old rug in the living room looked skankers after years of wear and tear.",
            "sent4": "The pond water turned a skankers green color due to pollution in the area.",
            "sent5": "The cafeteria served a skankers meal that no one wanted to eat."
        }
    ]
}