{
    "term": "skanker",
    "meanings": [
        {
            "definition": "A person who dances in a sexually suggestive manner.",
            "pos": "noun",
            "sent1": "The skanker at the party was moving provocatively on the dance floor.",
            "sent2": "She was known as the skanker of the group due to her seductive dance moves.",
            "sent3": "The skanker's moves were so bold that everyone couldn't help but watch.",
            "sent4": "Her dance was like that of a skanker, drawing all eyes towards her.",
            "sent5": "The image of the skanker's dance was etched in everyone's memory."
        },
        {
            "definition": "A person who engages in dishonest or unethical behavior.",
            "pos": "noun",
            "sent1": "The skanker tricked his friends into believing his lies.",
            "sent2": "She was labeled as a skanker for her deceitful actions.",
            "sent3": "The skanker's lies caught up with him in the end.",
            "sent4": "His behavior mirrored that of a skanker, betraying trust left and right.",
            "sent5": "The reputation of the skanker spread throughout the town."
        },
        {
            "definition": "To dance in a sexually suggestive manner.",
            "pos": "verb",
            "sent1": "She loved to skanker at the club, drawing attention with her moves.",
            "sent2": "They decided to skanker together, swaying sensually to the music.",
            "sent3": "The couple skankered in a way that made others blush.",
            "sent4": "Their dance skankered like flames flickering in the dark.",
            "sent5": "The way she skankered made everyone stop and stare."
        },
        {
            "definition": "To engage in dishonest or unethical behavior.",
            "pos": "verb",
            "sent1": "He would skanker his way through business deals, leaving others in the dark.",
            "sent2": "She chose to skanker her competitors by spreading false rumors.",
            "sent3": "The politician skankered his way to power through deceitful tactics.",
            "sent4": "His actions skankered like a shadow lurking in the background.",
            "sent5": "The company's decision to skanker led to their downfall."
        }
    ]
}