{
    "term": "skegs",
    "meanings": [
        {
            "definition": "A projection on the bottom of a boat to provide directional stability.",
            "pos": "noun",
            "sent1": "The skegs on the boat helped it stay on course in the strong currents.",
            "sent2": "The sailor checked the skegs before setting off on the voyage.",
            "sent3": "The mischievous seagull perched on one of the skegs, pretending to be the captain.",
            "sent4": "The skegs acted like anchors, keeping the boat steady in the turbulent waters.",
            "sent5": "The bright red skegs under the boat gleamed in the sunlight, guiding its path."
        },
        {
            "definition": "A fin or projection on a surfboard to improve stability.",
            "pos": "noun",
            "sent1": "The surfer's skillful use of the skegs allowed for smooth rides on the waves.",
            "sent2": "Make sure the skegs are securely attached to the surfboard before hitting the water.",
            "sent3": "The playful dolphin swam circles around the skegs, showing off its agility.",
            "sent4": "Balancing on the skegs, the surfer felt like a graceful dancer on the water.",
            "sent5": "The colorful skegs on the surfboard added a touch of style to the beach scene."
        },
        {
            "definition": "A metal projection on the bottom of a shoe for traction.",
            "pos": "noun",
            "sent1": "The hiker's boots had sturdy skegs that gripped the rocky terrain effectively.",
            "sent2": "Before the race, the athlete checked the condition of the skegs on their shoes.",
            "sent3": "The mischievous squirrel tried to steal the shiny skegs from the shoes left outside.",
            "sent4": "With each step, the skegs dug into the ground, providing excellent grip.",
            "sent5": "The worn-out skegs on the old shoes left a trail of marks on the muddy path."
        }
    ]
}