{
    "term": "skeg",
    "meanings": [
        {
            "definition": "A projection at the stern of a boat, providing support for the rudder.",
            "pos": "noun",
            "sent1": "The skeg on the boat helped steer it in the right direction.",
            "sent2": "The captain adjusted the rudder using the skeg at the back of the boat.",
            "sent3": "The mischievous seagull perched on the skeg, pretending to be the ship's captain.",
            "sent4": "The skeg acted as a guiding hand, directing the boat through the rough waters.",
            "sent5": "The sturdy skeg kept the boat stable even in the stormy sea."
        },
        {
            "definition": "A small fin or projection on the bottom of a surfboard or paddleboard for stability.",
            "pos": "noun",
            "sent1": "The skeg on the surfboard helped the surfer balance on the waves.",
            "sent2": "She attached the skeg to the paddleboard to prevent it from tipping over.",
            "sent3": "The playful dolphin swam circles around the skeg, curious about its purpose.",
            "sent4": "Like a loyal friend, the skeg supported the surfboard through every wave.",
            "sent5": "The bright orange skeg stood out against the blue ocean, guiding the surfer home."
        },
        {
            "definition": "A metal pin or bolt used to secure the propeller to the propeller shaft on a boat.",
            "pos": "noun",
            "sent1": "The mechanic carefully tightened the skeg to keep the propeller in place.",
            "sent2": "The old boat needed a new skeg to ensure the propeller's security.",
            "sent3": "The mischievous seagull tried to steal the shiny skeg from the boat's engine.",
            "sent4": "The skeg was the unsung hero, holding the propeller steady during the voyage.",
            "sent5": "Without the reliable skeg, the propeller would spin out of control in the water."
        }
    ]
}