{
    "term": "skene",
    "meanings": [
        {
            "definition": "A small building or structure, often used as a dressing room or storage area in a theater.",
            "pos": "noun",
            "sent1": "The actors gathered in the skene to prepare for the play.",
            "sent2": "The skene at the theater was filled with costumes and props.",
            "sent3": "The skene was so tiny that the actors had to squeeze in together, making it look like a clown car.",
            "sent4": "Her mind was a skene of memories, each room holding a different scene from her past.",
            "sent5": "The skene stood quietly backstage, holding the secrets of the performers."
        },
        {
            "definition": "A channel or duct in the body, such as the urethral skene's gland.",
            "pos": "noun",
            "sent1": "The doctor explained the function of the skene in the body.",
            "sent2": "The skene's gland plays a role in the reproductive system.",
            "sent3": "The skene's gland decided to go on strike, causing confusion in the body.",
            "sent4": "Her tears flowed like a skene, carrying away her sorrow.",
            "sent5": "The skene's ducts were like rivers, carrying essential fluids through the body."
        },
        {
            "definition": "A type of ancient Greek stage building used for performances.",
            "pos": "noun",
            "sent1": "The actors entered the skene to make their grand entrance onto the stage.",
            "sent2": "The skene in ancient Greece was beautifully decorated for the play.",
            "sent3": "The skene in the Greek theater seemed to have a life of its own, whispering secrets to the audience.",
            "sent4": "The skene stood tall like a guardian, protecting the actors during their performance.",
            "sent5": "The skene's presence added an air of mystery and grandeur to the ancient Greek plays."
        }
    ]
}