{
    "term": "skenes",
    "meanings": [
        {
            "definition": "Skene: a temporary structure on a stage used for scenery or to house actors",
            "pos": "noun",
            "sent1": "During the play, the actors waited behind the skenes for their cue to enter the stage.",
            "sent2": "The theater crew quickly assembled the skenes to create a beautiful backdrop for the performance.",
            "sent3": "The skenes on the stage looked like giant cardboard boxes, making the audience chuckle.",
            "sent4": "The skenes transformed the empty stage into a bustling city, full of life and color.",
            "sent5": "The intricate details of the skenes made the play's setting feel incredibly real."
        },
        {
            "definition": "Skene: a small duct or tube in the female reproductive system",
            "pos": "noun",
            "sent1": "The skenes play a crucial role in the female reproductive system by secreting fluid.",
            "sent2": "Doctors carefully examined the skenes to understand any potential issues in the reproductive system.",
            "sent3": "The skenes in the body are like tiny rivers flowing with important fluids.",
            "sent4": "Her joy bubbled up from within her, like the skenes releasing their contents.",
            "sent5": "The skenes are like tiny messengers, delivering essential fluids where needed."
        },
        {
            "definition": "Skene: a type of ancient Greek building or tent",
            "pos": "noun",
            "sent1": "The skenes in ancient Greece provided shelter for travelers on their journeys.",
            "sent2": "The soldiers rested under the shade of the skenes after a long day of training.",
            "sent3": "The skenes in the Greek village were painted in vibrant colors, creating a picturesque scene.",
            "sent4": "The skenes stood tall against the backdrop of the mountains, a symbol of strength and history.",
            "sent5": "The ancient skenes whispered stories of the past to those who listened closely."
        }
    ]
}