{
    "term": "sketches",
    "meanings": [
        {
            "definition": "A rough or unfinished drawing or painting.",
            "pos": "noun",
            "sent1": "She showed me her sketches of flowers.",
            "sent2": "The artist displayed her sketches at the gallery.",
            "sent3": "His sketches of animals always make me smile.",
            "sent4": "The sketches of the cityscape captured its essence.",
            "sent5": "The sketches of the mountains were breathtaking."
        },
        {
            "definition": "A brief written or spoken account or description.",
            "pos": "noun",
            "sent1": "He wrote down his sketches of the meeting.",
            "sent2": "The journalist's sketches of the event were detailed.",
            "sent3": "Her sketches of the day's events were quite amusing.",
            "sent4": "The sketches of the story added depth to the plot.",
            "sent5": "The sketches of the recipe made it easy to follow."
        },
        {
            "definition": "To make a rough drawing of something.",
            "pos": "verb",
            "sent1": "She sketches the landscape before painting.",
            "sent2": "He often sketches his ideas before finalizing them.",
            "sent3": "Sketches of his dream house filled the notebook.",
            "sent4": "She sketches a map to guide us through the forest.",
            "sent5": "The artist sketches the outline of the portrait first."
        },
        {
            "definition": "To give a brief account or description of something.",
            "pos": "verb",
            "sent1": "He sketches the main points of the story.",
            "sent2": "She sketches the key features of the plan.",
            "sent3": "The comedian sketches a hilarious scene in his show.",
            "sent4": "The author sketches the character's background subtly.",
            "sent5": "The teacher sketches the lesson for better understanding."
        }
    ]
}