{
    "term": "skewbalds",
    "meanings": [
        {
            "definition": "Skewbalds: animals with patches of white and another color",
            "pos": "noun",
            "sent1": "The farm had many skewbalds, with patches of white and brown.",
            "sent2": "The skewbalds in the field looked beautiful with their unique patches of color.",
            "sent3": "The skewbalds played happily in the meadow, their colorful patches shining in the sun.",
            "sent4": "Among the herd of horses, the skewbalds stood out like living paintings.",
            "sent5": "Children visiting the farm were fascinated by the skewbalds' colorful coats."
        },
        {
            "definition": "Skewbalds: having patches of white and another color",
            "pos": "adjective",
            "sent1": "The skewbalds horse trotted gracefully with its white and brown patches.",
            "sent2": "Her skewbalds cat had a unique coat that always caught people's attention.",
            "sent3": "The skewbalds puppy wagged its tail happily, showing off its colorful fur.",
            "sent4": "In the art class, the students painted pictures of skewbalds animals with vibrant colors.",
            "sent5": "The garden was filled with flowers of all colors, resembling a field of skewbalds blooms."
        },
        {
            "definition": "Skewbalds: to describe animals with patches of white and another color",
            "pos": "noun",
            "sent1": "The farmer used the term skewbalds to refer to the horses with mixed colors.",
            "sent2": "At the pet show, the judge asked the participants to bring their skewbalds for evaluation.",
            "sent3": "During the storytelling session, the children giggled when they heard about the mischievous skewbalds.",
            "sent4": "In the zoo, visitors were amazed by the variety of skewbalds in the animal enclosures.",
            "sent5": "The book about farm animals had a whole chapter dedicated to the history of skewbalds."
        }
    ]
}