{
    "term": "skids",
    "meanings": [
        {
            "definition": "A piece of wood or metal on which something heavy can be slid or rolled along.",
            "pos": "noun",
            "sent1": "The workers used skids to move the heavy boxes in the warehouse.",
            "sent2": "The skids at the construction site made it easier to transport materials.",
            "sent3": "When the cat jumped on the skids, it slid across the floor comically.",
            "sent4": "His career was on the skids after the unfortunate incident.",
            "sent5": "The old skids creaked under the weight of the furniture."
        },
        {
            "definition": "A runway made of logs or planks.",
            "pos": "noun",
            "sent1": "The airplane landed smoothly on the skids at the remote airstrip.",
            "sent2": "The skids in the forest helped guide the sled down the hill.",
            "sent3": "The raccoon thought the skids were a perfect place for a nap.",
            "sent4": "The skids through the swamp seemed like a path to another world.",
            "sent5": "The skids in the river were slippery after the rain."
        },
        {
            "definition": "To slide along a surface, typically sideways or out of control.",
            "pos": "verb",
            "sent1": "The car skids on the icy road, making it hard to steer.",
            "sent2": "She skids down the hill on her sled, laughing all the way.",
            "sent3": "The penguin skids on the ice, trying to impress its friends.",
            "sent4": "His confidence skids when he forgets his lines on stage.",
            "sent5": "The skateboarder skids along the rail, showing off his skills."
        },
        {
            "definition": "To fail or deteriorate rapidly.",
            "pos": "verb",
            "sent1": "The company's profits skid after the market crash.",
            "sent2": "Her grades skid when she doesn't study for exams.",
            "sent3": "The cake's frosting starts to skid off the sides in the heat.",
            "sent4": "His reputation begins to skid when rumors spread.",
            "sent5": "The team's performance skids as they lose confidence."
        }
    ]
}