{
    "term": "skinny",
    "meanings": [
        {
            "definition": "Very thin or slender",
            "pos": "adjective",
            "sent1": "The skinny cat squeezed through the fence easily.",
            "sent2": "She has a skinny frame and can fit into small clothes.",
            "sent3": "The skinny tree looked like it was on a diet!",
            "sent4": "Her skinny fingers delicately picked up the tiny bead.",
            "sent5": "The skinny pole swayed in the wind, barely holding up the sign."
        },
        {
            "definition": "Lacking excess flesh",
            "pos": "adjective",
            "sent1": "He preferred a skinny steak with no fat on it.",
            "sent2": "The skinny model showcased the latest fashion trends.",
            "sent3": "The skinny sandwich had barely any filling in it!",
            "sent4": "Her skinny arms were toned from regular exercise.",
            "sent5": "The skinny branches of the tree reached out like bony fingers."
        },
        {
            "definition": "Tight-fitting",
            "pos": "adjective",
            "sent1": "She wore a skinny dress that hugged her figure.",
            "sent2": "The skinny jeans were difficult to put on but looked great.",
            "sent3": "The skinny gloves were a struggle to get on her hands.",
            "sent4": "His skinny tie completed the formal look.",
            "sent5": "The skinny shirt clung to his body, showing off his muscles."
        },
        {
            "definition": "Informal term for information or details",
            "pos": "noun",
            "sent1": "He shared the skinny on the upcoming project.",
            "sent2": "She always knows the latest skinny about celebrities.",
            "sent3": "The juicy skinny about the scandal spread quickly.",
            "sent4": "I need the inside skinny on what's happening at work.",
            "sent5": "The gossip column always has the latest skinny on Hollywood stars."
        }
    ]
}