{
    "term": "skinner",
    "meanings": [
        {
            "definition": "A person who prepares or sells animal skins or hides.",
            "pos": "noun",
            "sent1": "The skinner at the market had a wide variety of animal skins for sale.",
            "sent2": "The skinner carefully tanned the hides to make them soft and durable.",
            "sent3": "The skinner joked that he could turn a rabbit skin into a magic carpet.",
            "sent4": "She was a skinner of great talent, able to turn rough hides into works of art.",
            "sent5": "The skinner's hands were stained with the colors of the many skins he worked with."
        },
        {
            "definition": "A person who removes the skin from an animal.",
            "pos": "noun",
            "sent1": "The skinner swiftly peeled the skin off the deer after the hunt.",
            "sent2": "The skinner's job was to carefully skin the animals for their meat.",
            "sent3": "The skinner pretended to be a magician, pulling the skin off like a trick.",
            "sent4": "The skinner's hands moved with precision as he skinned the animal expertly.",
            "sent5": "The skinner's knife made quick work of removing the tough skin from the animal."
        },
        {
            "definition": "A tool used for skinning animals.",
            "pos": "noun",
            "sent1": "The sharp skinner made the task of removing the skin much easier.",
            "sent2": "The skinner was a valuable tool for hunters out in the wilderness.",
            "sent3": "The skinner tool was so efficient that it almost seemed to work on its own.",
            "sent4": "The skinner's handle was worn from years of use in the field.",
            "sent5": "The skinner's blade gleamed in the sunlight, ready for its next job."
        },
        {
            "definition": "A slang term for a person who is skilled at manipulating or deceiving others.",
            "pos": "noun",
            "sent1": "He was known as a skinner in the business world for his clever tactics.",
            "sent2": "The skinner always seemed to know how to get what he wanted.",
            "sent3": "The skinner's smooth talk could convince anyone of anything.",
            "sent4": "She saw through the skinner's lies and refused to be deceived.",
            "sent5": "The skinner's charm was like a mask hiding his true intentions."
        }
    ]
}