{
    "term": "skins",
    "meanings": [
        {
            "definition": "The outer covering of an animal's body",
            "pos": "noun",
            "sent1": "The lion's skins protect it from the sun and rain.",
            "sent2": "The snake sheds its old skins as it grows.",
            "sent3": "The zebra's skins are like its own natural coat.",
            "sent4": "The skins of the armadillo are like a suit of armor.",
            "sent5": "The skins of the fish shimmer in the water."
        },
        {
            "definition": "The outer layer of a fruit or vegetable",
            "pos": "noun",
            "sent1": "The apple's skins are rich in nutrients.",
            "sent2": "It's best to wash the skins of fruits before eating them.",
            "sent3": "The orange's skins can be used to make zest for baking.",
            "sent4": "The potato skins add flavor to the dish.",
            "sent5": "The skins of grapes can be tart or sweet."
        },
        {
            "definition": "A thin layer of tissue covering the body or an organ",
            "pos": "noun",
            "sent1": "The delicate skins of the eyelids protect the eyes.",
            "sent2": "The skins of the onion can make you cry when cut.",
            "sent3": "The skins of the fingers are sensitive to touch.",
            "sent4": "The skins of the lungs help with breathing.",
            "sent5": "The skins of the brain are crucial for protection."
        },
        {
            "definition": "A container made from animal skin",
            "pos": "noun",
            "sent1": "The tribal drum was covered in animal skins.",
            "sent2": "The ancient scroll was wrapped in delicate skins.",
            "sent3": "The water flask was crafted from sturdy skins.",
            "sent4": "The pouch was made from kangaroo skins.",
            "sent5": "The quiver was adorned with colorful skins."
        },
        {
            "definition": "A slang term for a person's clothing or outfit",
            "pos": "noun",
            "sent1": "She always wears the latest trendy skins.",
            "sent2": "His casual skins consisted of jeans and a t-shirt.",
            "sent3": "The party required fancy skins for entry.",
            "sent4": "The detective's disguise was his secret skins.",
            "sent5": "Her performance outfit was made of shiny skins."
        }
    ]
}