{
    "term": "skittishness",
    "meanings": [
        {
            "definition": "The quality or state of being skittish.",
            "pos": "noun",
            "sent1": "Her skittishness around loud noises made her jump at the sound of a car horn.",
            "sent2": "The horse's skittishness was evident as it shied away from unfamiliar objects.",
            "sent3": "The kitten's skittishness towards the vacuum cleaner provided entertainment for the whole family.",
            "sent4": "His skittishness in new situations was like a deer caught in headlights.",
            "sent5": "The skittishness of the rabbit was so extreme that even a leaf falling would startle it."
        },
        {
            "definition": "A nervous or easily frightened disposition.",
            "pos": "noun",
            "sent1": "Despite his tough exterior, his skittishness revealed his true vulnerability.",
            "sent2": "The dog's skittishness was a result of past mistreatment by its previous owner.",
            "sent3": "Her skittishness at horror movies often led to comical reactions.",
            "sent4": "The skittishness of the mouse made it an easy target for the cat.",
            "sent5": "The skittishness of the child was so pronounced that even a gentle tap on the shoulder would startle them."
        },
        {
            "definition": "The tendency to be easily startled or jumpy.",
            "pos": "noun",
            "sent1": "The skittishness of the bird caused it to fly away at the slightest movement.",
            "sent2": "His skittishness in crowded places made it difficult for him to relax.",
            "sent3": "The skittishness of the squirrel led to a hilarious chase around the park.",
            "sent4": "The skittishness of the rabbit was compared to a spring that was wound too tight.",
            "sent5": "The skittishness of the deer was so extreme that even a gentle breeze would make it bolt."
        }
    ]
}