{
    "term": "skulling",
    "meanings": [
        {
            "definition": "The act of propelling a boat by using a single oar over the stern.",
            "pos": "noun",
            "sent1": "During the race, the team's skilled skulling helped them glide smoothly through the water.",
            "sent2": "The rower practiced skulling to improve their technique on the river.",
            "sent3": "The pirate captain's skulling was so precise, it looked like a dance on the water.",
            "sent4": "Her graceful skulling was like poetry in motion as she guided the boat effortlessly.",
            "sent5": "The rhythmic sound of skulling echoed across the lake, creating a peaceful atmosphere."
        },
        {
            "definition": "The act of consuming alcohol quickly, often in large quantities.",
            "pos": "noun",
            "sent1": "After a long day, he indulged in some skulling with his friends at the bar.",
            "sent2": "The party was wild, with everyone skulling their drinks and having a great time.",
            "sent3": "His talent for skulling drinks earned him the title of 'fastest drinker' among his friends.",
            "sent4": "The skulling contest at the pub was intense, with competitors downing pints in seconds.",
            "sent5": "She regretted skulling so much beer when she woke up with a headache the next morning."
        },
        {
            "definition": "The act of shaping a skull.",
            "pos": "noun",
            "sent1": "The artist's skulling of the clay skull was meticulous and detailed.",
            "sent2": "In the anatomy class, students learned about the skulling process for forensic purposes.",
            "sent3": "The Halloween decoration required skulling the fake skull to make it look realistic.",
            "sent4": "The sculptor's skulling of the marble skull was a masterpiece of craftsmanship.",
            "sent5": "The skulled skull displayed in the museum was a fascinating exhibit for visitors."
        }
    ]
}