{
    "term": "skycaps",
    "meanings": [
        {
            "definition": "A person who assists travelers with their luggage at airports.",
            "pos": "noun",
            "sent1": "The skycaps at the airport helped carry the heavy suitcases for the passengers.",
            "sent2": "Travelers often rely on skycaps to transport their bags from the check-in counter to the boarding gate.",
            "sent3": "The skycaps joked with the passengers, saying they needed to hit the gym after lifting all those bags.",
            "sent4": "The skycaps were like luggage superheroes, swooping in to save the day with their strength and smiles.",
            "sent5": "I'll never forget the friendly skycaps who made my airport experience so much easier."
        },
        {
            "definition": "A type of hat worn by pilots and flight attendants.",
            "pos": "noun",
            "sent1": "The pilot proudly wore his skycaps as he boarded the plane.",
            "sent2": "Flight attendants often wear skycaps as part of their uniform to look professional.",
            "sent3": "The flight attendant playfully tossed her skycaps in the air, catching it skillfully on her head.",
            "sent4": "The skycaps perched on the heads of the crew, adding a touch of aviation style to their outfits.",
            "sent5": "The shiny skycaps gleamed under the airplane's bright lights, catching the passengers' attention."
        },
        {
            "definition": "A type of mushroom with a distinctive cap that resembles the sky.",
            "pos": "noun",
            "sent1": "In the forest, we stumbled upon skycaps with their unique blue caps peeking out from the ground.",
            "sent2": "The skycaps in the woods were a rare find due to their striking resemblance to the sky.",
            "sent3": "The skycaps seemed to be little pieces of the sky that had fallen to the forest floor.",
            "sent4": "As we picked the skycaps, it felt like we were holding a piece of the sky in our hands.",
            "sent5": "The delicate skycaps added a touch of magic to our mushroom foraging adventure."
        }
    ]
}