{
    "term": "skying",
    "meanings": [
        {
            "definition": "The act of hitting a ball high into the air in sports such as tennis or golf.",
            "pos": "noun",
            "sent1": "During the game, his powerful skying of the tennis ball impressed everyone.",
            "sent2": "In golf, skying the ball over the water hazard requires skill and precision.",
            "sent3": "The player's unexpected skying of the ball made the opponent scramble to return it.",
            "sent4": "Her skying of the ball was like a soaring eagle, graceful and majestic.",
            "sent5": "The coach emphasized the importance of skying for a successful shot in tennis."
        },
        {
            "definition": "The act of jumping or falling from a great height while wearing a parachute.",
            "pos": "noun",
            "sent1": "Experiencing the thrill of skying for the first time was exhilarating.",
            "sent2": "Skydivers practice skying to ensure a safe and controlled descent.",
            "sent3": "The instructor's skying demonstration left the students in awe.",
            "sent4": "The feeling of skying through the clouds was both terrifying and liberating.",
            "sent5": "Skying requires proper training and equipment to prevent accidents."
        },
        {
            "definition": "The act of looking up at the sky or observing the sky.",
            "pos": "noun",
            "sent1": "On a clear night, stargazers enjoy skying to spot constellations.",
            "sent2": "Children love skying to watch the clouds drift by on a sunny day.",
            "sent3": "The artist found inspiration in skying, capturing the beauty of the sky in paintings.",
            "sent4": "Skying during the meteor shower revealed shooting stars streaking across the sky.",
            "sent5": "Skying at sunset painted the sky in hues of orange and pink, creating a breathtaking view."
        }
    ]
}