{
    "term": "slaggy",
    "meanings": [
        {
            "definition": "Covered in slag or resembling slag.",
            "pos": "adjective",
            "sent1": "The old factory had a slaggy appearance with its dark, rough exterior.",
            "sent2": "The blacksmith's hands were covered in slaggy residue after a long day of work.",
            "sent3": "The artist tried to create a slaggy effect in the painting by using dark, gritty colors.",
            "sent4": "The abandoned mine was a slaggy wasteland, with piles of discarded metal everywhere.",
            "sent5": "The volcanic rock had a slaggy texture, making it easy to distinguish from other rocks."
        },
        {
            "definition": "Of poor quality or low standards.",
            "pos": "adjective",
            "sent1": "The cheap knockoff watch felt slaggy and fell apart after a week.",
            "sent2": "The restaurant received bad reviews for serving slaggy food that was undercooked.",
            "sent3": "The comedian joked about his slaggy car that always broke down on the highway.",
            "sent4": "The student's essay was full of slaggy arguments and lacked proper evidence.",
            "sent5": "The company faced criticism for their slaggy products that easily broke."
        },
        {
            "definition": "Promiscuous or sexually provocative.",
            "pos": "adjective",
            "sent1": "She was known for her slaggy behavior, often flirting with multiple people at once.",
            "sent2": "The tabloid published a story about the actress's slaggy relationships with co-stars.",
            "sent3": "The gossip column speculated about the singer's slaggy antics at the nightclub.",
            "sent4": "The novel's main character was portrayed as a slaggy seductress, luring in unsuspecting men.",
            "sent5": "The movie depicted a group of friends navigating the complexities of slaggy love triangles."
        }
    ]
}