{
    "term": "slalom",
    "meanings": [
        {
            "definition": "A skiing race in which the course is marked by a series of gates that the skiers must pass through.",
            "pos": "noun",
            "sent1": "During the slalom, skiers must pass through gates to reach the finish line.",
            "sent2": "The slalom course was challenging with its gates placed strategically.",
            "sent3": "The skier in the slalom race accidentally missed a gate and had to go back.",
            "sent4": "Navigating through life's challenges is like skiing a slalom course with unexpected gates.",
            "sent5": "The excitement of the slalom race kept the audience on the edge of their seats."
        },
        {
            "definition": "To move or race in a winding path marked by obstacles or gates.",
            "pos": "verb",
            "sent1": "She had to slalom through the crowded market to reach the other side.",
            "sent2": "The car slalomed through the cones in the driving test.",
            "sent3": "The cat seemed to slalom around the furniture as it chased its toy.",
            "sent4": "His thoughts slalomed back and forth, unable to focus on one idea.",
            "sent5": "The river slalomed through the valley, creating a beautiful natural path."
        },
        {
            "definition": "A type of skiing competition in which racers navigate a course marked by gates.",
            "pos": "noun",
            "sent1": "The slalom competition attracted skilled skiers from around the world.",
            "sent2": "In the slalom event, racers showcase their agility and speed.",
            "sent3": "The penguin race at the zoo felt like a playful slalom for the animals.",
            "sent4": "The slalom of life's challenges tests our ability to navigate through difficulties.",
            "sent5": "The slalom course was set up perfectly for the upcoming skiing championship."
        }
    ]
}