{
    "term": "slamming",
    "meanings": [
        {
            "definition": "To shut with force and noise",
            "pos": "verb",
            "sent1": "She was slamming the door to show her frustration.",
            "sent2": "He kept slamming the window shut to keep out the cold.",
            "sent3": "The wind was slamming the door so loudly, it sounded like a drumbeat.",
            "sent4": "The heavy rain was slamming against the windows all night long.",
            "sent5": "The old gate kept slamming shut every time the wind blew."
        },
        {
            "definition": "To criticize harshly",
            "pos": "verb",
            "sent1": "The teacher was slamming the student for not completing the assignment.",
            "sent2": "The movie critic kept slamming the new film for its poor acting.",
            "sent3": "She was slamming her friend's outfit, but it was all in good fun.",
            "sent4": "The journalist was slamming the government's decision in his latest article.",
            "sent5": "The coach was slamming the team's performance during the game."
        },
        {
            "definition": "To dance energetically",
            "pos": "verb",
            "sent1": "The group was slamming on the dance floor all night long.",
            "sent2": "She loves to slam to the beat of the music at parties.",
            "sent3": "The kids were slamming around the living room, having a dance-off.",
            "sent4": "The dancers were slamming in perfect sync with the music.",
            "sent5": "The crowd started slamming as soon as the DJ played their favorite song."
        },
        {
            "definition": "To hit forcefully and loudly",
            "pos": "verb",
            "sent1": "He was slamming the ball against the wall during practice.",
            "sent2": "The carpenter was slamming the hammer to drive in the nail.",
            "sent3": "The boxer was slamming his opponent with powerful punches.",
            "sent4": "The thunder was slamming so loudly, it shook the entire house.",
            "sent5": "The waves were slamming against the rocks with great force."
        }
    ]
}