{
    "term": "slam",
    "meanings": [
        {
            "definition": "A loud noise made by a hard impact.",
            "pos": "noun",
            "sent1": "The slam of the door startled me.",
            "sent2": "I heard a loud slam as the book fell off the shelf.",
            "sent3": "The slam of the hammer on the table made everyone jump.",
            "sent4": "The slam of the waves against the shore was deafening.",
            "sent5": "The slam of the car crash echoed through the street."
        },
        {
            "definition": "To shut forcefully and noisily.",
            "pos": "verb",
            "sent1": "She had to slam the window closed to keep out the cold.",
            "sent2": "Please do not slam the door when you leave.",
            "sent3": "He would always slam the cupboard doors when he was angry.",
            "sent4": "The wind made the gate slam shut with a bang.",
            "sent5": "I accidentally slam my finger in the car door."
        },
        {
            "definition": "A type of poetry performance.",
            "pos": "noun",
            "sent1": "The poetry slam at the cafe was packed with people.",
            "sent2": "She won first place in the poetry slam competition.",
            "sent3": "The poetry slam event was filled with creative energy.",
            "sent4": "The poetry slam was a beautiful blend of words and emotions.",
            "sent5": "Attending a poetry slam is a unique and engaging experience."
        },
        {
            "definition": "To criticize harshly.",
            "pos": "verb",
            "sent1": "He would always slam my ideas without giving them a chance.",
            "sent2": "The movie critic would often slam new films in his reviews.",
            "sent3": "She would slam his cooking skills, but secretly loved his dishes.",
            "sent4": "The boss would slam his employees for small mistakes.",
            "sent5": "The teacher would never slam a student's efforts."
        },
        {
            "definition": "To move with great force.",
            "pos": "verb",
            "sent1": "The basketball player would slam the ball into the hoop.",
            "sent2": "The strong wind would slam the door shut.",
            "sent3": "The car would slam into the wall at full speed.",
            "sent4": "The waves would slam against the rocks during the storm.",
            "sent5": "The wrestler would slam his opponent to the ground."
        }
    ]
}