{
    "term": "slams",
    "meanings": [
        {
            "definition": "To shut with force and noise",
            "pos": "verb",
            "sent1": "She slams the door when she's angry.",
            "sent2": "He always slams the window shut before bedtime.",
            "sent3": "The wind slams the door closed, startling the cat.",
            "sent4": "The final scene of the play slams the door on any hope for reconciliation.",
            "sent5": "The thunderstorm slams the shutters against the house, creating a loud noise."
        },
        {
            "definition": "A forceful impact or collision",
            "pos": "noun",
            "sent1": "The slam of the car crash echoed through the street.",
            "sent2": "The basketball made a loud slam as it hit the backboard.",
            "sent3": "The slam of the books falling off the shelf made everyone jump.",
            "sent4": "The slam of the waves against the shore was calming to listen to.",
            "sent5": "The slam of the hammer against the nail signaled the completion of the project."
        },
        {
            "definition": "A harsh or critical comment or review",
            "pos": "noun",
            "sent1": "Her review was a harsh slam on the new restaurant.",
            "sent2": "The article received a lot of attention due to its critical slam on the movie.",
            "sent3": "The slam of the critic's words left the actor feeling dejected.",
            "sent4": "The slam of the judge's ruling was unexpected by many.",
            "sent5": "The slam of the editor's feedback motivated the writer to improve."
        },
        {
            "definition": "To criticize severely or attack verbally",
            "pos": "verb",
            "sent1": "He slams his opponents during debates.",
            "sent2": "She always slams her coworkers behind their backs.",
            "sent3": "The siblings playfully slam each other's fashion choices.",
            "sent4": "The politician slams his rival's policies in every speech.",
            "sent5": "The coach slams the team for their lack of effort during practice."
        }
    ]
}