{
    "term": "slamdance",
    "meanings": [
        {
            "definition": "A lively and energetic style of dancing.",
            "pos": "noun",
            "sent1": "At the school talent show, Sarah's slamdance impressed everyone with its energy.",
            "sent2": "The dance crew performed a fun slamdance routine at the community center.",
            "sent3": "During the party, the kids started a spontaneous slamdance that got everyone moving.",
            "sent4": "The slamdance at the wedding reception was so lively, it brought smiles to all the guests.",
            "sent5": "The music festival ended with a spectacular slamdance that left the audience cheering."
        },
        {
            "definition": "To dance in a vigorous and unrestrained manner.",
            "pos": "verb",
            "sent1": "The kids love to slamdance in the living room when their favorite song comes on.",
            "sent2": "The crowd began to slamdance as soon as the band started playing.",
            "sent3": "Grandpa surprised everyone by joining in and slamdancing with the youngsters.",
            "sent4": "The protesters decided to slamdance in front of City Hall to make their voices heard.",
            "sent5": "The energetic music made everyone want to slamdance and let loose."
        },
        {
            "definition": "A type of dance event or competition where participants dance energetically and competitively.",
            "pos": "noun",
            "sent1": "The annual slamdance competition drew dancers from all over the city.",
            "sent2": "The TV show featured a thrilling slamdance battle between two talented contestants.",
            "sent3": "The school organized a charity slamdance to raise funds for a good cause.",
            "sent4": "The championship slamdance event showcased the best dancers in the region.",
            "sent5": "The community center hosted a fun slamdance marathon to promote fitness and fun."
        }
    ]
}