{
    "term": "slap",
    "meanings": [
        {
            "definition": "To strike with an open hand",
            "pos": "verb",
            "sent1": "She will slap the table to get everyone's attention.",
            "sent2": "He likes to slap his friend playfully on the back.",
            "sent3": "The chef will slap the dough to make it flat for the pizza.",
            "sent4": "The wind will slap the flag against the pole.",
            "sent5": "The teacher will slap the ruler on the desk to quiet the class."
        },
        {
            "definition": "A sharp blow with the hand or an object",
            "pos": "noun",
            "sent1": "The slap on his shoulder was a friendly gesture.",
            "sent2": "The loud slap of the door closing startled her.",
            "sent3": "The clown's slapstick routine always makes me laugh.",
            "sent4": "The slap of the waves against the shore was soothing.",
            "sent5": "The slap of the ball hitting the wall echoed in the gym."
        },
        {
            "definition": "A sound made by a sharp blow",
            "pos": "noun",
            "sent1": "The slap of the book hitting the floor was loud.",
            "sent2": "The slap of the ruler on the desk made everyone jump.",
            "sent3": "The slap of the rain on the window was calming.",
            "sent4": "The slap of the hammer on the nail echoed in the room.",
            "sent5": "The slap of the hand on the table silenced the room."
        },
        {
            "definition": "To put or place something quickly and forcefully",
            "pos": "verb",
            "sent1": "She will slap the papers on the desk before leaving.",
            "sent2": "He tends to slap his keys on the table when he comes home.",
            "sent3": "The chef will slap the ingredients into the pot for the stew.",
            "sent4": "The wind will slap the leaves against the window.",
            "sent5": "The worker will slap the paint on the wall for a quick finish."
        }
    ]
}