{
    "term": "slash",
    "meanings": [
        {
            "definition": "To cut with a sharp implement",
            "pos": "verb",
            "sent1": "I will slash the rope to free us.",
            "sent2": "Be careful not to slash yourself with the knife.",
            "sent3": "The chef accidentally slashed the cake in half.",
            "sent4": "The samurai's sword slashed through the enemy's armor.",
            "sent5": "The lumberjack's axe made a loud slash as it cut through the tree."
        },
        {
            "definition": "A mark (/) used to separate words or numbers",
            "pos": "noun",
            "sent1": "The website address had a slash in it.",
            "sent2": "Remember to use a slash to separate the date.",
            "sent3": "The detective found a mysterious note with a strange slash on it.",
            "sent4": "The slash on the map indicated the hiking trail.",
            "sent5": "The teacher explained the meaning of a slash in punctuation."
        },
        {
            "definition": "A violent cutting blow",
            "pos": "noun",
            "sent1": "The villain's slash with the sword was swift.",
            "sent2": "The warrior defended against the enemy's deadly slash.",
            "sent3": "The pirate's slash missed its target and hit the mast.",
            "sent4": "The slash from the axe left a deep mark on the tree trunk.",
            "sent5": "The ninja's slash was so powerful it knocked down the opponent."
        },
        {
            "definition": "To reduce or shorten",
            "pos": "verb",
            "sent1": "I need to slash my expenses to save money.",
            "sent2": "The company decided to slash the prices for the sale.",
            "sent3": "The editor had to slash many paragraphs to fit the word count.",
            "sent4": "The gardener had to slash the overgrown bushes in the garden.",
            "sent5": "The chef had to slash the recipe in half for a smaller portion."
        },
        {
            "definition": "A genre of fan fiction featuring romantic relationships between characters",
            "pos": "noun",
            "sent1": "She enjoys reading slash stories about her favorite characters.",
            "sent2": "The online community discusses the latest slash fanfics.",
            "sent3": "The bookstore had a section dedicated to slash novels.",
            "sent4": "The convention hosted a panel on writing slash fiction.",
            "sent5": "Fans eagerly anticipate the release of the new slash series."
        }
    ]
}