{
    "term": "slate",
    "meanings": [
        {
            "definition": "A fine-grained rock used for roofing and flooring.",
            "pos": "noun",
            "sent1": "The roof was made of sturdy slate.",
            "sent2": "She walked on the smooth slate floor.",
            "sent3": "The mischievous squirrel used a piece of slate as a tiny surfboard.",
            "sent4": "Her heart felt heavy, like a burden of slate.",
            "sent5": "The sound of rain on slate is calming and soothing."
        },
        {
            "definition": "A flat piece of slate used for writing on.",
            "pos": "noun",
            "sent1": "The teacher wrote the lesson on the slate.",
            "sent2": "Children in the past used to write on slate with chalk.",
            "sent3": "The mischievous squirrel used a piece of slate as a tiny surfboard.",
            "sent4": "Her eyes were as dark and deep as a piece of slate.",
            "sent5": "The slate was covered in doodles and notes from the meeting."
        },
        {
            "definition": "To schedule or designate for a particular time or purpose.",
            "pos": "verb",
            "sent1": "They will slate the meeting for next Monday.",
            "sent2": "She likes to slate her tasks for the week on Sunday.",
            "sent3": "The cat decided to slate its nap time for the middle of the meeting.",
            "sent4": "The stars seemed to slate their appearance for a special night.",
            "sent5": "He carefully slated his study time to avoid distractions."
        },
        {
            "definition": "To criticize severely.",
            "pos": "verb",
            "sent1": "The movie critic slated the new film for its poor acting.",
            "sent2": "She didn't mean to slate his efforts; she was just being honest.",
            "sent3": "The cat decided to slate its nap time for the middle of the meeting.",
            "sent4": "Her words felt like a sharp slate against his confidence.",
            "sent5": "The teacher slated the student's essay but offered constructive feedback."
        }
    ]
}