{
    "term": "slaving",
    "meanings": [
        {
            "definition": "Work hard like a slave",
            "pos": "verb",
            "sent1": "She was slaving away in the kitchen all day.",
            "sent2": "The workers were slaving to meet the deadline.",
            "sent3": "He felt like he was slaving over a hot stove for hours.",
            "sent4": "The students were slaving over their homework assignments.",
            "sent5": "The chef was slaving over a new recipe to impress the guests."
        },
        {
            "definition": "To toil or labor excessively",
            "pos": "verb",
            "sent1": "The farmer was slaving in the fields under the scorching sun.",
            "sent2": "She was slaving away at her desk to finish the project on time.",
            "sent3": "He joked that he was slaving so much, he might turn into a workaholic.",
            "sent4": "The mechanic was slaving over the engine to fix the car.",
            "sent5": "The artist was slaving over the details of her masterpiece."
        },
        {
            "definition": "Engage in hard or menial work",
            "pos": "verb",
            "sent1": "They were slaving over the dirty dishes after the party.",
            "sent2": "The interns were slaving away at filing paperwork in the office.",
            "sent3": "She found herself slaving over a pile of laundry on a Sunday.",
            "sent4": "The construction workers were slaving to build the new skyscraper.",
            "sent5": "The students were slaving over their group project to get a good grade."
        },
        {
            "definition": "To work very hard or laboriously",
            "pos": "verb",
            "sent1": "The chef was slaving in the kitchen to prepare a special meal.",
            "sent2": "He was slaving away on his novel late into the night.",
            "sent3": "She felt like she was slaving over her art project for hours.",
            "sent4": "The team was slaving to perfect their presentation for the competition.",
            "sent5": "The gardener was slaving over the flower beds to make them beautiful."
        }
    ]
}