{
    "term": "slaveys",
    "meanings": [
        {
            "definition": "A person who is owned by someone else and is forced to work for them.",
            "pos": "noun",
            "sent1": "The ancient king had many slaveys who worked in his palace.",
            "sent2": "The slaveys on the plantation toiled under the scorching sun all day.",
            "sent3": "The wealthy merchant treated his employees like slaveys, making them work long hours for little pay.",
            "sent4": "In the fairy tale, the evil sorcerer enchanted the prince, turning him into a slavey to do his bidding.",
            "sent5": "The image of the chained slaveys on the ship haunted the young boy's dreams."
        },
        {
            "definition": "A person who is excessively servile or submissive.",
            "pos": "noun",
            "sent1": "The villain's henchman was a slavey who obeyed every command without question.",
            "sent2": "She always felt like a slavey to her demanding boss, never daring to speak up.",
            "sent3": "The pampered poodle acted like a little slavey, following its owner everywhere.",
            "sent4": "The dictator's followers were like blind slaveys, blindly following his every order.",
            "sent5": "The character in the play was portrayed as a slavey, constantly bowing to the whims of others."
        },
        {
            "definition": "To work very hard or toil.",
            "pos": "verb",
            "sent1": "The farmers slaveys in the fields from dawn till dusk to harvest the crops.",
            "sent2": "She had to slaveys over her school project all night to finish it on time.",
            "sent3": "The chef had to slaveys in the kitchen to prepare the elaborate feast for the royal banquet.",
            "sent4": "He would slaveys away at his desk, determined to finish the report before the deadline.",
            "sent5": "The ants slaveys tirelessly to gather food for the winter months ahead."
        }
    ]
}