{
    "term": "sleazebags",
    "meanings": [
        {
            "definition": "A person regarded as despicable or contemptible.",
            "pos": "noun",
            "sent1": "The sleazebags who cheated the old lady out of her savings were caught by the police.",
            "sent2": "I can't believe those sleazebags would steal from a charity like that.",
            "sent3": "The sleazebags tried to sell fake watches as luxury brands, but everyone saw through their scam.",
            "sent4": "The sleazebags slithered through the shadows, preying on the vulnerable.",
            "sent5": "The town quickly learned to avoid the sleazebags who lurked in the alleyways."
        },
        {
            "definition": "A person who behaves in a dishonest or unethical manner.",
            "pos": "noun",
            "sent1": "The sleazebags at the company were fired for embezzling funds.",
            "sent2": "It's disappointing to see sleazebags taking advantage of trusting individuals.",
            "sent3": "The sleazebags thought they could get away with cutting corners, but their scheme unraveled.",
            "sent4": "The sleazebags' deceitful smiles couldn't hide their true intentions.",
            "sent5": "The sleazebags' actions left a trail of broken trust and shattered dreams."
        },
        {
            "definition": "A person who is considered to be morally corrupt or untrustworthy.",
            "pos": "noun",
            "sent1": "The sleazebags in the political scandal were exposed by investigative journalists.",
            "sent2": "It's hard to believe that some people still support those sleazebags after all they've done.",
            "sent3": "The sleazebags tried to sweet-talk their way out of trouble, but justice prevailed.",
            "sent4": "The sleazebags' twisted morals led them down a dark path of deception.",
            "sent5": "The community rallied together to protect themselves from the influence of the sleazebags."
        }
    ]
}