{
    "term": "slide",
    "meanings": [
        {
            "definition": "Move smoothly along a surface",
            "pos": "verb",
            "sent1": "I slide the book across the table.",
            "sent2": "The kids love to slide down the playground slide.",
            "sent3": "The penguin tried to slide on the ice but kept slipping.",
            "sent4": "Her words seemed to slide effortlessly into his heart.",
            "sent5": "The dancer's feet slide gracefully across the stage."
        },
        {
            "definition": "A playground equipment for children",
            "pos": "noun",
            "sent1": "The slide at the park is so much fun!",
            "sent2": "Let's go play on the slide after lunch.",
            "sent3": "The slide became a spaceship in the children's imaginative game.",
            "sent4": "The slide towered like a giant in the playground.",
            "sent5": "The shiny slide gleamed in the sunlight, inviting laughter."
        },
        {
            "definition": "A transparent image placed over a background",
            "pos": "noun",
            "sent1": "She added a slide with text to her presentation.",
            "sent2": "The slide displayed the key points of the lecture.",
            "sent3": "The slide of the graph made the data easier to understand.",
            "sent4": "The slide of the sunset added a beautiful touch to the photo.",
            "sent5": "The slide of the map helped guide the audience through the presentation."
        },
        {
            "definition": "A downward slope or decline",
            "pos": "noun",
            "sent1": "The hikers carefully navigated the steep slide.",
            "sent2": "The slide of the hill made for a thrilling ride on the sled.",
            "sent3": "The slide of the rollercoaster filled them with excitement.",
            "sent4": "The slide of the waterfall was a breathtaking sight.",
            "sent5": "The slide of the mountain seemed endless as they descended."
        }
    ]
}