{
    "term": "slighted",
    "meanings": [
        {
            "definition": "Insulted or treated with disrespect",
            "pos": "verb",
            "sent1": "She felt slighted when her friend ignored her at the party.",
            "sent2": "He often feels slighted by his coworkers' rude comments.",
            "sent3": "The cat looked slighted when the dog stole its favorite toy.",
            "sent4": "His actions unintentionally slighted her, causing hurt feelings.",
            "sent5": "The student's face showed a clear sign of feeling slighted by the teacher's harsh words."
        },
        {
            "definition": "To treat as unimportant or insignificant",
            "pos": "verb",
            "sent1": "The manager slighted her suggestions during the meeting.",
            "sent2": "She always feels slighted when her ideas are dismissed without consideration.",
            "sent3": "The little plant might feel slighted if you forget to water it.",
            "sent4": "Ignoring the issue would only slight the importance of addressing it.",
            "sent5": "His decision to overlook her hard work seemed to slight her efforts."
        },
        {
            "definition": "To disregard or ignore",
            "pos": "verb",
            "sent1": "He unintentionally slighted her message in the group chat.",
            "sent2": "She felt slighted when her question was ignored by the teacher.",
            "sent3": "The bird seemed to slight the warning signs and flew into the window.",
            "sent4": "Ignoring the safety guidelines would be to slight the importance of precaution.",
            "sent5": "The customer felt slighted when the waiter ignored their request for extra napkins."
        },
        {
            "definition": "To belittle or disparage",
            "pos": "verb",
            "sent1": "She didn't mean to slight his achievements with her offhand comment.",
            "sent2": "He felt slighted when his efforts were belittled by his supervisor.",
            "sent3": "The comedian's jokes seemed to slight the audience's intelligence.",
            "sent4": "His remarks managed to slight her reputation in the eyes of others.",
            "sent5": "The critic's review seemed to slight the hard work put into the film production."
        }
    ]
}