{
    "term": "slip",
    "meanings": [
        {
            "definition": "To slide unintentionally for a short distance.",
            "pos": "verb",
            "sent1": "I almost slip on the wet floor.",
            "sent2": "Be careful not to slip on the ice outside.",
            "sent3": "While dancing, I slip and slide across the floor.",
            "sent4": "Her words made me slip into a state of confusion.",
            "sent5": "The banana peel made the floor a slip hazard."
        },
        {
            "definition": "A small mistake or error.",
            "pos": "noun",
            "sent1": "Making a slip in the calculation can lead to big problems.",
            "sent2": "She noticed the slip in the report and corrected it.",
            "sent3": "His slip in judgment cost him the game.",
            "sent4": "The slip in the plan caused delays in the project.",
            "sent5": "Even a small slip in concentration can affect your performance."
        },
        {
            "definition": "A piece of paper or cardboard used to label or identify something.",
            "pos": "noun",
            "sent1": "Attach the slip to the package for identification.",
            "sent2": "The slip on the box indicates its contents.",
            "sent3": "I found a slip with the product details on the shelf.",
            "sent4": "The slip on the book helped me find it in the library.",
            "sent5": "The slip on the doorbell showed the delivery was missed."
        },
        {
            "definition": "A woman's undergarment that is worn under a skirt or dress.",
            "pos": "noun",
            "sent1": "She bought a new slip to wear under her dress.",
            "sent2": "The slip she wore was comfortable and smooth.",
            "sent3": "Her slip matched the color of her dress perfectly.",
            "sent4": "The slip peeked out from under her skirt as she walked.",
            "sent5": "The slip added a layer of elegance to her outfit."
        }
    ]
}