{
    "term": "sliped",
    "meanings": [
        {
            "definition": "To move smoothly and quietly",
            "pos": "verb",
            "sent1": "The cat sliped through the door without making a sound.",
            "sent2": "The boat sliped across the calm lake at sunset.",
            "sent3": "The ninja sliped past the guards undetected.",
            "sent4": "Time sliped away like sand through an hourglass.",
            "sent5": "Her fingers sliped effortlessly over the piano keys."
        },
        {
            "definition": "A mistake or error",
            "pos": "noun",
            "sent1": "Making a sliped in the calculation led to the wrong answer.",
            "sent2": "The teacher pointed out the sliped in the student's essay.",
            "sent3": "The chef's sliped turned the soup into a salty mess.",
            "sent4": "His sliped was like a bump in the road to success.",
            "sent5": "The sliped in the contract caused confusion among the parties involved."
        },
        {
            "definition": "A piece of material used to cover or protect something",
            "pos": "noun",
            "sent1": "She placed a sliped over the table to keep it clean.",
            "sent2": "The car mechanic used a sliped to protect the floor from oil spills.",
            "sent3": "The sliped on the couch added a pop of color to the room.",
            "sent4": "The sliped on the book helped preserve its cover.",
            "sent5": "He wrapped the fragile item in a sliped before packing it."
        },
        {
            "definition": "To lose one's footing and fall",
            "pos": "verb",
            "sent1": "He sliped on the wet floor and fell down.",
            "sent2": "The hiker sliped on the rocky trail but quickly regained balance.",
            "sent3": "She sliped on the ice and landed in a heap of snow.",
            "sent4": "The skateboarder sliped off the rail and landed on the ground.",
            "sent5": "The dancer sliped gracefully across the stage, never missing a step."
        },
        {
            "definition": "To pass or escape from one's memory",
            "pos": "verb",
            "sent1": "The name sliped from my memory just as I was about to say it.",
            "sent2": "Details of the meeting sliped from his mind as he got busy with other tasks.",
            "sent3": "The lyrics of the song sliped from her memory during the performance.",
            "sent4": "The key information sliped from his memory during the exam.",
            "sent5": "Important dates tend to sliped from my memory if I don't write them down."
        }
    ]
}