{
    "term": "slipped",
    "meanings": [
        {
            "definition": "To move smoothly and quietly",
            "pos": "verb",
            "sent1": "The cat slipped through the door without making a sound.",
            "sent2": "She slipped into the room unnoticed.",
            "sent3": "The ninja slipped past the guards like a shadow.",
            "sent4": "Time slipped away as they enjoyed the peaceful evening.",
            "sent5": "The boat slipped gracefully across the calm water."
        },
        {
            "definition": "To lose one's footing and slide unintentionally",
            "pos": "verb",
            "sent1": "He slipped on the wet floor and fell down.",
            "sent2": "The child slipped on the ice and landed on the ground.",
            "sent3": "She slipped on a banana peel, causing everyone to laugh.",
            "sent4": "The car slipped on the icy road, spinning out of control.",
            "sent5": "The hiker slipped on the loose rocks, but quickly regained balance."
        },
        {
            "definition": "To make a mistake or error",
            "pos": "verb",
            "sent1": "I slipped up and forgot to send the important email.",
            "sent2": "He slipped and used the wrong formula in the math problem.",
            "sent3": "She slipped and accidentally deleted the entire document.",
            "sent4": "The comedian slipped and told the wrong joke at the party.",
            "sent5": "They slipped in their presentation and missed a key point."
        },
        {
            "definition": "To pass or go quickly or easily",
            "pos": "verb",
            "sent1": "The key slipped into the lock effortlessly.",
            "sent2": "The puzzle pieces slipped together perfectly.",
            "sent3": "The plan slipped into place without any issues.",
            "sent4": "The words slipped off his tongue smoothly during the speech.",
            "sent5": "The gears slipped into position with a satisfying click."
        },
        {
            "definition": "To escape or elude detection",
            "pos": "verb",
            "sent1": "The spy slipped away before anyone noticed.",
            "sent2": "The thief slipped out of the building without being seen.",
            "sent3": "The ghost slipped through the walls, unseen by the living.",
            "sent4": "The shadow slipped into the darkness, disappearing from sight.",
            "sent5": "The fugitive slipped past the police and vanished into the night."
        }
    ]
}