{
    "term": "slosh",
    "meanings": [
        {
            "definition": "To move with a splashing sound",
            "pos": "verb",
            "sent1": "The water will slosh as the boat moves.",
            "sent2": "I can hear the milk slosh in the jug.",
            "sent3": "Don't slosh your drink while dancing!",
            "sent4": "Her emotions slosh around inside her like a stormy sea.",
            "sent5": "The rain sloshes against the window, creating a soothing rhythm."
        },
        {
            "definition": "A sloshing or splashing sound",
            "pos": "noun",
            "sent1": "The slosh of the waves was calming.",
            "sent2": "I heard a loud slosh coming from the kitchen.",
            "sent3": "The slosh of the fountain made me want to dance.",
            "sent4": "The slosh of the waterfall echoed through the canyon.",
            "sent5": "The slosh of the mud under my boots signaled the start of the rainy season."
        },
        {
            "definition": "To spill or splash liquid around",
            "pos": "verb",
            "sent1": "Be careful not to slosh the soup out of the bowl.",
            "sent2": "The kids accidentally sloshed paint on the floor.",
            "sent3": "The cat loves to slosh water out of its bowl while playing.",
            "sent4": "The overflowing river sloshed over the banks.",
            "sent5": "The clumsy waiter sloshed wine on the customer's shirt."
        },
        {
            "definition": "A quantity of liquid that has been spilled or splashed around",
            "pos": "noun",
            "sent1": "There was a slosh of milk on the table.",
            "sent2": "The floor was wet from a slosh of water.",
            "sent3": "The chef accidentally added a slosh of vinegar to the recipe.",
            "sent4": "The bucket was heavy with a slosh of cleaning solution.",
            "sent5": "The garden hose sprayed a slosh of water onto the flowers."
        }
    ]
}