{
    "term": "slues",
    "meanings": [
        {
            "definition": "To turn or swing around a fixed point",
            "pos": "verb",
            "sent1": "The car began to slues around the corner.",
            "sent2": "He slues the telescope to get a better view of the stars.",
            "sent3": "The dancer slues gracefully across the stage.",
            "sent4": "The windmill slues in the breeze, its blades spinning.",
            "sent5": "The compass needle slues northward, pointing the way home."
        },
        {
            "definition": "A large number or quantity",
            "pos": "noun",
            "sent1": "There were slues of books on the library shelves.",
            "sent2": "She had slues of toys scattered across the floor.",
            "sent3": "The bakery produced slues of delicious pastries every morning.",
            "sent4": "The garden was filled with slues of colorful flowers.",
            "sent5": "The factory manufactured slues of paper clips each day."
        },
        {
            "definition": "A marshy or reedy pool or pond",
            "pos": "noun",
            "sent1": "The ducks swam in the slues, surrounded by tall grass.",
            "sent2": "Frogs croaked by the slues, hidden among the cattails.",
            "sent3": "The children played near the slues, searching for tadpoles.",
            "sent4": "Dragonflies hovered above the slues, their wings shimmering.",
            "sent5": "The heron stood at the edge of the slues, waiting for fish to swim by."
        },
        {
            "definition": "To cause to turn or pivot",
            "pos": "verb",
            "sent1": "She slues the wheel to steer the boat in the right direction.",
            "sent2": "The mechanic slues the gears to adjust the machine's speed.",
            "sent3": "The captain slues the ship to avoid the iceberg.",
            "sent4": "He slues the camera to capture the perfect angle of the sunset.",
            "sent5": "The astronaut slues the spacecraft towards the orbiting space station."
        }
    ]
}