{
    "term": "slugs",
    "meanings": [
        {
            "definition": "A slimy, land-dwelling mollusk without a shell.",
            "pos": "noun",
            "sent1": "I saw some slugs crawling on the wet ground.",
            "sent2": "Gardening can be challenging when slugs eat your plants.",
            "sent3": "The slugs in the garden were having a slow race.",
            "sent4": "The slugs on the sidewalk moved as slowly as time itself.",
            "sent5": "The squishy slugs left a trail behind them."
        },
        {
            "definition": "A solid projectile for a firearm.",
            "pos": "noun",
            "sent1": "The soldier loaded the gun with slugs for target practice.",
            "sent2": "The hunter used slugs to hunt deer in the forest.",
            "sent3": "The slugs in the ammunition box were ready for action.",
            "sent4": "The slugs flew through the air with incredible speed.",
            "sent5": "The metal slugs hit the target accurately."
        },
        {
            "definition": "A counterfeit coin.",
            "pos": "noun",
            "sent1": "The cashier caught the customer trying to pay with slugs.",
            "sent2": "The museum displayed a collection of historical slugs.",
            "sent3": "The slugs in the piggy bank turned out to be fake.",
            "sent4": "The slugs were so well-made that they fooled many people.",
            "sent5": "The old man found a bag full of slugs in his attic."
        },
        {
            "definition": "To hit someone with a hard blow.",
            "pos": "verb",
            "sent1": "He slugs the punching bag to release his anger.",
            "sent2": "The boxer slugs his opponent with a powerful punch.",
            "sent3": "She playfully slugs her friend on the shoulder.",
            "sent4": "The storm slugs the coast with strong winds.",
            "sent5": "The baseball player slugs the ball out of the park."
        }
    ]
}