{
    "term": "slush",
    "meanings": [
        {
            "definition": "A mixture of snow and water",
            "pos": "noun",
            "sent1": "After the snowfall, the kids played in the slush outside.",
            "sent2": "The slush on the sidewalk made it slippery to walk on.",
            "sent3": "The slush looked like a slushie drink spilled on the ground.",
            "sent4": "The slush covered the road like a blanket of wet cotton.",
            "sent5": "The slush reflected the sunlight, creating a sparkling effect."
        },
        {
            "definition": "A semi-liquid mud or sludge",
            "pos": "noun",
            "sent1": "The heavy rain turned the dirt road into slush.",
            "sent2": "The workers had to clean up the slush after the flood.",
            "sent3": "The slush oozed out of the broken pipe like a slow-moving river.",
            "sent4": "The slush in the swamp was thick and sticky like glue.",
            "sent5": "The slush stuck to the boots, making it hard to walk."
        },
        {
            "definition": "To splash or slosh through wet or muddy substance",
            "pos": "verb",
            "sent1": "The kids loved to slush around in the puddles after the rain.",
            "sent2": "She had to slush through the flooded street to get home.",
            "sent3": "The dog slushed through the mud, leaving paw prints everywhere.",
            "sent4": "The car tires slushed through the slushy snow on the road.",
            "sent5": "The hikers slushed through the wet trail, enjoying the adventure."
        },
        {
            "definition": "To work in a casual or lazy manner",
            "pos": "verb",
            "sent1": "He decided to slush through his homework instead of focusing.",
            "sent2": "She tends to slush through her chores on lazy Sundays.",
            "sent3": "The cat slushed around the house, looking for a cozy spot.",
            "sent4": "The students slushed through the group project without much effort.",
            "sent5": "The chef slushed through the recipe, resulting in a messy dish."
        }
    ]
}