{
    "term": "smack",
    "meanings": [
        {
            "definition": "A sharp blow or slap",
            "pos": "noun",
            "sent1": "He felt a smack on his cheek after the argument.",
            "sent2": "The smack of the ball against the wall echoed in the room.",
            "sent3": "She gave the cake a playful smack to test its freshness.",
            "sent4": "The news hit him like a smack to the face.",
            "sent5": "The smack of the ruler on the desk silenced the class instantly."
        },
        {
            "definition": "A loud noise",
            "pos": "noun",
            "sent1": "The smack of thunder startled the children.",
            "sent2": "The smack of the door closing reverberated through the house.",
            "sent3": "The smack of the drum interrupted the quiet evening.",
            "sent4": "The smack of the fireworks lit up the night sky.",
            "sent5": "The smack of the waves against the shore was calming."
        },
        {
            "definition": "To hit or slap with force",
            "pos": "verb",
            "sent1": "He had to smack the mosquito to stop it from biting.",
            "sent2": "She warned him not to smack his sister in anger.",
            "sent3": "The chef had to smack the dough to knead it properly.",
            "sent4": "The wind seemed to smack against the windows during the storm.",
            "sent5": "He could feel the pain as the ball smacked into his face."
        },
        {
            "definition": "To make a sharp noise",
            "pos": "verb",
            "sent1": "The branches smack against the window in the wind.",
            "sent2": "The whip smack echoed through the arena.",
            "sent3": "The book fell off the shelf with a loud smack.",
            "sent4": "The raindrops smacked against the roof all night.",
            "sent5": "The door smacked shut behind him, startling everyone."
        },
        {
            "definition": "To taste or smell strongly of something",
            "pos": "verb",
            "sent1": "The soup smacked of garlic and herbs.",
            "sent2": "The air in the bakery smacked of freshly baked bread.",
            "sent3": "The stew smacked of too much salt, making it inedible.",
            "sent4": "The perfume smacked of a mix of flowers and citrus.",
            "sent5": "The dish smacked of nostalgia, reminding her of her childhood."
        }
    ]
}