{
    "term": "smacker",
    "meanings": [
        {
            "definition": "A loud kiss.",
            "pos": "noun",
            "sent1": "He gave her a big smacker on the cheek.",
            "sent2": "She planted a quick smacker on his lips before leaving.",
            "sent3": "The puppy surprised everyone by giving a loud smacker to its owner.",
            "sent4": "The sound of the waves crashing against the shore was like a gentle smacker from nature.",
            "sent5": "The comedian joked about how his grandma's smackers were always too loud."
        },
        {
            "definition": "A slang term for a British pound.",
            "pos": "noun",
            "sent1": "He exchanged his dollars for some British smackers.",
            "sent2": "The souvenir shop accepted both euros and British smackers.",
            "sent3": "The tourist was excited to get his hands on some British smackers for souvenirs.",
            "sent4": "In the UK, you can hear people talking about the value of the smacker in the market.",
            "sent5": "The old man kept a jar full of British smackers from his travels."
        },
        {
            "definition": "A slang term for a dollar.",
            "pos": "noun",
            "sent1": "He found a few smackers in his pocket and decided to buy some candy.",
            "sent2": "She asked her dad for a couple of smackers to buy a new book.",
            "sent3": "The kids were thrilled to receive some extra smackers for their allowance.",
            "sent4": "The street performer was happy to collect some smackers from the generous crowd.",
            "sent5": "The piggy bank was full of shiny silver smackers."
        },
        {
            "definition": "A slang term for a large sum of money.",
            "pos": "noun",
            "sent1": "Winning the lottery meant he was suddenly swimming in smackers.",
            "sent2": "The business deal brought in a hefty amount of smackers for the company.",
            "sent3": "The treasure hunter's eyes sparkled at the sight of so many smackers.",
            "sent4": "The charity event raised a significant number of smackers for the cause.",
            "sent5": "The movie star's mansion cost a fortune, but he had the smackers to afford it."
        }
    ]
}