{
    "term": "smacks",
    "meanings": [
        {
            "definition": "A sharp slap or blow, typically with the palm of the hand.",
            "pos": "noun",
            "sent1": "He felt the sharp smack on his cheek.",
            "sent2": "The smack on the table echoed in the room.",
            "sent3": "The clown's exaggerated smack on his own face made everyone laugh.",
            "sent4": "The news of the scandal hit him like a smack to the face.",
            "sent5": "The sound of the smack was so loud, it startled everyone in the room."
        },
        {
            "definition": "A taste or flavor that is distinctive and strong.",
            "pos": "noun",
            "sent1": "The cake had a sweet smack of vanilla.",
            "sent2": "The spicy smack of the chili lingered on his tongue.",
            "sent3": "The unexpected smack of garlic in the dessert puzzled the guests.",
            "sent4": "The wine had a rich smack of oak and berries.",
            "sent5": "The soup's smack of saltiness made it irresistible."
        },
        {
            "definition": "To strike with a sharp blow.",
            "pos": "verb",
            "sent1": "He smacks the ball with all his strength.",
            "sent2": "She smacks the table to get everyone's attention.",
            "sent3": "The cat smacks the toy mouse around playfully.",
            "sent4": "The storm smacks the trees with fierce winds.",
            "sent5": "The boxer smacks his opponent with a powerful punch."
        },
        {
            "definition": "To have a flavor that is distinctive and strong.",
            "pos": "verb",
            "sent1": "The soup smacks of garlic and herbs.",
            "sent2": "The dish smacks of exotic spices.",
            "sent3": "The cake unexpectedly smacks of lemon zest.",
            "sent4": "The coffee smacks of roasted beans and chocolate.",
            "sent5": "The sauce smacks of tangy tomatoes and basil."
        }
    ]
}