{
    "term": "smart",
    "meanings": [
        {
            "definition": "Having or showing quick intelligence or ready mental capability",
            "pos": "adjective",
            "sent1": "She is a smart student who always finishes her work quickly.",
            "sent2": "The smart boy solved the puzzle in no time.",
            "sent3": "The smart cat figured out how to open the door to get to its favorite toy.",
            "sent4": "Her smart decision to study early paid off during the exam.",
            "sent5": "The smart scientist discovered a new way to clean polluted water efficiently."
        },
        {
            "definition": "Stylish or elegant in appearance",
            "pos": "adjective",
            "sent1": "She looked very smart in her new dress for the party.",
            "sent2": "The smart gentleman wore a sharp suit to the event.",
            "sent3": "The smart outfit she picked out made her stand out in the crowd.",
            "sent4": "His smart attire caught everyone's attention at the gathering.",
            "sent5": "The smart design of the dress made it a popular choice among fashion enthusiasts."
        },
        {
            "definition": "Quick or prompt in action",
            "pos": "adjective",
            "sent1": "He made a smart decision to leave early and avoid the traffic.",
            "sent2": "The smart response of the firefighters saved the building from further damage.",
            "sent3": "The smart move to take a shortcut helped them reach the destination on time.",
            "sent4": "Her smart reaction to the emergency situation prevented any accidents.",
            "sent5": "The smart decision to act fast led to a successful outcome."
        },
        {
            "definition": "Capable of making adjustments or corrections",
            "pos": "adjective",
            "sent1": "The smart software automatically corrects spelling mistakes.",
            "sent2": "She used a smart tool to adjust the brightness of the screen.",
            "sent3": "The smart feature of the app allows users to customize their experience.",
            "sent4": "His smart device can adapt to different lighting conditions.",
            "sent5": "The smart technology enables easy modifications to the settings."
        },
        {
            "definition": "Marked by intelligence or quickness of mind",
            "pos": "adjective",
            "sent1": "The smart student grasped the concept quickly and aced the test.",
            "sent2": "Her smart thinking helped her come up with a creative solution to the problem.",
            "sent3": "The smart idea to use a different approach proved to be successful.",
            "sent4": "His smart strategy outsmarted the competition in the game.",
            "sent5": "The smart decision-making process led to innovative solutions for the company."
        }
    ]
}