{
    "term": "smarminess",
    "meanings": [
        {
            "definition": "Excessive flattery or ingratiating behavior",
            "pos": "noun",
            "sent1": "Her smarminess towards the boss was obvious to everyone in the office.",
            "sent2": "The salesman's smarminess made customers feel uncomfortable.",
            "sent3": "The waiter's smarminess was so over-the-top that it made the diners chuckle.",
            "sent4": "His smarminess was like a sticky syrup that no one could escape from.",
            "sent5": "The politician's smarminess was like a shiny mask hiding his true intentions."
        },
        {
            "definition": "Unctuousness or insincere charm",
            "pos": "noun",
            "sent1": "The celebrity's smarminess in interviews made people question his sincerity.",
            "sent2": "She saw through his smarminess and knew he was not to be trusted.",
            "sent3": "The smarminess of the used car salesman was so exaggerated that it became comical.",
            "sent4": "His smarminess was like a thin layer of oil, making everything he said slippery.",
            "sent5": "The smarminess of the con artist was like a polished apple - appealing on the outside but rotten within."
        },
        {
            "definition": "A manner that is excessively smooth, polite, or ingratiating, typically in a way that is perceived as insincere or excessive",
            "pos": "noun",
            "sent1": "The teacher's smarminess towards the principal was transparent to the students.",
            "sent2": "His smarminess at the party made many guests roll their eyes.",
            "sent3": "The smarminess of the salesperson was so thick you could cut it with a knife.",
            "sent4": "Her smarminess was like a sugary coating that masked her true feelings.",
            "sent5": "The lawyer's smarminess was like a polished mirror reflecting back false images."
        }
    ]
}