{
    "term": "smashing",
    "meanings": [
        {
            "definition": "Extremely impressive or attractive",
            "pos": "adjective",
            "sent1": "The fireworks display was smashing, lighting up the night sky with vibrant colors.",
            "sent2": "The movie received a smashing review from critics for its captivating storyline.",
            "sent3": "The little girl's drawing of a unicorn was so smashing that it made everyone smile.",
            "sent4": "Her smile was as smashing as a ray of sunshine on a cloudy day.",
            "sent5": "The grand castle stood there, a smashing sight against the backdrop of the mountains."
        },
        {
            "definition": "Very successful or popular",
            "pos": "adjective",
            "sent1": "The new restaurant in town became smashing overnight, with people lining up to taste their food.",
            "sent2": "The song became a smashing hit, playing on radios everywhere.",
            "sent3": "The idea of having a pet rock became smashing among the kids in the neighborhood.",
            "sent4": "Her fashion sense was as smashing as a celebrity walking down the red carpet.",
            "sent5": "The event was a smashing success, with everyone talking about it for weeks."
        },
        {
            "definition": "Forcefully breaking something into pieces",
            "pos": "verb",
            "sent1": "He was smashing the old vase with a hammer to create mosaic pieces for his art project.",
            "sent2": "The angry child was smashing his toys on the floor in a tantrum.",
            "sent3": "The chef was smashing garlic cloves to add flavor to the dish.",
            "sent4": "The waves were smashing against the rocks, creating a mesmerizing spray of water.",
            "sent5": "The demolition crew was smashing down the old building to make way for a new skyscraper."
        },
        {
            "definition": "A great or impressive success",
            "pos": "noun",
            "sent1": "The launch of the new product was a smashing, boosting the company's profits.",
            "sent2": "Winning the championship was a smashing for the team, celebrating their hard work.",
            "sent3": "The surprise party turned out to be a smashing, leaving the birthday girl speechless.",
            "sent4": "The discovery of the ancient artifact was a smashing in the field of archaeology.",
            "sent5": "The charity event was a smashing, raising a significant amount for those in need."
        }
    ]
}