{
    "term": "smash",
    "meanings": [
        {
            "definition": "Break violently into pieces.",
            "pos": "verb",
            "sent1": "He tried to smash the piñata at the party.",
            "sent2": "The hammer will smash the glass bottle.",
            "sent3": "The little boy pretended to smash his toy car into a wall.",
            "sent4": "The storm's strong winds seemed to smash everything in their path.",
            "sent5": "The earthquake caused the ground to shake and smash buildings apart."
        },
        {
            "definition": "A hard hit or blow.",
            "pos": "noun",
            "sent1": "The wrestler delivered a powerful smash to his opponent.",
            "sent2": "The baseball player's smash sent the ball flying out of the park.",
            "sent3": "The cat's playful smash knocked over the tower of blocks.",
            "sent4": "The boxer's final smash knocked his opponent out cold.",
            "sent5": "The tree branch fell with a loud smash onto the roof of the house."
        },
        {
            "definition": "A successful hit in sports.",
            "pos": "noun",
            "sent1": "The tennis player's powerful smash won him the match.",
            "sent2": "The volleyball player's smash was too fast for the opponent to return.",
            "sent3": "The soccer player's unexpected smash caught the goalie off guard.",
            "sent4": "The basketball player's slam dunk was a crowd-pleasing smash.",
            "sent5": "The golfer's perfect smash sent the ball straight into the hole."
        },
        {
            "definition": "A big success.",
            "pos": "noun",
            "sent1": "The new movie was a box office smash.",
            "sent2": "The company's latest product release was a smash hit.",
            "sent3": "The bake sale was a smash, with all the treats selling out quickly.",
            "sent4": "The singer's debut album became a smash success overnight.",
            "sent5": "The student's science project was a smash with the judges at the fair."
        }
    ]
}