{
    "term": "smashes",
    "meanings": [
        {
            "definition": "Break or shatter into pieces.",
            "pos": "verb",
            "sent1": "He smashes the vase with a hammer.",
            "sent2": "She smashes the piñata at the party.",
            "sent3": "The toddler smashes the tower of blocks with glee.",
            "sent4": "The storm smashes against the windows, rattling them.",
            "sent5": "The wrestler smashes his opponent to the ground with a powerful move."
        },
        {
            "definition": "Hit or strike forcefully.",
            "pos": "verb",
            "sent1": "The baseball player smashes the ball out of the park.",
            "sent2": "She smashes the ball over the net in tennis.",
            "sent3": "The chef smashes the garlic cloves to release their flavor.",
            "sent4": "The waves smashes against the rocks with great power.",
            "sent5": "The superhero smashes through the wall to rescue the hostages."
        },
        {
            "definition": "A forceful impact or collision.",
            "pos": "noun",
            "sent1": "The car accident resulted in a loud smash.",
            "sent2": "The wrestler's body slam made a loud smash on the mat.",
            "sent3": "The clumsy waiter caused a loud smash of plates in the restaurant.",
            "sent4": "The meteorite made a deafening smash as it hit the ground.",
            "sent5": "The tree fell with a resounding smash in the forest."
        },
        {
            "definition": "A successful or impressive performance or achievement.",
            "pos": "noun",
            "sent1": "Her singing at the concert was a smash hit.",
            "sent2": "The new movie release was a box office smash.",
            "sent3": "The magician's trick was a smash with the audience.",
            "sent4": "The athlete's record-breaking run was a smash in the competition.",
            "sent5": "The entrepreneur's innovative idea was a smash success in the market."
        }
    ]
}