{
    "term": "smelters",
    "meanings": [
        {
            "definition": "A person or machine that smelts ore.",
            "pos": "noun",
            "sent1": "The skilled smelters worked tirelessly to extract metal from the ore.",
            "sent2": "The smelters at the factory use special equipment to melt the ore.",
            "sent3": "The smelters decided to have a competition to see who could smelt the most ore in a day.",
            "sent4": "The smelters were like alchemists, turning rocks into precious metals.",
            "sent5": "The smelters' workshop was filled with the intense heat of the melting process."
        },
        {
            "definition": "A plant where smelting is done.",
            "pos": "noun",
            "sent1": "The smelters in the town were the main source of employment for many.",
            "sent2": "The old smelters by the river had been abandoned for years.",
            "sent3": "The smelters' chimney looked like a giant pencil sticking out of the ground.",
            "sent4": "The smelters hummed with activity as the workers prepared for another day of smelting.",
            "sent5": "The smelters' smokestacks billowed smoke into the sky, a sign of their constant work.",
            "sent6": "Near the smelters, the air was always filled with the smell of melting metal."
        },
        {
            "definition": "The process of extracting a metal from its ore by a process involving heating and melting.",
            "pos": "noun",
            "sent1": "The smelters' job was to turn raw ore into valuable metal through smelting.",
            "sent2": "The ancient smelters used primitive methods to extract metal from ore.",
            "sent3": "The smelters' process was so efficient that they could smelt large quantities of ore in a short time.",
            "sent4": "The smelters' furnaces roared to life, ready to begin the smelting process.",
            "sent5": "The smelters' work was crucial in turning ore into useful metal for various industries."
        }
    ]
}