{
    "term": "smockings",
    "meanings": [
        {
            "definition": "The act of gathering fabric into small, even folds",
            "pos": "noun",
            "sent1": "She carefully did the smockings on the dress, creating neat folds.",
            "sent2": "The intricate smockings on the blouse added a touch of elegance.",
            "sent3": "The tailor's apprentice attempted the smockings but ended up with a tangled mess!",
            "sent4": "Her fingers moved swiftly, like skilled dancers, as she performed the smockings.",
            "sent5": "The smockings on the curtains resembled tiny waves frozen in time."
        },
        {
            "definition": "A decorative embroidery technique using gathered fabric",
            "pos": "noun",
            "sent1": "The artist showcased her talent by incorporating smockings into the design.",
            "sent2": "The pillow was adorned with beautiful smockings that caught everyone's eye.",
            "sent3": "The smockings on the tablecloth seemed to dance under the dim candlelight.",
            "sent4": "Her grandmother's handkerchief held delicate smockings that told stories of the past.",
            "sent5": "The smockings on the tapestry added depth and texture to the artwork."
        },
        {
            "definition": "A garment with gathered or embroidered fabric, typically worn by women or children",
            "pos": "noun",
            "sent1": "She wore a lovely dress with intricate smockings for the special occasion.",
            "sent2": "The children's smockings were adorned with colorful flowers and patterns.",
            "sent3": "The fashion designer's new collection featured modern twists on traditional smockings.",
            "sent4": "The vintage smockings on display at the museum captured the essence of a bygone era.",
            "sent5": "Her favorite smockings were passed down from her mother, each stitch holding memories."
        }
    ]
}