{
    "term": "smoked",
    "meanings": [
        {
            "definition": "To inhale and exhale the smoke of burning tobacco or a drug.",
            "pos": "verb",
            "sent1": "He smoked a cigarette outside.",
            "sent2": "She always smoked a pipe after dinner.",
            "sent3": "The detective smoked out the suspect from his hiding place.",
            "sent4": "The campfire smoked lazily in the evening breeze.",
            "sent5": "The factory chimney smoked heavily, polluting the air.",
            "sent6": "After a long day, he finally smoked his favorite cigar.",
            "sent7": "The old man smoked his pipe while reading the newspaper.",
            "sent8": "The barbecue smoked deliciously as the meat cooked slowly.",
            "sent9": "The car's engine smoked after running for hours without a break.",
            "sent10": "The volcano smoked ominously before erupting."
        },
        {
            "definition": "To preserve (food) by exposure to smoke.",
            "pos": "verb",
            "sent1": "They smoked the fish to keep it fresh.",
            "sent2": "The villagers smoked the meat to store it for winter.",
            "sent3": "The chef accidentally smoked the cheese too long, giving it a strong flavor.",
            "sent4": "The smokehouse smoked the ham perfectly for a savory taste.",
            "sent5": "The hunter smoked the jerky to enjoy on his hunting trip.",
            "sent6": "The family smoked the sausages for a barbecue party.",
            "sent7": "The butcher smoked the bacon to enhance its flavor.",
            "sent8": "The restaurant smoked the salmon for a unique dish.",
            "sent9": "The farmer smoked the hams for the upcoming festival.",
            "sent10": "The chef smoked the duck breast for a gourmet meal."
        },
        {
            "definition": "Having been treated in this way.",
            "pos": "adjective",
            "sent1": "The smoked salmon was a hit at the party.",
            "sent2": "She loved the smoked cheese on her sandwich.",
            "sent3": "The smoked ham had a rich flavor.",
            "sent4": "The smoked meat was a specialty of the region.",
            "sent5": "The smoked fish was a delicacy in the coastal town.",
            "sent6": "The smoked sausage was a favorite at the barbecue.",
            "sent7": "The smoked turkey was the centerpiece of the Thanksgiving feast.",
            "sent8": "The smoked bacon added a delicious touch to the salad.",
            "sent9": "The smoked tofu surprised the vegetarian guests.",
            "sent10": "The smoked almonds were a crunchy snack at the picnic."
        }
    ]
}