{
    "term": "smokejack",
    "meanings": [
        {
            "definition": "A device for turning a spit by means of a current of heated air or gas.",
            "pos": "noun",
            "sent1": "The smokejack helped roast the meat evenly over the fire.",
            "sent2": "The chef used the smokejack to rotate the skewers of kebabs.",
            "sent3": "The smokejack decided it was tired of spinning meat and wanted to try dancing instead.",
            "sent4": "The smokejack spun the food like a graceful ballerina twirling on stage.",
            "sent5": "With a gentle hum, the smokejack brought life to the motionless roast.",
            "sent6": "After the feast, the smokejack was cleaned and put away for the night."
        },
        {
            "definition": "A chimney designed to create a draft for a fireplace or stove.",
            "pos": "noun",
            "sent1": "The smokejack above the fireplace helped the smoke escape.",
            "sent2": "The old house had a traditional smokejack to keep the air clear inside.",
            "sent3": "The mischievous squirrel mistook the smokejack for a slide and went for a wild ride.",
            "sent4": "The smokejack stood tall like a sentinel, guiding the smoke up and away.",
            "sent5": "The smokejack whistled softly as it directed the smoke out of the room.",
            "sent6": "In winter, the smokejack ensured the warmth stayed inside the cozy cabin."
        },
        {
            "definition": "To operate a smokejack.",
            "pos": "verb",
            "sent1": "She learned how to smokejack to impress her family with perfectly cooked meals.",
            "sent2": "He would often smokejack in the evenings to unwind after a long day.",
            "sent3": "The cat tried to smokejack, but ended up just making a mess in the kitchen.",
            "sent4": "As the wind howled outside, she calmly continued to smokejack the roast.",
            "sent5": "With precision and skill, he began to smokejack the meat over the crackling fire.",
            "sent6": "The chef taught the new apprentice how to smokejack with finesse."
        }
    ]
}