{
    "term": "smoking",
    "meanings": [
        {
            "definition": "The act of inhaling and exhaling the smoke of burning tobacco or other substances.",
            "pos": "noun",
            "sent1": "I saw a man outside the store who was smoking a cigarette.",
            "sent2": "My grandma quit smoking many years ago.",
            "sent3": "The detective followed the trail of smoking ashes to solve the mystery.",
            "sent4": "The smoking chimney signaled that someone was home.",
            "sent5": "The room was filled with the acrid smell of smoking cigars."
        },
        {
            "definition": "Emitting smoke or steam.",
            "pos": "adjective",
            "sent1": "The smoking chimney indicated a fire was burning inside.",
            "sent2": "The smoking volcano was a sight to behold.",
            "sent3": "The smoking engine of the old car sputtered to life.",
            "sent4": "The smoking barbecue filled the air with a delicious aroma.",
            "sent5": "The smoking chimney made the house look cozy on a cold night."
        },
        {
            "definition": "Preserving or curing (food) by exposure to smoke.",
            "pos": "verb",
            "sent1": "The chef was smoking the salmon to enhance its flavor.",
            "sent2": "My uncle loves smoking his own bacon at home.",
            "sent3": "The backyard was filled with the delicious smell of smoking meat.",
            "sent4": "The traditional way of smoking fish has been passed down for generations.",
            "sent5": "The process of smoking cheese requires patience and skill."
        },
        {
            "definition": "Hot or sexy in a way that suggests someone is attractive.",
            "pos": "adjective",
            "sent1": "The actor had a smoking look that captivated the audience.",
            "sent2": "She walked into the room with a smoking confidence.",
            "sent3": "The model's smoking appearance turned heads on the runway.",
            "sent4": "His smoking charm made him popular among his peers.",
            "sent5": "The singer's smoking outfit stole the show at the concert."
        }
    ]
}