{
    "term": "smolder",
    "meanings": [
        {
            "definition": "Burn slowly without a flame.",
            "pos": "verb",
            "sent1": "The campfire continued to smolder long after everyone had gone to bed.",
            "sent2": "The embers from the fire began to smolder as the night grew colder.",
            "sent3": "After the barbecue, the charcoal grill started to smolder, giving off a delicious aroma.",
            "sent4": "His anger seemed to smolder beneath the surface, ready to ignite at any moment.",
            "sent5": "The volcano's lava continued to smolder, threatening to erupt at any time."
        },
        {
            "definition": "Show suppressed anger or resentment.",
            "pos": "verb",
            "sent1": "She tried to hide her disappointment, but it was clear that her feelings were starting to smolder.",
            "sent2": "His eyes began to smolder with anger as he listened to the unfair accusations.",
            "sent3": "Despite his calm exterior, his frustration was starting to smolder like a simmering pot.",
            "sent4": "The tension in the room seemed to smolder, waiting for someone to break the silence.",
            "sent5": "Her resentment toward her coworker continued to smolder, affecting their working relationship."
        },
        {
            "definition": "Be in a state of suppressed activity or emotion.",
            "pos": "verb",
            "sent1": "The town seemed to smolder in the summer heat, with everyone seeking shade indoors.",
            "sent2": "His excitement for the upcoming trip was smoldering beneath his calm demeanor.",
            "sent3": "The mystery surrounding the old house continued to smolder in the minds of the curious children.",
            "sent4": "The unresolved issue between them seemed to smolder, never fully addressed.",
            "sent5": "The tension in the air was palpable, as if something dangerous was smoldering just out of sight."
        }
    ]
}