{
    "term": "smorg",
    "meanings": [
        {
            "definition": "A buffet meal of various hot and cold dishes.",
            "pos": "noun",
            "sent1": "At the party, there was a delicious smorg with sandwiches, salads, and desserts.",
            "sent2": "I love going to the restaurant for a smorg because I can try a little bit of everything.",
            "sent3": "The family picnic turned into a smorg when everyone brought their favorite dishes to share.",
            "sent4": "The potluck dinner was a smorg of flavors and aromas that filled the room.",
            "sent5": "The holiday feast was a grand smorg of dishes from different cultures."
        },
        {
            "definition": "A variety of small dishes served as appetizers.",
            "pos": "noun",
            "sent1": "The cocktail party had a delightful smorg of mini quiches, shrimp cocktails, and bruschetta.",
            "sent2": "The restaurant offered a tasty smorg of appetizers like sliders, wings, and spring rolls.",
            "sent3": "The tiny smorg of snacks disappeared quickly at the office meeting.",
            "sent4": "The appetizer platter was a colorful smorg of flavors and textures.",
            "sent5": "The wedding reception featured a beautiful smorg of hors d'oeuvres on silver trays."
        },
        {
            "definition": "To eat a meal consisting of a variety of dishes.",
            "pos": "verb",
            "sent1": "We decided to smorg at the new buffet restaurant to try all the different dishes.",
            "sent2": "During the holiday season, we like to smorg with friends and family to enjoy a feast together.",
            "sent3": "The foodies planned to smorg their way through the food festival, tasting everything in sight.",
            "sent4": "After a long day of hiking, we were ready to smorg on the picnic spread we had packed.",
            "sent5": "The group of friends loved to smorg at different restaurants to explore new cuisines together."
        }
    ]
}