{
    "term": "smuttiest",
    "meanings": [
        {
            "definition": "Covered in dirt or soot",
            "pos": "adjective",
            "sent1": "After playing outside, the children returned home with their smuttiest clothes.",
            "sent2": "The mechanic's hands were the smuttiest after a long day of fixing cars.",
            "sent3": "The puppy's playful antics left the room looking its smuttiest, with paw prints everywhere.",
            "sent4": "The old chimney was the smuttiest part of the house, covered in years of soot.",
            "sent5": "The artist's hands were the smuttiest canvas, creating beautiful paintings with charcoal."
        },
        {
            "definition": "Containing obscene or vulgar content",
            "pos": "adjective",
            "sent1": "The comedian's jokes were the smuttiest at the late-night show.",
            "sent2": "The graffiti on the wall was the smuttiest the town had ever seen.",
            "sent3": "The gossip magazine featured the smuttiest stories about celebrities.",
            "sent4": "The internet forum had the smuttiest comments, filled with inappropriate content.",
            "sent5": "The TV show had the smuttiest scenes, making viewers uncomfortable with its explicit content."
        },
        {
            "definition": "Showing a lack of cleanliness or decency",
            "pos": "adjective",
            "sent1": "The abandoned house on the corner looked the smuttiest on the block.",
            "sent2": "The cafeteria was the smuttiest place in the school, with food scattered everywhere.",
            "sent3": "Despite her efforts, the child's room always ended up looking its smuttiest by the end of the week.",
            "sent4": "The alley behind the restaurant was the smuttiest area, filled with trash and debris.",
            "sent5": "The public restroom was the smuttiest place in the park, in need of a thorough cleaning."
        }
    ]
}