{
    "term": "snags",
    "meanings": [
        {
            "definition": "A rough or sharp projection.",
            "pos": "noun",
            "sent1": "The tree had many snags sticking out from its trunk.",
            "sent2": "Be careful of the snags on the old fence.",
            "sent3": "The snag on the sweater made it look like a porcupine.",
            "sent4": "Her words hit me like sharp snags in the forest.",
            "sent5": "The snag on the rock tore my shirt as I passed by."
        },
        {
            "definition": "A difficulty or problem.",
            "pos": "noun",
            "sent1": "Overcoming the snag in the project took time and effort.",
            "sent2": "Financial snags can delay the construction process.",
            "sent3": "The snag in the plan turned out to be a blessing in disguise.",
            "sent4": "The snag in their relationship was finally resolved through communication.",
            "sent5": "Dealing with that snag felt like climbing a steep mountain."
        },
        {
            "definition": "To catch or obtain something.",
            "pos": "verb",
            "sent1": "She managed to snag the last cookie from the jar.",
            "sent2": "I tried to snag a good deal during the sale.",
            "sent3": "He snagged the opportunity before anyone else could.",
            "sent4": "The fisherman snagged a big fish in the river.",
            "sent5": "I hope to snag a seat in the front row at the concert."
        },
        {
            "definition": "To become caught or entangled.",
            "pos": "verb",
            "sent1": "Her hair snagged on the branch as she walked through the forest.",
            "sent2": "The kite snagged on the tree branch and wouldn't come down.",
            "sent3": "His shoelace snagged on the chair, causing him to trip.",
            "sent4": "The fabric snagged on the nail, tearing a hole in the curtain.",
            "sent5": "The thread snagged on a rough edge, causing the seamstress frustration."
        }
    ]
}