{
    "term": "snag",
    "meanings": [
        {
            "definition": "A rough or sharp projection.",
            "pos": "noun",
            "sent1": "Be careful of the snag on the fence.",
            "sent2": "The tree branch had a snag that tore my shirt.",
            "sent3": "The squirrel got stuck on the snag and couldn't move.",
            "sent4": "Her words hit me like a snag in the smooth fabric of our conversation.",
            "sent5": "The snag on the rock scratched my hand as I climbed."
        },
        {
            "definition": "A hidden obstacle or difficulty.",
            "pos": "noun",
            "sent1": "The unexpected test was a snag in my plans.",
            "sent2": "She faced many snags while trying to finish the project.",
            "sent3": "Finding a parking spot was a snag, but we managed to squeeze in.",
            "sent4": "The snag in their relationship was finally addressed during the therapy session.",
            "sent5": "Overcoming the snag in the road required teamwork and patience."
        },
        {
            "definition": "To catch or tear on a sharp projection.",
            "pos": "verb",
            "sent1": "I accidentally snagged my sweater on the nail.",
            "sent2": "She snagged her dress on the thorny bush.",
            "sent3": "He snagged the last cookie before anyone else could grab it.",
            "sent4": "The fish snagged the hook and fought against being reeled in.",
            "sent5": "The kite snagged on the tree branch and got stuck."
        },
        {
            "definition": "To obtain or secure quickly or unexpectedly.",
            "pos": "verb",
            "sent1": "She managed to snag the last ticket to the concert.",
            "sent2": "He snagged a great deal on the new phone.",
            "sent3": "I tried to snag a discount at the store, but it didn't work.",
            "sent4": "The detective finally snagged the criminal after weeks of investigation.",
            "sent5": "The team was able to snag victory in the final seconds of the game."
        }
    ]
}