{
    "term": "snagged",
    "meanings": [
        {
            "definition": "To catch or tear on a sharp projection",
            "pos": "verb",
            "sent1": "I snagged my sweater on a nail.",
            "sent2": "She snagged the last cookie before anyone else could get to it.",
            "sent3": "The mischievous squirrel snagged the picnic blanket and ran off with it.",
            "sent4": "His words snagged at her heart, leaving her feeling vulnerable.",
            "sent5": "The fisherman snagged a big catch that day, making him proud of his skills."
        },
        {
            "definition": "To obtain or secure quickly or unexpectedly",
            "pos": "verb",
            "sent1": "He snagged a great deal on the new phone.",
            "sent2": "They snagged front-row seats to the concert.",
            "sent3": "The kids snagged the last pieces of cake at the party.",
            "sent4": "Her quick thinking snagged her the promotion at work.",
            "sent5": "The team snagged victory in the final seconds of the game."
        },
        {
            "definition": "A sharp or rough projection",
            "pos": "noun",
            "sent1": "Be careful of the snagged edge on that metal sheet.",
            "sent2": "The tree branch had a snagged end that could poke someone.",
            "sent3": "The old wooden fence had many snagged points along its length.",
            "sent4": "The jagged rock had several snagged areas that could cut skin.",
            "sent5": "The rusty nail had a snagged tip that caught on clothing easily."
        },
        {
            "definition": "A hidden obstacle or difficulty",
            "pos": "noun",
            "sent1": "The unexpected test was a snagged in his plan to leave early.",
            "sent2": "She faced many snags while trying to complete the project.",
            "sent3": "The missing key was a snagged in their attempt to open the door.",
            "sent4": "Overcoming the financial snagged was a challenge for the small business.",
            "sent5": "The communication snagged between them led to misunderstandings."
        }
    ]
}