{
    "term": "snakebird",
    "meanings": [
        {
            "definition": "A type of bird that swims with only its head and neck above water, resembling a snake.",
            "pos": "noun",
            "sent1": "The snakebird gracefully glided through the water, its long neck arched elegantly.",
            "sent2": "I spotted a snakebird by the lake, its slender neck poking out of the water.",
            "sent3": "The snakebird decided to take up swimming lessons to improve its snake-like skills.",
            "sent4": "Watching the snakebird move through the water was like witnessing a slithering dance.",
            "sent5": "The snakebird's unique swimming style made it stand out among the other birds."
        },
        {
            "definition": "A bird of the family Anhingidae, known for its long neck and sharp beak.",
            "pos": "noun",
            "sent1": "With its sharp beak, the snakebird caught fish effortlessly in the lake.",
            "sent2": "The snakebird's long neck helped it reach deep into the water for its prey.",
            "sent3": "The snakebird challenged the heron to a fishing contest, confident in its skills.",
            "sent4": "The snakebird's beak was like a dagger, swiftly striking at its underwater targets.",
            "sent5": "The snakebird's hunting prowess was unmatched in the avian world."
        },
        {
            "definition": "A water bird with a long, slender neck and a pointed bill.",
            "pos": "noun",
            "sent1": "The snakebird's pointed bill was perfect for spearing fish in the water.",
            "sent2": "I marveled at the snakebird's elegant neck as it searched for food in the pond.",
            "sent3": "The snakebird's long neck made it the envy of all the other water birds.",
            "sent4": "The snakebird's bill was like a finely crafted spear, expertly used for fishing.",
            "sent5": "The snakebird's slender neck allowed it to move gracefully through the water."
        }
    ]
}