{
    "term": "snakebirds",
    "meanings": [
        {
            "definition": "a type of bird known for its long neck and snake-like appearance",
            "pos": "noun",
            "sent1": "The snakebirds slithered gracefully through the water, their long necks resembling snakes.",
            "sent2": "I spotted a group of snakebirds by the lake, their unique appearance catching my eye.",
            "sent3": "The snakebirds decided to have a fashion show, showing off their stylish long necks.",
            "sent4": "As the snakebirds glided through the water, they seemed to be dancing like serpents.",
            "sent5": "The children were amazed by the snakebirds, mistaking them for actual snakes at first glance."
        },
        {
            "definition": "birds that are often found near bodies of water",
            "pos": "noun",
            "sent1": "Near the pond, we saw a flock of snakebirds enjoying the sunny weather.",
            "sent2": "The snakebirds were busy fishing by the river, their beaks diving into the water.",
            "sent3": "The snakebirds held a picnic by the lake, enjoying the serene atmosphere.",
            "sent4": "The snakebirds' feathers glistened in the sunlight as they perched near the stream.",
            "sent5": "We often see the snakebirds near the marsh, hunting for their next meal."
        },
        {
            "definition": "a group of birds that are skilled at swimming and diving for food",
            "pos": "noun",
            "sent1": "The snakebirds dove into the water with precision, catching fish effortlessly.",
            "sent2": "Watching the snakebirds swim gracefully, I was amazed by their agility.",
            "sent3": "The snakebirds decided to host a synchronized swimming competition for fun.",
            "sent4": "The snakebirds' diving skills were so impressive, they could rival Olympic athletes.",
            "sent5": "The snakebirds' underwater hunting techniques were a sight to behold, showcasing their expertise."
        }
    ]
}