{
    "term": "snapping",
    "meanings": [
        {
            "definition": "To make a sudden, sharp cracking sound.",
            "pos": "verb",
            "sent1": "The twig was snapping loudly in the forest.",
            "sent2": "I heard the sound of snapping twigs under my feet.",
            "sent3": "The snapping of the pencil startled the quiet classroom.",
            "sent4": "The tension in the room was so high, you could feel it snapping.",
            "sent5": "The snapping of the firewood echoed through the night."
        },
        {
            "definition": "To speak abruptly or sharply.",
            "pos": "verb",
            "sent1": "She was snapping at everyone in the office today.",
            "sent2": "He was snapping orders left and right.",
            "sent3": "The teacher's snapping tone caught the students off guard.",
            "sent4": "Her words were like snapping twigs in the silence of the room.",
            "sent5": "The boss's snapping remarks made everyone uneasy."
        },
        {
            "definition": "To move quickly and sharply.",
            "pos": "verb",
            "sent1": "The fish was snapping away from the hook.",
            "sent2": "The squirrel was snapping between the trees.",
            "sent3": "The cat was snapping around the room in a playful chase.",
            "sent4": "The dancer's feet were snapping across the stage.",
            "sent5": "The wind was snapping the flags on the poles."
        },
        {
            "definition": "To break or separate with a sharp sound.",
            "pos": "verb",
            "sent1": "He was snapping the dry twigs in half.",
            "sent2": "The ice was snapping under the weight of the skater.",
            "sent3": "The cookie was snapping in half perfectly.",
            "sent4": "The tension in the room was so high, you could feel it snapping.",
            "sent5": "The snapping of the rope echoed in the canyon."
        },
        {
            "definition": "To take a photograph quickly.",
            "pos": "verb",
            "sent1": "She was snapping pictures of the sunset.",
            "sent2": "He was snapping photos of the wildlife.",
            "sent3": "The tourist was snapping shots of the famous landmarks.",
            "sent4": "The photographer was snapping memories with each click.",
            "sent5": "The camera was snapping away capturing the moment."
        }
    ]
}