{
    "term": "snap",
    "meanings": [
        {
            "definition": "To make a sudden, sharp cracking sound.",
            "pos": "verb",
            "sent1": "I heard a loud snap when the branch broke.",
            "sent2": "She likes to snap her fingers to music.",
            "sent3": "The snap of the pencil startled the class.",
            "sent4": "The ice snap echoed through the quiet forest.",
            "sent5": "The snap of the closing door made me jump."
        },
        {
            "definition": "A sudden, sharp cracking sound.",
            "pos": "noun",
            "sent1": "The snap of the twig alerted the hiker.",
            "sent2": "The snap of the whip echoed in the arena.",
            "sent3": "The snap of the cookie broke the silence.",
            "sent4": "The snap of the bone made him wince.",
            "sent5": "The snap of the firewood filled the room."
        },
        {
            "definition": "To break or cause to break suddenly and completely.",
            "pos": "verb",
            "sent1": "He tried to snap the stick in half.",
            "sent2": "The rope will snap if you pull too hard.",
            "sent3": "She accidentally snapped the pencil in two.",
            "sent4": "The tension in the air was about to snap.",
            "sent5": "The twig finally snapped under his weight."
        },
        {
            "definition": "A quick, sudden movement or action.",
            "pos": "noun",
            "sent1": "With a snap, he caught the ball.",
            "sent2": "The snap of the door closing signaled his arrival.",
            "sent3": "The snap of the fingers got everyone's attention.",
            "sent4": "The snap of the lock broke the silence.",
            "sent5": "The snap of the trap caught the mouse."
        },
        {
            "definition": "A photograph taken quickly and informally.",
            "pos": "noun",
            "sent1": "She took a snap of the beautiful sunset.",
            "sent2": "The family gathered for a quick snap.",
            "sent3": "The snap captured the joy of the moment.",
            "sent4": "The snap showed a candid moment of laughter.",
            "sent5": "The snap of the camera froze the memory in time."
        },
        {
            "definition": "A fastening device that makes a clicking sound when closed.",
            "pos": "noun",
            "sent1": "She heard the snap of the lock securing the door.",
            "sent2": "The snap of the buckle echoed in the quiet room.",
            "sent3": "The snap of the button signaled the end of the show.",
            "sent4": "The snap of the clasp kept the necklace in place.",
            "sent5": "The snap of the latch confirmed the door was shut."
        },
        {
            "definition": "To speak or utter something sharply or abruptly.",
            "pos": "verb",
            "sent1": "She would snap at anyone who interrupted her.",
            "sent2": "He tends to snap when he's stressed.",
            "sent3": "The teacher didn't mean to snap at the student.",
            "sent4": "He would snap out a response without thinking.",
            "sent5": "She would snap out orders without hesitation."
        }
    ]
}