{
    "term": "snapper",
    "meanings": [
        {
            "definition": "A person or thing that snaps.",
            "pos": "noun",
            "sent1": "The little snapper quickly closed the box.",
            "sent2": "The snapper on the jacket broke off.",
            "sent3": "The snapper in the movie always made everyone laugh.",
            "sent4": "Her temper was like a snapper, quick and sharp.",
            "sent5": "The snapper's action was so sudden, it startled everyone."
        },
        {
            "definition": "A type of fish.",
            "pos": "noun",
            "sent1": "We caught a big snapper while fishing.",
            "sent2": "The snapper was delicious when grilled.",
            "sent3": "The snapper in the aquarium seemed to be smiling.",
            "sent4": "The snapper swam gracefully through the water.",
            "sent5": "The snapper's scales shimmered in the sunlight."
        },
        {
            "definition": "A type of tool used for snapping.",
            "pos": "noun",
            "sent1": "He used the snapper to cut the wire.",
            "sent2": "The snapper made a loud noise when used.",
            "sent3": "The snapper in the toolbox was always handy.",
            "sent4": "She snapped the snapper shut with a click.",
            "sent5": "The snapper's blade was sharp and efficient."
        },
        {
            "definition": "A type of fastener.",
            "pos": "noun",
            "sent1": "She fastened the fabric with a snapper.",
            "sent2": "The snapper on the bag kept it securely closed.",
            "sent3": "The snapper on his shirt was missing, causing a gap.",
            "sent4": "The snapper clicked into place with ease.",
            "sent5": "The snapper's design made it easy to open and close."
        },
        {
            "definition": "A type of turtle.",
            "pos": "noun",
            "sent1": "The snapper crawled slowly along the sand.",
            "sent2": "The snapper's shell was hard and protective.",
            "sent3": "The snapper peeked out from under the rock.",
            "sent4": "The snapper retreated into its shell when scared.",
            "sent5": "The snapper's head popped out of the water to breathe."
        }
    ]
}