{
    "term": "snaps",
    "meanings": [
        {
            "definition": "A sudden, sharp cracking sound or movement.",
            "pos": "noun",
            "sent1": "The loud snaps of the branches scared the birds away.",
            "sent2": "I heard snaps of thunder in the distance.",
            "sent3": "The snaps of the door closing made me jump.",
            "sent4": "The snaps of the campfire were like applause in the quiet forest.",
            "sent5": "The snaps of the twigs under my feet echoed in the empty woods."
        },
        {
            "definition": "To break or cause to break suddenly and completely.",
            "pos": "verb",
            "sent1": "She snaps the pencil in half with ease.",
            "sent2": "The dry branches snap under my weight as I walk.",
            "sent3": "He snaps the cookie in two and shares it with his friend.",
            "sent4": "The tension in the air finally snaps, leading to a heated argument.",
            "sent5": "The rope snaps under the weight of the heavy load."
        },
        {
            "definition": "To speak abruptly or sharply.",
            "pos": "verb",
            "sent1": "She snaps at her brother for taking her toy.",
            "sent2": "The teacher snaps at the students for talking during the lesson.",
            "sent3": "He snaps back a quick response before storming off.",
            "sent4": "Her patience finally snaps, and she yells at the noisy neighbors.",
            "sent5": "The coach snaps instructions to the players during the game."
        },
        {
            "definition": "A fastener that closes by pressing together two parallel sections.",
            "pos": "noun",
            "sent1": "She fastened the cape with the snaps.",
            "sent2": "The snaps on the jacket kept it securely closed.",
            "sent3": "He struggled to open the snaps on the baby's onesie.",
            "sent4": "The snaps on the bag were easy to open and close.",
            "sent5": "The snaps on the bracelet gleamed in the sunlight."
        }
    ]
}