{
    "term": "snapped",
    "meanings": [
        {
            "definition": "To break suddenly and completely, typically with a sharp sound.",
            "pos": "verb",
            "sent1": "The twig snapped loudly under my foot.",
            "sent2": "She snapped the pencil in half with ease.",
            "sent3": "When the cookie snapped in two, it surprised everyone.",
            "sent4": "The tension in the air finally snapped like a rubber band.",
            "sent5": "The rope snapped under the weight of the heavy load."
        },
        {
            "definition": "To speak or say something quickly and sharply.",
            "pos": "verb",
            "sent1": "He snapped, 'Stop talking and listen!'",
            "sent2": "She snapped at him for interrupting the conversation.",
            "sent3": "The teacher snapped out the instructions in a stern voice.",
            "sent4": "Her words snapped like a whip, leaving him speechless.",
            "sent5": "The boss snapped out orders to the employees."
        },
        {
            "definition": "To move quickly and sharply.",
            "pos": "verb",
            "sent1": "The cat snapped up the toy and ran off.",
            "sent2": "The bird snapped away before I could take a picture.",
            "sent3": "The squirrel snapped across the yard in a blur.",
            "sent4": "The fish snapped through the water, escaping the predator.",
            "sent5": "The athlete snapped into action, sprinting towards the finish line."
        },
        {
            "definition": "To lose control mentally or emotionally.",
            "pos": "verb",
            "sent1": "After the breakup, she snapped and couldn't stop crying.",
            "sent2": "Under extreme pressure, he snapped and yelled at his colleagues.",
            "sent3": "The stress finally made him snap and throw his papers in the air.",
            "sent4": "The constant criticism caused her to snap and lash out.",
            "sent5": "The overwhelming emotions made him snap and retreat into solitude."
        },
        {
            "definition": "To fasten or close with a snap.",
            "pos": "verb",
            "sent1": "She snapped the suitcase shut before leaving.",
            "sent2": "He snapped the lock into place securely.",
            "sent3": "The bracelet snapped around her wrist, completing the look.",
            "sent4": "The puzzle pieces snapped together perfectly.",
            "sent5": "The door snapped closed behind him as he exited the room."
        }
    ]
}