{
    "term": "snobbery",
    "meanings": [
        {
            "definition": "The behavior or attitudes of a snob.",
            "pos": "noun",
            "sent1": "Her snobbery was evident when she refused to speak to anyone she deemed unworthy.",
            "sent2": "His snobbery made it difficult for him to make friends with people from different backgrounds.",
            "sent3": "Despite her snobbery, she found herself enjoying the company of the humble gardener.",
            "sent4": "The snobbery of the elite was like a thick fog, obscuring the beauty of diversity.",
            "sent5": "The snobbery in the room was palpable, creating an uncomfortable atmosphere."
        },
        {
            "definition": "The practice of behaving in a condescending manner towards others perceived as inferior.",
            "pos": "noun",
            "sent1": "His snobbery towards the new employees was unkind and unnecessary.",
            "sent2": "She displayed her snobbery by constantly belittling those who didn't share her interests.",
            "sent3": "The cat's snobbery towards the dog was comical, as if it thought itself royalty.",
            "sent4": "The snobbery in her tone cut through the room like a sharp knife, leaving everyone uncomfortable.",
            "sent5": "The snobbery of the fashion designer was legendary, making everyone feel inadequate."
        },
        {
            "definition": "The belief in the superiority of one's own social class or group.",
            "pos": "noun",
            "sent1": "Their snobbery towards people from different neighborhoods was based on ignorance.",
            "sent2": "The snobbery of the wealthy family was evident in their disdain for those less fortunate.",
            "sent3": "Despite his snobbery, he found himself drawn to the warmth and kindness of the local community.",
            "sent4": "The snobbery of the exclusive club was like a fortress, keeping out anyone deemed unworthy.",
            "sent5": "The snobbery of the group created an invisible barrier, isolating them from the rest of society."
        }
    ]
}