{
    "term": "snob",
    "meanings": [
        {
            "definition": "A person who believes themselves to be superior to others in taste or social status.",
            "pos": "noun",
            "sent1": "The snob at the party only talked to people with expensive clothes.",
            "sent2": "She was considered a snob because she only associated with wealthy individuals.",
            "sent3": "The snob in the office always looked down on others for their choice of music.",
            "sent4": "Being a snob is like living in a castle of arrogance, looking down on everyone else.",
            "sent5": "The snob's attitude made it hard for others to feel comfortable around them."
        },
        {
            "definition": "To behave in a superior manner towards others perceived as inferior.",
            "pos": "verb",
            "sent1": "Don't snob your classmates just because they have different hobbies.",
            "sent2": "He tends to snob his colleagues when they don't agree with his opinions.",
            "sent3": "She would often snob her little brother when he tried to join her games.",
            "sent4": "His decision to snob the new team member caused tension in the office.",
            "sent5": "It's not nice to snob people just because they don't share your interests."
        },
        {
            "definition": "A person who is overly concerned with status symbols and social prestige.",
            "pos": "noun",
            "sent1": "The snob always flaunted their designer bags and luxury car.",
            "sent2": "She was labeled a snob for constantly talking about her exclusive club memberships.",
            "sent3": "The snob's obsession with brand names made their friends roll their eyes.",
            "sent4": "In a world of snobs, the true value of kindness often gets overlooked.",
            "sent5": "The snob's focus on material possessions blinded them to the beauty of simple joys."
        }
    ]
}