{
    "term": "snort",
    "meanings": [
        {
            "definition": "To make an explosive sound by forcing air through the nose and mouth.",
            "pos": "verb",
            "sent1": "The little boy would snort when he laughed.",
            "sent2": "The horse snorted loudly as it galloped across the field.",
            "sent3": "The clown's exaggerated snort made everyone giggle.",
            "sent4": "The old car snorted and sputtered before finally starting.",
            "sent5": "The dragon in the story would snort fire when it was angry."
        },
        {
            "definition": "A loud, explosive sound made by forcing air through the nose and mouth.",
            "pos": "noun",
            "sent1": "The piglet's snort was surprisingly loud for its size.",
            "sent2": "I heard a snort coming from the bushes, and it startled me.",
            "sent3": "The snort of the baby elephant made the zoo visitors smile.",
            "sent4": "The snort of the train whistle echoed through the valley.",
            "sent5": "The sudden snort of laughter caught everyone off guard."
        },
        {
            "definition": "To express contempt or disapproval by making a snorting sound.",
            "pos": "verb",
            "sent1": "She would snort in disbelief at his outrageous claims.",
            "sent2": "The teacher would snort disapprovingly when students misbehaved.",
            "sent3": "He couldn't help but snort at the ridiculousness of the situation.",
            "sent4": "The audience would snort in amusement at the comedian's jokes.",
            "sent5": "The cat would snort in disdain at the sight of the new dog."
        },
        {
            "definition": "A sound resembling a snort, such as that made by a horse.",
            "pos": "noun",
            "sent1": "The engine made a strange snort before coming to a stop.",
            "sent2": "The snort of the machine indicated a problem with its operation.",
            "sent3": "The snort of the wind through the trees sounded eerie at night.",
            "sent4": "The snort of the waterfall could be heard from a distance.",
            "sent5": "The snort of the old building settling made the residents uneasy."
        }
    ]
}