{
    "term": "snorkel",
    "meanings": [
        {
            "definition": "A breathing tube used in swimming or diving.",
            "pos": "noun",
            "sent1": "I put on my snorkel to breathe underwater while exploring the colorful fish.",
            "sent2": "The snorkel helped me breathe easily as I swam among the coral reefs.",
            "sent3": "For Halloween, I dressed up as a snorkel, complete with a tube sticking out of my mouth.",
            "sent4": "Her snorkel was like a lifeline, allowing her to stay submerged in the deep sea of emotions.",
            "sent5": "The bright yellow snorkel stood out against the blue ocean, a symbol of safety and adventure."
        },
        {
            "definition": "To swim underwater using a snorkel.",
            "pos": "verb",
            "sent1": "I snorkel in the pool to practice holding my breath and swimming gracefully.",
            "sent2": "We often snorkel in the lake during summer to explore the hidden treasures below.",
            "sent3": "The synchronized swimming team decided to snorkel instead of using traditional breathing techniques.",
            "sent4": "As she snorkels through the waves, she feels a sense of freedom and tranquility.",
            "sent5": "The mermaid gracefully snorkels through the underwater caves, her tail shimmering in the sunlight."
        },
        {
            "definition": "A device allowing a submarine to operate at periscope depth.",
            "pos": "noun",
            "sent1": "The advanced snorkel on the submarine enabled it to stay hidden while still observing the surface.",
            "sent2": "The crew relied on the snorkel to maintain their position without being detected.",
            "sent3": "The submarine captain joked that the snorkel was the submarine's way of saying 'hello' to the world above.",
            "sent4": "The snorkel on the submarine was like a secret periscope, offering a glimpse of the outside world.",
            "sent5": "With the snorkel in place, the submarine could stay submerged yet aware of its surroundings."
        }
    ]
}