{
    "term": "snowboardcross",
    "meanings": [
        {
            "definition": "A snowboardcross is a competitive snowboarding event where multiple riders race down a course at the same time.",
            "pos": "noun",
            "sent1": "During the snowboardcross, many riders compete together on the snowy course.",
            "sent2": "I watched a thrilling snowboardcross race with several snowboarders speeding down the slope.",
            "sent3": "The snowboardcross turned into a chaotic race with snowboarders bumping into each other.",
            "sent4": "The snowboardcross was like a fast-paced snow adventure with riders zooming past each other.",
            "sent5": "The snowboardcross event was so exciting, with all the snowboarders racing side by side."
        },
        {
            "definition": "To snowboardcross is to participate in a snowboardcross event.",
            "pos": "verb",
            "sent1": "I want to snowboardcross next winter and join the thrilling race.",
            "sent2": "She loves to snowboardcross and compete against other snowboarders.",
            "sent3": "Let's snowboardcross together and see who reaches the finish line first!",
            "sent4": "He decided to snowboardcross for the first time and felt the adrenaline rush.",
            "sent5": "Snowboardingcrossing is a fun way to challenge yourself on the slopes."
        },
        {
            "definition": "The snowboardcross course is designed with various obstacles and features for riders to navigate.",
            "pos": "noun",
            "sent1": "The snowboardcross course had jumps, turns, and obstacles for the riders.",
            "sent2": "Riders need to practice navigating the snowboardcross course to improve their skills.",
            "sent3": "The snowboardcross course looked like a fun puzzle for the snowboarders to solve.",
            "sent4": "Navigating the snowboardcross course felt like a thrilling adventure for the riders.",
            "sent5": "The snowboardcross course challenged the riders with its twists and turns."
        }
    ]
}