{
    "term": "socas",
    "meanings": [
        {
            "definition": "A type of Caribbean music characterized by a fast tempo and rhythmic beat.",
            "pos": "noun",
            "sent1": "At the beach party, the DJ played lively socas that got everyone dancing.",
            "sent2": "The socas blared from the speakers, filling the air with infectious rhythms.",
            "sent3": "The socas were so catchy that even the shyest person couldn't resist tapping their feet.",
            "sent4": "Her laughter echoed through the room like the vibrant socas playing in the background.",
            "sent5": "The socas pulsed through the crowd, creating a joyful atmosphere."
        },
        {
            "definition": "The plural form of the word 'soca', referring to the genre of music.",
            "pos": "noun",
            "sent1": "The music store had a wide selection of socas for sale, catering to different tastes.",
            "sent2": "Fans of Caribbean music often have collections filled with various socas.",
            "sent3": "She joked that her playlist was so full of socas, it could last for days without repeating a song.",
            "sent4": "The socas on the radio seemed to blend together, creating a seamless flow of melodies.",
            "sent5": "The socas in his playlist were like a treasure trove of musical gems waiting to be discovered."
        },
        {
            "definition": "To engage in or listen to soca music at a party or event.",
            "pos": "verb",
            "sent1": "We decided to socas all night long at the carnival celebration.",
            "sent2": "People love to socas together, creating a sense of unity and joy.",
            "sent3": "He socas with such enthusiasm that he becomes the life of the party.",
            "sent4": "The music enveloped them, urging them to socas without a care in the world.",
            "sent5": "As the soca music played, they couldn't help but socas in perfect harmony."
        }
    ]
}