{
    "term": "socialistically",
    "meanings": [
        {
            "definition": "In a manner related to socialism.",
            "pos": "adverb",
            "sent1": "The community center operates socialistically, ensuring everyone has access to resources.",
            "sent2": "The group of friends shared their snacks socialistically during the picnic.",
            "sent3": "The ants worked socialistically to build their anthill, each carrying a tiny piece of food.",
            "sent4": "The music festival was organized socialistically, with volunteers contributing equally to its success.",
            "sent5": "The classroom was decorated socialistically, with students collaborating on colorful drawings for the walls."
        },
        {
            "definition": "With a focus on social ownership and control of the means of production.",
            "pos": "adjective",
            "sent1": "The company's socialistically structured policies ensured fair treatment of all workers.",
            "sent2": "The cooperative farm operated socialistically, with decisions made collectively by the farmers.",
            "sent3": "The socialistically managed factory ran smoothly, with profits shared among all employees.",
            "sent4": "The socialistically run bookstore prioritized community needs over individual profits.",
            "sent5": "The socialistically owned restaurant sourced ingredients locally to support nearby farmers."
        },
        {
            "definition": "In a way that promotes social equality and collective ownership.",
            "pos": "adverb",
            "sent1": "The charity event was organized socialistically, with donations benefiting the entire community.",
            "sent2": "The neighborhood association functioned socialistically, ensuring all residents had a say in decisions.",
            "sent3": "The group project was completed socialistically, with each member contributing equally.",
            "sent4": "The socialistically managed park provided a space for all to enjoy nature together.",
            "sent5": "The socialistically planned event aimed to bring people together for a common cause."
        }
    ]
}