{
    "term": "sociopsychological",
    "meanings": [
        {
            "definition": "Relating to the social and psychological aspects of behavior.",
            "pos": "adjective",
            "sent1": "The sociopsychological impact of peer pressure can be significant.",
            "sent2": "Researchers are interested in the sociopsychological factors that influence decision-making.",
            "sent3": "The sociopsychological dynamics of group therapy sessions can be quite revealing.",
            "sent4": "Her artwork delved into the sociopsychological depths of human emotion.",
            "sent5": "Understanding the sociopsychological complexities of relationships is crucial for therapists."
        },
        {
            "definition": "Involving the interaction between social and psychological factors.",
            "pos": "adjective",
            "sent1": "The sociopsychological approach considers both social and psychological elements.",
            "sent2": "The sociopsychological model helps explain the complexities of human behavior.",
            "sent3": "The sociopsychological connection between stress and social support is fascinating.",
            "sent4": "His speech highlighted the sociopsychological interplay in community development.",
            "sent5": "The book explores the sociopsychological implications of cultural norms."
        },
        {
            "definition": "Pertaining to the study of how society and psychology influence each other.",
            "pos": "adjective",
            "sent1": "The sociopsychological research aims to uncover the reciprocal effects of society and psychology.",
            "sent2": "The sociopsychological perspective sheds light on the interconnectedness of social and psychological phenomena.",
            "sent3": "The sociopsychological investigation revealed surprising correlations between societal norms and individual behavior.",
            "sent4": "The documentary delves into the sociopsychological aspects of conformity and identity.",
            "sent5": "She presented her findings on the sociopsychological impact of cultural diversity."
        }
    ]
}