{
    "term": "sociopolitical",
    "meanings": [
        {
            "definition": "Relating to society and politics.",
            "pos": "adjective",
            "sent1": "The sociopolitical issues discussed in the meeting were about how society and politics are connected.",
            "sent2": "The sociopolitical climate of the country greatly influences government decisions.",
            "sent3": "The sociopolitical debate turned into a lively discussion about the impact of policies on people's lives.",
            "sent4": "Her artwork subtly reflected the sociopolitical tensions present in the community.",
            "sent5": "The novel provided a vivid portrayal of the sociopolitical struggles faced by the characters."
        },
        {
            "definition": "Involving both social and political factors.",
            "pos": "adjective",
            "sent1": "The sociopolitical event brought together people from various social and political backgrounds.",
            "sent2": "The sociopolitical nature of the issue required a balanced approach to address all aspects.",
            "sent3": "The sociopolitical mix-up at the town hall meeting caused quite a stir among attendees.",
            "sent4": "The film depicted a sociopolitical landscape where power dynamics played a crucial role.",
            "sent5": "The professor's lecture shed light on the sociopolitical complexities of modern governance."
        },
        {
            "definition": "Concerned with the relationship between society and politics.",
            "pos": "adjective",
            "sent1": "Her research focused on the sociopolitical dynamics shaping public policies.",
            "sent2": "The sociopolitical analysis highlighted the interconnectedness of societal norms and political decisions.",
            "sent3": "The sociopolitical study group delved into the intricacies of societal structures and political systems.",
            "sent4": "The play offered a sociopolitical commentary on the state of democracy in the fictional world.",
            "sent5": "The documentary provided a clear picture of the sociopolitical challenges faced by marginalized communities."
        }
    ]
}