{
    "term": "societal",
    "meanings": [
        {
            "definition": "Relating to society or social relations.",
            "pos": "adjective",
            "sent1": "The teacher discussed the societal impact of technology on our daily lives.",
            "sent2": "It is important to consider the societal norms when making decisions.",
            "sent3": "The societal rules about sharing toys were broken when the kids decided to play together.",
            "sent4": "Her artwork reflected the societal fabric of the community, weaving together different perspectives.",
            "sent5": "The movie portrayed a futuristic societal structure where robots lived among humans."
        },
        {
            "definition": "Of or relating to the structure or organization of society.",
            "pos": "adjective",
            "sent1": "The governmental policies had a direct impact on the societal structure.",
            "sent2": "Anthropologists study the societal hierarchies within different cultures.",
            "sent3": "The societal puzzle was complex, with each piece representing a different aspect of society.",
            "sent4": "The artist's painting depicted a distorted societal framework, challenging viewers to rethink societal norms.",
            "sent5": "The book explored a fictional societal system where individuals were assigned roles at birth."
        },
        {
            "definition": "Involving or affecting society as a whole.",
            "pos": "adjective",
            "sent1": "The pandemic had a significant societal impact on global economies.",
            "sent2": "The new law aimed to address societal issues related to healthcare.",
            "sent3": "The societal celebration brought together people from all walks of life.",
            "sent4": "The environmental movement highlighted the interconnectedness of societal well-being and nature.",
            "sent5": "The play addressed societal challenges through the lens of a small community."
        }
    ]
}