{
    "term": "sockets",
    "meanings": [
        {
            "definition": "A hollow part or piece for receiving and holding something",
            "pos": "noun",
            "sent1": "The toolbox had small sockets to store the screws.",
            "sent2": "She placed the key in the socket to open the door.",
            "sent3": "The squirrel used the tree hollow as a cozy socket for its acorns.",
            "sent4": "The mountain acted as a giant socket, cradling the valley below.",
            "sent5": "The cupcake holder had individual sockets for each sweet treat."
        },
        {
            "definition": "A receptacle into which an electric plug can be inserted",
            "pos": "noun",
            "sent1": "The power strip had multiple sockets for all the devices.",
            "sent2": "He plugged the lamp into the wall socket to light up the room.",
            "sent3": "The overloaded socket sparked and sputtered, causing a blackout.",
            "sent4": "The socket hummed softly as the appliance drew power.",
            "sent5": "She carefully inserted the plug into the socket to charge her phone."
        },
        {
            "definition": "A means of transmitting data between a computer and a network",
            "pos": "noun",
            "sent1": "The ethernet socket allowed fast data transfer between devices.",
            "sent2": "He checked the network settings to troubleshoot the socket issue.",
            "sent3": "The data socket seemed to have a mind of its own, sending files randomly.",
            "sent4": "The digital socket acted as a bridge connecting the computer to the internet.",
            "sent5": "She clicked on the socket icon to establish a secure connection."
        },
        {
            "definition": "A joint or connecting point where two parts come together",
            "pos": "noun",
            "sent1": "The mechanic tightened the socket to secure the pipes together.",
            "sent2": "The socket between the bones allowed for smooth movement of the joint.",
            "sent3": "The Lego pieces clicked together perfectly, forming a sturdy socket.",
            "sent4": "Their friendship was like a strong socket, keeping them connected through thick and thin.",
            "sent5": "The puzzle pieces interlocked, creating a seamless socket between them."
        }
    ]
}