{
    "term": "solanos",
    "meanings": [
        {
            "definition": "Solanos: plural form of solano, a type of strong, hot wind in Spain",
            "pos": "noun",
            "sent1": "The solanos blew fiercely across the fields, drying everything in their path.",
            "sent2": "People in Spain are used to the solanos during the summer months.",
            "sent3": "The solanos played havoc with Maria's carefully arranged picnic.",
            "sent4": "Under the relentless solanos, the landscape seemed to shimmer in the heat.",
            "sent5": "The solanos howled like angry spirits, making it hard to hear anything else."
        },
        {
            "definition": "Solanos: plural form of solano, a type of plant in the nightshade family",
            "pos": "noun",
            "sent1": "The solanos in the garden were blooming beautifully in the moonlight.",
            "sent2": "Farmers cultivate solanos for their unique medicinal properties.",
            "sent3": "The mischievous cat kept nibbling on the solanos, thinking they were tasty treats.",
            "sent4": "The solanos in the garden stood tall and proud, casting long shadows in the evening sun.",
            "sent5": "The solanos swayed gently in the breeze, their purple flowers a striking contrast to the green leaves."
        },
        {
            "definition": "Solanos: plural form of solano, a type of coin in Peru",
            "pos": "noun",
            "sent1": "The merchant counted out the solanos carefully, making sure not to miss any.",
            "sent2": "In ancient times, solanos were used for trade and bartering in Peru.",
            "sent3": "The children pretended to be pirates, burying imaginary solanos in the backyard.",
            "sent4": "The solanos gleamed in the sunlight, a symbol of wealth and prosperity.",
            "sent5": "The old man's eyes lit up at the sight of the shiny solanos, memories of his youth flooding back."
        }
    ]
}