{
    "term": "solenoid",
    "meanings": [
        {
            "definition": "A coil of wire that acts as an electromagnet when carrying an electric current.",
            "pos": "noun",
            "sent1": "The solenoid in the doorbell makes it ring when electricity flows through it.",
            "sent2": "The solenoid in the car's starter helps to start the engine by creating a magnetic field.",
            "sent3": "The solenoid in the toy robot made it dance when connected to the battery.",
            "sent4": "Her voice was like a solenoid, drawing everyone's attention whenever she spoke.",
            "sent5": "The solenoid's magnetic power was so strong, it could pick up small metal objects easily."
        },
        {
            "definition": "A type of valve that uses a solenoid to control the flow of a liquid or gas.",
            "pos": "noun",
            "sent1": "The solenoid in the sprinkler system controls the water flow to the garden.",
            "sent2": "The solenoid in the coffee machine regulates the release of hot water for brewing.",
            "sent3": "The solenoid in the soda dispenser decided to have a fizzy party with the carbon dioxide.",
            "sent4": "Her decision to speak up acted like a solenoid, releasing a flood of emotions in the room.",
            "sent5": "The solenoid's role in the engine was crucial, ensuring the right amount of fuel was delivered."
        },
        {
            "definition": "A type of electrical switch that uses a solenoid to open or close a circuit.",
            "pos": "noun",
            "sent1": "The solenoid in the remote control activates the circuit to change the TV channel.",
            "sent2": "The solenoid in the security system locks the door when the alarm is set.",
            "sent3": "The solenoid in the game controller decided to take a break from pressing buttons.",
            "sent4": "His smile was like a solenoid, brightening up the room with its warmth.",
            "sent5": "The solenoid's click was a satisfying sound, indicating the circuit was successfully closed."
        }
    ]
}