{
    "term": "sole",
    "meanings": [
        {
            "definition": "The underside of a person's foot.",
            "pos": "noun",
            "sent1": "She felt the sand under her sole as she walked along the beach.",
            "sent2": "He had a pebble stuck in his sole, making it uncomfortable to walk.",
            "sent3": "The ticklish sensation on her sole made her giggle uncontrollably.",
            "sent4": "His sole was as tough as leather after years of walking barefoot.",
            "sent5": "The doctor examined the sole of his foot to check for any injuries."
        },
        {
            "definition": "The bottom of a shoe or boot.",
            "pos": "noun",
            "sent1": "The muddy sole of his boot left prints all over the clean floor.",
            "sent2": "She admired the intricate design on the sole of her new sneakers.",
            "sent3": "He accidentally stepped on gum, and now the sole of his shoe was sticky.",
            "sent4": "The worn-out sole of his work boots told the story of his hard labor.",
            "sent5": "The sole of her shoe squeaked on the polished floor with each step."
        },
        {
            "definition": "The only one of its kind.",
            "pos": "noun",
            "sent1": "The rare flower was the sole beauty in the otherwise barren field.",
            "sent2": "His antique watch was the sole remaining item from his grandfather.",
            "sent3": "The sole survivor of the shipwreck was finally rescued after days at sea.",
            "sent4": "The sole purpose of the meeting was to discuss the upcoming project.",
            "sent5": "The artist's painting was the sole masterpiece in the gallery."
        },
        {
            "definition": "To put a new sole on a shoe.",
            "pos": "verb",
            "sent1": "He needed to sole his favorite pair of boots before the hiking trip.",
            "sent2": "She learned how to sole shoes from her grandmother, who was a cobbler.",
            "sent3": "The cobbler promised to sole his worn-out shoes in time for the wedding.",
            "sent4": "After years of use, it was time to sole his trusty old sneakers.",
            "sent5": "The shoemaker carefully measured the foot to sole the shoe perfectly."
        }
    ]
}