{
    "term": "soles",
    "meanings": [
        {
            "definition": "The underside of a person's foot.",
            "pos": "noun",
            "sent1": "She felt the sand between her toes and the rough texture of her soles.",
            "sent2": "He always made sure to wear comfortable shoes that supported his soles during long walks.",
            "sent3": "As she walked on the hot pavement, she wished she had tiny fans under her soles to keep them cool.",
            "sent4": "His soles were like the foundation of a building, providing stability and balance to his entire body.",
            "sent5": "The reflexologist applied pressure to specific points on her soles to promote relaxation and well-being."
        },
        {
            "definition": "The bottom part of a shoe or boot.",
            "pos": "noun",
            "sent1": "The soles of his sneakers were worn out from all the running he did.",
            "sent2": "She carefully inspected the soles of the new boots to ensure they were sturdy and durable.",
            "sent3": "He joked that the soles of his shoes were so thick, he could walk on hot coals without feeling a thing.",
            "sent4": "The soles of the hiking boots gripped the rocky terrain like a mountain goat's hooves.",
            "sent5": "The cobbler expertly replaced the worn-out soles of the old shoes, making them look brand new again."
        },
        {
            "definition": "The flatfish of the family Soleidae.",
            "pos": "noun",
            "sent1": "The chef prepared a delicious dish using fresh soles caught that morning.",
            "sent2": "The market had a special on soles, so she decided to try cooking them for dinner.",
            "sent3": "The soles on his plate were cooked to perfection, flaky and flavorful.",
            "sent4": "The soles swam gracefully in the aquarium, their flat bodies blending in with the sandy bottom.",
            "sent5": "She marveled at the intricate patterns on the soles' scales, shimmering in the sunlight."
        }
    ]
}