{
    "term": "solenoids",
    "meanings": [
        {
            "definition": "A coil of wire that acts as an electromagnet when carrying an electric current.",
            "pos": "noun",
            "sent1": "The solenoids in the doorbell create a magnetic field when the electricity flows through them.",
            "sent2": "The solenoids in the car's starter motor help in starting the engine.",
            "sent3": "The solenoids in the robot's arm were so strong, they accidentally attracted all the metal objects in the room.",
            "sent4": "Her voice was like solenoids, pulling everyone's attention towards her.",
            "sent5": "The solenoids in the MRI machine made a loud clicking sound as they activated."
        },
        {
            "definition": "A type of valve that is actuated by a solenoid.",
            "pos": "noun",
            "sent1": "The solenoids control the flow of water in the irrigation system.",
            "sent2": "The solenoids in the sprinkler system open and close to water the garden.",
            "sent3": "The solenoids in the water fountain valve decided to take a break and stopped working.",
            "sent4": "Her laughter burst out like solenoids, spreading joy all around.",
            "sent5": "The solenoids in the vending machine clicked as they dispensed the snacks."
        },
        {
            "definition": "A type of electrical device used to convert electrical energy into mechanical motion.",
            "pos": "noun",
            "sent1": "The solenoids in the electric lock move the bolt when activated.",
            "sent2": "The solenoids in the pinball machine control the movement of the flippers.",
            "sent3": "The solenoids in the toy robot danced around the room, entertaining everyone.",
            "sent4": "His words acted like solenoids, pushing her to take action.",
            "sent5": "The solenoids in the automatic door pushed it open smoothly as people approached."
        }
    ]
}