{
    "term": "solicitously",
    "meanings": [
        {
            "definition": "In a manner showing concern or care for someone's well-being.",
            "pos": "adverb",
            "sent1": "She looked solicitously at her sick friend, offering to bring soup and medicine.",
            "sent2": "The nurse checked on the patient solicitously, making sure he was comfortable.",
            "sent3": "The dog wagged its tail solicitously, hoping for a treat.",
            "sent4": "The sun shone solicitously through the clouds, warming the chilly day.",
            "sent5": "The teacher smiled solicitously at the worried student, reassuring him before the test."
        },
        {
            "definition": "In a manner showing eagerness or readiness to help or serve.",
            "pos": "adverb",
            "sent1": "He eagerly and solicitously offered to carry her heavy bags up the stairs.",
            "sent2": "The waiter solicitously refilled our water glasses without being asked.",
            "sent3": "The child solicitously helped her grandmother with the crossword puzzle.",
            "sent4": "The volunteer group worked solicitously to clean up the park after the event.",
            "sent5": "The firefighter acted solicitously, rushing into the burning building to save the trapped cat."
        },
        {
            "definition": "In a manner showing attentiveness or consideration towards someone's needs.",
            "pos": "adverb",
            "sent1": "She listened solicitously to her friend's problems, offering support and advice.",
            "sent2": "The butler solicitously attended to the guests, ensuring their every need was met.",
            "sent3": "The robot solicitously followed its programming, always ready to assist.",
            "sent4": "The gardener worked solicitously, tending to each plant with care and precision.",
            "sent5": "The customer service representative spoke solicitously, trying to resolve the issue to the customer's satisfaction."
        }
    ]
}