{
    "term": "solicitudes",
    "meanings": [
        {
            "definition": "The state of being concerned or anxious",
            "pos": "noun",
            "sent1": "Her solicitudes about the upcoming test kept her awake at night.",
            "sent2": "His constant solicitudes for his family's well-being showed his caring nature.",
            "sent3": "The cat's solicitudes about the new puppy in the house were evident in its cautious approach.",
            "sent4": "The dark clouds looming overhead created a sense of solicitudes in the minds of the picnic-goers.",
            "sent5": "The teacher's solicitudes for her students' success were reflected in her extra tutoring sessions."
        },
        {
            "definition": "A formal request for something",
            "pos": "noun",
            "sent1": "She submitted her solicitudes for a day off to attend her sister's wedding.",
            "sent2": "The company received many solicitudes for sponsorship of the charity event.",
            "sent3": "His solicitudes for a raise were met with a smile from the boss.",
            "sent4": "The flowers in the garden seemed to whisper their solicitudes for more sunlight.",
            "sent5": "The child's written solicitudes for a new toy were neatly penned on a piece of paper."
        },
        {
            "definition": "The act of soliciting or seeking something",
            "pos": "noun",
            "sent1": "The solicitudes of the salesperson led to a successful deal.",
            "sent2": "His constant solicitudes for feedback showed his dedication to improvement.",
            "sent3": "The detective's solicitudes for clues were finally rewarded with a breakthrough.",
            "sent4": "The bird's chirping in the morning seemed like nature's solicitudes for a new day.",
            "sent5": "The explorer's solicitudes for hidden treasures drove him to venture into uncharted territories."
        }
    ]
}