{
    "term": "solidarism",
    "meanings": [
        {
            "definition": "Solidarism: a social organization or system based on the principles of solidarity and mutual support",
            "pos": "noun",
            "sent1": "In the community center, they practiced solidarism by helping each other with groceries and chores.",
            "sent2": "The success of the project relied on solidarism among team members who supported each other throughout.",
            "sent3": "At the charity event, the competition for the best cake showcased a fun form of solidarism.",
            "sent4": "The roots of solidarism run deep in our society, connecting us like intertwined branches of a tree.",
            "sent5": "Solidarism is like a sturdy bridge that unites people in times of need, providing strength and support."
        },
        {
            "definition": "Solidarism: the belief in the importance of unity and cooperation among individuals or groups",
            "pos": "noun",
            "sent1": "Solidarism emphasizes the value of working together towards common goals for the greater good.",
            "sent2": "In times of crisis, the community showed remarkable solidarism, standing united to overcome challenges.",
            "sent3": "The school play highlighted the theme of solidarism through the students' collaborative efforts.",
            "sent4": "The spirit of solidarism is like a warm embrace, bringing people closer in times of difficulty.",
            "sent5": "Solidarism is the glue that binds us together, creating a strong bond of support and togetherness."
        },
        {
            "definition": "Solidarism: a political theory advocating for collective action and shared responsibility",
            "pos": "noun",
            "sent1": "The party's platform was built on the principles of solidarism, promoting unity and shared duties.",
            "sent2": "Solidarism in governance ensures that decisions are made collectively for the benefit of all citizens.",
            "sent3": "The debate on solidarism in parliament sparked interesting discussions among lawmakers.",
            "sent4": "Solidarism is the cornerstone of a society where everyone plays a part in shaping the future.",
            "sent5": "In the realm of politics, solidarism acts as a guiding light, illuminating the path towards cooperation and accountability."
        }
    ]
}