{
    "term": "somatization",
    "meanings": [
        {
            "definition": "The manifestation of psychological distress through physical symptoms.",
            "pos": "noun",
            "sent1": "Her somatization of stress often resulted in headaches and stomachaches.",
            "sent2": "The doctor diagnosed her somatization as a way of coping with anxiety.",
            "sent3": "When she felt overwhelmed, her somatization made her body ache in strange places.",
            "sent4": "His somatization of fear was like a storm brewing inside him, ready to burst.",
            "sent5": "The somatization of her worries painted a vivid picture of her inner turmoil."
        },
        {
            "definition": "The conversion of mental experiences into physical symptoms.",
            "pos": "noun",
            "sent1": "His somatization of fear often led to unexplained pains and discomfort.",
            "sent2": "The therapist explained how somatization can be a way for the mind to express hidden emotions.",
            "sent3": "Her somatization of embarrassment made her cheeks turn bright red.",
            "sent4": "The somatization of his memories felt like a heavy weight on his chest.",
            "sent5": "The somatization of his guilt was like a shadow following him everywhere."
        },
        {
            "definition": "The process of experiencing emotional or psychological distress in the form of physical symptoms.",
            "pos": "noun",
            "sent1": "The somatization of her anxiety often made her heart race and palms sweat.",
            "sent2": "Understanding somatization helped her recognize the connection between her mind and body.",
            "sent3": "His somatization of sadness made him feel physically drained and exhausted.",
            "sent4": "The somatization of his anger was like a volcano ready to erupt.",
            "sent5": "Her somatization of loneliness created a heavy burden on her shoulders."
        }
    ]
}