{
    "term": "somatic",
    "meanings": [
        {
            "definition": "of or relating to the body",
            "pos": "adjective",
            "sent1": "The somatic pain in my arm was sharp.",
            "sent2": "Regular exercise is important for somatic health.",
            "sent3": "I felt somatic after eating too much cake.",
            "sent4": "The somatic weight of the world seemed heavy on his shoulders.",
            "sent5": "The somatic sensation of the warm sun on my skin was comforting."
        },
        {
            "definition": "pertaining to the physical body",
            "pos": "adjective",
            "sent1": "She had a somatic injury from the fall.",
            "sent2": "Proper nutrition is essential for somatic well-being.",
            "sent3": "The somatic workout left me feeling energized.",
            "sent4": "The somatic demands of the job were strenuous.",
            "sent5": "The somatic presence of the mountain was awe-inspiring."
        },
        {
            "definition": "relating to the soma or body",
            "pos": "adjective",
            "sent1": "The somatic functions of the body are complex.",
            "sent2": "Massage therapy can help with somatic relaxation.",
            "sent3": "The somatic response to the music was unexpected.",
            "sent4": "His somatic movements were graceful and fluid.",
            "sent5": "The somatic connection between mind and body is important for overall health."
        },
        {
            "definition": "affecting the body, especially as distinguished from the mind or spirit",
            "pos": "adjective",
            "sent1": "The somatic symptoms of the flu were exhausting.",
            "sent2": "Stress can have somatic effects on the body.",
            "sent3": "His somatic reaction to the scary movie was exaggerated.",
            "sent4": "The somatic impact of the accident was severe.",
            "sent5": "The somatic experience of running a marathon was both challenging and rewarding."
        }
    ]
}