{
    "term": "soma",
    "meanings": [
        {
            "definition": "The body as distinct from the soul or mind.",
            "pos": "noun",
            "sent1": "Her soma felt tired after a long day of work.",
            "sent2": "Exercise is important for maintaining a healthy soma.",
            "sent3": "Carrying heavy bags made her soma ache.",
            "sent4": "His strong soma carried him through the marathon.",
            "sent5": "The dancer's graceful movements showcased her agile soma."
        },
        {
            "definition": "A plant or mushroom used in religious or spiritual rituals.",
            "pos": "noun",
            "sent1": "The tribe used a special soma in their ceremony.",
            "sent2": "The shaman prepared the sacred soma for the ritual.",
            "sent3": "The aroma of the burning soma filled the temple.",
            "sent4": "The mystical properties of the soma connected the worshippers.",
            "sent5": "Inhaling the aroma of the soma brought a sense of peace."
        },
        {
            "definition": "A type of cell in the body that produces antibodies.",
            "pos": "noun",
            "sent1": "The soma fought off the infection by producing antibodies.",
            "sent2": "The doctor explained how important somas are for our immune system.",
            "sent3": "The tiny soma worked hard to protect the body.",
            "sent4": "The soma's antibodies acted like soldiers defending the body.",
            "sent5": "Each soma plays a crucial role in keeping us healthy."
        },
        {
            "definition": "A drug or medication that induces sleep or relaxation.",
            "pos": "noun",
            "sent1": "She took a soma to help her relax before bed.",
            "sent2": "The doctor prescribed a soma for his insomnia.",
            "sent3": "The soma helped him drift into a peaceful sleep.",
            "sent4": "The effects of the soma slowly lulled her into relaxation.",
            "sent5": "After a stressful day, the soma provided much-needed rest."
        }
    ]
}