{
    "term": "somnambulant",
    "meanings": [
        {
            "definition": "Walking or moving while asleep or in a sleep-like state.",
            "pos": "verb",
            "sent1": "Last night, I somnambulated around the house, unaware of my actions.",
            "sent2": "The child somnambulantly wandered through the dark room, guided by an unseen force.",
            "sent3": "The somnambulant sleeper ended up in the kitchen, mistaking the fridge for a bed.",
            "sent4": "In his dream, he somnambulated through a forest of towering trees, searching for a hidden treasure.",
            "sent5": "The somnambulant figure moved gracefully, as if dancing in a trance."
        },
        {
            "definition": "Characterized by or pertaining to sleepwalking.",
            "pos": "adjective",
            "sent1": "The somnambulant girl roamed the halls at night, her eyes closed in deep slumber.",
            "sent2": "The somnambulant patient was carefully monitored to prevent any nighttime accidents.",
            "sent3": "The somnambulant cat startled its owner by climbing the stairs while fast asleep.",
            "sent4": "The somnambulant clouds drifted lazily across the moonlit sky, painting a serene picture.",
            "sent5": "His somnambulant state made him appear as if he was under a mysterious spell."
        },
        {
            "definition": "In a state of sleepwalking.",
            "pos": "adjective",
            "sent1": "The somnambulant man moved silently through the house, his eyes shut tight.",
            "sent2": "She woke up feeling somnambulant, unsure if her nighttime adventure was real.",
            "sent3": "The somnambulant dog chased imaginary squirrels in its dream-filled state.",
            "sent4": "The somnambulant moon cast a ghostly glow over the sleeping town.",
            "sent5": "The somnambulant atmosphere of the room gave it an eerie, otherworldly feel."
        }
    ]
}