{
    "term": "sopranos",
    "meanings": [
        {
            "definition": "A female singer with a high voice range.",
            "pos": "noun",
            "sent1": "The sopranos in the choir hit the high notes beautifully.",
            "sent2": "She dreams of becoming a famous soprano one day.",
            "sent3": "The sopranos giggled backstage before their performance.",
            "sent4": "Her soprano voice soared like a bird in the sky.",
            "sent5": "The soprano's voice was as clear as a bell, captivating the audience."
        },
        {
            "definition": "The highest singing voice in a choir.",
            "pos": "noun",
            "sent1": "The sopranos' voices blended harmoniously in the choir.",
            "sent2": "The sopranos' part is crucial for the choir's melody.",
            "sent3": "The sopranos' high notes echoed through the concert hall.",
            "sent4": "Her soprano voice cut through the air like a sharp knife.",
            "sent5": "The sopranos' singing was like a ray of sunshine on a cloudy day."
        },
        {
            "definition": "The highest part in a musical composition.",
            "pos": "noun",
            "sent1": "The sopranos' part in the song was challenging but rewarding.",
            "sent2": "The sopranos' section stood out in the musical performance.",
            "sent3": "The sopranos' notes danced playfully above the other voices.",
            "sent4": "Her soprano part added a touch of magic to the music.",
            "sent5": "The sopranos' melody floated like a feather in the wind."
        },
        {
            "definition": "A type of pasta.",
            "pos": "noun",
            "sent1": "She cooked a delicious dish of sopranos for dinner.",
            "sent2": "The sopranos pasta was served with a creamy sauce.",
            "sent3": "The sopranos pasta twirled elegantly on her fork.",
            "sent4": "The sopranos pasta looked like little seashells on the plate.",
            "sent5": "The sopranos pasta was a delightful surprise at the dinner table."
        }
    ]
}