{
    "term": "soree",
    "meanings": [
        {
            "definition": "Feeling or expressing sorrow or regret.",
            "pos": "adjective",
            "sent1": "She had a soree look on her face after losing the game.",
            "sent2": "The girl's soree expression showed she was sad about the situation.",
            "sent3": "Even the clown's colorful outfit couldn't hide his soree mood.",
            "sent4": "The sunset painted the sky in a soree hue, reflecting the girl's emotions.",
            "sent5": "The music had a soree melody that touched everyone's hearts."
        },
        {
            "definition": "A feeling of distress, affliction, or pain.",
            "pos": "noun",
            "sent1": "His soree from the injury made it hard for him to walk.",
            "sent2": "The patient winced in soree as the nurse changed the bandage.",
            "sent3": "The soree in his heart was deeper than any physical pain.",
            "sent4": "The city's abandoned buildings were a soree reminder of its past.",
            "sent5": "The old man's eyes held a soree that spoke of a lifetime of experiences."
        },
        {
            "definition": "To feel or express sorrow or regret.",
            "pos": "verb",
            "sent1": "She soree for not attending her friend's birthday party.",
            "sent2": "He soree his mistake and apologized immediately.",
            "sent3": "The puppy's sad eyes made her soree for leaving him alone.",
            "sent4": "The artist soree every stroke that didn't capture the essence of the scene.",
            "sent5": "The singer's voice soree the emotions of the audience, bringing tears to their eyes."
        },
        {
            "definition": "To cause distress, affliction, or pain.",
            "pos": "verb",
            "sent1": "The loud noise soree her ears and made her cover them.",
            "sent2": "The harsh words soree his heart, leaving him feeling broken.",
            "sent3": "The storm soree damage to the crops, affecting the whole village.",
            "sent4": "The betrayal soree a rift between the two friends that could not be repaired.",
            "sent5": "The loss of the championship soree disappointment among the team members."
        }
    ]
}