{
    "term": "sore",
    "meanings": [
        {
            "definition": "Causing physical pain or discomfort",
            "pos": "adjective",
            "sent1": "Her sore knee made it hard to walk.",
            "sent2": "The sore tooth needed to be checked by the dentist.",
            "sent3": "After the long hike, his sore muscles felt like jelly.",
            "sent4": "The sore truth was hard to accept.",
            "sent5": "The sore spot on the skin turned red and swollen."
        },
        {
            "definition": "Painful to the touch",
            "pos": "adjective",
            "sent1": "The sore bruise hurt when she touched it.",
            "sent2": "The sore spot on the table had a rough texture.",
            "sent3": "The sore area on the arm felt like a tiny mountain.",
            "sent4": "The sore point on the map marked the hidden treasure.",
            "sent5": "The sore skin stung when exposed to sunlight."
        },
        {
            "definition": "Feeling pain or discomfort",
            "pos": "adjective",
            "sent1": "He winced in pain from the sore back.",
            "sent2": "The sore throat made it hard to swallow.",
            "sent3": "Her sore feet begged for a break from the high heels.",
            "sent4": "The sore heart longed for comfort and peace.",
            "sent5": "The sore eyes blinked in the bright light."
        },
        {
            "definition": "Severe or intense",
            "pos": "adjective",
            "sent1": "The sore loss of a loved one left a deep void.",
            "sent2": "The sore disappointment weighed heavily on her mind.",
            "sent3": "The sore hunger gnawed at his stomach all day.",
            "sent4": "The sore anger boiled inside him, ready to explode.",
            "sent5": "The sore fear gripped her heart with icy fingers."
        },
        {
            "definition": "Wounded or injured",
            "pos": "adjective",
            "sent1": "The sore soldier bravely continued to fight.",
            "sent2": "The sore paw of the cat needed immediate attention.",
            "sent3": "The sore bird limped away after the fall.",
            "sent4": "The sore tree branch hung low after the storm.",
            "sent5": "The sore knee throbbed with each step."
        }
    ]
}