{
    "term": "sorn",
    "meanings": [
        {
            "definition": "To obtain food, lodging, or other necessities without paying for them.",
            "pos": "verb",
            "sent1": "He decided to sorn a meal from his friend when he ran out of money.",
            "sent2": "The traveler had to sorn a place to stay for the night when his hotel reservation got canceled.",
            "sent3": "Feeling lazy, he tried to sorn a snack from his sister's pantry.",
            "sent4": "The cat managed to sorn some extra treats from the unsuspecting owner.",
            "sent5": "She always finds a way to sorn a free ride to work when her car breaks down."
        },
        {
            "definition": "To live off someone else's generosity without permission.",
            "pos": "verb",
            "sent1": "He would often sorn off his roommate for meals without contributing.",
            "sent2": "The stray cat seemed to sorn off the neighbors for food every day.",
            "sent3": "Trying to sorn off his friend's goodwill, he asked for a loan he had no intention of repaying.",
            "sent4": "The lazy student tried to sorn off the teacher's sympathy to get an extension on the assignment.",
            "sent5": "She managed to sorn off her colleague's kindness to get a ride home after work."
        },
        {
            "definition": "To sponge or mooch off others.",
            "pos": "verb",
            "sent1": "He always tries to sorn off his friends for drinks at the bar.",
            "sent2": "The relative would often sorn off the family during holidays, never bringing anything.",
            "sent3": "She attempted to sorn off her coworker's lunch by pretending she forgot hers.",
            "sent4": "The clever fox managed to sorn off the farmer's chickens without being caught.",
            "sent5": "He would sorn off his girlfriend's kindness by borrowing money and never returning it."
        }
    ]
}