{
    "term": "sortilege",
    "meanings": [
        {
            "definition": "The practice of foretelling the future by casting lots or using other forms of divination.",
            "pos": "noun",
            "sent1": "In ancient times, people would often turn to sortilege to learn about what the future held.",
            "sent2": "She consulted a book of sortilege to seek guidance on her upcoming decisions.",
            "sent3": "The town's sortilege expert was always busy, predicting the weather and other events.",
            "sent4": "Her grandmother's sortilege seemed to always be accurate, like a magical crystal ball.",
            "sent5": "The sortilege ceremony was filled with mystery and anticipation, as everyone waited for the outcome."
        },
        {
            "definition": "A spell or charm believed to have magical power.",
            "pos": "noun",
            "sent1": "The sorcerer crafted a powerful sortilege to protect the village from harm.",
            "sent2": "Legends spoke of a sortilege that could grant wishes to those who possessed it.",
            "sent3": "The mischievous fairy left a trail of sortilege behind her, causing chaos wherever she went.",
            "sent4": "The sortilege glowed with an otherworldly light, enchanting all who gazed upon it.",
            "sent5": "The sortilege's magic was so potent that even the strongest warriors were in awe of its power."
        },
        {
            "definition": "The act of using supernatural means to influence or predict events.",
            "pos": "noun",
            "sent1": "The sorceress was accused of practicing sortilege to manipulate the outcome of battles.",
            "sent2": "Some believed that the king's rise to power was due to sortilege rather than his own abilities.",
            "sent3": "The magician's failed sortilege attempt resulted in a comical mix-up at the royal banquet.",
            "sent4": "Sortilege was like a hidden force guiding the destinies of those who dared to dabble in its mysteries.",
            "sent5": "The village elders warned against the dangers of sortilege, fearing its unpredictable consequences."
        }
    ]
}