{
    "term": "souled",
    "meanings": [
        {
            "definition": "Possessing a soul",
            "pos": "adjective",
            "sent1": "The kind man had a souled dog that he loved dearly.",
            "sent2": "The old tree in the forest seemed souled, as if it had stories to tell.",
            "sent3": "The souled cat purred happily in the sun, enjoying the warmth.",
            "sent4": "The souled painting seemed to gaze back at the viewers with a mysterious depth.",
            "sent5": "The souled music touched the hearts of all who listened, bringing tears to their eyes."
        },
        {
            "definition": "Having a particular type of soul",
            "pos": "adjective",
            "sent1": "The ancient book contained souled wisdom passed down through generations.",
            "sent2": "The artist's souled creations reflected her unique perspective on life.",
            "sent3": "The souled gemstone sparkled in the sunlight, revealing its hidden beauty.",
            "sent4": "The souled melody resonated with listeners, evoking memories of a distant past.",
            "sent5": "The souled landscape painting captured the essence of a serene countryside."
        },
        {
            "definition": "Infused with a soul",
            "pos": "adjective",
            "sent1": "The handmade doll looked souled, as if it had a personality of its own.",
            "sent2": "The souled statue seemed to come alive in the moonlight, casting eerie shadows.",
            "sent3": "The souled puppet danced on the stage, entertaining the audience with its antics.",
            "sent4": "The souled mask worn by the actor transformed his performance into a mesmerizing experience.",
            "sent5": "The souled sculpture seemed to breathe with life, its eyes full of emotion."
        },
        {
            "definition": "Having a soul or souls",
            "pos": "adjective",
            "sent1": "The ancient ruins felt souled, as if echoing the voices of the past.",
            "sent2": "The souled forest whispered secrets to those who dared to listen.",
            "sent3": "The souled ocean waves danced under the moonlight, shimmering with silver hues.",
            "sent4": "The souled night sky twinkled with stars, each one a soulful light in the darkness.",
            "sent5": "The souled wind carried whispers of forgotten tales, stirring the leaves in its wake."
        }
    ]
}