{
    "term": "sov",
    "meanings": [
        {
            "definition": "Sovereign: a supreme ruler or leader",
            "pos": "noun",
            "sent1": "The wise old king was the sov of the land.",
            "sent2": "The sov made important decisions for the kingdom.",
            "sent3": "The sov's crown was too big for his head, making him look comical.",
            "sent4": "She ruled her household with the grace and authority of a sov.",
            "sent5": "The sov's presence commanded respect from all who met him."
        },
        {
            "definition": "Sovereignty: supreme power or authority",
            "pos": "noun",
            "sent1": "The country's sov was respected by all its citizens.",
            "sent2": "The sov of the nation ensured peace and order.",
            "sent3": "The sov's power extended even to the smallest villages.",
            "sent4": "Her sov over the company was unquestioned.",
            "sent5": "The sov's decisions shaped the fate of the entire realm."
        },
        {
            "definition": "Soviet: relating to the former Soviet Union or its people",
            "pos": "adjective",
            "sent1": "The museum displayed sov artifacts from the Soviet era.",
            "sent2": "The sov flag represented the unity of the Soviet people.",
            "sent3": "The sov music brought back memories of the old days.",
            "sent4": "Her sov accent hinted at her Soviet heritage.",
            "sent5": "The sov culture was rich in history and tradition."
        },
        {
            "definition": "Sovereign: possessing supreme power or authority",
            "pos": "adjective",
            "sent1": "The sov ruler was feared by all who opposed him.",
            "sent2": "The sov nation stood strong against its enemies.",
            "sent3": "The sov cat ruled the neighborhood with an iron paw.",
            "sent4": "Her sov control over the situation was evident to all.",
            "sent5": "The sov leader's charisma inspired loyalty in his followers."
        }
    ]
}