{
    "term": "soyas",
    "meanings": [
        {
            "definition": "A type of bean used in cooking.",
            "pos": "noun",
            "sent1": "I added some soyas to the stir-fry for extra flavor.",
            "sent2": "The recipe called for soyas as one of the main ingredients.",
            "sent3": "The mischievous chef swapped the green beans for soyas in the dish.",
            "sent4": "Her love for soyas was as strong as the roots of a mighty oak tree.",
            "sent5": "The aroma of the simmering soyas filled the kitchen with warmth and comfort."
        },
        {
            "definition": "A plant of the pea family, native to East Asia.",
            "pos": "noun",
            "sent1": "The farmer cultivated soyas in the fertile soil of the valley.",
            "sent2": "Soyas are known for their ability to enrich the soil they grow in.",
            "sent3": "The soyas in the garden waved gently in the breeze, as if greeting visitors.",
            "sent4": "The field of soyas stretched out like a green carpet under the blue sky.",
            "sent5": "The delicate flowers of the soyas added a touch of beauty to the landscape."
        },
        {
            "definition": "A sauce made from fermented soybeans.",
            "pos": "noun",
            "sent1": "The chef drizzled soyas over the sushi for a burst of umami flavor.",
            "sent2": "The soyas added a savory kick to the marinade for the grilled chicken.",
            "sent3": "The mischievous cat licked up the spilled soyas from the kitchen floor.",
            "sent4": "The soyas flowed like a river of flavor over the steaming dumplings.",
            "sent5": "The rich aroma of soyas filled the room, making mouths water in anticipation."
        },
        {
            "definition": "A protein-rich food made from soybeans.",
            "pos": "noun",
            "sent1": "She enjoyed a hearty meal of soyas and vegetables for dinner.",
            "sent2": "Soyas are a popular meat alternative for those following a vegetarian diet.",
            "sent3": "The mischievous squirrel stole a few soyas from the picnic basket.",
            "sent4": "The soyas provided a strong foundation of nutrients for her active lifestyle.",
            "sent5": "The creamy texture of the soyas melted in her mouth, satisfying her hunger."
        }
    ]
}