{
    "term": "spacewalker",
    "meanings": [
        {
            "definition": "A person who walks in space outside a spacecraft.",
            "pos": "noun",
            "sent1": "The brave spacewalker floated gracefully in the vast emptiness of space.",
            "sent2": "The spacewalker completed repairs on the satellite during the spacewalk.",
            "sent3": "The spacewalker tried to do a somersault in space but ended up spinning uncontrollably.",
            "sent4": "The spacewalker was like a tiny dot against the backdrop of the endless universe.",
            "sent5": "The spacewalker's suit shimmered in the sunlight as they moved through the darkness of space."
        },
        {
            "definition": "A person who performs a spacewalk.",
            "pos": "noun",
            "sent1": "The skilled spacewalker carefully checked their equipment before stepping out into space.",
            "sent2": "The spacewalker's training prepared them for the challenges of a spacewalk.",
            "sent3": "The spacewalker joked that they were taking a stroll in the ultimate park - outer space.",
            "sent4": "The spacewalker's movements were as graceful as a dancer in zero gravity.",
            "sent5": "The spacewalker's heart raced with excitement as they ventured outside the spacecraft."
        },
        {
            "definition": "The act of walking in space outside a spacecraft.",
            "pos": "noun",
            "sent1": "The spacewalker's tether kept them connected to the spacecraft during the spacewalk.",
            "sent2": "The spacewalker's footsteps left imprints on the surface of the space station.",
            "sent3": "The spacewalker pretended to be a cosmic explorer on a mission to find space treasures.",
            "sent4": "The spacewalker's journey outside the spacecraft was a dance in the infinite cosmic ballet.",
            "sent5": "The spacewalker's adventure in space felt like a dream come true."
        }
    ]
}