{
    "term": "spacesuits",
    "meanings": [
        {
            "definition": "A garment designed to protect astronauts from the harsh conditions of outer space.",
            "pos": "noun",
            "sent1": "The spacesuits kept the astronauts safe during their spacewalk.",
            "sent2": "The astronauts put on their spacesuits before venturing into space.",
            "sent3": "The spacesuits were so puffy, the astronauts looked like marshmallows floating in space.",
            "sent4": "In the vast emptiness of space, the spacesuits were the only barrier between life and the void.",
            "sent5": "The gleaming spacesuits shimmered under the bright sun, a symbol of human ingenuity."
        },
        {
            "definition": "The attire worn by individuals during spacewalks.",
            "pos": "noun",
            "sent1": "Before the spacewalk, the astronauts carefully checked their spacesuits.",
            "sent2": "During the spacewalk, the spacesuits provided vital protection.",
            "sent3": "The spacesuits made the astronauts look like futuristic superheroes floating in space.",
            "sent4": "As they floated in their spacesuits, the astronauts resembled graceful dancers in zero gravity.",
            "sent5": "The spacesuits clung tightly to the astronauts, a second skin in the vast expanse of space."
        },
        {
            "definition": "Protective clothing worn by astronauts during space missions.",
            "pos": "noun",
            "sent1": "The spacesuits shielded the astronauts from the dangers of space.",
            "sent2": "In the spacecraft, the spacesuits hung ready for the upcoming mission.",
            "sent3": "The spacesuits made the astronauts look like futuristic explorers on a cosmic journey.",
            "sent4": "As they floated in their spacesuits, the astronauts were like shining beacons in the darkness of space.",
            "sent5": "The spacesuits were a vital lifeline for the astronauts, ensuring their safety in the unknown."
        }
    ]
}