{
    "term": "spacey",
    "meanings": [
        {
            "definition": "Distracted or absent-minded.",
            "pos": "adjective",
            "sent1": "She seemed a bit spacey during the meeting, forgetting what she was supposed to say.",
            "sent2": "He often appears spacey, losing track of time and forgetting appointments.",
            "sent3": "The spacey professor accidentally walked into the wrong classroom, thinking it was his office.",
            "sent4": "Her mind felt like a spacey maze, full of twists and turns that led nowhere.",
            "sent5": "The spacey student kept staring out the window, completely unaware of the lesson."
        },
        {
            "definition": "Resembling or characteristic of outer space.",
            "pos": "adjective",
            "sent1": "The new sci-fi movie had amazing spacey visuals, making viewers feel like they were in space.",
            "sent2": "The astronaut's suit had a spacey design with shiny silver material and glowing lights.",
            "sent3": "The spacey theme park ride simulated a journey through the galaxy, complete with stars and planets.",
            "sent4": "Her eyes sparkled with a spacey glow, as if reflecting the vastness of the universe.",
            "sent5": "The room was decorated with spacey posters of planets and rockets, creating a cosmic atmosphere."
        },
        {
            "definition": "Having a dreamy or disoriented quality.",
            "pos": "adjective",
            "sent1": "The spacey music played softly in the background, creating a relaxing and dreamy atmosphere.",
            "sent2": "After spinning around in circles, she felt a bit spacey and dizzy.",
            "sent3": "The spacey painting seemed to shift and change colors as you looked at it, like a dream.",
            "sent4": "Her thoughts floated in a spacey haze, unable to focus on any one thing.",
            "sent5": "The spacey mist enveloped the forest, giving it an otherworldly and mysterious feel."
        }
    ]
}