{
    "term": "spams",
    "meanings": [
        {
            "definition": "Unsolicited emails",
            "pos": "noun",
            "sent1": "My inbox is full of spams every morning.",
            "sent2": "I hate it when my email gets spams from unknown senders.",
            "sent3": "The spams offering me a free cruise were too good to be true.",
            "sent4": "Her inbox was a jungle of spams, each one more annoying than the last.",
            "sent5": "The spams flooded his email like a never-ending stream of junk."
        },
        {
            "definition": "To send unsolicited emails",
            "pos": "verb",
            "sent1": "He spams his friends with chain emails all the time.",
            "sent2": "It is not polite to spam people with unnecessary messages.",
            "sent3": "She jokingly threatened to spam her brother's inbox with cat videos.",
            "sent4": "The company decided to spam their customers with promotional emails.",
            "sent5": "The automated system accidentally spams customers with duplicate messages."
        },
        {
            "definition": "Canned meat",
            "pos": "noun",
            "sent1": "I always keep a few cans of spams in my pantry for quick meals.",
            "sent2": "The soldiers carried spams in their backpacks for emergencies.",
            "sent3": "The chef created a unique dish using spams as the main ingredient.",
            "sent4": "The camping trip menu included spams for a simple and tasty meal.",
            "sent5": "She made a delicious sandwich with spams and cheese for lunch."
        },
        {
            "definition": "To bombard with unsolicited messages",
            "pos": "verb",
            "sent1": "The telemarketers spams people with calls during dinner time.",
            "sent2": "The company decided to spam social media with their new product.",
            "sent3": "The prankster thought it would be funny to spam his friend's phone with texts.",
            "sent4": "The group chat was spammed with memes and jokes all night.",
            "sent5": "The marketing team planned to spam the target audience with advertisements."
        }
    ]
}