{
    "term": "span",
    "meanings": [
        {
            "definition": "The full extent or reach of something.",
            "pos": "noun",
            "sent1": "The span of the bridge was impressive.",
            "sent2": "She measured the span of the room with a tape measure.",
            "sent3": "The cat tried to jump the entire span of the table in one leap.",
            "sent4": "His influence had a span that reached far beyond the borders of the country.",
            "sent5": "The span of the desert seemed endless under the scorching sun."
        },
        {
            "definition": "The distance between two points.",
            "pos": "noun",
            "sent1": "The span between the trees was just wide enough for the car to pass through.",
            "sent2": "He estimated the span of the river before attempting to swim across.",
            "sent3": "The span between the houses was so short that they could easily pass messages through the windows.",
            "sent4": "The emotional span between them seemed to grow wider with each passing day.",
            "sent5": "The span between the two mountains was vast and daunting."
        },
        {
            "definition": "To stretch across or over something.",
            "pos": "verb",
            "sent1": "She used a rope to span the gap between the two cliffs.",
            "sent2": "The bridge was designed to span the river below.",
            "sent3": "The spider tried to span the distance between the two branches with its web.",
            "sent4": "His love for music spanned his entire life.",
            "sent5": "Her voice could span the entire range of musical notes effortlessly."
        },
        {
            "definition": "To measure the distance between two points.",
            "pos": "verb",
            "sent1": "He needed to span the field to determine its size.",
            "sent2": "The surveyor spanned the area to create an accurate map.",
            "sent3": "The explorer spanned the land to calculate the distance to the next village.",
            "sent4": "The ruler could span the length of the table with precision.",
            "sent5": "She carefully spanned the width of the room to ensure the furniture would fit."
        },
        {
            "definition": "A period of time.",
            "pos": "noun",
            "sent1": "The span of a minute can feel like an eternity in certain situations.",
            "sent2": "She waited for a span of ten minutes before the bus finally arrived.",
            "sent3": "The span of his attention was short, jumping from one topic to another quickly.",
            "sent4": "The span of their friendship lasted for decades.",
            "sent5": "The span of winter seemed to drag on endlessly, with no sign of spring in sight."
        }
    ]
}