{
    "term": "spane",
    "meanings": [
        {
            "definition": "To measure the distance between two points.",
            "pos": "verb",
            "sent1": "She used a ruler to spane the length of the table.",
            "sent2": "The tailor needed to spane the fabric before cutting it.",
            "sent3": "The curious cat tried to spane the gap between the two bookshelves.",
            "sent4": "His love for her seemed to spane the vast ocean between them.",
            "sent5": "The detective had to spane the footprints to solve the mystery."
        },
        {
            "definition": "A unit of length equal to nine inches.",
            "pos": "noun",
            "sent1": "The carpenter measured the board using a spane.",
            "sent2": "She bought a piece of fabric that was one spane long.",
            "sent3": "The chef mistakenly used a spane instead of a ruler to measure the ingredients.",
            "sent4": "The old map showed distances in spans rather than miles.",
            "sent5": "The tailor's spane was a cherished tool passed down through generations."
        },
        {
            "definition": "To extend across a distance.",
            "pos": "verb",
            "sent1": "The bridge will spane the river, connecting the two towns.",
            "sent2": "The rainbow seemed to spane the entire sky after the rain.",
            "sent3": "The vines will spane the garden fence if left unchecked.",
            "sent4": "Her kindness seemed to spane across the entire community.",
            "sent5": "The road will spane through the forest, providing a scenic drive."
        },
        {
            "definition": "A distance or extent between two points.",
            "pos": "noun",
            "sent1": "The spane between the two trees was perfect for the hammock.",
            "sent2": "He estimated the spane between the buildings to be around twenty meters.",
            "sent3": "The spane between the siblings' ages always caused playful arguments.",
            "sent4": "The emotional spane between them seemed to grow wider with each passing day.",
            "sent5": "The spane between the stars in the night sky fascinated the young astronomer."
        }
    ]
}