{
    "term": "sparking",
    "meanings": [
        {
            "definition": "To give off sparks.",
            "pos": "verb",
            "sent1": "The campfire was sparking brightly in the dark night.",
            "sent2": "The fireworks display was sparking in the sky, mesmerizing the crowd.",
            "sent3": "The metal grinder was sparking so much, it looked like a tiny disco party.",
            "sent4": "Her eyes were sparking with joy as she shared the good news.",
            "sent5": "The flint striking against the rock was sparking, creating tiny bursts of light."
        },
        {
            "definition": "To ignite or set off sparks.",
            "pos": "verb",
            "sent1": "He was sparking the lighter to start the barbecue.",
            "sent2": "The faulty wire was sparking dangerously, causing a fire hazard.",
            "sent3": "The magician's wand was sparking with magic, lighting up the stage.",
            "sent4": "Their argument was sparking heated emotions among the group.",
            "sent5": "The collision of the two cars was sparking flames, creating chaos on the road."
        },
        {
            "definition": "To create interest or excitement.",
            "pos": "verb",
            "sent1": "The new movie trailer was sparking curiosity among the audience.",
            "sent2": "The surprise announcement was sparking excitement in the room.",
            "sent3": "The unexpected plot twist was sparking laughter among the viewers.",
            "sent4": "Her engaging storytelling was sparking interest in the listeners.",
            "sent5": "The thrilling roller coaster ride was sparking screams of excitement."
        },
        {
            "definition": "To start a fire or flame.",
            "pos": "verb",
            "sent1": "The dry leaves were sparking a small fire in the forest.",
            "sent2": "The matchstick was sparking, ready to ignite the candle.",
            "sent3": "The chef was sparking the grill to prepare the barbecue.",
            "sent4": "The arsonist was sparking fires across the city.",
            "sent5": "The lightning strike was sparking wildfires in the dry fields."
        },
        {
            "definition": "To cause something to happen or develop.",
            "pos": "verb",
            "sent1": "His speech was sparking a revolution among the citizens.",
            "sent2": "The new invention was sparking interest in the scientific community.",
            "sent3": "The teacher's idea was sparking creativity in the students.",
            "sent4": "The economic downturn was sparking concerns among investors.",
            "sent5": "The discovery of the treasure map was sparking excitement among the adventurers."
        }
    ]
}