{
    "term": "spare",
    "meanings": [
        {
            "definition": "To refrain from harming or destroying",
            "pos": "verb",
            "sent1": "Please spare the flowers from being trampled.",
            "sent2": "He decided to spare the spider and gently placed it outside.",
            "sent3": "The kind gardener chose to spare the delicate petals from harm.",
            "sent4": "In the forest, the trees seemed to spare the small animals from the harsh winds.",
            "sent5": "The hero's choice to spare the villain's life showed true compassion."
        },
        {
            "definition": "Additional to what is required",
            "pos": "adjective",
            "sent1": "She brought a spare pencil just in case.",
            "sent2": "The spare key was hidden under the doormat.",
            "sent3": "Having a spare tire is always useful during a road trip.",
            "sent4": "The spare change in his pocket jingled as he walked.",
            "sent5": "An extra blanket was kept as a spare for unexpected guests."
        },
        {
            "definition": "To give up or part with",
            "pos": "verb",
            "sent1": "He had to spare some time for his family.",
            "sent2": "She decided to spare her old toys to make room for new ones.",
            "sent3": "The decision to spare the old car was a sentimental one.",
            "sent4": "They were willing to spare their favorite books for a good cause.",
            "sent5": "The teacher asked the students to spare a moment for reflection."
        },
        {
            "definition": "Not being used for a particular purpose",
            "pos": "adjective",
            "sent1": "The spare room in the house was used for storage.",
            "sent2": "He found a spare chair to accommodate the unexpected guest.",
            "sent3": "The spare computer was kept as a backup in case of emergencies.",
            "sent4": "She wore a spare pair of shoes for the outdoor event.",
            "sent5": "The spare change in his pocket was saved for a rainy day."
        },
        {
            "definition": "To treat with mercy or leniency",
            "pos": "verb",
            "sent1": "The judge decided to spare the young offender from a harsh sentence.",
            "sent2": "She chose to spare her friend's feelings by not mentioning the mistake.",
            "sent3": "The cat seemed to spare the mouse, playing instead of catching it.",
            "sent4": "He asked his boss to spare him from working overtime that weekend.",
            "sent5": "The teacher decided to spare the student from punishment after hearing the explanation."
        }
    ]
}