{
    "term": "sparing",
    "meanings": [
        {
            "definition": "Economical or frugal in the use or expenditure of something.",
            "pos": "adjective",
            "sent1": "She was very sparing with her allowance, saving most of it for a rainy day.",
            "sent2": "The family lived a sparing lifestyle, always looking for ways to save money.",
            "sent3": "The squirrel's sparing collection of acorns made the other animals wonder if it was planning a feast.",
            "sent4": "Her sparing use of paint on the canvas created a striking and minimalist artwork.",
            "sent5": "The sparing use of spices in the dish allowed the natural flavors to shine through."
        },
        {
            "definition": "Scanty or meager in amount or quantity.",
            "pos": "adjective",
            "sent1": "The old man had a sparing amount of food left in his pantry.",
            "sent2": "The plant struggled to grow in the sparing soil of the desert.",
            "sent3": "The sparing attendance at the event disappointed the organizers.",
            "sent4": "Her sparing collection of books surprised her friends who expected a full library.",
            "sent5": "The sparing rainfall in the region led to a drought and crop failure."
        },
        {
            "definition": "To refrain from harming or destroying; to show mercy or compassion.",
            "pos": "verb",
            "sent1": "He was sparing with his criticism, always trying to be kind in his feedback.",
            "sent2": "The knight spared the dragon, showing a rare act of sparing in the midst of battle.",
            "sent3": "The cat spared the mouse, deciding to play with it instead of catching it.",
            "sent4": "She spared the spider in the corner, feeling a sense of sparing towards all creatures.",
            "sent5": "The king's sparing of the prisoner's life brought hope to the kingdom."
        }
    ]
}