{
    "term": "sparker",
    "meanings": [
        {
            "definition": "A person or thing that sparks.",
            "pos": "noun",
            "sent1": "The sparker in the group always comes up with fun ideas.",
            "sent2": "The mechanic used a sparker to start the engine.",
            "sent3": "The birthday party was dull until the sparker suggested a game.",
            "sent4": "Her speech was a sparker that ignited a wave of inspiration in the audience.",
            "sent5": "The sparker's enthusiasm was contagious, spreading joy to everyone around."
        },
        {
            "definition": "A device used to ignite fuel.",
            "pos": "noun",
            "sent1": "The sparker in the lighter clicked, producing a flame.",
            "sent2": "The camping stove required a sparker to start cooking.",
            "sent3": "The sparker in the barbecue grill malfunctioned, causing a delay in dinner.",
            "sent4": "His words acted as a sparker, igniting a heated debate among the group.",
            "sent5": "With a quick press of the button, the sparker lit up the fireworks display."
        },
        {
            "definition": "A small particle that emits a spark.",
            "pos": "noun",
            "sent1": "The campfire crackled as each sparker flew into the night sky.",
            "sent2": "The sparker from the bonfire landed on his sleeve, causing a small burn.",
            "sent3": "The mischievous child collected sparker after sparker to create a mini light show.",
            "sent4": "The sparker danced in the darkness, illuminating the forest with its tiny glow.",
            "sent5": "The sparker landed on the dry leaves, setting off a chain reaction of sparks."
        },
        {
            "definition": "A person who initiates or incites something.",
            "pos": "noun",
            "sent1": "As the sparker of the protest, she rallied others to join the cause.",
            "sent2": "The sparker of the argument quickly regretted his harsh words.",
            "sent3": "The sparker of the food fight found himself covered in spaghetti.",
            "sent4": "Her bold statement acted as a sparker, leading to a series of important discussions.",
            "sent5": "The sparker of the idea was praised for his creativity and vision."
        }
    ]
}