{
    "term": "spar",
    "meanings": [
        {
            "definition": "A thick, strong pole or bar used for support or as a weapon.",
            "pos": "noun",
            "sent1": "The construction worker leaned on the spar to rest.",
            "sent2": "The pirate brandished a spar as a makeshift weapon.",
            "sent3": "The spar rolled comically down the hill, knocking over a scarecrow.",
            "sent4": "The spar of the ship cut through the waves like a mighty sword.",
            "sent5": "The spar stood tall against the storm, a symbol of strength and resilience."
        },
        {
            "definition": "To engage in a brief, non-serious fight or argument.",
            "pos": "verb",
            "sent1": "The siblings would often spar playfully over who got the last cookie.",
            "sent2": "Friends may spar over which team will win the game.",
            "sent3": "The two kittens sparred over a toy mouse, their tiny paws swatting back and forth.",
            "sent4": "Their words sparred in the air like playful butterflies.",
            "sent5": "The spar of words between them was more laughter than argument."
        },
        {
            "definition": "To practice boxing or fencing with a partner.",
            "pos": "verb",
            "sent1": "The students sparred in the gym to improve their skills.",
            "sent2": "Boxers often spar with each other to prepare for matches.",
            "sent3": "The knights sparred in the courtyard, their swords clashing loudly.",
            "sent4": "Their movements sparred like a dance, each step a calculated strike.",
            "sent5": "The spar of training echoed through the room, a symphony of dedication."
        },
        {
            "definition": "A type of mineral often used in jewelry.",
            "pos": "noun",
            "sent1": "The necklace was adorned with a beautiful spar pendant.",
            "sent2": "The ring sparkled with a rare spar gemstone.",
            "sent3": "The spar in her earrings shimmered in the sunlight, catching everyone's eye.",
            "sent4": "Her bracelet was a delicate chain of spars, each one unique and precious.",
            "sent5": "The spar in her jewelry collection was a symbol of elegance and beauty."
        }
    ]
}