{
    "term": "spavie",
    "meanings": [
        {
            "definition": "A person who is awkward or clumsy in movement.",
            "pos": "noun",
            "sent1": "The new student was a spavie in the school play, tripping over their own feet.",
            "sent2": "The spavie struggled to keep up with the dance routine, bumping into others.",
            "sent3": "During the race, the spavie accidentally spun in a circle, much to the amusement of the audience.",
            "sent4": "Her attempts to juggle multiple tasks at once made her look like a spavie trying to balance on a tightrope.",
            "sent5": "The spavie's movements were as awkward as a puppet with tangled strings."
        },
        {
            "definition": "To move awkwardly or clumsily.",
            "pos": "verb",
            "sent1": "She tends to spavie around the room when she's nervous, knocking things over.",
            "sent2": "The toddler began to spavie across the room, wobbling with each step.",
            "sent3": "The robot spavied its way through the obstacle course, causing laughter among the spectators.",
            "sent4": "The old car spavied down the road, sputtering and jerking along the way.",
            "sent5": "The dancer's injured ankle caused her to spavie during the performance, but she kept going with a smile."
        },
        {
            "definition": "An awkward or clumsy movement.",
            "pos": "noun",
            "sent1": "The sudden spavie of the cat knocked over the vase on the table.",
            "sent2": "His spavie while carrying the tray resulted in a mess on the floor.",
            "sent3": "The spavie of the falling book caught everyone by surprise in the quiet library.",
            "sent4": "The spavie of the tree branch hitting the window startled the sleeping cat.",
            "sent5": "The spavie of the wind-blown umbrella turning inside out made everyone laugh at the beach."
        }
    ]
}