{
    "term": "spazz",
    "meanings": [
        {
            "definition": "spazz: to have a sudden burst of energy or excitement",
            "pos": "verb",
            "sent1": "After finishing his homework, Tim would spazz out and run around the yard in circles.",
            "sent2": "The children spazzed with joy when they saw the ice cream truck coming down the street.",
            "sent3": "During the game of tag, Sarah would spazz around the playground, making everyone laugh.",
            "sent4": "The music at the concert made her heart spazz with happiness.",
            "sent5": "The surprise party made him spazz with excitement, jumping up and down."
        },
        {
            "definition": "spazz: a person who is clumsy or awkward in their movements",
            "pos": "noun",
            "sent1": "Tommy was known as the class spazz because he often tripped over his own feet.",
            "sent2": "The little puppy was a spazz, always knocking things over with his wagging tail.",
            "sent3": "At the dance recital, the spazz accidentally bumped into the backdrop, causing it to wobble.",
            "sent4": "The spazz in the comedy show had the audience roaring with laughter at his silly antics.",
            "sent5": "The spazz in the movie made the viewers chuckle with his clumsy but endearing character."
        },
        {
            "definition": "spazz: a sudden outburst of anger or frustration",
            "pos": "noun",
            "sent1": "Her spazz at the malfunctioning computer scared her coworkers with its intensity.",
            "sent2": "The toddler's spazz over not getting the toy he wanted echoed through the store.",
            "sent3": "During the board game, Mark's spazz over losing a turn made everyone giggle.",
            "sent4": "The storm's sudden spazz of lightning lit up the night sky in a dazzling display.",
            "sent5": "The teacher's spazz at the noisy classroom quieted the students instantly."
        }
    ]
}