{
    "term": "specula",
    "meanings": [
        {
            "definition": "A medical instrument used for examining body cavities",
            "pos": "noun",
            "sent1": "The doctor used a specula to check my ears.",
            "sent2": "The nurse handed the specula to the physician for the examination.",
            "sent3": "The specula looked like a tiny flashlight for exploring inside the body.",
            "sent4": "Her eyes were like specula, revealing every detail of the patient's condition.",
            "sent5": "The specula gleamed under the bright hospital lights, ready for use."
        },
        {
            "definition": "A plural form of the word 'speculum' referring to mirrors used in telescopes",
            "pos": "noun",
            "sent1": "The specula in the telescope helped astronomers see distant stars clearly.",
            "sent2": "The specula were carefully aligned to enhance the telescope's performance.",
            "sent3": "The mischievous child pretended the specula in the telescope were magical portals.",
            "sent4": "The specula in the telescope reflected the vastness of the universe back to the observer.",
            "sent5": "Each specula in the telescope played a crucial role in capturing cosmic images."
        },
        {
            "definition": "A plural form of the word 'speculum' referring to a reflective surface in a microscope",
            "pos": "noun",
            "sent1": "The specula in the microscope allowed for precise examination of tiny organisms.",
            "sent2": "Scientists adjusted the specula to focus the light on the specimen.",
            "sent3": "The curious student mistook the specula in the microscope for miniature mirrors.",
            "sent4": "The specula in the microscope revealed intricate details invisible to the naked eye.",
            "sent5": "The reflective specula in the microscope enhanced the clarity of the microscopic view."
        }
    ]
}