{
    "term": "spelts",
    "meanings": [
        {
            "definition": "A type of wheat",
            "pos": "noun",
            "sent1": "The farmer harvested the spelt grains from the field.",
            "sent2": "Spelts are often used in making bread and pasta.",
            "sent3": "The mischievous squirrel tried to plant spelt seeds in the garden.",
            "sent4": "The golden spelt fields swayed gently in the breeze.",
            "sent5": "The aroma of freshly baked spelt bread filled the kitchen."
        },
        {
            "definition": "Past tense of spell",
            "pos": "verb",
            "sent1": "She spelt her name aloud to the teacher.",
            "sent2": "Yesterday, he spelt all the words correctly in the spelling bee.",
            "sent3": "The magician accidentally spelt the wrong incantation and turned himself into a frog.",
            "sent4": "Her laughter spelt joy and happiness to everyone around her.",
            "sent5": "The old book spelt out ancient secrets of the past."
        },
        {
            "definition": "A type of fish",
            "pos": "noun",
            "sent1": "The angler caught a beautiful spelt in the river.",
            "sent2": "Spelts are known for their distinctive markings and swift movements.",
            "sent3": "The mischievous cat tried to catch the spelt swimming in the aquarium.",
            "sent4": "The spelt gracefully glided through the clear water.",
            "sent5": "The spelt's scales shimmered like tiny jewels under the sunlight."
        },
        {
            "definition": "A type of metal rod",
            "pos": "noun",
            "sent1": "The blacksmith forged the spelt into a sturdy tool.",
            "sent2": "Spelts are commonly used in construction for their durability.",
            "sent3": "The mischievous child pretended the spelt was a magical wand.",
            "sent4": "The spelt gleamed in the sunlight, reflecting its polished surface.",
            "sent5": "The spelt was hammered into shape with precision and skill."
        }
    ]
}