{
    "term": "spence",
    "meanings": [
        {
            "definition": "A small room or enclosed space",
            "pos": "noun",
            "sent1": "The cat found a cozy spence to nap in.",
            "sent2": "The library had a quiet spence for reading.",
            "sent3": "The tiny mouse made the spence under the stairs its home.",
            "sent4": "In the spence of her mind, memories danced like shadows.",
            "sent5": "The spence in the attic was filled with forgotten treasures."
        },
        {
            "definition": "A type of coin",
            "pos": "noun",
            "sent1": "He collected rare spences from different countries.",
            "sent2": "The vending machine only accepted specific spences.",
            "sent3": "The pirate's treasure chest was overflowing with shiny spences.",
            "sent4": "Her smile was like a golden spence in a sea of silver.",
            "sent5": "The old man's pockets jingled with ancient spences."
        },
        {
            "definition": "A type of bird",
            "pos": "noun",
            "sent1": "The colorful spence chirped melodiously in the garden.",
            "sent2": "The spence built its nest high up in the tree.",
            "sent3": "The mischievous spence stole shiny objects for its nest.",
            "sent4": "She felt as free as a soaring spence in the sky.",
            "sent5": "The spence's song filled the air with joyous melodies."
        },
        {
            "definition": "A type of shrub",
            "pos": "noun",
            "sent1": "The spence in the garden bloomed with vibrant flowers.",
            "sent2": "The spence provided a natural barrier along the fence.",
            "sent3": "The spence's leaves rustled in the gentle breeze.",
            "sent4": "She felt as small as a spence in the vast garden.",
            "sent5": "The spence's fragrance filled the air with sweetness."
        }
    ]
}