{
    "term": "sphinx",
    "meanings": [
        {
            "definition": "A mythical creature with the body of a lion and the head of a human.",
            "pos": "noun",
            "sent1": "The sphinx in the story guarded the treasure with its lion body and human head.",
            "sent2": "The sphinx in the legend posed riddles to those who dared to approach it.",
            "sent3": "The sphinx's riddle was so tricky that even the cleverest animals couldn't solve it.",
            "sent4": "Facing the sphinx's riddle felt like confronting a puzzle with no clear answer.",
            "sent5": "The image of the sphinx with its lion and human features stayed in the hero's mind."
        },
        {
            "definition": "A mysterious or enigmatic person or thing.",
            "pos": "noun",
            "sent1": "She was a sphinx at school, always keeping her thoughts hidden from others.",
            "sent2": "The old book held secrets like a sphinx waiting to be deciphered.",
            "sent3": "His silence at the meeting turned him into a sphinx, leaving everyone curious.",
            "sent4": "The sphinx of the forest whispered secrets to those who truly listened.",
            "sent5": "The stranger's eyes held a sphinx-like gaze, revealing nothing of his intentions."
        },
        {
            "definition": "A large statue of a sphinx, typically with the face of a pharaoh.",
            "pos": "noun",
            "sent1": "The sphinx outside the museum was a grand sight with its pharaoh-like face.",
            "sent2": "Tourists gathered around the sphinx to take pictures of its majestic form.",
            "sent3": "The children pretended the sphinx statue was alive, imagining it speaking to them.",
            "sent4": "The sphinx sculpture stood stoically, as if guarding the secrets of the ancient world.",
            "sent5": "The sphinx monument symbolized the power and mystery of the civilization it represented."
        }
    ]
}