{
    "term": "spiking",
    "meanings": [
        {
            "definition": "To insert a spike into.",
            "pos": "verb",
            "sent1": "He was spiking the ground with flags for the race.",
            "sent2": "She enjoys spiking her hair with colorful clips.",
            "sent3": "The gardener accidentally started spiking the wrong area.",
            "sent4": "The artist's creativity was spiking with new ideas.",
            "sent5": "The chef was spiking the dessert with a hint of cinnamon."
        },
        {
            "definition": "To increase suddenly and sharply.",
            "pos": "verb",
            "sent1": "The temperature is spiking in the middle of summer.",
            "sent2": "The excitement in the room was spiking as the concert began.",
            "sent3": "The prices at the store were spiking, making everyone gasp.",
            "sent4": "Her heart rate was spiking with nervousness before the presentation.",
            "sent5": "The demand for the product was spiking, leading to a shortage."
        },
        {
            "definition": "To add alcohol or drugs to a drink.",
            "pos": "verb",
            "sent1": "He was spiking his punch with extra fruit juice.",
            "sent2": "The bartender was caught spiking the cocktails with vodka.",
            "sent3": "The mischievous friend kept spiking the lemonade at the picnic.",
            "sent4": "The party was spiking up with the new drink recipe.",
            "sent5": "She suspected someone was spiking her drink at the party."
        },
        {
            "definition": "To mark with spikes.",
            "pos": "verb",
            "sent1": "The fence was spiking the top to prevent climbing.",
            "sent2": "The metal gate was spiking with intricate designs.",
            "sent3": "The hedgehog was spiking its quills in defense.",
            "sent4": "The old castle walls were spiking the sky.",
            "sent5": "The mountain range was spiking the horizon with its peaks."
        }
    ]
}