{
    "term": "spiked",
    "meanings": [
        {
            "definition": "To pierce or impale with a sharp object.",
            "pos": "verb",
            "sent1": "The chef accidentally spiked his finger while chopping vegetables.",
            "sent2": "The knight bravely spiked the dragon with his sword.",
            "sent3": "The porcupine accidentally spiked its own paw with its quills.",
            "sent4": "The nail spiked through the wood effortlessly.",
            "sent5": "The cactus spiked the curious cat's nose when it got too close."
        },
        {
            "definition": "To add alcohol or drugs to a drink.",
            "pos": "verb",
            "sent1": "At the party, someone spiked the punch with vodka.",
            "sent2": "She suspected someone had spiked her soda with a sleeping pill.",
            "sent3": "The mischievous elf spiked the fairy's tea with a drop of magic potion.",
            "sent4": "The bartender accidentally spiked the wrong cocktail with hot sauce.",
            "sent5": "The prankster decided to spike his friend's coffee with a dash of salt."
        },
        {
            "definition": "Having a sharp point or tip.",
            "pos": "adjective",
            "sent1": "The spiked fence kept the rabbits out of the garden.",
            "sent2": "The spiked hairband added an edgy look to her outfit.",
            "sent3": "The spiked collar made the small dog look like a tough guy.",
            "sent4": "The spiked thorns on the rose bush deterred unwanted visitors.",
            "sent5": "The spiked metal gate gleamed in the sunlight."
        },
        {
            "definition": "To increase sharply or suddenly.",
            "pos": "verb",
            "sent1": "The demand for the new product spiked after the commercial aired.",
            "sent2": "The temperature spiked unexpectedly, catching everyone off guard.",
            "sent3": "Her heart rate spiked when she saw the surprise birthday party.",
            "sent4": "The car's speed spiked as it zoomed down the highway.",
            "sent5": "The excitement in the room spiked when the celebrity walked in."
        },
        {
            "definition": "To decorate or embellish with spikes.",
            "pos": "verb",
            "sent1": "The leather jacket was spiked with silver studs.",
            "sent2": "She decided to spike her hair with colorful beads for the festival.",
            "sent3": "The biker jacket was spiked with fierce-looking spikes on the shoulders.",
            "sent4": "The punk rock band's outfits were spiked with chains and spikes.",
            "sent5": "The Halloween costume was spiked with fake blood and spooky accessories."
        }
    ]
}