{
    "term": "spinner",
    "meanings": [
        {
            "definition": "A person or thing that spins.",
            "pos": "noun",
            "sent1": "The talented gymnast was a skilled spinner on the balance beam.",
            "sent2": "The washing machine had a fast spinner to dry clothes quickly.",
            "sent3": "The spinner at the carnival made everyone dizzy with his spinning tricks.",
            "sent4": "Her words were like a spinner, twisting and turning the truth.",
            "sent5": "The top spinner in the competition amazed the audience with his speed and precision."
        },
        {
            "definition": "A toy or device that spins.",
            "pos": "noun",
            "sent1": "The children played with a colorful spinner in the park.",
            "sent2": "The fidget spinner was a popular toy among kids.",
            "sent3": "The spinner toy spun so fast it looked like a blur of colors.",
            "sent4": "The spinner whirled around like a tiny tornado in the child's hand.",
            "sent5": "The spinner spun gracefully on the table, mesmerizing everyone around."
        },
        {
            "definition": "A type of fishing lure.",
            "pos": "noun",
            "sent1": "The fisherman used a shiny spinner to attract the fish.",
            "sent2": "The spinner lure mimicked the movement of a small fish in the water.",
            "sent3": "The fish couldn't resist the spinner spinning in the river.",
            "sent4": "The spinner danced on the surface, tempting the fish below.",
            "sent5": "The spinner lure sparkled in the sunlight, enticing the fish to bite."
        },
        {
            "definition": "A type of coin used in gambling.",
            "pos": "noun",
            "sent1": "The gambler placed a bet with a silver spinner on the table.",
            "sent2": "The spinner landed on heads, winning the player a jackpot.",
            "sent3": "The spinner coin brought luck to the player at the casino.",
            "sent4": "The spinner gleamed under the casino lights, promising fortune.",
            "sent5": "The spinner coin spun in the air before landing on the winning number."
        }
    ]
}