{
    "term": "spiritualists",
    "meanings": [
        {
            "definition": "A person who believes in the existence of spirits or a spiritual realm.",
            "pos": "noun",
            "sent1": "Many spiritualists attend seances to connect with spirits.",
            "sent2": "The spiritualists gathered in the forest to meditate and commune with nature spirits.",
            "sent3": "The spiritualists joked that the ghost in the attic must be a friendly spirit who loves to play pranks.",
            "sent4": "Her mind was like a gathering of spiritualists, each thought a different spirit whispering guidance.",
            "sent5": "The spiritualists' belief in the afterlife was so strong, it felt like they could almost see the spirits around them."
        },
        {
            "definition": "A group of individuals who practice spiritualism or communicate with spirits.",
            "pos": "noun",
            "sent1": "The spiritualists held hands in a circle to channel the energy of the spirits.",
            "sent2": "The small town had a community of spiritualists who often held meetings to discuss their experiences with spirits.",
            "sent3": "The spiritualists decided to have a potluck with the spirits, offering ghostly treats and ethereal drinks.",
            "sent4": "The room was filled with an energy that seemed to dance like the spirits the spiritualists were trying to contact.",
            "sent5": "As the spiritualists chanted, it felt like the spirits were listening and responding in kind."
        },
        {
            "definition": "The beliefs, practices, or experiences associated with spirituality or spiritualism.",
            "pos": "noun",
            "sent1": "Her grandmother's spiritualists included daily meditation and acts of kindness.",
            "sent2": "The art exhibit explored the different aspects of spiritualists from around the world.",
            "sent3": "The spiritualists' book club discussed the latest bestseller on spiritual practices.",
            "sent4": "In her paintings, she captured the essence of spiritualists through vibrant colors and ethereal shapes.",
            "sent5": "The retreat offered workshops on various spiritualists, from meditation techniques to connecting with the divine."
        }
    ]
}