{
    "term": "spirit",
    "meanings": [
        {
            "definition": "The non-physical part of a person which is the seat of emotions and character.",
            "pos": "noun",
            "sent1": "Her kind spirit always shines through in her actions.",
            "sent2": "His spirit lifted when he heard the good news.",
            "sent3": "The mischievous spirit of the child led to some playful pranks.",
            "sent4": "The spirit of unity brought the community together in times of need.",
            "sent5": "The spirit of determination in her eyes was evident to all who met her."
        },
        {
            "definition": "A person's mood or attitude.",
            "pos": "noun",
            "sent1": "His cheerful spirit brightened up the room.",
            "sent2": "She had a competitive spirit that drove her to succeed.",
            "sent3": "The adventurous spirit in him made him try skydiving for the first time.",
            "sent4": "The spirit of cooperation among team members led to a successful project.",
            "sent5": "The spirit of generosity in her actions touched many hearts."
        },
        {
            "definition": "A strong alcoholic drink.",
            "pos": "noun",
            "sent1": "He ordered a shot of his favorite spirit at the bar.",
            "sent2": "The bartender mixed the cocktail with premium spirit.",
            "sent3": "The potent spirit in the drink warmed him up on a cold night.",
            "sent4": "The smooth spirit went down easily, leaving a warm sensation.",
            "sent5": "The rich aroma of the spirit filled the room, enticing patrons."
        },
        {
            "definition": "A supernatural being or essence.",
            "pos": "noun",
            "sent1": "Legends speak of a mischievous spirit haunting the old mansion.",
            "sent2": "The ancient forest was said to be home to mystical spirits.",
            "sent3": "The friendly spirit in the ghost made it less frightening to the children.",
            "sent4": "The spirit of nature whispered through the wind in the enchanted forest.",
            "sent5": "The ethereal spirit glowed softly, illuminating the dark cave."
        }
    ]
}