{
    "term": "splashes",
    "meanings": [
        {
            "definition": "A small amount of liquid scattered or thrown onto a surface.",
            "pos": "noun",
            "sent1": "The child enjoyed playing in the splashes of water.",
            "sent2": "After the rain, there were many splashes on the sidewalk.",
            "sent3": "The cat's playful splashes in the puddle made everyone smile.",
            "sent4": "The splashes of color on the canvas created a vibrant painting.",
            "sent5": "The splashes of sunlight through the trees looked magical."
        },
        {
            "definition": "A sound made by liquid hitting a surface.",
            "pos": "noun",
            "sent1": "The splashes of the waves against the shore were soothing.",
            "sent2": "The loud splashes of the waterfall echoed in the canyon.",
            "sent3": "The chef's exaggerated splashes while cooking added a comedic touch.",
            "sent4": "The splashes of applause filled the concert hall.",
            "sent5": "The splashes of rain on the roof created a calming rhythm."
        },
        {
            "definition": "To scatter or throw small amounts of liquid onto a surface.",
            "pos": "verb",
            "sent1": "She splashes water on her face to wake up in the morning.",
            "sent2": "The kids love to splash each other in the pool.",
            "sent3": "The playful otters splash water at each other in the pond.",
            "sent4": "The storm splashes rain against the window panes.",
            "sent5": "The fountain splashes water high into the air."
        },
        {
            "definition": "To move or strike with a splashing sound.",
            "pos": "verb",
            "sent1": "The puppy splashes through the puddles during playtime.",
            "sent2": "The fish splashes in the pond when they jump out of the water.",
            "sent3": "The clumsy waiter accidentally splashes water on the customers.",
            "sent4": "The dancer's feet splash gracefully on the wet stage.",
            "sent5": "The storm splashes against the windows with fierce intensity."
        }
    ]
}