{
    "term": "splash",
    "meanings": [
        {
            "definition": "A sound made by something striking or falling into liquid.",
            "pos": "noun",
            "sent1": "The splash of the rock hitting the water was loud.",
            "sent2": "After the rain, puddles were filled with tiny splashes.",
            "sent3": "The frog made a splash as it jumped into the pond.",
            "sent4": "Her laughter was like a splash of joy in the room.",
            "sent5": "The splash of colors in the painting caught everyone's attention."
        },
        {
            "definition": "A small amount of liquid that scatters or falls in drops.",
            "pos": "noun",
            "sent1": "She felt a splash of rain on her face.",
            "sent2": "The chef added a splash of vinegar to the salad.",
            "sent3": "The splash of lemon juice made the dish taste fresh.",
            "sent4": "The splash of perfume lingered in the air.",
            "sent5": "The splash of water from the fountain cooled us down."
        },
        {
            "definition": "To cause liquid to scatter or fall in drops.",
            "pos": "verb",
            "sent1": "Carefully splash the paint onto the canvas.",
            "sent2": "She likes to splash water on her face in the morning.",
            "sent3": "He decided to splash some color on the dull wall.",
            "sent4": "The storm will splash rain all over the city.",
            "sent5": "The kids love to splash in the pool during summer."
        },
        {
            "definition": "To move or strike with a splashing sound.",
            "pos": "verb",
            "sent1": "The dog will splash through the puddles in the park.",
            "sent2": "She accidentally splashed her drink on the table.",
            "sent3": "The cat likes to splash its tail in the water.",
            "sent4": "The waves splash against the rocks on the shore.",
            "sent5": "The rain will splash against the window all night long."
        }
    ]
}