{
    "term": "splendid",
    "meanings": [
        {
            "definition": "Magnificent or grand in appearance",
            "pos": "adjective",
            "sent1": "The princess wore a splendid gown to the ball.",
            "sent2": "The sunset over the ocean was truly splendid.",
            "sent3": "The cat thought it was splendid to chase after a shiny toy.",
            "sent4": "The city skyline looked splendid, like a crown on the horizon.",
            "sent5": "The garden was a splendid display of colorful flowers and lush greenery."
        },
        {
            "definition": "Excellent or very good",
            "pos": "adjective",
            "sent1": "The cake was splendid, moist and delicious.",
            "sent2": "She did a splendid job on her school project.",
            "sent3": "The dog's splendid trick made everyone laugh.",
            "sent4": "The team's performance was splendid, like a well-oiled machine.",
            "sent5": "The book received splendid reviews from critics and readers alike."
        },
        {
            "definition": "Showy or impressive",
            "pos": "adjective",
            "sent1": "The actor's splendid costume stole the show.",
            "sent2": "The fireworks display was truly splendid.",
            "sent3": "The magician's splendid trick left the audience in awe.",
            "sent4": "The mansion had a splendid entrance with grand pillars.",
            "sent5": "The parade featured splendid floats and colorful decorations."
        },
        {
            "definition": "Distinguished or illustrious",
            "pos": "adjective",
            "sent1": "The professor was a splendid scholar in his field.",
            "sent2": "The artist's work was considered splendid by art critics.",
            "sent3": "The mayor gave a splendid speech at the town hall.",
            "sent4": "The historical figure left a splendid legacy for future generations.",
            "sent5": "The award-winning actor had a splendid career in Hollywood."
        }
    ]
}