{
    "term": "splitting",
    "meanings": [
        {
            "definition": "To divide or separate into parts",
            "pos": "verb",
            "sent1": "She was splitting the cake into slices for everyone to enjoy.",
            "sent2": "The lumberjack was splitting the large log with his axe.",
            "sent3": "The magician was splitting the rabbit in half, but it magically came back together!",
            "sent4": "The earthquake was so powerful, it felt like the ground was splitting beneath our feet.",
            "sent5": "The chef's precise knife skills made splitting the vegetables look effortless."
        },
        {
            "definition": "To break or tear apart",
            "pos": "verb",
            "sent1": "The loud noise was splitting the silence of the night.",
            "sent2": "The storm was splitting the old tree in the backyard.",
            "sent3": "The mischievous puppy was splitting the socks into shreds.",
            "sent4": "The singer's powerful voice seemed to be splitting the air around us.",
            "sent5": "The old book was splitting at the seams from years of use."
        },
        {
            "definition": "Divided or separated into parts",
            "pos": "adjective",
            "sent1": "The splitting log lay in two pieces on the forest floor.",
            "sent2": "The splitting river flowed through the valley, creating a beautiful landscape.",
            "sent3": "The splitting puzzle pieces were scattered all over the table.",
            "sent4": "The splitting clouds in the sky signaled an incoming storm.",
            "sent5": "The splitting banana peel revealed the ripe fruit inside."
        },
        {
            "definition": "A division or separation",
            "pos": "noun",
            "sent1": "The splitting of the company led to many employees losing their jobs.",
            "sent2": "The splitting between the two friends was caused by a misunderstanding.",
            "sent3": "The splitting of the cake caused a playful food fight at the party.",
            "sent4": "The splitting of the atom changed the course of scientific history.",
            "sent5": "The splitting of the sea in the movie was a breathtaking special effect."
        }
    ]
}