{
    "term": "split",
    "meanings": [
        {
            "definition": "Divide into parts or pieces",
            "pos": "verb",
            "sent1": "I will split the cake into slices for everyone to enjoy.",
            "sent2": "She used a knife to split the wood for the fire.",
            "sent3": "The magician will split the rabbit in half and then put it back together!",
            "sent4": "The river split the land, creating two separate islands.",
            "sent5": "The axe split the log with a loud crack."
        },
        {
            "definition": "To separate or break apart",
            "pos": "verb",
            "sent1": "The siblings decided to split the chores evenly between them.",
            "sent2": "The earthquake caused the ground to split open.",
            "sent3": "I accidentally split my pants while trying to jump over the fence.",
            "sent4": "The loud noise split the silence of the night.",
            "sent5": "The hammer split the rock into smaller pieces."
        },
        {
            "definition": "To go in different directions",
            "pos": "verb",
            "sent1": "The group decided to split up and search for the lost dog.",
            "sent2": "The roads split at the intersection, leading to different destinations.",
            "sent3": "The friends had to split ways after high school to attend different colleges.",
            "sent4": "The river split into two streams, each flowing in a different direction.",
            "sent5": "The team split into two groups to cover more ground."
        },
        {
            "definition": "A division or separation",
            "pos": "noun",
            "sent1": "The split between the two factions caused tension in the community.",
            "sent2": "The split in the road led to confusion among the travelers.",
            "sent3": "The split in opinions made it difficult to reach a decision.",
            "sent4": "The split in the family was healed over time through communication.",
            "sent5": "The split in the fabric was carefully sewn back together."
        },
        {
            "definition": "A tear or crack in something",
            "pos": "noun",
            "sent1": "The split in the wall allowed a draft to enter the room.",
            "sent2": "The split in the glass was barely visible but still a cause for concern.",
            "sent3": "The split in the paper made it difficult to read the entire document.",
            "sent4": "The split in the tree trunk indicated it was old and fragile.",
            "sent5": "The split in the sidewalk posed a tripping hazard for pedestrians."
        }
    ]
}