{
    "term": "splurgiest",
    "meanings": [
        {
            "definition": "(adjective) most luxurious or extravagant",
            "pos": "adjective",
            "sent1": "The hotel suite was the splurgiest room available, with a huge jacuzzi and a private balcony.",
            "sent2": "She wore the splurgiest dress to the fancy gala, covered in sparkles and sequins.",
            "sent3": "For her birthday, she decided to go all out and book the splurgiest spa package in town.",
            "sent4": "His splurgiest purchase was a vintage sports car, a symbol of his success and wealth.",
            "sent5": "The splurgiest vacation they ever took was to a private island, complete with butler service and gourmet meals."
        },
        {
            "definition": "(adverb) in a manner that is most extravagant or luxurious",
            "pos": "adverb",
            "sent1": "She dressed splurgiest for the red carpet event, with diamonds dripping from her ears.",
            "sent2": "The couple traveled splurgiest, flying first class and staying in 5-star hotels.",
            "sent3": "He decided to spoil himself and live splurgiest for a day, ordering room service and watching movies in bed.",
            "sent4": "The party was thrown splurgiest, with champagne flowing and live music all night.",
            "sent5": "They celebrated their anniversary splurgiest, dining at a Michelin-star restaurant and taking a limousine ride around the city."
        },
        {
            "definition": "(noun) the most extravagant or luxurious option",
            "pos": "noun",
            "sent1": "The splurgiest in the menu was the Kobe beef steak, priced at a premium.",
            "sent2": "She always went for the splurgiest option when shopping, preferring designer labels.",
            "sent3": "His weakness was always choosing the splurgiest dessert on the menu, no matter the cost.",
            "sent4": "The splurgiest in the store was a limited edition handbag, adorned with jewels.",
            "sent5": "When it came to vacations, they always picked the splurgiest destination, staying in luxury resorts and villas."
        }
    ]
}