{
    "term": "spoliation",
    "meanings": [
        {
            "definition": "The act of plundering or despoiling",
            "pos": "noun",
            "sent1": "The spoliation of the ancient ruins left the historians devastated.",
            "sent2": "The spoliation of the village by the invaders was swift and merciless.",
            "sent3": "The mischievous raccoons engaged in spoliation of the picnic area, leaving a mess behind.",
            "sent4": "The spoliation of the forest by the logging company was a stark reminder of human impact on nature.",
            "sent5": "The spoliation of the treasure trove was depicted vividly in the adventure novel."
        },
        {
            "definition": "The act of altering or destroying evidence",
            "pos": "noun",
            "sent1": "The criminal's spoliation of the crime scene made it difficult for investigators to gather evidence.",
            "sent2": "The spoliation of documents by the suspect hindered the progress of the case.",
            "sent3": "The clumsy detective accidentally caused spoliation of the key piece of evidence.",
            "sent4": "The spoliation of the security footage raised suspicions about foul play.",
            "sent5": "The deliberate spoliation of the witness's testimony cast doubt on the trial."
        },
        {
            "definition": "The act of damaging or destroying something, especially cultural artifacts",
            "pos": "noun",
            "sent1": "The spoliation of the ancient vase during the earthquake was a great loss.",
            "sent2": "The spoliation of the museum's artifacts was a tragic consequence of the war.",
            "sent3": "The playful children accidentally caused spoliation of the delicate sculpture.",
            "sent4": "The spoliation of the historical site was a blow to the preservation efforts.",
            "sent5": "The spoliation of the rare painting was a heartbreaking event for art enthusiasts."
        }
    ]
}