{
    "term": "sponge",
    "meanings": [
        {
            "definition": "A porous, absorbent pad used for cleaning or applying liquid",
            "pos": "noun",
            "sent1": "I used a sponge to clean the dishes after dinner.",
            "sent2": "The kitchen sponge soaked up all the spilled juice.",
            "sent3": "The sponge happily absorbed the soapy water and bubbles.",
            "sent4": "Her mind was like a sponge, absorbing every detail of the story.",
            "sent5": "The sponge's ability to soak up water amazed the children."
        },
        {
            "definition": "A person who takes advantage of the generosity of others",
            "pos": "noun",
            "sent1": "He's known as a sponge because he always asks for favors but never gives back.",
            "sent2": "Beware of sponges who try to manipulate your kindness for their benefit.",
            "sent3": "The sponge at the office potluck took more than their fair share of food.",
            "sent4": "She felt like a sponge, absorbing all the compliments without reciprocating.",
            "sent5": "The sponge's constant borrowing without returning made everyone wary."
        },
        {
            "definition": "A type of aquatic animal with a soft, porous body",
            "pos": "noun",
            "sent1": "The sponge in the ocean provides shelter for small fish.",
            "sent2": "The marine biologist studied the unique features of the sea sponge.",
            "sent3": "The sponge's gentle movements in the water were mesmerizing to watch.",
            "sent4": "The sponge's ability to filter water is crucial for the ecosystem.",
            "sent5": "The colorful sponge added beauty to the underwater world."
        },
        {
            "definition": "To absorb or soak up liquid",
            "pos": "verb",
            "sent1": "The dry soil began to sponge up the rainwater quickly.",
            "sent2": "She used a towel to sponge up the spilled milk from the floor.",
            "sent3": "The thirsty plants eagerly sponged up the water after the rain.",
            "sent4": "The desert sand seemed to sponge up the sweat from his forehead.",
            "sent5": "The paper towel was able to sponge up the coffee spill in no time."
        },
        {
            "definition": "To clean or wipe with a sponge",
            "pos": "verb",
            "sent1": "She would sponge the kitchen counter every evening after cooking.",
            "sent2": "He decided to sponge the car to remove the dust and dirt.",
            "sent3": "The maid would sponge the windows until they sparkled in the sunlight.",
            "sent4": "The artist gently sponged the canvas to create a textured effect.",
            "sent5": "The child loved to sponge the walls with soapy water during spring cleaning."
        }
    ]
}