{
    "term": "spongeing",
    "meanings": [
        {
            "definition": "Absorbent material used for cleaning or washing.",
            "pos": "noun",
            "sent1": "I used a spongeing to clean the dishes.",
            "sent2": "The kitchen sink was full of different spongeings for cleaning.",
            "sent3": "The spongeing in the bathroom started a dance party with the soap.",
            "sent4": "The spongeing in the bucket eagerly awaited its turn to scrub the floor.",
            "sent5": "The colorful spongeing in the cleaning aisle caught my eye immediately."
        },
        {
            "definition": "To clean or wipe with a sponge.",
            "pos": "verb",
            "sent1": "She enjoys spongeing the car on weekends.",
            "sent2": "I will spongeing the spill on the table right away.",
            "sent3": "He was caught spongeing the whiteboard during class.",
            "sent4": "The rain was spongeing the ground, leaving puddles everywhere.",
            "sent5": "The chef was spongeing the countertop to keep it spotless."
        },
        {
            "definition": "To take advantage of someone by constantly borrowing or asking for things.",
            "pos": "verb",
            "sent1": "He kept spongeing off his friends for money.",
            "sent2": "She was always spongeing things from her siblings.",
            "sent3": "The cat seemed to be spongeing off the dog's treats.",
            "sent4": "The lazy roommate was spongeing off others for meals.",
            "sent5": "The neighbor was spongeing off our Wi-Fi without asking."
        },
        {
            "definition": "To soak up or absorb liquid.",
            "pos": "verb",
            "sent1": "The spongeing quickly absorbed the spilled milk.",
            "sent2": "The dry spongeing began spongeing up the water on the floor.",
            "sent3": "The spongeing in the sink seemed to be spongeing up all the water.",
            "sent4": "The spongeing on the beach was spongeing up the ocean water.",
            "sent5": "The spongeing in the experiment was spongeing up the colored liquid."
        }
    ]
}