{
    "term": "spoorers",
    "meanings": [
        {
            "definition": "Spoilers: a person or thing that spoils something",
            "pos": "noun",
            "sent1": "The spoorers in the movie ruined the surprise ending for everyone.",
            "sent2": "The spoorers at the party kept complaining and bringing down the mood.",
            "sent3": "The spoorers at the picnic were the ants that invaded the food.",
            "sent4": "Her negative attitude acted like a spoorers, spoiling the fun for everyone.",
            "sent5": "The spoorers in the group always found something to criticize and ruin the enjoyment."
        },
        {
            "definition": "Spoilers: a device on a vehicle that reduces air resistance",
            "pos": "noun",
            "sent1": "The spoorers on the car helped it move faster by cutting through the wind.",
            "sent2": "The spoorers on the airplane wings made it more aerodynamic for better fuel efficiency.",
            "sent3": "The spoorers on the boat were like magic wings, making it glide smoothly on the water.",
            "sent4": "The spoorers on the train resembled sleek fins, allowing it to speed along the tracks.",
            "sent5": "The spoorers on the bike made it easier to pedal and ride faster against the wind."
        },
        {
            "definition": "Spoilers: information that reveals key plot points in a story",
            "pos": "noun",
            "sent1": "The spoorers in the review gave away the ending of the book before I read it.",
            "sent2": "The spoorers in the trailer showed all the best scenes, spoiling the movie for me.",
            "sent3": "The spoorers in the gossip column leaked the big twist in the TV show.",
            "sent4": "The spoorers on social media ruined the surprise by posting spoilers about the show.",
            "sent5": "The spoorers in the magazine article spoiled the plot twists of the upcoming film."
        }
    ]
}