{
    "term": "spooky",
    "meanings": [
        {
            "definition": "Eerie or frightening",
            "pos": "adjective",
            "sent1": "The old abandoned house looked spooky in the moonlight.",
            "sent2": "The children found the dark forest to be spooky.",
            "sent3": "The spooky noises coming from the attic turned out to be just a family of raccoons.",
            "sent4": "The spooky shadows danced on the walls, creating an atmosphere of mystery.",
            "sent5": "The spooky movie kept me on the edge of my seat with its eerie scenes."
        },
        {
            "definition": "Causing fear or unease",
            "pos": "adjective",
            "sent1": "The spooky sound of footsteps behind her made Sarah shiver.",
            "sent2": "The spooky stories around the campfire made everyone huddle closer.",
            "sent3": "The spooky mask made Tim jump in surprise at the Halloween party.",
            "sent4": "The spooky fog enveloped the town, spreading a sense of unease.",
            "sent5": "The spooky creaking of the door sent a chill down her spine."
        },
        {
            "definition": "Suggestive of ghosts or the supernatural",
            "pos": "adjective",
            "sent1": "The spooky mist that hovered over the graveyard gave it an eerie feel.",
            "sent2": "The spooky legend of the haunted castle intrigued the tourists.",
            "sent3": "The spooky costume party was filled with fake ghosts and witches.",
            "sent4": "The spooky aura of the old mansion hinted at a ghostly presence.",
            "sent5": "The spooky tales of the paranormal kept the children wide-eyed with wonder."
        },
        {
            "definition": "Characterized by a feeling of dread or apprehension",
            "pos": "adjective",
            "sent1": "The spooky silence in the dark alley made her heart race.",
            "sent2": "The spooky music in the horror movie set a tense atmosphere.",
            "sent3": "The spooky feeling of being watched made him quicken his pace.",
            "sent4": "The spooky anticipation of the unknown outcome kept her on edge.",
            "sent5": "The spooky premonition of danger lingered in the air, causing unease."
        }
    ]
}