{
    "term": "sportive",
    "meanings": [
        {
            "definition": "Playful or lively in nature",
            "pos": "adjective",
            "sent1": "The puppies had a sportive romp in the yard.",
            "sent2": "The children's laughter filled the playground as they engaged in sportive games.",
            "sent3": "The clown's sportive antics brought smiles to everyone's faces.",
            "sent4": "Her sportive spirit was like a burst of colorful confetti in a dull room.",
            "sent5": "The stream flowed sportively over the rocks, bubbling with energy."
        },
        {
            "definition": "Engaging in physical activity for enjoyment and recreation",
            "pos": "verb",
            "sent1": "We love to sportive on the weekends by playing soccer in the park.",
            "sent2": "They sportive regularly to stay healthy and have fun.",
            "sent3": "The friends decided to sportive by going for a hike in the mountains.",
            "sent4": "She sportived with her dog in the backyard, throwing a frisbee back and forth.",
            "sent5": "Sportiving in the fresh air always lifts our spirits and energizes us."
        },
        {
            "definition": "Showing a playful or lively attitude",
            "pos": "adjective",
            "sent1": "His sportive jokes kept the mood light during the meeting.",
            "sent2": "The comedian's sportive demeanor charmed the audience.",
            "sent3": "The cat's sportive behavior entertained the family for hours.",
            "sent4": "Her sportive personality shone through in every conversation.",
            "sent5": "The children's sportive banter filled the room with joy."
        },
        {
            "definition": "Characterized by or conducive to playfulness or amusement",
            "pos": "adjective",
            "sent1": "The colorful playground was a sportive place for children to enjoy.",
            "sent2": "The festival had a sportive atmosphere with music and games for all.",
            "sent3": "The movie had a sportive plot that kept the audience laughing.",
            "sent4": "The park's sportive decorations made it a fun place to visit.",
            "sent5": "The party was a sportive event with dancing, laughter, and games."
        }
    ]
}