{
    "term": "spotting",
    "meanings": [
        {
            "definition": "To see or notice something",
            "pos": "verb",
            "sent1": "I was spotting a rainbow in the sky.",
            "sent2": "She enjoys spotting birds in the park.",
            "sent3": "Spotting a friend in a crowd always brings a smile.",
            "sent4": "Her keen eyes were like spotlights, spotting every detail.",
            "sent5": "The detective was skilled at spotting clues others missed."
        },
        {
            "definition": "To mark or stain with spots",
            "pos": "verb",
            "sent1": "The rain was spotting the windows with tiny droplets.",
            "sent2": "Be careful not to spill ink and start spotting the paper.",
            "sent3": "Spotting the white shirt with ketchup was an unfortunate accident.",
            "sent4": "The artist's brush slipped, spotting the canvas with unexpected color.",
            "sent5": "The puppy's muddy paws were spotting the clean floor."
        },
        {
            "definition": "The act of observing or detecting something",
            "pos": "noun",
            "sent1": "Her spotting of the rare flower delighted the botanist.",
            "sent2": "The spotting of a shooting star brought joy to the children.",
            "sent3": "The spotting of a squirrel doing acrobatics made everyone laugh.",
            "sent4": "His spotting of the hidden treasure was the talk of the town.",
            "sent5": "The spotting of a UFO caused a frenzy in the small town."
        },
        {
            "definition": "The act of marking or staining with spots",
            "pos": "noun",
            "sent1": "The leopard's spotting helped it blend into the jungle.",
            "sent2": "The spotting on the butterfly's wings was mesmerizing.",
            "sent3": "The spotting on the antique vase added to its charm.",
            "sent4": "The artist's unique spotting technique created a beautiful pattern.",
            "sent5": "The dog's fur had a natural spotting that looked like artwork."
        }
    ]
}