{
    "term": "spotlight",
    "meanings": [
        {
            "definition": "A strong beam of light directed on a particular area or object.",
            "pos": "noun",
            "sent1": "The spotlight illuminated the stage during the performance.",
            "sent2": "The spotlight shone brightly on the singer as she belted out the final note.",
            "sent3": "The mischievous cat chased after the moving spotlight, thinking it was a playful game.",
            "sent4": "Her talent for painting was like a spotlight in a dark room, impossible to ignore.",
            "sent5": "The spotlight revealed the intricate details of the ancient artifact."
        },
        {
            "definition": "To focus attention on someone or something.",
            "pos": "verb",
            "sent1": "During the presentation, the speaker would spotlight key points to emphasize their importance.",
            "sent2": "The teacher decided to spotlight the student's exceptional artwork in front of the class.",
            "sent3": "The magician would spotlight a different audience member each night, making them feel special.",
            "sent4": "Her hard work and dedication spotlighted her as a role model for the younger athletes.",
            "sent5": "The documentary aimed to spotlight the environmental issues affecting the local community."
        },
        {
            "definition": "A lamp projecting a narrow, intense beam of light.",
            "pos": "noun",
            "sent1": "The mechanic used a spotlight to inspect the car engine in detail.",
            "sent2": "The security guard carried a powerful spotlight to patrol the dark premises.",
            "sent3": "The children pretended the spotlight was a magical wand, casting spells in the backyard.",
            "sent4": "The lighthouse's spotlight guided ships safely through the stormy night.",
            "sent5": "The detective relied on the spotlight to search for clues in the abandoned warehouse."
        }
    ]
}