{
    "term": "sprays",
    "meanings": [
        {
            "definition": "A fine mist of liquid particles.",
            "pos": "noun",
            "sent1": "The garden hose produced refreshing sprays of water.",
            "sent2": "The sprays of perfume filled the room with a pleasant scent.",
            "sent3": "The sprays of paint looked like colorful confetti falling from the sky.",
            "sent4": "The sprays of mist danced in the sunlight like tiny fairies.",
            "sent5": "The sprays of water from the fountain sparkled like diamonds in the sun."
        },
        {
            "definition": "To disperse liquid in a fine mist.",
            "pos": "verb",
            "sent1": "She sprays water on the plants to keep them hydrated.",
            "sent2": "The skunk sprays a foul-smelling liquid when threatened.",
            "sent3": "He sprays paint on the canvas with artistic flair.",
            "sent4": "The ocean sprays salty water onto the shore with each crashing wave.",
            "sent5": "The chef sprays olive oil on the salad for a light dressing."
        },
        {
            "definition": "A device that emits a fine mist of liquid.",
            "pos": "noun",
            "sent1": "The air freshener sprays a pleasant scent throughout the room.",
            "sent2": "The spray bottle releases a fine mist of cleaning solution.",
            "sent3": "The nasal spray helps clear congestion and improve breathing.",
            "sent4": "The insect repellent spray keeps mosquitoes away during outdoor activities.",
            "sent5": "The perfume spray fits easily in a purse for on-the-go freshness."
        },
        {
            "definition": "To apply liquid in a fine mist.",
            "pos": "verb",
            "sent1": "She sprays the plants with insecticide to protect them from pests.",
            "sent2": "The hair stylist sprays hairspray to set the hairstyle in place.",
            "sent3": "He sprays cologne on his neck before heading out for the evening.",
            "sent4": "The painter sprays varnish on the finished artwork for a glossy finish.",
            "sent5": "The gardener sprays fertilizer on the lawn to promote healthy growth."
        }
    ]
}