{
    "term": "spray",
    "meanings": [
        {
            "definition": "A fine mist of liquid particles in the air.",
            "pos": "noun",
            "sent1": "The spray from the waterfall felt refreshing on my face.",
            "sent2": "The gardener used a spray to water the plants gently.",
            "sent3": "The mischievous child ran through the spray of the sprinkler, laughing.",
            "sent4": "The spray of stars in the night sky was mesmerizing.",
            "sent5": "The spray of perfume lingered in the room long after she left."
        },
        {
            "definition": "To disperse liquid in small drops.",
            "pos": "verb",
            "sent1": "She likes to spray water on the flowers to keep them hydrated.",
            "sent2": "The painter used a brush to spray paint on the canvas.",
            "sent3": "The chef accidentally sprayed sauce all over the kitchen counter.",
            "sent4": "The sprinkler sprayed water in all directions, creating a rainbow.",
            "sent5": "The skunk sprayed a foul odor to defend itself from predators."
        },
        {
            "definition": "A device that emits a fine mist of liquid.",
            "pos": "noun",
            "sent1": "The spray helped cool down the room on hot summer days.",
            "sent2": "She carried a small spray in her bag for quick touch-ups.",
            "sent3": "The automatic air freshener released a pleasant spray every hour.",
            "sent4": "The mechanic used a spray to lubricate the gears of the machine.",
            "sent5": "The spray bottle dispensed the cleaning solution evenly on the surface."
        },
        {
            "definition": "To apply liquid in small drops.",
            "pos": "verb",
            "sent1": "He would spray cologne on his wrists before going out.",
            "sent2": "The farmer sprayed fertilizer on the crops for better growth.",
            "sent3": "She sprayed a bit of perfume on her scarf for a lovely scent.",
            "sent4": "The artist sprayed water on the paint to create a watercolor effect.",
            "sent5": "The gardener sprayed insecticide on the plants to protect them from pests."
        }
    ]
}