{
    "term": "spreader",
    "meanings": [
        {
            "definition": "A device used to spread or distribute something.",
            "pos": "noun",
            "sent1": "The farmer used a spreader to evenly distribute seeds in the field.",
            "sent2": "The salt spreader helped clear the icy roads during winter.",
            "sent3": "The spreader decided to evenly distribute smiles around the room.",
            "sent4": "Her kindness was like a spreader, spreading joy wherever she went.",
            "sent5": "The spreader made sure everyone got an equal share of the cake."
        },
        {
            "definition": "A person or thing that spreads or causes something to spread.",
            "pos": "noun",
            "sent1": "The bee was a natural spreader of pollen from flower to flower.",
            "sent2": "Social media can be a powerful spreader of information, both true and false.",
            "sent3": "The spreader of laughter had everyone in stitches with their jokes.",
            "sent4": "His infectious enthusiasm was a spreader of positivity in the office.",
            "sent5": "The wildfire acted as a dangerous spreader of destruction through the forest."
        },
        {
            "definition": "A tool used for spreading butter or other substances.",
            "pos": "noun",
            "sent1": "She used a spreader to evenly spread jam on her toast.",
            "sent2": "The chef picked up a spreader to butter the freshly baked bread.",
            "sent3": "The spreader accidentally flung butter across the kitchen counter.",
            "sent4": "The spreader glided smoothly over the warm bread, melting the butter.",
            "sent5": "The silver spreader gleamed under the kitchen lights as it spread the cheese."
        },
        {
            "definition": "A person who spreads rumors or gossip.",
            "pos": "noun",
            "sent1": "The office spreader was always the first to share the latest gossip.",
            "sent2": "She regretted being a spreader of rumors about her classmates.",
            "sent3": "The spreader's tales grew taller with each telling, like a game of telephone.",
            "sent4": "The spreader's words were like seeds, growing into wild stories in people's minds.",
            "sent5": "The spreader's whispers floated through the air, causing chaos in the community."
        }
    ]
}