{
    "term": "springed",
    "meanings": [
        {
            "definition": "To move or jump suddenly or rapidly.",
            "pos": "verb",
            "sent1": "The cat springed onto the table to catch the mouse.",
            "sent2": "The rabbit springed out of the bush when it heard a noise.",
            "sent3": "The squirrel springed up the tree to escape the barking dog.",
            "sent4": "The athlete springed across the finish line, winning the race.",
            "sent5": "The ballerina springed gracefully across the stage, captivating the audience."
        },
        {
            "definition": "To originate or arise.",
            "pos": "verb",
            "sent1": "The idea springed from a conversation between friends.",
            "sent2": "The tradition of gift-giving springed from ancient customs.",
            "sent3": "The rumor springed from a misunderstanding and spread quickly.",
            "sent4": "Hope springed in their hearts as they saw the first signs of spring.",
            "sent5": "Laughter springed from the children playing together in the park."
        },
        {
            "definition": "To set or wind a clock or watch.",
            "pos": "verb",
            "sent1": "She carefully springed the antique clock to make it chime.",
            "sent2": "He always springed his watch before starting his day.",
            "sent3": "Grandpa springed the old pocket watch, its gears clicking softly.",
            "sent4": "The mechanic springed the clock in the tower to keep time accurately.",
            "sent5": "The sound of the clock being springed echoed through the room."
        },
        {
            "definition": "Having springs or spring-like qualities.",
            "pos": "adjective",
            "sent1": "The mattress was so comfortable because it was springed.",
            "sent2": "The trampoline was bouncy and fun due to its springed surface.",
            "sent3": "The shoes had a springed sole that made walking feel light and easy.",
            "sent4": "The car had a smooth ride thanks to its springed suspension.",
            "sent5": "The toy had a springed mechanism that made it jump and flip unpredictably."
        }
    ]
}