{
    "term": "spring",
    "meanings": [
        {
            "definition": "A season of the year between winter and summer.",
            "pos": "noun",
            "sent1": "In spring, flowers bloom and trees grow new leaves.",
            "sent2": "I love going for walks in the park during spring.",
            "sent3": "The spring weather makes me want to go outside and play.",
            "sent4": "The arrival of spring brings a burst of color to the landscape.",
            "sent5": "During spring, the days get longer and the weather gets warmer."
        },
        {
            "definition": "A coiled or curved mechanical device used to store and release energy.",
            "pos": "noun",
            "sent1": "The spring in the clock helps it keep time accurately.",
            "sent2": "When you wind up a toy car, you are storing energy in the spring.",
            "sent3": "I accidentally let go of the spring, and it bounced away.",
            "sent4": "The spring in the pen allows the ink to flow smoothly onto the paper.",
            "sent5": "The spring in the trampoline gives it its bounce."
        },
        {
            "definition": "To move or jump suddenly or rapidly.",
            "pos": "verb",
            "sent1": "The cat can spring up onto the counter with ease.",
            "sent2": "I saw the squirrel spring from one tree to another.",
            "sent3": "The surprise party made him spring out of his chair.",
            "sent4": "Her sudden question made him spring to attention.",
            "sent5": "The athlete can spring over hurdles effortlessly."
        },
        {
            "definition": "A source of water flowing from the ground.",
            "pos": "noun",
            "sent1": "The natural spring in the forest provides fresh water.",
            "sent2": "People used to rely on springs for drinking water.",
            "sent3": "The animals gathered around the spring to quench their thirst.",
            "sent4": "The spring in the valley is a peaceful spot for picnics.",
            "sent5": "The sound of the bubbling spring is soothing to the ears."
        },
        {
            "definition": "To originate or arise suddenly.",
            "pos": "verb",
            "sent1": "Ideas can spring from unexpected places.",
            "sent2": "The solution to the problem sprang to mind out of nowhere.",
            "sent3": "Laughter can spring from the silliest jokes.",
            "sent4": "Confidence can spring up when you least expect it.",
            "sent5": "Hope can spring eternal even in difficult times."
        }
    ]
}