{
    "term": "sprung",
    "meanings": [
        {
            "definition": "Past tense of spring.",
            "pos": "verb",
            "sent1": "Yesterday, I sprung out of bed excited for the day.",
            "sent2": "She sprung up from her chair when she heard the good news.",
            "sent3": "The cat sprung onto the table, surprising everyone with its agility.",
            "sent4": "His words sprung a new idea in her mind, like a spark igniting a fire.",
            "sent5": "The flowers sprung up overnight, painting the garden in vibrant colors."
        },
        {
            "definition": "To have originated or come into existence.",
            "pos": "verb",
            "sent1": "The tradition of exchanging gifts on Christmas sprung from ancient customs.",
            "sent2": "The idea for the new product sprung from a brainstorming session.",
            "sent3": "His love for music sprung from listening to his grandfather's old records.",
            "sent4": "The city's growth sprung from the influx of new residents seeking opportunities.",
            "sent5": "A beautiful friendship sprung between the two classmates, blossoming over time."
        },
        {
            "definition": "To have been released or set free.",
            "pos": "verb",
            "sent1": "The bird was sprung from its cage and soared into the open sky.",
            "sent2": "After serving his sentence, the prisoner was finally sprung from jail.",
            "sent3": "The cork popped and the champagne sprung out, celebrating the special occasion.",
            "sent4": "The latch was released, and the gate sprung open with a creak.",
            "sent5": "The tension in the room was palpable until laughter sprung forth, breaking the ice."
        },
        {
            "definition": "To have been surprised or caught off guard.",
            "pos": "verb",
            "sent1": "She was sprung by the unexpected arrival of her long-lost friend.",
            "sent2": "The prankster grinned as his friend was sprung by the practical joke.",
            "sent3": "The cat stealthily sprung on the toy mouse, surprising even itself.",
            "sent4": "His sudden question sprung her into a state of confusion, unable to respond.",
            "sent5": "The magician's trick sprung the audience, leaving them in awe of his skills."
        }
    ]
}