{
    "term": "spued",
    "meanings": [
        {
            "definition": "To eject forcibly from the mouth",
            "pos": "verb",
            "sent1": "She spued out the watermelon seeds after eating the fruit.",
            "sent2": "The pressure caused the soda to spued out of the bottle.",
            "sent3": "The fountain spued water high into the air, creating a beautiful display.",
            "sent4": "The volcano spued lava and ash, covering the surrounding area.",
            "sent5": "The burst pipe spued water everywhere, causing a mess in the kitchen."
        },
        {
            "definition": "To expel or discharge forcefully",
            "pos": "verb",
            "sent1": "The machine spued out sparks, indicating a malfunction.",
            "sent2": "The car's exhaust pipe spued black smoke, polluting the air.",
            "sent3": "The toy gun spued out foam darts at a rapid pace, surprising everyone.",
            "sent4": "The storm spued rain and hail, causing damage to the crops.",
            "sent5": "The factory spued out toxic fumes, endangering the workers' health."
        },
        {
            "definition": "To vomit or throw up",
            "pos": "verb",
            "sent1": "The sick child spued on the carpet, needing immediate cleanup.",
            "sent2": "The cat spued up a hairball on the floor, much to the owner's dismay.",
            "sent3": "The roller coaster ride made him feel queasy, almost causing him to spued.",
            "sent4": "The bad seafood made her spued uncontrollably, leading to embarrassment.",
            "sent5": "The flu caused him to spued repeatedly, leaving him weak and exhausted."
        },
        {
            "definition": "To emit or release in a rapid or sudden manner",
            "pos": "verb",
            "sent1": "The broken pipe spued steam, creating a dangerous situation.",
            "sent2": "The pressure cooker lid spued off with a loud bang, startling everyone.",
            "sent3": "The shaken soda can spued its contents all over the picnic blanket.",
            "sent4": "The burst balloon spued confetti, adding to the festive atmosphere.",
            "sent5": "The malfunctioning fire extinguisher spued foam unexpectedly, causing chaos."
        }
    ]
}