{
    "term": "spunkies",
    "meanings": [
        {
            "definition": "Full of spirit or determination",
            "pos": "adjective",
            "sent1": "She showed her spunkies attitude by never giving up.",
            "sent2": "The team's spunkies approach led them to victory.",
            "sent3": "Even the cat admired her spunkies determination to catch the mouse.",
            "sent4": "His spunkies spirit shone brightly in the face of adversity.",
            "sent5": "The spunkies energy of the puppy was contagious to everyone around."
        },
        {
            "definition": "A game of marbles",
            "pos": "noun",
            "sent1": "Let's play spunkies after school with our friends.",
            "sent2": "He won all the spunkies in the marble game.",
            "sent3": "The spunkies tournament was filled with laughter and fun.",
            "sent4": "The sound of spunkies hitting each other echoed in the playground.",
            "sent5": "The children's spunkies game of marbles lasted until sunset."
        },
        {
            "definition": "A type of small, brightly colored bird",
            "pos": "noun",
            "sent1": "The spunkies chirped cheerfully in the garden.",
            "sent2": "I saw a beautiful spunkies flying in the sky.",
            "sent3": "The spunkies bird stole a cherry from the tree.",
            "sent4": "Her dress was as colorful as a spunkies in the meadow.",
            "sent5": "The spunkies fluttered gracefully from branch to branch."
        },
        {
            "definition": "A type of small, round candy",
            "pos": "noun",
            "sent1": "She bought a bag of spunkies from the candy store.",
            "sent2": "The spunkies melted in his mouth, releasing a burst of flavor.",
            "sent3": "The spunkies candies were so sweet, they made her smile.",
            "sent4": "The jar on the counter was filled with spunkies of all colors.",
            "sent5": "The children's faces lit up when they received spunkies as a treat."
        }
    ]
}