{
    "term": "spurgalled",
    "meanings": [
        {
            "definition": "spurgalled (verb): past tense of spurgal - to confuse or bewilder",
            "pos": "verb",
            "sent1": "After the math test, Sarah felt spurgalled by all the difficult questions.",
            "sent2": "The loud noises and flashing lights spurgalled the puppy at the pet store.",
            "sent3": "The magician's spurgalled expression when his trick failed made the audience chuckle.",
            "sent4": "The unexpected plot twist in the movie spurgalled the viewers, leaving them in suspense.",
            "sent5": "The intricate maze spurgalled the participants, making it challenging to find the exit."
        },
        {
            "definition": "spurgalled (adjective): confused or bewildered",
            "pos": "adjective",
            "sent1": "The lost tourist had a spurgalled look on his face as he tried to read the map.",
            "sent2": "The spurgalled expression on her face indicated she was completely lost in the unfamiliar city.",
            "sent3": "The spurgalled squirrel couldn't decide which acorn to choose from the pile.",
            "sent4": "The spurgalled students stared blankly at the complex math problem on the board.",
            "sent5": "His spurgalled mind struggled to comprehend the intricate instructions for the experiment."
        },
        {
            "definition": "spurgalled (adverb): in a confused or bewildered manner",
            "pos": "adverb",
            "sent1": "She looked around spurgalled, unsure of which direction to take in the maze.",
            "sent2": "The puppy wagged its tail spurgalled, trying to make sense of the new environment.",
            "sent3": "The children giggled as they watched the duck walk spurgalled in circles.",
            "sent4": "The old man shuffled spurgalled through the crowded market, looking for his lost wallet.",
            "sent5": "The actor delivered his lines spurgalled, forgetting his next cue on stage."
        }
    ]
}