{
    "term": "sputtery",
    "meanings": [
        {
            "definition": "Making a series of short explosive sounds",
            "pos": "adjective",
            "sent1": "The sputtery engine finally started after a few tries.",
            "sent2": "The campfire was sputtery, sending sparks into the night sky.",
            "sent3": "The sputtery popcorn machine added a fun twist to movie night.",
            "sent4": "The sputtery rain on the roof sounded like a drumroll.",
            "sent5": "The sputtery fireworks lit up the dark sky with bursts of light."
        },
        {
            "definition": "Characterized by fits of sputtering",
            "pos": "adjective",
            "sent1": "His sputtery speech was hard to understand.",
            "sent2": "The old car had a sputtery engine that needed fixing.",
            "sent3": "The sputtery fountain in the park made everyone giggle.",
            "sent4": "Her sputtery singing voice added charm to the performance.",
            "sent5": "The sputtery candle flickered in the gentle breeze."
        },
        {
            "definition": "To make a series of short explosive sounds",
            "pos": "verb",
            "sent1": "The firecrackers sputtered loudly on New Year's Eve.",
            "sent2": "The bacon sputtered in the hot pan as it cooked.",
            "sent3": "The old radio sputtered to life, playing a nostalgic tune.",
            "sent4": "The fireworks sputtered and crackled in the night sky.",
            "sent5": "The candle sputtered out, leaving the room in darkness."
        },
        {
            "definition": "To speak in a halting or explosive manner",
            "pos": "verb",
            "sent1": "She sputtered her apology nervously, trying to explain.",
            "sent2": "The angry customer sputtered complaints to the manager.",
            "sent3": "He sputtered with laughter at the silly joke.",
            "sent4": "The politician sputtered through the difficult questions.",
            "sent5": "The child sputtered out the words, struggling to express himself."
        }
    ]
}