{
    "term": "sputter",
    "meanings": [
        {
            "definition": "To make a series of soft explosive sounds",
            "pos": "verb",
            "sent1": "The old car engine would sputter before finally starting.",
            "sent2": "The campfire began to sputter as the wood caught fire.",
            "sent3": "The sputtering toaster made breakfast more exciting.",
            "sent4": "His anger sputtered like a damp firework, never fully igniting.",
            "sent5": "The sputter of the fireworks lit up the night sky."
        },
        {
            "definition": "To speak in a hesitant or incoherent manner",
            "pos": "verb",
            "sent1": "She would sputter her lines nervously during the play.",
            "sent2": "The shy student would sputter when asked to present in class.",
            "sent3": "His sputtering explanation left everyone confused.",
            "sent4": "Her words sputtered out like a broken record.",
            "sent5": "The politician's speech sputtered as he tried to avoid questions."
        },
        {
            "definition": "A series of soft explosive sounds",
            "pos": "noun",
            "sent1": "The sudden sputter of fireworks startled the birds.",
            "sent2": "The rhythmic sputter of the rain on the roof was soothing.",
            "sent3": "The sputter of the old radio added to the eerie atmosphere.",
            "sent4": "The distant sputter of a motorcycle echoed through the valley.",
            "sent5": "The sputter of the engine signaled the start of the race."
        },
        {
            "definition": "A spray of small particles or liquid",
            "pos": "noun",
            "sent1": "The sputter of paint covered the walls in a messy pattern.",
            "sent2": "The chef added a final sputter of olive oil to the dish.",
            "sent3": "The sputter of water from the fountain created a refreshing mist.",
            "sent4": "The sputter of sparks flew from the welding torch.",
            "sent5": "The sputter of bubbles rose to the surface of the boiling pot."
        }
    ]
}