{
    "term": "squares",
    "meanings": [
        {
            "definition": "A four-sided figure with all sides of equal length and all angles of 90 degrees.",
            "pos": "noun",
            "sent1": "I drew colorful squares on the paper during art class.",
            "sent2": "The tiles on the floor were arranged in perfect squares.",
            "sent3": "The chef playfully arranged the vegetables in neat squares on the plate.",
            "sent4": "Her room was like a puzzle, with furniture fitting together like squares.",
            "sent5": "The farmer's field was a patchwork of green squares under the sun."
        },
        {
            "definition": "An open, typically four-sided area surrounded by buildings in a city or town.",
            "pos": "noun",
            "sent1": "The children played hopscotch in the small squares of the courtyard.",
            "sent2": "The bustling market was filled with colorful stalls in the squares.",
            "sent3": "The pigeons gathered in the town square, pecking at crumbs.",
            "sent4": "The city square was a hub of activity, with people coming and going.",
            "sent5": "The square was decorated with festive lights for the holiday season."
        },
        {
            "definition": "To make something square in shape or bring it into alignment with something else.",
            "pos": "verb",
            "sent1": "He carefully squares the corners of the wooden frame before nailing it.",
            "sent2": "She squared the book neatly on the shelf before leaving the room.",
            "sent3": "The tailor squared the fabric before cutting it for the dress.",
            "sent4": "The architect squared the blueprint to ensure precise measurements.",
            "sent5": "The carpenter squared the edges of the table for a perfect fit."
        },
        {
            "definition": "A person who is conventional or old-fashioned in their views.",
            "pos": "noun",
            "sent1": "She was known as the town square for her traditional values.",
            "sent2": "The old man was a square who preferred classic music over modern tunes.",
            "sent3": "The young artist found it amusing to be called a square by his friends.",
            "sent4": "In a world of circles, he stood out as a square with his beliefs.",
            "sent5": "The professor was considered a square for his strict adherence to rules."
        }
    ]
}