{
    "term": "squandered",
    "meanings": [
        {
            "definition": "To waste (money, time, resources) recklessly or foolishly.",
            "pos": "verb",
            "sent1": "She squandered all her savings on unnecessary items.",
            "sent2": "He squandered his inheritance on luxury cars and vacations.",
            "sent3": "The character in the story squandered his chance to win the race by stopping to tie his shoe.",
            "sent4": "The team squandered their lead in the final minutes of the game.",
            "sent5": "The student squandered his study time playing video games, leading to poor grades."
        },
        {
            "definition": "To spend extravagantly or wastefully.",
            "pos": "verb",
            "sent1": "The wealthy heiress squandered her fortune on designer clothes and expensive jewelry.",
            "sent2": "He squandered his bonus on a lavish party for his friends.",
            "sent3": "The king squandered the kingdom's treasury on elaborate banquets and unnecessary wars.",
            "sent4": "She squandered her talent by never practicing or honing her skills.",
            "sent5": "The company squandered its profits on unnecessary office renovations instead of investing in growth."
        },
        {
            "definition": "To fail to take advantage of an opportunity.",
            "pos": "verb",
            "sent1": "He squandered the chance to learn a new skill by procrastinating.",
            "sent2": "She squandered the opportunity to travel the world by staying home and watching TV.",
            "sent3": "The student squandered the extra credit assignment by forgetting to turn it in on time.",
            "sent4": "The entrepreneur squandered the potential partnership by not following up with the interested investor.",
            "sent5": "The team squandered the lead in the competition by underestimating their opponents and not giving their best effort."
        }
    ]
}