{
    "term": "squabbiest",
    "meanings": [
        {
            "definition": "Squabbiest (adjective): most quarrelsome or argumentative",
            "pos": "adjective",
            "sent1": "She is the squabbiest person in our group, always starting arguments over small things.",
            "sent2": "The squabbiest siblings in the neighborhood were known for their constant bickering.",
            "sent3": "The squabbiest ducks in the pond fought over the last piece of bread.",
            "sent4": "The squabbiest clouds in the sky seemed to argue about who would rain first.",
            "sent5": "The squabbiest cat in the house hissed at every little movement, ready to pick a fight."
        },
        {
            "definition": "Squabbiest (adverb): in a manner characterized by petty arguments or disputes",
            "pos": "adverb",
            "sent1": "They always spoke squabbiest, never agreeing on anything without a fight.",
            "sent2": "The neighbors argued squabbiest over the property line, never reaching a resolution.",
            "sent3": "The children played squabbiest, each wanting to be the leader of the game.",
            "sent4": "The politicians debated squabbiest, trying to score points rather than find solutions.",
            "sent5": "The siblings competed squabbiest in the annual family game night, each wanting to win at all costs."
        },
        {
            "definition": "Squabbiest (noun): the person or thing that is the most prone to quarrels or disputes",
            "pos": "noun",
            "sent1": "In the classroom, he was known as the squabbiest, always getting into arguments with classmates.",
            "sent2": "The squabbiest of the group was the one who initiated conflicts over trivial matters.",
            "sent3": "The squabbiest of the vegetables in the garden was the zucchini, always fighting for sunlight.",
            "sent4": "Among the animals, the squabbiest was the raccoon, known for its territorial disputes.",
            "sent5": "The squabbiest tree in the forest was the oak, constantly competing for space and resources with other plants."
        }
    ]
}