{
    "term": "square",
    "meanings": [
        {
            "definition": "A plane figure with four equal straight sides and four right angles.",
            "pos": "noun",
            "sent1": "I drew a square on my paper for the art project.",
            "sent2": "The tile floor was made up of many small squares.",
            "sent3": "The chef tried to make a square pancake, but it ended up looking like a circle.",
            "sent4": "Her face lit up with a smile as bright as a perfectly drawn square.",
            "sent5": "The square shape of the window made the room feel cozy and inviting."
        },
        {
            "definition": "An open, typically four-sided area surrounded by buildings in a city or town.",
            "pos": "noun",
            "sent1": "The town square was bustling with people enjoying the sunny day.",
            "sent2": "We sat on a bench in the middle of the square and watched the pigeons.",
            "sent3": "The square was transformed into an ice rink for the winter festival.",
            "sent4": "The square echoed with the sounds of street performers and laughter.",
            "sent5": "The lights of the square twinkled like stars in the night sky."
        },
        {
            "definition": "A tool used for measuring right angles.",
            "pos": "noun",
            "sent1": "The carpenter used a square to ensure the corners were perfect.",
            "sent2": "I borrowed a square from the toolbox to help with my geometry homework.",
            "sent3": "The mischievous cat knocked the square off the table and it rolled away.",
            "sent4": "The old square had markings from years of use, telling stories of past projects.",
            "sent5": "The shiny new square gleamed in the sunlight, ready for precise measurements."
        },
        {
            "definition": "To make something square in shape or position.",
            "pos": "verb",
            "sent1": "He tried to square the picture frame on the wall, but it kept tilting.",
            "sent2": "The carpenter needed to square the edges of the wooden block before gluing them together.",
            "sent3": "She asked him to square the tablecloth on the table before setting the dishes.",
            "sent4": "The gardener worked hard to square the flower bed into a perfect shape.",
            "sent5": "The architect had to square the building's foundation to ensure stability."
        },
        {
            "definition": "Honest and straightforward.",
            "pos": "adjective",
            "sent1": "She appreciated his square answer to her question.",
            "sent2": "The square businessman never cut corners in his dealings.",
            "sent3": "His square explanation left no room for confusion.",
            "sent4": "The square advice he gave was exactly what she needed to hear.",
            "sent5": "His square demeanor made him a trusted friend to all who knew him."
        }
    ]
}