{
    "term": "squabbler",
    "meanings": [
        {
            "definition": "A person who engages in petty arguments or disagreements.",
            "pos": "noun",
            "sent1": "The squabbler at school always argued about the smallest things.",
            "sent2": "My sister and I often act like squabblers over who gets the last cookie.",
            "sent3": "The two squabblers couldn't agree on the best flavor of ice cream.",
            "sent4": "The squabbler in the meeting made the atmosphere tense and uncomfortable.",
            "sent5": "The squabbler's constant bickering was like nails on a chalkboard.",
            "sent6": "During the game, the squabbler kept complaining about the rules.",
            "sent7": "At the family dinner, the squabbler insisted on arguing about politics.",
            "sent8": "The squabbler's stubbornness only made the situation worse.",
            "sent9": "The squabbler's constant interruptions disrupted the flow of the conversation.",
            "sent10": "The squabbler's behavior was childish and unnecessary."
        },
        {
            "definition": "To engage in a petty argument or disagreement.",
            "pos": "verb",
            "sent1": "Please don't squabble over who gets to sit in the front seat.",
            "sent2": "The siblings squabbled over which TV show to watch.",
            "sent3": "The children squabbled playfully over who would get to be the leader.",
            "sent4": "The neighbors squabbled about whose turn it was to mow the lawn.",
            "sent5": "The classmates squabbled over who would be the line leader for the day.",
            "sent6": "The team members squabbled about the best strategy to win the game.",
            "sent7": "The friends squabbled over which movie to watch at the sleepover.",
            "sent8": "The coworkers squabbled over who should take on the extra project.",
            "sent9": "The couple squabbled about where to go for their anniversary dinner.",
            "sent10": "The politicians squabbled during the debate, trying to make their points heard."
        }
    ]
}