{
    "term": "squeaks",
    "meanings": [
        {
            "definition": "A short, high-pitched sound or cry",
            "pos": "noun",
            "sent1": "The mouse made tiny squeaks as it scurried across the floor.",
            "sent2": "I heard the squeaks of the rusty door hinges as I opened the gate.",
            "sent3": "The baby's cute squeaks always make everyone smile.",
            "sent4": "The squeaks of the old wooden floorboards echoed through the empty house.",
            "sent5": "The high-pitched squeaks of the bats filled the night sky."
        },
        {
            "definition": "To make a short, high-pitched sound",
            "pos": "verb",
            "sent1": "The puppy squeaks when it wants to play.",
            "sent2": "She squeaks with excitement whenever she sees her favorite cartoon.",
            "sent3": "The balloon squeaks as it slowly deflates.",
            "sent4": "The rusty swing set squeaks with each back and forth motion.",
            "sent5": "The old bicycle squeaks as he pedals down the street."
        },
        {
            "definition": "A slight, high-pitched sound",
            "pos": "noun",
            "sent1": "The tiny squeaks of the birds could be heard in the early morning.",
            "sent2": "The wind made soft squeaks as it passed through the small gap in the window.",
            "sent3": "The squirrel's sneaky squeaks gave away its hiding spot.",
            "sent4": "The distant squeaks of the train signaled its arrival.",
            "sent5": "The quiet squeaks of the violin added a magical touch to the music."
        },
        {
            "definition": "To utter a short, high-pitched sound",
            "pos": "verb",
            "sent1": "She squeaks in surprise when she sees the birthday cake.",
            "sent2": "The rubber duck squeaks when squeezed in the bath.",
            "sent3": "The excited child squeaks with joy at the sight of the ice cream truck.",
            "sent4": "The mouse squeaks in fear as the cat approaches.",
            "sent5": "The rusty gate squeaks loudly as it is pushed open."
        }
    ]
}