{
    "term": "squeeze",
    "meanings": [
        {
            "definition": "To press firmly together",
            "pos": "verb",
            "sent1": "She had to squeeze the toothpaste tube to get the last bit out.",
            "sent2": "He likes to squeeze the stress ball when he feels anxious.",
            "sent3": "The clown tried to squeeze into the tiny car with all his friends.",
            "sent4": "Her heart felt like it was being squeezed when she saw the puppy in the shelter.",
            "sent5": "The chef's secret to tender meat is to squeeze lemon juice over it before cooking."
        },
        {
            "definition": "A tight grip or hug",
            "pos": "noun",
            "sent1": "The child gave her teddy bear a tight squeeze before going to bed.",
            "sent2": "He felt the warm squeeze of his grandmother's embrace.",
            "sent3": "The tree branches seemed to give each other a friendly squeeze in the wind.",
            "sent4": "The old book had a comforting smell that brought a nostalgic squeeze to her heart.",
            "sent5": "The squeeze of the handshake showed his sincerity and strength."
        },
        {
            "definition": "To extract by applying pressure",
            "pos": "verb",
            "sent1": "She had to squeeze the juice from the orange to make fresh juice.",
            "sent2": "He carefully squeezed the sponge to remove excess water.",
            "sent3": "The magician tried to squeeze a rabbit out of his hat, but only a carrot appeared.",
            "sent4": "The detective managed to squeeze the truth out of the suspect during interrogation.",
            "sent5": "The chef demonstrated how to squeeze the garlic cloves to release their flavor."
        },
        {
            "definition": "A crowded or confined space",
            "pos": "noun",
            "sent1": "The subway during rush hour felt like a tight squeeze.",
            "sent2": "The elevator was a squeeze with so many people trying to fit in.",
            "sent3": "The tiny room was a cozy squeeze for the family during the storm.",
            "sent4": "The concert hall was a squeeze with fans eager to see their favorite band.",
            "sent5": "The backpack was a tight squeeze in the overhead compartment of the plane."
        },
        {
            "definition": "To force one's way through a narrow space",
            "pos": "verb",
            "sent1": "The cat tried to squeeze through the small gap in the fence.",
            "sent2": "He had to squeeze through the crowd to get to the front of the line.",
            "sent3": "The adventurous explorer managed to squeeze through the cave opening.",
            "sent4": "She felt like she had to squeeze through the challenges to reach her goal.",
            "sent5": "The determined squirrel tried to squeeze through the bird feeder to get to the seeds."
        }
    ]
}