{
    "term": "squeamishnesses",
    "meanings": [
        {
            "definition": "The state or quality of being easily disgusted or nauseated.",
            "pos": "noun",
            "sent1": "Her squeamishnesses made it hard for her to watch horror movies.",
            "sent2": "His squeamishnesses towards blood made him faint at the sight of a small cut.",
            "sent3": "Despite his squeamishnesses, he bravely faced the challenge of cleaning up after the messy party.",
            "sent4": "The strong smell of the garbage triggered her squeamishnesses like a sudden storm.",
            "sent5": "The chef's squeamishnesses about food safety were evident in his meticulous kitchen habits."
        },
        {
            "definition": "A feeling of discomfort or queasiness.",
            "pos": "noun",
            "sent1": "After eating the expired food, he felt squeamishnesses in his stomach.",
            "sent2": "The long car ride left her with a sense of squeamishnesses.",
            "sent3": "The unexpected plot twist in the movie caused a wave of squeamishnesses among the audience.",
            "sent4": "The eerie silence of the abandoned house gave him a sense of squeamishnesses creeping up his spine.",
            "sent5": "The roller coaster ride induced squeamishnesses in her that she had never experienced before."
        },
        {
            "definition": "A tendency to be overly sensitive or easily offended.",
            "pos": "noun",
            "sent1": "His squeamishnesses towards criticism often hindered his personal growth.",
            "sent2": "She had to be careful with her words around him due to his squeamishnesses.",
            "sent3": "Despite his friend's teasing, his squeamishnesses remained intact.",
            "sent4": "The politician's squeamishnesses towards controversial topics limited his ability to connect with voters.",
            "sent5": "Her squeamishnesses about discussing personal matters made it challenging for her to open up to others."
        }
    ]
}