{
    "term": "squelchy",
    "meanings": [
        {
            "definition": "Making a squelching sound",
            "pos": "adjective",
            "sent1": "The squelchy mud made a funny noise.",
            "sent2": "Her squelchy shoes left marks on the floor.",
            "sent3": "The squelchy mud seemed to giggle as we walked through it.",
            "sent4": "The squelchy sound of the mud was like a chorus of tiny frogs.",
            "sent5": "The squelchy noise echoed in the quiet forest."
        },
        {
            "definition": "Soft and wet, making a sucking sound",
            "pos": "adjective",
            "sent1": "The squelchy sponge absorbed all the water.",
            "sent2": "His squelchy socks were uncomfortable to wear.",
            "sent3": "The squelchy ground felt like a giant sponge.",
            "sent4": "The squelchy mud swallowed my shoe like a hungry monster.",
            "sent5": "The squelchy feeling of the wet sand between my toes was oddly satisfying."
        },
        {
            "definition": "To make a squelching sound",
            "pos": "verb",
            "sent1": "I squelched through the puddles on my way home.",
            "sent2": "The grapes squelched as I stepped on them.",
            "sent3": "The clown squelched his big shoes on purpose to make us laugh.",
            "sent4": "Her heart squelched with joy when she heard the good news.",
            "sent5": "The old door squelched loudly when I opened it."
        },
        {
            "definition": "Soft and wet, making a sucking sound",
            "pos": "adjective",
            "sent1": "The squelchy mud oozed between my toes.",
            "sent2": "The squelchy ground made it hard to walk.",
            "sent3": "The squelchy pudding wobbled on the plate.",
            "sent4": "The squelchy feeling of the wet grass was oddly comforting.",
            "sent5": "The squelchy sound of the wet leaves underfoot was like nature's music."
        }
    ]
}