{
    "term": "squeaking",
    "meanings": [
        {
            "definition": "Making a high-pitched sound",
            "pos": "adjective",
            "sent1": "The tiny mouse let out a squeaking noise.",
            "sent2": "The old door hinges were squeaking loudly.",
            "sent3": "The squeaking toy car entertained the baby for hours.",
            "sent4": "The squeaking brakes signaled the need for maintenance.",
            "sent5": "The squeaking violin added a unique touch to the music."
        },
        {
            "definition": "To utter a high-pitched sound",
            "pos": "verb",
            "sent1": "The puppy loves to squeaking when playing with its toy.",
            "sent2": "She was squeaking with excitement when she saw the surprise.",
            "sent3": "The squeaking bird outside woke me up early.",
            "sent4": "His shoes were squeaking on the polished floor as he walked.",
            "sent5": "The old chair kept squeaking every time someone sat on it."
        },
        {
            "definition": "High-pitched sound made by something being rubbed or pressed",
            "pos": "noun",
            "sent1": "The constant squeaking of the swing set filled the park.",
            "sent2": "The annoying squeaking of the door hinge needed oiling.",
            "sent3": "The squeaking of the rubber duck in the bath made her smile.",
            "sent4": "The squeaking of the chalk on the blackboard was unbearable.",
            "sent5": "The mysterious squeaking in the attic gave them chills."
        },
        {
            "definition": "To barely succeed or pass in a competition or test",
            "pos": "verb",
            "sent1": "She was squeaking by with just enough points to pass.",
            "sent2": "The team was squeaking through to the finals with a close win.",
            "sent3": "He was squeaking through the math exam with a bit of luck.",
            "sent4": "The student was squeaking by in the class with extra credit.",
            "sent5": "The car was squeaking past the finish line in the race."
        }
    ]
}