{
    "term": "squibbers",
    "meanings": [
        {
            "definition": "A person who writes or sells squibs.",
            "pos": "noun",
            "sent1": "The squibbers at the market had a variety of funny jokes for sale.",
            "sent2": "I heard the squibbers at the fair were selling out of their clever puns.",
            "sent3": "The squibbers decided to have a contest to see who could come up with the silliest joke.",
            "sent4": "The squibbers' words were like tiny sparks that lit up the room with laughter.",
            "sent5": "The squibbers' creativity knew no bounds as they crafted witty one-liners."
        },
        {
            "definition": "A small firework that burns with a hissing noise before exploding.",
            "pos": "noun",
            "sent1": "The children were excited to set off the colorful squibbers during the celebration.",
            "sent2": "The squibbers lit up the night sky with their bright colors and crackling sounds.",
            "sent3": "The squibbers added a festive touch to the party with their sparkling display.",
            "sent4": "The squibbers' pops and crackles echoed through the valley, signaling the start of the festivities.",
            "sent5": "The squibbers' dazzling lights mesmerized the crowd as they burst into the air."
        },
        {
            "definition": "To write or publish squibs.",
            "pos": "verb",
            "sent1": "She squibbers her witty remarks on social media for all to enjoy.",
            "sent2": "He squibbers his humorous anecdotes in a weekly column for the local newspaper.",
            "sent3": "The author decided to squibbers a series of short stories to entertain her readers.",
            "sent4": "Their words squibbers through the air, leaving a trail of laughter in their wake.",
            "sent5": "The comedian squibbers his jokes with perfect timing, always getting a good laugh."
        }
    ]
}