{
    "term": "squibbing",
    "meanings": [
        {
            "definition": "A small firework that burns with a hissing sound before exploding.",
            "pos": "noun",
            "sent1": "During the celebration, we watched a colorful squibbing light up the night sky.",
            "sent2": "The children were excited to see the squibbing display at the fireworks show.",
            "sent3": "The squibbing unexpectedly startled the cat, making it jump in surprise.",
            "sent4": "The squibbing in the distance added a magical touch to the festive atmosphere.",
            "sent5": "The squibbing's bright colors and loud crackle captivated the audience."
        },
        {
            "definition": "The act of writing or producing something quickly and without much effort.",
            "pos": "noun",
            "sent1": "Her squibbing of the report was evident from the lack of detail and depth.",
            "sent2": "He was known for his last-minute squibbing of essays, often resulting in lower grades.",
            "sent3": "The comedian's squibbing of jokes had the audience laughing uncontrollably.",
            "sent4": "The student's squibbing of the project was like throwing together random ideas.",
            "sent5": "The rushed squibbing of the play script left out crucial scenes and character development."
        },
        {
            "definition": "A short, satirical piece of writing or performance.",
            "pos": "noun",
            "sent1": "The newspaper published a hilarious squibbing poking fun at current events.",
            "sent2": "The comedian delivered a brilliant squibbing that had the audience in stitches.",
            "sent3": "His squibbing of the political situation cleverly highlighted the absurdity of it all.",
            "sent4": "The satirical squibbing on social media quickly went viral for its sharp wit.",
            "sent5": "The student's squibbing of the school rules was a creative way to address issues humorously."
        }
    ]
}