{
    "term": "squill",
    "meanings": [
        {
            "definition": "A Mediterranean plant with a bulb used in medicine.",
            "pos": "noun",
            "sent1": "The squill plant grows in the warm Mediterranean region.",
            "sent2": "The herbalist used squill in the medicine to help with coughs.",
            "sent3": "The squill bulb decided to take a vacation from being a medicine ingredient.",
            "sent4": "Her laughter was like the unexpected bloom of a squill plant in the desert.",
            "sent5": "The scent of squill filled the room, calming everyone instantly."
        },
        {
            "definition": "A preparation made from the bulb of the squill plant, used as a diuretic and expectorant.",
            "pos": "noun",
            "sent1": "The doctor prescribed a squill syrup to help with the cough.",
            "sent2": "She bought a bottle of squill from the pharmacy for her cold.",
            "sent3": "The squill potion made the cat meow in a funny way.",
            "sent4": "The squill elixir worked like magic, clearing her lungs in no time.",
            "sent5": "The taste of squill lingered in her mouth, reminding her of its healing power."
        },
        {
            "definition": "A bulb of the squill plant.",
            "pos": "noun",
            "sent1": "The squill bulb was carefully harvested for its medicinal properties.",
            "sent2": "She planted the squill bulb in the garden to watch it grow.",
            "sent3": "The squill bulb rolled off the table and onto the floor, surprising everyone.",
            "sent4": "Her ideas bloomed like a squill bulb, unexpected yet beautiful.",
            "sent5": "The squill bulb glowed in the sunlight, a symbol of hope and healing."
        },
        {
            "definition": "A white crystalline compound obtained from the bulb of the squill plant, used in medicine.",
            "pos": "noun",
            "sent1": "The pharmacist mixed the squill extract into the cough syrup.",
            "sent2": "The squill compound was known for its potent medicinal properties.",
            "sent3": "The squill crystal sparkled like a diamond in the sunlight.",
            "sent4": "Her eyes shone bright, reflecting the purity of a squill crystal.",
            "sent5": "The squill compound dissolved instantly, releasing its healing magic."
        }
    ]
}