{
    "term": "squib",
    "meanings": [
        {
            "definition": "A small firework that burns with a hissing sound before exploding.",
            "pos": "noun",
            "sent1": "During the celebration, we lit a squib that sparkled brightly in the night sky.",
            "sent2": "The children were excited to see the colorful squib burst into a shower of sparks.",
            "sent3": "The squib fizzled out unexpectedly, causing laughter among the spectators.",
            "sent4": "Her laughter was like a squib, starting softly before erupting into full-blown merriment.",
            "sent5": "The squib's crackling sound echoed through the quiet evening, creating a magical atmosphere."
        },
        {
            "definition": "A short piece of satirical writing.",
            "pos": "noun",
            "sent1": "The author's squib cleverly criticized the government's policies in a humorous way.",
            "sent2": "She enjoyed reading satirical squibs that made her chuckle at the absurdity of society.",
            "sent3": "The squib about the clumsy politician was so witty that it went viral online.",
            "sent4": "His sharp squib on social media exposed the hypocrisy of influencers.",
            "sent5": "The squib's humor hit the mark, leaving everyone in stitches with its clever commentary."
        },
        {
            "definition": "A small explosive device used for blasting.",
            "pos": "noun",
            "sent1": "The engineer carefully placed the squib to trigger the controlled explosion.",
            "sent2": "The miners relied on squibs to break through the tough rock underground.",
            "sent3": "The squib detonated with a loud bang, signaling the start of the construction work.",
            "sent4": "The squib's power shattered the boulder into smaller pieces with precision.",
            "sent5": "The controlled blast from the squib cleared the path for the workers to proceed safely."
        }
    ]
}