{
    "term": "squidding",
    "meanings": [
        {
            "definition": "The act of catching squid for sport or food.",
            "pos": "noun",
            "sent1": "We went squidding at the beach and caught some delicious squid for dinner.",
            "sent2": "Squidding is a popular activity in coastal towns where people enjoy catching squid.",
            "sent3": "While squidding, we accidentally caught an old boot instead of a squid!",
            "sent4": "His squidding skills were so sharp, he could catch a squid in seconds.",
            "sent5": "The smell of the ocean and the thrill of squidding will always be memorable."
        },
        {
            "definition": "The practice of using a squid-like fishing lure.",
            "pos": "noun",
            "sent1": "He bought a new squidding lure to attract more fish on his fishing trips.",
            "sent2": "Squidding lures come in various colors and sizes to mimic real squid in the water.",
            "sent3": "The fisherman chuckled as he saw the tiny fish trying to nibble on the squidding lure.",
            "sent4": "Her squidding lure danced in the water, enticing the fish with its realistic movements.",
            "sent5": "The shiny squidding lure shimmered under the sunlight, catching the fish's attention."
        },
        {
            "definition": "The act of engaging in squid-like behavior or movements.",
            "pos": "noun",
            "sent1": "The children were squidding around the playground, pretending to be squid swimming in the sea.",
            "sent2": "Squidding involves imitating the graceful movements of a squid in the water.",
            "sent3": "During the party, they started squidding by wiggling their arms like tentacles.",
            "sent4": "The dancers moved on the stage, squidding in perfect harmony with each other.",
            "sent5": "The yoga instructor asked the class to practice squidding poses to improve flexibility."
        }
    ]
}