{
    "term": "stagette",
    "meanings": [
        {
            "definition": "A party or celebration held for a woman who is about to get married.",
            "pos": "noun",
            "sent1": "The stagette was filled with laughter and joy as friends celebrated the bride-to-be.",
            "sent2": "She invited all her friends to the stagette to have a fun time before her wedding.",
            "sent3": "At the stagette, they played games and shared stories, making it a memorable night.",
            "sent4": "The stagette was a colorful event, like a bouquet of flowers in full bloom.",
            "sent5": "The stagette sparkled with excitement, like a diamond in the evening light."
        },
        {
            "definition": "A gathering of female friends and family members to celebrate a bride-to-be.",
            "pos": "noun",
            "sent1": "The stagette brought together all the important women in her life to celebrate.",
            "sent2": "They decorated the venue beautifully for the stagette to honor the bride-to-be.",
            "sent3": "During the stagette, they shared funny stories and jokes, creating a warm atmosphere.",
            "sent4": "The stagette was a tapestry of love and friendship woven around the bride-to-be.",
            "sent5": "The stagette shone with happiness, like a star in the night sky."
        },
        {
            "definition": "A bachelorette party.",
            "pos": "noun",
            "sent1": "The stagette was a night of fun and laughter for the bride-to-be and her friends.",
            "sent2": "They surprised her with a special cake at the stagette to mark the occasion.",
            "sent3": "During the stagette, they danced like nobody was watching, enjoying every moment.",
            "sent4": "The stagette was a whirlwind of excitement, like a carnival in full swing.",
            "sent5": "The stagette glowed with happiness, like a candle in the dark."
        }
    ]
}