{
    "term": "stalkerazzi",
    "meanings": [
        {
            "definition": "A person who obsessively follows and harasses celebrities for photographs or information.",
            "pos": "noun",
            "sent1": "The stalkerazzi waited outside the celebrity's house all day.",
            "sent2": "The stalkerazzi crowded around the famous actor, trying to get a picture.",
            "sent3": "The stalkerazzi accidentally tripped over each other while chasing the singer.",
            "sent4": "The stalkerazzi's cameras were like hungry wolves, always ready to snap a shot.",
            "sent5": "The stalkerazzi's presence felt suffocating to the star, like a swarm of bees buzzing around."
        },
        {
            "definition": "The act of stalking or harassing celebrities for personal gain.",
            "pos": "noun",
            "sent1": "The stalkerazzi's behavior was unacceptable and invasive.",
            "sent2": "The stalkerazzi's relentless pursuit of gossip led to many scandals.",
            "sent3": "The stalkerazzi's antics sometimes seemed more like a comedy show.",
            "sent4": "The stalkerazzi's actions painted a dark shadow over the world of fame.",
            "sent5": "The stalkerazzi's motives were as clear as a glass window, always seeking a story to sell."
        },
        {
            "definition": "The paparazzi who engage in stalking behavior towards celebrities.",
            "pos": "noun",
            "sent1": "The stalkerazzi's aggressive tactics made the celebrities feel unsafe.",
            "sent2": "The stalkerazzi's constant presence made the stars wary of their every move.",
            "sent3": "The stalkerazzi's obsession with the famous was almost comical at times.",
            "sent4": "The stalkerazzi's lenses were like sharp eyes always watching for a slip-up.",
            "sent5": "The stalkerazzi's actions were like a dark cloud looming over the glamorous events."
        }
    ]
}