{
    "term": "stamp",
    "meanings": [
        {
            "definition": "A small piece of paper with a design on it that is stuck onto a letter or package before it is posted",
            "pos": "noun",
            "sent1": "I put a stamp on the envelope to mail the letter.",
            "sent2": "The stamp on the package showed a beautiful flower.",
            "sent3": "The stamp on the letter made it look special.",
            "sent4": "Her smile was like a stamp that brightened up the room.",
            "sent5": "The stamp with the puppy was so cute!"
        },
        {
            "definition": "To bring down (one's foot) heavily on the ground or on something on the ground",
            "pos": "verb",
            "sent1": "He had to stamp his foot to get the mud off.",
            "sent2": "The dancer would stamp her feet to the beat of the music.",
            "sent3": "The angry toddler would stamp his feet when he didn't get his way.",
            "sent4": "The storm would stamp its authority on the land with thunder and lightning.",
            "sent5": "The teacher's voice would stamp out any noise in the classroom."
        },
        {
            "definition": "A device for stamping a design on something",
            "pos": "noun",
            "sent1": "The stamp made a perfect pattern on the paper.",
            "sent2": "She used the stamp to mark her books with her name.",
            "sent3": "The stamp was like a magical tool for creating art.",
            "sent4": "The stamp acted like a mini artist, leaving its mark everywhere.",
            "sent5": "The stamp pressed down with precision to create the image."
        },
        {
            "definition": "To mark with a stamp",
            "pos": "verb",
            "sent1": "He would stamp his initials on the document.",
            "sent2": "The craftsman would stamp his logo on each piece he made.",
            "sent3": "She would stamp her approval on the project with a smile.",
            "sent4": "The memory of that day would stamp itself in his mind forever.",
            "sent5": "The sun would stamp its warmth on the earth each morning."
        },
        {
            "definition": "A small piece of paper with a design on it that is stuck onto a letter or package before it is posted",
            "pos": "noun",
            "sent1": "The stamp on the postcard was of a famous landmark.",
            "sent2": "She collected stamps from different countries.",
            "sent3": "The stamp on the package was like a little piece of art.",
            "sent4": "The stamp on the letter was a token of friendship.",
            "sent5": "The stamp on the envelope was colorful and bright."
        }
    ]
}