{
    "term": "stamps",
    "meanings": [
        {
            "definition": "A small adhesive piece of paper used to send mail",
            "pos": "noun",
            "sent1": "I put a stamp on the letter before mailing it.",
            "sent2": "The stamp on the envelope showed a picture of a flower.",
            "sent3": "The stamp on the package made it look official.",
            "sent4": "Her collection of stamps was like a colorful mosaic.",
            "sent5": "The stamp with the airplane made me dream of traveling."
        },
        {
            "definition": "To bring down (one's foot) heavily on the ground or a particular object",
            "pos": "verb",
            "sent1": "He stamps his feet when he's angry.",
            "sent2": "The dancer stamps her feet to the beat of the music.",
            "sent3": "The toddler stamps his feet in a tantrum.",
            "sent4": "The hammer stamps the nail firmly into the wood.",
            "sent5": "The elephant stamps the ground with its massive foot."
        },
        {
            "definition": "A distinctive characteristic or quality",
            "pos": "noun",
            "sent1": "Her kindness is her most remarkable stamp.",
            "sent2": "The artist's work bears his unique stamp.",
            "sent3": "His sense of humor is his personal stamp on everything.",
            "sent4": "The old house had the stamp of elegance in every detail.",
            "sent5": "The stamp of excellence was evident in her performance."
        },
        {
            "definition": "To impress a pattern or mark onto a surface",
            "pos": "verb",
            "sent1": "She stamps the design onto the fabric with ink.",
            "sent2": "The blacksmith stamps his initials on the metalwork.",
            "sent3": "The baker stamps the logo on each loaf of bread.",
            "sent4": "The potter stamps a unique symbol on each piece.",
            "sent5": "The artist stamps her signature on the painting."
        },
        {
            "definition": "To mark with a postage stamp",
            "pos": "verb",
            "sent1": "He stamps the letter with the official seal.",
            "sent2": "She carefully stamps each envelope with the postage mark.",
            "sent3": "The clerk stamps the package with the date.",
            "sent4": "The post office stamps the parcel with the tracking number.",
            "sent5": "The collector stamps the rare stamp with caution."
        }
    ]
}