{
    "term": "stand",
    "meanings": [
        {
            "definition": "To be in an upright position on the feet.",
            "pos": "verb",
            "sent1": "I stand up when I want to reach something high.",
            "sent2": "She likes to stand by the window and watch the birds.",
            "sent3": "The toy soldier couldn't stand still, always falling over.",
            "sent4": "His determination to stand tall in the face of adversity inspired others.",
            "sent5": "The image of the lone tree standing against the storm was powerful."
        },
        {
            "definition": "To take a position or remain firm in support of something.",
            "pos": "verb",
            "sent1": "I stand with my friend when they need me.",
            "sent2": "The community decided to stand together against injustice.",
            "sent3": "The book characters stand up for what they believe in.",
            "sent4": "Her principles make her stand out among her peers.",
            "sent5": "The foundation of their friendship is their ability to stand by each other."
        },
        {
            "definition": "A structure on which something can be placed.",
            "pos": "noun",
            "sent1": "The cake was displayed on a beautiful stand.",
            "sent2": "She bought a new plant stand for her garden.",
            "sent3": "The stand at the fair collapsed under the weight of the prizes.",
            "sent4": "The stand held up the heavy books without any issue.",
            "sent5": "The stand was carefully crafted from sturdy wood."
        },
        {
            "definition": "A group of trees or plants growing closely together.",
            "pos": "noun",
            "sent1": "The forest was filled with a stand of tall trees.",
            "sent2": "The botanical garden had a stand of colorful flowers.",
            "sent3": "The stand of bamboo swayed gently in the breeze.",
            "sent4": "The stand of pines provided a cool shade on hot days.",
            "sent5": "The stand of sunflowers brightened up the field."
        }
    ]
}