{
    "term": "standardised",
    "meanings": [
        {
            "definition": "Conforming to a standard or set of standards.",
            "pos": "adjective",
            "sent1": "The teacher required all students to use standardised paper for their assignments.",
            "sent2": "The company implemented standardised procedures to ensure consistency in their products.",
            "sent3": "The standardised test was so predictable that even the class clown aced it.",
            "sent4": "Her standardised approach to problem-solving made her the go-to person in the team.",
            "sent5": "The standardised color-coding system helped everyone easily identify the different components."
        },
        {
            "definition": "To make something conform to a standard.",
            "pos": "verb",
            "sent1": "The manufacturer standardised the packaging to meet industry regulations.",
            "sent2": "She standardised the font size across all documents for better readability.",
            "sent3": "He jokingly standardised his morning routine to include exactly three cups of coffee.",
            "sent4": "The coach standardised the training program to improve the team's performance.",
            "sent5": "The chef standardised the recipe to ensure consistent taste in every dish."
        },
        {
            "definition": "Established or widely accepted as a model or example.",
            "pos": "adjective",
            "sent1": "The standardised design of the logo became instantly recognizable.",
            "sent2": "Her standardised approach to customer service set a new benchmark in the industry.",
            "sent3": "The comedian's standardised jokes always left the audience in stitches.",
            "sent4": "His standardised leadership style inspired trust and loyalty among his team.",
            "sent5": "The standardised safety protocols prevented accidents in the workplace."
        }
    ]
}