{
    "term": "starters",
    "meanings": [
        {
            "definition": "A person or thing that starts.",
            "pos": "noun",
            "sent1": "The starters in a race line up at the beginning.",
            "sent2": "The teacher asked the class who the starters were for the project.",
            "sent3": "The starters for the relay race were all eager to begin.",
            "sent4": "As the starters of the marathon, they set off with determination.",
            "sent5": "The starters of the concert were the youngest musicians, full of energy."
        },
        {
            "definition": "A first course of a meal.",
            "pos": "noun",
            "sent1": "The restaurant's starters included soup and salad options.",
            "sent2": "I always enjoy the starters more than the main course.",
            "sent3": "The starters at the dinner party disappeared quickly.",
            "sent4": "The starters were like a preview of the delicious meal to come.",
            "sent5": "The starters were so tasty that I almost filled up on them alone."
        },
        {
            "definition": "A device used to start an engine.",
            "pos": "noun",
            "sent1": "The mechanic checked the starters in the car to ensure they were working.",
            "sent2": "The old truck needed a new set of starters to turn on.",
            "sent3": "The starters in the boat engine needed replacement after years of use.",
            "sent4": "The starters in the generator were crucial during the power outage.",
            "sent5": "The starters in the lawnmower made it easy to begin yard work."
        },
        {
            "definition": "A player in a sports game who starts the game.",
            "pos": "noun",
            "sent1": "The coach announced the starters for the basketball game.",
            "sent2": "Being one of the starters in the soccer match was a great honor.",
            "sent3": "The starters on the football team were determined to win the game.",
            "sent4": "The starters in the baseball game had been practicing hard all week.",
            "sent5": "The starters in the volleyball match were ready to spike and serve."
        }
    ]
}