{
    "term": "starkers",
    "meanings": [
        {
            "definition": "Completely naked",
            "pos": "adjective",
            "sent1": "The baby ran around the house starkers after his bath.",
            "sent2": "The streaker was caught running starkers across the football field.",
            "sent3": "It was quite a sight to see the dog go starkers after rolling in the mud.",
            "sent4": "The starkers truth of the situation left everyone speechless.",
            "sent5": "The starkers mountain peak stood tall against the clear sky."
        },
        {
            "definition": "Completely unclothed",
            "pos": "adjective",
            "sent1": "The model posed for the painting starkers in the art studio.",
            "sent2": "The swimmer dove into the pool starkers, ready for the race.",
            "sent3": "The statue in the park looked like it had gone starkers overnight.",
            "sent4": "The starkers branches of the tree reached out towards the sky.",
            "sent5": "The starkers room echoed with emptiness after the furniture was removed."
        },
        {
            "definition": "Completely exposed",
            "pos": "adjective",
            "sent1": "The spy felt starkers under the bright spotlight during interrogation.",
            "sent2": "The secret document lay on the table starkers for all to see.",
            "sent3": "The cake was left starkers on the kitchen counter, tempting the hungry cat.",
            "sent4": "The starkers truth about the company's finances was finally revealed.",
            "sent5": "The starkers landscape stretched out before us, vast and open."
        },
        {
            "definition": "Completely bare",
            "pos": "adjective",
            "sent1": "The garden looked starkers in the winter without any flowers.",
            "sent2": "The field appeared starkers after the harvest, ready for the next planting season.",
            "sent3": "The bookshelf stood starkers after all the books were removed for donation.",
            "sent4": "The starkers branches of the tree swayed in the wind, devoid of leaves.",
            "sent5": "The starkers truth of the matter could no longer be ignored."
        }
    ]
}