{
    "term": "starving",
    "meanings": [
        {
            "definition": "Suffering or dying from hunger",
            "pos": "adjective",
            "sent1": "The starving child looked weak and frail.",
            "sent2": "After not eating for days, he felt incredibly starving.",
            "sent3": "The dog gave me a starving look as I ate my sandwich.",
            "sent4": "Her eyes were like two starving flames, consuming everything in their path.",
            "sent5": "The image of the starving child haunted her dreams."
        },
        {
            "definition": "Extremely hungry",
            "pos": "adjective",
            "sent1": "I was so starving after the long hike.",
            "sent2": "The smell of freshly baked bread made me even more starving.",
            "sent3": "He jokingly said he was so starving he could eat a horse.",
            "sent4": "The anticipation of dinner made her feel like a starving lion waiting to pounce.",
            "sent5": "The starving feeling gnawed at his stomach relentlessly."
        },
        {
            "definition": "Desiring food",
            "pos": "adjective",
            "sent1": "The aroma of the pie left her feeling starving.",
            "sent2": "She was always starving for her favorite chocolate cake.",
            "sent3": "The sight of the buffet made him feel like a starving bear ready to feast.",
            "sent4": "Her eyes lingered on the dessert menu, a starving longing in them.",
            "sent5": "The thought of ice cream left her mouth watering and starving for a scoop."
        },
        {
            "definition": "Lacking in something essential or important",
            "pos": "adjective",
            "sent1": "The team's defense was starving for a strong leader.",
            "sent2": "The project was struggling, starving for fresh ideas.",
            "sent3": "His wardrobe was starving for some colorful additions.",
            "sent4": "The garden was like a starving desert, devoid of any greenery.",
            "sent5": "The room felt empty, starving for some decorations to liven it up."
        }
    ]
}