{
    "term": "starter",
    "meanings": [
        {
            "definition": "A person or thing that starts something.",
            "pos": "noun",
            "sent1": "The teacher was the starter of the school play.",
            "sent2": "The alarm clock is a helpful starter for my day.",
            "sent3": "The little robot was a funny starter for the race.",
            "sent4": "Her smile was the starter of joy in the room.",
            "sent5": "The key is the starter to unlock the mystery."
        },
        {
            "definition": "A device for starting an engine.",
            "pos": "noun",
            "sent1": "The key is the starter for the car engine.",
            "sent2": "The button on the lawnmower is the starter for the motor.",
            "sent3": "The red button looked like a playful starter for the machine.",
            "sent4": "The ignition is the starter that brings the car to life.",
            "sent5": "The pull cord acts as the starter to begin the generator."
        },
        {
            "definition": "A first course in a meal.",
            "pos": "noun",
            "sent1": "The salad was a tasty starter before the main course.",
            "sent2": "Bread and butter are common starters at a restaurant.",
            "sent3": "The soup was a surprising starter for breakfast.",
            "sent4": "The appetizer was the starter that whetted our appetites.",
            "sent5": "The fruit platter served as a refreshing starter for the meal."
        },
        {
            "definition": "A culture of yeast used in making bread or beer.",
            "pos": "noun",
            "sent1": "The baker added the starter to the dough for the bread.",
            "sent2": "The brewery carefully maintains the starter for the beer.",
            "sent3": "The yeast mixture bubbled like a lively starter in the bowl.",
            "sent4": "The starter is the secret ingredient for the perfect loaf.",
            "sent5": "The starter gives the bread its unique flavor and texture."
        }
    ]
}