{
    "term": "starved",
    "meanings": [
        {
            "definition": "Suffering or dying from lack of food",
            "pos": "noun",
            "sent1": "The poor dog looked so starved, with its ribs showing.",
            "sent2": "The refugees were in a state of starvation, desperate for any food.",
            "sent3": "The comedy show featured a skit about a starved person finding a buffet.",
            "sent4": "Her love for him was like a starved person's craving for sustenance.",
            "sent5": "The image of the starved child haunted her dreams."
        },
        {
            "definition": "Extremely hungry",
            "pos": "adjective",
            "sent1": "After the long hike, they were all starved and ready for a big meal.",
            "sent2": "The smell of freshly baked bread made her feel even more starved.",
            "sent3": "He joked that he was so starved he could eat a whole cow.",
            "sent4": "The starved lion pounced on its prey with ferocious hunger.",
            "sent5": "The starved artist painted with a passion fueled by hunger."
        },
        {
            "definition": "Deprived of something essential or important",
            "pos": "adjective",
            "sent1": "The neglected plant looked starved for sunlight and water.",
            "sent2": "She felt starved of affection after her breakup.",
            "sent3": "The starved library was in desperate need of new books.",
            "sent4": "His soul felt starved for creativity in the mundane routine.",
            "sent5": "The starved community yearned for unity and support."
        },
        {
            "definition": "Lacking in a particular nutrient or element",
            "pos": "adjective",
            "sent1": "The soil in the garden seemed starved of nutrients, affecting plant growth.",
            "sent2": "Her hair appeared starved of moisture, looking dry and brittle.",
            "sent3": "The starved recipe was missing a key ingredient, altering the taste.",
            "sent4": "The starved ecosystem struggled due to a lack of biodiversity.",
            "sent5": "The starved engine sputtered due to a lack of oil."
        }
    ]
}