{
    "term": "statutory",
    "meanings": [
        {
            "definition": "Required, permitted, or enacted by statute.",
            "pos": "adjective",
            "sent1": "The company's policy on breaks is statutory, meaning employees must take them as required by law.",
            "sent2": "The statutory holiday fell on a Monday this year, giving everyone a long weekend.",
            "sent3": "It was quite comical to see the cat's statutory nap time coincide with the postman's daily visit.",
            "sent4": "The statutory warning signs along the road acted as silent guardians, watching over the drivers.",
            "sent5": "The image of the judge holding the statutory book of laws made a lasting impression on the young law students."
        },
        {
            "definition": "Relating to or created by a statute.",
            "pos": "adjective",
            "sent1": "The lawyer specialized in handling statutory cases, ensuring all legal requirements were met.",
            "sent2": "The statutory regulations regarding building permits were strictly followed by the construction company.",
            "sent3": "The statutory paperwork seemed to multiply on the desk, creating a colorful paper mountain.",
            "sent4": "Her voice carried a statutory authority that made even the rowdiest of students quiet down.",
            "sent5": "The statutory stamp on the document indicated its official approval by the government."
        },
        {
            "definition": "Involving or relating to a statute.",
            "pos": "adjective",
            "sent1": "The judge's decision was based on statutory law, ensuring fairness and consistency.",
            "sent2": "The statutory changes to the tax code affected how businesses reported their earnings.",
            "sent3": "The statutory debate in the courtroom had everyone on the edge of their seats.",
            "sent4": "Her argument had a statutory logic that was hard to refute.",
            "sent5": "The statutory framework provided a solid foundation for the new legal system."
        }
    ]
}