{
    "term": "stationers",
    "meanings": [
        {
            "definition": "A person or business that sells stationery.",
            "pos": "noun",
            "sent1": "The stationers in the store were arranging colorful pens on the shelves.",
            "sent2": "I visited the stationers to buy some notebooks and pencils.",
            "sent3": "The stationers decided to have a race to see who could organize the paper clips faster.",
            "sent4": "The stationers were like busy bees buzzing around the shop, helping customers find the perfect supplies.",
            "sent5": "The stationers' shop was a treasure trove of paper, envelopes, and stickers."
        },
        {
            "definition": "A person who works in a stationery shop.",
            "pos": "noun",
            "sent1": "The friendly stationers greeted customers with a smile as they entered the shop.",
            "sent2": "My friend is a stationers and enjoys helping people pick out the best cards.",
            "sent3": "The stationers joked that they should start a band using only office supplies as instruments.",
            "sent4": "The stationers' expertise in organizing shelves was like a well-choreographed dance.",
            "sent5": "The stationers' knowledge of paper weights and sizes was impressive."
        },
        {
            "definition": "A shop that sells stationery products.",
            "pos": "noun",
            "sent1": "I love visiting the stationers to browse through the latest notebooks and pens.",
            "sent2": "The stationers on the corner always has a great selection of greeting cards.",
            "sent3": "The stationers' shop was so popular that it became the talk of the town.",
            "sent4": "The stationers' shelves were like a rainbow of colors with all the different paper options.",
            "sent5": "The stationers' shop smelled of fresh paper and ink, creating a cozy atmosphere."
        }
    ]
}