{
    "term": "stational",
    "meanings": [
        {
            "definition": "relating to or characteristic of a station",
            "pos": "adjective",
            "sent1": "The stational train arrived on time.",
            "sent2": "The train station is a stational place for travelers.",
            "sent3": "The stational announcement made everyone smile.",
            "sent4": "Her stational uniform made her look like a professional.",
            "sent5": "The stational sign was easy to spot from far away."
        },
        {
            "definition": "a place where one stands or stays for a period of time",
            "pos": "noun",
            "sent1": "The bus stop is a stational point for commuters.",
            "sent2": "The airport is a stational hub for travelers.",
            "sent3": "The park bench became a stational spot for the tired hiker.",
            "sent4": "His mind was a stational waiting room for ideas to arrive.",
            "sent5": "The classroom was a stational learning space for students."
        },
        {
            "definition": "pertaining to a station or stations",
            "pos": "adjective",
            "sent1": "The stational staff were helpful and friendly.",
            "sent2": "The stational map guided passengers to their destinations.",
            "sent3": "The stational clock always showed the correct time.",
            "sent4": "Her stational duties included greeting visitors at the entrance.",
            "sent5": "The stational announcements kept everyone informed about the schedule."
        },
        {
            "definition": "a fixed place or position",
            "pos": "noun",
            "sent1": "The lighthouse served as a stational beacon for ships.",
            "sent2": "The security guard maintained his stational post throughout the night.",
            "sent3": "The treehouse became the children's stational hideout.",
            "sent4": "His favorite chair was his stational spot for reading.",
            "sent5": "The mountain peak was a stational landmark visible from miles away."
        }
    ]
}