{
    "term": "stat",
    "meanings": [
        {
            "definition": "Immediately",
            "pos": "adverb",
            "sent1": "She responded stat to the urgent call for help.",
            "sent2": "The ambulance arrived stat at the scene of the accident.",
            "sent3": "The pizza delivery guy came stat, making everyone cheer.",
            "sent4": "His decision to resign came stat, surprising everyone.",
            "sent5": "The superhero flew in stat to save the day."
        },
        {
            "definition": "Quickly",
            "pos": "adverb",
            "sent1": "He finished his homework stat and went out to play.",
            "sent2": "The athlete ran stat to the finish line.",
            "sent3": "The cat ate its food stat, as if it was in a rush.",
            "sent4": "Time passed stat during the exciting game.",
            "sent5": "The news spread stat throughout the small town."
        },
        {
            "definition": "Suddenly",
            "pos": "adverb",
            "sent1": "The storm hit stat, catching everyone off guard.",
            "sent2": "She felt a sharp pain stat in her arm.",
            "sent3": "The music stopped stat, leaving the room silent.",
            "sent4": "The car stopped stat in the middle of the road.",
            "sent5": "The lights went out stat, plunging the room into darkness."
        },
        {
            "definition": "At once",
            "pos": "adverb",
            "sent1": "Please submit your report stat when you are done.",
            "sent2": "He agreed to help me stat without hesitation.",
            "sent3": "The teacher asked the students to be quiet stat.",
            "sent4": "The alarm went off stat, signaling the start of the race.",
            "sent5": "The chef prepared the dish stat to serve the hungry customers."
        },
        {
            "definition": "Without delay",
            "pos": "adverb",
            "sent1": "The package was delivered stat to the customer's door.",
            "sent2": "She paid the bill stat before leaving the restaurant.",
            "sent3": "The repairman fixed the leak stat to prevent further damage.",
            "sent4": "The message was sent stat to inform everyone of the change.",
            "sent5": "The decision was made stat to avoid any more confusion."
        }
    ]
}