{
    "term": "stedfast",
    "meanings": [
        {
            "definition": "Firmly fixed in place; immovable.",
            "pos": "adjective",
            "sent1": "The tree stood stedfast in the ground, not budging even in the strong wind.",
            "sent2": "She held onto the railing stedfastly as she climbed the stairs.",
            "sent3": "The stedfast rock refused to roll down the hill, much to the frustration of the other rocks.",
            "sent4": "His stedfast loyalty to his friends never wavered, like a mountain unmoved by storms.",
            "sent5": "The stedfast gaze of the lighthouse guided ships safely through the night."
        },
        {
            "definition": "Resolutely or dutifully firm and unwavering.",
            "pos": "adjective",
            "sent1": "Despite the challenges, she remained stedfast in her decision to pursue her dreams.",
            "sent2": "The soldier stood stedfast in his duty to protect his country.",
            "sent3": "The stedfast cat refused to leave its spot on the warm windowsill, even when tempted with treats.",
            "sent4": "Her stedfast determination to learn the piano led her to practice diligently every day.",
            "sent5": "The stedfast commitment of the team members ensured the project's success."
        },
        {
            "definition": "Steadily directed; constant.",
            "pos": "adjective",
            "sent1": "The river flowed stedfastly towards the sea, never changing its course.",
            "sent2": "His stedfast gaze remained on the horizon, watching for any signs of movement.",
            "sent3": "The stedfast ticking of the clock echoed through the empty room, marking the passage of time.",
            "sent4": "The stedfast rhythm of the drums kept the marching band in perfect sync.",
            "sent5": "The stedfast routine of morning yoga helped her start each day with focus and calmness."
        }
    ]
}