{
    "term": "steelies",
    "meanings": [
        {
            "definition": "Small metal balls used in the game of marbles.",
            "pos": "noun",
            "sent1": "During recess, the kids played marbles with steelies on the playground.",
            "sent2": "I found some colorful steelies in my brother's collection of marbles.",
            "sent3": "The mischievous squirrel mistook the shiny steelies for acorns and tried to bury them.",
            "sent4": "Her eyes sparkled like steelies as she won the marble game.",
            "sent5": "The steelies clinked together in a satisfying way as they rolled across the ground."
        },
        {
            "definition": "A type of toy car with a metal body.",
            "pos": "noun",
            "sent1": "Tommy's favorite toy was a red steelies car that he raced around the living room.",
            "sent2": "The steelies cars zoomed down the track at the speed of light during the race.",
            "sent3": "The steelies car seemed to have a mind of its own, dodging obstacles on the floor.",
            "sent4": "The steelies car gleamed under the sunlight, looking like a miniature racing champion.",
            "sent5": "The steelies car made a satisfying clinking sound as it rolled across the wooden floor."
        },
        {
            "definition": "A slang term for steel-toed boots.",
            "pos": "noun",
            "sent1": "The construction worker put on his steelies before heading to the building site.",
            "sent2": "She felt confident and secure in her steelies as she walked through the muddy construction area.",
            "sent3": "The cat tried to play with the laces of the steelies, thinking they were new toys.",
            "sent4": "His determination was as strong as the steelies he wore on his feet.",
            "sent5": "The steelies protected his toes from harm as he worked tirelessly at the construction site."
        }
    ]
}