{
    "term": "stend",
    "meanings": [
        {
            "definition": "To stand upright on the feet.",
            "pos": "verb",
            "sent1": "I stend up when I want to reach the high shelf.",
            "sent2": "She always stends tall and proud during the national anthem.",
            "sent3": "The toy soldier decided to stend on one foot for a change.",
            "sent4": "The trees stend like guardians in the forest, watching over all.",
            "sent5": "The sunflower seemed to stend taller than the rest, basking in the sunlight."
        },
        {
            "definition": "To place or set in an upright position.",
            "pos": "verb",
            "sent1": "Please stend the vase on the table carefully.",
            "sent2": "He likes to stend his books neatly on the shelf.",
            "sent3": "The cat tried to stend the fallen cup back up with its paw.",
            "sent4": "The artist would stend his easel just right before starting to paint.",
            "sent5": "The teacher asked the students to stend their pencils in the holder after use."
        },
        {
            "definition": "To endure or tolerate.",
            "pos": "verb",
            "sent1": "I can stend the cold weather with my warm jacket.",
            "sent2": "She couldn't stend the loud noise coming from the construction site.",
            "sent3": "The little boy tried to stend his sister's teasing but ended up laughing.",
            "sent4": "Sometimes, we have to stend difficult situations to grow stronger.",
            "sent5": "The old tree has stended many storms and still stands tall in the forest."
        },
        {
            "definition": "A structure on which something is supported.",
            "pos": "noun",
            "sent1": "The bird built its nest on the sturdy stend in the garden.",
            "sent2": "The table's stend was made of strong oak wood.",
            "sent3": "The children used sticks to create a little stend for their makeshift tent.",
            "sent4": "The bridge's stend held the weight of the passing cars without any issue.",
            "sent5": "The mountain climber relied on the rocky stend for support during the ascent."
        }
    ]
}