{
    "term": "stepped",
    "meanings": [
        {
            "definition": "To move by lifting one foot and putting it down in a different place.",
            "pos": "verb",
            "sent1": "She carefully stepped over the puddle.",
            "sent2": "He stepped forward to greet his friend.",
            "sent3": "The cat stepped on the piano keys, creating a funny tune.",
            "sent4": "With determination, she stepped into the unknown future.",
            "sent5": "The dancer gracefully stepped across the stage, captivating the audience."
        },
        {
            "definition": "To take a step in a specified direction.",
            "pos": "verb",
            "sent1": "He stepped towards the door to leave the room.",
            "sent2": "The hiker stepped uphill to reach the summit.",
            "sent3": "The robot stepped in circles, amusing the children.",
            "sent4": "She stepped into the spotlight, ready to perform.",
            "sent5": "The athlete stepped over the finish line, winning the race."
        },
        {
            "definition": "To walk or move in a specified manner.",
            "pos": "verb",
            "sent1": "The soldier stepped quietly through the dark forest.",
            "sent2": "The cat stepped delicately on the edge of the table.",
            "sent3": "The penguin stepped clumsily on the ice, slipping and sliding.",
            "sent4": "She stepped confidently into the room, commanding attention.",
            "sent5": "The toddler stepped slowly, learning to walk step by step."
        },
        {
            "definition": "To increase or decrease by a specified amount.",
            "pos": "verb",
            "sent1": "The price of the item stepped up unexpectedly.",
            "sent2": "His heart rate stepped down after the intense workout.",
            "sent3": "The temperature stepped up, making it uncomfortably hot.",
            "sent4": "Her excitement stepped up as the event drew closer.",
            "sent5": "The tension in the room stepped down as they reached a resolution."
        }
    ]
}