{
    "term": "sterns",
    "meanings": [
        {
            "definition": "The rear or back part of a ship.",
            "pos": "noun",
            "sent1": "The sailors gathered at the sterns of the ship to watch the sunset.",
            "sent2": "The captain stood at the sterns, steering the ship through the rough waters.",
            "sent3": "The mischievous seagull landed on the sterns and squawked loudly, startling the crew.",
            "sent4": "As the storm approached, the waves crashed against the sterns, threatening to capsize the ship.",
            "sent5": "The old lighthouse stood tall on the rocky cliff, guiding ships safely past their sterns."
        },
        {
            "definition": "The rear end of an animal.",
            "pos": "noun",
            "sent1": "The dog wagged its tail vigorously with its sterns in the air.",
            "sent2": "The lioness protected her cubs with a fierce growl, her sterns raised in warning.",
            "sent3": "The mischievous kitten pounced on its sibling's sterns, playfully wrestling on the grass.",
            "sent4": "The horse swished its sterns to shoo away the pesky flies buzzing around.",
            "sent5": "The kangaroo's powerful hind legs propelled it forward, its sterns balancing its body in mid-air."
        },
        {
            "definition": "To be strict or severe in discipline.",
            "pos": "verb",
            "sent1": "The teacher sternly reminded the students to complete their homework on time.",
            "sent2": "The coach sterns the players to follow the training schedule for the upcoming match.",
            "sent3": "Despite his sterns warnings, the children couldn't resist sneaking cookies from the jar.",
            "sent4": "The judge sterns the defendant for his repeated outbursts in the courtroom.",
            "sent5": "The manager sterns the employees about the importance of punctuality in the workplace."
        }
    ]
}