{
    "term": "sterculia",
    "meanings": [
        {
            "definition": "A genus of tropical trees and shrubs.",
            "pos": "noun",
            "sent1": "The sterculia in the forest provide shade and shelter for many animals.",
            "sent2": "The botanist studied the different species of sterculia found in the rainforest.",
            "sent3": "The sterculia tree whispered secrets to the curious squirrel passing by.",
            "sent4": "The sterculia trees stood tall like guardians of the jungle, protecting its inhabitants.",
            "sent5": "The vibrant green leaves of the sterculia tree danced in the gentle breeze."
        },
        {
            "definition": "The dried seeds of these trees, used in medicine and as a source of oil.",
            "pos": "noun",
            "sent1": "The herbalist collected sterculia seeds to create a healing potion.",
            "sent2": "The villagers pressed sterculia seeds to extract valuable oil for cooking.",
            "sent3": "The mischievous monkey mistook sterculia seeds for shiny marbles and played with them.",
            "sent4": "The sterculia seeds held the promise of health and vitality within their tiny shells.",
            "sent5": "The aroma of crushed sterculia seeds filled the room with a comforting scent."
        },
        {
            "definition": "The wood of these trees, used in construction and for making furniture.",
            "pos": "noun",
            "sent1": "The carpenter carefully carved intricate designs into the sterculia wood.",
            "sent2": "The furniture maker selected high-quality sterculia wood for crafting a sturdy table.",
            "sent3": "The mischievous raccoon tried to climb the smooth sterculia tree trunk but kept slipping down.",
            "sent4": "The sterculia wood gleamed in the sunlight, showcasing its natural beauty.",
            "sent5": "The aroma of freshly cut sterculia wood filled the workshop, inspiring the artisans."
        }
    ]
}