{
    "term": "sterilising",
    "meanings": [
        {
            "definition": "To make something free from bacteria or other microorganisms.",
            "pos": "verb",
            "sent1": "She was sterilising the surgical tools before the operation.",
            "sent2": "The hospital staff were sterilising the equipment to ensure cleanliness.",
            "sent3": "The chef joked that he was sterilising the kitchen to keep the germs away from his delicious dishes.",
            "sent4": "The intense heat of the sun was sterilising the water in the pond, making it safe to drink.",
            "sent5": "The scientist used a special machine for sterilising the samples to study only the bacteria-free ones."
        },
        {
            "definition": "To make something unable to produce offspring.",
            "pos": "verb",
            "sent1": "The veterinarian recommended sterilising the cat to prevent unwanted litters.",
            "sent2": "The animal shelter had a program for sterilising pets to control the population.",
            "sent3": "The farmer decided to sterilise the male sheep to avoid unexpected lambs in the flock.",
            "sent4": "The genetic modification process was like sterilising the plants, ensuring they couldn't reproduce naturally.",
            "sent5": "The scientist's experiment involved sterilising the insects to observe their behavior without offspring distractions."
        },
        {
            "definition": "To make something free from living organisms.",
            "pos": "verb",
            "sent1": "The cleaning crew was sterilising the room to eliminate any bacteria or viruses.",
            "sent2": "After the flood, the residents were sterilising their homes to prevent mold growth.",
            "sent3": "The gardener was sterilising the soil to prepare it for planting new seeds.",
            "sent4": "The intense cold of winter was sterilising the lake, keeping it free from algae.",
            "sent5": "The astronaut sterilised the spaceship before the mission to ensure no harmful organisms traveled with them."
        }
    ]
}