{
    "term": "stereomicroscopes",
    "meanings": [
        {
            "definition": "Stereomicroscopes: optical instrument with two eyepieces used for viewing objects in three dimensions",
            "pos": "noun",
            "sent1": "I looked through the stereomicroscopes to see the tiny bug up close.",
            "sent2": "Scientists use stereomicroscopes to study small objects in 3D.",
            "sent3": "The detective peered through the stereomicroscopes to solve the miniature mystery.",
            "sent4": "Her eyes felt like stereomicroscopes, seeing every detail of the painting.",
            "sent5": "The classroom gasped as the teacher revealed the world through the stereomicroscopes."
        },
        {
            "definition": "Stereomicroscopes: plural form of stereomicroscope",
            "pos": "noun",
            "sent1": "The lab had many stereomicroscopes for the students to use.",
            "sent2": "Do you know where the stereomicroscopes are kept in the science room?",
            "sent3": "The museum displayed a collection of stereomicroscopes from different eras.",
            "sent4": "The stereomicroscopes lined the shelves like curious robotic eyes.",
            "sent5": "In the attic, we found a box filled with old stereomicroscopes from grandpa's time."
        },
        {
            "definition": "Stereomicroscopes: devices that magnify small objects for detailed examination",
            "pos": "noun",
            "sent1": "The jeweler used stereomicroscopes to inspect the intricate designs of the ring.",
            "sent2": "Biologists rely on stereomicroscopes to observe tiny organisms.",
            "sent3": "The magician pretended to pull a rabbit out of the stereomicroscopes.",
            "sent4": "Her mind worked like stereomicroscopes, zooming in on every word of the contract.",
            "sent5": "The artist's studio was filled with the hum of stereomicroscopes revealing hidden beauty."
        }
    ]
}