{
    "term": "stereos",
    "meanings": [
        {
            "definition": "A sound system that uses two or more speakers to create a three-dimensional sound experience.",
            "pos": "noun",
            "sent1": "The stereos in the living room make the music sound like it's all around you.",
            "sent2": "I bought new stereos for my car to enjoy music with better quality.",
            "sent3": "The stereos at the party were so loud that even the neighbors could hear the music!",
            "sent4": "Her laughter filled the room like the sound from multiple stereos playing at once.",
            "sent5": "The stereos in the movie theater made the action scenes incredibly immersive."
        },
        {
            "definition": "A prefix meaning solid or three-dimensional.",
            "pos": "noun",
            "sent1": "The word 'stereoscopy' uses the prefix 'stereos' to describe a three-dimensional image.",
            "sent2": "Understanding the prefix 'stereos' helps in learning new scientific terms.",
            "sent3": "The cake was so delicious, it seemed to have a stereos amount of flavor packed into it!",
            "sent4": "His ideas were as clear and solid as the meaning behind the prefix 'stereos'.",
            "sent5": "The mountain range looked stereos against the horizon, standing out in three dimensions."
        },
        {
            "definition": "A combining form meaning solid or three-dimensional.",
            "pos": "noun",
            "sent1": "The architect used the combining form 'stereos' to describe the building's three-dimensional design.",
            "sent2": "Learning about 'stereoscopy' helps in understanding how to represent objects in three dimensions.",
            "sent3": "The ice cream cone was so big, it had a stereos amount of scoops on top!",
            "sent4": "Her determination was as strong and three-dimensional as the meaning of the combining form 'stereos'.",
            "sent5": "The painting looked stereos, with the artist skillfully creating depth and solidity on the canvas."
        }
    ]
}