{
    "term": "sterned",
    "meanings": [
        {
            "definition": "The back or rear part of a ship.",
            "pos": "noun",
            "sent1": "The captain stood at the sterned of the ship, gazing out at the vast ocean.",
            "sent2": "The crew gathered at the sterned to watch the sunset over the horizon.",
            "sent3": "The mischievous sailor tried to hide a small crab in the sterned of the ship, hoping to startle his friend.",
            "sent4": "As the storm raged on, the waves crashed against the sterned, testing the ship's strength.",
            "sent5": "The moonlight reflected off the water, casting a silver glow on the sterned of the vessel."
        },
        {
            "definition": "To steer or direct a ship.",
            "pos": "verb",
            "sent1": "The experienced captain sterned the ship through the narrow channel with precision.",
            "sent2": "She sterned the boat towards the lighthouse, guiding it safely to shore.",
            "sent3": "The young sailor sterned the ship in circles, trying to impress his crewmates with his skills.",
            "sent4": "With steady hands, he sterned the vessel away from the rocky shore, avoiding disaster.",
            "sent5": "The captain sterned the ship through the storm, determined to reach their destination."
        },
        {
            "definition": "To provide with a stern or strict appearance or manner.",
            "pos": "verb",
            "sent1": "The teacher sterned her students with a serious look, signaling the start of the test.",
            "sent2": "He sterned his face before entering the meeting, preparing to negotiate a tough deal.",
            "sent3": "The cat sterned at the mischievous kitten, warning it not to cause trouble.",
            "sent4": "The judge sterned at the defendant, making it clear that any further disruptions would not be tolerated.",
            "sent5": "The general sterned at the soldiers, reminding them of the importance of discipline in the army."
        }
    ]
}