{
    "term": "stickball",
    "meanings": [
        {
            "definition": "A game played with a stick and ball, typically in a street or other urban setting.",
            "pos": "noun",
            "sent1": "Kids in the neighborhood gathered to play stickball after school.",
            "sent2": "The sound of laughter filled the air as the children played stickball in the alley.",
            "sent3": "The stickball game got so intense that even the adults wanted to join in on the fun.",
            "sent4": "In the game of life, sometimes we are the stick and sometimes we are the ball in a never-ending game of stickball.",
            "sent5": "The colorful stickball bat stood out against the grey pavement, a symbol of childhood joy."
        },
        {
            "definition": "A stick used in the game of stickball.",
            "pos": "noun",
            "sent1": "Tommy's favorite stickball was the one with the red handle.",
            "sent2": "The old stickball leaned against the wall, waiting for its next game.",
            "sent3": "The mischievous squirrel mistook the stickball for a nut and tried to bury it in the garden.",
            "sent4": "The stickball was like a magic wand, transforming the ordinary street into a playground.",
            "sent5": "With a swift swing, the stickball connected with the ball, sending it soaring through the air."
        },
        {
            "definition": "To hit or strike with a stickball bat.",
            "pos": "verb",
            "sent1": "She aimed carefully and stickballed the ball right out of the park.",
            "sent2": "The coach demonstrated how to properly stickball the ball for a home run.",
            "sent3": "He stickballed the ball so hard that it landed in the neighbor's yard, causing a commotion.",
            "sent4": "The rhythmic sound of stickballing echoed through the street as the game intensified.",
            "sent5": "With determination, she stickballed the ball with all her might, scoring the winning point."
        }
    ]
}