{
    "term": "stickup",
    "meanings": [
        {
            "definition": "A robbery in which a person is held up at gunpoint and forced to hand over money or valuables.",
            "pos": "noun",
            "sent1": "During the stickup, the thief demanded all the money from the cashier.",
            "sent2": "The police arrived quickly at the scene of the stickup.",
            "sent3": "The stickup in the movie was intense, but the hero managed to outsmart the robber.",
            "sent4": "The stickup felt like a scene from a suspenseful thriller.",
            "sent5": "The news of the stickup spread rapidly throughout the small town.",
            "sent6": "After the stickup, the store implemented new security measures.",
            "sent7": "Witnesses described the stickup as a terrifying experience.",
            "sent8": "The stickup at the bank was foiled by a quick-thinking teller.",
            "sent9": "The stickup artist was eventually caught by the police.",
            "sent10": "The stickup caused a stir in the local community."
        },
        {
            "definition": "A small adhesive piece of paper used for attaching things together.",
            "pos": "noun",
            "sent1": "I used a stickup to attach the note to the fridge.",
            "sent2": "The stickup on the wall kept falling off.",
            "sent3": "The stickup on the envelope sealed it shut securely.",
            "sent4": "The stickup held the poster in place perfectly.",
            "sent5": "She used a stickup to stick her drawing to the wall.",
            "sent6": "The stickup on the back of the card kept it closed.",
            "sent7": "He found a stickup to attach the loose papers together.",
            "sent8": "The stickup on the gift wrap added a nice touch.",
            "sent9": "The stickup on the label kept it from peeling off.",
            "sent10": "She used a stickup to stick the broken pieces back together."
        },
        {
            "definition": "To remain in a particular position or state.",
            "pos": "verb",
            "sent1": "I had to stickup my hand to ask a question.",
            "sent2": "The poster wouldn't stickup no matter how hard I tried.",
            "sent3": "The idea seemed to stickup in his mind for days.",
            "sent4": "Her hair would always stickup in the morning.",
            "sent5": "The decision to stickup for her friend was easy for him.",
            "sent6": "The plan to stickup for the environment was well-received.",
            "sent7": "The memory of the event would stickup in his thoughts.",
            "sent8": "The need to stickup for justice was strong in her heart.",
            "sent9": "The importance of education would always stickup in their family.",
            "sent10": "His determination to stickup for what was right never wavered."
        }
    ]
}