{
    "term": "stifle",
    "meanings": [
        {
            "definition": "To prevent or constrain (someone) from breathing freely; suffocate.",
            "pos": "verb",
            "sent1": "The heavy smoke seemed to stifle him as he struggled to catch his breath.",
            "sent2": "She felt like the tight scarf was going to stifle her if she didn't loosen it.",
            "sent3": "Trying to talk with a mouthful of marshmallows made him sound like he was trying to stifle a laugh.",
            "sent4": "The silence in the room was so thick, it seemed to stifle any sound from escaping.",
            "sent5": "The oppressive heat seemed to stifle all life out of the once vibrant garden."
        },
        {
            "definition": "To restrain (a reaction) or stop oneself acting on (an emotion).",
            "pos": "verb",
            "sent1": "She had to stifle a gasp when she saw the surprise party waiting for her.",
            "sent2": "He had to stifle his anger and calmly explain the situation to avoid a fight.",
            "sent3": "Trying to stifle a sneeze by pinching his nose only made him look like a confused rabbit.",
            "sent4": "The excitement was so overwhelming, she could barely stifle her squeals of joy.",
            "sent5": "The urge to dance was so strong, she could hardly stifle her happy feet from tapping along."
        },
        {
            "definition": "To suppress or hold back.",
            "pos": "verb",
            "sent1": "He tried to stifle a yawn during the boring presentation.",
            "sent2": "She couldn't stifle her laughter when she saw the puppy chasing its tail.",
            "sent3": "The urge to sing along was hard to stifle as her favorite song played on the radio.",
            "sent4": "The guilt was so overwhelming, she could barely stifle her tears.",
            "sent5": "The excitement bubbled inside her, impossible to stifle, as she waited for the results."
        }
    ]
}