{
    "term": "stiffs",
    "meanings": [
        {
            "definition": "A dead body",
            "pos": "noun",
            "sent1": "The detectives found two stiffs in the abandoned house.",
            "sent2": "The morgue was filled with stiffs awaiting identification.",
            "sent3": "The horror movie was full of fake stiffs that made everyone jump.",
            "sent4": "The graveyard at night seemed to be whispering secrets to the stiffs below.",
            "sent5": "The stiffs in the crime scene photos were a chilling sight."
        },
        {
            "definition": "A person who is very formal or serious",
            "pos": "noun",
            "sent1": "The stiffs at the meeting never cracked a smile.",
            "sent2": "The stiffs in suits looked out of place at the beach party.",
            "sent3": "Even the stiffs in the office loosened up at the holiday party.",
            "sent4": "The stiffs in the boardroom seemed to have forgotten how to laugh.",
            "sent5": "The stiffs in the courtroom made the atmosphere tense."
        },
        {
            "definition": "To cheat or swindle someone",
            "pos": "verb",
            "sent1": "The con artist stiffs unsuspecting victims out of their money.",
            "sent2": "He stiffs his friends by never paying his share of the bill.",
            "sent3": "The magician playfully tried to stiff the audience with his disappearing act.",
            "sent4": "She felt cheated when he tried to stiff her out of her rightful prize.",
            "sent5": "The scammer's plan to stiff the elderly couple was foiled by the police."
        },
        {
            "definition": "To make something rigid or stiff",
            "pos": "verb",
            "sent1": "She used starch to stiffen the collar of her shirt.",
            "sent2": "The cold weather stiffs the fabric of the tent, making it hard to fold.",
            "sent3": "The glue accidentally stiffened his fingers together.",
            "sent4": "The fear stiffened his body, making it hard to move.",
            "sent5": "The old book's pages had stiffened over time, making them difficult to turn."
        }
    ]
}