{
    "term": "stiff",
    "meanings": [
        {
            "definition": "Not easily bent or flexible",
            "pos": "adjective",
            "sent1": "The board was stiff and wouldn't bend.",
            "sent2": "The new shoes felt stiff until they were broken in.",
            "sent3": "Trying to fold the stiff paper airplane was a challenge.",
            "sent4": "His stiff resolve never wavered in the face of adversity.",
            "sent5": "The stiff metal rod stood strong against the wind."
        },
        {
            "definition": "Firm or rigid",
            "pos": "adjective",
            "sent1": "The stiff mattress provided good support for his back.",
            "sent2": "The frozen ice cream was so stiff, it was hard to scoop.",
            "sent3": "The stiff handshake showed his determination.",
            "sent4": "Her stiff rules left no room for negotiation.",
            "sent5": "The stiff tree trunk didn't sway in the storm."
        },
        {
            "definition": "Difficult to bend or move",
            "pos": "adjective",
            "sent1": "The stiff door was stuck and wouldn't open.",
            "sent2": "The old joints made it stiff for him to walk.",
            "sent3": "His stiff muscles protested after the long workout.",
            "sent4": "The rust made the hinges stiff and hard to turn.",
            "sent5": "The cold made his fingers stiff and numb."
        },
        {
            "definition": "Lacking ease or comfort",
            "pos": "adjective",
            "sent1": "The stiff chair was uncomfortable to sit on for long.",
            "sent2": "The formal event required him to wear a stiff suit.",
            "sent3": "The stiff bed made it hard for him to sleep well.",
            "sent4": "Her stiff expression showed her displeasure.",
            "sent5": "The stiff collar chafed against his neck."
        },
        {
            "definition": "Strong or powerful in action or effect",
            "pos": "adjective",
            "sent1": "The stiff wind blew away the loose leaves.",
            "sent2": "His stiff punch knocked out the opponent.",
            "sent3": "The stiff competition pushed him to do his best.",
            "sent4": "Her stiff warning made them reconsider their actions.",
            "sent5": "The stiff penalty for breaking the rule deterred others."
        }
    ]
}