{
    "term": "stings",
    "meanings": [
        {
            "definition": "To cause a sharp, sudden pain",
            "pos": "verb",
            "sent1": "The bee stings my hand.",
            "sent2": "The wasp stings when threatened.",
            "sent3": "Getting stung by a bee can really surprise you.",
            "sent4": "His words stung like a bee's venom.",
            "sent5": "The icy wind stings my cheeks as I walk."
        },
        {
            "definition": "A wound or injury caused by a sharp object",
            "pos": "noun",
            "sent1": "The jellyfish's sting left a red mark.",
            "sent2": "She felt a sharp sting on her finger.",
            "sent3": "The mosquito's sting was itchy and annoying.",
            "sent4": "The betrayal felt like a deep emotional sting.",
            "sent5": "The nettle's sting caused a burning sensation."
        },
        {
            "definition": "A feeling of sharp emotional pain",
            "pos": "noun",
            "sent1": "The sting of rejection hurt deeply.",
            "sent2": "The sting of loss lingered in her heart.",
            "sent3": "His teasing had a playful sting to it.",
            "sent4": "The memory of her words had a lasting sting.",
            "sent5": "The sting of loneliness crept into his thoughts."
        },
        {
            "definition": "A method of catching fish using a sharp hook baited with food",
            "pos": "noun",
            "sent1": "He used a fishing sting to catch a big trout.",
            "sent2": "The old man's favorite hobby was using a fishing sting.",
            "sent3": "The fishing sting was set, waiting for a bite.",
            "sent4": "The fishing sting danced in the water, tempting the fish.",
            "sent5": "The fishing sting was carefully cast into the river."
        },
        {
            "definition": "A small, sharp organ in some animals used for defense or capturing prey",
            "pos": "noun",
            "sent1": "The scorpion's sting is venomous.",
            "sent2": "The bee's sting is its primary defense.",
            "sent3": "The wasp's sting is a powerful weapon.",
            "sent4": "The scorpion's sting is a fearsome tool.",
            "sent5": "The snake's sting injects deadly venom."
        }
    ]
}