{
    "term": "stocks",
    "meanings": [
        {
            "definition": "A supply of goods kept on hand for sale to customers.",
            "pos": "noun",
            "sent1": "The small grocery store always makes sure to have enough stocks of bread and milk.",
            "sent2": "The warehouse manager ordered more stocks of paper towels to meet the increasing demand.",
            "sent3": "The party planner panicked when she realized she forgot to buy stocks of balloons for the event.",
            "sent4": "Her closet was like a treasure trove, filled with colorful stocks of clothing waiting to be worn.",
            "sent5": "The farmer proudly displayed his abundant stocks of fresh vegetables at the market."
        },
        {
            "definition": "A portion of a company's ownership that can be bought and sold on the stock market.",
            "pos": "noun",
            "sent1": "Investors eagerly bought stocks of the tech company as its profits soared.",
            "sent2": "She decided to sell her stocks in the company before the share prices dropped.",
            "sent3": "The billionaire casually mentioned owning stocks in multiple successful companies.",
            "sent4": "His portfolio was like a garden, with different stocks blooming and growing in value.",
            "sent5": "The stock market trader closely monitored the fluctuating prices of his stocks."
        },
        {
            "definition": "A wooden framework on which a person is tied up for punishment or torture.",
            "pos": "noun",
            "sent1": "The pirate captain ordered his crew to prepare the stocks for the captured enemies.",
            "sent2": "The medieval castle had a dark dungeon with rusty stocks for unruly prisoners.",
            "sent3": "The mischievous child joked about putting his little brother in the stocks for fun.",
            "sent4": "The abandoned prison still had the eerie remnants of the old stocks used for punishment.",
            "sent5": "The historical reenactment included a display of the stocks used in the past for public shaming."
        }
    ]
}