{
    "term": "stock",
    "meanings": [
        {
            "definition": "The goods or merchandise kept on the premises of a business or warehouse and available for sale or distribution.",
            "pos": "noun",
            "sent1": "The small grocery store had a variety of stock on its shelves.",
            "sent2": "The warehouse manager ordered more stock to meet the increasing demand.",
            "sent3": "The mischievous cat knocked over the stock of canned goods, causing a mess.",
            "sent4": "Her collection of books was a stock of knowledge waiting to be explored.",
            "sent5": "The stock of fresh produce at the market was vibrant and colorful."
        },
        {
            "definition": "The capital raised by a business or corporation through the issue and subscription of shares.",
            "pos": "noun",
            "sent1": "Investors eagerly bought shares of the company's stock.",
            "sent2": "The stock market fluctuates based on various economic factors.",
            "sent3": "The CEO joked that the company's stock was so popular, it should have its own fan club.",
            "sent4": "Her confidence in the company's future made her stock in it unwavering.",
            "sent5": "The success of the new product launch boosted the company's stock value."
        },
        {
            "definition": "The trunk or main stem of a tree or plant.",
            "pos": "noun",
            "sent1": "The oak tree's stock was thick and sturdy.",
            "sent2": "The gardener carefully pruned the rose bush's stock to promote growth.",
            "sent3": "The mischievous squirrel ran up the stock of the tree, looking for acorns.",
            "sent4": "The stock of the palm tree swayed gently in the breeze.",
            "sent5": "The stock of the sunflower stood tall, reaching for the sunlight."
        },
        {
            "definition": "A supply of something available for use or sale.",
            "pos": "noun",
            "sent1": "The store had a stock of fresh vegetables for sale.",
            "sent2": "She checked the stock of batteries before going on the camping trip.",
            "sent3": "The children's laughter was a stock of joy for the elderly residents.",
            "sent4": "The stock of building materials was running low due to high demand.",
            "sent5": "The stock of winter coats was quickly selling out as the temperature dropped."
        },
        {
            "definition": "Livestock, especially cattle or horses.",
            "pos": "noun",
            "sent1": "The rancher tended to his stock of cattle in the pasture.",
            "sent2": "The farmer's stock of horses grazed peacefully in the meadow.",
            "sent3": "The mischievous goat managed to escape from the stock pen again.",
            "sent4": "The stock of sheep huddled together to stay warm in the cold night.",
            "sent5": "The stock of pigs eagerly awaited their feeding time on the farm."
        }
    ]
}