{
    "term": "stoccata",
    "meanings": [
        {
            "definition": "A thrust or stab with a sword.",
            "pos": "noun",
            "sent1": "During the duel, he delivered a precise stoccata to his opponent's chest.",
            "sent2": "The fencer's stoccata was swift and accurate, winning him the match.",
            "sent3": "The pirate captain's stoccata was so sharp, it cut through the enemy's defenses easily.",
            "sent4": "Her words were like a stoccata, piercing through his heart with their honesty.",
            "sent5": "The stoccata in the story was described with such detail that it felt like I was there witnessing it."
        },
        {
            "definition": "A fencing technique involving a quick thrust.",
            "pos": "noun",
            "sent1": "In fencing class, they practiced the stoccata repeatedly to improve their speed.",
            "sent2": "The stoccata is a fundamental move in fencing, requiring precision and agility.",
            "sent3": "The fencer's stoccata was so fast that it seemed like a blur to the spectators.",
            "sent4": "Her wit was like a stoccata in conversation, catching others off guard with its sharpness.",
            "sent5": "The instructor demonstrated the stoccata with such grace that it looked like a dance move."
        },
        {
            "definition": "To execute a stoccata in a fencing match.",
            "pos": "verb",
            "sent1": "He planned to stoccata his opponent as soon as the match began.",
            "sent2": "The fencer stoccataed with precision, earning applause from the audience.",
            "sent3": "She jokingly threatened to stoccata anyone who interrupted her during practice.",
            "sent4": "His determination to win was like a stoccata, driving him forward with focused energy.",
            "sent5": "The way he stoccataed in the final round was so impressive that it became the talk of the tournament."
        }
    ]
}