{
    "term": "stoichiometric",
    "meanings": [
        {
            "definition": "Of or relating to the molar ratios of elements in a chemical reaction.",
            "pos": "adjective",
            "sent1": "The stoichiometric calculation helped us determine the correct amounts of substances needed.",
            "sent2": "The scientist conducted a stoichiometric analysis to understand the chemical reaction.",
            "sent3": "The stoichiometric puzzle was so tricky that even the professor got stumped.",
            "sent4": "Her stoichiometric approach to problem-solving ensured precise results every time.",
            "sent5": "The stoichiometric concept was crystal clear after the teacher's explanation."
        },
        {
            "definition": "Involving or exhibiting stoichiometry.",
            "pos": "adjective",
            "sent1": "The stoichiometric experiment showcased the principles of balanced chemical equations.",
            "sent2": "The student's stoichiometric skills were evident in the accurate lab results.",
            "sent3": "The stoichiometric dance between the chemicals was both fascinating and precise.",
            "sent4": "The stoichiometric relationship between the elements was like a perfectly choreographed ballet.",
            "sent5": "Her stoichiometric understanding made her a standout in the chemistry class."
        },
        {
            "definition": "Having the exact proportions of reactants required for a complete reaction.",
            "pos": "adjective",
            "sent1": "The stoichiometric mixture ensured a successful chemical reaction.",
            "sent2": "The stoichiometric balance of the components led to a complete transformation.",
            "sent3": "The stoichiometric recipe for the potion was a hit at the wizard's party.",
            "sent4": "The stoichiometric blend of flavors in the dish created a culinary masterpiece.",
            "sent5": "The stoichiometric match of ingredients made the dish taste perfect."
        }
    ]
}