{
    "term": "stonked",
    "meanings": [
        {
            "definition": "To be extremely intoxicated or under the influence of drugs.",
            "pos": "verb",
            "sent1": "After drinking too much at the party, he was stonked and couldn't walk straight.",
            "sent2": "She got stonked on her birthday and had a great time with her friends.",
            "sent3": "The cat accidentally ate the catnip and got stonked, meowing loudly.",
            "sent4": "The flowers in the garden looked stonked after the heavy rain, drooping with water.",
            "sent5": "The toddler found the colorful candies and got stonked on sugar, running around the house."
        },
        {
            "definition": "To be heavily invested in something, typically a stock or cryptocurrency.",
            "pos": "verb",
            "sent1": "He was stonked in the new company's shares, hoping for a big return.",
            "sent2": "Investors were stonked in the latest cryptocurrency trend, watching the market closely.",
            "sent3": "The squirrel seemed stonked in collecting acorns for the winter, storing them diligently.",
            "sent4": "The artist was stonked in creating a masterpiece, pouring hours into each brushstroke.",
            "sent5": "The gardener was stonked in growing exotic plants, tending to them with care and attention."
        },
        {
            "definition": "To be physically beaten or defeated.",
            "pos": "verb",
            "sent1": "In the boxing match, the champion stonked his opponent with powerful punches.",
            "sent2": "The soccer team was stonked by their rivals in the final game of the season.",
            "sent3": "The bully was stonked by the new kid in school, learning a lesson in humility.",
            "sent4": "The storm stonked the fragile tent, tearing it apart in the strong winds.",
            "sent5": "The puzzle stonked the player, challenging their problem-solving skills to the limit."
        }
    ]
}