{
    "term": "stoneboat",
    "meanings": [
        {
            "definition": "A sled used for moving heavy objects.",
            "pos": "noun",
            "sent1": "The workers used a stoneboat to transport the heavy rocks across the snowy field.",
            "sent2": "The stoneboat made it easier to move the heavy logs from one place to another.",
            "sent3": "I tried using the stoneboat to slide down the hill, but it didn't work as I expected.",
            "sent4": "Her determination was like a sturdy stoneboat, carrying her through the challenges she faced.",
            "sent5": "The stoneboat glided smoothly over the rough terrain, effortlessly carrying its load."
        },
        {
            "definition": "A type of boat used for transporting stones.",
            "pos": "noun",
            "sent1": "The stoneboat floated gracefully on the river, carrying the precious stones to the market.",
            "sent2": "The stoneboat was specifically designed to transport heavy stones across the water.",
            "sent3": "The stoneboat captain joked that his boat was so strong, it could even carry the mountain itself.",
            "sent4": "The stoneboat cut through the water like a sharp knife, its cargo of stones gleaming in the sunlight.",
            "sent5": "The stoneboat's sturdy hull protected the valuable stones from the rough waves of the sea."
        },
        {
            "definition": "A large, flat piece of wood used for dragging heavy loads.",
            "pos": "noun",
            "sent1": "The workers placed the heavy crates on the stoneboat and dragged them across the warehouse.",
            "sent2": "The stoneboat was perfect for moving the massive pile of bricks from one construction site to another.",
            "sent3": "The mischievous kids turned the stoneboat into a makeshift slide, much to the surprise of the workers.",
            "sent4": "The stoneboat groaned under the weight of the boulders, but it held strong and carried them to their destination.",
            "sent5": "The stoneboat's smooth surface made it ideal for transporting the heavy equipment without causing any damage."
        }
    ]
}