{
    "term": "stones",
    "meanings": [
        {
            "definition": "Hard, solid mineral material forming part of the earth's surface.",
            "pos": "noun",
            "sent1": "The path was covered with rough stones.",
            "sent2": "She skipped stones across the lake.",
            "sent3": "The stones in the garden seemed to whisper secrets to each other.",
            "sent4": "His heart felt heavy as if burdened by stones.",
            "sent5": "The stones in the quarry gleamed under the midday sun."
        },
        {
            "definition": "Small piece of rock used for throwing.",
            "pos": "noun",
            "sent1": "He picked up a few stones to skip on the water.",
            "sent2": "The children played a game of throwing stones at a target.",
            "sent3": "The mischievous squirrel pelted the window with stones.",
            "sent4": "Her words hit him like sharp stones, leaving wounds unseen.",
            "sent5": "The stones in his hand felt cool and smooth against his palm."
        },
        {
            "definition": "Seed of a fruit, such as a cherry or peach.",
            "pos": "noun",
            "sent1": "She accidentally swallowed a cherry stone while eating.",
            "sent2": "The peach stones were planted to grow new trees.",
            "sent3": "The squirrel buried the apple stones in the ground for safekeeping.",
            "sent4": "The cherry stones scattered across the picnic blanket.",
            "sent5": "The farmer collected the apricot stones to use for planting next season."
        },
        {
            "definition": "Testicle.",
            "pos": "noun",
            "sent1": "The boxer took a hard hit to the stones.",
            "sent2": "He winced in pain after accidentally hitting his stones.",
            "sent3": "The comedian joked about getting hit in the stones during a performance.",
            "sent4": "He protected his stones during the intense game.",
            "sent5": "The doctor examined his stones for any signs of injury."
        }
    ]
}