{
    "term": "stooged",
    "meanings": [
        {
            "definition": "To act as a subordinate or underling, especially in a comedic act.",
            "pos": "verb",
            "sent1": "During the play, I stooged around on stage, following the lead actor's funny antics.",
            "sent2": "In the comedy skit, the actor stooged around, playing the role of the bumbling sidekick.",
            "sent3": "The audience burst into laughter as I stooged clumsily behind the main comedian.",
            "sent4": "I felt like a puppet on strings, stooged into playing the fool for everyone's amusement.",
            "sent5": "My role was to stooge around and make the audience smile with my silly actions."
        },
        {
            "definition": "To be manipulated or used by someone else for their own benefit.",
            "pos": "verb",
            "sent1": "He stooged me into doing his chores while he relaxed on the couch.",
            "sent2": "She always manages to stooge others into doing her work for her.",
            "sent3": "I realized I had been stooged into running errands for my lazy friend.",
            "sent4": "Feeling like a pawn, I was stooged into helping with tasks that weren't mine.",
            "sent5": "Don't let yourself be stooged into taking on responsibilities that aren't yours to bear."
        },
        {
            "definition": "To be set up or tricked by someone else.",
            "pos": "verb",
            "sent1": "I was stooged into believing the fake news story that circulated online.",
            "sent2": "She felt embarrassed after being stooged into falling for the prank.",
            "sent3": "My friends stooged me by pretending my birthday was forgotten, only to surprise me later.",
            "sent4": "Feeling deceived, I realized I had been stooged into buying a faulty product.",
            "sent5": "Being stooged by my siblings in harmless pranks always brings laughter to our home."
        }
    ]
}