{
    "term": "stoppers",
    "meanings": [
        {
            "definition": "A device or object used to close or block an opening.",
            "pos": "noun",
            "sent1": "I placed the stoppers in the test tubes to prevent the liquid from spilling.",
            "sent2": "The wine bottle had a stopper made of cork to keep the wine fresh.",
            "sent3": "The mischievous squirrel used the stoppers from the board game to build a tiny fort.",
            "sent4": "Her laughter was like a stopper for the sadness in the room, instantly lifting everyone's spirits.",
            "sent5": "The stoppers in the dam held back the rushing water, creating a serene lake."
        },
        {
            "definition": "A person or thing that brings something to a halt or prevents it from continuing.",
            "pos": "noun",
            "sent1": "The traffic lights acted as stoppers, controlling the flow of cars at the intersection.",
            "sent2": "The strict teacher was seen as a stopper of fun by the students.",
            "sent3": "The unexpected rain was a stopper for the outdoor picnic, forcing everyone to move indoors.",
            "sent4": "His sudden question was a stopper in the middle of the meeting, causing everyone to pause and think.",
            "sent5": "The stopper in the form of a locked gate prevented the curious dog from entering the garden."
        },
        {
            "definition": "A player in a sports team who is responsible for preventing the opposing team from scoring.",
            "pos": "noun",
            "sent1": "The goalkeeper was the main stopper in the soccer match, blocking many shots on goal.",
            "sent2": "The basketball team's stopper was known for his exceptional defense skills.",
            "sent3": "The stopper on the rugby team was nicknamed 'The Wall' for his impenetrable defense.",
            "sent4": "She was like a stopper on the volleyball court, always ready to block the opponent's spikes.",
            "sent5": "The stopper in the hockey game made a crucial save in the final minutes, securing the win for his team."
        }
    ]
}