{
    "term": "stout",
    "meanings": [
        {
            "definition": "Strong in body; sturdy",
            "pos": "adjective",
            "sent1": "The tree trunk was stout and could withstand strong winds.",
            "sent2": "The stout oak table could hold the weight of many books.",
            "sent3": "The stout little squirrel bravely faced the big dog in the yard.",
            "sent4": "Her stout determination to finish the race inspired others to keep going.",
            "sent5": "The stout fortress stood tall against the enemy's attacks."
        },
        {
            "definition": "Bulky in figure; heavily built",
            "pos": "adjective",
            "sent1": "The wrestler had a stout build that made him a formidable opponent.",
            "sent2": "The stout man struggled to fit into the small chair.",
            "sent3": "Despite his stout appearance, he moved with surprising agility.",
            "sent4": "The stout bouncer easily handled rowdy customers at the bar.",
            "sent5": "The stout bear lumbered through the forest, its massive form intimidating other animals."
        },
        {
            "definition": "Bold, brave, or dauntless",
            "pos": "adjective",
            "sent1": "The knight showed a stout heart as he faced the dragon in battle.",
            "sent2": "She gave a stout defense of her beliefs in front of the crowd.",
            "sent3": "The stout firefighter rushed into the burning building to save the trapped family.",
            "sent4": "Her stout courage in the face of danger earned her a medal of honor.",
            "sent5": "The stout explorer ventured into the unknown jungle without fear."
        },
        {
            "definition": "Firm or determined in character",
            "pos": "adjective",
            "sent1": "Despite the challenges, she remained stout in her decision to pursue her dreams.",
            "sent2": "The team captain's stout leadership inspired the players to give their best.",
            "sent3": "His stout refusal to compromise on his principles earned him respect.",
            "sent4": "The stout resolve of the protesters led to positive changes in the community.",
            "sent5": "In the face of criticism, she remained stout in her belief in equality for all."
        }
    ]
}