{
    "term": "straightbreds",
    "meanings": [
        {
            "definition": "Animals of unmixed ancestry, especially in reference to horses or dogs.",
            "pos": "noun",
            "sent1": "The ranch only raised straightbreds, ensuring their lineage was pure.",
            "sent2": "The dog show featured many straightbreds, showcasing their pure ancestry.",
            "sent3": "The straightbreds at the farm had a family reunion, wagging their tails happily.",
            "sent4": "In the world of show horses, straightbreds were the shining stars of the arena.",
            "sent5": "The straightbreds galloped gracefully, their pure lineage evident in every stride."
        },
        {
            "definition": "Purebred animals with a documented lineage.",
            "pos": "noun",
            "sent1": "The kennel club only accepted straightbreds with proper documentation.",
            "sent2": "The straightbreds at the farm had certificates proving their pure lineage.",
            "sent3": "The straightbreds organized a parade to show off their official papers.",
            "sent4": "Among the farm animals, the straightbreds stood out like royalty with their documented lineage.",
            "sent5": "The straightbreds' pedigree was impeccable, making them highly sought after in the market."
        },
        {
            "definition": "Animals bred from a specific, pure lineage.",
            "pos": "noun",
            "sent1": "The breeder focused on producing straightbreds with a specific lineage.",
            "sent2": "The straightbreds in the competition all came from the same pure lineage.",
            "sent3": "The straightbreds formed a club to celebrate their shared pure lineage.",
            "sent4": "The straightbreds were like a family, connected by their specific, pure lineage.",
            "sent5": "The farm only bred straightbreds, ensuring each animal came from a specific, pure lineage."
        }
    ]
}