{
    "term": "strandline",
    "meanings": [
        {
            "definition": "The line of seaweed, debris, and other materials left by the high tide on a beach.",
            "pos": "noun",
            "sent1": "At the strandline, you can find various treasures washed up by the sea.",
            "sent2": "The children played near the strandline, collecting shells and driftwood.",
            "sent3": "The seagull danced along the strandline, looking for a tasty snack.",
            "sent4": "The strandline resembled a natural border between the land and the sea.",
            "sent5": "The colorful seaweed at the strandline painted a beautiful picture on the sand."
        },
        {
            "definition": "To leave or drive (a boat, sailor, etc.) aground or ashore on a strand.",
            "pos": "verb",
            "sent1": "The storm forced the sailors to strandline their boat on the shore.",
            "sent2": "The captain carefully navigated the ship to strandline it safely on the beach.",
            "sent3": "The mischievous pirates decided to strandline their ship as a prank.",
            "sent4": "The decision to strandline the vessel was a last resort in the rough waters.",
            "sent5": "The sailors had to strandline the boat to avoid crashing into the rocks."
        },
        {
            "definition": "To drive or leave (a boat, sailor, etc.) aground or ashore on a strand.",
            "pos": "verb",
            "sent1": "The fisherman had to strandline his boat due to engine failure.",
            "sent2": "The strong currents threatened to strandline the small sailboat on the sandbar.",
            "sent3": "The tourists accidentally strandlined their kayak while exploring the coast.",
            "sent4": "The old sailor shared stories of how he once had to strandline his ship during a storm.",
            "sent5": "The captain skillfully strandlined the vessel to avoid a collision with the pier."
        }
    ]
}