{
    "term": "stramonies",
    "meanings": [
        {
            "definition": "A plant of the nightshade family with poisonous, narcotic properties.",
            "pos": "noun",
            "sent1": "The farmer warned his children to stay away from the stramonies growing near the fence.",
            "sent2": "The herbalist studied the properties of stramonies to understand its effects.",
            "sent3": "The mischievous rabbit dared his friends to nibble on the stramonies leaves.",
            "sent4": "The darkness of the forest whispered secrets of the stramonies plant.",
            "sent5": "The eerie glow of the moonlight revealed the silhouette of the stramonies in the garden."
        },
        {
            "definition": "The dried leaves and seeds of the stramonies plant used for medicinal purposes.",
            "pos": "noun",
            "sent1": "The healer prepared a potion using the powdered stramonies for the sick villager.",
            "sent2": "The pharmacy stocked various herbs, including stramonies, for traditional remedies.",
            "sent3": "The curious cat knocked over the jar of dried stramonies, creating a cloud of dust.",
            "sent4": "The aroma of stramonies filled the room, soothing the patient's cough.",
            "sent5": "The ancient book contained recipes for brewing teas with stramonies for healing."
        },
        {
            "definition": "To be affected by or under the influence of stramonies.",
            "pos": "verb",
            "sent1": "After accidentally inhaling the pollen, he felt himself starting to stramonies.",
            "sent2": "She warned her friend not to stramonies after consuming the strange plant.",
            "sent3": "The comedian joked that his audience seemed to be stramonies from his hilarious performance.",
            "sent4": "The music had a hypnotic effect, causing the listeners to stramonies in a trance.",
            "sent5": "As the potion took effect, he began to stramonies and see vivid colors in his mind."
        }
    ]
}