{
    "term": "strain",
    "meanings": [
        {
            "definition": "To exert oneself to the utmost",
            "pos": "verb",
            "sent1": "She had to strain to lift the heavy box.",
            "sent2": "He strained his muscles while working out at the gym.",
            "sent3": "The little ant tried to strain to carry the giant crumb.",
            "sent4": "The engine strained as it tried to climb the steep hill.",
            "sent5": "With a loud grunt, he strained to open the stubborn jar lid."
        },
        {
            "definition": "To injure by overuse",
            "pos": "verb",
            "sent1": "If you strain your voice, you might lose it.",
            "sent2": "She strained her back from lifting too much weight.",
            "sent3": "He managed to strain his ankle just before the big race.",
            "sent4": "The old rope finally gave way, strained beyond its limit.",
            "sent5": "Be careful not to strain your eyes by staring at the screen for too long."
        },
        {
            "definition": "A group of organisms within a species",
            "pos": "noun",
            "sent1": "The new strain of bacteria was resistant to antibiotics.",
            "sent2": "Scientists studied the genetic makeup of the strain of fruit flies.",
            "sent3": "The strain of fish in the pond seemed to be thriving.",
            "sent4": "The strain of virus was spreading rapidly through the population.",
            "sent5": "The strain of wheat developed by the researchers was more resilient to drought."
        },
        {
            "definition": "A particular kind, sort, or type",
            "pos": "noun",
            "sent1": "This strain of roses has a beautiful fragrance.",
            "sent2": "The chef used a special strain of chili peppers in the dish.",
            "sent3": "The strain of music playing in the background was soothing.",
            "sent4": "The strain of fabric used for the dress was soft and comfortable.",
            "sent5": "I prefer this strain of tea over the other varieties."
        },
        {
            "definition": "Pressure, force, or stress on an object",
            "pos": "noun",
            "sent1": "The strain on the bridge caused it to collapse.",
            "sent2": "The strain on the rope was too much for it to bear.",
            "sent3": "The strain on the tree branch made it bend under the weight.",
            "sent4": "The strain on the athlete's body was evident after the race.",
            "sent5": "The strain on the dam threatened its stability."
        }
    ]
}