{
    "term": "strafer",
    "meanings": [
        {
            "definition": "A person or thing that strafes.",
            "pos": "noun",
            "sent1": "The strafer flew over the battlefield, raining bullets down on the enemy below.",
            "sent2": "The military pilot was known as a skilled strafer, always hitting the target accurately.",
            "sent3": "The little toy plane was pretending to be a strafer, shooting imaginary enemies with tiny plastic bullets.",
            "sent4": "Her words were like a strafer, hitting me with harsh criticism one after another.",
            "sent5": "The image of the strafer in the sky was etched in my memory, a symbol of danger and destruction."
        },
        {
            "definition": "To attack ground targets from a low-flying aircraft with machine-gun fire or bombs.",
            "pos": "verb",
            "sent1": "The pilot will strafer the enemy base tomorrow, aiming to destroy their defenses.",
            "sent2": "During the war, the aircraft would strafer the enemy positions to weaken their forces.",
            "sent3": "The birds in the sky seemed to strafer the picnic below, dropping crumbs on unsuspecting people.",
            "sent4": "His words seemed to strafer her heart, piercing through her defenses and leaving her vulnerable.",
            "sent5": "The storm clouds gathered ominously, ready to strafer the town with rain and lightning."
        },
        {
            "definition": "To attack with machine-gun fire or bombs from a low-flying aircraft.",
            "pos": "verb",
            "sent1": "The fighter jets would strafer the enemy ships, causing chaos and destruction on the water.",
            "sent2": "The bombers were ordered to strafer the enemy's supply lines, cutting off their resources.",
            "sent3": "The mischievous squirrel seemed to strafer the garden with acorns, dropping them from the trees above.",
            "sent4": "Her laughter was like a strafer, breaking through the tension in the room with bursts of joy.",
            "sent5": "The fireworks lit up the night sky, ready to strafer the darkness with bursts of color and light."
        }
    ]
}