{
    "term": "strained",
    "meanings": [
        {
            "definition": "Stretched or pulled to the limit",
            "pos": "adjective",
            "sent1": "The old rope looked strained and ready to snap.",
            "sent2": "The strained muscles in his arms ached after lifting the heavy boxes.",
            "sent3": "The strained rubber band made a funny noise when it finally snapped.",
            "sent4": "Her strained smile did not hide the sadness in her eyes.",
            "sent5": "The strained relationship between the two countries led to a tense standoff."
        },
        {
            "definition": "Showing signs of tension or effort",
            "pos": "adjective",
            "sent1": "Her strained voice revealed her nervousness during the presentation.",
            "sent2": "The strained expression on his face indicated his struggle with the difficult task.",
            "sent3": "The strained silence in the room made everyone feel uncomfortable.",
            "sent4": "The strained atmosphere at the meeting was palpable.",
            "sent5": "His strained attempt at humor fell flat with the audience."
        },
        {
            "definition": "Filtered or extracted by passing through a sieve or cloth",
            "pos": "adjective",
            "sent1": "The strained yogurt had a smooth and creamy texture.",
            "sent2": "She used a strained to separate the seeds from the freshly squeezed juice.",
            "sent3": "The strained tea leaves left a residue at the bottom of the cup.",
            "sent4": "The strained broth was clear and free of impurities.",
            "sent5": "The strained pasta sauce was thick and rich in flavor."
        },
        {
            "definition": "Forced or unnatural in manner or tone",
            "pos": "adjective",
            "sent1": "Her strained laughter sounded forced and insincere.",
            "sent2": "He gave a strained apology that did not seem genuine.",
            "sent3": "The strained conversation felt awkward and uncomfortable.",
            "sent4": "His strained performance on stage lacked authenticity.",
            "sent5": "The strained dialogue in the movie felt contrived and artificial."
        }
    ]
}