{
    "term": "straddles",
    "meanings": [
        {
            "definition": "To sit or stand with one leg on either side of something.",
            "pos": "verb",
            "sent1": "The cowboy straddles the horse before riding off into the sunset.",
            "sent2": "She straddles the fence while chatting with her neighbor.",
            "sent3": "The acrobat straddles the balance beam with ease, showcasing her skills.",
            "sent4": "His loyalty straddles between two conflicting groups, causing tension.",
            "sent5": "The giant straddles the river, creating a majestic sight for all to see."
        },
        {
            "definition": "To be on both sides of or to extend across something.",
            "pos": "verb",
            "sent1": "The bridge straddles the river, connecting the two banks.",
            "sent2": "The tree straddles the property line between the two neighbors.",
            "sent3": "The rainbow straddles the sky after the rain, bringing joy to all who see it.",
            "sent4": "His responsibilities straddle work and family, making it challenging to balance.",
            "sent5": "The mountain range straddles the horizon, creating a breathtaking view."
        },
        {
            "definition": "A position in options trading where an investor holds both a call option and a put option on the same underlying asset at the same strike price and expiration date.",
            "pos": "noun",
            "sent1": "The investor's straddles on the stock market proved to be profitable.",
            "sent2": "She decided to enter a straddle to hedge against market volatility.",
            "sent3": "The financial expert explained the concept of straddles to the new investors.",
            "sent4": "His successful straddle strategy earned him a significant return on investment.",
            "sent5": "The straddle on the cryptocurrency market was a risky move, but it paid off in the end."
        }
    ]
}