{
    "term": "stranding",
    "meanings": [
        {
            "definition": "The act of leaving someone in a difficult situation without help or support.",
            "pos": "noun",
            "sent1": "After the storm, the shipwreck survivors faced a heartbreaking stranding on the deserted island.",
            "sent2": "The hiker's unexpected stranding in the wilderness led to a rescue mission.",
            "sent3": "The comedy movie portrayed a hilarious stranding scenario where the main character got stuck in an elevator.",
            "sent4": "Her sudden illness caused a stranding in her plans, leaving her feeling lost and alone.",
            "sent5": "The abandoned puppy's stranding on the cold street touched the hearts of many passersby."
        },
        {
            "definition": "The action of becoming stuck on a beach or shore.",
            "pos": "noun",
            "sent1": "The whale's stranding on the sandy shore puzzled marine biologists.",
            "sent2": "During the tide, the boat experienced a stranding on the rocky beach.",
            "sent3": "The seagull's accidental stranding on the crowded beach caused quite a commotion.",
            "sent4": "The old ship's rusted hull showed signs of past stranding incidents.",
            "sent5": "The tourist's camera captured the dramatic stranding of a dolphin on the shore."
        },
        {
            "definition": "The process of separating strands of a material.",
            "pos": "noun",
            "sent1": "The stranding of the yarn created a unique texture in the fabric.",
            "sent2": "The artisan demonstrated the delicate process of stranding threads for embroidery.",
            "sent3": "During the craft fair, visitors marveled at the intricate stranding technique used in the handmade baskets.",
            "sent4": "The stranding of the wires required precision to ensure a secure connection.",
            "sent5": "The classroom activity involved the students practicing the art of stranding different colored strings."
        }
    ]
}