{
    "term": "strangered",
    "meanings": [
        {
            "definition": "To make someone feel isolated or alienated.",
            "pos": "verb",
            "sent1": "She strangered her friend by ignoring her at the party.",
            "sent2": "The new student felt strangered in a school where everyone already knew each other.",
            "sent3": "The mischievous ghost strangered the guests by moving objects around the house.",
            "sent4": "The thick fog strangered the familiar landscape, making it seem eerie and unfamiliar.",
            "sent5": "The loud music and flashing lights at the concert strangered her senses, overwhelming her with a sense of isolation."
        },
        {
            "definition": "To be or become a stranger to someone.",
            "pos": "verb",
            "sent1": "After moving to a new city, she quickly strangered herself from her old friends.",
            "sent2": "Over time, their differences in opinions strangered them from each other.",
            "sent3": "The magic potion accidentally strangered the cat, causing it to act strangely.",
            "sent4": "The mysterious disappearance of the treasure map strangered their chances of finding the hidden gold.",
            "sent5": "The thick fog strangered the path ahead, making it difficult to see where they were going."
        },
        {
            "definition": "The state of being estranged or feeling disconnected from others.",
            "pos": "noun",
            "sent1": "His constant traveling led to a sense of strangered from his family.",
            "sent2": "The argument caused a feeling of strangered between the two friends.",
            "sent3": "The comedy show highlighted the absurdity of feeling strangered in a crowded room.",
            "sent4": "The empty streets at night gave a sense of strangered to the usually bustling city.",
            "sent5": "The protagonist's internal struggle with feeling strangered resonated with many readers."
        }
    ]
}