{
    "term": "strangulations",
    "meanings": [
        {
            "definition": "The act of strangling or choking someone.",
            "pos": "noun",
            "sent1": "The criminal was arrested for committing strangulations on his victims.",
            "sent2": "The detective found evidence of strangulations at the crime scene.",
            "sent3": "The comedy show featured a hilarious skit about mistaken strangulations.",
            "sent4": "The tension in the room was like a cloud of strangulations, suffocating everyone.",
            "sent5": "The image of the snake's strangulations on its prey was etched in his mind."
        },
        {
            "definition": "The state of being strangled or choked.",
            "pos": "noun",
            "sent1": "The survivor described the feeling of strangulations during the attack.",
            "sent2": "The doctor recognized the symptoms of strangulations in the patient.",
            "sent3": "The cartoon character comically exaggerated his own strangulations in a silly scene.",
            "sent4": "The silence in the room was a heavy blanket of strangulations, making it hard to breathe.",
            "sent5": "The painting depicted the victim's face in the midst of strangulations, capturing the horror."
        },
        {
            "definition": "The restriction or obstruction of something, such as blood flow or airflow.",
            "pos": "noun",
            "sent1": "The doctor explained the dangers of blood strangulations in the body.",
            "sent2": "The engineer worked to prevent airflow strangulations in the ventilation system.",
            "sent3": "The traffic jam caused a comical strangulations of cars on the highway.",
            "sent4": "The tension in the room created a strangulations of ideas, stifling creativity.",
            "sent5": "The image of the dam represented a strangulations of water flow, halting the river."
        }
    ]
}