{
    "term": "streps",
    "meanings": [
        {
            "definition": "A group of bacteria that are typically spherical in shape and form chains.",
            "pos": "noun",
            "sent1": "Under the microscope, the streps looked like tiny round beads linked together.",
            "sent2": "The doctor identified the streps in the culture as streptococcus bacteria.",
            "sent3": "The streps in the petri dish decided to form a chain and do the bacteria conga.",
            "sent4": "The streps in the lab were like a string of pearls, each one connected to the next.",
            "sent5": "The streps multiplied rapidly, creating a long chain of bacterial cells."
        },
        {
            "definition": "A prefix meaning twisted or curved.",
            "pos": "noun",
            "sent1": "The word 'streps' at the beginning of the term made it clear that the shape was twisted.",
            "sent2": "In geometry, 'streps' is used to describe a curved line or surface.",
            "sent3": "The artist used the streps prefix to give the sculpture a unique twisted appearance.",
            "sent4": "The streps prefix added a sense of complexity and curvature to the design.",
            "sent5": "The streps in the word made it seem like the shape was bending and turning."
        },
        {
            "definition": "The plural form of the word 'strep', which is short for streptococcus, a type of bacteria.",
            "pos": "noun",
            "sent1": "The doctor confirmed that the patient had streps, indicating a bacterial infection.",
            "sent2": "The streps in the lab samples showed high levels of streptococcus bacteria.",
            "sent3": "The streps in the report revealed the presence of harmful bacteria in the patient's system.",
            "sent4": "The streps on the test results were a clear sign of the bacterial infection.",
            "sent5": "The streps in the throat culture indicated the need for antibiotic treatment."
        }
    ]
}