{
    "term": "stretching",
    "meanings": [
        {
            "definition": "To extend or lengthen",
            "pos": "verb",
            "sent1": "I am stretching my arms to reach the top shelf.",
            "sent2": "She enjoys stretching her legs before going for a run.",
            "sent3": "The cat is stretching its body to fit into the small box.",
            "sent4": "His patience is stretching thin as he waits for the delayed train.",
            "sent5": "The rubber band was stretching to its limit before snapping."
        },
        {
            "definition": "To reach or pull something in order to make it longer or wider",
            "pos": "verb",
            "sent1": "He is stretching the rubber band to see how far it can go.",
            "sent2": "The baker is stretching the dough to make a large pizza.",
            "sent3": "The child is stretching the truth about finishing homework.",
            "sent4": "Her smile is stretching across her face as she receives good news.",
            "sent5": "The artist is stretching the canvas to prepare it for painting."
        },
        {
            "definition": "To make something more flexible or elastic by pulling it",
            "pos": "verb",
            "sent1": "The athlete is stretching his muscles before the race.",
            "sent2": "She is stretching the rubber band to make it easier to use.",
            "sent3": "The teacher is stretching the truth to make the story more interesting.",
            "sent4": "His imagination is stretching to create new worlds in his stories.",
            "sent5": "The fabric is stretching to accommodate the growing plant."
        },
        {
            "definition": "To extend beyond normal limits",
            "pos": "verb",
            "sent1": "The river is stretching its banks after heavy rain.",
            "sent2": "His ambition is stretching beyond what others thought possible.",
            "sent3": "The balloon is stretching the air inside to stay afloat.",
            "sent4": "Her voice is stretching across the auditorium during the performance.",
            "sent5": "The city is stretching its resources to support the growing population."
        }
    ]
}