{
    "term": "strep",
    "meanings": [
        {
            "definition": "A type of bacteria that can cause infections in the throat and other parts of the body.",
            "pos": "noun",
            "sent1": "The doctor prescribed antibiotics to treat the strep infection in my throat.",
            "sent2": "Strep bacteria can spread easily in crowded places like schools.",
            "sent3": "I told the strep bacteria in my throat to take a vacation, but they refused!",
            "sent4": "The strep bacteria multiplied rapidly, like an army invading a territory.",
            "sent5": "The strep infection felt like tiny invaders attacking my body."
        },
        {
            "definition": "Short for streptococcus, a genus of bacteria that includes the species responsible for strep throat.",
            "pos": "noun",
            "sent1": "The lab results confirmed the presence of strep in the throat culture.",
            "sent2": "Strep is often detected through a simple swab test at the doctor's office.",
            "sent3": "The strep bacteria threw a party in my throat, causing all the trouble!",
            "sent4": "The strep genus dominated the bacterial community, like a king ruling over his subjects.",
            "sent5": "The strep throat bacteria were like troublemakers disrupting the peace in my body."
        },
        {
            "definition": "An abbreviation for streptococcal, relating to or caused by streptococcus bacteria.",
            "pos": "adjective",
            "sent1": "The doctor diagnosed me with a strep infection after the test results.",
            "sent2": "Strep treatments are usually effective when started early.",
            "sent3": "I felt like a superhero fighting off the strep invaders in my body!",
            "sent4": "The strep-related symptoms were like warning signs of an impending storm.",
            "sent5": "The strep bacteria were like sneaky spies causing chaos in my system."
        }
    ]
}