{
    "term": "stretchering",
    "meanings": [
        {
            "definition": "The act of carrying or transporting someone on a stretcher.",
            "pos": "noun",
            "sent1": "The stretchering of the injured hiker down the mountain was done carefully.",
            "sent2": "The paramedics performed the stretchering swiftly to get the patient to the hospital.",
            "sent3": "During the training exercise, the team practiced stretchering each other around the field.",
            "sent4": "The stretchering of the patient symbolized the importance of quick medical response.",
            "sent5": "The stretchering process requires coordination and teamwork to be effective."
        },
        {
            "definition": "The process of securing someone to a stretcher for transportation.",
            "pos": "noun",
            "sent1": "Proper stretchering involves ensuring the patient is safely strapped in.",
            "sent2": "The EMTs followed the protocol for stretchering the accident victim onto the stretcher.",
            "sent3": "The comical movie scene showed a clumsy attempt at stretchering a character onto a stretcher.",
            "sent4": "In the chaos of the emergency room, the stretchering of patients was a well-oiled machine.",
            "sent5": "The firefighter demonstrated the correct technique for stretchering a person during the drill."
        },
        {
            "definition": "The use of a stretcher to move an injured person.",
            "pos": "noun",
            "sent1": "The stretchering of the patient from the car accident was done with caution.",
            "sent2": "In emergencies, the stretchering of individuals is crucial for their safety.",
            "sent3": "The children pretended to be stretchering their toys on miniature stretchers.",
            "sent4": "The stretcher became a symbol of hope during the stretchering of the earthquake survivors.",
            "sent5": "The stretcher is an essential tool for the stretchering of injured athletes off the field."
        }
    ]
}