{
    "term": "stretto",
    "meanings": [
        {
            "definition": "A passage of music where the theme is repeated in a faster tempo",
            "pos": "noun",
            "sent1": "During the concert, the orchestra played a beautiful stretto that captivated the audience.",
            "sent2": "The composer cleverly incorporated a stretto into the symphony, adding excitement to the piece.",
            "sent3": "The musicians jokingly called the fast-paced section a stretto race, trying to outplay each other.",
            "sent4": "In the crescendo of notes, the stretto emerged like a whirlwind, sweeping the listeners into a musical frenzy.",
            "sent5": "The conductor emphasized the stretto, making it the heart of the composition."
        },
        {
            "definition": "A point in a fugue where the subject is imitated before it has been completed",
            "pos": "noun",
            "sent1": "The fugue reached a thrilling stretto, where the melody echoed in quick succession.",
            "sent2": "In the musical piece, the stretto created a sense of anticipation and unity among the instruments.",
            "sent3": "The unexpected stretto in the fugue left the audience pleasantly surprised, like a musical plot twist.",
            "sent4": "As the notes intertwined in a stretto, it felt like a dance of melodies in perfect harmony.",
            "sent5": "The composer's use of stretto added a layer of complexity and intrigue to the fugue."
        },
        {
            "definition": "A close or narrow passage in a building or street",
            "pos": "noun",
            "sent1": "The alley was so stretto that only one person could pass through at a time.",
            "sent2": "The stretto between the buildings created a sense of coziness in the neighborhood.",
            "sent3": "The stretto in the old town was like a hidden gem, known only to the locals.",
            "sent4": "Navigating the stretto alleyways felt like a journey through a maze of history.",
            "sent5": "The stretto street was bustling with activity, filled with the sounds of vendors and chatter."
        }
    ]
}