{
    "term": "stretchability",
    "meanings": [
        {
            "definition": "The ability to be stretched.",
            "pos": "noun",
            "sent1": "The rubber band's stretchability allowed it to expand easily.",
            "sent2": "I was impressed by the fabric's stretchability as it stretched to fit perfectly.",
            "sent3": "The superhero's cape had incredible stretchability, making it look like it could reach the sky.",
            "sent4": "Her patience had a stretchability that seemed endless, like a rubber band that never snaps.",
            "sent5": "The balloon's stretchability was tested as it expanded to its limit without popping."
        },
        {
            "definition": "The quality of being able to stretch.",
            "pos": "noun",
            "sent1": "The yoga pants' stretchability made them comfortable for any movement.",
            "sent2": "Athletes appreciate clothing with good stretchability for flexibility during sports.",
            "sent3": "The clown's pants had such great stretchability that they could fit anyone, no matter the size.",
            "sent4": "Her determination had a stretchability that allowed her to overcome any obstacle.",
            "sent5": "The rubber band's impressive stretchability made it useful for various tasks."
        },
        {
            "definition": "The state of being stretchable.",
            "pos": "noun",
            "sent1": "The fabric's stretchability made it ideal for making form-fitting clothes.",
            "sent2": "The toy's stretchability meant it could be pulled and twisted without breaking.",
            "sent3": "The comedian's jokes had a stretchability that kept the audience laughing for hours.",
            "sent4": "His creativity had a stretchability that allowed him to come up with new ideas constantly.",
            "sent5": "The elastic's stretchability made it perfect for creating adjustable waistbands."
        }
    ]
}