{
    "term": "strikes",
    "meanings": [
        {
            "definition": "To hit forcibly or sharply",
            "pos": "verb",
            "sent1": "He strikes the ball with great force.",
            "sent2": "The hammer strikes the nail into the wood.",
            "sent3": "The idea of a flying superhero striking down villains is exciting.",
            "sent4": "Her words struck him like a physical blow.",
            "sent5": "The lightning strikes the tree, splitting it in half."
        },
        {
            "definition": "To ignite or light",
            "pos": "verb",
            "sent1": "He strikes a match to light the candle.",
            "sent2": "The flint strikes against the steel, creating a spark.",
            "sent3": "The image of a chef striking a match to start a fire in the kitchen is amusing.",
            "sent4": "The sun striking the horizon painted the sky in hues of orange and pink.",
            "sent5": "The match strikes against the rough surface, igniting a flame."
        },
        {
            "definition": "To discover or realize",
            "pos": "verb",
            "sent1": "It strikes him suddenly that he forgot his keys.",
            "sent2": "She strikes upon a brilliant idea for the project.",
            "sent3": "The thought of a cat striking upon a hidden treasure is amusing.",
            "sent4": "The truth finally strikes her, and she understands everything.",
            "sent5": "The realization strikes him like a bolt of lightning."
        },
        {
            "definition": "To stop work as a form of protest",
            "pos": "verb",
            "sent1": "The workers decide to go on strikes for better wages.",
            "sent2": "They strike to demand safer working conditions.",
            "sent3": "The image of a group of workers striking for longer lunch breaks is amusing.",
            "sent4": "The decision to strike against unfair treatment was a bold one.",
            "sent5": "The workers strike together, united for their cause."
        },
        {
            "definition": "A sudden occurrence or event",
            "pos": "noun",
            "sent1": "The lightning strike was followed by a loud thunderclap.",
            "sent2": "The sudden strike of inspiration led to a breakthrough in the project.",
            "sent3": "The idea of a surprise party strike for his birthday is amusing.",
            "sent4": "The strike of fate changed the course of his life forever.",
            "sent5": "The unexpected strike of luck turned the tables in his favor."
        }
    ]
}