{
    "term": "stripping",
    "meanings": [
        {
            "definition": "Remove clothing or covering from oneself or someone else.",
            "pos": "verb",
            "sent1": "She was stripping off her wet clothes after playing in the rain.",
            "sent2": "The actor was stripping down to change into his costume for the next scene.",
            "sent3": "As the superhero struggled to change into his costume, he ended up stripping in front of the crowd.",
            "sent4": "The artist was stripping away the layers of paint to reveal the original colors of the canvas.",
            "sent5": "The magician amazed the audience by stripping off his cloak to reveal a dove hidden inside."
        },
        {
            "definition": "Remove the leaves or branches from a plant.",
            "pos": "verb",
            "sent1": "She was carefully stripping the leaves from the stem of the flower.",
            "sent2": "The gardener was stripping the dead leaves from the plant to help it grow better.",
            "sent3": "The mischievous squirrel was stripping the leaves off the tree to build its nest.",
            "sent4": "The wind was stripping the leaves from the trees, creating a colorful carpet on the ground.",
            "sent5": "The farmer was stripping the branches from the tree to prepare it for pruning."
        },
        {
            "definition": "Remove the paint or varnish from a surface.",
            "pos": "verb",
            "sent1": "He was carefully stripping the old paint from the wooden chair.",
            "sent2": "The renovation crew was stripping the walls to prepare them for a fresh coat of paint.",
            "sent3": "The mischievous child was stripping the paint off the fence with a stick.",
            "sent4": "The artist was stripping the varnish from the canvas to start a new painting.",
            "sent5": "The DIY enthusiast was stripping the old varnish from the table to refinish it."
        },
        {
            "definition": "Remove the possessions or assets from someone or something.",
            "pos": "verb",
            "sent1": "The thief was caught stripping the valuables from the safe.",
            "sent2": "The company was accused of stripping the resources from the local community.",
            "sent3": "The naughty puppy was stripping the socks from the laundry basket.",
            "sent4": "The economic crisis was stripping the country of its financial stability.",
            "sent5": "The vandals were stripping the copper wiring from the abandoned building."
        }
    ]
}