{
    "term": "strikeouts",
    "meanings": [
        {
            "definition": "A situation in which a batter is out after three strikes.",
            "pos": "noun",
            "sent1": "In baseball, a player gets a strikeout when the batter misses the ball three times.",
            "sent2": "The pitcher celebrated after getting a strikeout to end the inning.",
            "sent3": "The batter's strikeout was so quick, it seemed like he blinked and missed all three pitches.",
            "sent4": "Her strikeout in the game was like a sudden gust of wind, leaving the batter puzzled.",
            "sent5": "The strikeout echoed through the stadium, marking the end of the intense match."
        },
        {
            "definition": "The act of recording a strikeout as a pitcher.",
            "pos": "noun",
            "sent1": "After the game, the pitcher proudly added his strikeout to the season's tally.",
            "sent2": "The announcer noted each strikeout as the pitcher dominated the game.",
            "sent3": "The pitcher's strikeout was so precise, it felt like a perfectly timed dance move.",
            "sent4": "His strikeout was a bold brushstroke on the canvas of the game.",
            "sent5": "The strikeout was like a punctuation mark at the end of the pitcher's sentence."
        },
        {
            "definition": "The total number of strikeouts in a game or season.",
            "pos": "noun",
            "sent1": "The team's victory was sealed with an impressive number of strikeouts in the game.",
            "sent2": "The season ended with a record-breaking total of strikeouts for the pitcher.",
            "sent3": "The total strikeouts for the game were so high, it felt like fireworks lighting up the scoreboard.",
            "sent4": "The strikeouts piled up like fallen leaves in autumn, marking the end of the season.",
            "sent5": "Each strikeout added to the total was a step closer to victory for the team."
        }
    ]
}