{
    "term": "strike",
    "meanings": [
        {
            "definition": "Hit forcibly and deliberately with one's hand or a weapon.",
            "pos": "verb",
            "sent1": "He tried to strike the nail with the hammer.",
            "sent2": "The boxer aimed to strike his opponent with a powerful punch.",
            "sent3": "The mischievous child pretended to strike his friend with a toy sword.",
            "sent4": "Her words seemed to strike a chord with the audience.",
            "sent5": "The lightning strike was followed by a deafening thunderclap."
        },
        {
            "definition": "Refuse to work as a form of organized protest.",
            "pos": "verb",
            "sent1": "Workers decided to strike for better wages.",
            "sent2": "The employees threatened to strike if their demands were not met.",
            "sent3": "The ants seemed to strike against carrying the heavy load.",
            "sent4": "Her idea to strike on Mondays was met with mixed reactions.",
            "sent5": "The students planned to strike until their voices were heard."
        },
        {
            "definition": "A sudden attack or military action.",
            "pos": "noun",
            "sent1": "The surprise strike caught the enemy off guard.",
            "sent2": "The army prepared for a preemptive strike against the enemy forces.",
            "sent3": "The cat's playful strike on the toy mouse amused the children.",
            "sent4": "The strike of the clock signaled the end of the meeting.",
            "sent5": "The snake's strike was swift and deadly."
        },
        {
            "definition": "A discovery or realization.",
            "pos": "noun",
            "sent1": "The scientist's strike led to a breakthrough in the research.",
            "sent2": "Her sudden strike of inspiration resulted in a new invention.",
            "sent3": "The strike of genius hit him while he was in the shower.",
            "sent4": "The strike of truth hit her like a ton of bricks.",
            "sent5": "The strike of insight illuminated the solution to the problem."
        }
    ]
}