{
    "term": "stroppiest",
    "meanings": [
        {
            "definition": "Bad-tempered or irritable",
            "pos": "adjective",
            "sent1": "She was the stroppiest person in the office, always frowning and snapping at everyone.",
            "sent2": "The cat looked stroppiest when someone tried to pet it against its will.",
            "sent3": "Even the grumpy old bear seemed less stroppiest than her when she was in a bad mood.",
            "sent4": "His car, with its squeaky brakes and stubborn engine, was the stroppiest vehicle on the road.",
            "sent5": "The storm clouds gathered in a stroppiest manner, ready to unleash their fury."
        },
        {
            "definition": "Showing a tendency to argue or be difficult",
            "pos": "adjective",
            "sent1": "The stroppiest child in the class always had a counterargument for everything.",
            "sent2": "The teenager's stroppiest behavior made it hard for his parents to reason with him.",
            "sent3": "The stubborn goat was the stroppiest member of the herd, always wanting things its way.",
            "sent4": "The old rusty gate was the stroppiest entrance to the garden, often getting stuck halfway.",
            "sent5": "The river took the stroppiest route through the valley, winding and twisting unpredictably."
        },
        {
            "definition": "Easily annoyed or angered",
            "pos": "adjective",
            "sent1": "He was the stroppiest person to deal with when he hadn't had his morning coffee.",
            "sent2": "The cat was at its stroppiest when its food bowl was empty.",
            "sent3": "The computer seemed to be the stroppiest device in the office, crashing at the slightest provocation.",
            "sent4": "The old door was the stroppiest part of the house, creaking loudly at any movement.",
            "sent5": "The wind became stroppiest at sunset, howling and rattling the windows."
        }
    ]
}