{
    "term": "strout",
    "meanings": [
        {
            "definition": "To stick out or project",
            "pos": "verb",
            "sent1": "The tree branch will strout above the others in the forest.",
            "sent2": "I saw a colorful flower strout from the green bushes.",
            "sent3": "The cat tried to hide, but its tail continued to strout comically.",
            "sent4": "Her excitement strouted from her like a bright flag waving in the wind.",
            "sent5": "The sun strouted over the horizon, painting the sky with vibrant colors."
        },
        {
            "definition": "A type of fish",
            "pos": "noun",
            "sent1": "The fisherman caught a big strout in the river.",
            "sent2": "We grilled some delicious strout for dinner last night.",
            "sent3": "The strout in the aquarium seemed to be playing hide and seek.",
            "sent4": "The shiny scales of the strout shimmered under the sunlight.",
            "sent5": "The strout gracefully swam against the gentle current of the stream."
        },
        {
            "definition": "A type of fabric",
            "pos": "noun",
            "sent1": "She sewed a beautiful dress using soft strout material.",
            "sent2": "The curtains were made of a delicate strout that let in just the right amount of light.",
            "sent3": "The strout fabric felt smooth and cool against her skin.",
            "sent4": "The strout cloth draped elegantly over the table, adding a touch of sophistication.",
            "sent5": "The strout fabric rustled softly as she moved, creating a soothing sound."
        },
        {
            "definition": "A type of plant",
            "pos": "noun",
            "sent1": "The garden was filled with colorful strout blooming in every corner.",
            "sent2": "She carefully watered the strout in her backyard garden.",
            "sent3": "The tiny strout in the pot seemed to be reaching for the sunlight.",
            "sent4": "The leaves of the strout rustled in the breeze, creating a calming sound.",
            "sent5": "The sweet fragrance of the strout filled the air, attracting butterflies and bees."
        }
    ]
}