{
    "term": "stroys",
    "meanings": [
        {
            "definition": "Destroy",
            "pos": "verb",
            "sent1": "The strong wind stroys the sandcastles on the beach.",
            "sent2": "The wrecking ball stroys the old building to make space for a new one.",
            "sent3": "The mischievous puppy stroys the carefully arranged pillows on the couch.",
            "sent4": "Time stroys all things, like waves eroding the shore.",
            "sent5": "The fire stroys the forest, leaving only ashes behind."
        },
        {
            "definition": "Destroys",
            "pos": "verb",
            "sent1": "The tornado stroys everything in its path, leaving devastation behind.",
            "sent2": "Negativity stroys the possibility of finding solutions to problems.",
            "sent3": "The clumsy waiter accidentally stroys the elaborate cake before the party.",
            "sent4": "Greed stroys relationships faster than anything else.",
            "sent5": "The virus stroys the body's defenses, making it vulnerable to illness."
        },
        {
            "definition": "Destroyed",
            "pos": "adjective",
            "sent1": "The abandoned house looked completely stroyed, with broken windows and overgrown weeds.",
            "sent2": "The stroyed car was beyond repair after the severe crash.",
            "sent3": "The stroyed toy lay forgotten in the corner of the room.",
            "sent4": "The stroyed city bore the scars of war, with buildings in ruins.",
            "sent5": "The stroyed bridge could no longer connect the two sides of the river."
        },
        {
            "definition": "Destroying",
            "pos": "verb",
            "sent1": "The constant noise outside is slowly stroying my concentration.",
            "sent2": "The invasive species is destroying the natural habitat of many animals.",
            "sent3": "The loud music is destroying my ears!",
            "sent4": "The toxic relationship is destroying her self-esteem bit by bit.",
            "sent5": "The pollution is destroying the environment, harming plants and animals."
        }
    ]
}