{
    "term": "stroke",
    "meanings": [
        {
            "definition": "An act of hitting or striking someone or something with the hand or an object.",
            "pos": "noun",
            "sent1": "He gave the table a gentle stroke to clean off the dust.",
            "sent2": "The boxer delivered a powerful stroke to his opponent's jaw.",
            "sent3": "The cat's stroke on the toy mouse made it seem alive.",
            "sent4": "Her stroke of genius in the game surprised everyone.",
            "sent5": "The stroke of the clock marked the end of the hour."
        },
        {
            "definition": "A sudden disabling attack or loss of consciousness caused by an interruption in the flow of blood to the brain.",
            "pos": "noun",
            "sent1": "After the stroke, he had to relearn how to walk.",
            "sent2": "She recognized the symptoms of a stroke and called for help.",
            "sent3": "The sudden power outage was like a stroke to the building.",
            "sent4": "The unexpected news hit her like a stroke of lightning.",
            "sent5": "The stroke of bad luck left him feeling helpless."
        },
        {
            "definition": "A single movement of a pen or brush in forming a letter or character.",
            "pos": "noun",
            "sent1": "With one stroke, he completed the letter 'A'.",
            "sent2": "Her calligraphy was impeccable, each stroke precise.",
            "sent3": "The stroke of the pen seemed to dance on the paper.",
            "sent4": "His strokes on the canvas created a masterpiece.",
            "sent5": "The bold stroke of the artist's brush captured attention."
        },
        {
            "definition": "To move one's hand gently along the surface of something.",
            "pos": "verb",
            "sent1": "She would often stroke her cat's fur to calm it down.",
            "sent2": "He decided to stroke the fabric to check its softness.",
            "sent3": "The magician's trick involved stroking the air as if casting a spell.",
            "sent4": "The wind gently stroked the leaves on the tree branches.",
            "sent5": "She would stroke the keys of the piano with grace."
        }
    ]
}