{
    "term": "strumatic",
    "meanings": [
        {
            "definition": "Causing or characterized by strife or conflict.",
            "pos": "adjective",
            "sent1": "The argument between the siblings became strumatic when they couldn't agree on a movie to watch.",
            "sent2": "The strumatic situation in the office led to a lot of tension among the coworkers.",
            "sent3": "The strumatic debate over the best flavor of ice cream got quite intense at the family gathering.",
            "sent4": "The political climate in the country was strumatic, with protests and disagreements at every turn.",
            "sent5": "The strumatic relationship between the two rival gangs often resulted in violent clashes."
        },
        {
            "definition": "A person who is prone to causing or being involved in conflict.",
            "pos": "noun",
            "sent1": "He was known as a strumatic in school because he always found himself in arguments with others.",
            "sent2": "The strumatic in the group couldn't resist starting a debate during the meeting.",
            "sent3": "The family reunion was lively with the presence of the strumatic who loved a good debate.",
            "sent4": "She was like a strumatic magnet, attracting disagreements wherever she went.",
            "sent5": "The strumatic was always at the center of any conflict, unable to stay out of arguments."
        },
        {
            "definition": "To engage in or incite conflict or strife.",
            "pos": "verb",
            "sent1": "He tends to strumatic whenever there is a difference of opinion, stirring up unnecessary arguments.",
            "sent2": "The group decided not to strumatic further and instead focus on finding a solution.",
            "sent3": "She would often strumatic just for the fun of seeing people's reactions.",
            "sent4": "The politician's speech seemed to strumatic the crowd, leading to heated discussions.",
            "sent5": "The online post managed to strumatic a whole community, sparking intense debates."
        }
    ]
}