{
    "term": "stubbies",
    "meanings": [
        {
            "definition": "Short, thick beer bottles",
            "pos": "noun",
            "sent1": "At the party, everyone enjoyed the cold stubbies of beer.",
            "sent2": "The bartender handed out stubbies of beer to the thirsty customers.",
            "sent3": "The fridge was full of stubbies, ready to quench our thirst.",
            "sent4": "The stubbies clinked together as friends raised a toast.",
            "sent5": "The label on the stubbies showed the brand's logo clearly."
        },
        {
            "definition": "Short, thick cigars",
            "pos": "noun",
            "sent1": "Grandpa liked to relax on the porch with his favorite stubbies.",
            "sent2": "The aroma of the stubbies filled the room during the poker game.",
            "sent3": "The fancy party had a special corner for the stubbies enthusiasts.",
            "sent4": "The smoke from the stubbies curled in the air like a lazy snake.",
            "sent5": "The ash from the stubbies fell gently onto the ashtray."
        },
        {
            "definition": "Short, thick pieces of wood or metal",
            "pos": "noun",
            "sent1": "The carpenter used the stubbies to reinforce the structure.",
            "sent2": "The artist welded the stubbies together to create a unique sculpture.",
            "sent3": "The stubbies were too short to reach the top shelf in the garage.",
            "sent4": "The stubbies formed a sturdy base for the table.",
            "sent5": "The stubbies were perfect for patching up the fence."
        },
        {
            "definition": "Short, thick plants or vegetation",
            "pos": "noun",
            "sent1": "The garden was filled with colorful stubbies of various sizes.",
            "sent2": "The farmer harvested the stubbies to make space for new crops.",
            "sent3": "The stubbies in the forest provided shelter for small animals.",
            "sent4": "The stubbies swayed gently in the breeze, creating a peaceful scene.",
            "sent5": "The stubbies added a touch of green to the barren landscape."
        }
    ]
}