{
    "term": "studbooks",
    "meanings": [
        {
            "definition": "A record of the pedigree of purebred animals, especially horses.",
            "pos": "noun",
            "sent1": "The studbooks showed the lineage of the champion racehorse.",
            "sent2": "Breeders consult the studbooks to trace the ancestry of their horses.",
            "sent3": "The studbooks revealed that the famous horse was actually related to a donkey!",
            "sent4": "In the world of horse breeding, studbooks are like ancient scrolls revealing noble bloodlines.",
            "sent5": "The worn pages of the studbooks whispered the secrets of generations past."
        },
        {
            "definition": "A book containing a list of registered stallions and their offspring.",
            "pos": "noun",
            "sent1": "The studbooks listed the strong stallions and their promising foals.",
            "sent2": "Farmers rely on studbooks to choose the best sires for their mares.",
            "sent3": "The studbooks accidentally included a pony in the list of stallions!",
            "sent4": "Within the studbooks, the stallions' names stood out like bold chapter titles.",
            "sent5": "The studbooks painted a vivid picture of the stallions' lineage through the ages."
        },
        {
            "definition": "A register of breeding animals maintained by a breed association.",
            "pos": "noun",
            "sent1": "The studbooks of the association kept track of all the breeding pairs.",
            "sent2": "Members of the breed association regularly update the studbooks with new entries.",
            "sent3": "The studbooks of the association were so detailed, they even included the pets of the breeders!",
            "sent4": "To breeders, the studbooks were like a treasure map leading to the best genetic combinations.",
            "sent5": "The studbooks gleamed with the collective history and future hopes of the breeders."
        }
    ]
}