{
    "term": "stumping",
    "meanings": [
        {
            "definition": "To walk heavily or clumsily.",
            "pos": "verb",
            "sent1": "The tired hiker was stumping through the thick forest.",
            "sent2": "The elephant was stumping around the jungle, making the ground shake.",
            "sent3": "The clumsy clown kept stumping into walls during the circus performance.",
            "sent4": "The robot, programmed to walk like a human, was stumping awkwardly on the stage.",
            "sent5": "The old tractor was stumping along the bumpy field, struggling to move smoothly."
        },
        {
            "definition": "To confuse or puzzle.",
            "pos": "verb",
            "sent1": "The tricky riddle had everyone stumped at the party.",
            "sent2": "The complex math problem was stumping the students in the classroom.",
            "sent3": "The magician's illusion was so convincing that it stumped the entire audience.",
            "sent4": "The unexpected plot twist in the movie completely stumped the viewers.",
            "sent5": "The mysterious disappearance of the key stumped the detective for days."
        },
        {
            "definition": "To campaign vigorously on behalf of a political candidate.",
            "pos": "verb",
            "sent1": "The dedicated volunteers were stumping for their candidate in the neighborhood.",
            "sent2": "The politician was stumping across the country, meeting voters and sharing his message.",
            "sent3": "The enthusiastic supporters were stumping for their favorite candidate with colorful posters.",
            "sent4": "The energetic campaign manager was stumping tirelessly to gather more votes.",
            "sent5": "The passionate speech stumped the crowd, leaving them inspired and motivated."
        },
        {
            "definition": "A method of playing cricket where the stumps are used as a target.",
            "pos": "noun",
            "sent1": "In the backyard, the kids enjoyed a game of stumping, aiming for the wooden sticks.",
            "sent2": "During the cricket match, the bowler knocked down the stumps with a fast ball.",
            "sent3": "The friendly competition of stumping in the park brought laughter and cheers.",
            "sent4": "The cricket team practiced their stumping skills to improve their accuracy.",
            "sent5": "The sound of the ball hitting the stumps echoed across the cricket field."
        }
    ]
}