{
    "term": "sturdiest",
    "meanings": [
        {
            "definition": "Strongly built or made",
            "pos": "adjective",
            "sent1": "The sturdiest table in the house is the one made of solid wood.",
            "sent2": "The treehouse was built with the sturdiest branches to ensure safety.",
            "sent3": "The sturdiest chair in the room decided to take a break and collapsed dramatically.",
            "sent4": "Her resolve was as sturdiest as a fortress, unwavering in the face of challenges.",
            "sent5": "The sturdiest bridge stood tall against the raging river, a symbol of strength and resilience."
        },
        {
            "definition": "Able to withstand rough handling or use",
            "pos": "adjective",
            "sent1": "The sturdiest backpack endured the entire hiking trip without a tear.",
            "sent2": "The sturdiest shoes he owned never wore out despite daily use.",
            "sent3": "The sturdiest umbrella decided to fly away in a gust of wind, much to everyone's surprise.",
            "sent4": "Her friendship was the sturdiest anchor in his life, keeping him grounded through turbulent times.",
            "sent5": "The sturdiest rope held firm as they crossed the treacherous ravine, a lifeline in the face of danger."
        },
        {
            "definition": "Firmly established and not easily moved or changed",
            "pos": "adjective",
            "sent1": "The sturdiest tradition in their family was the annual holiday gathering.",
            "sent2": "The sturdiest belief she held was in the power of kindness.",
            "sent3": "The sturdiest rumor in town was about a talking cat that only appeared at midnight.",
            "sent4": "His loyalty was as sturdiest as a mountain, unwavering in the face of temptation.",
            "sent5": "The sturdiest bond between them was unbreakable, like a chain forged in trust and love."
        }
    ]
}