{
    "term": "subas",
    "meanings": [
        {
            "definition": "A type of aromatic resin",
            "pos": "noun",
            "sent1": "The subas had a pleasant smell.",
            "sent2": "She bought a candle scented with subas.",
            "sent3": "The subas resin made the room smell like a forest.",
            "sent4": "The subas resin wafted through the air like a gentle breeze.",
            "sent5": "The subas resin filled the room with a calming aroma."
        },
        {
            "definition": "A type of fabric or garment",
            "pos": "noun",
            "sent1": "Her dress was made of soft subas.",
            "sent2": "The subas fabric felt smooth against her skin.",
            "sent3": "She twirled in her subas dress, feeling like a princess.",
            "sent4": "The subas garment draped elegantly over her shoulders.",
            "sent5": "The subas fabric shimmered in the sunlight, catching everyone's eye."
        },
        {
            "definition": "To subject to a subas",
            "pos": "verb",
            "sent1": "They decided to subas the room with a new fragrance.",
            "sent2": "He carefully subased the area with a scented spray.",
            "sent3": "She playfully subased her friends by spraying perfume on them.",
            "sent4": "The chef subased the dish with a hint of exotic spices.",
            "sent5": "The florist subased the bouquet with a touch of lavender for a special occasion."
        },
        {
            "definition": "To subas something",
            "pos": "verb",
            "sent1": "She wanted to subas her wardrobe with new scents.",
            "sent2": "He planned to subas the car with a fresh air freshener.",
            "sent3": "They decided to subas the party with colorful decorations.",
            "sent4": "The artist subased the painting with vibrant colors.",
            "sent5": "The baker subased the cake with a delicious frosting for the celebration."
        }
    ]
}