{
    "term": "subducts",
    "meanings": [
        {
            "definition": "To move or be forced below something else, especially when two tectonic plates collide.",
            "pos": "verb",
            "sent1": "During the earthquake, the oceanic plate subducts beneath the continental plate.",
            "sent2": "The geologist explained how one plate subducts under another in a subduction zone.",
            "sent3": "The mischievous rock subducts itself under the unsuspecting soil, playing hide and seek.",
            "sent4": "The idea of change subducts beneath the surface of tradition, causing a seismic shift in beliefs.",
            "sent5": "The image of the plate subducting into the fiery depths of the Earth is both terrifying and fascinating."
        },
        {
            "definition": "To take away or deduct something from a total.",
            "pos": "verb",
            "sent1": "The cashier subducts the discount from the total amount at the checkout.",
            "sent2": "She always subducts the cost of shipping from the final price of the product.",
            "sent3": "The magician seemed to subduct the rabbit from the hat, leaving the audience in awe.",
            "sent4": "Time subducts the innocence of childhood, leaving behind memories of growth.",
            "sent5": "The detective subducts the false alibi, revealing the truth hidden in plain sight."
        },
        {
            "definition": "To remove or take away something, especially in a forceful manner.",
            "pos": "verb",
            "sent1": "The storm subducts the sand from the beach, reshaping the coastline.",
            "sent2": "The strong wind subducts the leaves from the trees, scattering them across the yard.",
            "sent3": "The vacuum cleaner subducts the dust bunnies from the carpet with ease.",
            "sent4": "The thief subducts the precious jewel from the museum, leaving behind chaos.",
            "sent5": "The powerful wave subducts the sandcastle, erasing all traces of its existence."
        }
    ]
}