{
    "term": "subgrade",
    "meanings": [
        {
            "definition": "The layer of soil or rock beneath a road or railway track.",
            "pos": "noun",
            "sent1": "The workers dug deep to reach the subgrade for the new highway.",
            "sent2": "The engineers inspected the subgrade to ensure it could support the weight of the train.",
            "sent3": "The subgrade decided to throw a party underground for all the other layers.",
            "sent4": "The subgrade of the project was the strong foundation that held everything together.",
            "sent5": "The subgrade, like a hidden treasure, supported the road above with its solid base."
        },
        {
            "definition": "To prepare the ground beneath a road or railway track for construction.",
            "pos": "verb",
            "sent1": "The construction crew worked hard to subgrade the area before laying the tracks.",
            "sent2": "It is important to subgrade properly to prevent any issues with the road in the future.",
            "sent3": "The workers joked that they were 'subgrading' the earth to make it more comfortable for the road.",
            "sent4": "She subgraded the land with precision, ensuring a smooth surface for the road ahead.",
            "sent5": "The act of subgrading transformed the rough terrain into a stable foundation for the railway track."
        },
        {
            "definition": "The foundation or base of a structure.",
            "pos": "noun",
            "sent1": "The subgrade of the building was solid and reliable, providing stability to the entire structure.",
            "sent2": "Without a strong subgrade, the house would not be able to withstand the harsh weather conditions.",
            "sent3": "The subgrade proudly supported the weight of the building, feeling essential to its existence.",
            "sent4": "The subgrade acted as the backbone of the structure, ensuring its durability and strength.",
            "sent5": "The subgrade, like a sturdy rock, held the building steady through all kinds of challenges."
        }
    ]
}