{
    "term": "subinfeuding",
    "meanings": [
        {
            "definition": "Subinfeuding: the practice of granting land to subtenants",
            "pos": "noun",
            "sent1": "In medieval times, subinfeuding was common among landowners.",
            "sent2": "The subinfeuding of estates led to complex ownership structures.",
            "sent3": "The king found himself subinfeuding so much land that he couldn't keep track of it all!",
            "sent4": "The concept of subinfeuding is like a puzzle where each piece represents a different subtenant.",
            "sent5": "The history book vividly described the intricate web of subinfeuding that shaped the countryside."
        },
        {
            "definition": "Subinfeuding: to grant land to subtenants",
            "pos": "verb",
            "sent1": "The nobleman was subinfeuding parcels of land to his loyal subjects.",
            "sent2": "Landlords subinfeuding their properties often required regular payments.",
            "sent3": "The farmer joked that he was subinfeuding his backyard to the squirrels.",
            "sent4": "She felt like she was subinfeuding her time to too many different tasks.",
            "sent5": "The act of subinfeuding can create a sense of shared responsibility among tenants."
        },
        {
            "definition": "Subinfeuding: a system of land tenure where land is granted to subtenants",
            "pos": "noun",
            "sent1": "The subinfeuding system allowed for the efficient distribution of land.",
            "sent2": "In the feudal era, subinfeuding was a common way to manage large estates.",
            "sent3": "The town's subinfeuding arrangement made it feel like a big family sharing a backyard.",
            "sent4": "The idea of subinfeuding is like a tree with the main landowner as the trunk and subtenants as branches.",
            "sent5": "The textbook explained the intricate details of subinfeuding in a clear and engaging manner."
        }
    ]
}