{
    "term": "subirrigation",
    "meanings": [
        {
            "definition": "The act of supplying water to plants from below the surface.",
            "pos": "noun",
            "sent1": "Subirrigation helps plants grow by giving them water from underneath.",
            "sent2": "Farmers use subirrigation to keep their crops hydrated by watering them from below.",
            "sent3": "The plants were surprised to receive a secret gift of water from the subirrigation system.",
            "sent4": "Her care for the garden was like subirrigation, nurturing life from hidden depths.",
            "sent5": "The subirrigation method made the soil moist and the plants happy."
        },
        {
            "definition": "A method of watering plants by delivering water directly to the roots.",
            "pos": "noun",
            "sent1": "Using subirrigation, gardeners can water plants by targeting the roots.",
            "sent2": "The subirrigation system efficiently delivers water straight to the plant roots.",
            "sent3": "The mischievous squirrel mistook the subirrigation pipe for a water slide.",
            "sent4": "The subirrigation technique was a lifeline for the thirsty plants, like a direct IV drip.",
            "sent5": "With subirrigation, the roots of the plants drank deeply and thrived."
        },
        {
            "definition": "The process of irrigating crops by allowing water to seep up from below.",
            "pos": "noun",
            "sent1": "Subirrigation involves letting water rise up to nourish the crops from beneath.",
            "sent2": "Farmers use subirrigation to let water naturally seep up to the roots of their crops.",
            "sent3": "The subirrigation surprise party for the crops was a hit, with water bubbling up unexpectedly.",
            "sent4": "The fields were like sponges, soaking up the subirrigation water from the depths.",
            "sent5": "The subirrigation process was like a hidden treasure chest of hydration for the plants."
        }
    ]
}