{
    "term": "subjugate",
    "meanings": [
        {
            "definition": "Bring under domination or control, especially by conquest.",
            "pos": "verb",
            "sent1": "The king sought to subjugate the neighboring kingdom through war.",
            "sent2": "The conqueror was able to subjugate the entire land with his army.",
            "sent3": "The ambitious ruler tried to subjugate the rebellious province but faced unexpected challenges.",
            "sent4": "The powerful empire aimed to subjugate all surrounding territories to expand its influence.",
            "sent5": "The ruthless dictator's goal was to subjugate all opposition and rule with absolute authority."
        },
        {
            "definition": "Make someone or something subordinate to.",
            "pos": "verb",
            "sent1": "The manager wanted to subjugate his employees and make them follow his orders.",
            "sent2": "In the military, soldiers are trained to subjugate their instincts and obey commands.",
            "sent3": "The strict teacher tried to subjugate the noisy classroom by implementing new rules.",
            "sent4": "The dominant alpha wolf would subjugate the other pack members to maintain control.",
            "sent5": "The queen bee would subjugate the worker bees to ensure the hive's productivity."
        },
        {
            "definition": "Suppress or oppress by force.",
            "pos": "verb",
            "sent1": "The tyrant used his army to subjugate any form of dissent among the citizens.",
            "sent2": "The oppressive regime sought to subjugate the minority groups within the country.",
            "sent3": "The evil sorcerer tried to subjugate the magical creatures to do his bidding.",
            "sent4": "The dark clouds seemed to subjugate the sun, casting a shadow over the land.",
            "sent5": "The powerful storm would subjugate the fragile houses, leaving destruction in its wake."
        }
    ]
}