{
    "term": "subliming",
    "meanings": [
        {
            "definition": "To transform directly from a solid to a gas without passing through the liquid state.",
            "pos": "verb",
            "sent1": "The dry ice was subliming, turning into a gas without becoming a liquid first.",
            "sent2": "I observed the snow subliming on the mountaintop, disappearing without melting.",
            "sent3": "The magician claimed he could make objects disappear by subliming them into thin air.",
            "sent4": "Her dreams were subliming into reality, floating away like wisps of smoke.",
            "sent5": "The ice cube seemed to be subliming before my eyes, vanishing into thin air."
        },
        {
            "definition": "To purify or refine a substance through the process of sublimation.",
            "pos": "verb",
            "sent1": "By subliming the impurities, the chemist obtained a pure sample of the compound.",
            "sent2": "The distiller was subliming the liquid to separate the components based on their boiling points.",
            "sent3": "The chef joked that he was subliming the spices to make them more sophisticated.",
            "sent4": "Her kindness was subliming the harsh words, making them gentler and more palatable.",
            "sent5": "The sunlight seemed to be subliming the dewdrops, leaving behind a sparkling trail."
        },
        {
            "definition": "To elevate or exalt something to a higher level.",
            "pos": "verb",
            "sent1": "The artist was subliming ordinary objects into works of art with his creative vision.",
            "sent2": "Through his poetry, he was subliming the mundane into the realm of the extraordinary.",
            "sent3": "The comedian joked about subliming his pet cat to the status of a royal feline.",
            "sent4": "Her voice was subliming the melody, lifting it to ethereal heights.",
            "sent5": "The sunset was subliming the horizon, painting it with hues of gold and pink."
        }
    ]
}