{
    "term": "sublimated",
    "meanings": [
        {
            "definition": "Divert or modify into a culturally higher or socially more acceptable form.",
            "pos": "verb",
            "sent1": "She sublimated her anger by painting a beautiful picture instead of yelling.",
            "sent2": "The artist sublimated his emotions into a masterpiece that touched many hearts.",
            "sent3": "He sublimated his frustration by turning it into a motivational speech.",
            "sent4": "Her creativity sublimated the negative energy into something positive and inspiring.",
            "sent5": "The dancer sublimated her sadness into a graceful performance that moved the audience."
        },
        {
            "definition": "Transform directly from a solid to a gas without becoming a liquid.",
            "pos": "verb",
            "sent1": "The dry ice sublimated, creating a cool fog effect at the party.",
            "sent2": "In the winter, the frost on the window sublimated into thin air when the sun came out.",
            "sent3": "The scientist observed the dry ice sublimating and marveled at the process.",
            "sent4": "The snow sublimated on the mountaintop, disappearing without melting first.",
            "sent5": "The ice cubes sublimated in the freezer, leaving no water behind."
        },
        {
            "definition": "Express or deal with (a desire or impulse) by indirect means.",
            "pos": "verb",
            "sent1": "She sublimated her love for him by writing poetry instead of confessing directly.",
            "sent2": "He sublimated his fear of failure by channeling it into intense workouts.",
            "sent3": "The comedian sublimated his embarrassment by turning it into a hilarious joke.",
            "sent4": "The author sublimated her personal experiences into a fictional novel.",
            "sent5": "The musician sublimated his heartbreak into a soulful song that resonated with many."
        }
    ]
}