{
    "term": "sublimations",
    "meanings": [
        {
            "definition": "The process of transforming a solid directly into a gas without passing through the liquid state.",
            "pos": "noun",
            "sent1": "During the experiment, we observed the sublimations of dry ice turning into gas.",
            "sent2": "In winter, we can see sublimations happening when frost on the ground disappears without melting into water first.",
            "sent3": "The magician's trick involved the sublimations of a solid coin vanishing into thin air.",
            "sent4": "The sublimations of the ice sculptures at the event left the audience in awe.",
            "sent5": "The sublimations of the snow on the mountaintop created a mystical atmosphere."
        },
        {
            "definition": "The act of diverting or modifying an instinctual impulse into a culturally higher or socially more acceptable form.",
            "pos": "noun",
            "sent1": "Through art therapy, she learned to channel her emotions through sublimations into beautiful paintings.",
            "sent2": "His sublimations of anger into productive work impressed his colleagues.",
            "sent3": "The comedian's sublimations of awkward situations into hilarious jokes entertained the audience.",
            "sent4": "Her sublimations of stress into yoga and meditation practices improved her well-being.",
            "sent5": "The writer's sublimations of personal experiences into fictional stories captivated readers."
        },
        {
            "definition": "The purification or refinement of something to a higher state.",
            "pos": "noun",
            "sent1": "The sublimations of impurities in the water resulted in crystal-clear drinking water.",
            "sent2": "Through meditation, she achieved mental sublimations, reaching a state of inner peace.",
            "sent3": "The chef's sublimations of simple ingredients into gourmet dishes amazed the restaurant patrons.",
            "sent4": "The artist's sublimations of raw emotions into powerful artworks touched the hearts of many.",
            "sent5": "The sublimations of the ore led to the production of high-quality metal for construction."
        }
    ]
}