{
    "term": "sublimation",
    "meanings": [
        {
            "definition": "The process of turning a solid directly into a gas without passing through the liquid state.",
            "pos": "noun",
            "sent1": "During the experiment, we observed the sublimation of dry ice into carbon dioxide gas.",
            "sent2": "In winter, snow sublimation can be seen when snowflakes disappear without melting into water.",
            "sent3": "The magician's trick involved the sublimation of a solid coin into thin air, leaving the audience amazed.",
            "sent4": "Her love for music was like the sublimation of emotions into beautiful melodies that touched the soul.",
            "sent5": "The sublimation of the ice sculpture under the hot sun created a mesmerizing effect."
        },
        {
            "definition": "The act of diverting a base urge or behavior into a more socially acceptable form.",
            "pos": "noun",
            "sent1": "Through painting, he found a healthy sublimation for his anger and frustration.",
            "sent2": "Her passion for cooking was a sublimation of her desire to create and nurture.",
            "sent3": "His sublimation of competitive spirit into charity work benefited many in need.",
            "sent4": "The novel depicted the sublimation of revenge into forgiveness, showing the power of redemption.",
            "sent5": "The sublimation of his energy into dance brought joy to everyone around him."
        },
        {
            "definition": "The act of purifying a substance through the process of sublimation.",
            "pos": "noun",
            "sent1": "The sublimation of iodine crystals helped in obtaining a pure sample for the experiment.",
            "sent2": "The sublimation of camphor in the lab resulted in a refined form suitable for medicinal use.",
            "sent3": "The chef's sublimation of salt through the process of evaporation enhanced the flavor of the dish.",
            "sent4": "The sublimation of essential oils from plants is a common method used in aromatherapy.",
            "sent5": "The sublimation of impurities from the metal ore left behind a clean and valuable material."
        }
    ]
}