{
    "term": "sublimates",
    "meanings": [
        {
            "definition": "To divert the expression of an instinctual desire or impulse from its unacceptable form to one that is considered more socially or culturally acceptable.",
            "pos": "verb",
            "sent1": "She sublimates her anger by painting beautiful pictures instead of yelling.",
            "sent2": "He sublimates his frustration by playing sports and staying active.",
            "sent3": "The comedian joked that he sublimates his fear of spiders by pretending they are tiny aliens.",
            "sent4": "Her love for music sublimates her sadness into melodies that touch the soul.",
            "sent5": "The artist sublimates her emotions onto the canvas, creating masterpieces that speak volumes."
        },
        {
            "definition": "To undergo a phase transition from a solid to a gas without passing through the liquid phase.",
            "pos": "verb",
            "sent1": "In winter, the snow sublimates directly into vapor on sunny days.",
            "sent2": "Dry ice sublimates when exposed to room temperature, turning into a foggy mist.",
            "sent3": "The magician claimed he could make a coin sublimates into thin air, leaving the audience amazed.",
            "sent4": "The ice sublimates on the mountaintop, disappearing without melting into water.",
            "sent5": "The camphor sublimates in the closet, leaving behind a fresh, clean scent."
        },
        {
            "definition": "A substance that undergoes sublimation.",
            "pos": "noun",
            "sent1": "Naphthalene is a common sublimates used in mothballs.",
            "sent2": "Dry ice is a well-known sublimates that is used for special effects.",
            "sent3": "The sublimates in the laboratory caused an interesting reaction when heated.",
            "sent4": "The scientist studied the properties of various sublimates to understand their behavior.",
            "sent5": "The sublimates in the container disappeared mysteriously, leaving only a faint odor behind."
        }
    ]
}