{
    "term": "submiss",
    "meanings": [
        {
            "definition": "Ready to conform to the authority or will of others.",
            "pos": "adjective",
            "sent1": "The submiss student always followed the teacher's instructions without question.",
            "sent2": "She was known for her submiss nature, always agreeing with whatever others suggested.",
            "sent3": "The submiss puppy obediently sat when told, wagging its tail happily.",
            "sent4": "Her submiss attitude towards her boss made her an easy target for extra work.",
            "sent5": "The submiss kitten allowed the children to dress it up in silly costumes without protest."
        },
        {
            "definition": "Showing a willingness to be controlled or dominated by someone else.",
            "pos": "adjective",
            "sent1": "He had a submiss demeanor, never challenging authority figures.",
            "sent2": "The submiss employee never questioned his boss's decisions.",
            "sent3": "The submiss robot followed every command, even the silly ones.",
            "sent4": "Her submiss behavior in the relationship led to her partner taking advantage of her.",
            "sent5": "The submiss child always let their older sibling choose the games they played together."
        },
        {
            "definition": "Yielding or surrendering oneself to the will or authority of another.",
            "pos": "adjective",
            "sent1": "The submiss monk devoted his life to serving his monastery.",
            "sent2": "She showed a submiss attitude towards her strict parents.",
            "sent3": "The submiss tree swayed gently in the wind, as if bowing to nature's will.",
            "sent4": "His submiss behavior in the negotiation resulted in him getting the short end of the stick.",
            "sent5": "The submiss clouds drifted across the sky, following the wind's direction without resistance."
        }
    ]
}