{
    "term": "submissions",
    "meanings": [
        {
            "definition": "The action of presenting a proposal, application, or piece of writing for consideration.",
            "pos": "noun",
            "sent1": "Her submissions for the writing contest were carefully crafted and neatly typed.",
            "sent2": "The deadline for submissions to the art exhibition is next Friday.",
            "sent3": "His submissions to the editor were so frequent, she joked about setting up a dedicated mailbox for him.",
            "sent4": "The flood of submissions overwhelmed the selection committee, drowning them in a sea of creativity.",
            "sent5": "The teacher praised her submissions as examples of hard work paying off."
        },
        {
            "definition": "The act of yielding to authority or control.",
            "pos": "noun",
            "sent1": "The suspect's submissions to the police led to his eventual arrest.",
            "sent2": "The country's submissions to the international treaty were seen as a sign of cooperation.",
            "sent3": "His submissions to the strict teacher were met with raised eyebrows and a stern warning.",
            "sent4": "The company's submissions to the regulatory body were scrutinized for compliance.",
            "sent5": "The team's submissions to the coach's training regimen paid off with a championship win."
        },
        {
            "definition": "The act of accepting or yielding to a superior force or to the will or authority of another.",
            "pos": "noun",
            "sent1": "The knight's submissions to the king's orders were unwavering and loyal.",
            "sent2": "The country's submissions to the invading army were seen as a strategic move to avoid bloodshed.",
            "sent3": "The student's submissions to the strict rules of the school were met with mixed feelings of rebellion and compliance.",
            "sent4": "The tree's submissions to the strong winds resulted in its branches swaying gracefully in the breeze.",
            "sent5": "The athlete's submissions to the coach's training plan transformed him into a champion."
        }
    ]
}