{
    "term": "submerse",
    "meanings": [
        {
            "definition": "To cover or overflow with water",
            "pos": "verb",
            "sent1": "The heavy rain caused the small boat to submerse in the lake.",
            "sent2": "When I accidentally dropped my phone in the pool, it started to submerse slowly.",
            "sent3": "The mischievous puppy tried to submerse its toy in the water bowl, thinking it was a swimming pool.",
            "sent4": "Her emotions began to submerse her like a tidal wave, overwhelming her completely.",
            "sent5": "The darkness of the night submersed the city in an eerie silence."
        },
        {
            "definition": "To plunge into water or other liquid",
            "pos": "verb",
            "sent1": "The brave diver decided to submerse into the deep ocean to explore the coral reef.",
            "sent2": "After a long hike, the tired hiker wanted nothing more than to submerse in a refreshing stream.",
            "sent3": "The chef accidentally let the pasta submerse in boiling water for too long, turning it into mush.",
            "sent4": "As the sun set, the sky seemed to submerse into a sea of colors, painting the horizon.",
            "sent5": "The feeling of relief submersed her as she finally dipped her feet into the cool river."
        },
        {
            "definition": "To immerse or occupy completely",
            "pos": "verb",
            "sent1": "The captivating book made me submerse myself in its pages for hours.",
            "sent2": "The loud music at the concert hall seemed to submerse the audience in a wave of sound.",
            "sent3": "The delicious aroma of freshly baked cookies seemed to submerse the entire house, making everyone hungry.",
            "sent4": "Her thoughts began to submerse her mind, making it hard to focus on anything else.",
            "sent5": "The beauty of the artwork submersed the viewers in a world of colors and shapes."
        }
    ]
}