{
    "term": "submission",
    "meanings": [
        {
            "definition": "The action of accepting or yielding to a superior force or to the will or authority of another person.",
            "pos": "noun",
            "sent1": "Her submission to the teacher's instructions was immediate.",
            "sent2": "The submission of the defeated army was evident in their lowered flags.",
            "sent3": "The cat's submission to the laser pointer's movements was both amusing and adorable.",
            "sent4": "The submission of the waves to the shore is a constant dance of nature.",
            "sent5": "The knight's submission to the king was a symbol of loyalty and respect."
        },
        {
            "definition": "The act of presenting a proposal, application, or other document for consideration or judgment.",
            "pos": "noun",
            "sent1": "His submission of the project proposal impressed the committee.",
            "sent2": "The submission of the paperwork was the final step in the application process.",
            "sent3": "The dog's submission of the 'treat request' form was met with immediate action.",
            "sent4": "The submission of the manuscript to the publisher marked the beginning of a new chapter.",
            "sent5": "The submission of the evidence to the court was crucial for the case."
        },
        {
            "definition": "The act of surrendering oneself to a particular belief, ideology, or practice.",
            "pos": "noun",
            "sent1": "Her submission to the new religion brought her peace and comfort.",
            "sent2": "The submission to the meditation practice transformed his outlook on life.",
            "sent3": "The squirrel's submission to the 'no nut left behind' policy was both amusing and endearing.",
            "sent4": "The submission to the power of music can be a life-changing experience.",
            "sent5": "The submission to the art of storytelling captivated the audience."
        }
    ]
}