{
    "term": "suborn",
    "meanings": [
        {
            "definition": "Bribe or otherwise induce (someone) to commit an unlawful act.",
            "pos": "verb",
            "sent1": "The corrupt official tried to suborn the witness into lying in court.",
            "sent2": "She was arrested for attempting to suborn a police officer to ignore the crime.",
            "sent3": "The shady businessman's plan to suborn the judge backfired when he got caught.",
            "sent4": "The criminal mastermind used his wealth to suborn the jury and secure his acquittal.",
            "sent5": "The evil queen's advisor would often suborn the guards to carry out her wicked schemes."
        },
        {
            "definition": "Persuade (someone) to do something illegal or wrong.",
            "pos": "verb",
            "sent1": "He tried to suborn his friend into stealing from the store.",
            "sent2": "The con artist managed to suborn the unsuspecting victim into signing a fraudulent contract.",
            "sent3": "The mischievous student attempted to suborn his classmates into skipping class.",
            "sent4": "The cunning villain used his charm to suborn the hero into betraying his allies.",
            "sent5": "The persuasive cult leader would suborn his followers into committing heinous acts in his name."
        },
        {
            "definition": "To induce (a person) to commit perjury.",
            "pos": "verb",
            "sent1": "The lawyer was accused of trying to suborn the witness to lie under oath.",
            "sent2": "The defendant's attempt to suborn the key witness was uncovered during the trial.",
            "sent3": "The comedian joked about trying to suborn his friend into lying about their whereabouts.",
            "sent4": "The politician's campaign manager was caught trying to suborn a witness to change their testimony.",
            "sent5": "The manipulative actress would suborn her co-stars to support her false alibi."
        }
    ]
}