{
    "term": "subrogation",
    "meanings": [
        {
            "definition": "The act of substituting one person or entity for another in a legal claim or right.",
            "pos": "noun",
            "sent1": "In the case of subrogation, the insurance company steps in for the policyholder in a legal matter.",
            "sent2": "The concept of subrogation allows for a smooth transition of legal rights from one party to another.",
            "sent3": "When the lawyer dressed up as a superhero for the subrogation case, everyone had a good laugh.",
            "sent4": "The subrogation process is like a legal game of musical chairs, with rights passing from one player to another.",
            "sent5": "The judge's explanation of subrogation made it crystal clear how legal substitutions work."
        },
        {
            "definition": "The process by which an insurance company seeks reimbursement from a third party for a claim it has already paid out.",
            "pos": "noun",
            "sent1": "Subrogation is when the insurance company tries to get money back from someone else after paying a claim.",
            "sent2": "The insurance company's subrogation efforts aim to recover funds from a responsible third party.",
            "sent3": "The insurance agent's attempt at subrogation turned into a comedy of errors.",
            "sent4": "The insurance company's subrogation process is like a detective's hunt for the missing reimbursement.",
            "sent5": "The subrogation procedure is a financial puzzle where insurers try to recoup their payouts."
        },
        {
            "definition": "The transfer of one's legal rights or claims to another party.",
            "pos": "noun",
            "sent1": "Subrogation involves passing on legal rights from one person to another.",
            "sent2": "During subrogation, individuals can transfer their legal claims to a different entity.",
            "sent3": "The subrogation of rights between the siblings led to an unexpected outcome.",
            "sent4": "The concept of subrogation is like handing over a baton of legal entitlements.",
            "sent5": "The lawyer's explanation of subrogation made it seem like a legal relay race of rights."
        }
    ]
}