{
    "term": "subrogated",
    "meanings": [
        {
            "definition": "To substitute one person or entity for another in a legal claim or right.",
            "pos": "verb",
            "sent1": "In the court case, John subrogated his sister to take his place as the plaintiff.",
            "sent2": "The insurance company subrogated the homeowner's rights to recover the damages.",
            "sent3": "When the cat subrogated the dog's role as the guard, chaos ensued in the house.",
            "sent4": "The new leader subrogated the old ways with innovative strategies.",
            "sent5": "The superhero subrogated the villain's evil plans, saving the city from destruction."
        },
        {
            "definition": "To assume the rights or responsibilities of another party.",
            "pos": "verb",
            "sent1": "She subrogated her friend's duties while they were away on vacation.",
            "sent2": "The manager subrogated the employee's authority during the meeting.",
            "sent3": "The robot subrogated the human's tasks, causing confusion in the workplace.",
            "sent4": "The student subrogated the teacher's role, explaining the concept to the class.",
            "sent5": "The substitute teacher subrogated the regular teacher's position for the day."
        },
        {
            "definition": "To transfer a right or claim from one party to another.",
            "pos": "verb",
            "sent1": "The lawyer subrogated the client's claim to another law firm for better representation.",
            "sent2": "The company subrogated the ownership rights of the intellectual property to a different corporation.",
            "sent3": "The magician subrogated the volunteer's watch to a different pocket during the trick.",
            "sent4": "The government subrogated the land rights to the indigenous community for preservation.",
            "sent5": "The artist subrogated the painting rights to a museum for public display."
        }
    ]
}