{
    "term": "subshafts",
    "meanings": [
        {
            "definition": "A shaft that is below or subordinate to another shaft.",
            "pos": "noun",
            "sent1": "The miners descended into the dark subshafts to extract valuable minerals.",
            "sent2": "The architect designed the building with sturdy subshafts to support the structure.",
            "sent3": "The mischievous gnomes used the subshafts as secret tunnels to play pranks on the miners.",
            "sent4": "The subshafts of society quietly support the main pillars of progress.",
            "sent5": "The subshafts were like hidden passageways leading to hidden treasures."
        },
        {
            "definition": "The lower part of a shaft or column.",
            "pos": "noun",
            "sent1": "The workers reinforced the crumbling subshafts of the ancient tower.",
            "sent2": "The artist carefully carved intricate designs into the subshafts of the marble column.",
            "sent3": "The curious squirrel peeked into the subshafts, hoping to find a hidden acorn stash.",
            "sent4": "The subshafts stood strong, bearing the weight of the towering structure above.",
            "sent5": "The subshafts resembled the roots of a great tree, anchoring the column in place."
        },
        {
            "definition": "A secondary or subsidiary shaft.",
            "pos": "noun",
            "sent1": "The engineers installed additional subshafts to improve ventilation in the mine.",
            "sent2": "The factory had multiple subshafts to channel different materials to the production line.",
            "sent3": "The playful kittens turned the subshafts into their own miniature obstacle course.",
            "sent4": "The subshafts branched out like tributaries, serving various functions in the system.",
            "sent5": "The subshafts were like loyal assistants, supporting the main shaft in its duties."
        }
    ]
}