{
    "term": "substation",
    "meanings": [
        {
            "definition": "A facility that transforms electricity from high voltage to low voltage for distribution.",
            "pos": "noun",
            "sent1": "The substation near my house helps to change the electricity to a lower voltage.",
            "sent2": "The substation on the corner of the street ensures that homes receive the right amount of electricity.",
            "sent3": "The substation decided to throw a party and invited all the transformers.",
            "sent4": "The substation is like a magician, turning high voltage into low voltage with ease.",
            "sent5": "I will never forget the substation's role in making sure our homes have safe electricity."
        },
        {
            "definition": "A place where electricity is received from a power station and distributed to consumers.",
            "pos": "noun",
            "sent1": "The substation is where the electricity from the power station is sent before reaching our homes.",
            "sent2": "Every neighborhood has a substation that helps in distributing electricity to all the houses.",
            "sent3": "The substation threw a surprise party for all the houses it supplied electricity to.",
            "sent4": "The substation acts as a bridge, carrying electricity from the power station to our homes.",
            "sent5": "The substation's job is crucial in ensuring that electricity reaches every consumer efficiently."
        },
        {
            "definition": "A building or area where electrical equipment is housed for the purpose of controlling and distributing electricity.",
            "pos": "noun",
            "sent1": "The substation is where all the electrical equipment is kept to control the flow of electricity.",
            "sent2": "Workers at the substation monitor and manage the distribution of electricity in the area.",
            "sent3": "The substation had a movie night for all the electrical equipment, showing them a documentary on electricity.",
            "sent4": "In the network of electricity, the substation acts as the heart, regulating the flow to different areas.",
            "sent5": "The substation's role in controlling and distributing electricity is vital for a smooth power supply."
        }
    ]
}