{
    "term": "suburbanised",
    "meanings": [
        {
            "definition": "To make suburban in character.",
            "pos": "verb",
            "sent1": "The city council suburbanised the area by adding more parks and quiet streets.",
            "sent2": "The neighborhood was suburbanised with the construction of new single-family homes.",
            "sent3": "The mischievous kids suburbanised the playground by planting mini-gardens in every corner.",
            "sent4": "Her smile suburbanised the room, filling it with warmth and friendliness.",
            "sent5": "The artist's brushstrokes suburbanised the canvas, turning it into a peaceful suburban scene."
        },
        {
            "definition": "To convert into a suburb.",
            "pos": "verb",
            "sent1": "The old factory was suburbanised into a trendy shopping district.",
            "sent2": "The government decided to suburbanise the outskirts of the city for better urban planning.",
            "sent3": "The magician suburbanised the hat into a tiny suburban house, complete with a tiny garden.",
            "sent4": "Her words suburbanised his thoughts, transforming them into peaceful suburban streets.",
            "sent5": "The chef suburbanised the plain dish into a gourmet meal fit for a suburban feast."
        },
        {
            "definition": "To develop suburbs.",
            "pos": "verb",
            "sent1": "The real estate company suburbanised the rural land, creating new housing developments.",
            "sent2": "The government's initiative aimed to suburbanise the region for better population distribution.",
            "sent3": "The aliens suburbanised the barren planet, building colorful suburban communities.",
            "sent4": "Her ideas suburbanised the project, expanding it into multiple suburban areas.",
            "sent5": "The company's expansion suburbanised the market, reaching out to new suburban customers."
        }
    ]
}