{
    "term": "subversion",
    "meanings": [
        {
            "definition": "The act of overthrowing or undermining a government or political system.",
            "pos": "noun",
            "sent1": "The rebels planned a subversion to overthrow the oppressive regime.",
            "sent2": "The spy's subversion of the government was discovered by intelligence agencies.",
            "sent3": "The cartoon depicted a comical subversion where the politicians were replaced by clowns.",
            "sent4": "His subversion of the political system was like a silent earthquake, shaking the foundation of power.",
            "sent5": "The subversion of the government was a dramatic plot twist in the movie."
        },
        {
            "definition": "The act of sabotaging or undermining something, such as an institution or belief.",
            "pos": "noun",
            "sent1": "The hacker's subversion of the company's website caused chaos among employees.",
            "sent2": "The subversion of traditional values led to a cultural shift in society.",
            "sent3": "The children's playful subversion of the rules made the teacher smile.",
            "sent4": "Her subtle subversion of the norms challenged everyone's perspective.",
            "sent5": "The subversion of the institution was a bold move that shocked many."
        },
        {
            "definition": "The act of corrupting or perverting something, such as a process or idea.",
            "pos": "noun",
            "sent1": "The subversion of the scientific data led to false conclusions.",
            "sent2": "The subversion of the original concept resulted in a flawed design.",
            "sent3": "The comedian's witty subversion of cliches made the audience laugh.",
            "sent4": "Her subversion of the traditional recipe created a unique and delicious dish.",
            "sent5": "The subversion of the truth distorted the entire narrative."
        }
    ]
}