{
    "term": "suffocative",
    "meanings": [
        {
            "definition": "Causing or tending to cause suffocation.",
            "pos": "adjective",
            "sent1": "The thick smoke in the room was suffocative, making it hard to breathe.",
            "sent2": "The airtight bag was suffocative, not allowing any air to pass through.",
            "sent3": "The overly affectionate puppy was suffocative, showering its owner with kisses.",
            "sent4": "The silence in the library was suffocative, pressing down on the students like a heavy blanket.",
            "sent5": "The humid weather felt suffocative, as if the air itself was thick and heavy."
        },
        {
            "definition": "Characterized by or causing suffocation.",
            "pos": "adjective",
            "sent1": "The underwater cave was suffocative, with its narrow passages and limited air.",
            "sent2": "The plastic wrap was suffocative, tightly sealing off any escape for the trapped insect.",
            "sent3": "The crowded elevator was suffocative, making everyone feel like sardines in a can.",
            "sent4": "The oppressive heat was suffocative, wrapping the city in a stifling embrace.",
            "sent5": "The thick fog was suffocative, obscuring everything in a dense, suffocating mist."
        },
        {
            "definition": "Tending to suffocate.",
            "pos": "adjective",
            "sent1": "The heavy perfume was suffocative, overwhelming the senses with its strong scent.",
            "sent2": "The tight collar was suffocative, constricting his neck and making it hard to breathe.",
            "sent3": "The overprotective parent was suffocative, not giving their child any space to breathe.",
            "sent4": "The thick curtains were suffocative, blocking out all the light and air from the room.",
            "sent5": "The dense forest was suffocative, with its tangled undergrowth and lack of clear paths."
        }
    ]
}