{
    "term": "sulcations",
    "meanings": [
        {
            "definition": "A groove or furrow in a surface.",
            "pos": "noun",
            "sent1": "The farmer admired the sulcations in the field where the water flowed.",
            "sent2": "The potter carefully carved sulcations into the clay to create a decorative pattern.",
            "sent3": "The sulcations in the sand looked like tiny rivers winding through the beach.",
            "sent4": "Her smile left sulcations of joy on her face, brightening up the room.",
            "sent5": "The sulcations on the tree bark provided a unique texture for the curious squirrel to explore."
        },
        {
            "definition": "The act of forming grooves or furrows.",
            "pos": "noun",
            "sent1": "The sulcations of the plow marked the beginning of the planting season.",
            "sent2": "The artist's tool created sulcations in the soft clay as she sculpted her masterpiece.",
            "sent3": "The sulcations left by the skateboard wheels on the pavement made an interesting pattern.",
            "sent4": "His words left sulcations of doubt in her mind, causing her to question everything.",
            "sent5": "The sulcations of the riverbed showed the path the water had taken over time."
        },
        {
            "definition": "The state of being grooved or furrowed.",
            "pos": "noun",
            "sent1": "The sulcations of the canyon walls revealed the passage of time through erosion.",
            "sent2": "The old tree trunk showed sulcations from years of growth and weathering.",
            "sent3": "The sulcations on the vinyl record made a unique pattern that played music to the needle.",
            "sent4": "Her dress had sulcations of pleats that added an elegant touch to her outfit.",
            "sent5": "The sulcations on the ancient artifact told the story of its long-forgotten civilization."
        }
    ]
}