{
    "term": "sulus",
    "meanings": [
        {
            "definition": "A type of traditional Filipino skirt",
            "pos": "noun",
            "sent1": "She wore a colorful sulus during the cultural festival.",
            "sent2": "The dancers gracefully twirled in their vibrant sulus.",
            "sent3": "The sulus swirled as she spun around in the dance.",
            "sent4": "Her sulus was a rainbow of colors, like a painting come to life.",
            "sent5": "The intricate patterns on her sulus told a story of tradition and beauty."
        },
        {
            "definition": "A type of small, sharp knife",
            "pos": "noun",
            "sent1": "He used a sulus to carefully slice the fruits for the salad.",
            "sent2": "The chef's favorite tool in the kitchen was his trusty sulus.",
            "sent3": "The tiny sulus looked more like a toy than a kitchen utensil.",
            "sent4": "With his sulus, he cut through the problem like a sharp blade.",
            "sent5": "The gleaming sulus reflected the kitchen lights as he worked with precision."
        },
        {
            "definition": "A type of tropical plant with large leaves",
            "pos": "noun",
            "sent1": "The lush garden was filled with vibrant sulus plants.",
            "sent2": "Under the shade of the towering sulus, she found respite from the sun.",
            "sent3": "The sulus leaves rustled in the gentle breeze, creating a soothing sound.",
            "sent4": "The sulus plant stood tall like a protective umbrella in the garden.",
            "sent5": "The broad sulus leaves provided a cool canopy on hot days."
        },
        {
            "definition": "A type of traditional Fijian drink made from fermented coconut milk",
            "pos": "noun",
            "sent1": "She enjoyed a refreshing glass of sulus on a hot summer day.",
            "sent2": "The villagers gathered to share stories over cups of homemade sulus.",
            "sent3": "The unique flavor of sulus made it a favorite among the locals.",
            "sent4": "The creamy sulus was like a taste of paradise in a glass.",
            "sent5": "The aroma of freshly made sulus filled the air, enticing everyone nearby."
        }
    ]
}