{
    "term": "sunbirds",
    "meanings": [
        {
            "definition": "A small, brightly colored bird found in tropical regions.",
            "pos": "noun",
            "sent1": "The sunbirds flitted among the flowers, their bright feathers shining in the sunlight.",
            "sent2": "I saw a group of sunbirds hovering around the blooming bushes in the garden.",
            "sent3": "The sunbirds seemed to be having a colorful party in the garden, sipping nectar and chasing insects.",
            "sent4": "Her dress was as vibrant as the plumage of sunbirds, catching everyone's attention.",
            "sent5": "The image of the sunbirds darting through the air like tiny rainbows stayed with me all day."
        },
        {
            "definition": "Birds that feed on nectar and insects.",
            "pos": "noun",
            "sent1": "Sunbirds are important pollinators as they feed on nectar from various flowers.",
            "sent2": "In the park, we observed sunbirds darting from flower to flower, searching for insects and nectar.",
            "sent3": "The sunbirds were like tiny garden helpers, keeping the flower beds free of pesky insects.",
            "sent4": "Watching the sunbirds feed on nectar felt like witnessing a delicate dance of nature.",
            "sent5": "The garden came alive with the buzzing of insects and the chirping of sunbirds as they foraged for food."
        },
        {
            "definition": "Birds known for their vibrant plumage.",
            "pos": "noun",
            "sent1": "The sunbirds in the aviary displayed a stunning array of colors on their feathers.",
            "sent2": "Tourists marveled at the beauty of the sunbirds, admiring their vibrant plumage.",
            "sent3": "The fashion designer drew inspiration from the sunbirds' plumage for the new collection.",
            "sent4": "Her hair was dyed in shades reminiscent of the sunbirds' plumage, creating a unique look.",
            "sent5": "The artist painted a mural on the wall, depicting sunbirds with their iridescent plumage in intricate detail."
        }
    ]
}