{
    "term": "sunstar",
    "meanings": [
        {
            "definition": "A type of sea star with a central disc and multiple arms radiating outwards.",
            "pos": "noun",
            "sent1": "The sunstar slowly moved across the ocean floor, its arms gracefully swaying.",
            "sent2": "I saw a beautiful sunstar while snorkeling in the clear blue waters.",
            "sent3": "The sunstar decided to have a dance-off with the octopus for the title of best underwater dancer.",
            "sent4": "Her smile lit up the room like a radiant sunstar shining in the dark depths of the sea.",
            "sent5": "The sunstar's vibrant colors made it stand out among the other creatures in the coral reef."
        },
        {
            "definition": "A celestial body that is the center of the solar system and emits light and heat.",
            "pos": "noun",
            "sent1": "The sunstar's warmth enveloped the entire planet, providing light and energy.",
            "sent2": "Every morning, the sunstar rises in the east, bringing light to the world.",
            "sent3": "The sunstar and the moon had a friendly competition to see who could shine brighter in the night sky.",
            "sent4": "Her laughter was like the sunstar, filling the room with joy and brightness.",
            "sent5": "The sunstar's rays gently kissed the earth, awakening it from its slumber."
        },
        {
            "definition": "A brand name for a type of camera lens filter.",
            "pos": "noun",
            "sent1": "The photographer attached the sunstar filter to the lens to create a stunning effect.",
            "sent2": "I need to buy a new sunstar for my camera to enhance the colors in my photos.",
            "sent3": "The sunstar filter magically turned a dull photo into a vibrant masterpiece.",
            "sent4": "With the sunstar lens, every picture taken had a touch of magic and brilliance.",
            "sent5": "The sunstar filter added a beautiful sparkle to the landscape photos, making them look more captivating."
        }
    ]
}