{
    "term": "supermom",
    "meanings": [
        {
            "definition": "A mother who excels in managing her household and caring for her children.",
            "pos": "noun",
            "sent1": "The supermom prepared a delicious dinner for her family every night.",
            "sent2": "She is known as the neighborhood supermom for always organizing fun activities for the kids.",
            "sent3": "The supermom's secret weapon was her color-coded family schedule.",
            "sent4": "In the world of parents, she was the undisputed supermom, juggling tasks effortlessly.",
            "sent5": "The supermom's energy and love seemed endless as she tucked her children into bed each night."
        },
        {
            "definition": "A woman who is exceptionally skilled at balancing work and family responsibilities.",
            "pos": "noun",
            "sent1": "At the office, she was a supermom, handling projects with ease while still making time for her family.",
            "sent2": "Being a supermom meant she could attend all her children's events without missing a beat at work.",
            "sent3": "The supermom's ability to multitask amazed everyone in the office.",
            "sent4": "She was like a supermom, effortlessly switching between work mode and mom mode.",
            "sent5": "Her colleagues admired her as the ultimate supermom, always calm under pressure."
        },
        {
            "definition": "To describe a mother who goes above and beyond in taking care of her family.",
            "pos": "verb",
            "sent1": "She would supermom her way through any challenge that came her family's way.",
            "sent2": "Whenever there was a crisis, she would supermom the situation and make everything better.",
            "sent3": "Her friends joked that she could supermom a chaotic situation into a peaceful one in minutes.",
            "sent4": "In times of need, she would supermom her family with unwavering strength and love.",
            "sent5": "She knew she had to supermom her family through tough times, no matter what."
        }
    ]
}