{
    "term": "supernatants",
    "meanings": [
        {
            "definition": "The liquid lying above a sediment after centrifugation.",
            "pos": "noun",
            "sent1": "After spinning the mixture in the centrifuge, the supernatants floated on top.",
            "sent2": "Carefully pouring off the supernatants, we were left with the sediment at the bottom.",
            "sent3": "The supernatants decided to take a break from hanging out with the sediment.",
            "sent4": "The supernatants danced gracefully above the sediment, like a delicate layer of mist.",
            "sent5": "The supernatants shimmered in the light, creating a beautiful separation from the sediment."
        },
        {
            "definition": "The liquid portion of a sample that remains after precipitation or centrifugation.",
            "pos": "noun",
            "sent1": "We collected the supernatants to analyze the remaining liquid portion of the sample.",
            "sent2": "The supernatants contained valuable information about the composition of the sample.",
            "sent3": "The supernatants threw a party to celebrate being the leftover liquid in the sample.",
            "sent4": "The supernatants held the secrets of the sample, hidden within their clear depths.",
            "sent5": "The supernatants whispered stories of the sample's history, waiting to be discovered."
        },
        {
            "definition": "The clear liquid that separates from a precipitate.",
            "pos": "noun",
            "sent1": "As the mixture settled, the supernatants became distinct from the precipitate.",
            "sent2": "The supernatants were carefully decanted to separate them from the solid precipitate.",
            "sent3": "The supernatants played hide and seek with the precipitate, always staying clear.",
            "sent4": "The supernatants floated above the precipitate like a transparent veil.",
            "sent5": "The supernatants sparkled like diamonds, standing out from the dull precipitate."
        }
    ]
}