{
    "term": "superannuation",
    "meanings": [
        {
            "definition": "A system of saving money for retirement.",
            "pos": "noun",
            "sent1": "My dad has a superannuation plan to save money for when he stops working.",
            "sent2": "It is important to start a superannuation fund early to have enough money for retirement.",
            "sent3": "The superannuation fund was so full, it looked like a treasure chest waiting to be opened.",
            "sent4": "Her dedication to her superannuation plan was like a steady stream flowing towards a secure future.",
            "sent5": "The concept of superannuation is like planting seeds of financial security that will bloom in retirement."
        },
        {
            "definition": "The act of setting aside funds for retirement.",
            "pos": "noun",
            "sent1": "Regularly contributing to your superannuation is essential for a comfortable retirement.",
            "sent2": "She made the superannuation of a portion of her income a priority.",
            "sent3": "The superannuation of money for retirement felt like a secret stash waiting to be discovered.",
            "sent4": "His diligence in superannuation was like building a strong foundation for his future.",
            "sent5": "Understanding the importance of superannuation is like unlocking the door to financial freedom in retirement."
        },
        {
            "definition": "The money saved for retirement.",
            "pos": "noun",
            "sent1": "Her superannuation grew steadily over the years, ensuring a comfortable retirement.",
            "sent2": "He checked his superannuation balance regularly to track his savings progress.",
            "sent3": "The superannuation she had saved up felt like a safety net for the future.",
            "sent4": "The superannuation he had accumulated was like a nest egg waiting to hatch.",
            "sent5": "The superannuation fund represented years of hard work and dedication towards a secure retirement."
        }
    ]
}