{
    "term": "supercriminals",
    "meanings": [
        {
            "definition": "Criminals of exceptional ability or power.",
            "pos": "noun",
            "sent1": "The city was in chaos as the supercriminals wreaked havoc.",
            "sent2": "Law enforcement agencies worked tirelessly to capture the supercriminals.",
            "sent3": "The supercriminals thought they were invincible, but justice caught up with them.",
            "sent4": "In the world of crime, the supercriminals were like unstoppable forces of nature.",
            "sent5": "The supercriminals' notoriety spread far and wide, striking fear into the hearts of many."
        },
        {
            "definition": "Individuals who commit serious or heinous crimes.",
            "pos": "noun",
            "sent1": "The supercriminals were responsible for a string of robberies across the city.",
            "sent2": "The authorities were determined to apprehend the supercriminals before they struck again.",
            "sent3": "Despite their cunning, the supercriminals were eventually caught red-handed.",
            "sent4": "To the victims, the supercriminals were like shadows lurking in the darkness.",
            "sent5": "The supercriminals' actions left a trail of destruction in their wake, impacting many lives."
        },
        {
            "definition": "Those who engage in criminal activities on a large scale.",
            "pos": "noun",
            "sent1": "The supercriminals operated across multiple countries, evading capture for years.",
            "sent2": "The authorities launched a massive operation to dismantle the network of supercriminals.",
            "sent3": "The supercriminals' elaborate schemes were like something out of a movie.",
            "sent4": "In the criminal underworld, the supercriminals were legends whispered in dark alleys.",
            "sent5": "The supercriminals' empire spanned continents, making them a formidable force to reckon with."
        }
    ]
}