{
    "term": "superstitious",
    "meanings": [
        {
            "definition": "Having or showing a belief in superstitions.",
            "pos": "adjective",
            "sent1": "She is very superstitious and always avoids walking under ladders.",
            "sent2": "People who are superstitious may believe that breaking a mirror brings bad luck.",
            "sent3": "The superstitious cat refused to cross the path where a black cat had walked.",
            "sent4": "His superstitious nature made him wear his lucky socks to every important meeting.",
            "sent5": "The old man's superstitious behavior included throwing salt over his shoulder for good luck."
        },
        {
            "definition": "Involving superstitions.",
            "pos": "adjective",
            "sent1": "The movie had a superstitious theme, with characters avoiding certain numbers.",
            "sent2": "The superstitious rituals performed by the tribe were believed to bring good harvests.",
            "sent3": "The superstitious decorations in the house included horseshoes and four-leaf clovers.",
            "sent4": "The atmosphere in the room felt superstitious, as if unseen forces were at play.",
            "sent5": "The superstitious beliefs of the villagers influenced their daily routines and decisions."
        },
        {
            "definition": "Characterized by superstitions.",
            "pos": "adjective",
            "sent1": "Her superstitious nature led her to carry a rabbit's foot for good luck.",
            "sent2": "The town was known for its superstitious traditions during the annual festival.",
            "sent3": "The superstitious behavior of the group became more pronounced during the full moon.",
            "sent4": "The house had a superstitious aura, with symbols of luck and protection everywhere.",
            "sent5": "The superstitious beliefs of the culture were passed down from generation to generation."
        }
    ]
}