{
    "term": "supersubstantial",
    "meanings": [
        {
            "definition": "Existing above and beyond substance.",
            "pos": "adjective",
            "sent1": "The idea of love is supersubstantial, reaching beyond mere physical touch.",
            "sent2": "The artist's painting had a supersubstantial quality that captivated viewers.",
            "sent3": "The cat's fascination with the laser pointer was supersubstantial, as if it held magical powers.",
            "sent4": "Her influence on the team was supersubstantial, like a guiding light in the darkness.",
            "sent5": "The bond between the siblings was supersubstantial, unbreakable and strong."
        },
        {
            "definition": "Of a nature or quality beyond what is material.",
            "pos": "adjective",
            "sent1": "The spiritual connection between them was supersubstantial, beyond physical comprehension.",
            "sent2": "The philosopher pondered the supersubstantial aspects of the human soul.",
            "sent3": "The cake's delicious aroma was supersubstantial, making everyone crave a slice.",
            "sent4": "His generosity was supersubstantial, overflowing like a never-ending river.",
            "sent5": "The bond between the siblings was supersubstantial, unbreakable and strong."
        },
        {
            "definition": "Transcending physical matter.",
            "pos": "adjective",
            "sent1": "The ghostly figure seemed supersubstantial, floating through walls effortlessly.",
            "sent2": "The concept of time travel is often associated with supersubstantial theories.",
            "sent3": "The superhero's powers were supersubstantial, defying all laws of physics.",
            "sent4": "Her voice had a supersubstantial quality, echoing through the empty hallways.",
            "sent5": "The bond between the siblings was supersubstantial, unbreakable and strong."
        }
    ]
}