{
    "term": "supercharger",
    "meanings": [
        {
            "definition": "A device that increases the pressure of air or fuel mixture in an internal combustion engine.",
            "pos": "noun",
            "sent1": "The mechanic installed a supercharger to boost the engine's performance.",
            "sent2": "The supercharger improved the car's speed by increasing the air pressure in the engine.",
            "sent3": "The supercharger was like a powerful pump for the engine, making it run faster.",
            "sent4": "With the supercharger, the engine roared to life like a hungry beast.",
            "sent5": "The supercharger was the secret weapon that made the engine unstoppable."
        },
        {
            "definition": "A device that increases the power of an engine by forcing more air into the combustion chamber.",
            "pos": "noun",
            "sent1": "The supercharger pushed extra air into the engine, making it more powerful.",
            "sent2": "Racers often use a supercharger to give their cars an extra boost.",
            "sent3": "The supercharger was like a breath of fresh air for the engine, making it feel alive.",
            "sent4": "With the supercharger, the engine became a force to be reckoned with.",
            "sent5": "The supercharger turned the engine into a powerhouse of performance."
        },
        {
            "definition": "A device that increases the efficiency and power output of an engine by compressing air before it enters the combustion chamber.",
            "pos": "noun",
            "sent1": "The supercharger compressed the air before sending it to the engine, improving efficiency.",
            "sent2": "The supercharger enhanced the engine's power output by compressing the air intake.",
            "sent3": "The supercharger was like a personal trainer for the engine, making it work harder.",
            "sent4": "With the supercharger, the engine operated like a well-oiled machine.",
            "sent5": "The supercharger was the key to unlocking the engine's full potential."
        }
    ]
}