{
    "term": "supernatural",
    "meanings": [
        {
            "definition": "Attributed to some force beyond scientific understanding or the laws of nature.",
            "pos": "adjective",
            "sent1": "The movie had a supernatural plot twist that left everyone amazed.",
            "sent2": "She believed in supernatural beings like ghosts and spirits.",
            "sent3": "The cat's ability to predict the weather was almost supernatural.",
            "sent4": "The athlete's speed on the track was supernatural, like a cheetah.",
            "sent5": "The eerie howl in the forest had a supernatural quality that sent shivers down my spine."
        },
        {
            "definition": "Manifesting or attributed to some force beyond scientific understanding or the laws of nature.",
            "pos": "adjective",
            "sent1": "The magician's tricks seemed supernatural to the audience.",
            "sent2": "The old house had a supernatural aura that made people uneasy.",
            "sent3": "The chef's ability to create delicious dishes was almost supernatural.",
            "sent4": "Her beauty was supernatural, like a painting come to life.",
            "sent5": "The mysterious fog had a supernatural effect on the town, making everything look surreal."
        },
        {
            "definition": "A manifestation or event attributed to some force beyond scientific understanding or the laws of nature.",
            "pos": "noun",
            "sent1": "The supernatural in the story added an element of mystery and intrigue.",
            "sent2": "Many people are fascinated by supernatural occurrences like UFO sightings.",
            "sent3": "The sudden appearance of a rainbow during the storm felt supernatural.",
            "sent4": "The growth of the rare flower in the desert was a supernatural phenomenon.",
            "sent5": "The legend of the haunted house was filled with tales of supernatural encounters."
        }
    ]
}