{
    "term": "superciliousness",
    "meanings": [
        {
            "definition": "The quality or state of being supercilious.",
            "pos": "noun",
            "sent1": "Her superciliousness was evident in the way she looked down on others.",
            "sent2": "His superciliousness made it difficult for others to approach him.",
            "sent3": "Despite her superciliousness, she couldn't hide her excitement when she won the competition.",
            "sent4": "The superciliousness of the cat as it walked by seemed to mock the other animals.",
            "sent5": "The teacher's superciliousness towards the students created a tense atmosphere in the classroom."
        },
        {
            "definition": "Behavior or attitude of displaying haughty disdain.",
            "pos": "noun",
            "sent1": "The superciliousness in her tone made it clear she thought she was better than everyone else.",
            "sent2": "His superciliousness towards the waiter was uncalled for.",
            "sent3": "Despite his superciliousness, he couldn't help but admire the talent of the street performer.",
            "sent4": "The superciliousness of the queen towards her subjects was well-known throughout the kingdom.",
            "sent5": "The politician's superciliousness during the debate turned off many voters."
        },
        {
            "definition": "Arrogant or condescending behavior.",
            "pos": "noun",
            "sent1": "His superciliousness towards his colleagues alienated them from working together.",
            "sent2": "The superciliousness of the celebrity made the fans feel unappreciated.",
            "sent3": "Despite his superciliousness, he secretly admired the dedication of his rival.",
            "sent4": "The superciliousness of the rich businessman was evident in the way he treated his employees.",
            "sent5": "The coach's superciliousness towards the players affected team morale negatively."
        }
    ]
}