{
    "term": "superciliously",
    "meanings": [
        {
            "definition": "Behaving or looking as though one thinks one is superior to others.",
            "pos": "adjective",
            "sent1": "She gave a superciliously smile to her classmates when she received the highest grade.",
            "sent2": "The superciliously dressed woman walked past the others with a haughty air.",
            "sent3": "He always acted superciliously towards his younger siblings, pretending to be better than them.",
            "sent4": "The cat sat on the windowsill, staring down at the dogs in the yard superciliously.",
            "sent5": "The queen looked superciliously at the peasants below from her balcony."
        },
        {
            "definition": "Showing disdain or contempt for others.",
            "pos": "adjective",
            "sent1": "His superciliously raised eyebrow revealed his disdain for the proposal.",
            "sent2": "She spoke in a superciliously tone, making it clear she did not respect their opinions.",
            "sent3": "The superciliously waiter rolled his eyes at the customer's request for extra napkins.",
            "sent4": "The politician's superciliously smirk showed his contempt for the opposing party.",
            "sent5": "The judge looked superciliously at the defendant, unimpressed by their excuses."
        },
        {
            "definition": "Arrogantly superior.",
            "pos": "adjective",
            "sent1": "The superciliously wealthy businessman looked down on those less fortunate.",
            "sent2": "She spoke in a superciliously manner, making everyone feel inferior.",
            "sent3": "The superciliously professor dismissed the student's question as irrelevant.",
            "sent4": "The superciliously lion strutted through the savannah, asserting its dominance.",
            "sent5": "The superciliously CEO made decisions without considering the opinions of others."
        }
    ]
}