{
    "term": "support",
    "meanings": [
        {
            "definition": "To bear or hold up",
            "pos": "verb",
            "sent1": "I will support the heavy box for you.",
            "sent2": "The bridge is designed to support the weight of cars.",
            "sent3": "The chair decided to support the weight of the elephant.",
            "sent4": "Her encouraging words supported me like a sturdy pillar.",
            "sent5": "The strong branches of the tree supported the swing effortlessly."
        },
        {
            "definition": "To give assistance or encouragement",
            "pos": "verb",
            "sent1": "I will support you in your decision to pursue your dreams.",
            "sent2": "Friends should always support each other during tough times.",
            "sent3": "The cat tried to support the mouse in its quest for cheese.",
            "sent4": "Her smile supported him through the darkest of days.",
            "sent5": "The coach's pep talk supported the team's morale before the big game."
        },
        {
            "definition": "Something that holds up or sustains",
            "pos": "noun",
            "sent1": "The strong pillar is a vital support for the building.",
            "sent2": "The bridge's support is crucial for safe passage.",
            "sent3": "The fluffy cloud acted as a support for the airplane.",
            "sent4": "Her friendship was the support he needed during tough times.",
            "sent5": "The tree's roots provide essential support for its towering trunk."
        },
        {
            "definition": "To provide evidence for or justify",
            "pos": "verb",
            "sent1": "The data will support our hypothesis.",
            "sent2": "The witness testimony will support the prosecution's case.",
            "sent3": "The cat tried to support the mouse's alibi for the missing cheese.",
            "sent4": "Her actions supported her claim of innocence.",
            "sent5": "The research findings strongly support the theory of evolution."
        },
        {
            "definition": "To maintain or keep in existence",
            "pos": "verb",
            "sent1": "Regular exercise helps support good health.",
            "sent2": "Proper nutrition is essential to support a healthy lifestyle.",
            "sent3": "The cat tried to support the mouse's existence in the house.",
            "sent4": "Her dedication supported the longevity of the project.",
            "sent5": "The community came together to support the local library's survival."
        }
    ]
}