{
    "term": "suppressor",
    "meanings": [
        {
            "definition": "A person or thing that suppresses.",
            "pos": "noun",
            "sent1": "The teacher acted as a suppressor of the noisy students in the classroom.",
            "sent2": "The suppressor of the group's laughter was the serious look on the principal's face.",
            "sent3": "The suppressor of fun at the party was the unexpected arrival of the neighbors.",
            "sent4": "Her strict rules acted as a suppressor on the excitement of the event.",
            "sent5": "The suppressor of the argument was the calming presence of a mediator."
        },
        {
            "definition": "A device used to reduce the noise or flash of a firearm.",
            "pos": "noun",
            "sent1": "The soldier attached the suppressor to the gun to muffle the sound of the shots.",
            "sent2": "Hunters often use a suppressor on their rifles to avoid scaring away animals.",
            "sent3": "The suppressor on the gun made it sound like a whisper instead of a bang.",
            "sent4": "The suppressor on the firearm turned the deafening noise into a mere whisper.",
            "sent5": "The suppressor on the rifle made the shots almost silent, like a secret being kept."
        },
        {
            "definition": "A gene that suppresses the effect of another gene.",
            "pos": "noun",
            "sent1": "The suppressor gene prevented the harmful effects of the mutated gene from showing.",
            "sent2": "Scientists discovered a suppressor that could counteract the negative impact of a specific gene.",
            "sent3": "The suppressor gene was like a superhero, swooping in to save the day from genetic disasters.",
            "sent4": "The suppressor gene acted like a shield, protecting the organism from the harmful gene's influence.",
            "sent5": "The suppressor gene was the genetic hero that neutralized the villainous effects of the mutated gene."
        }
    ]
}