{
    "term": "supposititious",
    "meanings": [
        {
            "definition": "Fraudulently substituted or replaced",
            "pos": "adjective",
            "sent1": "The supposititious painting was sold as an original, fooling many art collectors.",
            "sent2": "The detective uncovered the supposititious documents that were used to deceive the public.",
            "sent3": "The supposititious diamond turned out to be a cleverly crafted fake.",
            "sent4": "Her supposititious claims of royal ancestry were quickly debunked.",
            "sent5": "The supposititious prince turned out to be an imposter in disguise."
        },
        {
            "definition": "Supposed or assumed to be true without evidence",
            "pos": "adjective",
            "sent1": "The supposititious story about aliens visiting Earth spread quickly among the students.",
            "sent2": "Despite being labeled as supposititious, the theory gained popularity among conspiracy theorists.",
            "sent3": "The supposititious rumor of a ghost haunting the old mansion scared the children.",
            "sent4": "Her supposititious prediction of winning the lottery turned out to be wishful thinking.",
            "sent5": "The supposititious treasure map led the adventurers on a wild goose chase."
        },
        {
            "definition": "Illegitimate or falsely claimed to be true",
            "pos": "adjective",
            "sent1": "The supposititious heir tried to claim the family fortune but was exposed as a fraud.",
            "sent2": "The supposititious product promised miraculous results but failed to deliver.",
            "sent3": "The supposititious doctor was actually a quack with no medical training.",
            "sent4": "Her supposititious excuse for missing work was met with skepticism by her boss.",
            "sent5": "The supposititious website was shut down for spreading false information."
        }
    ]
}