{
    "term": "supraventricular",
    "meanings": [
        {
            "definition": "Located above the ventricles of the heart.",
            "pos": "adjective",
            "sent1": "The supraventricular area is positioned higher than the heart's lower chambers.",
            "sent2": "The doctor explained that the supraventricular region is situated above the heart's pumping chambers.",
            "sent3": "The balloon floated in a supraventricular position, just above the heart model.",
            "sent4": "Her dreams soared to a supraventricular height, beyond the ventricles of reality.",
            "sent5": "The sun rose in a supraventricular direction, casting light over the heart's upper area."
        },
        {
            "definition": "Pertaining to or affecting the area above the ventricles.",
            "pos": "adjective",
            "sent1": "The supraventricular condition involves issues in the upper heart region.",
            "sent2": "Doctors discussed the supraventricular symptoms affecting the heart's upper part.",
            "sent3": "The cat's curious behavior was supraventricular, exploring the top of the heart model.",
            "sent4": "Her joy spread in a supraventricular manner, reaching the highest emotional levels.",
            "sent5": "The music resonated in a supraventricular way, touching the heart's upper chambers."
        },
        {
            "definition": "A type of arrhythmia originating above the ventricles of the heart.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with supraventricular arrhythmia.",
            "sent2": "She researched the treatment options for supraventricular irregular heartbeats.",
            "sent3": "The dance of the heartbeats turned into a supraventricular rhythm, above the ventricles.",
            "sent4": "His emotions danced in a supraventricular pattern, out of sync with the heart's lower chambers.",
            "sent5": "The melody of life played a supraventricular tune, skipping beats above the heart's main chambers."
        }
    ]
}