{
    "term": "suprematism",
    "meanings": [
        {
            "definition": "An art movement focused on geometric shapes and limited colors.",
            "pos": "noun",
            "sent1": "Suprematism influenced many artists to use simple shapes and colors in their work.",
            "sent2": "The museum displayed a collection of suprematism paintings from the early 20th century.",
            "sent3": "The art class tried to recreate suprematism by using only squares and triangles in their projects.",
            "sent4": "Her room was a masterpiece of suprematism, with every piece of furniture carefully chosen for its shape and color.",
            "sent5": "The beauty of suprematism lies in its ability to evoke strong emotions through minimalistic design."
        },
        {
            "definition": "The use of basic shapes and colors to convey emotion or meaning.",
            "pos": "noun",
            "sent1": "His artwork was a perfect example of suprematism, using only primary colors and simple shapes.",
            "sent2": "Suprematism allows artists to express complex emotions through the simplicity of form and color.",
            "sent3": "The children's book used suprematism to teach kids about different emotions through shapes and colors.",
            "sent4": "In her painting, she used suprematism to symbolize the chaos and order in the world.",
            "sent5": "The artist's use of suprematism created a powerful connection between the viewer and the artwork."
        },
        {
            "definition": "A style of art that emphasizes the purity of form and color.",
            "pos": "noun",
            "sent1": "The art gallery featured a collection of suprematism pieces that showcased the purity of form and color.",
            "sent2": "Suprematism artists believe that the essence of art lies in the purity of form and color.",
            "sent3": "The fashion designer drew inspiration from suprematism, creating a clothing line with clean lines and bold colors.",
            "sent4": "The room was decorated in suprematism style, with every detail carefully chosen for its purity of form and color.",
            "sent5": "The simplicity of suprematism allows the viewer to focus on the purity of form and color in the artwork."
        }
    ]
}