{
    "term": "sure",
    "meanings": [
        {
            "definition": "Confident in what one thinks or knows",
            "pos": "adjective",
            "sent1": "She felt sure about her answer on the test.",
            "sent2": "He is always sure of himself when speaking in public.",
            "sent3": "The cat looked sure of catching the mouse in the garden.",
            "sent4": "His smile was a sure sign of his confidence.",
            "sent5": "The bright red color made the stop sign sure to grab attention."
        },
        {
            "definition": "Certain to happen or be true",
            "pos": "adjective",
            "sent1": "The sun rising in the east is a sure thing every morning.",
            "sent2": "The team's victory was a sure outcome with their strong performance.",
            "sent3": "The magician's trick was so sure to impress the audience.",
            "sent4": "Her laughter was a sure indicator of her happiness.",
            "sent5": "The sound of thunder was a sure sign of an approaching storm."
        },
        {
            "definition": "Without doubt",
            "pos": "adverb",
            "sent1": "He nodded sure when asked if he understood the instructions.",
            "sent2": "She spoke sure that the decision was the right one.",
            "sent3": "The child's eyes widened sure at the sight of the huge cake.",
            "sent4": "The old man smiled sure as he reminisced about his youth.",
            "sent5": "The dog wagged its tail sure as it waited for its treat."
        },
        {
            "definition": "Confidently or positively certain or sure",
            "pos": "adjective",
            "sent1": "The coach was sure that his team would win the championship.",
            "sent2": "She gave a sure answer to the difficult question.",
            "sent3": "The squirrel moved sure along the tree branch.",
            "sent4": "His sure steps showed he knew the path well.",
            "sent5": "The bright smile on her face was a sure indication of her happiness."
        }
    ]
}