{
    "term": "surgery",
    "meanings": [
        {
            "definition": "The branch of medicine that deals with the treatment of injuries or disorders by manual or operative methods.",
            "pos": "noun",
            "sent1": "After the accident, the doctor recommended surgery to fix the broken bone.",
            "sent2": "The hospital has a specialized department for surgery where doctors perform operations.",
            "sent3": "I heard a joke about a clumsy surgeon who always dropped things during surgery.",
            "sent4": "Her precision in surgery was like a skilled artist painting on a delicate canvas.",
            "sent5": "The image of surgery, with its sharp tools and focused doctors, stayed in my mind."
        },
        {
            "definition": "The room or department in a hospital where surgical operations are performed.",
            "pos": "noun",
            "sent1": "The surgery was equipped with state-of-the-art technology for complex procedures.",
            "sent2": "Patients were wheeled into the surgery for their scheduled operations.",
            "sent3": "The surgery was so busy that the doctors joked about needing a traffic light at the entrance.",
            "sent4": "Walking into the surgery felt like stepping into a high-stakes theater performance.",
            "sent5": "The cleanliness and organization of the surgery impressed all who entered."
        },
        {
            "definition": "The act or process of performing surgery.",
            "pos": "noun",
            "sent1": "The success of the surgery depended on the skill of the surgeon.",
            "sent2": "During the surgery, the medical team worked together seamlessly.",
            "sent3": "The surgery went smoothly, but the surgeon accidentally wore mismatched socks.",
            "sent4": "In the world of medicine, the art of surgery is a delicate dance between life and death.",
            "sent5": "The tension in the room before the surgery was palpable, like a storm waiting to break."
        }
    ]
}