{
    "term": "surge",
    "meanings": [
        {
            "definition": "A sudden powerful forward or upward movement.",
            "pos": "noun",
            "sent1": "The surge of the waves carried the boat swiftly towards the shore.",
            "sent2": "The sudden surge of electricity damaged the circuit.",
            "sent3": "The surge of laughter erupted from the audience at the comedian's joke.",
            "sent4": "The surge of emotions overwhelmed her like a tidal wave.",
            "sent5": "The surge of adrenaline fueled his sprint to the finish line."
        },
        {
            "definition": "A sudden increase in something.",
            "pos": "noun",
            "sent1": "The surge in sales during the holiday season was expected.",
            "sent2": "The surge of interest in the new product caught the company off guard.",
            "sent3": "The surge of excitement among the children was contagious.",
            "sent4": "The surge of energy in the room was palpable.",
            "sent5": "The surge of creativity led to a burst of new ideas."
        },
        {
            "definition": "To move suddenly and powerfully forward or upward.",
            "pos": "verb",
            "sent1": "The athletes surged ahead in the final stretch of the race.",
            "sent2": "The crowd surged towards the stage when the band started playing.",
            "sent3": "The cat surged up the tree to escape the barking dog.",
            "sent4": "The music surged through the speakers, filling the room with sound.",
            "sent5": "The car surged forward when the driver pressed the accelerator."
        },
        {
            "definition": "To increase suddenly and powerfully.",
            "pos": "verb",
            "sent1": "The prices surged after the announcement of the new product.",
            "sent2": "The demand for the limited edition item surged overnight.",
            "sent3": "The temperature surged unexpectedly, causing a heatwave.",
            "sent4": "The excitement in the room surged as the concert began.",
            "sent5": "The emotions surged within her, overwhelming her with joy."
        }
    ]
}