{
    "term": "surgeries",
    "meanings": [
        {
            "definition": "The act or process of performing medical operations",
            "pos": "noun",
            "sent1": "The hospital conducted many surgeries last week.",
            "sent2": "Doctors perform surgeries in operating rooms.",
            "sent3": "The surgeries at the hospital kept everyone busy.",
            "sent4": "Her precision in surgeries was like a skilled artist.",
            "sent5": "The surgeries saved many lives and brought hope to families."
        },
        {
            "definition": "A place where medical operations are performed",
            "pos": "noun",
            "sent1": "The surgeries were equipped with advanced technology.",
            "sent2": "Patients were taken to the surgeries for their procedures.",
            "sent3": "The surgeries had a calming atmosphere for patients.",
            "sent4": "The surgeries stood as beacons of healing in the community.",
            "sent5": "The cleanliness of the surgeries reassured patients before their operations."
        },
        {
            "definition": "The branch of medicine that deals with operations performed on patients",
            "pos": "noun",
            "sent1": "Surgeries require specialized training and expertise.",
            "sent2": "Many students aspire to work in surgeries one day.",
            "sent3": "The surgeries department is always bustling with activity.",
            "sent4": "In the world of surgeries, precision is key to success.",
            "sent5": "The advancements in surgeries have revolutionized patient care."
        },
        {
            "definition": "The act or process of cutting into something for a specific purpose",
            "pos": "noun",
            "sent1": "The surgeries on the tree helped it grow stronger.",
            "sent2": "Precision is crucial in delicate surgeries like these.",
            "sent3": "The surgeries on the cake made it look like a masterpiece.",
            "sent4": "His surgeries on the fabric transformed it into a beautiful dress.",
            "sent5": "The surgeries on the paper created intricate designs for the project."
        }
    ]
}