{
    "term": "surjective",
    "meanings": [
        {
            "definition": "Relating to a function that is onto, meaning every element in the codomain is mapped to by at least one element in the domain.",
            "pos": "adjective",
            "sent1": "The surjective function ensured that every number had a corresponding value.",
            "sent2": "In mathematics, a surjective mapping covers all possible outcomes.",
            "sent3": "The surjective function was like a magical wand, ensuring every wish had a match.",
            "sent4": "Her smile was surjective, reaching every corner of the room with its warmth.",
            "sent5": "The surjective nature of the music enveloped the audience in a symphony of emotions."
        },
        {
            "definition": "Characterized by the property of being surjective, as in a surjective function.",
            "pos": "adjective",
            "sent1": "The surjective nature of the equation allowed for multiple solutions.",
            "sent2": "The surjective function covered all possible outcomes, leaving no element untouched.",
            "sent3": "His surjective enthusiasm for the project was contagious, spreading to everyone around him.",
            "sent4": "The surjective reach of her influence extended far beyond her immediate circle.",
            "sent5": "The surjective colors of the painting blended seamlessly, creating a harmonious masterpiece."
        },
        {
            "definition": "Having the quality of being onto, as in a surjective mapping.",
            "pos": "adjective",
            "sent1": "The surjective mapping ensured that every point had a corresponding match.",
            "sent2": "In a surjective function, every element in the range is covered by the domain.",
            "sent3": "The surjective nature of his storytelling captivated the audience, leaving no one untouched.",
            "sent4": "Her words had a surjective effect, resonating with each listener in a unique way.",
            "sent5": "The surjective connection between the characters made the story come alive in the reader's mind."
        }
    ]
}