{
    "term": "surras",
    "meanings": [
        {
            "definition": "A group of wild animals, especially wolves or hounds, in pursuit of prey.",
            "pos": "noun",
            "sent1": "The surras of wolves howled in the night as they hunted for food.",
            "sent2": "The hounds formed a surras as they chased after the rabbit.",
            "sent3": "The surras of wolves played a game of hide and seek with the deer.",
            "sent4": "The surras of hounds moved like a silent shadow through the forest.",
            "sent5": "The surras of wolves moved in perfect harmony, like a well-oiled machine."
        },
        {
            "definition": "A sudden attack or charge, as in battle.",
            "pos": "noun",
            "sent1": "The soldiers launched a surras against the enemy camp.",
            "sent2": "The surras of bees caught the unsuspecting picnic-goers by surprise.",
            "sent3": "The surras of kids playing tag felt like a mini battle in the park.",
            "sent4": "The surras of raindrops on the roof sounded like a fierce battle drum.",
            "sent5": "The surras of wind hit the sails of the ship, propelling it forward like a charging army."
        },
        {
            "definition": "To pursue or attack with a group of animals.",
            "pos": "verb",
            "sent1": "The lioness surrased the gazelle with her cubs close behind.",
            "sent2": "The pack of wolves surrased the lone caribou, ready to strike.",
            "sent3": "The cat surrased the toy mouse, thinking it was real prey.",
            "sent4": "The surrasing cheetahs closed in on the sprinting antelope.",
            "sent5": "The surrassing eagles swooped down on the unsuspecting fish in the river."
        },
        {
            "definition": "To attack suddenly or unexpectedly.",
            "pos": "verb",
            "sent1": "The ninja surrased his opponent from the shadows.",
            "sent2": "The sudden storm surrased the coastal town, catching everyone off guard.",
            "sent3": "The surrasing cat pounced on the toy mouse with lightning speed.",
            "sent4": "The surrassing news of the promotion left everyone pleasantly surprised.",
            "sent5": "The surrassing strike of the snake left the mouse frozen in fear."
        }
    ]
}