{
    "term": "surreptitious",
    "meanings": [
        {
            "definition": "Done, made, or acquired by stealth",
            "pos": "adjective",
            "sent1": "The cat's surreptitious movements allowed it to steal the treat without anyone noticing.",
            "sent2": "She made a surreptitious entrance into the party, hoping to surprise her friends.",
            "sent3": "The squirrel's surreptitious attempt to steal the birdseed ended in a comical chase around the garden.",
            "sent4": "His surreptitious glances at the test answers helped him pass the exam.",
            "sent5": "The spy's surreptitious activities were finally uncovered by the vigilant agent."
        },
        {
            "definition": "Acting or doing something in a secret or sneaky way",
            "pos": "adjective",
            "sent1": "The children shared a surreptitious glance before planning their surprise for their parents.",
            "sent2": "The thief made a surreptitious escape through the back door.",
            "sent3": "The detective's surreptitious investigation led to the unexpected discovery of the missing necklace.",
            "sent4": "Her surreptitious smile hinted at a hidden agenda.",
            "sent5": "The magician's surreptitious tricks amazed the audience."
        },
        {
            "definition": "Obtained, done, made, etc., by stealth; secret or unauthorized; clandestine",
            "pos": "adjective",
            "sent1": "The group's surreptitious meeting in the abandoned warehouse raised suspicions among the townspeople.",
            "sent2": "The company's surreptitious dealings were exposed by a whistleblower.",
            "sent3": "The student's surreptitious use of a cheat sheet during the exam led to a surprising outcome.",
            "sent4": "The artist's surreptitious painting in the dark captured the essence of mystery.",
            "sent5": "The politician's surreptitious actions were revealed by investigative journalists."
        }
    ]
}