{
    "term": "surrogated",
    "meanings": [
        {
            "definition": "To act as a substitute or replacement for someone or something else.",
            "pos": "verb",
            "sent1": "She surrogated her friend in the school play when her friend got sick.",
            "sent2": "The teacher surrogated the class hamster over the weekend.",
            "sent3": "The cat surrogated as a lion in the school play, wearing a mane and roaring loudly.",
            "sent4": "His old car surrogated as a spaceship in his imagination, zooming through the galaxy.",
            "sent5": "The umbrella surrogated as a shield in the pretend battle, protecting him from imaginary foes."
        },
        {
            "definition": "To appoint someone as a surrogate.",
            "pos": "verb",
            "sent1": "He surrogated his sister to take care of his plants while he was away.",
            "sent2": "The manager surrogated a team member to represent the department at the meeting.",
            "sent3": "The teddy bear was surrogated as the king of the stuffed animal kingdom by the little girl.",
            "sent4": "The wise owl was surrogated as the leader of the forest creatures, guiding them with its knowledge.",
            "sent5": "The toy soldier was surrogated as the captain of the army of toys, leading them into battle."
        },
        {
            "definition": "To transfer or delegate authority or responsibility to another person.",
            "pos": "verb",
            "sent1": "The manager surrogated the decision-making power to his assistant for the day.",
            "sent2": "She surrogated the task of organizing the event to her best friend.",
            "sent3": "The magic wand was surrogated as the ruler of the enchanted kingdom, granting wishes to all.",
            "sent4": "The key surrogated as the gatekeeper, unlocking the mysteries of the ancient castle.",
            "sent5": "The crown surrogated as the symbol of power, bestowing authority upon the chosen ruler."
        }
    ]
}