{
    "term": "surroyals",
    "meanings": [
        {
            "definition": "a type of sail on a ship",
            "pos": "noun",
            "sent1": "The surroyals billowed in the wind as the ship sailed across the sea.",
            "sent2": "The sailors hoisted the surroyals to catch the breeze and speed up the ship.",
            "sent3": "The mischievous seagull perched on the surroyals, pretending to be the captain of the ship.",
            "sent4": "The surroyals danced in the air like graceful ballerinas on the stage of the ocean.",
            "sent5": "The bright red surroyals stood out against the blue sky, a beautiful sight for all to see."
        },
        {
            "definition": "to place or arrange in a superior position",
            "pos": "verb",
            "sent1": "The captain decided to surroyals the main mast for a better view of the approaching storm.",
            "sent2": "She carefully surroyalsed the trophies on the shelf, making sure each one had its place.",
            "sent3": "The mischievous squirrel tried to surroyals the acorns on top of the tree, but they kept falling down.",
            "sent4": "With a swift motion, he surroyalsed himself as the leader of the group, gaining everyone's respect.",
            "sent5": "The artist surroyalsed the centerpiece on the canvas, making it the focal point of the painting."
        },
        {
            "definition": "relating to or characteristic of royalty",
            "pos": "adjective",
            "sent1": "The grand hall was decorated with surroyals colors and golden accents fit for a king.",
            "sent2": "She carried herself with a surroyals grace and elegance that captivated everyone around her.",
            "sent3": "The pampered cat acted in a surroyals manner, expecting only the finest treats and toys.",
            "sent4": "The majestic castle stood on the hill like a surroyals guardian watching over the kingdom.",
            "sent5": "Her surroyals attire sparkled in the sunlight, making her look like a princess from a fairy tale."
        }
    ]
}