{
    "term": "suspended",
    "meanings": [
        {
            "definition": "temporarily prevent from continuing or being in force",
            "pos": "verb",
            "sent1": "The teacher suspended the game due to the storm.",
            "sent2": "The principal suspended the student for breaking the rules.",
            "sent3": "The rain suspended our plans for a picnic, but we had a fun indoor party instead.",
            "sent4": "The unexpected power outage suspended our online meeting abruptly.",
            "sent5": "The bridge construction was suspended until the weather improved."
        },
        {
            "definition": "hang from somewhere",
            "pos": "verb",
            "sent1": "The chandelier was suspended from the ceiling in the grand hall.",
            "sent2": "The spider suspended itself from a thin thread of silk.",
            "sent3": "The colorful pinata was suspended high above the children's heads.",
            "sent4": "The hammock was suspended between two sturdy trees in the backyard.",
            "sent5": "The artwork was suspended on the gallery wall for everyone to admire."
        },
        {
            "definition": "delay or postpone",
            "pos": "verb",
            "sent1": "The bad weather suspended the outdoor event until the next day.",
            "sent2": "The airline suspended all flights due to the volcanic ash cloud.",
            "sent3": "The chef had to suspend baking the cake until more ingredients arrived.",
            "sent4": "The decision to suspend the project was made to gather more information.",
            "sent5": "The repair work was suspended temporarily to address safety concerns."
        },
        {
            "definition": "keep in a state of indecision or inactivity",
            "pos": "verb",
            "sent1": "The unresolved issue suspended the team's progress on the project.",
            "sent2": "The mystery novel suspended the reader in anticipation of the next chapter.",
            "sent3": "The magician's trick suspended disbelief in the audience's minds.",
            "sent4": "The unresolved conflict suspended peace in the community.",
            "sent5": "The unanswered question suspended curiosity in the classroom."
        }
    ]
}