{
    "term": "sustainably",
    "meanings": [
        {
            "definition": "In a way that can be maintained or continued without causing harm to the environment or depleting natural resources.",
            "pos": "adverb",
            "sent1": "The company decided to operate sustainably by using renewable energy sources.",
            "sent2": "Farmers are learning to grow crops sustainably to protect the soil.",
            "sent3": "The tree hugged the earth sustainably, knowing it was its duty to stay rooted.",
            "sent4": "The river flowed sustainably, never taking more than it needed from the land.",
            "sent5": "The village lived sustainably, in harmony with nature's rhythms."
        },
        {
            "definition": "In a manner that is economically viable over the long term.",
            "pos": "adverb",
            "sent1": "The business expanded sustainably, ensuring steady growth without overspending.",
            "sent2": "Investing in renewable energy can help countries develop sustainably.",
            "sent3": "The piggy bank saved money sustainably, never spending more than it earned.",
            "sent4": "Her savings account grew sustainably, like a tree slowly reaching for the sky.",
            "sent5": "The economy thrived sustainably, balancing growth with stability."
        },
        {
            "definition": "In a manner that supports the needs of the present without compromising the ability of future generations to meet their own needs.",
            "pos": "adverb",
            "sent1": "By recycling, we can live sustainably and protect the planet for future generations.",
            "sent2": "Conserving water is essential to living sustainably and ensuring a better tomorrow.",
            "sent3": "The wise owl saved its food sustainably, thinking of the baby owlets yet to come.",
            "sent4": "The torchbearer passed the flame sustainably, lighting the way for those who follow.",
            "sent5": "The community planned sustainably, building a legacy for generations to come."
        }
    ]
}