{
    "term": "sustainer",
    "meanings": [
        {
            "definition": "One who sustains or supports",
            "pos": "noun",
            "sent1": "The sustainer of the team, John, always encourages his teammates.",
            "sent2": "The community sees the sustainer as a pillar of strength and reliability.",
            "sent3": "The little squirrel acted as a sustainer for the injured bird by bringing it food.",
            "sent4": "Her kind words were a sustainer for his spirit during tough times.",
            "sent5": "In the story, the wise old owl served as a sustainer of knowledge for the young animals."
        },
        {
            "definition": "Something that sustains or maintains",
            "pos": "noun",
            "sent1": "Water is a vital sustainer for all living beings.",
            "sent2": "The sunlight acts as a natural sustainer for plant growth.",
            "sent3": "The cozy blanket became a sustainer of warmth on chilly nights.",
            "sent4": "Laughter is a powerful sustainer of happiness in life.",
            "sent5": "Music can be a sustainer of memories and emotions."
        },
        {
            "definition": "A device that provides power or support",
            "pos": "noun",
            "sent1": "The solar panel is a sustainable sustainer of electricity for the house.",
            "sent2": "The generator serves as a reliable sustainer during power outages.",
            "sent3": "The robot vacuum cleaner is a modern sustainer of cleanliness in the home.",
            "sent4": "The wind turbine is an eco-friendly sustainer of energy for the town.",
            "sent5": "The battery pack acts as a portable sustainer of power for electronic devices."
        },
        {
            "definition": "A person or thing that upholds or keeps in existence",
            "pos": "noun",
            "sent1": "The constitution is a legal sustainer of democracy in the country.",
            "sent2": "Family traditions can be a cultural sustainer for generations.",
            "sent3": "The old lighthouse stands as a maritime sustainer of history along the coast.",
            "sent4": "The ancient tree is a natural sustainer of life for various animals in the forest.",
            "sent5": "The library is a knowledge sustainer for the community, preserving books for all to access."
        }
    ]
}