{
    "term": "sustains",
    "meanings": [
        {
            "definition": "To support or hold up",
            "pos": "verb",
            "sent1": "The strong pillar sustains the roof above.",
            "sent2": "The bridge sustains the weight of the cars passing over it.",
            "sent3": "The superhero's cape sustains him as he flies through the sky.",
            "sent4": "Her encouraging words sustain me through difficult times.",
            "sent5": "The tree sustains the swing as children play joyfully."
        },
        {
            "definition": "To keep up or maintain",
            "pos": "verb",
            "sent1": "Regular exercise sustains good health.",
            "sent2": "Proper care sustains the beauty of the garden.",
            "sent3": "The diligent student sustains high grades with hard work.",
            "sent4": "The clock's ticking sound sustains the rhythm of the room.",
            "sent5": "A balanced diet sustains energy levels throughout the day."
        },
        {
            "definition": "To endure or withstand",
            "pos": "verb",
            "sent1": "The old building sustains the harsh weather year after year.",
            "sent2": "The friendship between them sustains the test of time.",
            "sent3": "The sturdy umbrella sustains the strong winds without flipping.",
            "sent4": "Her determination sustains her through all obstacles.",
            "sent5": "The mountain's peak sustains extreme weather conditions."
        },
        {
            "definition": "To provide for or nourish",
            "pos": "verb",
            "sent1": "The farmer sustains his family by growing crops.",
            "sent2": "Breast milk sustains a baby's growth and development.",
            "sent3": "The chef sustains the hungry guests with a delicious meal.",
            "sent4": "The sun sustains life on Earth by providing warmth.",
            "sent5": "Water sustains the plants in the garden, keeping them healthy."
        },
        {
            "definition": "To suffer or experience",
            "pos": "verb",
            "sent1": "He sustains a minor injury while playing soccer.",
            "sent2": "The soldier sustains wounds during battle.",
            "sent3": "The actor sustains a fall on stage but continues the performance.",
            "sent4": "She sustains emotional pain after the loss of a loved one.",
            "sent5": "The athlete sustains exhaustion after completing the marathon."
        }
    ]
}