{
    "term": "swad",
    "meanings": [
        {
            "definition": "A slang term for a cool or stylish person.",
            "pos": "noun",
            "sent1": "My friend is such a swad at school, always wearing the trendiest clothes.",
            "sent2": "The swad at the party had everyone's attention with their confident demeanor.",
            "sent3": "I wish I could be as swad as that celebrity on TV, they always look so fashionable.",
            "sent4": "She walked into the room like a swad, turning heads with her chic outfit.",
            "sent5": "Being a swad means having a unique sense of style that stands out."
        },
        {
            "definition": "To hit or strike with a heavy blow.",
            "pos": "verb",
            "sent1": "He accidentally swad the ball too hard, causing it to fly over the fence.",
            "sent2": "The boxer trained hard to swad his opponent with a powerful punch.",
            "sent3": "The chef had to swad the dough to make it smooth and elastic for baking.",
            "sent4": "The storm swad the trees, leaving a trail of destruction in its wake.",
            "sent5": "The hammer swad the nail into the wood effortlessly."
        },
        {
            "definition": "A type of Indian bread made with whole wheat flour.",
            "pos": "noun",
            "sent1": "I love the aroma of freshly baked swad in the kitchen.",
            "sent2": "The restaurant served delicious swad with spicy curry.",
            "sent3": "She learned to make swad from her grandmother's traditional recipe.",
            "sent4": "The warm swad melted in my mouth, complementing the curry perfectly.",
            "sent5": "The swad was soft and fluffy, a perfect accompaniment to the meal."
        },
        {
            "definition": "A unit of weight equal to 16 stone.",
            "pos": "noun",
            "sent1": "The ancient scale measured his weight in swad, showing he had lost a few pounds.",
            "sent2": "She weighed the ingredients using the swad measurement for accuracy.",
            "sent3": "The doctor noted his weight in swad on the medical chart.",
            "sent4": "The swad measurement was commonly used in the olden days for heavy objects.",
            "sent5": "The merchant traded goods based on the swad weight to ensure fairness."
        }
    ]
}