{
    "term": "swashes",
    "meanings": [
        {
            "definition": "To move with a splashing or swashing sound.",
            "pos": "verb",
            "sent1": "The waves swashes against the shore.",
            "sent2": "She swashes the mop back and forth to clean the floor.",
            "sent3": "The playful puppy swashes water everywhere during bath time.",
            "sent4": "The wind swashes through the trees, creating a soothing sound.",
            "sent5": "The rain swashes against the window, lulling me to sleep."
        },
        {
            "definition": "A splash or dashing sound.",
            "pos": "noun",
            "sent1": "The swashes of the fountain added a refreshing touch to the garden.",
            "sent2": "I heard the swashes of the river as I approached.",
            "sent3": "The chef added the final touch to the dish with a swashes of sauce.",
            "sent4": "The swashes of the waterfall echoed through the canyon.",
            "sent5": "The swashes of the paintbrush brought life to the canvas."
        },
        {
            "definition": "A decorative flourish or ornamental scroll in writing or printing.",
            "pos": "noun",
            "sent1": "The invitation was adorned with elegant swashes and curls.",
            "sent2": "The certificate had intricate swashes around the border.",
            "sent3": "The calligrapher added a playful swashes to the lettering.",
            "sent4": "The book cover featured golden swashes that caught the eye.",
            "sent5": "The artist signed the painting with a unique swashes."
        },
        {
            "definition": "To make a showy or swaggering display.",
            "pos": "verb",
            "sent1": "He swashes into the room, commanding attention with his presence.",
            "sent2": "The peacock swashes its feathers to impress the peahens.",
            "sent3": "The actor swashes across the stage, stealing the spotlight.",
            "sent4": "She swashes through the party, turning heads with her confidence.",
            "sent5": "The knight swashes into battle, ready to conquer the enemy."
        }
    ]
}