{
    "term": "sway",
    "meanings": [
        {
            "definition": "To move or swing back and forth",
            "pos": "verb",
            "sent1": "The tree branches sway gently in the breeze.",
            "sent2": "The boat started to sway as the waves rocked it.",
            "sent3": "The toddler tried to sway the swing with all his might.",
            "sent4": "Her emotions sway like a pendulum, never staying still.",
            "sent5": "The dancer's hips sway gracefully to the music."
        },
        {
            "definition": "To influence or control someone or something",
            "pos": "verb",
            "sent1": "His persuasive arguments can sway people's opinions easily.",
            "sent2": "The charismatic leader's words can sway the crowd's emotions.",
            "sent3": "The delicious smell of fresh cookies can sway even the strictest dieter.",
            "sent4": "The hypnotist's gaze seemed to sway the audience into a trance.",
            "sent5": "The hypnotist's gaze seemed to sway the audience into a trance."
        },
        {
            "definition": "A controlling influence",
            "pos": "noun",
            "sent1": "The company's CEO holds a strong sway over its decisions.",
            "sent2": "In the fairy tale, the evil queen's magic mirror had a powerful sway.",
            "sent3": "The sway of social media can impact people's self-esteem.",
            "sent4": "The sway of tradition often guides people's actions.",
            "sent5": "The sway of tradition often guides people's actions."
        },
        {
            "definition": "To vacillate or change opinion or direction",
            "pos": "verb",
            "sent1": "She tends to sway between excitement and nervousness before a performance.",
            "sent2": "The politician seemed to sway on the issue depending on the audience.",
            "sent3": "The indecisive squirrel couldn't help but sway between two acorns.",
            "sent4": "His loyalty seemed to sway like a flag in the wind.",
            "sent5": "His loyalty seemed to sway like a flag in the wind."
        }
    ]
}