{
    "term": "sweats",
    "meanings": [
        {
            "definition": "Moisture exuded through the pores of the skin, typically as a reaction to heat, physical exertion, or anxiety.",
            "pos": "noun",
            "sent1": "After running, his sweats were visible on his forehead.",
            "sent2": "She wiped the sweats off her face after the intense workout.",
            "sent3": "The nervous speaker could feel the sweats forming on his palms.",
            "sent4": "The tension in the room was so thick you could almost see the sweats in the air.",
            "sent5": "The athlete's sweats glistened under the hot sun, showing his hard work."
        },
        {
            "definition": "A pair of loose-fitting pants with an elastic waistband, typically worn for exercise or lounging.",
            "pos": "noun",
            "sent1": "She put on her favorite sweats before heading to the gym.",
            "sent2": "He lounged on the couch in his comfy sweats all day.",
            "sent3": "The cat snuggled up on the pile of sweats left on the bed.",
            "sent4": "Her sweats were so cozy, she never wanted to take them off.",
            "sent5": "The old sweats had seen many workouts and lazy Sundays."
        },
        {
            "definition": "To exude moisture through the pores of the skin.",
            "pos": "verb",
            "sent1": "The hiker sweats profusely during the steep climb.",
            "sent2": "After the run, she could feel herself starting to sweat.",
            "sent3": "The nervous student sweats before every exam, no matter how prepared he is.",
            "sent4": "The heat of the day made him sweat like never before.",
            "sent5": "The intense workout session caused her to sweat buckets."
        },
        {
            "definition": "To work hard or labor intensely.",
            "pos": "verb",
            "sent1": "He sweats all day in the sun to earn a living.",
            "sent2": "The chef sweats over the stove to prepare the perfect dish.",
            "sent3": "The team sweats through the night to finish the project on time.",
            "sent4": "She sweats through each practice to improve her skills.",
            "sent5": "The artist sweats over every detail to create a masterpiece."
        }
    ]
}