{
    "term": "sweated",
    "meanings": [
        {
            "definition": "perspired",
            "pos": "verb",
            "sent1": "After playing outside, he sweated a lot.",
            "sent2": "She sweated during her intense workout.",
            "sent3": "The sun was so hot that even the ice cream sweated!",
            "sent4": "The walls of the gym sweated with the effort of the athletes.",
            "sent5": "The nervous speaker sweated profusely under the bright lights."
        },
        {
            "definition": "caused to perspire",
            "pos": "verb",
            "sent1": "The spicy food really sweated him.",
            "sent2": "The coach's training session sweated the players.",
            "sent3": "The sauna sweated out all the toxins from his body.",
            "sent4": "The intense workout sweated the stress away.",
            "sent5": "The hot weather sweated the hikers as they climbed the mountain."
        },
        {
            "definition": "worked hard",
            "pos": "adjective",
            "sent1": "She was a sweated worker, always giving her best.",
            "sent2": "The sweated laborers finished the project ahead of schedule.",
            "sent3": "The sweated students studied all night for the exam.",
            "sent4": "The sweated chef prepared a delicious meal for the guests.",
            "sent5": "The sweated team won the championship through dedication and hard work."
        },
        {
            "definition": "extracted moisture from",
            "pos": "verb",
            "sent1": "The dehumidifier sweated the dampness from the room.",
            "sent2": "The intense heat sweated the moisture from the clothes.",
            "sent3": "The desert sweated the water from his skin quickly.",
            "sent4": "The salt sweated from the seawater as it evaporated.",
            "sent5": "The heat of the fire sweated the sap from the wood."
        },
        {
            "definition": "subjected to a process of sweating",
            "pos": "adjective",
            "sent1": "The sweated fabric felt cool against her skin.",
            "sent2": "The sweated horse was given water to drink.",
            "sent3": "The sweated glass was wiped clean after the workout.",
            "sent4": "The sweated metal gleamed after being polished.",
            "sent5": "The sweated athlete was wrapped in a warm towel after the race."
        }
    ]
}