{
    "term": "sweetgrasses",
    "meanings": [
        {
            "definition": "Sweetgrasses: grasses with a sweet fragrance",
            "pos": "noun",
            "sent1": "The sweetgrasses in the garden filled the air with a delightful smell.",
            "sent2": "I love walking through fields of sweetgrasses and breathing in their sweet scent.",
            "sent3": "The bees buzzed happily around the sweetgrasses, enjoying the sweet fragrance.",
            "sent4": "The sweetgrasses danced in the breeze, spreading their sweet fragrance all around.",
            "sent5": "The sweetgrasses whispered their sweet fragrance to anyone who passed by."
        },
        {
            "definition": "Sweetgrasses: a type of grass used for its sweet scent",
            "pos": "noun",
            "sent1": "The perfumer carefully harvested the sweetgrasses to create a new fragrance.",
            "sent2": "The sweetgrasses were bundled together and hung to dry for their sweet scent.",
            "sent3": "The chef sprinkled some dried sweetgrasses into the dish for a unique sweet aroma.",
            "sent4": "The sweetgrasses in the garden were like nature's own air freshener, filling the air with sweetness.",
            "sent5": "The sweetgrasses were prized for their ability to add a sweet scent to any product."
        },
        {
            "definition": "Sweetgrasses: grasses that emit a pleasant aroma",
            "pos": "noun",
            "sent1": "The meadow was filled with sweetgrasses that emitted a lovely scent.",
            "sent2": "The sweetgrasses near the riverbank perfumed the air with their pleasant aroma.",
            "sent3": "The sweetgrasses seemed to be competing with the flowers in emitting their pleasant aroma.",
            "sent4": "The sweetgrasses swayed in the wind, releasing their pleasant aroma into the surroundings.",
            "sent5": "The sweetgrasses were like nature's own air freshener, spreading a pleasant aroma everywhere."
        }
    ]
}