{
    "term": "swee",
    "meanings": [
        {
            "definition": "Sweet - having the taste or flavor characteristic of sugar",
            "pos": "adjective",
            "sent1": "The cake was so swee, it made my mouth happy.",
            "sent2": "The ice cream was swee and made me smile.",
            "sent3": "She added a little too much sugar, making the tea too swee.",
            "sent4": "Her voice was as swee as a melody, soothing everyone around.",
            "sent5": "The smell of freshly baked cookies was swee and inviting."
        },
        {
            "definition": "Sweet - pleasing to the senses or mind, especially through beauty or charm",
            "pos": "adjective",
            "sent1": "The flowers in the garden looked so swee under the sun.",
            "sent2": "The music was swee and brought joy to everyone.",
            "sent3": "The puppy's playful antics were so swee to watch.",
            "sent4": "Her smile was as swee as a summer breeze, calming all worries.",
            "sent5": "The painting was incredibly swee, capturing the beauty of nature."
        },
        {
            "definition": "Sweet - kind, thoughtful, or generous",
            "pos": "adjective",
            "sent1": "She always has a swee word for everyone she meets.",
            "sent2": "His gesture was so swee, it touched my heart.",
            "sent3": "The old man's swee act of helping the lady cross the street was heartwarming.",
            "sent4": "Her swee nature made her the most loved person in the neighborhood.",
            "sent5": "Their swee donation helped many families in need."
        },
        {
            "definition": "Sweet - used to express approval or admiration",
            "pos": "interjection",
            "sent1": "Sweet! You aced the test!",
            "sent2": "Sweet! That's an amazing achievement!",
            "sent3": "Sweet! You won the game with that fantastic move.",
            "sent4": "Sweet! Your artwork is truly impressive.",
            "sent5": "Sweet! Your performance on stage was outstanding."
        },
        {
            "definition": "Sweet - a sweet food or drink, such as candy or dessert",
            "pos": "noun",
            "sent1": "I love to indulge in a piece of swee after dinner.",
            "sent2": "The bakery had a variety of sweets to choose from.",
            "sent3": "She always carries a bag of sweets in her purse.",
            "sent4": "The table was filled with delicious sweets for the party.",
            "sent5": "The smell of freshly baked sweets filled the kitchen."
        }
    ]
}