{
    "term": "sweetie",
    "meanings": [
        {
            "definition": "A term of endearment for someone loved or cared for.",
            "pos": "noun",
            "sent1": "Come here, sweetie, let me give you a hug.",
            "sent2": "She always calls her daughter 'sweetie' as a sign of affection.",
            "sent3": "The little girl giggled when her grandpa called her 'sweetie'.",
            "sent4": "Her kindness made everyone feel like they were her sweeties.",
            "sent5": "In the movie, the main character's pet dog was her sweetie."
        },
        {
            "definition": "A small piece of candy or confection.",
            "pos": "noun",
            "sent1": "I bought some sweeties to share with my friends at the party.",
            "sent2": "The kids were excited to receive sweeties as a treat after dinner.",
            "sent3": "The sweetie melted in her mouth, leaving a sugary taste behind.",
            "sent4": "The jar on the counter was filled with colorful sweeties.",
            "sent5": "During Halloween, children go door to door collecting sweeties."
        },
        {
            "definition": "Having a pleasant taste characteristic of sugar or honey.",
            "pos": "adjective",
            "sent1": "The cake had a sweetie flavor that made everyone ask for seconds.",
            "sent2": "The sweetie tea was a refreshing drink on a hot summer day.",
            "sent3": "The sweetie strawberries were the highlight of the dessert table.",
            "sent4": "The sweetie aroma of freshly baked cookies filled the kitchen.",
            "sent5": "The sweetie syrup added a delicious touch to the pancakes."
        },
        {
            "definition": "Pleasing in general; delightful or charming.",
            "pos": "adjective",
            "sent1": "Her sweetie smile brightened up the room.",
            "sent2": "The little puppy's sweetie eyes melted everyone's hearts.",
            "sent3": "The sweetie decorations made the party feel extra special.",
            "sent4": "The sweetie melody of the music put everyone in a good mood.",
            "sent5": "The sweetie laughter of children playing echoed through the park."
        }
    ]
}