{
    "term": "swift",
    "meanings": [
        {
            "definition": "happening quickly or promptly",
            "pos": "adjective",
            "sent1": "The rabbit made a swift escape from the fox.",
            "sent2": "She gave a swift response to the question.",
            "sent3": "The swift delivery of the pizza surprised everyone.",
            "sent4": "Time flew by with swift wings, leaving us breathless.",
            "sent5": "The swift river carried the boat downstream in a flash."
        },
        {
            "definition": "moving or capable of moving with great speed",
            "pos": "adjective",
            "sent1": "The cheetah is known for its swift movements in the wild.",
            "sent2": "The swift horse won the race easily.",
            "sent3": "The swift wind nearly blew off my hat.",
            "sent4": "His swift reflexes saved him from the falling branch.",
            "sent5": "The swift spaceship zoomed through the galaxy at incredible speeds."
        },
        {
            "definition": "a small bird with long wings and a forked tail",
            "pos": "noun",
            "sent1": "I saw a beautiful swift flying across the sky.",
            "sent2": "The swift chirping of the birds filled the forest.",
            "sent3": "The swift bird built its nest in the tall tree.",
            "sent4": "The swift swoop of the bird caught the insect in mid-air.",
            "sent5": "The swift's graceful flight mesmerized the onlookers."
        },
        {
            "definition": "a light, adjustable reel for holding yarn or thread",
            "pos": "noun",
            "sent1": "She wound the yarn around the swift to keep it organized.",
            "sent2": "The swift helped her measure the length of the thread.",
            "sent3": "The cat played with the swift, unraveling the yarn.",
            "sent4": "The swift spun smoothly as she pulled the thread.",
            "sent5": "The swift's design made it easy to work with yarn efficiently."
        }
    ]
}