{
    "term": "swingbys",
    "meanings": [
        {
            "definition": "A maneuver in which a spacecraft uses the gravitational pull of a planet to alter its trajectory.",
            "pos": "noun",
            "sent1": "The spacecraft planned a series of swingbys to reach its destination faster.",
            "sent2": "The swingbys around Jupiter helped the spacecraft gather speed for its journey.",
            "sent3": "During the swingbys, the spacecraft waved at the planets as it passed by.",
            "sent4": "The swingbys acted like a cosmic slingshot, propelling the spacecraft forward.",
            "sent5": "The swingbys were like a cosmic dance, with planets guiding the spacecraft along its path."
        },
        {
            "definition": "The act of swinging by or passing close to something.",
            "pos": "noun",
            "sent1": "The swingbys of the birds outside the window brought joy to the children.",
            "sent2": "The swingbys of the branches in the wind created a soothing rhythm.",
            "sent3": "The swingbys of the cars on the highway made the commute more interesting.",
            "sent4": "The swingbys of the clouds over the mountains painted a beautiful scene.",
            "sent5": "The swingbys of the waves against the shore were mesmerizing to watch."
        },
        {
            "definition": "A method of propulsion in which a spacecraft gains speed by using the gravitational pull of a planet.",
            "pos": "noun",
            "sent1": "The spacecraft's speed increased significantly due to the swingbys it performed.",
            "sent2": "The swingbys provided the spacecraft with a boost in velocity for its journey.",
            "sent3": "The swingbys were like a cosmic speed boost for the spacecraft.",
            "sent4": "The swingbys were the spacecraft's way of hitching a ride on planetary gravity.",
            "sent5": "The swingbys were crucial for the spacecraft to accelerate towards its destination."
        }
    ]
}