{
    "term": "swinger",
    "meanings": [
        {
            "definition": "A person who engages in group sex or partner swapping.",
            "pos": "noun",
            "sent1": "The swinger enjoyed exploring different relationships.",
            "sent2": "The party was full of swingers looking to have a good time.",
            "sent3": "The swinger accidentally swapped keys with the wrong person at the party.",
            "sent4": "She was a social swinger, effortlessly moving between different groups.",
            "sent5": "The swinger's lifestyle was unconventional but fulfilling for them."
        },
        {
            "definition": "A person who is lively, fashionable, and sociable.",
            "pos": "noun",
            "sent1": "The young woman was known as a real swinger in her social circle.",
            "sent2": "The swinger always knew the latest trends and styles.",
            "sent3": "At the party, the swinger's outfit was the talk of the night.",
            "sent4": "She swung into the room with a burst of energy, a true social butterfly.",
            "sent5": "The swinger's charisma and charm drew people to them effortlessly."
        },
        {
            "definition": "A person who swings a bat, club, or racket in sports.",
            "pos": "noun",
            "sent1": "The baseball player was a powerful swinger, hitting home runs consistently.",
            "sent2": "The golfer was known for being a skilled swinger on the course.",
            "sent3": "The little league team's coach praised the young swinger's technique.",
            "sent4": "The tennis player's opponent was no match for their strong swinger skills.",
            "sent5": "The softball team's captain was the best swinger in the league."
        },
        {
            "definition": "A person who is skilled at swinging on a trapeze or swing.",
            "pos": "noun",
            "sent1": "The circus performer was a fearless swinger on the trapeze.",
            "sent2": "The children were amazed by the skilled swinger's acrobatics.",
            "sent3": "The swinger on the swing set impressed everyone with their flips and twists.",
            "sent4": "The aerialist was a graceful swinger, captivating the audience with each swing.",
            "sent5": "The gymnast was a natural swinger, moving through the air with ease."
        }
    ]
}