{
    "term": "swish",
    "meanings": [
        {
            "definition": "Move with a hissing or rushing sound",
            "pos": "verb",
            "sent1": "The wind made the leaves swish as it blew through the trees.",
            "sent2": "I heard the fabric swish as she walked past me.",
            "sent3": "The cat's tail made a swish sound as it flicked back and forth.",
            "sent4": "The river swished along its course, carrying debris with it.",
            "sent5": "The broom made a swish sound as she swept the floor clean."
        },
        {
            "definition": "A brushing or rustling sound",
            "pos": "noun",
            "sent1": "The swish of the curtains in the breeze was soothing.",
            "sent2": "I could hear the swish of the leaves as the wind picked up.",
            "sent3": "The swish of the paper bag startled the sleeping cat.",
            "sent4": "The swish of the broom against the floor echoed in the empty room.",
            "sent5": "The swish of the waterfall could be heard from afar."
        },
        {
            "definition": "To move with a sweeping motion",
            "pos": "verb",
            "sent1": "She watched the basketball swish through the net after her perfect shot.",
            "sent2": "The dancer's skirt swished gracefully as she twirled on stage.",
            "sent3": "The superhero's cape swished dramatically as he flew through the air.",
            "sent4": "The flag swished proudly in the wind atop the mountain peak.",
            "sent5": "The broom swished back and forth, cleaning the dusty floor."
        },
        {
            "definition": "A stylish or fashionable movement or sound",
            "pos": "noun",
            "sent1": "Her dress made a swish as she walked down the runway.",
            "sent2": "The swish of the model's skirt caught everyone's attention.",
            "sent3": "The swish of the silk scarf added elegance to her outfit.",
            "sent4": "The swish of the leather jacket gave him a cool vibe.",
            "sent5": "The swish of her high heels announced her arrival in the room."
        }
    ]
}