{
    "term": "swooners",
    "meanings": [
        {
            "definition": "A person who faints or is overcome with emotion.",
            "pos": "noun",
            "sent1": "The swooners at the concert were so moved by the music that they fainted.",
            "sent2": "She was known as the swooners' queen because her performances always made people faint with emotion.",
            "sent3": "The swooners in the audience fainted dramatically when the lead singer hit a high note.",
            "sent4": "The movie star was like a magnet for swooners, causing them to faint in adoration wherever he went.",
            "sent5": "The swooners in the crowd were so overwhelmed with emotion that they collapsed in a heap."
        },
        {
            "definition": "A person who is infatuated or enamored with someone.",
            "pos": "noun",
            "sent1": "The teenage swooners giggled and blushed whenever their crush walked by.",
            "sent2": "She had a group of swooners who followed her around, completely infatuated with her.",
            "sent3": "The swooners in the romance novel swooned over the main character's love interest.",
            "sent4": "He was a swooner himself, always infatuated with different celebrities.",
            "sent5": "The swooners in the movie theater sighed dreamily as the romantic scene played out."
        },
        {
            "definition": "A person who causes others to swoon or feel faint.",
            "pos": "noun",
            "sent1": "The handsome actor was a master swooners, making his fans swoon with his charm.",
            "sent2": "She was a natural swooners, effortlessly captivating everyone around her.",
            "sent3": "The swooners in the room couldn't help but feel light-headed in the presence of the charismatic speaker.",
            "sent4": "Her beauty was like a spell, turning her into a swooners who could make anyone feel faint.",
            "sent5": "The swooners in the crowd were under her enchanting influence, feeling faint with admiration."
        }
    ]
}