{
    "term": "sympathomimetics",
    "meanings": [
        {
            "definition": "Drugs that mimic the effects of the sympathetic nervous system.",
            "pos": "noun",
            "sent1": "The doctor prescribed sympathomimetics to help the patient's heart rate.",
            "sent2": "Athletes sometimes use sympathomimetics to enhance their performance.",
            "sent3": "The race car driver joked that he felt like a sympathomimetic engine, revving up for the competition.",
            "sent4": "Her energy was like a dose of sympathomimetics, boosting everyone around her.",
            "sent5": "In the body, sympathomimetics can make you feel like you're ready to take on the world."
        },
        {
            "definition": "Substances that stimulate the sympathetic nervous system.",
            "pos": "noun",
            "sent1": "The herbal tea contained sympathomimetics that helped with relaxation.",
            "sent2": "Doctors sometimes use sympathomimetics to treat low blood pressure.",
            "sent3": "The energetic puppy seemed like a bundle of sympathomimetics, always on the move.",
            "sent4": "His words were like sympathomimetics for motivation, firing up the team.",
            "sent5": "The music had a sympathomimetic effect, making everyone want to dance."
        },
        {
            "definition": "Medications that act like adrenaline in the body.",
            "pos": "noun",
            "sent1": "The nurse administered sympathomimetics to help the patient breathe easier.",
            "sent2": "Some people may experience side effects from sympathomimetics like increased heart rate.",
            "sent3": "The coffee acted as a sympathomimetic, waking up the sleepy student.",
            "sent4": "Her determination was a powerful sympathomimetic force, driving her towards success.",
            "sent5": "The mountain air felt like a natural sympathomimetic, invigorating and refreshing."
        }
    ]
}