{
    "term": "synecdochically",
    "meanings": [
        {
            "definition": "Using a part to represent the whole or vice versa.",
            "pos": "noun",
            "sent1": "In the story, the author used synecdochically to describe the entire ship by mentioning just the sails.",
            "sent2": "The term 'wheels' is often used synecdochically to refer to a car.",
            "sent3": "At the bakery, they ran out of bread, so I asked for more loaves, synecdochically hoping for a fresh batch.",
            "sent4": "Her smile, synecdochically, lit up the entire room with joy.",
            "sent5": "The detective found a single fingerprint synecdochically linking the suspect to the crime scene."
        },
        {
            "definition": "Using a specific term to refer to a general concept.",
            "pos": "adjective",
            "sent1": "The teacher's synecdochically explanation made the complex topic easier to understand.",
            "sent2": "His synecdochically language made it clear that he was referring to the overall situation.",
            "sent3": "The cat's behavior was synecdochically lazy, lounging around all day without a care.",
            "sent4": "The artist's brush strokes were synecdochically bold, capturing the essence of the scene.",
            "sent5": "The politician's speech was synecdochically vague, leaving the audience confused about his plans."
        },
        {
            "definition": "Using a general term to refer to a specific part.",
            "pos": "noun",
            "sent1": "The term 'creature' was synecdochically used to describe the tiny insect.",
            "sent2": "In the story, the word 'beast' was synecdochically referring to the ferocious lion.",
            "sent3": "The chef's menu listed 'dish' synecdochically, making it hard to choose among the many options.",
            "sent4": "The phrase 'the crown' was synecdochically pointing to the king's authority.",
            "sent5": "The label 'the team' was synecdochically applied to the star player, recognizing their individual talent."
        }
    ]
}