{
    "term": "synoicous",
    "meanings": [
        {
            "definition": "Having male and female reproductive organs on the same plant.",
            "pos": "adjective",
            "sent1": "The synoicous plant had both male and female parts growing together.",
            "sent2": "The synoicous flower displayed both male and female reproductive organs.",
            "sent3": "It was quite a sight to see the synoicous plant trying to decide which flower to pollinate first.",
            "sent4": "The synoicous nature of the plant symbolized unity and balance in nature.",
            "sent5": "The synoicous plant was a perfect example of nature's efficiency in reproduction."
        },
        {
            "definition": "Of or relating to a plant with both male and female reproductive structures on the same individual.",
            "pos": "adjective",
            "sent1": "The synoicous tree was admired for its unique reproductive structures.",
            "sent2": "In the garden, the synoicous shrub stood out with its combined reproductive features.",
            "sent3": "The synoicous plant seemed to be quite proud of its ability to self-pollinate.",
            "sent4": "The synoicous characteristics of the plant made it a fascinating subject for botanists.",
            "sent5": "The synoicous plant's ability to reproduce efficiently was truly remarkable."
        },
        {
            "definition": "Characterized by the presence of both male and female reproductive structures on a single plant.",
            "pos": "adjective",
            "sent1": "The synoicous vine was a perfect example of nature's diversity.",
            "sent2": "The synoicous plant was a marvel with its dual reproductive structures.",
            "sent3": "The synoicous plant's ability to reproduce on its own was quite convenient.",
            "sent4": "The synoicous plant's reproductive strategy was a lesson in efficiency.",
            "sent5": "The synoicous plant's reproductive system was a testament to nature's ingenuity."
        }
    ]
}