{
    "term": "systematically",
    "meanings": [
        {
            "definition": "In a methodical or organized manner.",
            "pos": "adverb",
            "sent1": "She cleaned her room systematically, starting from one corner and moving to the next.",
            "sent2": "The librarian shelved the books systematically, arranging them by genre and author.",
            "sent3": "The ants worked systematically to gather food for their colony, each following a specific route.",
            "sent4": "The detective approached the case systematically, analyzing each clue with precision.",
            "sent5": "The factory assembly line moved systematically, with each worker completing their task before passing it on."
        },
        {
            "definition": "According to a system or plan.",
            "pos": "adverb",
            "sent1": "The students were instructed to solve the math problems systematically, following the steps provided.",
            "sent2": "The chef cooked the dish systematically, following the recipe without skipping any ingredients.",
            "sent3": "The robot vacuum cleaner moved systematically around the room, covering every inch of the floor.",
            "sent4": "The project manager organized the tasks systematically, ensuring each step was completed before moving to the next.",
            "sent5": "The musician tuned his guitar systematically, adjusting each string carefully to achieve the perfect sound."
        },
        {
            "definition": "In a consistent or regular way.",
            "pos": "adverb",
            "sent1": "The clock chimed systematically every hour, marking the passage of time.",
            "sent2": "The gardener watered the plants systematically, following a set schedule to ensure they thrived.",
            "sent3": "The waves crashed systematically against the shore, creating a soothing rhythm.",
            "sent4": "The athlete trained systematically, sticking to a strict regimen to improve performance.",
            "sent5": "The writer wrote systematically, setting aside dedicated time each day to work on the novel."
        }
    ]
}