{
    "term": "tab",
    "meanings": [
        {
            "definition": "A small flap or strip of material attached to something for holding, manipulation, or identification.",
            "pos": "noun",
            "sent1": "She pulled the tab on the zipper to close her jacket.",
            "sent2": "The tab on the file folder made it easy to organize papers.",
            "sent3": "The tab on the tea bag looked like a tiny flag waving in the cup.",
            "sent4": "His curiosity was like a tab that kept pulling him towards the mysterious box.",
            "sent5": "The tab on the soda can popped open with a satisfying click."
        },
        {
            "definition": "A key on a keyboard that moves the cursor a predetermined number of spaces.",
            "pos": "noun",
            "sent1": "Press the tab key to jump to the next field in the form.",
            "sent2": "She used the tab to indent the paragraph in her document.",
            "sent3": "The tab key felt like a secret button that transported her text to a new line.",
            "sent4": "His ideas flowed like a river, each tab key press moving him forward.",
            "sent5": "The tab key was like a magic wand, guiding the cursor effortlessly across the screen."
        },
        {
            "definition": "A bill or check, especially in a bar or restaurant.",
            "pos": "noun",
            "sent1": "He asked for the tab after finishing his meal at the diner.",
            "sent2": "She split the tab with her friends after a fun night out.",
            "sent3": "The tab for the drinks seemed to have a mind of its own, growing larger with each round.",
            "sent4": "The tab lay on the table like a silent reminder of the evening's festivities.",
            "sent5": "The tab was a snapshot of their laughter and shared moments."
        },
        {
            "definition": "A small section of a webpage that allows for easy navigation between different sections.",
            "pos": "noun",
            "sent1": "Click on the tab labeled 'Home' to return to the main page.",
            "sent2": "She opened multiple tabs in her browser to keep track of different articles.",
            "sent3": "The tab for 'Contact Us' was like a friendly guide waiting to be clicked.",
            "sent4": "Her browser was a garden of tabs, each leading to a different adventure.",
            "sent5": "The tab bar at the top of the screen was a gateway to a world of information."
        }
    ]
}