{
    "term": "tabernacle",
    "meanings": [
        {
            "definition": "A place of worship",
            "pos": "noun",
            "sent1": "The small community gathered at the tabernacle for their Sunday service.",
            "sent2": "The tabernacle was filled with hymns and prayers on the holy day.",
            "sent3": "The tabernacle was so peaceful that even the birds seemed to join in the singing.",
            "sent4": "In the heart of the forest, the tabernacle stood tall like a beacon of faith.",
            "sent5": "The tabernacle's doors opened to welcome all who sought solace within its walls."
        },
        {
            "definition": "A portable sanctuary used by the Israelites during the Exodus",
            "pos": "noun",
            "sent1": "The Israelites carried the tabernacle with them on their journey through the desert.",
            "sent2": "Moses instructed the people to assemble the tabernacle according to God's design.",
            "sent3": "As they traveled, the tabernacle became a symbol of hope amidst the harsh conditions.",
            "sent4": "The tabernacle's presence among the people was a reminder of their divine protection.",
            "sent5": "The tabernacle's fabric fluttered in the wind, a sign of God's guiding hand."
        },
        {
            "definition": "A small ornamented cupboard or box used for storing the Eucharist in some Christian churches",
            "pos": "noun",
            "sent1": "The priest carefully placed the Eucharist in the golden tabernacle after the service.",
            "sent2": "The tabernacle in the church was adorned with intricate carvings and precious stones.",
            "sent3": "The curious child peeked inside the tabernacle, wondering what treasures it held.",
            "sent4": "The tabernacle gleamed in the candlelight, a beacon of reverence in the dim church.",
            "sent5": "The faithful knelt before the tabernacle, offering their prayers in quiet devotion."
        }
    ]
}