{
    "term": "taboo",
    "meanings": [
        {
            "definition": "A social or religious custom prohibiting or restricting a particular practice or forbidding association with a particular person, place, or thing.",
            "pos": "noun",
            "sent1": "In some cultures, it is a taboo to eat certain foods on specific days.",
            "sent2": "Breaking a taboo can lead to serious consequences in certain societies.",
            "sent3": "It's like a secret rule that everyone follows - a taboo!",
            "sent4": "The taboo against speaking out of turn was as strong as a fortress.",
            "sent5": "The taboo on wearing shoes indoors was ingrained in their culture."
        },
        {
            "definition": "A prohibition or ban that results from social custom or emotional aversion.",
            "pos": "noun",
            "sent1": "The taboo on discussing politics at the dinner table made for peaceful meals.",
            "sent2": "She felt the weight of the taboo against mentioning her ex-boyfriend.",
            "sent3": "It's like an invisible 'do not enter' sign - a taboo!",
            "sent4": "The taboo on using smartphones during meetings was a silent agreement among colleagues.",
            "sent5": "The taboo on borrowing books without permission was strictly enforced in the library."
        },
        {
            "definition": "Something that is considered unacceptable or off-limits.",
            "pos": "noun",
            "sent1": "For him, wearing mismatched socks was a taboo he couldn't break.",
            "sent2": "The taboo on wearing white after Labor Day was followed by many fashion enthusiasts.",
            "sent3": "It's like a red flag signaling 'stop' - a taboo!",
            "sent4": "The taboo on discussing personal finances was like a locked door in their family.",
            "sent5": "The taboo on interrupting others during conversations was a sign of respect in their community."
        }
    ]
}