{
    "term": "tabulis",
    "meanings": [
        {
            "definition": "A flat slab or plaque suitable for or bearing an inscription.",
            "pos": "noun",
            "sent1": "The museum displayed ancient tabulis with writings from long ago.",
            "sent2": "She received a beautiful tabulis as a gift, engraved with her name.",
            "sent3": "The mischievous cat knocked over the tabulis, causing a domino effect of falling objects.",
            "sent4": "His mind was like a blank tabulis, waiting to be filled with new knowledge.",
            "sent5": "The tabulis in the park commemorated the fallen soldiers, their names forever etched in stone."
        },
        {
            "definition": "A small flap or strip of material attached to or projecting from something, used to hold or manipulate it.",
            "pos": "noun",
            "sent1": "She carefully lifted the tabulis of the envelope to reveal the surprise inside.",
            "sent2": "The tabulis on the curtain allowed her to adjust the amount of sunlight entering the room.",
            "sent3": "The magician pulled a tabulis from his sleeve, much to the audience's amazement.",
            "sent4": "Her words were like a tabulis, guiding him through the complex instructions.",
            "sent5": "The tabulis on the backpack made it easy to attach extra gear for the hike."
        },
        {
            "definition": "A small, usually decorative flap or piece fastened to a garment or other object by a button or similar means.",
            "pos": "noun",
            "sent1": "The dress had a delicate tabulis on the collar, adding a touch of elegance.",
            "sent2": "He admired the intricate tabulis on the antique chest, marveling at the craftsmanship.",
            "sent3": "The tabulis on the hat fluttered in the wind, giving it a whimsical charm.",
            "sent4": "Her laughter was like music, the tabulis of joy weaving through the air.",
            "sent5": "The tabulis on the pillowcase matched the curtains, creating a cohesive look in the room."
        }
    ]
}