{
    "term": "tacamahacs",
    "meanings": [
        {
            "definition": "a type of resinous substance obtained from a tropical American tree.",
            "pos": "noun",
            "sent1": "The tacamahacs was used to make a sticky glue for the project.",
            "sent2": "The tacamahacs exuded a strong, pleasant scent in the forest.",
            "sent3": "The mischievous squirrel got stuck in the tacamahacs while trying to steal nuts.",
            "sent4": "The tacamahacs oozed like golden honey from the tree's wounds.",
            "sent5": "The tacamahacs glistened in the sunlight, attracting curious insects."
        },
        {
            "definition": "a tree that produces the resinous substance tacamahac.",
            "pos": "noun",
            "sent1": "The tacamahacs towered over the forest canopy, its branches reaching high.",
            "sent2": "The villagers gathered around the ancient tacamahacs to collect its valuable resin.",
            "sent3": "The mischievous children played hide-and-seek around the tacamahacs, using its trunk as a base.",
            "sent4": "The tacamahacs stood like a guardian, protecting the smaller plants beneath its shade.",
            "sent5": "The tacamahacs whispered secrets to the wind, its leaves rustling softly."
        },
        {
            "definition": "relating to or characteristic of the tacamahac tree or its resin.",
            "pos": "adjective",
            "sent1": "The artisan crafted a beautiful necklace using tacamahacs beads.",
            "sent2": "The sweet fragrance of the tacamahacs resin filled the air with warmth.",
            "sent3": "The playful puppy rolled around in the tacamahacs resin, leaving sticky paw prints everywhere.",
            "sent4": "Her laughter echoed through the tacamahacs forest, a place of peace and tranquility.",
            "sent5": "The tacamahacs essence infused the room with a calming, earthy scent."
        }
    ]
}