{
    "term": "taekwondo",
    "meanings": [
        {
            "definition": "A Korean martial art characterized by its emphasis on kicking techniques.",
            "pos": "noun",
            "sent1": "In taekwondo, students learn how to perform powerful kicks.",
            "sent2": "She has been practicing taekwondo for years and has mastered various kicking techniques.",
            "sent3": "Why did the kangaroo want to learn taekwondo? To improve its already impressive kicking skills!",
            "sent4": "Her determination in taekwondo was like a fierce kick that knocked down all obstacles in her path.",
            "sent5": "The sound of a taekwondo kick echoed through the dojo, leaving everyone in awe of its strength."
        },
        {
            "definition": "The sport of practicing and competing in taekwondo.",
            "pos": "noun",
            "sent1": "Taekwondo tournaments attract athletes from all over the world.",
            "sent2": "He won a gold medal in the national taekwondo competition.",
            "sent3": "The family picnic turned into a taekwondo match, with everyone trying to outkick each other!",
            "sent4": "Her dedication to taekwondo was like training for a never-ending championship.",
            "sent5": "The arena buzzed with excitement as the taekwondo competitors prepared for their matches."
        },
        {
            "definition": "A person who practices taekwondo.",
            "pos": "noun",
            "sent1": "The taekwondo instructor guided the students through their training.",
            "sent2": "She is a skilled taekwondo practitioner with years of experience.",
            "sent3": "The taekwondo enthusiast never missed a chance to show off their latest kick.",
            "sent4": "His dedication to taekwondo made him a respected member of the martial arts community.",
            "sent5": "The taekwondo student's passion for the art was evident in every move they made."
        }
    ]
}