{
    "term": "tag",
    "meanings": [
        {
            "definition": "A small piece or strip of paper, plastic, or similar material attached to an object to identify it or give instructions.",
            "pos": "noun",
            "sent1": "I put a tag on my suitcase to find it easily at the airport.",
            "sent2": "The price tag on the shirt showed it was on sale.",
            "sent3": "The tag on the present said, 'Open me first!'",
            "sent4": "Her name tag at work made it easy for customers to know who she was.",
            "sent5": "The tag on the keychain had a cute little cat design."
        },
        {
            "definition": "A game in which one player chases the others and tries to touch one of them, who then becomes the chaser.",
            "pos": "noun",
            "sent1": "Let's play tag during recess today!",
            "sent2": "In tag, you have to run fast to avoid getting caught.",
            "sent3": "During the tag game, Sarah tripped and fell, making everyone laugh.",
            "sent4": "Playing tag felt like a race against the wind.",
            "sent5": "The children's laughter filled the playground as they played tag."
        },
        {
            "definition": "To attach a tag or label to something.",
            "pos": "verb",
            "sent1": "I need to tag these boxes before they are shipped.",
            "sent2": "She likes to tag her plants with their names.",
            "sent3": "He decided to tag his belongings to keep them organized.",
            "sent4": "The artist would tag each painting with a unique symbol.",
            "sent5": "Remember to tag your luggage with your contact information."
        },
        {
            "definition": "To touch someone in a game of tag.",
            "pos": "verb",
            "sent1": "I will try to tag you before you reach the safe zone.",
            "sent2": "She tagged him on the shoulder and ran away.",
            "sent3": "He sneezed right when she was about to tag him, causing a funny moment.",
            "sent4": "Tagging her opponent in the game felt like a victory.",
            "sent5": "The excitement of tagging someone in tag made her heart race."
        }
    ]
}