{
    "term": "tagged",
    "meanings": [
        {
            "definition": "Attach a label to",
            "pos": "verb",
            "sent1": "I tagged my backpack with my name.",
            "sent2": "She tagged the boxes with different colors.",
            "sent3": "The mischievous squirrel tagged the tree with acorns.",
            "sent4": "Memories are tagged with emotions that last a lifetime.",
            "sent5": "The artist tagged each painting with a unique signature."
        },
        {
            "definition": "Mark with a tag",
            "pos": "verb",
            "sent1": "He tagged the map with important locations.",
            "sent2": "The zookeeper tagged the animals for identification.",
            "sent3": "The prankster tagged his friend's backpack with a funny sticker.",
            "sent4": "The sunset tagged the sky with vibrant colors.",
            "sent5": "The detective tagged the evidence for further analysis."
        },
        {
            "definition": "Identify or label someone or something",
            "pos": "verb",
            "sent1": "She tagged each plant in the garden with its name.",
            "sent2": "The librarian tagged the books with genre labels.",
            "sent3": "The kids tagged their classmates with funny nicknames.",
            "sent4": "His unique style tagged him as a trendsetter.",
            "sent5": "The scientist tagged the specimen for research purposes."
        },
        {
            "definition": "Follow closely or keep track of someone or something",
            "pos": "verb",
            "sent1": "The detective tagged the suspect without being noticed.",
            "sent2": "The dog tagged along on the hiking trip.",
            "sent3": "The curious cat tagged behind its owner everywhere.",
            "sent4": "The shadow tagged along, mimicking every move.",
            "sent5": "The memories of childhood always tagged along with him."
        }
    ]
}