{
    "term": "taille",
    "meanings": [
        {
            "definition": "The French word for 'cut' or 'carve'.",
            "pos": "noun",
            "sent1": "In French class, we learned that 'taille' means 'cut' or 'carve'.",
            "sent2": "She used a sharp knife to 'taille' the wood into a beautiful sculpture.",
            "sent3": "The chef's 'taille' of the vegetables was so precise that they looked like pieces of art.",
            "sent4": "His 'taille' of the cake was so neat, it looked like a professional bakery creation.",
            "sent5": "The artist's 'taille' of the stone revealed a stunning statue within."
        },
        {
            "definition": "A type of tax in medieval France.",
            "pos": "noun",
            "sent1": "During medieval times, the 'taille' was a tax that peasants had to pay.",
            "sent2": "The 'taille' was a burden on the villagers, taking away a portion of their harvest.",
            "sent3": "The king's decision to increase the 'taille' caused uproar among the common people.",
            "sent4": "The 'taille' was seen as a necessary evil to fund the kingdom's activities.",
            "sent5": "The collection of the 'taille' was a dreaded event for the farmers every year."
        },
        {
            "definition": "The waist or narrowest part of the body.",
            "pos": "noun",
            "sent1": "She wore a belt to accentuate her 'taille' and create an hourglass figure.",
            "sent2": "The dress was cinched at the 'taille' to highlight her slim waist.",
            "sent3": "His 'taille' was so tiny that he could fit into children's clothing.",
            "sent4": "The fashion model's 'taille' was the envy of everyone on the runway.",
            "sent5": "The corset was designed to reduce the 'taille' and create a more defined silhouette."
        },
        {
            "definition": "To shape or form by cutting or carving.",
            "pos": "verb",
            "sent1": "He carefully 'tailled' the clay to create a detailed sculpture.",
            "sent2": "The artist 'tailles' the wood with precision to bring his vision to life.",
            "sent3": "She decided to 'taille' the bush into the shape of a heart for Valentine's Day.",
            "sent4": "The sculptor's hands expertly 'tailled' the marble into a masterpiece.",
            "sent5": "The chef skillfully 'tailles' the vegetables into intricate designs for garnish."
        }
    ]
}