{
    "term": "taken",
    "meanings": [
        {
            "definition": "Past participle of take.",
            "pos": "adjective",
            "sent1": "The picture was taken yesterday.",
            "sent2": "The gift was already taken by the time I arrived.",
            "sent3": "The last piece of cake was taken by a sneaky squirrel.",
            "sent4": "Her heart was taken by the charming stranger at the party.",
            "sent5": "The opportunity was taken away as quickly as it came."
        },
        {
            "definition": "Understood or interpreted in a specified way.",
            "pos": "adjective",
            "sent1": "His words were taken as a sign of friendship.",
            "sent2": "The message can be taken in different ways.",
            "sent3": "The joke was taken seriously by everyone in the room.",
            "sent4": "Her silence was taken as a sign of agreement.",
            "sent5": "The painting was taken to represent freedom and hope."
        },
        {
            "definition": "Captured or seized.",
            "pos": "verb",
            "sent1": "The thief was taken by the police after the robbery.",
            "sent2": "The wild animal was taken to the zoo for safety.",
            "sent3": "The treasure was taken by pirates in a daring raid.",
            "sent4": "His attention was taken by the shiny object on the ground.",
            "sent5": "The enemy stronghold was taken by surprise in the night."
        },
        {
            "definition": "Carried or transported.",
            "pos": "verb",
            "sent1": "The heavy boxes were taken upstairs by the movers.",
            "sent2": "The groceries were taken home in reusable bags.",
            "sent3": "The injured hiker was taken down the mountain on a stretcher.",
            "sent4": "The message was taken across the ocean by carrier pigeons.",
            "sent5": "The goods were taken by train to the distant city."
        }
    ]
}