{
    "term": "tally",
    "meanings": [
        {
            "definition": "A record of a score or amount",
            "pos": "noun",
            "sent1": "The teacher kept a tally of the students' correct answers.",
            "sent2": "I made a tally of the number of books in the library.",
            "sent3": "The tally of candies in the jar seemed to magically increase.",
            "sent4": "Her tally of victories in the game was unmatched.",
            "sent5": "The tally on the scoreboard showed our team was winning."
        },
        {
            "definition": "To count or record",
            "pos": "verb",
            "sent1": "Please tally the number of apples in the basket.",
            "sent2": "I need to tally the expenses for this month.",
            "sent3": "He tried to tally the number of birds flying overhead.",
            "sent4": "She could tally the steps to the top of the hill in her sleep.",
            "sent5": "Tally carefully to avoid mistakes in your calculations."
        },
        {
            "definition": "A mark or notch used for counting",
            "pos": "noun",
            "sent1": "The old tree had a tally of the passing years carved into its trunk.",
            "sent2": "The tally on the stick showed how many sheep were in the pen.",
            "sent3": "The mischievous squirrel added a tally to the fence post.",
            "sent4": "Each tally on the wall represented a day spent in captivity.",
            "sent5": "The tally scratched into the stone kept track of the days at sea."
        },
        {
            "definition": "To add up or calculate",
            "pos": "verb",
            "sent1": "Let's tally the total cost of the items in the shopping cart.",
            "sent2": "She needed to tally the numbers before presenting the report.",
            "sent3": "He tried to tally the amount of time spent on each task.",
            "sent4": "The accountant would tally the profits at the end of the year.",
            "sent5": "Tally the numbers accurately to avoid errors in the final result."
        },
        {
            "definition": "A total or sum",
            "pos": "noun",
            "sent1": "The final tally of votes determined the winner.",
            "sent2": "The tally of expenses for the month was higher than expected.",
            "sent3": "The tally of goals scored by the team was impressive.",
            "sent4": "The tally of points on the scoreboard showed a tie.",
            "sent5": "The tally of ingredients in the recipe seemed perfect for a delicious meal."
        }
    ]
}