{
    "term": "tallies",
    "meanings": [
        {
            "definition": "A record of a score or amount",
            "pos": "noun",
            "sent1": "The teacher kept tallies of the students' correct answers.",
            "sent2": "The team captain made tallies of the goals scored in the game.",
            "sent3": "The squirrel made tallies of the acorns buried in the garden.",
            "sent4": "Her smile was like a tally, keeping track of all the joy in the room.",
            "sent5": "The old man's wrinkled face was a tally of all the years he had lived."
        },
        {
            "definition": "To correspond or agree",
            "pos": "verb",
            "sent1": "His story tallies with what the witness said.",
            "sent2": "The evidence tallies perfectly with the suspect's alibi.",
            "sent3": "The colors of the painting tallies with the room's decor.",
            "sent4": "Her laughter tallies with the joy in her heart.",
            "sent5": "The melody tallies with the rhythm of the drums."
        },
        {
            "definition": "To count or calculate",
            "pos": "verb",
            "sent1": "She tallies the number of books on the shelf.",
            "sent2": "The cashier tallies the total amount of the groceries.",
            "sent3": "The child tallies the number of birds in the sky.",
            "sent4": "His speed tallies with the distance covered in the race.",
            "sent5": "The scientist tallies the data to draw conclusions."
        },
        {
            "definition": "A mark or notch used for keeping score",
            "pos": "noun",
            "sent1": "The ancient game board had tallies carved into it.",
            "sent2": "The wooden stick had tallies to track the days spent in the forest.",
            "sent3": "The cat's scratching post had tallies from its playful attacks.",
            "sent4": "The old tree trunk bore tallies of the passing seasons.",
            "sent5": "The stone wall had tallies etched by generations of climbers."
        }
    ]
}