{
    "term": "tamanu",
    "meanings": [
        {
            "definition": "A tree native to Southeast Asia and the Pacific Islands, known for its medicinal properties.",
            "pos": "noun",
            "sent1": "The tamanu stood tall in the forest, providing shade and healing.",
            "sent2": "People in the village gathered tamanu leaves to make traditional remedies.",
            "sent3": "The monkeys in the jungle loved to swing from the tamanu branches, pretending to be doctors.",
            "sent4": "Her kindness was like the tamanu tree, offering comfort and relief to all around her.",
            "sent5": "The ancient legend spoke of a magical tamanu tree that could cure any illness."
        },
        {
            "definition": "The oil extracted from the seeds of the tamanu tree, used in skincare products.",
            "pos": "noun",
            "sent1": "She applied tamanu oil to her skin, hoping for a natural glow.",
            "sent2": "The spa offered luxurious facials using tamanu oil as a key ingredient.",
            "sent3": "The mischievous cat knocked over the bottle of tamanu oil, creating a slippery mess.",
            "sent4": "The tamanu oil was a secret weapon in her beauty routine, keeping her skin radiant.",
            "sent5": "The scent of tamanu oil filled the room, calming everyone with its earthy aroma."
        },
        {
            "definition": "A dark green color resembling the leaves of the tamanu tree.",
            "pos": "noun",
            "sent1": "The artist mixed blue and yellow paint to create a beautiful tamanu shade.",
            "sent2": "The walls of the room were painted in a soothing tamanu color.",
            "sent3": "The jealous parrot tried to imitate the tamanu hue but ended up with a strange green.",
            "sent4": "Her eyes sparkled with a tamanu green intensity, capturing everyone's attention.",
            "sent5": "The lush tamanu color of the forest leaves painted a serene picture of nature."
        }
    ]
}