{
    "term": "tan",
    "meanings": [
        {
            "definition": "A yellowish-brown color.",
            "pos": "noun",
            "sent1": "She painted her room in a lovely tan color.",
            "sent2": "The sand on the beach had a warm tan hue.",
            "sent3": "The tan sweater matched her eyes perfectly.",
            "sent4": "The old book had pages the color of tan parchment.",
            "sent5": "The tan of the autumn leaves was breathtaking."
        },
        {
            "definition": "To become brown from exposure to the sun.",
            "pos": "verb",
            "sent1": "After spending hours at the beach, her skin began to tan.",
            "sent2": "He forgot to apply sunscreen and started to tan quickly.",
            "sent3": "She joked that she would tan like a piece of leather if she stayed out any longer.",
            "sent4": "The wooden deck tanned under the scorching sun.",
            "sent5": "The bread will tan in the oven for about 20 minutes."
        },
        {
            "definition": "A brown color obtained by exposure to the sun.",
            "pos": "noun",
            "sent1": "Her tan was a result of spending the entire summer outdoors.",
            "sent2": "The tan on his face showed he had been working outside.",
            "sent3": "The tan on the leather jacket gave it a rugged look.",
            "sent4": "The tan of the wood on the porch was deep and rich.",
            "sent5": "The tan of the landscape changed as the sun set."
        },
        {
            "definition": "A solution used for tanning animal hides.",
            "pos": "noun",
            "sent1": "The tanner used a special tan to treat the hides.",
            "sent2": "The smell of the tan in the workshop was strong.",
            "sent3": "She accidentally spilled the tan on her shoes, staining them.",
            "sent4": "The tan transformed the raw hides into soft leather.",
            "sent5": "The tan was carefully applied to ensure even coverage."
        }
    ]
}