{
    "term": "tana",
    "meanings": [
        {
            "definition": "A long, loose robe worn by Japanese monks.",
            "pos": "noun",
            "sent1": "The monk wore a comfortable tana during meditation.",
            "sent2": "She bought a new tana for the traditional ceremony.",
            "sent3": "The tana looked like a cozy blanket on the monk.",
            "sent4": "The tana wrapped around him like a gentle hug.",
            "sent5": "The soft fabric of the tana flowed gracefully as he walked."
        },
        {
            "definition": "A unit of length equal to 100 cubits.",
            "pos": "noun",
            "sent1": "The ancient measurement was based on the tana.",
            "sent2": "The field was measured using the tana as a reference.",
            "sent3": "The tana seemed longer than expected when measuring the land.",
            "sent4": "The tana stretched out like a never-ending ribbon.",
            "sent5": "The tana's length was perfect for the task at hand."
        },
        {
            "definition": "A dark brown or black soil in New Zealand.",
            "pos": "noun",
            "sent1": "The farmers planted crops in the rich tana soil.",
            "sent2": "The tana earth provided nutrients for the plants to grow.",
            "sent3": "The tana dirt stuck to their boots as they worked.",
            "sent4": "The tana ground seemed to swallow the seeds whole.",
            "sent5": "The aroma of the tana soil filled the air after the rain."
        },
        {
            "definition": "A genus of moths.",
            "pos": "noun",
            "sent1": "The tana moths fluttered around the garden at night.",
            "sent2": "The beautiful tana moth rested on the flower petals.",
            "sent3": "The tana insects danced in the moonlight, creating a magical sight.",
            "sent4": "The tana moths' wings shimmered like delicate silk.",
            "sent5": "The tana moth caterpillars slowly transformed into graceful flyers."
        }
    ]
}