{
    "term": "tang",
    "meanings": [
        {
            "definition": "A strong taste or flavor",
            "pos": "noun",
            "sent1": "The soup had a tang of spices that made it delicious.",
            "sent2": "The orange juice had a refreshing tang to it.",
            "sent3": "The tang of the cheese was so strong, it made my eyes water.",
            "sent4": "The tang of victory was sweet as they celebrated their win.",
            "sent5": "The tang of the lemon was so intense, it lingered on my taste buds."
        },
        {
            "definition": "A sharp point or prong on a knife or tool",
            "pos": "noun",
            "sent1": "Be careful with the knife's tang when cutting vegetables.",
            "sent2": "The tang of the fork helped in picking up the pieces of fruit.",
            "sent3": "He accidentally pricked his finger on the tang of the scissors.",
            "sent4": "The tang of the blade gleamed in the sunlight.",
            "sent5": "The tang of the arrowhead was sharp and precise."
        },
        {
            "definition": "A strong odor or smell",
            "pos": "noun",
            "sent1": "The tang of the flowers filled the room with a pleasant scent.",
            "sent2": "The tang of the perfume lingered in the air long after she left.",
            "sent3": "The tang of the garbage was overwhelming in the summer heat.",
            "sent4": "The tang of the bakery drew customers in from the street.",
            "sent5": "The tang of the sea air invigorated her senses."
        },
        {
            "definition": "A sharp ringing sound",
            "pos": "noun",
            "sent1": "The tang of the bell echoed through the quiet village.",
            "sent2": "The tang of the wind chimes soothed her as she sat on the porch.",
            "sent3": "The tang of the alarm clock woke him up abruptly.",
            "sent4": "The tang of the church bells signaled the start of the ceremony.",
            "sent5": "The tang of the phone ringing broke the silence of the room."
        },
        {
            "definition": "A strong aftertaste",
            "pos": "noun",
            "sent1": "The tang of the garlic left a lasting aftertaste in her mouth.",
            "sent2": "The tang of the coffee had a bitter aftertaste.",
            "sent3": "The tang of the medicine had a strong aftertaste that lingered.",
            "sent4": "The tang of the wine had a fruity aftertaste that was delightful.",
            "sent5": "The tang of the mint gum left a refreshing aftertaste."
        }
    ]
}