{
    "term": "tangi",
    "meanings": [
        {
            "definition": "A traditional Maori funeral ceremony involving chanting and weeping.",
            "pos": "noun",
            "sent1": "During the tangi, the community gathered to mourn the loss of their loved one.",
            "sent2": "The tangi lasted for several days as family and friends paid their respects.",
            "sent3": "At the tangi, the sound of chanting filled the air, honoring the departed.",
            "sent4": "The tangi was a somber event, with tears flowing freely among the attendees.",
            "sent5": "The haunting melodies of the tangi echoed through the village, expressing grief and remembrance."
        },
        {
            "definition": "A sharp, pungent taste or smell.",
            "pos": "noun",
            "sent1": "The tangi of the spicy curry made my eyes water.",
            "sent2": "The tangi of the ripe cheese was too strong for some to handle.",
            "sent3": "The tangi of the onions in the kitchen made everyone sneeze.",
            "sent4": "The tangi of the vinegar in the salad dressing was overpowering.",
            "sent5": "The tangi of the garlic filled the room, leaving a lasting impression on our senses."
        },
        {
            "definition": "To emit a sharp, pungent smell.",
            "pos": "verb",
            "sent1": "The flowers tangi in the warm summer breeze.",
            "sent2": "The kitchen tangi with the aroma of freshly baked bread.",
            "sent3": "As the skunk crossed the road, it began to tangi unpleasantly.",
            "sent4": "The garbage tangi in the hot sun, attracting flies from afar.",
            "sent5": "The campfire tangi with the scent of burning wood, creating a cozy atmosphere."
        },
        {
            "definition": "A type of New Zealand tree with small, white flowers.",
            "pos": "noun",
            "sent1": "The tangi tree in the garden bloomed beautifully in spring.",
            "sent2": "The delicate fragrance of the tangi flowers filled the air.",
            "sent3": "The tangi tree provided a lovely backdrop for the picnic.",
            "sent4": "Under the shade of the tangi tree, the children played happily.",
            "sent5": "The tangi tree's blossoms attracted bees, buzzing around in search of nectar."
        }
    ]
}