{
    "term": "tanist",
    "meanings": [
        {
            "definition": "An heir apparent in Celtic tradition.",
            "pos": "noun",
            "sent1": "In Celtic stories, the tanist was always ready to take over as the next leader.",
            "sent2": "The tanist was next in line to inherit the throne according to the ancient Celtic customs.",
            "sent3": "The tanist couldn't help but feel a mix of excitement and nervousness about becoming the new leader.",
            "sent4": "Being the tanist was like holding a key to a door that would only open when the time was right.",
            "sent5": "The tanist's role was crucial, like a puzzle piece that completed the royal lineage."
        },
        {
            "definition": "A person designated to succeed or inherit a position or title.",
            "pos": "noun",
            "sent1": "The company's tanist was being prepared to take on the responsibilities of the CEO.",
            "sent2": "As the tanist, he knew he had big shoes to fill when the time came for him to step up.",
            "sent3": "It was a great honor for him to be chosen as the tanist, even though it came with great expectations.",
            "sent4": "Becoming the tanist felt like being handed a golden ticket to a future full of possibilities.",
            "sent5": "The tanist's role was like being the understudy in a play, always ready to take the lead role."
        },
        {
            "definition": "The act of designating a successor.",
            "pos": "noun",
            "sent1": "The tanist ceremony was a solemn event where the next leader was officially named.",
            "sent2": "The tanist process involved careful consideration to ensure the right person was chosen.",
            "sent3": "During the tanist ritual, everyone held their breath in anticipation of the successor's name.",
            "sent4": "The tanist tradition symbolized the continuity of leadership within the community.",
            "sent5": "The tanist ritual was like passing a torch of responsibility from one generation to the next."
        }
    ]
}