{
    "term": "tanner",
    "meanings": [
        {
            "definition": "A person whose occupation is tanning hides or skins.",
            "pos": "noun",
            "sent1": "The skilled tanner worked with animal hides every day.",
            "sent2": "The tanner used special tools to tan the leather.",
            "sent3": "The tanner joked that they were the 'hide and seek' champion.",
            "sent4": "Her hands were as soft as a tanner's after a long day's work.",
            "sent5": "The smell in the tanner's workshop was strong but familiar."
        },
        {
            "definition": "A unit of currency in Britain worth sixpence.",
            "pos": "noun",
            "sent1": "He paid a tanner for the newspaper at the corner store.",
            "sent2": "Back in the day, a tanner could buy you a nice meal.",
            "sent3": "The tanner coin was shiny and easy to spot in his pocket.",
            "sent4": "She found a tanner in the old jar of coins her grandmother gave her.",
            "sent5": "The tanner was a small but valuable piece of history."
        },
        {
            "definition": "A machine or device used for tanning leather.",
            "pos": "noun",
            "sent1": "The tanner hummed as he operated the leather tanning machine.",
            "sent2": "The new tanner made the tanning process much faster.",
            "sent3": "The tanner machine looked like a giant puzzle to the workers.",
            "sent4": "The tanner whirred to life, ready to work on the leather.",
            "sent5": "The tanner's gears turned smoothly, creating perfectly tanned leather."
        },
        {
            "definition": "A person who tans their skin by exposure to the sun.",
            "pos": "noun",
            "sent1": "The beach tanner always had a golden glow.",
            "sent2": "She was a dedicated tanner, spending hours in the sun.",
            "sent3": "The tanner at the pool joked about being a 'sunbathing expert'.",
            "sent4": "His skin turned into a tanner shade after a day at the beach.",
            "sent5": "The tanner's skin was like a canvas painted by the sun."
        }
    ]
}