{
    "term": "tanto",
    "meanings": [
        {
            "definition": "To such a degree",
            "pos": "verb",
            "sent1": "She loves ice cream tanto that she eats it every day.",
            "sent2": "He studies tanto for his exams to get good grades.",
            "sent3": "The puppy wagged its tail tanto when it saw its favorite toy.",
            "sent4": "The flowers bloomed tanto after the rain stopped.",
            "sent5": "The children laughed tanto at the clown's funny tricks."
        },
        {
            "definition": "A large knife or sword of Japanese origin",
            "pos": "noun",
            "sent1": "The samurai carried a tanto for protection.",
            "sent2": "The tanto's blade was sharp and well-crafted.",
            "sent3": "In the movie, the hero wielded a tanto to defeat the villain.",
            "sent4": "The tanto gleamed in the sunlight, showcasing its beauty.",
            "sent5": "The tanto was displayed in the museum as a symbol of history."
        },
        {
            "definition": "A certain amount or quantity",
            "pos": "noun",
            "sent1": "She needed tanto sugar to bake the cake.",
            "sent2": "He bought tanto apples from the market.",
            "sent3": "The recipe called for tanto flour to make the bread.",
            "sent4": "The farmer harvested tanto corn from his fields.",
            "sent5": "The store stocked tanto milk for the customers."
        },
        {
            "definition": "Equally",
            "pos": "adverb",
            "sent1": "The twins shared their toys tanto.",
            "sent2": "The team divided the tasks tanto among its members.",
            "sent3": "The friends split the pizza tanto to enjoy it together.",
            "sent4": "The siblings inherited the property tanto from their parents.",
            "sent5": "The students were graded tanto based on their performance."
        },
        {
            "definition": "In the same way",
            "pos": "adverb",
            "sent1": "She danced tanto as her sister, mirroring her moves.",
            "sent2": "The birds chirped tanto every morning, creating a peaceful melody.",
            "sent3": "The cars moved tanto along the highway, following the speed limit.",
            "sent4": "The waves crashed tanto against the shore, creating a rhythmic sound.",
            "sent5": "The leaves rustled tanto in the wind, creating a soothing sound."
        }
    ]
}