{
    "term": "tantras",
    "meanings": [
        {
            "definition": "A Hindu or Buddhist scripture or ritual text.",
            "pos": "noun",
            "sent1": "The monk studied ancient tantras to learn about spiritual teachings.",
            "sent2": "In the temple, the priest chanted from the sacred tantras during the ceremony.",
            "sent3": "The tantras whispered secrets to those who sought wisdom in their pages.",
            "sent4": "Her mind was a library of tantras, each one holding a key to enlightenment.",
            "sent5": "The tantras glowed with ancient knowledge, illuminating the path to inner peace."
        },
        {
            "definition": "A system of beliefs and practices that combine elements of Hinduism and Buddhism.",
            "pos": "noun",
            "sent1": "The community followed the tantras of their ancestors, blending traditions seamlessly.",
            "sent2": "His teachings were a mix of Hinduism and Buddhism, embodying the essence of tantras.",
            "sent3": "The tantras brought together the best of both worlds, creating a harmonious spiritual practice.",
            "sent4": "Her heart beat to the rhythm of the tantras, a melody of unity and peace.",
            "sent5": "In the garden of beliefs, the tantras bloomed as a beautiful fusion of faiths."
        },
        {
            "definition": "A type of yoga that focuses on the control of energy within the body.",
            "pos": "noun",
            "sent1": "Through the practice of tantras, she harnessed the power of her inner strength.",
            "sent2": "The class practiced tantras to balance their energy and find inner peace.",
            "sent3": "His attempt at yoga turned into a hilarious dance of awkward tantras.",
            "sent4": "The tantras flowed through her like a river, guiding her movements with grace.",
            "sent5": "In the quiet room, the tantras hummed softly, connecting each practitioner to their inner energy."
        }
    ]
}