{
    "term": "tantalus",
    "meanings": [
        {
            "definition": "A figure in Greek mythology who was condemned to stand in a pool of water beneath a fruit tree with low branches, both of which receded whenever he tried to reach for them.",
            "pos": "noun",
            "sent1": "In the story, Tantalus could never quench his thirst as the water always moved away from him.",
            "sent2": "The myth of Tantalus teaches us about the consequences of greed and temptation.",
            "sent3": "Tantalus must have felt so frustrated seeing the water and fruit just out of his grasp.",
            "sent4": "Sometimes life's challenges can feel like a Tantalus situation, always just out of reach.",
            "sent5": "The image of Tantalus reaching for the fruit is a powerful reminder of unattainable desires."
        },
        {
            "definition": "A type of fruit tree.",
            "pos": "noun",
            "sent1": "The tantalus in our garden produces the most delicious fruits every summer.",
            "sent2": "The tantalus tree is known for its sweet and juicy harvest.",
            "sent3": "I love sitting under the tantalus tree and enjoying its shade.",
            "sent4": "The tantalus tree's branches are always full of ripe fruits, tempting everyone around.",
            "sent5": "The tantalus tree in our backyard is a favorite spot for birds to gather and feast."
        },
        {
            "definition": "A type of cocktail made with gin, lemon juice, sugar, and soda water.",
            "pos": "noun",
            "sent1": "At the party, I tried a tantalus for the first time and loved its refreshing taste.",
            "sent2": "The bartender recommended the tantalus as a perfect summer drink.",
            "sent3": "Sipping on a tantalus by the pool made the evening even more enjoyable.",
            "sent4": "The tantalus cocktail is a popular choice for those who enjoy a citrusy kick.",
            "sent5": "The tantalus is a great option for those looking for a light and zesty beverage."
        }
    ]
}