{
    "term": "tap",
    "meanings": [
        {
            "definition": "To strike lightly",
            "pos": "verb",
            "sent1": "She decided to tap the table to get everyone's attention.",
            "sent2": "He likes to tap his fingers on the desk when he's thinking.",
            "sent3": "The cat tried to tap the fish in the bowl with its paw.",
            "sent4": "The raindrops seemed to tap on the window like tiny dancers.",
            "sent5": "The woodpecker would tap on the tree trunk to find insects hiding inside."
        },
        {
            "definition": "A device for controlling the flow of liquid",
            "pos": "noun",
            "sent1": "The plumber used a tap to fix the leaky pipe.",
            "sent2": "Don't forget to turn off the tap after using the sink.",
            "sent3": "The magical tap in the garden could pour any drink you desired.",
            "sent4": "The bartender adjusted the tap to pour the perfect pint of beer.",
            "sent5": "The old well had a rusty tap that creaked when turned."
        },
        {
            "definition": "To make a connection to a resource",
            "pos": "verb",
            "sent1": "He needed to tap into his creativity to finish the project.",
            "sent2": "The team decided to tap the expertise of their mentor for guidance.",
            "sent3": "The detective had to tap the database for crucial information.",
            "sent4": "She was able to tap the network for job opportunities.",
            "sent5": "The artist tried to tap into the emotions of the audience through her performance."
        },
        {
            "definition": "A gentle touch or pat",
            "pos": "noun",
            "sent1": "She felt a tap on her shoulder and turned around to see who it was.",
            "sent2": "The baby giggled at the tap of his mother's hand on his back.",
            "sent3": "The tap of the butterfly's wings on the flower was barely noticeable.",
            "sent4": "He gave his friend a tap on the back to congratulate him.",
            "sent5": "The tap of the rain on the roof was soothing as she fell asleep."
        }
    ]
}