{
    "term": "tapers",
    "meanings": [
        {
            "definition": "A slender candle",
            "pos": "noun",
            "sent1": "During the power outage, we lit tapers to illuminate the room.",
            "sent2": "She bought a pack of tapers for the romantic dinner.",
            "sent3": "The tapers flickered like tiny stars in the darkness.",
            "sent4": "The tapers stood tall and elegant on the dining table.",
            "sent5": "The sweet scent of the tapers filled the air with warmth."
        },
        {
            "definition": "Gradually decrease in thickness or width",
            "pos": "verb",
            "sent1": "As winter approaches, the daylight tapers, signaling the arrival of colder days.",
            "sent2": "The river tapers as it flows downstream, becoming narrower.",
            "sent3": "His interest in the game tapers off as he finds a new hobby.",
            "sent4": "The road tapers into a narrow path through the forest.",
            "sent5": "Her voice tapers to a whisper as she shares her secret."
        },
        {
            "definition": "A person who makes or sells candles",
            "pos": "noun",
            "sent1": "The tapers at the market had a wide variety of scents.",
            "sent2": "The skilled tapers crafted unique candles for the festival.",
            "sent3": "The tapers joked about having the brightest job in town.",
            "sent4": "The tapers proudly displayed their handmade creations.",
            "sent5": "The tapers shared tips on creating the perfect candle."
        },
        {
            "definition": "A long, thin piece of wood or metal used for holding a candle",
            "pos": "noun",
            "sent1": "She placed the taper in the candle holder before lighting it.",
            "sent2": "The antique taper added a touch of elegance to the room.",
            "sent3": "The taper rolled off the table and onto the floor with a clatter.",
            "sent4": "He carved intricate designs on the wooden taper.",
            "sent5": "The taper glowed softly in the dimly lit room."
        }
    ]
}