{
    "term": "tapen",
    "meanings": [
        {
            "definition": "To hit lightly",
            "pos": "verb",
            "sent1": "She tapen the table to get everyone's attention.",
            "sent2": "He tapen the door with his knuckles before entering.",
            "sent3": "The cat tapen the toy mouse around the room playfully.",
            "sent4": "The rain tapen against the window like tiny drums.",
            "sent5": "The teacher tapen the chalkboard to emphasize a point."
        },
        {
            "definition": "A small piece of adhesive tape",
            "pos": "noun",
            "sent1": "She used a tapen to stick the drawing on the wall.",
            "sent2": "He always carries a tapen in his bag for emergencies.",
            "sent3": "The tapen held the torn paper together perfectly.",
            "sent4": "The tapen on the package kept it securely sealed.",
            "sent5": "She tore off a piece of tapen to label the box."
        },
        {
            "definition": "To draw out or extract by tapping",
            "pos": "verb",
            "sent1": "He tapen the rhythm out on the drums.",
            "sent2": "She tapen the information from the old book.",
            "sent3": "The detective tapen the truth from the suspect.",
            "sent4": "The musician tapen the melody from his heart.",
            "sent5": "She tapen the idea from her imagination."
        },
        {
            "definition": "A device for controlling the flow of liquid from a pipe or container",
            "pos": "noun",
            "sent1": "The tapen in the kitchen sink was leaking.",
            "sent2": "He turned the tapen to stop the water from flowing.",
            "sent3": "The tapen in the garden hose was broken and needed fixing.",
            "sent4": "She adjusted the tapen to regulate the water pressure.",
            "sent5": "The tapen on the oil drum was rusted and difficult to turn."
        }
    ]
}