{
    "term": "tappet",
    "meanings": [
        {
            "definition": "A lever or projection that moves up and down to control the flow of liquid or gas.",
            "pos": "noun",
            "sent1": "The tappet on the machine helps regulate the water flow.",
            "sent2": "The mechanic adjusted the tappet to control the air pressure.",
            "sent3": "The tappet danced up and down like a tiny seesaw.",
            "sent4": "Her fingers tapped the tappet rhythmically, like a conductor directing an orchestra.",
            "sent5": "The shiny tappet gleamed in the sunlight, catching everyone's eye."
        },
        {
            "definition": "A component in an engine that converts rotary motion into linear motion.",
            "pos": "noun",
            "sent1": "The tappet in the engine helps change spinning into straight movement.",
            "sent2": "The mechanic inspected the tappet to ensure smooth engine operation.",
            "sent3": "The tappet in the engine played a crucial role in the car's dance of motion.",
            "sent4": "The tappet acted like a translator, converting the engine's language into understandable motion.",
            "sent5": "With a gentle hum, the tappet transformed the engine's energy into forward motion."
        },
        {
            "definition": "A mechanical device used to regulate the timing of valves in an engine.",
            "pos": "noun",
            "sent1": "The tappet in the engine controlled when the valves opened and closed.",
            "sent2": "The mechanic adjusted the tappet to fine-tune the engine's performance.",
            "sent3": "The mischievous tappet decided to play games with the engine's valves.",
            "sent4": "Like a conductor of a symphony, the tappet orchestrated the precise timing of the engine's valves.",
            "sent5": "The tappet's role was crucial, ensuring the engine's heartbeat stayed steady and strong."
        }
    ]
}