{
    "term": "taps",
    "meanings": [
        {
            "definition": "A device for controlling the flow of liquid from a pipe",
            "pos": "noun",
            "sent1": "The plumber fixed the leak by adjusting the taps on the pipe.",
            "sent2": "The sound of water flowing through the taps was soothing.",
            "sent3": "The mischievous cat tried to play with the taps in the kitchen sink.",
            "sent4": "Her fingers danced on the taps, regulating the water flow like a maestro.",
            "sent5": "The shiny brass taps gleamed under the bathroom lights."
        },
        {
            "definition": "A light, rhythmic sound made by striking a surface",
            "pos": "noun",
            "sent1": "The taps of rain on the window created a calming melody.",
            "sent2": "The dancer's taps echoed through the studio as she practiced her routine.",
            "sent3": "The taps of the typewriter filled the room with a nostalgic sound.",
            "sent4": "His heart skipped a beat at the taps on the door, hoping it was her.",
            "sent5": "The taps of the drum signaled the start of the performance."
        },
        {
            "definition": "To touch something lightly",
            "pos": "verb",
            "sent1": "She taps her pencil on the desk when she's thinking.",
            "sent2": "He taps his foot nervously during the exam.",
            "sent3": "The butterfly gently taps its wings against the flower petals.",
            "sent4": "The wind taps the window pane, trying to get her attention.",
            "sent5": "He taps his friend on the shoulder to get his attention."
        },
        {
            "definition": "To connect a wire or device to a power source",
            "pos": "verb",
            "sent1": "He taps the cord into the socket to charge his phone.",
            "sent2": "She taps the plug firmly into the outlet to power the lamp.",
            "sent3": "The robot taps into the main power grid for energy.",
            "sent4": "The electric car taps into renewable energy sources for charging.",
            "sent5": "He taps the cable into the computer to transfer data."
        },
        {
            "definition": "To select or choose something, especially on a touchscreen device",
            "pos": "verb",
            "sent1": "She taps the screen to open the app on her phone.",
            "sent2": "He taps the icon to confirm his selection on the tablet.",
            "sent3": "The child taps randomly on the screen, trying to play a game.",
            "sent4": "She taps the image to zoom in for a closer look.",
            "sent5": "He taps the button to send the message on the chat app."
        }
    ]
}