{
    "term": "tapus",
    "meanings": [
        {
            "definition": "A traditional Polynesian prohibition or taboo.",
            "pos": "noun",
            "sent1": "In some cultures, breaking a tapus can lead to serious consequences.",
            "sent2": "The tapus surrounding certain rituals must be respected by all community members.",
            "sent3": "The village elder jokingly mentioned that eating the last piece of cake was a tapus.",
            "sent4": "To the islanders, the ancient tapus were like invisible walls protecting their way of life.",
            "sent5": "The tapus were ingrained in their culture, guiding their daily actions and decisions."
        },
        {
            "definition": "To prohibit or forbid something.",
            "pos": "verb",
            "sent1": "The sign clearly tapus fishing in this area.",
            "sent2": "Parents often tapus their children from eating too much candy.",
            "sent3": "The teacher tapused the use of cell phones during class time.",
            "sent4": "The law tapuses the sale of alcohol to minors.",
            "sent5": "The doctor tapused the patient from consuming any more sugar."
        },
        {
            "definition": "A sacred or forbidden place.",
            "pos": "noun",
            "sent1": "The ancient temple was considered a tapus by the locals.",
            "sent2": "Only the priests were allowed to enter the tapus at the top of the mountain.",
            "sent3": "Legend has it that a tapus deep in the forest is home to mystical creatures.",
            "sent4": "The tapus by the waterfall was believed to be a gateway to the spirit world.",
            "sent5": "The tapus was shrouded in mystery, with tales of those who dared to enter never returning."
        },
        {
            "definition": "To declare something off-limits or forbidden.",
            "pos": "verb",
            "sent1": "The government tapused the construction of buildings in the protected area.",
            "sent2": "The captain tapused passengers from entering the restricted area of the ship.",
            "sent3": "The mayor tapused parking on the street for the event.",
            "sent4": "The company tapused employees from sharing confidential information.",
            "sent5": "The park ranger tapused visitors from feeding the wild animals."
        }
    ]
}