{
    "term": "targa",
    "meanings": [
        {
            "definition": "A shield or plate inscribed with a coat of arms.",
            "pos": "noun",
            "sent1": "The knight proudly displayed his family's targa on the castle wall.",
            "sent2": "The targa hung above the fireplace, showcasing the family's heritage.",
            "sent3": "During the jousting tournament, the targa accidentally fell off the horse and landed in the mud.",
            "sent4": "The targa of honor gleamed in the sunlight, symbolizing bravery and loyalty.",
            "sent5": "Visitors to the castle were in awe of the intricate design on the targa."
        },
        {
            "definition": "A type of sports car with a removable roof panel.",
            "pos": "noun",
            "sent1": "He loved driving his sleek targa along the winding coastal roads.",
            "sent2": "The targa's roof could be easily removed, allowing the driver to feel the wind in their hair.",
            "sent3": "In the race, the targa zoomed past the other cars, leaving them in a cloud of dust.",
            "sent4": "The targa purred like a contented cat as it cruised down the highway.",
            "sent5": "The red targa gleamed under the showroom lights, attracting admiring glances."
        },
        {
            "definition": "A type of Italian dish made with thinly sliced meat or fish.",
            "pos": "noun",
            "sent1": "The chef prepared a delicious targa with thinly sliced beef and fresh herbs.",
            "sent2": "The targa was a popular choice on the menu, known for its delicate flavors.",
            "sent3": "At the cooking competition, the targa dish received rave reviews from the judges.",
            "sent4": "The targa on the plate resembled a work of art, with its colorful presentation.",
            "sent5": "The aroma of the sizzling targa filled the kitchen, making everyone's mouth water."
        }
    ]
}