{
    "term": "tarocs",
    "meanings": [
        {
            "definition": "A type of playing card used in tarot readings.",
            "pos": "noun",
            "sent1": "During the tarot reading, the fortune teller revealed the meaning of the tarocs.",
            "sent2": "She shuffled the tarocs before laying them out for the reading.",
            "sent3": "The tarocs seemed to whisper secrets to the fortune teller as she placed them on the table.",
            "sent4": "The images on the tarocs danced like characters in a story, each holding a message.",
            "sent5": "The tarocs, with their mysterious symbols, held the key to unlocking the future."
        },
        {
            "definition": "The act of using tarot cards for divination.",
            "pos": "noun",
            "sent1": "Her tarocs revealed a path to follow in the divination process.",
            "sent2": "The art of tarocs involves interpreting the cards to predict the future.",
            "sent3": "In the world of divination, the tarocs were like magical guides pointing the way.",
            "sent4": "The tarocs acted as a bridge between the present and the unknown future.",
            "sent5": "With each turn of the tarocs, the diviner uncovered hidden truths."
        },
        {
            "definition": "A set of tarot cards used for fortune-telling.",
            "pos": "noun",
            "sent1": "She carefully wrapped her tarocs in a silk cloth after the reading.",
            "sent2": "The tarocs were passed down through generations for fortune-telling purposes.",
            "sent3": "The tarocs, with their ancient illustrations, held the secrets of fate.",
            "sent4": "As she spread out the tarocs, the room filled with an air of mystery.",
            "sent5": "The tarocs, with their worn edges, carried the weight of countless destinies."
        },
        {
            "definition": "To consult tarot cards for guidance or insight.",
            "pos": "verb",
            "sent1": "She tarocsed before making a decision, seeking clarity in the cards.",
            "sent2": "People often tarocs when they are at a crossroads in life.",
            "sent3": "He tarocsed playfully, not expecting the cards to reveal anything serious.",
            "sent4": "In times of uncertainty, she would tarocs for a sense of direction.",
            "sent5": "The old man tarocsed with reverence, believing in the wisdom of the cards."
        }
    ]
}