{
    "term": "tarot",
    "meanings": [
        {
            "definition": "A set of playing cards, typically used for divination or fortune-telling.",
            "pos": "noun",
            "sent1": "During the party, she brought out her tarot deck to predict the future.",
            "sent2": "Every morning, she would consult her tarot cards for guidance.",
            "sent3": "The tarot cards seemed to have a mind of their own, always revealing unexpected truths.",
            "sent4": "Her life felt like a game of tarot, each decision turning over a new card of fate.",
            "sent5": "The images on the tarot cards danced with secrets and mysteries, waiting to be unveiled."
        },
        {
            "definition": "The act of using tarot cards for guidance or insight.",
            "pos": "noun",
            "sent1": "Her tarot reading provided her with much-needed clarity on her situation.",
            "sent2": "People often seek tarot for answers during times of uncertainty.",
            "sent3": "The tarot session turned into a comedy show when the cards kept making jokes.",
            "sent4": "His mind was a labyrinth, and tarot was the map guiding him through the twists and turns.",
            "sent5": "The tarot reading felt like a conversation with destiny, each card whispering its message."
        },
        {
            "definition": "A specific type of card deck used in tarot readings.",
            "pos": "noun",
            "sent1": "She carefully selected a new tarot deck with vibrant illustrations.",
            "sent2": "The tarot deck consisted of 78 cards, each holding a unique meaning.",
            "sent3": "The mischievous cat knocked over her tarot deck, mixing up the order of fate.",
            "sent4": "In her hands, the tarot deck became a portal to another realm, full of possibilities.",
            "sent5": "The tarot deck felt like a treasure chest, holding secrets waiting to be discovered."
        }
    ]
}