{
    "term": "tarzan",
    "meanings": [
        {
            "definition": "A fictional character created by Edgar Rice Burroughs, known for his ability to communicate with animals.",
            "pos": "noun",
            "sent1": "In the story, Tarzan could talk to animals and understand them.",
            "sent2": "Many children enjoy reading about Tarzan and his adventures with animals.",
            "sent3": "When the zookeeper dressed up as Tarzan, the monkeys thought he was their new leader!",
            "sent4": "Her connection with nature was so strong, she felt like a real-life Tarzan.",
            "sent5": "The image of Tarzan swinging through the jungle stayed in their minds long after the book was finished."
        },
        {
            "definition": "To swing or move through trees like Tarzan.",
            "pos": "verb",
            "sent1": "The kids pretended to Tarzan through the playground, holding onto the monkey bars.",
            "sent2": "Tarzan effortlessly swung from vine to vine in the movie.",
            "sent3": "She tried to Tarzan across the river by grabbing onto the overhanging branches.",
            "sent4": "The gymnast's routine made it seem like she could Tarzan through the air with grace.",
            "sent5": "The acrobat's performance was so mesmerizing, it looked like she could Tarzan through the circus tent."
        },
        {
            "definition": "A person who is strong, athletic, and skilled in the outdoors.",
            "pos": "noun",
            "sent1": "He was known as the Tarzan of the group for his incredible strength and agility.",
            "sent2": "The explorer was a modern-day Tarzan, navigating the wilderness with ease.",
            "sent3": "At the outdoor competition, everyone joked that she was the Tarzan of the event.",
            "sent4": "The survival expert's skills in the wild made him a true Tarzan in the eyes of his peers.",
            "sent5": "She felt like a Tarzan when she effortlessly climbed the steep mountain trail."
        }
    ]
}