{
    "term": "tarzans",
    "meanings": [
        {
            "definition": "Tarzans (noun): plural form of Tarzan, a fictional character known for his strength and agility in the jungle.",
            "pos": "noun",
            "sent1": "In the story, the Tarzans were brave and strong like Tarzan.",
            "sent2": "The Tarzans in the movie swung effortlessly through the trees.",
            "sent3": "The children pretended to be Tarzans, swinging from tree to tree in the park.",
            "sent4": "The forest echoed with the calls of the Tarzans, each one seeking adventure.",
            "sent5": "The Tarzans' jungle home was filled with excitement and danger."
        },
        {
            "definition": "Tarzans (verb): third person singular present of the verb Tarzan, meaning to swing through the trees like the character Tarzan.",
            "pos": "verb",
            "sent1": "He tarzans through the forest, moving swiftly from branch to branch.",
            "sent2": "She tarzans effortlessly, showing off her agility and grace.",
            "sent3": "The monkey tried to tarzans like Tarzan but ended up in a tangle of vines.",
            "sent4": "The acrobat tarzans through the air, captivating the audience with each swing.",
            "sent5": "The gymnast tarzans on the uneven bars, displaying incredible strength and skill."
        },
        {
            "definition": "Tarzans (adjective): describing something as wild, untamed, or resembling the character Tarzan.",
            "pos": "adjective",
            "sent1": "The jungle had a tarzans feel, with its dense foliage and mysterious sounds.",
            "sent2": "Her hair was a tarzans mess after playing outside all day.",
            "sent3": "The party had a tarzans theme, with guests dressed as jungle animals.",
            "sent4": "The storm raged outside, the wind howling in a tarzans manner.",
            "sent5": "The explorer's tales were filled with tarzans adventures, each more thrilling than the last."
        }
    ]
}