{
    "term": "tasso",
    "meanings": [
        {
            "definition": "A type of Italian cured meat.",
            "pos": "noun",
            "sent1": "I tried a delicious tasso sandwich for lunch.",
            "sent2": "The chef used tasso to add flavor to the pasta dish.",
            "sent3": "The tasso slices danced in the pan as they sizzled.",
            "sent4": "The aroma of the tasso filled the kitchen, making everyone hungry.",
            "sent5": "The tasso was so tender and savory, it melted in my mouth."
        },
        {
            "definition": "A fixed charge or tax.",
            "pos": "noun",
            "sent1": "The tasso for parking in the city center was too high.",
            "sent2": "The government imposed a tasso on imported goods.",
            "sent3": "I grumbled about the tasso on my phone bill.",
            "sent4": "The tasso felt like a heavy burden on my finances.",
            "sent5": "The tasso was like a toll booth on the road to financial freedom."
        },
        {
            "definition": "A unit of weight used in Turkey and the Middle East, equal to about 1.3 pounds.",
            "pos": "noun",
            "sent1": "She bought a tasso of apples at the market.",
            "sent2": "The recipe called for a tasso of flour.",
            "sent3": "Carrying a tasso of books in one hand was a challenge.",
            "sent4": "The tasso of sugar was more than enough for the dessert.",
            "sent5": "The tasso of rice filled the bowl to the brim."
        },
        {
            "definition": "To assign a value or rate to something.",
            "pos": "verb",
            "sent1": "I need to tasso the antique vase before selling it.",
            "sent2": "The appraiser will tasso the jewelry for insurance purposes.",
            "sent3": "He decided to tasso his collection of stamps for fun.",
            "sent4": "She carefully tassoed the artwork, considering its uniqueness.",
            "sent5": "The expert tassoed the rare coin with precision and expertise."
        }
    ]
}