{
    "term": "tattersall",
    "meanings": [
        {
            "definition": "A type of checkered or plaid pattern",
            "pos": "noun",
            "sent1": "The tablecloth had a tattersall design with squares of different colors.",
            "sent2": "She wore a tattersall scarf that matched her coat perfectly.",
            "sent3": "The clown's outfit was a mix of tattersall and polka dots, creating a unique look.",
            "sent4": "The city skyline at night looked like a tattersall of lights and shadows.",
            "sent5": "The field of flowers resembled a tattersall quilt spread across the meadow."
        },
        {
            "definition": "A fabric with a checkered or plaid pattern",
            "pos": "noun",
            "sent1": "The tailor used a soft tattersall fabric to make the dress.",
            "sent2": "The couch was covered in a cozy tattersall material.",
            "sent3": "The picnic blanket was made of tattersall, making it easy to spot in the grass.",
            "sent4": "Her favorite shirt had a tattersall design that reminded her of her grandmother's quilts.",
            "sent5": "The curtains in the living room were a beautiful tattersall that let in just the right amount of light."
        },
        {
            "definition": "A horse blanket with a checkered or plaid pattern",
            "pos": "noun",
            "sent1": "The horse trotted proudly with its tattersall blanket draped over its back.",
            "sent2": "The stable hand carefully folded the tattersall horse blanket after grooming the mare.",
            "sent3": "The mischievous foal tried to nibble on the tattersall blanket, mistaking it for a snack.",
            "sent4": "The tattersall horse blanket fluttered in the wind as the stallion galloped across the field.",
            "sent5": "The equestrian competition featured horses adorned in vibrant tattersall blankets, adding a touch of elegance to the event."
        }
    ]
}