{
    "term": "tawdrier",
    "meanings": [
        {
            "definition": "Tawdry: showy but cheap and of poor quality",
            "pos": "adjective",
            "sent1": "The tawdrier necklace broke easily because it was poorly made.",
            "sent2": "She wore a tawdrier dress to the party, standing out for all the wrong reasons.",
            "sent3": "The tawdrier decorations at the event made everyone chuckle at their tackiness.",
            "sent4": "The tawdrier furniture in the room screamed of low quality and lack of taste.",
            "sent5": "The tawdrier shoes fell apart after just a few wears, proving their cheapness."
        },
        {
            "definition": "Tawdry: gaudy or tasteless in appearance",
            "pos": "adjective",
            "sent1": "The tawdrier painting clashed with the rest of the room's decor.",
            "sent2": "Her tawdrier accessories drew attention for all the wrong reasons.",
            "sent3": "The tawdrier outfit she wore to the event made her friends giggle at its loudness.",
            "sent4": "The tawdrier colors of the house exterior made it stand out in an unflattering way.",
            "sent5": "The tawdrier design of the car made it look like a child's toy rather than a luxury vehicle."
        },
        {
            "definition": "Tawdry: to make something appear gaudy or cheap",
            "pos": "verb",
            "sent1": "She tawdriered the room by adding too many bright and clashing decorations.",
            "sent2": "He tawdriers his outfits by wearing mismatched patterns and colors.",
            "sent3": "The decorator tawdriered the space with over-the-top and cheap-looking furniture.",
            "sent4": "The marketing team tawdriered the product packaging, making it look like a dollar store item.",
            "sent5": "The artist tawdriered the painting by using garish colors and excessive glitter, ruining its elegance."
        }
    ]
}