{
    "term": "tea",
    "meanings": [
        {
            "definition": "A hot drink made by infusing the dried, crushed leaves of the tea plant in boiling water.",
            "pos": "noun",
            "sent1": "Every morning, I enjoy a cup of hot tea to start my day.",
            "sent2": "After a long day at work, she likes to relax with a soothing cup of tea.",
            "sent3": "The cat accidentally knocked over a cup of tea, creating a small mess.",
            "sent4": "Her words were like a warm cup of tea on a cold day, comforting and calming.",
            "sent5": "The aroma of freshly brewed tea filled the room, inviting everyone to take a sip."
        },
        {
            "definition": "The dried leaves or buds of the tea plant used to make this drink.",
            "pos": "noun",
            "sent1": "She bought a box of tea leaves to brew her own tea at home.",
            "sent2": "The tea leaves were carefully selected to ensure a rich flavor in the tea.",
            "sent3": "The squirrel mistook the tea leaves for nuts and tried to bury them in the garden.",
            "sent4": "The tea leaves danced in the teapot, releasing their essence into the water.",
            "sent5": "The tea leaves unfurled in the hot water, creating a beautiful infusion of flavors."
        },
        {
            "definition": "A light meal eaten in the late afternoon or early evening, typically consisting of sandwiches and cakes with tea to drink.",
            "pos": "noun",
            "sent1": "On weekends, they often have a lovely tea with sandwiches and cakes.",
            "sent2": "The tea was accompanied by a delightful spread of sandwiches and pastries.",
            "sent3": "The tea party in the garden was a charming affair with delicious treats.",
            "sent4": "The tea and snacks were like a mini feast, satisfying both hunger and thirst.",
            "sent5": "The table was set with a variety of teas and delectable finger foods for the guests."
        }
    ]
}