{
    "term": "teahouse",
    "meanings": [
        {
            "definition": "A place where tea is served.",
            "pos": "noun",
            "sent1": "The teahouse had a cozy atmosphere with soft music playing in the background.",
            "sent2": "Let's meet at the teahouse for a relaxing afternoon chat.",
            "sent3": "The teahouse had a surprise visitor today - a squirrel who wanted to join for tea!",
            "sent4": "Her smile was a teahouse, welcoming and warm to everyone she met.",
            "sent5": "The teahouse stood out in the bustling city, a haven of tranquility amidst chaos."
        },
        {
            "definition": "A small restaurant or café where tea is the main beverage served.",
            "pos": "noun",
            "sent1": "The teahouse on the corner always had the best selection of teas.",
            "sent2": "I love the teahouse down the street; their matcha latte is delicious.",
            "sent3": "The teahouse had a tiny door that only mice could use - a tea party for rodents!",
            "sent4": "Her laughter bubbled out of her like tea from a teahouse, infectious and warm.",
            "sent5": "The teahouse was a treasure trove of flavors, each cup a journey to a different land."
        },
        {
            "definition": "A building or structure where tea is prepared and served to customers.",
            "pos": "noun",
            "sent1": "The teahouse was a beautiful wooden cabin nestled in the forest.",
            "sent2": "Visitors marveled at the intricate designs of the teahouse's traditional architecture.",
            "sent3": "The teahouse had a secret passage that led to a garden of tea leaves - a tea lover's dream!",
            "sent4": "Her words flowed smoothly, like tea poured from a teahouse's elegant pot.",
            "sent5": "The teahouse's aroma wafted through the air, enticing all who passed by to come in for a cup."
        }
    ]
}