{
    "term": "tearier",
    "meanings": [
        {
            "definition": "Tearier (comparative adjective): More likely to cry or shed tears.",
            "pos": "adjective",
            "sent1": "She felt tearier than usual after watching the sad movie.",
            "sent2": "The little girl was tearier than her brother when it came to emotional scenes.",
            "sent3": "The puppy's tearier reaction to being left alone was both heartwarming and amusing.",
            "sent4": "Her eyes were tearier than a rainy day, reflecting her emotional state.",
            "sent5": "The sight of the abandoned kitten was so tearier that it stayed in her memory for days."
        },
        {
            "definition": "Tearier (noun): A person who cries easily or frequently.",
            "pos": "noun",
            "sent1": "She was known as the tearier among her friends for her emotional nature.",
            "sent2": "The tearier in the group always carried tissues in case of a sudden outburst.",
            "sent3": "The tearier at the party made everyone laugh with their constant emotional reactions.",
            "sent4": "He was a tearier, his emotions flowing like a river with every sad story.",
            "sent5": "The tearier's presence brought a sense of empathy and understanding to the group."
        },
        {
            "definition": "Tearier (adverb): In a manner that is more prone to crying or shedding tears.",
            "pos": "adverb",
            "sent1": "She looked at him tearier than before, her eyes glistening with unshed tears.",
            "sent2": "The child cried tearier than ever, his sobs echoing through the room.",
            "sent3": "The movie's ending left her tearier than a sad song played on repeat.",
            "sent4": "The farewell was tearier than expected, with emotions running high.",
            "sent5": "Her voice trembled tearier than autumn leaves in the wind, revealing her vulnerability."
        }
    ]
}