{
    "term": "tee",
    "meanings": [
        {
            "definition": "A small peg with a concave top used to support a golf ball before it is struck.",
            "pos": "noun",
            "sent1": "The golfer placed the tee carefully on the ground.",
            "sent2": "Make sure to use a tee when playing golf to elevate the ball.",
            "sent3": "The tee decided to take a break after holding up so many golf balls.",
            "sent4": "The tee stood tall like a tiny tower supporting the golf ball.",
            "sent5": "The bright red tee contrasted against the green grass, making it easy to spot."
        },
        {
            "definition": "A T-shaped peg with a concave top used to hold a golf ball for an initial shot.",
            "pos": "noun",
            "sent1": "The golfer picked up the tee and placed it in the ground.",
            "sent2": "Using a tee helps ensure a clean shot at the beginning of the game.",
            "sent3": "The tee felt proud to be chosen for the first shot of the game.",
            "sent4": "The tee embraced the golf ball snugly, ready for the swing.",
            "sent5": "The tee's job was crucial, setting the stage for the golf ball's flight."
        },
        {
            "definition": "A mark aimed at in certain games, such as curling or quoits.",
            "pos": "noun",
            "sent1": "The players aimed for the tee to score points in the game.",
            "sent2": "The tee served as the target for the players to aim at.",
            "sent3": "The tee chuckled as the players tried to hit it with precision.",
            "sent4": "The tee became the center of attention, like a bullseye in a game.",
            "sent5": "Hitting the tee accurately required skill and focus from the players."
        },
        {
            "definition": "A small peg with a concave top used to support a golf ball before it is struck.",
            "pos": "noun",
            "sent1": "The tee wobbled slightly as the golfer placed the ball on it.",
            "sent2": "Using a tee can help improve your golf swing and accuracy.",
            "sent3": "The tee felt honored to be part of the golfer's equipment.",
            "sent4": "The tee's role was crucial in ensuring a successful golf shot.",
            "sent5": "The tee's simple design belied its importance in the game of golf."
        },
        {
            "definition": "A T-shaped peg with a concave top used to hold a golf ball for an initial shot.",
            "pos": "noun",
            "sent1": "The tee stood firmly in the ground, ready for the golf ball.",
            "sent2": "Using a tee can make it easier to hit the golf ball cleanly.",
            "sent3": "The tee felt a sense of pride in supporting the golf ball for the first shot.",
            "sent4": "The tee's shape provided the perfect platform for the golf ball.",
            "sent5": "The tee's job was simple yet crucial in the game of golf."
        }
    ]
}