{
    "term": "teers",
    "meanings": [
        {
            "definition": "Tears: drops of saline fluid that are secreted by the lacrimal glands in response to emotion or irritation",
            "pos": "noun",
            "sent1": "She wiped away her teers with a tissue.",
            "sent2": "The baby's teers were a sign of her sadness.",
            "sent3": "The clown slipped on a banana peel, causing teers of laughter from the audience.",
            "sent4": "His heartfelt speech brought teers to everyone's eyes.",
            "sent5": "The movie's ending was so touching that it left everyone in teers."
        },
        {
            "definition": "Tears: rips or holes in fabric or paper",
            "pos": "noun",
            "sent1": "Be careful not to get any teers in your shirt.",
            "sent2": "The teers in the painting made it look more authentic.",
            "sent3": "The mischievous puppy left teers in the curtains with its sharp teeth.",
            "sent4": "The storm's strong winds caused teers in the old tent.",
            "sent5": "She accidentally made teers in the wrapping paper while opening the gift."
        },
        {
            "definition": "Tears: moves quickly or forcefully",
            "pos": "verb",
            "sent1": "The car teers down the road at top speed.",
            "sent2": "The athlete teers towards the finish line with determination.",
            "sent3": "The excited children teer around the playground, full of energy.",
            "sent4": "The wind teers through the trees, making them sway.",
            "sent5": "The roller coaster teers down the steep track, thrilling the riders."
        },
        {
            "definition": "Tears: pulls apart forcefully or violently",
            "pos": "verb",
            "sent1": "He teers the paper in frustration.",
            "sent2": "The strong winds teer the branches off the tree.",
            "sent3": "The siblings playfully teer the toy apart in a game.",
            "sent4": "The explosion teers the building down in seconds.",
            "sent5": "The angry mob tries to teer down the gates in protest."
        }
    ]
}