{
    "term": "teeth",
    "meanings": [
        {
            "definition": "One of the hard white structures in the mouth used for biting and chewing food.",
            "pos": "noun",
            "sent1": "My teeth help me eat crunchy apples.",
            "sent2": "She brushed her teeth before bed.",
            "sent3": "The cookie was so hard, I thought it would break my teeth!",
            "sent4": "Her smile was as bright as a row of pearls, each tooth shining like a star.",
            "sent5": "The dentist's tools clinked against my teeth, making me nervous."
        },
        {
            "definition": "A projecting part of a gear that engages with another gear to transmit motion.",
            "pos": "noun",
            "sent1": "The teeth of the gears meshed perfectly, allowing the machine to run smoothly.",
            "sent2": "The mechanic carefully inspected the teeth of the gears for any signs of wear.",
            "sent3": "The gears whispered to each other, 'Our teeth are what keep us moving!'",
            "sent4": "The teeth of the gears interlocked like dancers in a synchronized routine.",
            "sent5": "The teeth of the gears hummed a melodious tune as they turned together."
        },
        {
            "definition": "The power of a tool to cut or shape a material.",
            "pos": "noun",
            "sent1": "The saw's teeth sliced effortlessly through the wood.",
            "sent2": "The sculptor carefully sharpened the teeth of his chisel.",
            "sent3": "The knife's teeth giggled mischievously as they carved intricate designs.",
            "sent4": "The teeth of the tool bit into the metal, leaving a precise mark.",
            "sent5": "The teeth of the saw roared like a lion as they cut through the thick log."
        },
        {
            "definition": "A sharp edge or point.",
            "pos": "noun",
            "sent1": "The knife's teeth gleamed under the kitchen light.",
            "sent2": "The jagged teeth of the rock formation looked menacing in the distance.",
            "sent3": "The teeth of the blade whispered secrets of the forest.",
            "sent4": "The teeth of the saw chewed through the wood like a hungry beast.",
            "sent5": "The teeth of the scissors snipped through the paper with precision."
        }
    ]
}