{
    "term": "tefillin",
    "meanings": [
        {
            "definition": "Two small black leather boxes containing scrolls of parchment inscribed with verses from the Torah, worn by Jewish men during weekday morning prayers.",
            "pos": "noun",
            "sent1": "During morning prayers, Jacob carefully placed the tefillin on his arm and forehead.",
            "sent2": "The rabbi explained the significance of tefillin to the young students.",
            "sent3": "Sarah giggled as she tried to wear the tefillin on her head like a crown.",
            "sent4": "The tefillin were like sacred treasure chests holding ancient wisdom.",
            "sent5": "The tefillin felt like a connection to generations past, a tangible link to tradition."
        },
        {
            "definition": "The act of wearing tefillin as a religious practice.",
            "pos": "noun",
            "sent1": "David's dedication to tefillin impressed his family with his commitment to faith.",
            "sent2": "The synagogue was filled with the solemn sound of prayers and the rustle of tefillin being put on.",
            "sent3": "The mischievous boy pretended to wear invisible tefillin, mimicking his father's actions.",
            "sent4": "Tefillin became a symbol of devotion, a visible sign of spiritual connection.",
            "sent5": "The ritual of tefillin brought a sense of peace and purpose to Isaac's mornings."
        },
        {
            "definition": "A pair of tefillin.",
            "pos": "noun",
            "sent1": "Rebecca carefully packed the tefillin in a velvet pouch for safekeeping.",
            "sent2": "The shop displayed a beautiful set of tefillin in the window.",
            "sent3": "The tefillin lay forgotten on the shelf, waiting for their owner to remember them.",
            "sent4": "The traveler's tefillin were a constant reminder of his faith even in distant lands.",
            "sent5": "The worn tefillin bore the marks of years of faithful use, a testament to unwavering belief."
        }
    ]
}