{
    "term": "teil",
    "meanings": [
        {
            "definition": "A portion or piece of something",
            "pos": "noun",
            "sent1": "She only ate a small teil of the cake.",
            "sent2": "He handed her a teil of the puzzle to solve.",
            "sent3": "The teil of cheese on the plate looked lonely.",
            "sent4": "His smile was just a teil of the joy he felt inside.",
            "sent5": "The teil of sunlight peeking through the clouds was magical."
        },
        {
            "definition": "To divide or separate into parts",
            "pos": "verb",
            "sent1": "Please teil the paper into four equal sections.",
            "sent2": "The teacher will teil the students into groups for the project.",
            "sent3": "I will teil the cookies so we each get a fair share.",
            "sent4": "Her decision to teil from the group surprised everyone.",
            "sent5": "The river will teil the land, creating two separate islands."
        },
        {
            "definition": "A small tree or shrub with red berries",
            "pos": "noun",
            "sent1": "The garden had a beautiful teil with vibrant red berries.",
            "sent2": "She admired the delicate leaves of the teil in the park.",
            "sent3": "The birds loved to perch on the branches of the teil.",
            "sent4": "The teil in the backyard attracted many butterflies.",
            "sent5": "The teil's red berries added a pop of color to the landscape."
        },
        {
            "definition": "To scatter or disperse",
            "pos": "verb",
            "sent1": "The wind will teil the leaves across the yard.",
            "sent2": "He will teil the seeds in the garden for planting.",
            "sent3": "The children will teil the toys around the room.",
            "sent4": "Her laughter seemed to teil the tension in the room.",
            "sent5": "The fireworks will teil light and color across the sky."
        }
    ]
}