{
    "term": "telecommunication",
    "meanings": [
        {
            "definition": "The transmission of information over a distance by electronic means.",
            "pos": "noun",
            "sent1": "Telecommunication allows people to share messages across long distances.",
            "sent2": "In today's world, telecommunication plays a vital role in connecting people globally.",
            "sent3": "The aliens communicated with Earth through advanced telecommunication devices.",
            "sent4": "The internet is like a vast web of telecommunication, linking everyone together.",
            "sent5": "During emergencies, telecommunication systems ensure quick communication for help."
        },
        {
            "definition": "The technology and process of sending and receiving messages through electronic devices.",
            "pos": "noun",
            "sent1": "My job involves working with telecommunication equipment to send messages.",
            "sent2": "Telecommunication devices like smartphones have revolutionized how we communicate.",
            "sent3": "The spy used telecommunication gadgets to send secret messages.",
            "sent4": "Her mind was a complex network of telecommunication, processing information rapidly.",
            "sent5": "Telecommunication technology continues to advance, making communication faster and easier."
        },
        {
            "definition": "The act of communicating over a distance using technology.",
            "pos": "noun",
            "sent1": "Telecommunication enables us to talk to people far away through devices.",
            "sent2": "Businesses rely on telecommunication to conduct meetings with partners worldwide.",
            "sent3": "The detective solved the case by intercepting telecommunication signals.",
            "sent4": "Their love was like a seamless telecommunication, connecting their hearts effortlessly.",
            "sent5": "Telecommunication has made the world feel smaller by bridging gaps between cultures."
        }
    ]
}