{
    "term": "television",
    "meanings": [
        {
            "definition": "A system for transmitting visual images and sound that are reproduced on screens",
            "pos": "noun",
            "sent1": "Our new television allows us to watch movies and shows on a big screen.",
            "sent2": "Every evening, I relax on the couch and enjoy watching television.",
            "sent3": "I accidentally bumped into the television, and it started showing everything upside down!",
            "sent4": "Her smile lit up the room like a television screen in a dark theater.",
            "sent5": "The vivid colors on the television made the nature documentary come to life."
        },
        {
            "definition": "The activity of watching television programs",
            "pos": "noun",
            "sent1": "My favorite part of the day is when I get to sit down and enjoy television.",
            "sent2": "Television is a popular pastime for many people around the world.",
            "sent3": "I tried to break the world record for the longest television marathon, but fell asleep after two episodes!",
            "sent4": "Her eyes were glued to the television, captivated by the thrilling plot.",
            "sent5": "The sound of laughter filled the room as we all gathered around the television to watch a comedy show."
        },
        {
            "definition": "A device with a screen that receives television signals and displays images",
            "pos": "noun",
            "sent1": "The television in our living room is so old, it still has knobs to change channels.",
            "sent2": "I need to adjust the brightness on the television to see the picture clearly.",
            "sent3": "My cat thinks the television is a magical window and tries to catch the moving images!",
            "sent4": "The reflection of the sunset on the television screen painted the room in warm hues.",
            "sent5": "The high-definition television made every detail in the movie crystal clear."
        }
    ]
}