{
    "term": "telecoms",
    "meanings": [
        {
            "definition": "The transmission of information over long distances by electronic means.",
            "pos": "noun",
            "sent1": "Telecoms help people talk to each other far away.",
            "sent2": "I rely on telecoms to make phone calls to my friends in other countries.",
            "sent3": "The telecoms were feeling chatty today, connecting everyone across the globe.",
            "sent4": "Her voice traveled through the telecoms like a whisper in the wind.",
            "sent5": "The telecoms hummed with the secrets of the world, carrying messages to distant lands."
        },
        {
            "definition": "The technology and equipment used in the transmission of information over long distances.",
            "pos": "noun",
            "sent1": "The telecoms in our office keep us connected to the internet.",
            "sent2": "Learning about telecoms helped me understand how my phone works.",
            "sent3": "The telecoms in the room seemed to be having a silent conversation.",
            "sent4": "His mind was a complex network of telecoms, processing information at lightning speed.",
            "sent5": "The telecoms gleamed with wires and circuits, ready to send data across the world."
        },
        {
            "definition": "The industry that provides communication services through electronic means.",
            "pos": "noun",
            "sent1": "Working in telecoms means helping people stay connected through technology.",
            "sent2": "The telecoms sector is always evolving with new advancements.",
            "sent3": "The telecoms industry buzzed with excitement over the latest communication breakthrough.",
            "sent4": "She dove into the world of telecoms, exploring the endless possibilities of connectivity.",
            "sent5": "In the realm of telecoms, innovation is the key to staying ahead in the market."
        }
    ]
}