{
    "term": "telltales",
    "meanings": [
        {
            "definition": "A person who reveals information, often unintentionally.",
            "pos": "noun",
            "sent1": "During the game of hide-and-seek, Sarah unintentionally became the telltales by giggling loudly.",
            "sent2": "The telltales in the office accidentally spilled the surprise party secret.",
            "sent3": "The telltales at the party unknowingly blurted out the surprise ending of the movie.",
            "sent4": "Her nervous laughter acted as telltales, giving away her fear of heights.",
            "sent5": "The telltales in the group chat shared the news before it was officially announced."
        },
        {
            "definition": "An indicator or sign that gives away information or secrets.",
            "pos": "noun",
            "sent1": "The telltales of his guilt were written all over his face.",
            "sent2": "The telltales of a storm approaching could be seen in the dark clouds.",
            "sent3": "The telltales of a surprise party were evident in the secretive whispers.",
            "sent4": "The telltales of her excitement were evident in her wide smile.",
            "sent5": "The telltales of spring arriving were the blooming flowers and chirping birds."
        },
        {
            "definition": "A small, colored strip of fabric attached to a sail to indicate wind direction.",
            "pos": "noun",
            "sent1": "The sailors checked the telltales to see if the wind was favorable for sailing.",
            "sent2": "The telltales fluttered in the breeze, showing the sailors the wind's direction.",
            "sent3": "The telltales danced in the wind, guiding the sailors on their course.",
            "sent4": "The telltales on the sail helped the crew navigate through the rough waters.",
            "sent5": "The telltales on the sail were like colorful flags signaling the wind's intentions."
        }
    ]
}