{
    "term": "temper",
    "meanings": [
        {
            "definition": "a person's state of mind regarding anger or calmness",
            "pos": "noun",
            "sent1": "His temper was calm as he faced the challenge.",
            "sent2": "She tried to control her temper during the argument.",
            "sent3": "Even though he lost the game, his temper remained steady.",
            "sent4": "Her temper was a tranquil lake amidst the storm of emotions.",
            "sent5": "The teacher's temper was like a gentle breeze, soothing the students."
        },
        {
            "definition": "a tendency to become angry easily",
            "pos": "noun",
            "sent1": "His quick temper often led to misunderstandings.",
            "sent2": "She struggled with her temper when things didn't go her way.",
            "sent3": "The cat's temper flared up when the dog came too close.",
            "sent4": "His temper was a volcano waiting to erupt at any moment.",
            "sent5": "The child's temper tantrum was loud and disruptive."
        },
        {
            "definition": "to moderate or adjust",
            "pos": "verb",
            "sent1": "She tried to temper her excitement before the big reveal.",
            "sent2": "He needed to temper his criticism with kindness.",
            "sent3": "The chef had to temper the spices to create the perfect dish.",
            "sent4": "She learned to temper her reactions to avoid overreacting.",
            "sent5": "The artist had to temper the colors to achieve the right shade."
        },
        {
            "definition": "to strengthen by heating and cooling",
            "pos": "verb",
            "sent1": "The blacksmith had to temper the metal to make it strong.",
            "sent2": "The glassblower knew how to temper the glass for durability.",
            "sent3": "The chef had to temper the chocolate for the dessert.",
            "sent4": "The swordsmith carefully tempered the blade for battle.",
            "sent5": "The potter learned to temper the clay for better shaping."
        },
        {
            "definition": "a particular state of mind or mood",
            "pos": "noun",
            "sent1": "Her cheerful temper brightened up the room.",
            "sent2": "The somber temper of the funeral weighed heavily on everyone.",
            "sent3": "The festive temper of the party put everyone in a good mood.",
            "sent4": "The mysterious temper of the movie kept the audience intrigued.",
            "sent5": "The peaceful temper of the garden was a welcome escape."
        }
    ]
}