{
    "term": "temperatures",
    "meanings": [
        {
            "definition": "The degree or intensity of heat present in a substance or object.",
            "pos": "noun",
            "sent1": "During summer, the temperatures can get very high, making it uncomfortable to be outside.",
            "sent2": "The temperatures dropped suddenly, causing everyone to bundle up in warm clothes.",
            "sent3": "The ice cream started melting due to the high temperatures outside, creating a sticky mess.",
            "sent4": "Her anger rose to boiling temperatures as she realized her phone was missing.",
            "sent5": "The scorching temperatures of the desert made it feel like walking on hot coals."
        },
        {
            "definition": "The level of excitement or anger exhibited by a person.",
            "pos": "noun",
            "sent1": "His face lit up with excitement as the temperatures of the crowd rose during the concert.",
            "sent2": "The temperatures in the room reached a peak when the surprise guest arrived.",
            "sent3": "The temperatures of the audience soared when the magician pulled a rabbit out of his hat.",
            "sent4": "Her excitement reached fever temperatures when she won the lottery.",
            "sent5": "The temperatures of the party guests skyrocketed when the DJ played their favorite song."
        },
        {
            "definition": "The act of moderating or adjusting something, such as a reaction or behavior.",
            "pos": "noun",
            "sent1": "She tried to control her temperatures when her friend accidentally broke her favorite mug.",
            "sent2": "The teacher's temperatures were tested when the students kept talking during the lesson.",
            "sent3": "His temperatures went haywire when he saw the surprise birthday cake waiting for him.",
            "sent4": "The coach's temperatures cooled down after the team won the championship.",
            "sent5": "The manager's temperatures rose as he tried to handle the difficult customer complaint."
        }
    ]
}