{
    "term": "temps",
    "meanings": [
        {
            "definition": "Temporary workers",
            "pos": "noun",
            "sent1": "The company hired temps to help during the busy season.",
            "sent2": "The temps at the office are always friendly and hardworking.",
            "sent3": "The temps joked around during their break, lightening the mood.",
            "sent4": "The temps were like a breath of fresh air in the workplace.",
            "sent5": "The temps quickly adapted to their new roles, impressing everyone."
        },
        {
            "definition": "Temperature",
            "pos": "noun",
            "sent1": "The high temps in summer make it unbearable to be outside for long.",
            "sent2": "Check the temps outside before deciding what to wear.",
            "sent3": "The temps in the room were so cold that everyone shivered.",
            "sent4": "The rising temps signaled the start of spring.",
            "sent5": "The temps in the oven were just right for baking the cake."
        },
        {
            "definition": "Temporary employment",
            "pos": "noun",
            "sent1": "She found a job through temps while looking for permanent work.",
            "sent2": "Many companies rely on temps to fill short-term positions.",
            "sent3": "The temps enjoyed the flexibility of temporary employment.",
            "sent4": "Temp agencies help match individuals with temporary employment opportunities.",
            "sent5": "The temps appreciated the chance to gain experience through temporary employment."
        },
        {
            "definition": "Temporary in nature",
            "pos": "adjective",
            "sent1": "The snow was only a temp fix for the leaky roof.",
            "sent2": "His anger was just a temp reaction to the situation.",
            "sent3": "The temp solution worked for now, but a permanent fix was needed.",
            "sent4": "Her happiness was only temp, fading quickly after the news.",
            "sent5": "The temp relief from the heat was short-lived as the sun came out again."
        }
    ]
}