{
    "term": "temporal",
    "meanings": [
        {
            "definition": "Relating to time",
            "pos": "adjective",
            "sent1": "The temporal changes in weather affect our daily plans.",
            "sent2": "The temporal nature of seasons brings about different activities.",
            "sent3": "His temporal jokes about time always make us laugh.",
            "sent4": "The temporal flow of moments is like a river that never stops.",
            "sent5": "She painted a vivid picture of the temporal progression of history."
        },
        {
            "definition": "Lasting for a limited time",
            "pos": "adjective",
            "sent1": "The temporal relief from pain was short-lived.",
            "sent2": "The temporal joy of the holiday season fills our hearts.",
            "sent3": "Their temporal excitement over the new toy was contagious.",
            "sent4": "The temporal burst of colors in the sunset was breathtaking.",
            "sent5": "The temporal fireworks display lit up the night sky beautifully."
        },
        {
            "definition": "Of or relating to worldly as opposed to spiritual affairs",
            "pos": "adjective",
            "sent1": "His temporal concerns were focused on financial success.",
            "sent2": "The temporal pleasures of material possessions are fleeting.",
            "sent3": "She made a temporal decision to prioritize work over relaxation.",
            "sent4": "The temporal distractions of everyday life can cloud our minds.",
            "sent5": "The temporal pursuits of fame often lead to emptiness."
        },
        {
            "definition": "A temporal ruler or leader",
            "pos": "noun",
            "sent1": "The temporal oversaw the construction of the new bridge.",
            "sent2": "The temporal's decisions impacted the entire kingdom.",
            "sent3": "The temporal's grand entrance was met with cheers and applause.",
            "sent4": "The temporal's authority extended over the entire region.",
            "sent5": "The temporal's reign was marked by peace and prosperity."
        }
    ]
}