{
    "term": "temped",
    "meanings": [
        {
            "definition": "To entice or persuade someone to do something, especially something morally wrong or unwise.",
            "pos": "verb",
            "sent1": "She temped her friend to skip school and go to the mall instead.",
            "sent2": "The salesman temped the customer with a special discount to make a purchase.",
            "sent3": "He temped his sister to sneak out of the house to join him for a late-night adventure.",
            "sent4": "The forbidden treasure temped the explorer to break the rules and take it.",
            "sent5": "The delicious aroma of the freshly baked cookies temped her to indulge in a few more."
        },
        {
            "definition": "To test or try someone's patience or resolve.",
            "pos": "verb",
            "sent1": "The long line at the store temped her patience, but she remained calm.",
            "sent2": "The challenging puzzle temped his resolve, but he refused to give up.",
            "sent3": "The mischievous puppy temped the owner's patience by chewing on the furniture.",
            "sent4": "The storm temped the old tree's resolve, but it stood strong against the wind.",
            "sent5": "The tempting offer temped her resolve to stick to her diet, but she resisted the temptation."
        },
        {
            "definition": "To offer something desirable to someone in order to persuade them to do something.",
            "pos": "verb",
            "sent1": "The company temped the candidate with a generous salary to join their team.",
            "sent2": "She temped her friend with a movie ticket to help her with the homework.",
            "sent3": "The teacher temped the students with extra credit to encourage them to study harder.",
            "sent4": "The restaurant temped the customers with a free dessert to entice them to return.",
            "sent5": "The recruiter temped the job seekers with promising career opportunities to attend the event."
        }
    ]
}