{
    "term": "tenaculums",
    "meanings": [
        {
            "definition": "A surgical instrument with sharp hooks for grasping and holding tissues.",
            "pos": "noun",
            "sent1": "During the surgery, the doctor used tenaculums to carefully hold the delicate tissue.",
            "sent2": "The nurse handed the tenaculums to the surgeon to assist in the procedure.",
            "sent3": "The tenaculums decided to take up knitting as a hobby, but they kept poking holes in the yarn.",
            "sent4": "Her words were like tenaculums, piercing through his defenses and revealing the truth.",
            "sent5": "The tenaculums gleamed under the bright lights of the operating room, ready for precision work."
        },
        {
            "definition": "A structure in certain animals used for grasping or holding prey.",
            "pos": "noun",
            "sent1": "The spider's tenaculums swiftly captured the unsuspecting insect for its meal.",
            "sent2": "The bird's tenaculums were strong and agile, allowing it to catch fish from the water.",
            "sent3": "The octopus used its tenaculums to give the crab a friendly hug, but the crab didn't appreciate it.",
            "sent4": "Her embrace felt like the gentle touch of tenaculums, holding him close yet free.",
            "sent5": "The tenaculums of the Venus flytrap snapped shut, trapping the curious fly inside."
        },
        {
            "definition": "A tool with sharp points for picking up small objects.",
            "pos": "noun",
            "sent1": "She used the tenaculums to carefully pick up the tiny bead from the floor.",
            "sent2": "The jeweler's tenaculums were essential for handling the delicate gemstones.",
            "sent3": "The mischievous kitten batted at the tenaculums, trying to catch the shiny tips.",
            "sent4": "His words were like tenaculums, deftly selecting the most important details from the conversation.",
            "sent5": "The archaeologist carefully excavated the ancient artifacts with the help of his trusty tenaculums."
        }
    ]
}