{
    "term": "tender",
    "meanings": [
        {
            "definition": "Showing gentleness or kindness",
            "pos": "adjective",
            "sent1": "The nurse was very tender with the newborn baby.",
            "sent2": "She had a tender heart and always helped those in need.",
            "sent3": "The big tough guy surprised everyone by showing a tender side to his pet kitten.",
            "sent4": "Her tender words wrapped around him like a warm blanket on a cold night.",
            "sent5": "The tender smile on her face made everyone feel welcome."
        },
        {
            "definition": "Offer or present for acceptance",
            "pos": "verb",
            "sent1": "He decided to tender his resignation to the company.",
            "sent2": "They will tender their proposal at the upcoming meeting.",
            "sent3": "The magician will tender his amazing tricks for the audience's amazement.",
            "sent4": "She will tender her love to him in a heartfelt letter.",
            "sent5": "The chef will tenderly present the dish to the food critic."
        },
        {
            "definition": "Easily broken or cut",
            "pos": "adjective",
            "sent1": "The tender flower petals fell with a gentle breeze.",
            "sent2": "The tender skin of the fruit indicated its ripeness.",
            "sent3": "The delicate fabric was so tender that it tore easily.",
            "sent4": "The tender branches of the tree swayed in the wind.",
            "sent5": "The tender leaves crunched underfoot as they walked through the forest."
        },
        {
            "definition": "Sensitive to pain",
            "pos": "adjective",
            "sent1": "His tender knee throbbed after the fall.",
            "sent2": "She winced as the dentist touched her tender gums.",
            "sent3": "The tender spot on his arm made him yelp when touched.",
            "sent4": "The tender area on her back made her wince with every movement.",
            "sent5": "The tender bruise on his leg made it difficult to walk."
        },
        {
            "definition": "Legal currency",
            "pos": "noun",
            "sent1": "He paid for the goods with a stack of tender.",
            "sent2": "The cashier counted the tender in the register at the end of the day.",
            "sent3": "The thief tried to steal the bag of tender from the bank.",
            "sent4": "The vending machine only accepted exact change in tender.",
            "sent5": "She exchanged her foreign currency for local tender at the airport."
        }
    ]
}