{
    "term": "tens",
    "meanings": [
        {
            "definition": "The numbers 10 through 19.",
            "pos": "noun",
            "sent1": "In the math class, the students learned about tens and ones.",
            "sent2": "She counted the tens on her fingers, starting from ten.",
            "sent3": "At the store, they only had tens of apples left, causing a rush to buy them.",
            "sent4": "The tens of stars in the night sky twinkled brightly above.",
            "sent5": "The jar contained tens of marbles, each a different color."
        },
        {
            "definition": "A group or set of ten.",
            "pos": "noun",
            "sent1": "The teacher divided the students into groups of tens for the activity.",
            "sent2": "He bought a pack of tens of pencils for the art project.",
            "sent3": "The tens of ducks waddled together in the park, amusing the visitors.",
            "sent4": "The tens of flowers in the garden bloomed beautifully in the spring.",
            "sent5": "She collected tens of seashells along the shore during her vacation."
        },
        {
            "definition": "A playing card with a value of ten.",
            "pos": "noun",
            "sent1": "During the game, she drew a tens from the deck and smiled.",
            "sent2": "He placed the tens on the table, ready to play his hand.",
            "sent3": "The tens of hearts card made him chuckle as he laid it down.",
            "sent4": "She held the tens of spades tightly, hoping for a winning hand.",
            "sent5": "The tens of diamonds sparkled in the dim light of the room."
        },
        {
            "definition": "A score of ten in a game or competition.",
            "pos": "noun",
            "sent1": "She celebrated when she achieved a perfect tens in the gymnastics routine.",
            "sent2": "The player received tens for their flawless performance on the field.",
            "sent3": "The judge's decision to give him tens caused a wave of excitement in the crowd.",
            "sent4": "Scoring tens in the final round secured their victory in the competition.",
            "sent5": "The team's effort earned them tens across the board, leading to a well-deserved win."
        }
    ]
}