{
    "term": "tensiometer",
    "meanings": [
        {
            "definition": "A device used to measure surface tension.",
            "pos": "noun",
            "sent1": "The scientist used a tensiometer to check the surface tension of the water.",
            "sent2": "The tensiometer helped the researcher understand how strong the surface tension of the liquid was.",
            "sent3": "When the tensiometer started beeping, it was like the water was talking back!",
            "sent4": "The tensiometer was like a detective, uncovering the secrets of the liquid's surface tension.",
            "sent5": "With the tensiometer, the surface tension of the liquid became as clear as day."
        },
        {
            "definition": "A tool used to measure the tension in a material.",
            "pos": "noun",
            "sent1": "The engineer relied on the tensiometer to assess the tension in the metal beam.",
            "sent2": "Using the tensiometer, the technician determined the exact tension within the fabric.",
            "sent3": "The tensiometer seemed to whisper the tension levels of the material to the user.",
            "sent4": "The tensiometer acted like a magician, revealing the hidden tension within the material.",
            "sent5": "Through the tensiometer, the tension in the material was palpable."
        },
        {
            "definition": "An instrument used to determine the tension in a liquid.",
            "pos": "noun",
            "sent1": "The tensiometer was crucial in finding out the tension in the liquid sample.",
            "sent2": "With the help of the tensiometer, the team measured the tension in the liquid accurately.",
            "sent3": "The tensiometer made the tension in the liquid seem like a fun puzzle to solve.",
            "sent4": "Like a skilled artist, the tensiometer painted a picture of the liquid's tension.",
            "sent5": "Thanks to the tensiometer, the tension in the liquid was crystal clear."
        }
    ]
}