{
    "term": "tepoys",
    "meanings": [
        {
            "definition": "A type of litter or palanquin used in India.",
            "pos": "noun",
            "sent1": "The tepoys carried the royal family through the crowded streets.",
            "sent2": "The travelers rested comfortably in the tepoys as they were carried by the bearers.",
            "sent3": "The tepoys lined up neatly, waiting to transport the guests to the wedding venue.",
            "sent4": "The tepoys stood like loyal servants, ready to bear the weight of their passengers.",
            "sent5": "The ornate design of the tepoys made them a symbol of luxury and status in ancient India."
        },
        {
            "definition": "A type of tent used in India.",
            "pos": "noun",
            "sent1": "The tepoys provided shelter for the nomadic tribe during the monsoon season.",
            "sent2": "Families gathered around the campfire inside the tepoys, sharing stories and laughter.",
            "sent3": "The colorful tepoys fluttered in the wind, creating a vibrant scene in the desert.",
            "sent4": "The tepoys resembled giant mushrooms sprouting in the vast expanse of the valley.",
            "sent5": "The intricate patterns on the tepoys reflected the rich cultural heritage of the region."
        },
        {
            "definition": "A type of carriage used in India.",
            "pos": "noun",
            "sent1": "The tepoys rolled smoothly along the cobblestone streets, carrying the dignitaries to the palace.",
            "sent2": "The grand procession featured beautifully decorated tepoys, adding a touch of elegance to the event.",
            "sent3": "The mischievous children played hide-and-seek behind the tepoys, giggling uncontrollably.",
            "sent4": "The tepoys glided through the city like graceful swans, drawing admiring glances from the onlookers.",
            "sent5": "The tinkling bells attached to the tepoys created a melodious soundtrack as they traveled through the countryside."
        }
    ]
}