{
    "term": "tergiversation",
    "meanings": [
        {
            "definition": "The act of changing sides or betraying a cause.",
            "pos": "noun",
            "sent1": "His tergiversation from one political party to another left many people feeling betrayed.",
            "sent2": "The politician's tergiversation on the issue made it hard for voters to trust him.",
            "sent3": "The tergiversation of the character in the movie kept the audience guessing until the end.",
            "sent4": "Her tergiversation between two best friends was like a seesaw of loyalty.",
            "sent5": "The tergiversation of the spy added an element of suspense to the novel."
        },
        {
            "definition": "Evasion of straightforward action or clear-cut statement.",
            "pos": "noun",
            "sent1": "The suspect's tergiversation during questioning raised suspicions.",
            "sent2": "Her constant tergiversation made it difficult to have a productive conversation with her.",
            "sent3": "The student's tergiversation about completing the assignment was met with a stern warning from the teacher.",
            "sent4": "The CEO's tergiversation in addressing the company's financial issues only worsened the situation.",
            "sent5": "The politician's tergiversation on the controversial topic only fueled public distrust."
        },
        {
            "definition": "A shifting or changing of one's loyalties or opinions.",
            "pos": "noun",
            "sent1": "The tergiversation of the employee from loyal team player to troublemaker was unexpected.",
            "sent2": "His tergiversation on the matter showed a lack of firm beliefs.",
            "sent3": "The tergiversation of the weather forecast kept everyone guessing about what to wear.",
            "sent4": "Her tergiversation between two career paths reflected her indecisiveness.",
            "sent5": "The tergiversation of public opinion on the issue highlighted the complexity of the matter."
        }
    ]
}