{
    "term": "ternate",
    "meanings": [
        {
            "definition": "Consisting of three parts or arranged in threes.",
            "pos": "adjective",
            "sent1": "The ternate pattern on the rug featured three distinct colors.",
            "sent2": "The necklace had a ternate design with three small pendants hanging from it.",
            "sent3": "The ternate cupcakes were a hit at the party, each one topped with three different sprinkles.",
            "sent4": "Her ternate approach to problem-solving always involved considering three different perspectives.",
            "sent5": "The ternate arrangement of chairs in the waiting room made it easy for groups of three to sit together."
        },
        {
            "definition": "A plant with leaves or leaflets in groups of three.",
            "pos": "noun",
            "sent1": "The garden featured a beautiful ternate with three vibrant green leaves on each stem.",
            "sent2": "The botanist identified the ternate by the distinctive grouping of three leaves on each branch.",
            "sent3": "The mischievous squirrel enjoyed rearranging the ternate leaves into different patterns.",
            "sent4": "The ternate in the forest stood out with its unique trio of leaves, catching the sunlight.",
            "sent5": "The ternate plant in the classroom was a favorite subject for the biology students to study."
        },
        {
            "definition": "A type of bird in the genus Sterna.",
            "pos": "noun",
            "sent1": "The ternate gracefully soared over the ocean, diving to catch fish with precision.",
            "sent2": "Birdwatchers gathered to observe the ternate nesting along the shore during mating season.",
            "sent3": "The ternate's distinctive call echoed through the cliffs, signaling the arrival of spring.",
            "sent4": "The ternate's wings shimmered in the sunlight as it glided effortlessly through the sky.",
            "sent5": "Children marveled at the ternate's ability to dive into the water and emerge with a fish in its beak."
        }
    ]
}