{
    "term": "terrorised",
    "meanings": [
        {
            "definition": "Cause extreme fear or anxiety in (someone).",
            "pos": "verb",
            "sent1": "The loud thunder terrorised the little dog, making it hide under the bed.",
            "sent2": "The horror movie terrorised the audience, causing many to cover their eyes in fear.",
            "sent3": "The prankster decided to terrorise his friends by jumping out and yelling 'Boo!'",
            "sent4": "The haunted house terrorised visitors with its eerie sounds and dark corridors.",
            "sent5": "The sudden appearance of a spider on her shoulder terrorised her beyond belief."
        },
        {
            "definition": "Inflict severe fear or terror upon (someone).",
            "pos": "verb",
            "sent1": "The masked robber terrorised the bank customers by waving a gun and demanding money.",
            "sent2": "The ghost stories told around the campfire terrorised the children, making them huddle closer together.",
            "sent3": "The mischievous cat terrorised the neighborhood by stealing everyone's socks and hiding them in bushes.",
            "sent4": "The storm terrorised the coastal town with its powerful winds and crashing waves.",
            "sent5": "The evil villain terrorised the city, leaving a trail of destruction in his wake."
        },
        {
            "definition": "Subject (someone) to acts of terrorism.",
            "pos": "verb",
            "sent1": "The innocent civilians were terrorised by the extremist group's bombing campaign.",
            "sent2": "The government took swift action to protect its citizens from being terrorised by radical threats.",
            "sent3": "The spy novel's plot twist involved a secret agent being terrorised by a rogue terrorist cell.",
            "sent4": "The peaceful village was terrorised by a series of unexpected attacks, leaving the residents in shock.",
            "sent5": "The international community united to support countries that were being terrorised by terrorist organizations."
        }
    ]
}