{
    "term": "territorialism",
    "meanings": [
        {
            "definition": "The behavior of defending a territory against intruders.",
            "pos": "noun",
            "sent1": "The cat's territorialism was evident when it hissed at the neighbor's dog.",
            "sent2": "The territorialism of the lion was clear as it roared to warn other predators.",
            "sent3": "The territorialism of the squirrel led to a comical chase around the backyard.",
            "sent4": "His territorialism was like a fortress protecting his land from any trespassers.",
            "sent5": "The territorialism of the bear was so fierce that no other animal dared to approach."
        },
        {
            "definition": "A belief in the importance of maintaining control over a specific area.",
            "pos": "noun",
            "sent1": "Her territorialism made her fiercely protective of her garden.",
            "sent2": "The king's territorialism extended to every corner of his kingdom.",
            "sent3": "The territorialism of the farmer over his crops was both amusing and endearing.",
            "sent4": "The territorialism of the CEO over the company was unwavering and absolute.",
            "sent5": "The territorialism of the child over their toys was a sight to behold."
        },
        {
            "definition": "The practice of marking or claiming a specific territory as one's own.",
            "pos": "noun",
            "sent1": "The bird's territorialism was evident in the way it sang to mark its territory.",
            "sent2": "The territorialism of the wolf was displayed through its howls echoing in the night.",
            "sent3": "The territorialism of the artist over their workspace led to a masterpiece.",
            "sent4": "Her territorialism over the garden was like a painter claiming their canvas.",
            "sent5": "The territorialism of the explorer over uncharted lands was both daring and inspiring."
        }
    ]
}