{
    "term": "territorial",
    "meanings": [
        {
            "definition": "Relating to territory or land.",
            "pos": "adjective",
            "sent1": "The territorial boundaries were clearly marked with fences.",
            "sent2": "The animals displayed territorial behavior by marking their area with scent.",
            "sent3": "The territorial dispute between the two neighbors over the property line led to a funny misunderstanding.",
            "sent4": "Her love for gardening was so territorial, it was as if she was protecting a precious treasure.",
            "sent5": "The territorial nature of the cat made it fiercely guard its favorite spot on the couch."
        },
        {
            "definition": "Showing a strong desire to defend or protect one's territory.",
            "pos": "adjective",
            "sent1": "The dog's territorial instincts kicked in when a stranger approached the house.",
            "sent2": "The alpha wolf displayed territorial behavior to protect the pack.",
            "sent3": "The territorial attitude of the squirrel towards its nut stash was quite amusing to watch.",
            "sent4": "His territorial nature towards his workspace made it clear he didn't like anyone touching his things.",
            "sent5": "The territorial response of the mother bear to protect her cubs was both fierce and admirable."
        },
        {
            "definition": "Of or relating to a specific territory or region.",
            "pos": "adjective",
            "sent1": "The territorial governor was responsible for overseeing the affairs of the region.",
            "sent2": "The territorial boundaries of the national park were clearly defined on the map.",
            "sent3": "The territorial rivalry between the two sports teams added an interesting dynamic to the game.",
            "sent4": "Her territorial pride in her hometown was evident in the way she spoke about its history.",
            "sent5": "The territorial disputes between the neighboring countries often led to tense diplomatic negotiations."
        }
    ]
}