{
    "term": "territorializations",
    "meanings": [
        {
            "definition": "The act of establishing or marking a territory.",
            "pos": "noun",
            "sent1": "The territorializations of the animals were evident by the markings on the trees.",
            "sent2": "The territorializations of different countries often lead to conflicts over land.",
            "sent3": "The territorializations of the squirrels in the park sometimes led to comical chases.",
            "sent4": "The territorializations of the rival gangs created invisible boundaries in the city.",
            "sent5": "The territorializations of the ancient tribes were etched into the landscape for centuries."
        },
        {
            "definition": "The process of claiming or controlling a specific area.",
            "pos": "noun",
            "sent1": "The territorializations of the company expanded to neighboring towns.",
            "sent2": "The territorializations of the new government were met with mixed reactions from the citizens.",
            "sent3": "The territorializations of the children over the playground equipment led to playful arguments.",
            "sent4": "The territorializations of the ocean by the fishermen symbolized their livelihood.",
            "sent5": "The territorializations of the garden by the rabbits made it challenging for other animals to find food."
        },
        {
            "definition": "The formation of boundaries or borders within a space.",
            "pos": "noun",
            "sent1": "The territorializations of the property were clearly marked with fences.",
            "sent2": "The territorializations of the city districts helped in organizing urban planning.",
            "sent3": "The territorializations of the students in the classroom sometimes led to funny seating arrangements.",
            "sent4": "The territorializations of the garden beds created a colorful mosaic from above.",
            "sent5": "The territorializations of the national parks protected the diverse ecosystems within."
        }
    ]
}