{
    "term": "tesla",
    "meanings": [
        {
            "definition": "A unit of magnetic flux density equal to one weber per square meter.",
            "pos": "noun",
            "sent1": "The tesla of the magnet was so strong that it attracted all the nearby metal objects.",
            "sent2": "The scientist measured the magnetic field in tesla units to determine its strength.",
            "sent3": "The mischievous cat tried to catch the mouse using a tiny tesla magnet as a magic wand.",
            "sent4": "Her love for him was like a tesla, pulling her closer with an invisible force.",
            "sent5": "The tesla of the storm was so intense that it caused the compass to spin wildly."
        },
        {
            "definition": "A car brand specializing in electric vehicles.",
            "pos": "noun",
            "sent1": "The new tesla model impressed everyone with its sleek design and electric power.",
            "sent2": "Many people are excited about the latest tesla electric car release.",
            "sent3": "The kids pretended their toy car was a futuristic tesla zooming through space.",
            "sent4": "Her dream car was a tesla, symbolizing her commitment to sustainability.",
            "sent5": "Driving a tesla felt like stepping into the future with its advanced technology."
        },
        {
            "definition": "A measurement of the strength of a magnetic field.",
            "pos": "noun",
            "sent1": "The tesla reading on the device indicated a high level of magnetic field strength.",
            "sent2": "The scientist used a tesla meter to measure the magnetic field around the experiment.",
            "sent3": "The detective solved the case by following the trail of tesla readings left behind.",
            "sent4": "In her hands, the compass needle danced to the rhythm of the tesla's magnetic beat.",
            "sent5": "The tesla measurement showed that the magnetic field had intensified overnight."
        }
    ]
}