{
    "term": "tesseracts",
    "meanings": [
        {
            "definition": "A four-dimensional hypercube.",
            "pos": "noun",
            "sent1": "In the science fiction book, the characters traveled through tesseracts to reach other dimensions.",
            "sent2": "Mathematicians study the properties of tesseracts to understand higher dimensions.",
            "sent3": "The aliens stored their treasures in tesseracts, making it hard for humans to find them.",
            "sent4": "Her mind was like a tesseract, holding complex thoughts and ideas in perfect order.",
            "sent5": "The artist's painting depicted a mesmerizing tesseract floating in space."
        },
        {
            "definition": "A geometric figure with four dimensions.",
            "pos": "noun",
            "sent1": "The students marveled at the intricate design of the tesseract displayed in the math classroom.",
            "sent2": "Scientists use tesseracts to visualize shapes beyond our three-dimensional world.",
            "sent3": "The magician pulled a rabbit out of a tesseract, much to the audience's surprise.",
            "sent4": "Her love for him was as complex and mysterious as a tesseract.",
            "sent5": "The tesseract glowed with an otherworldly light, captivating all who gazed upon it."
        },
        {
            "definition": "A cube in four dimensions.",
            "pos": "noun",
            "sent1": "The architect designed a futuristic building inspired by the shape of a tesseract.",
            "sent2": "Exploring the concept of tesseracts challenges our understanding of space.",
            "sent3": "The treasure map led to a hidden room accessible only through a tesseract.",
            "sent4": "His thoughts expanded like a tesseract, encompassing multiple perspectives at once.",
            "sent5": "The tesseract hummed softly, emitting a strange energy that intrigued the scientists."
        }
    ]
}