{
    "term": "tet",
    "meanings": [
        {
            "definition": "Tet: a Hebrew letter",
            "pos": "noun",
            "sent1": "In Hebrew class, we learned about the letter tet.",
            "sent2": "The Torah contains the letter tet in its text.",
            "sent3": "The tet looked like a tiny house in the alphabet book.",
            "sent4": "The tet stood out among the other Hebrew letters like a lone tree in a field.",
            "sent5": "The tet's shape reminded me of a small window on a door."
        },
        {
            "definition": "Tet: a unit of weight in ancient Egypt",
            "pos": "noun",
            "sent1": "The merchant measured the gold using a tet.",
            "sent2": "Ancient Egyptians used tets to weigh precious stones.",
            "sent3": "The pharaoh's tomb had a room filled with tets for weighing treasures.",
            "sent4": "The tet balanced on the scale like a feather in the wind.",
            "sent5": "The tet's weight was as significant as a pyramid in the desert."
        },
        {
            "definition": "Tet: a type of African antelope",
            "pos": "noun",
            "sent1": "We spotted a tet grazing peacefully in the savanna.",
            "sent2": "The tet's graceful movements captivated the wildlife photographers.",
            "sent3": "The mischievous monkey tried to imitate the tet's elegant leaps.",
            "sent4": "The tet's horns curved like the branches of a baobab tree.",
            "sent5": "The tet's coat shimmered under the African sun like a golden river."
        },
        {
            "definition": "Tet: a type of Vietnamese noodle soup",
            "pos": "noun",
            "sent1": "I ordered a bowl of tet at the Vietnamese restaurant.",
            "sent2": "The aroma of the tet filled the air in the bustling market.",
            "sent3": "My friend slurped the tet noodles noisily, causing a few chuckles.",
            "sent4": "The steam rising from the tet bowl danced like morning mist over a lake.",
            "sent5": "The tet's flavors exploded in my mouth like fireworks on New Year's Eve."
        }
    ]
}