{
    "term": "tetanuses",
    "meanings": [
        {
            "definition": "Tetanuses: a disease caused by the bacterium Clostridium tetani, characterized by painful muscle contractions",
            "pos": "noun",
            "sent1": "He was hospitalized due to severe tetanuses in his muscles.",
            "sent2": "The doctor explained the symptoms of tetanuses to the worried patient.",
            "sent3": "The clown joked that his silly dance moves gave him imaginary tetanuses.",
            "sent4": "The grip of fear on her heart felt like the relentless tetanuses of a muscle spasm.",
            "sent5": "The image of the rusty nail triggered memories of his childhood tetanuses."
        },
        {
            "definition": "Tetanuses: the plural form of tetanus, a medical condition",
            "pos": "noun",
            "sent1": "The hospital treated multiple cases of tetanuses last month.",
            "sent2": "Doctors recommend vaccinations to prevent tetanuses.",
            "sent3": "The shelves were stocked with books on rare medical conditions like tetanuses.",
            "sent4": "In the crowded city, the spread of rumors was like a contagious tetanuses.",
            "sent5": "The news report highlighted the increasing cases of tetanuses in the region."
        },
        {
            "definition": "Tetanuses: a noun meaning the state of being affected by tetanus",
            "pos": "noun",
            "sent1": "His pale face showed the seriousness of his tetanuses.",
            "sent2": "The hospital ward was full of patients suffering from tetanuses.",
            "sent3": "The comedy show exaggerated the effects of tetanuses for laughs.",
            "sent4": "The tension in the room created a palpable sense of tetanuses.",
            "sent5": "The documentary shed light on the struggles of living with tetanuses."
        },
        {
            "definition": "Tetanuses: a verb meaning to contract tetanus",
            "pos": "verb",
            "sent1": "She feared that her wound might tetanuses if not treated promptly.",
            "sent2": "The rusty metal could tetanuses anyone who gets injured.",
            "sent3": "The idea of having to tetanuses from a simple cut worried him.",
            "sent4": "His careless actions could tetanuses a serious health issue.",
            "sent5": "The warning signs reminded people not to tetanuses from rusty objects."
        }
    ]
}