{
    "term": "tetanies",
    "meanings": [
        {
            "definition": "Tetanies: a condition characterized by prolonged and painful muscle contractions",
            "pos": "noun",
            "sent1": "After the accident, the doctor diagnosed him with tetanies due to his muscle contractions.",
            "sent2": "The athlete experienced tetanies in his legs after running a marathon.",
            "sent3": "The clown's exaggerated tetanies made everyone laugh during the circus performance.",
            "sent4": "Her fear of public speaking caused tetanies in her vocal cords, making it hard to speak.",
            "sent5": "The image of the snake charmer's flute mesmerized the cobra, causing it to go into tetanies."
        },
        {
            "definition": "Tetanies: the state of being affected by tetanus infection",
            "pos": "noun",
            "sent1": "Due to the rusty nail, he developed tetanies and had to get a tetanus shot.",
            "sent2": "The doctor confirmed her tetanies after examining the wound from the metal object.",
            "sent3": "The superhero's power was to resist any tetanies caused by dangerous toxins.",
            "sent4": "The old house had a mysterious aura, as if it was under the spell of tetanies.",
            "sent5": "The scientist studied the effects of tetanies on the body's nervous system for years."
        },
        {
            "definition": "Tetanies: a plural form of tetany, a medical condition involving muscle spasms and cramps",
            "pos": "noun",
            "sent1": "The hospital treated multiple patients with tetanies, all experiencing muscle spasms.",
            "sent2": "The yoga instructor helped her students prevent tetanies by teaching proper stretching techniques.",
            "sent3": "The dance routine was so intense that it caused tetanies in the performers' bodies.",
            "sent4": "The music had a hypnotic effect, inducing tetanies in the audience's muscles.",
            "sent5": "The hiker's dehydration led to tetanies in his legs, making it difficult to continue the trek."
        }
    ]
}