{
    "term": "tetrazolium",
    "meanings": [
        {
            "definition": "A chemical compound used in biological staining techniques to detect living cells.",
            "pos": "noun",
            "sent1": "The scientist used tetrazolium to find out which cells were alive.",
            "sent2": "The lab technician added tetrazolium to the sample to see if any cells were still active.",
            "sent3": "The tetrazolium seemed to have a magical power to reveal the living cells under the microscope.",
            "sent4": "The tetrazolium acted like a detective, uncovering the secrets of the living cells.",
            "sent5": "The bright red color of the tetrazolium made the living cells stand out clearly."
        },
        {
            "definition": "A type of redox indicator used in biochemical assays.",
            "pos": "noun",
            "sent1": "The scientist added tetrazolium to the solution to measure the redox reaction.",
            "sent2": "The lab equipment included tetrazolium for detecting changes in the biochemical process.",
            "sent3": "The tetrazolium in the test tube seemed to glow with excitement as the reaction took place.",
            "sent4": "The tetrazolium functioned like a traffic light, signaling the progress of the biochemical reaction.",
            "sent5": "The color change of the tetrazolium indicated the shift in the redox state of the solution."
        },
        {
            "definition": "A class of organic compounds containing a tetrazole ring structure.",
            "pos": "noun",
            "sent1": "The textbook explained the properties of tetrazolium compounds with ring structures.",
            "sent2": "Chemists study the characteristics of tetrazolium compounds due to their unique ring shape.",
            "sent3": "The tetrazolium molecules in the beaker seemed to dance around in their ring formation.",
            "sent4": "The tetrazolium rings intertwined like a complex puzzle, revealing their intricate nature.",
            "sent5": "The structure of the tetrazolium ring resembled a tiny, molecular carousel."
        }
    ]
}