{
    "term": "tetrad",
    "meanings": [
        {
            "definition": "A group or set of four.",
            "pos": "noun",
            "sent1": "The family of ducks waddled together in a tetrad.",
            "sent2": "She collected a tetrad of colorful seashells on the beach.",
            "sent3": "The tetrad of cupcakes disappeared quickly at the party.",
            "sent4": "The four friends formed a tetrad of support for each other.",
            "sent5": "The tetrad of trees stood tall in the forest, creating a harmonious group."
        },
        {
            "definition": "A group of four things.",
            "pos": "noun",
            "sent1": "The tetrad of pencils rolled off the desk.",
            "sent2": "He arranged a tetrad of books on the shelf.",
            "sent3": "The tetrad of kittens played together in the yard.",
            "sent4": "The four-leaf clover was a lucky tetrad for her.",
            "sent5": "The tetrad of flowers brightened up the room with their colors."
        },
        {
            "definition": "A period of four years.",
            "pos": "noun",
            "sent1": "She completed her degree in a tetrad of hard work.",
            "sent2": "The athlete trained for a tetrad to prepare for the competition.",
            "sent3": "The tetrad of high school passed by quickly for him.",
            "sent4": "The tetrad of seasons brought changes in nature.",
            "sent5": "The tetrad of Olympic Games showcased the world's best athletes."
        },
        {
            "definition": "A group of four related entities.",
            "pos": "noun",
            "sent1": "The tetrad of planets aligned perfectly in the sky.",
            "sent2": "The company consisted of a tetrad of sibling founders.",
            "sent3": "The tetrad of colors in the painting complemented each other.",
            "sent4": "The tetrad of elements formed a stable compound.",
            "sent5": "The tetrad of musicians played in perfect harmony during the concert."
        }
    ]
}