{
    "term": "tetragonal",
    "meanings": [
        {
            "definition": "Of, relating to, or having the form of a tetragon.",
            "pos": "adjective",
            "sent1": "The building had a tetragonal shape, with four equal sides.",
            "sent2": "The artist drew a tetragonal figure with four sides and four angles.",
            "sent3": "The cake was cut into a tetragonal shape, making it easy to share.",
            "sent4": "Her tetragonal earrings sparkled in the sunlight like tiny geometric stars.",
            "sent5": "The tetragonal pattern on the rug made the room feel organized and structured."
        },
        {
            "definition": "Having four sides and four angles; quadrilateral.",
            "pos": "adjective",
            "sent1": "The playground had a tetragonal sandbox for the children to play in.",
            "sent2": "She carefully measured the tetragonal garden bed before planting flowers.",
            "sent3": "The tetragonal pizza slices were perfect for the party guests.",
            "sent4": "His tetragonal face showed no emotion, like a stoic statue.",
            "sent5": "The tetragonal flag fluttered proudly in the breeze, symbolizing unity and strength."
        },
        {
            "definition": "Crystallography: Of or relating to a crystal system characterized by three axes of equal length at right angles to each other, with one axis longer or shorter than the other two.",
            "pos": "adjective",
            "sent1": "The scientist studied the tetragonal crystal structure under the microscope.",
            "sent2": "The jewelry store displayed a beautiful tetragonal gemstone necklace.",
            "sent3": "The tetragonal ice cube melted faster due to its elongated shape.",
            "sent4": "Her tetragonal personality traits made her stand out in a crowd.",
            "sent5": "The tetragonal reflection of the crystal in the sunlight was mesmerizing."
        }
    ]
}