{
    "term": "tetracaine",
    "meanings": [
        {
            "definition": "A local anesthetic drug used to numb the skin or mucous membranes.",
            "pos": "noun",
            "sent1": "The doctor applied tetracaine to numb the patient's skin before the procedure.",
            "sent2": "After the tetracaine was administered, the patient felt no pain during the surgery.",
            "sent3": "The tetracaine made the skin feel like a sleepy blanket, all cozy and warm.",
            "sent4": "Her voice was as numb as if it had been touched by tetracaine, lacking its usual sharpness.",
            "sent5": "The tetracaine worked like a magic cloak, shielding the nerves from any discomfort."
        },
        {
            "definition": "To apply tetracaine to a wound before suturing.",
            "pos": "verb",
            "sent1": "The nurse will tetracaine the wound to prepare it for stitching.",
            "sent2": "Remember to tetracaine the area before closing the wound with sutures.",
            "sent3": "He joked that he could tetracaine the whole room to make everyone numb to his bad jokes.",
            "sent4": "Her words tetracained the tension in the room, calming everyone down instantly.",
            "sent5": "The tetracaine action on the wound was like a gentle hug, easing the pain away."
        },
        {
            "definition": "The tetracaine injection provided immediate pain relief.",
            "pos": "noun",
            "sent1": "The quick tetracaine injection brought instant relief to the patient.",
            "sent2": "The nurse administered the tetracaine injection to alleviate the pain.",
            "sent3": "The tetracaine injection was like a superhero swooping in to save the day from pain villains.",
            "sent4": "His smile after the tetracaine injection was as bright as a sunny day after a storm.",
            "sent5": "The tetracaine injection danced through his veins, silencing the pain with each step."
        }
    ]
}