{
    "term": "tetrads",
    "meanings": [
        {
            "definition": "A group of four.",
            "pos": "noun",
            "sent1": "In the game, the team was divided into two tetrads for the final challenge.",
            "sent2": "The tetrads of students worked together to solve the math problem.",
            "sent3": "At the party, the tetrads of friends decided to play a game of charades.",
            "sent4": "The tetrads of colors on the artist's palette blended beautifully.",
            "sent5": "The tetrads of ducks waddled in a perfect formation."
        },
        {
            "definition": "A group of four things.",
            "pos": "noun",
            "sent1": "The tetrads of flowers in the garden added a pop of color.",
            "sent2": "She organized her pencils into neat tetrads on the desk.",
            "sent3": "The tetrads of ingredients in the recipe made a delicious dish.",
            "sent4": "The tetrads of books on the shelf were neatly arranged by genre.",
            "sent5": "The tetrads of clouds in the sky created a beautiful pattern."
        },
        {
            "definition": "A group of four individuals.",
            "pos": "noun",
            "sent1": "The tetrads of friends went on a hike together.",
            "sent2": "The tetrads of siblings played a game of tag in the backyard.",
            "sent3": "The tetrads of classmates formed study groups for the exam.",
            "sent4": "The tetrads of musicians performed a stunning quartet.",
            "sent5": "The tetrads of birds chirped harmoniously in the trees."
        },
        {
            "definition": "A group of four elements.",
            "pos": "noun",
            "sent1": "Chemistry class discussed the tetrads of the periodic table.",
            "sent2": "The tetrads of gases were studied in the lab experiment.",
            "sent3": "The tetrads of minerals in the rock sample were identified.",
            "sent4": "The tetrads of seasons brought changes in the weather.",
            "sent5": "The tetrads of planets aligned perfectly in the night sky."
        }
    ]
}