{
    "term": "tetrachords",
    "meanings": [
        {
            "definition": "A series of four notes in ancient Greek music theory.",
            "pos": "noun",
            "sent1": "In ancient Greek music, musicians often used tetrachords to create melodies.",
            "sent2": "The song followed a tetrachords pattern, with four distinct notes played in sequence.",
            "sent3": "The tetrachords in the music made the audience tap their feet in rhythm.",
            "sent4": "Her voice danced through the tetrachords like a bird soaring through the sky.",
            "sent5": "The tetrachords in the composition painted a vivid picture of ancient Greece."
        },
        {
            "definition": "A scale of four notes in music.",
            "pos": "noun",
            "sent1": "The beginner music class learned about tetrachords and how they form scales.",
            "sent2": "The tetrachords in the scale gave the music a unique and pleasant sound.",
            "sent3": "The tetrachords in the scale seemed to play hide and seek with the other notes.",
            "sent4": "His fingers moved swiftly across the piano, playing the tetrachords with precision.",
            "sent5": "The tetrachords in the scale were like building blocks, forming the foundation of the melody."
        },
        {
            "definition": "A group of four strings on a lyre or similar instrument.",
            "pos": "noun",
            "sent1": "The musician plucked the tetrachords on the lyre, producing a beautiful melody.",
            "sent2": "The tetrachords on the instrument were carefully tuned to create harmony.",
            "sent3": "The tetrachords on the lyre whispered secrets of ancient times to those who listened.",
            "sent4": "As he strummed the tetrachords, it felt like the instrument was telling a story.",
            "sent5": "The tetrachords on the lyre resonated through the room, filling it with enchanting music."
        }
    ]
}