{
    "term": "texases",
    "meanings": [
        {
            "definition": "Texas: a state in the southern US",
            "pos": "noun",
            "sent1": "Texases are known for their vast landscapes and warm weather.",
            "sent2": "I visited two texases last summer: one for the beaches and the other for the mountains.",
            "sent3": "The texases decided to have a barbecue to celebrate their state pride.",
            "sent4": "In her mind, the texases were like puzzle pieces forming a big picture of diversity.",
            "sent5": "The lone star flag proudly waved over the texases' gathering."
        },
        {
            "definition": "Texas: a card game",
            "pos": "noun",
            "sent1": "Let's play texases after dinner; it's always a fun game.",
            "sent2": "He shuffled the deck for a game of texases with his friends.",
            "sent3": "The texases game got so intense that they started cheering like at a sports event.",
            "sent4": "Playing texases felt like navigating through a maze of strategies and luck.",
            "sent5": "The sound of cards being dealt filled the room during their texases match."
        },
        {
            "definition": "Texas: to play the card game Texas",
            "pos": "verb",
            "sent1": "We will texases tonight if everyone is up for it.",
            "sent2": "Texases is a game that requires both skill and luck.",
            "sent3": "She texases every Friday night with her siblings for some friendly competition.",
            "sent4": "Texases can be quite addictive once you get the hang of it.",
            "sent5": "Texases brings people together for a night of laughter and rivalry."
        },
        {
            "definition": "Texas: to refer to multiple instances of the state Texas",
            "pos": "noun",
            "sent1": "The map showed texases marked with different colors for each region.",
            "sent2": "Texases have unique cultures depending on their location within the state.",
            "sent3": "The texases in the east have a different accent compared to those in the west.",
            "sent4": "She collected postcards from all texases she visited during her road trip.",
            "sent5": "Texases offer a variety of experiences from deserts to forests."
        }
    ]
}