{
    "term": "thens",
    "meanings": [
        {
            "definition": "At that time",
            "pos": "adverb",
            "sent1": "Thens, the sun was setting over the horizon.",
            "sent2": "We arrived at the park, and thens we saw a rainbow.",
            "sent3": "Thens, the cat decided to take a nap in the sun.",
            "sent4": "The old clock chimed, and thens the memories flooded back.",
            "sent5": "Thens, the stars twinkled in the night sky like diamonds."
        },
        {
            "definition": "In that case",
            "pos": "adverb",
            "sent1": "If you forget your umbrella, thens you might get wet in the rain.",
            "sent2": "Thens, we should leave early to avoid traffic.",
            "sent3": "He forgot his lunch, thens he had to buy food from the cafeteria.",
            "sent4": "In that case, thens we need to find an alternative solution.",
            "sent5": "Thens, we will have to reschedule the meeting if she can't make it."
        },
        {
            "definition": "In addition",
            "pos": "adverb",
            "sent1": "She brought cookies to the party, and thens she also made cupcakes.",
            "sent2": "I finished my homework, and thens I cleaned my room.",
            "sent3": "He packed his bag for the trip, and thens he remembered his camera.",
            "sent4": "The movie was entertaining, and thens it had a surprising plot twist.",
            "sent5": "The garden was beautiful, and thens it had a peaceful fountain."
        },
        {
            "definition": "Therefore",
            "pos": "adverb",
            "sent1": "She studied hard for the test, thens she aced it.",
            "sent2": "He saved money every month, thens he could afford a new car.",
            "sent3": "The weather forecast predicted rain, thens she brought an umbrella.",
            "sent4": "He missed the train, thens he arrived late to the meeting.",
            "sent5": "The recipe called for baking soda, thens she used baking powder instead."
        }
    ]
}