{
    "term": "theocentricities",
    "meanings": [
        {
            "definition": "Theocentricities - the belief in a God-centered universe",
            "pos": "noun",
            "sent1": "Her theocentricities guided her every decision, always considering the divine in all things.",
            "sent2": "The community's theocentricities were evident in their daily prayers and rituals.",
            "sent3": "His theocentricities were so strong that he joked about consulting the heavens for weather forecasts.",
            "sent4": "The artist's work reflected theocentricities, with each painting a window into the spiritual realm.",
            "sent5": "Theocentricities colored her worldview, seeing everything through a lens of divine purpose."
        },
        {
            "definition": "Theocentricities - actions or beliefs centered around a deity",
            "pos": "noun",
            "sent1": "Their theocentricities led them to build temples and offer sacrifices in honor of their gods.",
            "sent2": "In ancient civilizations, theocentricities shaped laws and customs to align with the will of the gods.",
            "sent3": "The town's theocentricities were so strong that even the market vendors offered prayers before opening shop.",
            "sent4": "Theocentricities intertwined with daily life, influencing everything from food choices to social interactions.",
            "sent5": "Theocentricities inspired great acts of charity and kindness towards fellow believers."
        },
        {
            "definition": "Theocentricities - the state of being focused on divine matters",
            "pos": "noun",
            "sent1": "His theocentricities were evident in his constant contemplation of spiritual teachings.",
            "sent2": "The monastery fostered theocentricities among its monks, encouraging deep reflection on sacred texts.",
            "sent3": "Even in the midst of chaos, her theocentricities kept her calm and centered on higher truths.",
            "sent4": "The poet's verses were filled with theocentricities, exploring the mysteries of faith and existence.",
            "sent5": "Theocentricities brought a sense of peace and purpose to her life, anchoring her in times of uncertainty."
        }
    ]
}