{
    "term": "theocracy",
    "meanings": [
        {
            "definition": "A system of government in which priests rule in the name of God.",
            "pos": "noun",
            "sent1": "In a theocracy, priests have the power to make decisions based on religious beliefs.",
            "sent2": "The theocracy in that country is led by religious leaders who enforce laws based on their faith.",
            "sent3": "The theocracy decided to ban certain foods, making everyone follow strict dietary rules.",
            "sent4": "Living under a theocracy can feel like being constantly watched by divine eyes, guiding every action.",
            "sent5": "Theocracy creates a society where religious figures hold both spiritual and political authority."
        },
        {
            "definition": "A state governed by religious law.",
            "pos": "noun",
            "sent1": "The theocracy's laws are all based on religious teachings, shaping every aspect of life.",
            "sent2": "People in a theocracy must abide by religious laws in their daily activities.",
            "sent3": "In the theocracy, even traffic rules are influenced by religious scriptures.",
            "sent4": "Living in a theocracy means following laws that are believed to be directly from a higher power.",
            "sent5": "Theocracy ensures that every law is rooted in religious principles, guiding society's behavior."
        },
        {
            "definition": "The belief in government by divine guidance.",
            "pos": "noun",
            "sent1": "The theocracy's followers trust that their leaders are chosen by divine forces.",
            "sent2": "Belief in theocracy means relying on spiritual guidance for political decisions.",
            "sent3": "Some may find it amusing to think that theocracy involves angels whispering laws to rulers.",
            "sent4": "In a metaphorical sense, theocracy can be seen as a celestial hand guiding the nation's fate.",
            "sent5": "Theocracy paints a vivid picture of leaders receiving instructions directly from the heavens."
        }
    ]
}