{
    "term": "theocentric",
    "meanings": [
        {
            "definition": "Relating to or centered on God.",
            "pos": "adjective",
            "sent1": "The theocentric teachings emphasized the importance of God in all aspects of life.",
            "sent2": "The church's theocentric beliefs guided its members in their daily actions.",
            "sent3": "The theocentric approach to problem-solving involved seeking divine intervention in all matters.",
            "sent4": "Her theocentric worldview painted a picture of a benevolent and omnipotent God.",
            "sent5": "The theocentric perspective illuminated the path to spiritual enlightenment."
        },
        {
            "definition": "Having God as the central focus.",
            "pos": "adjective",
            "sent1": "Their theocentric worship services were filled with prayers and hymns dedicated to God.",
            "sent2": "The artist's theocentric paintings depicted scenes from religious texts.",
            "sent3": "The theocentric party decorations included images of angels and crosses.",
            "sent4": "In her theocentric dreams, she felt the presence of a divine being watching over her.",
            "sent5": "The theocentric architecture of the cathedral inspired awe and reverence in visitors."
        },
        {
            "definition": "Characterized by a focus on God.",
            "pos": "adjective",
            "sent1": "The theocentric philosophy encouraged individuals to seek spiritual fulfillment above all else.",
            "sent2": "The theocentric literature of the time explored themes of faith and devotion.",
            "sent3": "His theocentric jokes always involved puns about angels and miracles.",
            "sent4": "The theocentric music resonated with listeners, evoking feelings of peace and serenity.",
            "sent5": "The theocentric rituals of the ceremony brought a sense of sacredness to the occasion."
        }
    ]
}