{
    "term": "theodolites",
    "meanings": [
        {
            "definition": "An optical instrument used for measuring angles in surveying and navigation.",
            "pos": "noun",
            "sent1": "Surveyors rely on theodolites to determine angles accurately.",
            "sent2": "The construction team brought theodolites to the site for precise measurements.",
            "sent3": "During the treasure hunt, the pirates argued over how to use the theodolites.",
            "sent4": "Her eyes were theodolites, scanning the horizon for any sign of land.",
            "sent5": "The theodolites gleamed in the sunlight, ready to assist in the surveying task."
        },
        {
            "definition": "Theodolites are commonly used in construction and engineering projects.",
            "pos": "noun",
            "sent1": "Engineers rely on theodolites to ensure accurate measurements on the site.",
            "sent2": "The theodolites were essential tools for the bridge construction project.",
            "sent3": "Theodolites became the stars of the construction site, admired by all workers.",
            "sent4": "His mind worked like theodolites, carefully calculating every detail of the project.",
            "sent5": "The theodolites hummed with precision, guiding the engineers in their work."
        },
        {
            "definition": "Surveyors use theodolites to measure horizontal and vertical angles.",
            "pos": "noun",
            "sent1": "The surveyors adjusted the theodolites to measure the angles accurately.",
            "sent2": "Using theodolites, surveyors can determine both horizontal and vertical angles.",
            "sent3": "The theodolites played a game of angles, trying to outsmart the compass.",
            "sent4": "Her mind was a theodolite, always seeking the right perspective on things.",
            "sent5": "The theodolites whispered secrets of angles, guiding the surveyors in their work."
        }
    ]
}