{
    "term": "theocratic",
    "meanings": [
        {
            "definition": "Relating to a system of government in which priests rule in the name of God.",
            "pos": "adjective",
            "sent1": "The theocratic society was governed by priests who claimed to act on behalf of God.",
            "sent2": "The theocratic leaders made decisions based on religious beliefs.",
            "sent3": "In the theocratic community, even the smallest decisions were made with divine guidance.",
            "sent4": "The theocratic rule was as absolute as the word of God.",
            "sent5": "Living in a theocratic state meant following religious laws above all else."
        },
        {
            "definition": "Of or relating to a government controlled by religious leaders.",
            "pos": "adjective",
            "sent1": "The theocratic government was influenced by the beliefs of religious leaders.",
            "sent2": "People in the theocratic regime looked to religious figures for guidance.",
            "sent3": "The theocratic council met to discuss matters of both faith and governance.",
            "sent4": "The influence of the theocratic leaders extended beyond politics.",
            "sent5": "Being part of a theocratic system meant following the teachings of the religious authorities."
        },
        {
            "definition": "Characterized by a system of government in which religious leaders hold political power.",
            "pos": "adjective",
            "sent1": "The theocratic rulers held both religious and political authority.",
            "sent2": "The theocratic society was governed by religious figures with political influence.",
            "sent3": "Living in a theocratic nation meant following laws based on religious doctrines.",
            "sent4": "The theocratic system intertwined religious beliefs with political decisions.",
            "sent5": "In the theocratic state, religious leaders had the final say in all matters of governance."
        }
    ]
}