{
    "term": "thermoluminescent",
    "meanings": [
        {
            "definition": "Emitting light when heated.",
            "pos": "adjective",
            "sent1": "The thermoluminescent rock glowed brightly when placed in the fire.",
            "sent2": "The thermoluminescent paint on the wall lit up the room when the temperature rose.",
            "sent3": "The thermoluminescent stars on the ceiling made the bedroom look like a magical night sky.",
            "sent4": "Her smile was as thermoluminescent as a shooting star streaking across the sky.",
            "sent5": "The thermoluminescent fireflies danced in the warm summer night, creating a mesmerizing display."
        },
        {
            "definition": "A material that emits light when heated.",
            "pos": "noun",
            "sent1": "The scientist studied the thermoluminescent to understand its light-emitting properties.",
            "sent2": "The cave explorer discovered a rare thermoluminescent crystal deep underground.",
            "sent3": "The art exhibit featured a sculpture made entirely of thermoluminescent glass.",
            "sent4": "The thermoluminescent material in the laboratory glowed like a tiny beacon in the dark room.",
            "sent5": "The jewelry maker used thermoluminescent stones to create stunning, glowing necklaces."
        },
        {
            "definition": "The property of emitting light when heated.",
            "pos": "noun",
            "sent1": "The thermoluminescent of the mineral was a fascinating characteristic for researchers.",
            "sent2": "The thermoluminescent of the paint made it ideal for safety signs in dark places.",
            "sent3": "The thermoluminescent of the fabric made it a popular choice for futuristic costumes.",
            "sent4": "The thermoluminescent of the chemical reaction was unexpected and intriguing to the scientists.",
            "sent5": "The thermoluminescent of the meteorite captured the attention of astronomers worldwide."
        }
    ]
}