{
    "term": "thermes",
    "meanings": [
        {
            "definition": "A public bath or hot spring",
            "pos": "noun",
            "sent1": "After a long day of hiking, we relaxed in the thermes to soothe our tired muscles.",
            "sent2": "The town's main attraction was the thermes, where locals and tourists alike enjoyed the warm waters.",
            "sent3": "The thermes was so popular that even the ducks in the pond wanted to take a dip!",
            "sent4": "As the sun set, the steam rising from the thermes created a mystical atmosphere around the ancient structure.",
            "sent5": "The sound of laughter echoed through the thermes as families gathered for a communal bath."
        },
        {
            "definition": "A unit of heat energy equal to 100,000 British thermal units",
            "pos": "noun",
            "sent1": "The thermes measurement helped us understand the energy needed to heat our home during winter.",
            "sent2": "The factory required a massive amount of thermes to operate efficiently throughout the year.",
            "sent3": "In the science experiment, we had to calculate the thermes used to heat the water in the beaker.",
            "sent4": "The thermes generated by the sun's rays kept the greenhouse warm and cozy for the plants.",
            "sent5": "The thermes produced by the engine powered the entire ship across the vast ocean."
        },
        {
            "definition": "A type of ancient Greek or Roman building used for public bathing",
            "pos": "noun",
            "sent1": "Visiting the ancient thermes gave us a glimpse into the bathing practices of the past civilizations.",
            "sent2": "The intricate mosaics adorning the walls of the thermes depicted scenes from mythology.",
            "sent3": "The tour guide joked that the ancient Romans probably had to wait in line for the thermes, just like us.",
            "sent4": "The grandeur of the marble columns in the thermes transported us back to the glory days of the Roman Empire.",
            "sent5": "The echoes of chatter and splashing water filled the air inside the bustling thermes."
        }
    ]
}