{
    "term": "thermomagnetic",
    "meanings": [
        {
            "definition": "Relating to the combined effects of heat and magnetism.",
            "pos": "adjective",
            "sent1": "The thermomagnetic material changed its properties when exposed to heat and a magnet.",
            "sent2": "The scientist conducted experiments to understand the thermomagnetic behavior of the substance.",
            "sent3": "The thermomagnetic reaction was so surprising that it made the researchers double-check their equipment.",
            "sent4": "Her fascination with thermomagnetic phenomena was like a magnetic pull, drawing her deeper into the study.",
            "sent5": "The thermomagnetic effect was as clear as day, making it easy for students to observe and learn from."
        },
        {
            "definition": "A material exhibiting thermomagnetic properties.",
            "pos": "noun",
            "sent1": "The thermomagnetic was used in the construction of the new device.",
            "sent2": "The researchers analyzed the thermomagnetic to understand its unique characteristics.",
            "sent3": "The thermomagnetic seemed to have a mind of its own, reacting unexpectedly in the experiment.",
            "sent4": "The thermomagnetic material was a hidden gem, waiting to be discovered by scientists.",
            "sent5": "The properties of the thermomagnetic made it stand out among other materials in the lab."
        },
        {
            "definition": "The study of thermomagnetic phenomena.",
            "pos": "noun",
            "sent1": "Her research focused on the thermomagnetic and its applications in technology.",
            "sent2": "The thermomagnetic field was a fascinating area of study for many scientists.",
            "sent3": "The professor's passion for thermomagnetic research was contagious among the students.",
            "sent4": "Exploring the depths of thermomagnetic phenomena was like diving into a mysterious ocean.",
            "sent5": "The textbook on thermomagnetic phenomena made the complex topic easier to understand for beginners."
        }
    ]
}