{
    "term": "thermoduric",
    "meanings": [
        {
            "definition": "Capable of surviving high temperatures.",
            "pos": "adjective",
            "sent1": "The special material was thermoduric, able to endure extreme heat without melting.",
            "sent2": "The oven gloves were made of a thermoduric fabric to protect the hands from burns.",
            "sent3": "The ice cream didn't stand a chance against the thermoduric sun, quickly turning into a puddle.",
            "sent4": "Her determination was as thermoduric as steel, never wavering even in the face of adversity.",
            "sent5": "The ancient artifact was surprisingly thermoduric, surviving centuries of exposure to harsh climates."
        },
        {
            "definition": "Organisms that can withstand heat.",
            "pos": "noun",
            "sent1": "Scientists discovered a new thermoduric species living near the volcanic vents.",
            "sent2": "The desert is home to many thermoduric creatures adapted to the scorching temperatures.",
            "sent3": "The thermoduric bacteria in the hot spring seemed to be enjoying their steamy jacuzzi.",
            "sent4": "In the competition of endurance, the thermoduric organisms proved their resilience under fire.",
            "sent5": "The survival of the fittest was evident as the thermoduric plants thrived in the harsh environment."
        },
        {
            "definition": "Resistant to heat.",
            "pos": "adjective",
            "sent1": "The thermoduric material was perfect for insulating the electronics from overheating.",
            "sent2": "The chef's thermoduric hands could handle the hot pans without any discomfort.",
            "sent3": "The thermoduric sunscreen protected her skin from the scorching sun during the beach day.",
            "sent4": "His calm demeanor remained thermoduric even in the heat of the argument.",
            "sent5": "The thermoduric glass reflected the sunlight, keeping the interior cool and comfortable."
        }
    ]
}