{
    "term": "thermographs",
    "meanings": [
        {
            "definition": "An instrument that automatically records temperature variations.",
            "pos": "noun",
            "sent1": "The thermographs in the lab help scientists track temperature changes.",
            "sent2": "The technician checked the thermographs to monitor the room's temperature.",
            "sent3": "The thermographs seemed to have a mind of their own, always noting the slightest change.",
            "sent4": "Her memory worked like a thermograph, capturing every fluctuation in detail.",
            "sent5": "The thermographs hummed softly as they diligently recorded the temperature shifts."
        },
        {
            "definition": "A device used to measure and record temperature changes.",
            "pos": "noun",
            "sent1": "Dad used the thermographs to keep an eye on the weather outside.",
            "sent2": "The classroom had a set of thermographs to help students understand climate.",
            "sent3": "The thermographs beeped happily whenever the temperature shifted.",
            "sent4": "His eyes were like thermographs, always observing and recording every detail.",
            "sent5": "The thermographs clicked rhythmically as they documented the changing temperatures."
        },
        {
            "definition": "The process of recording temperature fluctuations using a specialized tool.",
            "pos": "noun",
            "sent1": "The thermographs captured the heat waves during the experiment.",
            "sent2": "Scientists rely on thermographs to analyze temperature changes over time.",
            "sent3": "The thermographs threw a party every time the temperature went up or down.",
            "sent4": "Her heart acted like a thermograph, registering every emotional fluctuation.",
            "sent5": "The thermographs danced across the paper, illustrating the temperature variations beautifully."
        }
    ]
}