{
    "term": "thermographic",
    "meanings": [
        {
            "definition": "Relating to or using thermography.",
            "pos": "adjective",
            "sent1": "The thermographic camera captured the heat signatures of the animals in the dark forest.",
            "sent2": "The thermographic image showed the temperature variations across the building.",
            "sent3": "The detective used a thermographic device to uncover the hidden clues at the crime scene.",
            "sent4": "Her eyes were like thermographic sensors, detecting even the slightest changes in temperature.",
            "sent5": "The artist painted a thermographic landscape where warm colors represented the sunlit areas."
        },
        {
            "definition": "Involving the use of thermography.",
            "pos": "adjective",
            "sent1": "The thermographic inspection revealed the faulty wiring in the old house.",
            "sent2": "The thermographic survey helped identify areas of heat loss in the building.",
            "sent3": "The chef jokingly claimed his secret recipe was only visible under a thermographic lens.",
            "sent4": "Her smile was like a thermographic scan, revealing the warmth of her emotions.",
            "sent5": "The scientist conducted a thermographic experiment to study the heat distribution in the room."
        },
        {
            "definition": "Of or relating to thermography.",
            "pos": "adjective",
            "sent1": "The thermographic technology allowed for accurate temperature measurements.",
            "sent2": "The thermographic equipment was essential for monitoring the heat levels in the lab.",
            "sent3": "The comedian's joke about thermographic selfies left the audience laughing.",
            "sent4": "His words were like thermographic images, revealing the hidden emotions behind them.",
            "sent5": "The book described a world where everything was seen through a thermographic lens."
        }
    ]
}