{
    "term": "thermoscope",
    "meanings": [
        {
            "definition": "An instrument for indicating changes of temperature.",
            "pos": "noun",
            "sent1": "The thermoscope showed that the room was getting warmer.",
            "sent2": "I used the thermoscope to check if the water was hot enough for tea.",
            "sent3": "The thermoscope seemed to have a mind of its own, pointing to different temperatures each time.",
            "sent4": "Her smile was like a thermoscope, revealing her mood without a word.",
            "sent5": "The thermoscope's needle danced back and forth, like a tiny weather vane for temperature."
        },
        {
            "definition": "A device for measuring temperature changes.",
            "pos": "noun",
            "sent1": "The thermoscope on the wall displayed the current temperature.",
            "sent2": "He used a thermoscope to monitor the temperature of the liquid in the experiment.",
            "sent3": "The thermoscope beeped loudly whenever the temperature changed, startling everyone in the room.",
            "sent4": "The thermoscope was like a detective, uncovering the secrets of temperature fluctuations.",
            "sent5": "With the thermoscope in hand, she could track even the slightest changes in temperature."
        },
        {
            "definition": "A tool used to detect variations in temperature.",
            "pos": "noun",
            "sent1": "The thermoscope in the lab helped us identify the hotspots in the room.",
            "sent2": "Using a thermoscope, he could pinpoint the exact location of the temperature anomaly.",
            "sent3": "The thermoscope hummed softly as it detected the subtle temperature changes in the environment.",
            "sent4": "Her intuition was like a finely tuned thermoscope, always sensing the slightest temperature shifts.",
            "sent5": "The thermoscope glowed brightly whenever it detected a change in temperature, like a tiny beacon."
        }
    ]
}