{
    "term": "thereupon",
    "meanings": [
        {
            "definition": "Immediately after that",
            "pos": "adverb",
            "sent1": "She finished her meal, and thereupon she left the restaurant.",
            "sent2": "He received the letter, and thereupon he called his friend.",
            "sent3": "The cat knocked over the vase, and thereupon the dog started barking.",
            "sent4": "The sun set, and thereupon the stars began to appear in the sky.",
            "sent5": "The clock struck midnight, and thereupon the carriage turned into a pumpkin."
        },
        {
            "definition": "In consequence of that",
            "pos": "adverb",
            "sent1": "He forgot his umbrella, and thereupon got soaked in the rain.",
            "sent2": "The chef burned the dish, and thereupon had to start over.",
            "sent3": "She missed the bus, and thereupon had to walk to work in the rain.",
            "sent4": "The tree was struck by lightning, and thereupon split in half.",
            "sent5": "The child ate too much candy, and thereupon got a stomach ache."
        },
        {
            "definition": "Following that",
            "pos": "conjunction",
            "sent1": "She finished her homework, and thereupon went to bed.",
            "sent2": "He fixed the leaky faucet, and thereupon the water stopped dripping.",
            "sent3": "The team won the game, and thereupon celebrated with a pizza party.",
            "sent4": "The rain stopped, and thereupon the sun came out.",
            "sent5": "The bell rang, and thereupon the students lined up for recess."
        },
        {
            "definition": "In response to that",
            "pos": "adverb",
            "sent1": "She called for help, and thereupon the ambulance arrived.",
            "sent2": "He apologized for the mistake, and thereupon his boss forgave him.",
            "sent3": "The dog barked at the stranger, and thereupon the stranger backed away.",
            "sent4": "The baby started crying, and thereupon the mother picked him up.",
            "sent5": "The alarm went off, and thereupon everyone evacuated the building."
        }
    ]
}