{
    "term": "theurgies",
    "meanings": [
        {
            "definition": "The practice of rituals or ceremonies believed to invoke supernatural powers",
            "pos": "noun",
            "sent1": "During the theurgies, the priest chanted ancient words to call upon the spirits.",
            "sent2": "The village elders gathered for the theurgies to seek protection from the gods.",
            "sent3": "At the theurgies, the cat accidentally knocked over the sacred candle, causing a moment of chaos.",
            "sent4": "The theurgies were like a bridge between the earthly realm and the realm of the unknown.",
            "sent5": "The theurgies filled the room with a sense of mystery and reverence."
        },
        {
            "definition": "Acts or practices related to invoking divine intervention or communication",
            "pos": "noun",
            "sent1": "The theurgies performed by the shaman were said to bring blessings from the heavens.",
            "sent2": "In times of need, the people turned to the theurgies to ask for guidance.",
            "sent3": "The theurgies seemed to work like a secret code to reach out to the gods.",
            "sent4": "Her gestures during the theurgies were like whispers to the divine beings.",
            "sent5": "The theurgies were a way to open a door to the realm of the sacred."
        },
        {
            "definition": "Rituals or ceremonies performed to connect with higher spiritual beings",
            "pos": "noun",
            "sent1": "The theurgies conducted by the monks were a way to commune with the angels.",
            "sent2": "During the theurgies, the participants felt a sense of peace and unity.",
            "sent3": "The theurgies were like a dance of light and shadow in the temple.",
            "sent4": "Through the theurgies, the seekers hoped to touch the divine essence.",
            "sent5": "The theurgies were a path to reach the celestial realms."
        }
    ]
}