{
    "term": "thimblerigged",
    "meanings": [
        {
            "definition": "Cheat or swindle (someone) by trickery or deception.",
            "pos": "verb",
            "sent1": "The con artist thimblerigged the unsuspecting tourists out of their money.",
            "sent2": "He thimblerigged his way into getting a free meal at the restaurant.",
            "sent3": "The magician thimblerigged the audience into believing he made the coin disappear.",
            "sent4": "She thimblerigged her opponents with her quick moves on the chessboard.",
            "sent5": "The scammer thimblerigged the old lady by pretending to fix her roof but running off with her savings instead."
        },
        {
            "definition": "Engage in the game of thimblerig.",
            "pos": "verb",
            "sent1": "During the fair, many people gathered to watch the street performer thimblerigged with cups and a pea.",
            "sent2": "The children loved to thimblerig with their friends during recess.",
            "sent3": "The siblings decided to thimblerig to see who would do the dishes after dinner.",
            "sent4": "In the park, a group of friends thimblerigged for fun, trying to guess where the ball was hidden.",
            "sent5": "The students thimblerigged during their break, laughing and enjoying the game together."
        },
        {
            "definition": "Deceive or trick (someone) by using sleight of hand.",
            "pos": "verb",
            "sent1": "The street magician thimblerigged the crowd with his card tricks.",
            "sent2": "She thimblerigged her brother by making a coin disappear and reappear behind his ear.",
            "sent3": "The pickpocket thimblerigged the distracted man by stealing his wallet without him noticing.",
            "sent4": "The illusionist thimblerigged the judges with his mind-bending performance.",
            "sent5": "The con artist thimblerigged the audience by making them believe he could read minds."
        }
    ]
}