{
    "term": "third",
    "meanings": [
        {
            "definition": "One of three equal parts of a whole.",
            "pos": "noun",
            "sent1": "In the game, each player takes a turn to roll the dice and move their piece one third of the way around the board.",
            "sent2": "She ate a third of the pizza, leaving the rest for her friends to share.",
            "sent3": "The third slice of cake was calling my name, but I resisted the temptation.",
            "sent4": "His third attempt at solving the puzzle finally paid off, and he felt a sense of accomplishment.",
            "sent5": "The third star from the left in the night sky always reminds me of my childhood home."
        },
        {
            "definition": "The ordinal number corresponding to three in a series.",
            "pos": "noun",
            "sent1": "She finished in third place in the race, just behind the two fastest runners.",
            "sent2": "The third book in the series was the most exciting one yet.",
            "sent3": "He jokingly claimed to be the third tallest person in the room, even though he was clearly the shortest.",
            "sent4": "The third time's the charm, as they say, and he finally succeeded on his third attempt.",
            "sent5": "The third chapter of the book revealed a surprising plot twist that kept readers on the edge of their seats."
        },
        {
            "definition": "The third forward gear in a vehicle.",
            "pos": "noun",
            "sent1": "When driving uphill, it's best to shift into third gear for more power.",
            "sent2": "He accelerated quickly after shifting into third gear on the straight road.",
            "sent3": "The car's engine roared as he pushed the pedal to switch into third gear, feeling the rush of speed.",
            "sent4": "In the race, he strategically downshifted into third gear to navigate the sharp turn with precision.",
            "sent5": "The engine hummed smoothly as he smoothly transitioned from second to third gear, enjoying the seamless ride."
        }
    ]
}