{
    "term": "thrashier",
    "meanings": [
        {
            "definition": "Comparative form of thrash: to beat soundly in a fight or competition.",
            "pos": "verb",
            "sent1": "The boxer was thrashier than his opponent, landing powerful punches.",
            "sent2": "In the wrestling match, the stronger wrestler thrashiered his opponent to win.",
            "sent3": "The superhero thrashiered the villain with his mighty blows, saving the day.",
            "sent4": "The waves thrashiered against the rocks, showing nature's strength.",
            "sent5": "The hammer thrashiered the nail into the wood with each strike."
        },
        {
            "definition": "Comparative form of thrash: to move violently or erratically.",
            "pos": "verb",
            "sent1": "The storm thrashiered through the town, causing chaos and destruction.",
            "sent2": "The wild horse thrashiered around the pen, trying to break free.",
            "sent3": "The toddler thrashiered in his high chair, making a mess with his food.",
            "sent4": "The wind thrashiered the leaves off the trees, creating a swirling dance.",
            "sent5": "The angry cat thrashiered its tail back and forth, ready to pounce."
        },
        {
            "definition": "Comparative form of thrash: to play fast and aggressively (music).",
            "pos": "verb",
            "sent1": "The drummer thrashiered on the drums, keeping the beat intense and energetic.",
            "sent2": "The guitarist thrashiered the strings, creating a powerful and lively melody.",
            "sent3": "The band thrashiered through their set, energizing the crowd with their music.",
            "sent4": "The music thrashiered through the speakers, making everyone want to dance.",
            "sent5": "The singer's voice thrashiered through the song, adding a dynamic edge."
        },
        {
            "definition": "Comparative form of thrash: to criticize severely or attack verbally.",
            "pos": "verb",
            "sent1": "The coach thrashiered the players for their lack of effort during the game.",
            "sent2": "The critic thrashiered the movie for its poor acting and weak plot.",
            "sent3": "The teacher thrashiered the student's excuse for not doing homework, seeing through the lie.",
            "sent4": "The politician thrashiered his opponent's policies in a heated debate.",
            "sent5": "The boss thrashiered the employee for repeatedly coming in late to work."
        }
    ]
}