{
    "term": "thrawnly",
    "meanings": [
        {
            "definition": "In a stubborn or obstinate manner",
            "pos": "adverb",
            "sent1": "She held onto her beliefs thrawnly, refusing to change her mind.",
            "sent2": "He walked thrawnly, ignoring all suggestions to take a different path.",
            "sent3": "The cat thrawnly refused to eat the new brand of food, turning her nose up at it.",
            "sent4": "The old tree stood thrawnly against the strong winds, its roots firmly planted in the ground.",
            "sent5": "The child thrawnly insisted on wearing mismatched socks to school every day, no matter what."
        },
        {
            "definition": "Showing a strong-willed or contrary attitude",
            "pos": "adjective",
            "sent1": "Despite his thrawnly behavior, he was respected for his determination.",
            "sent2": "The thrawnly student challenged the teacher's instructions at every turn.",
            "sent3": "The thrawnly squirrel stole all the nuts from the other animals, claiming them as his own.",
            "sent4": "Her thrawnly personality was like a rock in the river, unyielding to outside influences.",
            "sent5": "The thrawnly horse refused to be tamed, bucking off every rider who tried."
        },
        {
            "definition": "Characterized by a difficult or uncooperative nature",
            "pos": "adjective",
            "sent1": "The thrawnly puzzle took hours to solve, with its tricky clues and hidden pieces.",
            "sent2": "The thrawnly cat refused to come down from the tree, meowing defiantly at anyone who approached.",
            "sent3": "The thrawnly computer kept crashing, making it impossible to finish the important work.",
            "sent4": "Her thrawnly car always seemed to break down at the worst possible times, causing endless frustration.",
            "sent5": "The thrawnly weather made it challenging to plan any outdoor activities, with its unpredictable changes."
        }
    ]
}