{
    "term": "threefold",
    "meanings": [
        {
            "definition": "Three times as great or as numerous.",
            "pos": "adjective",
            "sent1": "The cake was a threefold delight with layers of chocolate, vanilla, and strawberry.",
            "sent2": "The threefold increase in sales brought joy to the business owner.",
            "sent3": "I felt threefold happiness when I found out I passed the test, got a promotion, and won a prize all in one day.",
            "sent4": "Her talent was threefold, excelling in singing, dancing, and acting.",
            "sent5": "The threefold beauty of the sunset painted the sky in shades of pink, orange, and purple."
        },
        {
            "definition": "Consisting of three parts or elements.",
            "pos": "adjective",
            "sent1": "The threefold puzzle required solving three different sections to reveal the hidden message.",
            "sent2": "The team worked together to create a threefold plan for the project.",
            "sent3": "The threefold lock could only be opened by turning three keys simultaneously.",
            "sent4": "Her necklace had a threefold design with three intertwined circles representing unity, love, and friendship.",
            "sent5": "The threefold structure of the building included a main hall, a courtyard, and a tower."
        },
        {
            "definition": "In three ways or directions.",
            "pos": "adverb",
            "sent1": "She waved threefold to cover all angles of the room.",
            "sent2": "The tree branches extended threefold, reaching out in different directions.",
            "sent3": "He apologized threefold, first in person, then in a letter, and finally with a gift.",
            "sent4": "The music echoed threefold through the empty hall, creating a haunting effect.",
            "sent5": "The laughter filled the room threefold, making everyone smile and join in the joy."
        }
    ]
}