{
    "term": "throws",
    "meanings": [
        {
            "definition": "To propel or cast in any way",
            "pos": "verb",
            "sent1": "She throws the ball to her friend.",
            "sent2": "He throws the paper airplane across the room.",
            "sent3": "The monkey throws the banana peel on the ground and slips on it.",
            "sent4": "The sun throws its warm rays over the field.",
            "sent5": "The strong wind throws the leaves in all directions."
        },
        {
            "definition": "To put in a particular position or condition",
            "pos": "verb",
            "sent1": "He throws his backpack on the chair.",
            "sent2": "She throws the blanket over the sleeping cat.",
            "sent3": "The chef throws a pinch of salt into the boiling pot.",
            "sent4": "The artist throws colors onto the canvas with a brush.",
            "sent5": "The gardener throws seeds into the freshly tilled soil."
        },
        {
            "definition": "To cause to fall or come in contact",
            "pos": "verb",
            "sent1": "The strong wind throws the leaves off the tree.",
            "sent2": "She throws the ball and it hits the target.",
            "sent3": "The mischievous cat throws the vase off the table.",
            "sent4": "The storm throws raindrops against the window.",
            "sent5": "The careless child throws the toy and it breaks."
        },
        {
            "definition": "To project or cast",
            "pos": "verb",
            "sent1": "He throws a shadow on the wall under the bright light.",
            "sent2": "She throws her voice to make it sound like it's coming from another room.",
            "sent3": "The magician throws a coin into the air and makes it disappear.",
            "sent4": "The actor throws his voice to mimic different characters.",
            "sent5": "The storyteller throws her words into the audience's imagination."
        },
        {
            "definition": "To move or put in a specified way",
            "pos": "verb",
            "sent1": "She throws her hair into a messy bun.",
            "sent2": "He throws the dice onto the game board.",
            "sent3": "The dancer throws her arms up in the air during the performance.",
            "sent4": "The chef throws the ingredients into the mixing bowl.",
            "sent5": "The athlete throws the shot put with great strength."
        }
    ]
}