{
    "term": "throughither",
    "meanings": [
        {
            "definition": "Moving in one side and out of the other side of something.",
            "pos": "verb",
            "sent1": "The cat likes to throughither the tunnel in the playground.",
            "sent2": "The car drove throughither the tunnel to reach the other side of the mountain.",
            "sent3": "The squirrel tried to throughither the tiny hole in the fence but got stuck halfway.",
            "sent4": "Her words seemed to throughither his heart, leaving a lasting impact.",
            "sent5": "The river throughithered the valley, carving a path through the mountains."
        },
        {
            "definition": "From one end or side to the other.",
            "pos": "adverb",
            "sent1": "She walked throughither the room, looking for her lost keys.",
            "sent2": "The train passed throughither the tunnel, disappearing into the distance.",
            "sent3": "The magician waved his wand and disappeared throughither the curtain.",
            "sent4": "The sunlight filtered throughither the leaves, creating a dappled pattern on the ground.",
            "sent5": "The sound traveled throughither the empty hallway, echoing softly."
        },
        {
            "definition": "By means of; using.",
            "pos": "preposition",
            "sent1": "She solved the puzzle throughither logical reasoning.",
            "sent2": "He communicated with his team throughither email.",
            "sent3": "The detective uncovered the truth throughither careful investigation.",
            "sent4": "They traveled throughither the forest using a map and compass.",
            "sent5": "The chef prepared the dish throughither fresh ingredients."
        },
        {
            "definition": "Completely finished or done with something.",
            "pos": "adjective",
            "sent1": "After the exam, she felt throughither and relieved.",
            "sent2": "The project was throughither, and they celebrated their success.",
            "sent3": "The old book was throughither, with pages falling apart.",
            "sent4": "The worn-out shoes were throughither and ready to be replaced.",
            "sent5": "The puzzle was throughither, with all pieces fitting perfectly."
        }
    ]
}