{
    "term": "thrusters",
    "meanings": [
        {
            "definition": "A device used to propel a spacecraft or ship.",
            "pos": "noun",
            "sent1": "The spaceship's thrusters fired, pushing it through the vast emptiness of space.",
            "sent2": "The captain activated the thrusters to maneuver the ship into a docking position.",
            "sent3": "The alien spaceship's thrusters were so powerful, they accidentally launched it into orbit around a nearby moon.",
            "sent4": "Her determination was like the thrusters of a rocket, propelling her towards her goals with unstoppable force.",
            "sent5": "The thrusters roared to life, sending the spacecraft hurtling towards the unknown."
        },
        {
            "definition": "A person or thing that thrusts or pushes forcefully.",
            "pos": "noun",
            "sent1": "The strongman at the circus was known as the human thrusters, effortlessly lifting heavy weights.",
            "sent2": "The thrusters of the crowd pushed forward to catch a glimpse of the celebrity.",
            "sent3": "The playful puppy was a little thrusters, always nudging its toys around the room.",
            "sent4": "His words were like emotional thrusters, pushing her to confront her fears head-on.",
            "sent5": "The thrusters of the bulldozer cleared the path through the dense forest with ease."
        },
        {
            "definition": "A type of exercise that involves pushing or pulling weights.",
            "pos": "noun",
            "sent1": "The gym instructor demonstrated how to use the thrusters to strengthen the arms and shoulders.",
            "sent2": "She felt the burn in her muscles as she completed a set of thrusters during her workout.",
            "sent3": "The fitness class erupted in laughter as they attempted the thrusters exercise with exaggerated movements.",
            "sent4": "His dedication to daily thrusters paid off, as he noticed an increase in his overall strength.",
            "sent5": "The rhythmic sound of the weights being lifted during thrusters echoed through the gym."
        }
    ]
}