{
    "term": "thumbkin",
    "meanings": [
        {
            "definition": "A small, round, green vegetable.",
            "pos": "noun",
            "sent1": "I picked a ripe thumbkin from the garden.",
            "sent2": "The salad was filled with colorful thumbkin slices.",
            "sent3": "The thumbkin rolled off the table and onto the floor.",
            "sent4": "The thumbkin looked like a tiny green ball of goodness.",
            "sent5": "The thumbkin added a pop of color to the dish."
        },
        {
            "definition": "A person who is small in stature.",
            "pos": "noun",
            "sent1": "The little girl was known as the village thumbkin.",
            "sent2": "The circus had a talented thumbkin performer.",
            "sent3": "The thumbkin easily squeezed through the narrow opening.",
            "sent4": "She was as petite as a delicate thumbkin.",
            "sent5": "The thumbkin had a big personality despite their size."
        },
        {
            "definition": "To press or push with the thumb.",
            "pos": "verb",
            "sent1": "She tried to thumbkin the button, but it was stuck.",
            "sent2": "He used his thumbkin to open the jar lid.",
            "sent3": "I thumbkin the doorbell and waited for a response.",
            "sent4": "She could thumbkin the soft clay into different shapes.",
            "sent5": "He thumbkin the key into the lock with ease."
        },
        {
            "definition": "A type of glove that covers the thumb and part of the hand.",
            "pos": "noun",
            "sent1": "She wore a thumbkin to keep her hands warm.",
            "sent2": "The thumbkin protected his thumb while gardening.",
            "sent3": "The thumbkin was lost, leaving his thumb exposed to the cold.",
            "sent4": "The thumbkin was made of soft, cozy material.",
            "sent5": "She always kept a thumbkin in her pocket for chilly days."
        }
    ]
}