{
    "term": "thunderbird",
    "meanings": [
        {
            "definition": "A legendary bird in North American indigenous mythology, often depicted as a powerful and majestic creature.",
            "pos": "noun",
            "sent1": "The thunderbird soared high in the sky, its wings spread wide.",
            "sent2": "Legends speak of the thunderbird bringing rain and thunder to the land.",
            "sent3": "The thunderbird decided to take up singing lessons, hoping to add a new sound to the thunderstorms.",
            "sent4": "Her presence was like a thunderbird, commanding attention wherever she went.",
            "sent5": "The thunderbird's eyes gleamed with ancient wisdom, watching over the earth below."
        },
        {
            "definition": "A model of car produced by Ford Motor Company.",
            "pos": "noun",
            "sent1": "I saw a shiny red thunderbird parked in front of the house.",
            "sent2": "The thunderbird was known for its sleek design and powerful engine.",
            "sent3": "When the thunderbird broke down on the highway, it caused quite a traffic jam.",
            "sent4": "Her new thunderbird gleamed in the sunlight, turning heads as she drove by.",
            "sent5": "The thunderbird purred like a contented cat as it cruised down the road."
        },
        {
            "definition": "A type of large, mythical bird associated with thunder and lightning in various cultures.",
            "pos": "noun",
            "sent1": "The ancient scrolls depicted the thunderbird as a fierce guardian of the skies.",
            "sent2": "In some tales, the thunderbird was said to control the very bolts of lightning.",
            "sent3": "The thunderbird challenged Zeus to a lightning-throwing contest, just for fun.",
            "sent4": "Her bravery was like that of a thunderbird, unafraid of any storm that came her way.",
            "sent5": "The thunderbird's wings crackled with electricity as it soared through the storm clouds."
        }
    ]
}