{
    "term": "thunderbirds",
    "meanings": [
        {
            "definition": "A mythical bird often associated with thunder and lightning.",
            "pos": "noun",
            "sent1": "Legends tell of powerful thunderbirds soaring through stormy skies.",
            "sent2": "The ancient tale spoke of a majestic thunderbird ruling the heavens.",
            "sent3": "In the story, the thunderbirds brought rain to the dry lands with their mighty wings.",
            "sent4": "The thunderbird's wings crackled with electricity as it flew through the dark clouds.",
            "sent5": "Children listened in awe to the stories of the fearsome thunderbirds in the night."
        },
        {
            "definition": "A team of pilots who fly advanced aircraft in a popular television show.",
            "pos": "noun",
            "sent1": "The thunderbirds zoomed across the screen in their high-tech jets.",
            "sent2": "Fans eagerly awaited the next episode featuring the daring thunderbirds.",
            "sent3": "The thunderbirds always saved the day with their incredible flying skills.",
            "sent4": "Viewers were captivated by the thrilling maneuvers of the skilled thunderbirds.",
            "sent5": "The team of thunderbirds inspired many young children to dream of becoming pilots."
        },
        {
            "definition": "A Native American symbol representing power and protection.",
            "pos": "noun",
            "sent1": "The thunderbird symbol was carved into the totem pole as a sign of strength.",
            "sent2": "People believed wearing the thunderbird emblem brought them good fortune.",
            "sent3": "The thunderbird amulet was said to shield its wearer from harm in battle.",
            "sent4": "The chief proudly displayed the thunderbird banner during the tribal ceremony.",
            "sent5": "The thunderbird image was painted on the shields for added protection in war."
        }
    ]
}