{
    "term": "thunderstone",
    "meanings": [
        {
            "definition": "A stone believed to have fallen from the sky, often associated with thunder and lightning.",
            "pos": "noun",
            "sent1": "The villagers marveled at the mysterious thunderstone found in the field.",
            "sent2": "Miners discovered an ancient thunderstone while digging in the mountains.",
            "sent3": "The children pretended the thunderstone was a gift from the sky gods.",
            "sent4": "Her laughter echoed like thunderstone through the empty halls.",
            "sent5": "The thunderstone glowed with an otherworldly light, captivating all who saw it."
        },
        {
            "definition": "A type of stone used in ancient times for protection against lightning.",
            "pos": "noun",
            "sent1": "The ancient tribe carried the sacred thunderstone to ward off lightning strikes.",
            "sent2": "Legends say that holding a thunderstone can shield you from the wrath of lightning.",
            "sent3": "The wise elder joked that his thunderstone necklace made him invincible during storms.",
            "sent4": "Her courage was like a thunderstone, unyielding in the face of danger.",
            "sent5": "The thunderstone's power to repel lightning was both feared and respected by the villagers."
        },
        {
            "definition": "A mythical stone believed to have magical properties related to thunder and storms.",
            "pos": "noun",
            "sent1": "The wizard's staff was topped with a shimmering thunderstone, enhancing his spells.",
            "sent2": "Legends speak of a hidden cave where a thunderstone of immense power lies dormant.",
            "sent3": "The mischievous sprite used the thunderstone to create thunderstorms for fun.",
            "sent4": "Her eyes sparkled like thunderstone, full of mystery and enchantment.",
            "sent5": "The thunderstone hummed softly, resonating with the energy of the storm around it."
        }
    ]
}