{
    "term": "tided",
    "meanings": [
        {
            "definition": "The rise and fall of the sea caused by the gravitational pull of the moon and sun.",
            "pos": "noun",
            "sent1": "The fishermen checked the tided before setting sail for the day.",
            "sent2": "During the storm, the high tided caused flooding in the coastal town.",
            "sent3": "The picnic by the beach had to be moved due to the unexpected high tided.",
            "sent4": "The ebb and flow of the tided reminded her of life's ups and downs.",
            "sent5": "The beauty of the tided mesmerized the young children playing by the shore."
        },
        {
            "definition": "A particular period or point in time.",
            "pos": "noun",
            "sent1": "The holiday season is always a joyful tided for families to come together.",
            "sent2": "In history class, we learned about the tided of the Renaissance era.",
            "sent3": "The tided of the school day changed when the bell rang for lunch.",
            "sent4": "As the tided of the meeting turned sour, tensions rose among the attendees.",
            "sent5": "The tided of emotions overwhelmed her as she watched the heartfelt movie."
        },
        {
            "definition": "To be carried or driven by the tide.",
            "pos": "verb",
            "sent1": "The small boat tided gently towards the shore with the current.",
            "sent2": "The debris was tided out to sea after the storm passed.",
            "sent3": "The lost toy was tided away by the flowing stream in the park.",
            "sent4": "She felt tided along by the crowd as they moved towards the concert venue.",
            "sent5": "The fallen leaves were tided away by the wind, swirling in a dance of nature."
        },
        {
            "definition": "To cause to float with or as if with the tide.",
            "pos": "verb",
            "sent1": "The kids tided their paper boats in the puddles after the rain.",
            "sent2": "The magician tided the colorful scarves in the air, creating a mesmerizing display.",
            "sent3": "She tided the balloons in the room, making it look like a festive celebration.",
            "sent4": "The music tided her thoughts away, lifting her spirits with each note.",
            "sent5": "His words tided her hopes and dreams, carrying them towards a brighter future."
        }
    ]
}