{
    "term": "tiderip",
    "meanings": [
        {
            "definition": "A strong current caused by the tide changing direction.",
            "pos": "noun",
            "sent1": "The tiderip carried the seaweed swiftly.",
            "sent2": "The fishermen were wary of the powerful tiderip.",
            "sent3": "The playful seals rode the tiderip like a rollercoaster.",
            "sent4": "The tiderip's force was like a giant hand pulling everything away.",
            "sent5": "The tiderip's pull was as forceful as a charging bull."
        },
        {
            "definition": "To be caught in a tiderip while swimming can be dangerous.",
            "pos": "verb",
            "sent1": "Swimmers should avoid areas where tiderips form.",
            "sent2": "She panicked when she felt herself tiderip.",
            "sent3": "The kids joked that the tiderip was trying to steal their toys.",
            "sent4": "Being tiderip is like being in a fast-moving river.",
            "sent5": "He struggled against the tiderip's grasp."
        },
        {
            "definition": "The tiderip pulled the boat out to sea.",
            "pos": "noun",
            "sent1": "The sudden tiderip surprised the sailors.",
            "sent2": "The captain steered clear of the dangerous tiderip.",
            "sent3": "The mischievous seagulls hitched a ride on the tiderip.",
            "sent4": "The tiderip's tug-of-war with the boat was intense.",
            "sent5": "The boat was at the mercy of the relentless tiderip."
        },
        {
            "definition": "The tiderip was particularly strong that day.",
            "pos": "noun",
            "sent1": "The locals warned about the fierce tiderip in the bay.",
            "sent2": "The lifeguard kept a close eye on the turbulent tiderip.",
            "sent3": "The tiderip seemed to dance with the waves in the sunlight.",
            "sent4": "The tiderip's strength was like a giant magnet pulling everything.",
            "sent5": "The tiderip's power was unmatched by any other current."
        }
    ]
}