{
    "term": "tie",
    "meanings": [
        {
            "definition": "A piece of material worn around the neck and tied in a knot.",
            "pos": "noun",
            "sent1": "He wore a colorful tie to the party.",
            "sent2": "The tie matched his shirt perfectly.",
            "sent3": "The tie looked like a rainbow around his neck.",
            "sent4": "His tie was a splash of color in the sea of suits.",
            "sent5": "The tie had a pattern of tiny elephants marching along."
        },
        {
            "definition": "A result in a game or competition where both sides have the same score.",
            "pos": "noun",
            "sent1": "The soccer match ended in a tie.",
            "sent2": "The tie was unexpected but fair.",
            "sent3": "The tie left both teams feeling satisfied.",
            "sent4": "The tie was like a stalemate in chess.",
            "sent5": "The tie meant they would have a rematch next week."
        },
        {
            "definition": "To fasten or secure with a string or cord.",
            "pos": "verb",
            "sent1": "He needed to tie his shoelaces before running.",
            "sent2": "She asked him to tie the package with a bow.",
            "sent3": "He tried to tie a knot with spaghetti - silly idea!",
            "sent4": "The bond between them was tied with trust.",
            "sent5": "She managed to tie the rope securely around the tree."
        },
        {
            "definition": "To connect or link together.",
            "pos": "verb",
            "sent1": "The bridge will tie the two islands together.",
            "sent2": "His speech managed to tie all the ideas into one coherent message.",
            "sent3": "She wanted to tie their friendship with a secret handshake.",
            "sent4": "Their destinies were tied together like threads in a tapestry.",
            "sent5": "The necklace tied the outfit together perfectly."
        }
    ]
}