{
    "term": "ties",
    "meanings": [
        {
            "definition": "A thing that unites or links people or things together.",
            "pos": "noun",
            "sent1": "Family is one of the strongest ties that bind us together.",
            "sent2": "The friendship between the two children was a tie that lasted a lifetime.",
            "sent3": "The magical ties of love can never be broken.",
            "sent4": "The ties of tradition connect us to our ancestors.",
            "sent5": "The ties of friendship are like invisible threads that hold us close."
        },
        {
            "definition": "A necktie or bow tie worn as part of formal attire.",
            "pos": "noun",
            "sent1": "He wore a stylish tie to the wedding.",
            "sent2": "The businessman's tie matched his suit perfectly.",
            "sent3": "The clown's tie was covered in colorful polka dots.",
            "sent4": "She bought a new tie for her husband's birthday.",
            "sent5": "The tie added a touch of elegance to his outfit."
        },
        {
            "definition": "The state of being equal in a contest or competition.",
            "pos": "noun",
            "sent1": "The game ended in a tie, with both teams scoring the same.",
            "sent2": "The tie in the final round led to a sudden death match.",
            "sent3": "The tie was unexpected but fair for both players.",
            "sent4": "The tiebreaker was needed to determine the ultimate winner.",
            "sent5": "The tie created suspense and excitement among the fans."
        },
        {
            "definition": "A connection or relationship between people or things.",
            "pos": "noun",
            "sent1": "The strong tie between the siblings was evident in their bond.",
            "sent2": "The tie between the two countries grew stronger over time.",
            "sent3": "The tie of trust between them was unbreakable.",
            "sent4": "The tie of mentorship helped her navigate her career.",
            "sent5": "The tie of shared experiences brought them closer together."
        }
    ]
}