{
    "term": "tighter",
    "meanings": [
        {
            "definition": "Firmly or closely fixed in place; not easily moved",
            "pos": "adjective",
            "sent1": "The lid on the jar was tighter than before, making it hard to open.",
            "sent2": "She tied the knot tighter to ensure it wouldn't come undone.",
            "sent3": "The cat squeezed into the tighter space behind the couch, pretending to be invisible.",
            "sent4": "His grip on the steering wheel grew tighter as the storm raged outside.",
            "sent5": "The hug from her friend was tighter than she had ever felt, conveying comfort and support."
        },
        {
            "definition": "Strict or stringent in discipline or control",
            "pos": "adjective",
            "sent1": "The teacher had a tighter rule about homework submission this semester.",
            "sent2": "The security at the event was tighter than usual due to recent incidents.",
            "sent3": "The coach's tighter training regimen pushed the team to their limits.",
            "sent4": "The new manager implemented tighter policies to improve efficiency.",
            "sent5": "The company had to adopt tighter security measures after the data breach."
        },
        {
            "definition": "Showing a lack of generosity or willingness to spend money",
            "pos": "adjective",
            "sent1": "His tighter approach to finances meant fewer spontaneous purchases.",
            "sent2": "She had a reputation for being tighter with money than her friends.",
            "sent3": "The tighter budget forced them to get creative with their spending.",
            "sent4": "The tighter accountant scrutinized every expense to cut costs.",
            "sent5": "Their tighter attitude towards money saved them from unnecessary debt."
        },
        {
            "definition": "Of a close or intimate nature",
            "pos": "adjective",
            "sent1": "Their friendship grew tighter as they shared more personal stories.",
            "sent2": "The family had a tighter bond after overcoming a difficult situation together.",
            "sent3": "The tighter connection between them made it easy to communicate without words.",
            "sent4": "The couple's relationship became tighter after going through challenges together.",
            "sent5": "The team's tighter camaraderie helped them achieve victory in the championship."
        },
        {
            "definition": "Of a close or compact structure",
            "pos": "adjective",
            "sent1": "The tighter arrangement of the furniture made the room feel cozy.",
            "sent2": "The tighter design of the backpack allowed for more storage space.",
            "sent3": "The tighter packaging kept the fragile items safe during shipping.",
            "sent4": "The tighter weave of the fabric prevented any light from passing through.",
            "sent5": "The tighter formation of the group made them look more organized and united."
        }
    ]
}