{
    "term": "tight",
    "meanings": [
        {
            "definition": "Firmly fixed in place",
            "pos": "adjective",
            "sent1": "The lid was tight on the jar.",
            "sent2": "She tied the knot tight so it wouldn't come undone.",
            "sent3": "The cat squeezed into the tight space behind the couch.",
            "sent4": "His grip on the handle was as tight as a vice.",
            "sent5": "The screws were so tight, they wouldn't budge."
        },
        {
            "definition": "Not loose or slack",
            "pos": "adjective",
            "sent1": "The rope was pulled tight to keep the boat secure.",
            "sent2": "She wore a tight belt to hold up her pants.",
            "sent3": "The lid was so tight, I couldn't open the jar.",
            "sent4": "The lid was tight as a drum, not letting any air escape.",
            "sent5": "The lid was tight, making it hard to twist."
        },
        {
            "definition": "Closely packed together",
            "pos": "adjective",
            "sent1": "The books on the shelf were stacked tight.",
            "sent2": "The students sat tight in the crowded classroom.",
            "sent3": "The clothes were packed tight in the suitcase.",
            "sent4": "The trees were so tight together, it was hard to walk through.",
            "sent5": "The crowd was tight, making it difficult to move."
        },
        {
            "definition": "Difficult to move or open",
            "pos": "adjective",
            "sent1": "The rust made the door tight and hard to open.",
            "sent2": "The jar lid was too tight for her to unscrew.",
            "sent3": "The knot was tied so tight, it wouldn't come undone.",
            "sent4": "The window was painted shut, making it tight.",
            "sent5": "The lid was tight, refusing to give way."
        },
        {
            "definition": "Intoxicated or under the influence of drugs",
            "pos": "adjective",
            "sent1": "He felt tight after having a few drinks.",
            "sent2": "She looked tight and was stumbling around.",
            "sent3": "The party was wild, and everyone was getting tight.",
            "sent4": "He acted tight and couldn't walk straight.",
            "sent5": "The friends got tight at the bar and laughed loudly."
        }
    ]
}