{
    "term": "tile",
    "meanings": [
        {
            "definition": "A thin slab of baked clay or other material, used in overlapping rows for covering roofs.",
            "pos": "noun",
            "sent1": "The red tile on the roof kept the rain out.",
            "sent2": "The workers installed new tiles on the house's roof.",
            "sent3": "The mischievous squirrel used a tile as a makeshift umbrella during the storm.",
            "sent4": "Her smile was like a bright tile in the mosaic of his day.",
            "sent5": "The sound of rain on the tile roof was soothing."
        },
        {
            "definition": "A thin, flat slab of fired clay used for covering walls, floors, or other surfaces.",
            "pos": "noun",
            "sent1": "The kitchen floor was made of cool tile.",
            "sent2": "She carefully chose the perfect tiles for the bathroom renovation.",
            "sent3": "The cat enjoyed sliding across the smooth tile floor.",
            "sent4": "His heart felt like a broken tile, shattered into pieces.",
            "sent5": "The sunlight gleamed off the polished tile in the hallway."
        },
        {
            "definition": "A rectangular block used in playing games such as dominoes.",
            "pos": "noun",
            "sent1": "She placed the last tile on the dominoes table.",
            "sent2": "The children laughed as they played with colorful tiles.",
            "sent3": "The tile jumped off the table and landed on the floor, causing a commotion.",
            "sent4": "The dominoes fell like a line of tiles in a row.",
            "sent5": "The game ended when the final tile was played."
        },
        {
            "definition": "To cover with or as if with tiles.",
            "pos": "verb",
            "sent1": "They decided to tile the bathroom walls with blue mosaic tiles.",
            "sent2": "He carefully tiled the kitchen floor to create a beautiful pattern.",
            "sent3": "The magician tried to tile the stage with playing cards, but they kept disappearing.",
            "sent4": "Her love for him seemed to tile over the cracks in their relationship.",
            "sent5": "The artist's brush danced as it tiled the canvas with vibrant colors."
        }
    ]
}