{
    "term": "tillandsias",
    "meanings": [
        {
            "definition": "Tillandsias: a type of plant commonly known as air plants",
            "pos": "noun",
            "sent1": "I placed the tillandsias on the windowsill to soak up the sunlight.",
            "sent2": "The tillandsias in my terrarium are thriving without soil.",
            "sent3": "The tillandsias seemed to dance in the breeze, showing off their delicate beauty.",
            "sent4": "Her room was filled with tillandsias, creating a magical forest-like atmosphere.",
            "sent5": "The tillandsias hung from the ceiling like green jewels, adding a touch of nature indoors."
        },
        {
            "definition": "Tillandsias: plural form of tillandsia, a genus of plants in the bromeliad family",
            "pos": "noun",
            "sent1": "The collection of tillandsias in the greenhouse was truly impressive.",
            "sent2": "Tillandsias are fascinating plants that require minimal care.",
            "sent3": "The tillandsias gathered for a meeting, discussing their growth strategies.",
            "sent4": "The tillandsias stood tall and proud, a symbol of resilience in the garden.",
            "sent5": "In the botanical garden, the tillandsias stole the show with their unique shapes and colors."
        },
        {
            "definition": "Tillandsias: belonging to or characteristic of the genus Tillandsia",
            "pos": "adjective",
            "sent1": "The tillandsias flowers bloomed in vibrant hues, attracting butterflies.",
            "sent2": "Her terrarium was filled with various tillandsias species, each more beautiful than the last.",
            "sent3": "The tillandsias garden was a peaceful retreat, perfect for relaxation.",
            "sent4": "His artwork was inspired by the delicate beauty of tillandsias leaves.",
            "sent5": "The tillandsias fragrance filled the room, creating a calming atmosphere."
        }
    ]
}