{
    "term": "tilt",
    "meanings": [
        {
            "definition": "To move or cause to move into a sloping position.",
            "pos": "verb",
            "sent1": "She will tilt the book to see the pictures better.",
            "sent2": "Please tilt the cup to pour the water slowly.",
            "sent3": "He tried to tilt the chair back but almost fell over.",
            "sent4": "The sun's rays tilt towards the horizon as evening approaches.",
            "sent5": "The tower started to tilt dangerously after the earthquake."
        },
        {
            "definition": "A sloping position or movement.",
            "pos": "noun",
            "sent1": "The painting hung at a slight tilt on the wall.",
            "sent2": "The ship's deck had a noticeable tilt to one side.",
            "sent3": "The cat sat on the windowsill, enjoying the slight tilt.",
            "sent4": "The hill had a steep tilt, making it difficult to climb.",
            "sent5": "The table had a wobbly tilt, causing the cups to slide."
        },
        {
            "definition": "To lean or incline in a particular direction.",
            "pos": "verb",
            "sent1": "She will tilt her head to listen carefully.",
            "sent2": "The tree seemed to tilt towards the sunlight.",
            "sent3": "The tower of blocks started to tilt as he stacked them higher.",
            "sent4": "His decision to tilt towards a new career path surprised everyone.",
            "sent5": "The flower pot began to tilt as the wind blew stronger."
        },
        {
            "definition": "A feeling of being unsteady or dizzy.",
            "pos": "noun",
            "sent1": "After the roller coaster ride, she felt a slight tilt in her balance.",
            "sent2": "The sudden tilt made him grab onto the railing for support.",
            "sent3": "The tilt in his head caused by the spinning made him giggle.",
            "sent4": "Her world seemed to have a strange tilt after the dizzying experience.",
            "sent5": "The room had a weird tilt to it, making her feel disoriented."
        }
    ]
}