{
    "term": "tilter",
    "meanings": [
        {
            "definition": "A person or thing that tilts.",
            "pos": "noun",
            "sent1": "The playground tilter made the seesaw go up and down.",
            "sent2": "The table tilter accidentally knocked over the vase.",
            "sent3": "The tilter squirrel tried to balance on the slanted tree branch.",
            "sent4": "The strong wind turned the umbrella into a tilter.",
            "sent5": "The construction worker used the tilter to adjust the angle of the ramp."
        },
        {
            "definition": "A person who engages in jousting or tilting.",
            "pos": "noun",
            "sent1": "The brave knight was known as the best tilter in the kingdom.",
            "sent2": "The tilter prepared his horse for the upcoming jousting tournament.",
            "sent3": "The tilter's armor clanked loudly as he charged towards his opponent.",
            "sent4": "The skilled tilter aimed his lance with precision at the target.",
            "sent5": "The crowd cheered as the tilter knocked his opponent off their horse."
        },
        {
            "definition": "A device used for tilting or adjusting something.",
            "pos": "noun",
            "sent1": "The camera tilter helped capture the perfect angle for the photo.",
            "sent2": "The screen tilter allowed the user to adjust the display for better visibility.",
            "sent3": "The tilter on the chair made it comfortable to lean back.",
            "sent4": "The car tilter helped the mechanic access the underside of the vehicle.",
            "sent5": "The solar panel tilter maximized the absorption of sunlight for energy."
        },
        {
            "definition": "To cause to lean, incline, or slant.",
            "pos": "verb",
            "sent1": "She gently tiltered the painting to hang it straight on the wall.",
            "sent2": "The strong wind tiltered the tree towards the house.",
            "sent3": "He tiltered his head to the side to listen more closely.",
            "sent4": "The weight of the books tiltered the shelf slightly.",
            "sent5": "The hiker tiltered the backpack to distribute the weight evenly."
        },
        {
            "definition": "To engage in a joust or tilt.",
            "pos": "verb",
            "sent1": "The knights tiltered in the grand tournament for the king's favor.",
            "sent2": "She eagerly tiltered with her friends in a friendly competition.",
            "sent3": "The siblings playfully tiltered with foam swords in the backyard.",
            "sent4": "The competitors tiltered fiercely for the championship title.",
            "sent5": "The participants tiltered with skill and determination in the arena."
        }
    ]
}