{
    "term": "timeserver",
    "meanings": [
        {
            "definition": "a person who adjusts their opinions, principles, etc., to suit the times",
            "pos": "noun",
            "sent1": "The timeserver always changes their beliefs to fit in with the current trends.",
            "sent2": "The politician was known as a timeserver, adapting his views to match popular opinion.",
            "sent3": "The timeserver at the office meeting suddenly became a fan of the new coffee machine.",
            "sent4": "She was like a chameleon, a timeserver blending into any social circle effortlessly.",
            "sent5": "The timeserver was like a leaf in the wind, swaying with every passing breeze."
        },
        {
            "definition": "a person who is excessively deferential or submissive to those in authority",
            "pos": "noun",
            "sent1": "The timeserver always agrees with the boss, never questioning their decisions.",
            "sent2": "Being a timeserver, he never spoke up against the supervisor's unfair demands.",
            "sent3": "The timeserver nodded vigorously at everything the manager said, even if it was absurd.",
            "sent4": "She was a timeserver, bowing down to authority without a hint of resistance.",
            "sent5": "The timeserver was like a loyal dog, always seeking approval from the higher-ups."
        },
        {
            "definition": "a person who is dishonest or untrustworthy in order to gain favor or advantage",
            "pos": "noun",
            "sent1": "The timeserver manipulated his colleagues for personal gain.",
            "sent2": "She was known as a timeserver, willing to deceive others to climb the corporate ladder.",
            "sent3": "The timeserver cunningly twisted the truth to win the favor of the manager.",
            "sent4": "He was a timeserver, using deceit to secure promotions at the expense of others.",
            "sent5": "The timeserver was like a sly fox, always scheming for personal benefit."
        }
    ]
}