{
    "term": "timocratical",
    "meanings": [
        {
            "definition": "Relating to a government or society based on the principles of honor and military service.",
            "pos": "adjective",
            "sent1": "The timocratical leader was respected for his bravery and dedication to his country.",
            "sent2": "The soldiers in the timocratical society were honored for their service and valor.",
            "sent3": "The timocratical general always led his troops with courage and integrity.",
            "sent4": "Her timocratical spirit shone brightly in the face of adversity.",
            "sent5": "The timocratical code of conduct emphasized honor above all else."
        },
        {
            "definition": "Characterized by a system in which political power is determined by a person's wealth or property.",
            "pos": "adjective",
            "sent1": "In the timocratical society, those with more wealth held greater political influence.",
            "sent2": "The timocratical system favored the rich and powerful over the common people.",
            "sent3": "His timocratical approach to politics often led to decisions that benefited the wealthy elite.",
            "sent4": "The timocratical nature of the government made it difficult for the less affluent to have a voice.",
            "sent5": "Living in a timocratical society meant that money equated to power and status."
        },
        {
            "definition": "Of or relating to a social hierarchy based on honor and military prowess.",
            "pos": "adjective",
            "sent1": "The timocratical society valued honor and military skill above all else.",
            "sent2": "In the timocratical hierarchy, warriors were held in high esteem.",
            "sent3": "Her timocratical upbringing instilled in her a deep sense of respect for tradition and valor.",
            "sent4": "The timocratical structure of the community ensured that bravery was always recognized.",
            "sent5": "The timocratical culture celebrated acts of heroism and loyalty."
        }
    ]
}