{
    "term": "ting",
    "meanings": [
        {
            "definition": "A high-pitched, clear ringing sound.",
            "pos": "noun",
            "sent1": "The ting of the small bell was heard across the room.",
            "sent2": "I heard the ting of the wind chimes outside.",
            "sent3": "The ting of the bell made everyone smile.",
            "sent4": "Her laughter was like a ting in the air.",
            "sent5": "The ting of the glass breaking was unmistakable."
        },
        {
            "definition": "To make a high-pitched, clear ringing sound.",
            "pos": "verb",
            "sent1": "She would ting the triangle to get everyone's attention.",
            "sent2": "The metal spoon tinged against the ceramic bowl.",
            "sent3": "He tried to ting the glass with his voice, but it just sounded funny.",
            "sent4": "Her voice tinged with excitement as she spoke.",
            "sent5": "The phone tinged loudly in the quiet room."
        },
        {
            "definition": "A light metallic sound.",
            "pos": "noun",
            "sent1": "The ting of the coins in his pocket was comforting.",
            "sent2": "The ting of the hammer hitting the metal echoed in the workshop.",
            "sent3": "The ting of the keys jingling in her handbag was a familiar sound.",
            "sent4": "The ting of the metal gate opening signaled their arrival.",
            "sent5": "The ting of the metal on metal was music to his ears."
        },
        {
            "definition": "To make a light metallic sound.",
            "pos": "verb",
            "sent1": "She would ting the spoon against the glass to get attention.",
            "sent2": "The coins tinged as they fell into the piggy bank.",
            "sent3": "He tried to ting the metal ruler on the desk, but it just slid off.",
            "sent4": "The rain tinged softly on the metal roof.",
            "sent5": "The metal wire tinged as it was stretched taut."
        }
    ]
}