{
    "term": "tintinnabulary",
    "meanings": [
        {
            "definition": "Of or relating to bells or ringing sounds.",
            "pos": "adjective",
            "sent1": "The tintinnabulary chimes of the church bells filled the air with a joyful sound.",
            "sent2": "The room was decorated with tintinnabulary ornaments that jingled softly in the breeze.",
            "sent3": "The tintinnabulary wind chimes danced merrily in the wind, creating a melodious tune.",
            "sent4": "Her laughter was like a tintinnabulary melody that echoed through the room.",
            "sent5": "The tintinnabulary sound of the ice cream truck's bell brought smiles to the children's faces."
        },
        {
            "definition": "A collection of bells or bell-like objects.",
            "pos": "noun",
            "sent1": "The museum displayed a beautiful tintinnabulary of antique bells from around the world.",
            "sent2": "The cathedral's tower housed a magnificent tintinnabulary that could be heard for miles.",
            "sent3": "The magician's hat was filled with a tintinnabulary of tiny bells that jingled with every movement.",
            "sent4": "The forest was alive with a tintinnabulary of bird songs that filled the air with music.",
            "sent5": "The holiday parade featured a colorful tintinnabulary of jingling sleigh bells."
        },
        {
            "definition": "Producing a ringing or tinkling sound.",
            "pos": "adjective",
            "sent1": "The wind chimes made a soft tintinnabulary sound as the breeze gently swayed them.",
            "sent2": "The old music box played a sweet tintinnabulary tune that brought back memories.",
            "sent3": "The cat's collar had a tiny tintinnabulary bell that announced its every move.",
            "sent4": "The distant laughter of children had a tintinnabulary quality that warmed the heart.",
            "sent5": "The fountain in the garden created a soothing tintinnabulary ambiance with its gentle splashing."
        }
    ]
}