{
    "term": "tip",
    "meanings": [
        {
            "definition": "The pointed or rounded end of something",
            "pos": "noun",
            "sent1": "The pencil had a sharp tip for writing.",
            "sent2": "The tip of the iceberg was visible above the water.",
            "sent3": "Careful not to poke yourself with the sharp tip of the needle!",
            "sent4": "The tip of the mountain was covered in snow.",
            "sent5": "The tip of the arrow gleamed in the sunlight."
        },
        {
            "definition": "A small piece of advice or helpful hint",
            "pos": "noun",
            "sent1": "She gave me a great tip on how to improve my cooking.",
            "sent2": "His tip about time management really helped me.",
            "sent3": "Thanks for the tip on where to find the best pizza in town!",
            "sent4": "The tip to relax and take deep breaths before the exam was useful.",
            "sent5": "The tip to always double-check your work saved me from mistakes."
        },
        {
            "definition": "To give a small amount of money to someone for their service",
            "pos": "verb",
            "sent1": "I always tip the waiter for good service at the restaurant.",
            "sent2": "Don't forget to tip the delivery person for bringing your package.",
            "sent3": "He decided to tip the barista for the delicious coffee.",
            "sent4": "She likes to tip generously when she receives excellent service.",
            "sent5": "It is customary to tip the valet when they park your car."
        },
        {
            "definition": "To tilt or overturn",
            "pos": "verb",
            "sent1": "Be careful not to tip the vase while moving it.",
            "sent2": "The boat started to tip slightly in the strong wind.",
            "sent3": "The gust of wind almost caused the umbrella to tip over.",
            "sent4": "The heavy box began to tip as he lifted it off the ground.",
            "sent5": "The treehouse seemed to tip to one side after the storm."
        },
        {
            "definition": "To touch lightly",
            "pos": "verb",
            "sent1": "She used her finger to tip the edge of the book.",
            "sent2": "The butterfly would tip the flowers gently with its wings.",
            "sent3": "He would tip the keys of the piano softly to create a melody.",
            "sent4": "The cat would tip the glass off the table with a playful paw.",
            "sent5": "The raindrops would tip the leaves of the trees as they fell."
        }
    ]
}