{
    "term": "titer",
    "meanings": [
        {
            "definition": "The concentration of a substance in a solution, typically measured in terms of the number of units of the substance per unit volume of solution.",
            "pos": "noun",
            "sent1": "The titer of the medicine in the liquid was very high.",
            "sent2": "Scientists use a titer to find out how much salt is in the water.",
            "sent3": "The chef accidentally added a titer of sugar instead of salt to the recipe.",
            "sent4": "The titer of excitement in the room was palpable as the concert began.",
            "sent5": "The titer of perfume in the air was overwhelming, making it hard to breathe."
        },
        {
            "definition": "A test used to determine the concentration of a specific substance in a solution.",
            "pos": "noun",
            "sent1": "The lab technician conducted a titer to check the level of glucose in the blood sample.",
            "sent2": "Doctors often rely on titer results to diagnose certain medical conditions.",
            "sent3": "During the experiment, the titer unexpectedly showed a high level of acidity in the solution.",
            "sent4": "The titer acted like a detective, revealing the hidden concentration of the substance.",
            "sent5": "The titer test provided a clear picture of the amount of sugar present in the drink."
        },
        {
            "definition": "To measure the concentration of a substance in a solution.",
            "pos": "verb",
            "sent1": "The scientist will titer the solution to determine the amount of salt dissolved.",
            "sent2": "She titered the liquid carefully to ensure accurate results.",
            "sent3": "The students titered the solution with precision, following the instructions closely.",
            "sent4": "He titered the mixture like a skilled chemist, recording each measurement diligently.",
            "sent5": "Titering the solution revealed the exact concentration of the unknown substance."
        }
    ]
}