{
    "term": "titis",
    "meanings": [
        {
            "definition": "A small bird",
            "pos": "noun",
            "sent1": "The colorful titis chirped happily in the tree.",
            "sent2": "I saw a titis hopping around in the garden.",
            "sent3": "The titis tried to steal my sandwich, but I shooed it away.",
            "sent4": "Her singing voice was as melodious as a titis in the morning.",
            "sent5": "The titis' feathers were as vibrant as a rainbow."
        },
        {
            "definition": "A type of monkey",
            "pos": "noun",
            "sent1": "The titis swung gracefully from branch to branch.",
            "sent2": "The zoo had a family of titis playing together.",
            "sent3": "The mischievous titis stole the zookeeper's hat and ran off.",
            "sent4": "Her hair was so wild, it looked like a titis's fur.",
            "sent5": "The titis' eyes were full of curiosity and intelligence."
        },
        {
            "definition": "A type of inflammation of the breast",
            "pos": "noun",
            "sent1": "She went to the doctor for treatment of titis in her breast.",
            "sent2": "The nurse explained the symptoms of titis in detail.",
            "sent3": "Despite the discomfort, she joked about her titis to lighten the mood.",
            "sent4": "The titis in her breast felt like a hot, painful lump.",
            "sent5": "The doctor prescribed medication to relieve the titis inflammation."
        },
        {
            "definition": "A type of inflammation of the eyelids",
            "pos": "noun",
            "sent1": "His red, swollen eyelids indicated a case of titis.",
            "sent2": "The doctor recommended eye drops to treat the titis.",
            "sent3": "He couldn't stop blinking due to the irritating titis.",
            "sent4": "The titis in his eyelids made it hard for him to see clearly.",
            "sent5": "The itching sensation from the titis was unbearable."
        }
    ]
}