{
    "term": "toasters",
    "meanings": [
        {
            "definition": "A kitchen appliance used for toasting bread.",
            "pos": "noun",
            "sent1": "My mom always uses the toasters to make crispy toast for breakfast.",
            "sent2": "The toasters in the kitchen are essential for making a quick snack.",
            "sent3": "The toasters decided to take a break and refused to toast any more bread.",
            "sent4": "The toasters hummed happily as they transformed plain bread into golden slices.",
            "sent5": "The toasters gleamed under the kitchen lights, ready to turn bread into delicious toast."
        },
        {
            "definition": "A person or thing that toasts.",
            "pos": "noun",
            "sent1": "The chef, known as the toasters, was famous for his perfectly toasted sandwiches.",
            "sent2": "The toasters at the party made sure everyone's bread was toasted to perfection.",
            "sent3": "The toasters at the bakery were always in a good mood, spreading warmth and cheer.",
            "sent4": "She was like a toasters, always bringing a touch of warmth to every conversation.",
            "sent5": "The toasters in the kitchen seemed to have a magical touch, turning bread into golden perfection."
        },
        {
            "definition": "A device for transmitting or receiving radio signals.",
            "pos": "noun",
            "sent1": "The toasters in the control room were used to send important messages across the airwaves.",
            "sent2": "The military relied on the toasters to communicate securely during missions.",
            "sent3": "The toasters at the radio station were always buzzing with the latest news updates.",
            "sent4": "His words were like toasters, sending waves of comfort to those who listened.",
            "sent5": "The toasters on the ship crackled to life, connecting them to the outside world in the middle of the ocean."
        }
    ]
}