{
    "term": "toast",
    "meanings": [
        {
            "definition": "Sliced bread browned by exposure to heat.",
            "pos": "noun",
            "sent1": "I like to eat toast with butter for breakfast.",
            "sent2": "She made some toast to go with her eggs.",
            "sent3": "The toast popped out of the toaster and smelled delicious.",
            "sent4": "The toast was perfectly golden, like the sun on a summer day.",
            "sent5": "The crunch of the toast was music to my ears."
        },
        {
            "definition": "A call to a gathering to raise glasses and drink to someone or something.",
            "pos": "noun",
            "sent1": "They raised their glasses in a toast to the newlyweds.",
            "sent2": "The best man gave a heartfelt toast at the wedding reception.",
            "sent3": "The toast to the bride and groom brought tears to everyone's eyes.",
            "sent4": "The toast to friendship echoed through the room like a sweet melody.",
            "sent5": "The toast to love filled the air with warmth and joy."
        },
        {
            "definition": "To brown by exposure to heat.",
            "pos": "verb",
            "sent1": "She likes to toast her bread in the oven for extra crispiness.",
            "sent2": "The chef will toast the buns on the grill for the burgers.",
            "sent3": "He accidentally toasted the bread too much, making it black.",
            "sent4": "The sun toasted my skin as I lay on the beach.",
            "sent5": "The campfire toasted the marshmallows to perfection."
        },
        {
            "definition": "To propose a drink to someone or something.",
            "pos": "verb",
            "sent1": "He will toast to the success of the project at the meeting.",
            "sent2": "Let's all toast to good health and happiness!",
            "sent3": "She raised her glass to toast the start of a new chapter.",
            "sent4": "The captain toasted to the safe return of his crew.",
            "sent5": "They gathered around the fire to toast marshmallows and share stories."
        }
    ]
}