{
    "term": "toepiece",
    "meanings": [
        {
            "definition": "The front part of a shoe that covers the toes.",
            "pos": "noun",
            "sent1": "She carefully tied the laces around the toepiece of her shoe.",
            "sent2": "The ballet dancer's toepiece was reinforced for extra durability.",
            "sent3": "The mischievous puppy chewed on the toepiece of every shoe in the house.",
            "sent4": "Her toepiece was like a shield, protecting her toes from the cold pavement.",
            "sent5": "The bright red toepiece of his sneaker stood out in the sea of black shoes."
        },
        {
            "definition": "A piece of equipment attached to the end of a microscope to hold the slide in place.",
            "pos": "noun",
            "sent1": "The scientist carefully adjusted the toepiece to secure the slide for observation.",
            "sent2": "Make sure the toepiece is clean before placing the slide for examination.",
            "sent3": "The toepiece of the microscope decided it needed a break and slid off the table.",
            "sent4": "The toepiece of the microscope was the unsung hero of every scientific discovery.",
            "sent5": "With a gentle click, the toepiece locked the slide in place, ready for analysis."
        },
        {
            "definition": "The part of a pair of glasses that rests on the bridge of the nose.",
            "pos": "noun",
            "sent1": "She adjusted the toepiece of her glasses to sit comfortably on her nose.",
            "sent2": "The toepiece of his glasses left a slight mark on the bridge of his nose.",
            "sent3": "The toepiece of the glasses decided to take a nap on the bridge of the nose.",
            "sent4": "Her toepiece glasses were like a gentle hug on the bridge of her nose.",
            "sent5": "The toepiece of the glasses was the key to keeping them from slipping down her nose."
        }
    ]
}