{
    "term": "toil",
    "meanings": [
        {
            "definition": "Work extremely hard or incessantly",
            "pos": "verb",
            "sent1": "She had to toil all day in the fields under the scorching sun.",
            "sent2": "The workers toil tirelessly to meet their production targets.",
            "sent3": "The ants toil away, carrying food to their anthill with determination.",
            "sent4": "He could see her toil up the steep hill, her determination shining through.",
            "sent5": "The old man's wrinkled hands showed the years of toil he had endured."
        },
        {
            "definition": "Laborious task",
            "pos": "noun",
            "sent1": "Cleaning the entire house was a real toil for her.",
            "sent2": "The journey through the dense forest was a toil for the weary travelers.",
            "sent3": "The toil of untangling Christmas lights every year was finally worth it.",
            "sent4": "The toil of climbing the mountain was rewarded with a breathtaking view.",
            "sent5": "The toil of studying for the exam paid off with a high score."
        },
        {
            "definition": "Hard work",
            "pos": "noun",
            "sent1": "His success was a result of years of toil and dedication.",
            "sent2": "The toil put into the project was evident in its high quality.",
            "sent3": "The toil of building a sandcastle was ruined by a playful wave.",
            "sent4": "Her toil in the garden yielded a bountiful harvest of vegetables.",
            "sent5": "The toil of training every day made him a skilled athlete."
        },
        {
            "definition": "Struggle or strive",
            "pos": "verb",
            "sent1": "She had to toil against the strong currents to reach the shore.",
            "sent2": "They toil to overcome the challenges that come their way.",
            "sent3": "The little bird toils to build its nest high up in the tree.",
            "sent4": "He toils to improve himself every day, never giving up.",
            "sent5": "The young sapling toils to grow tall and strong in the forest."
        },
        {
            "definition": "Exhausting physical labor",
            "pos": "noun",
            "sent1": "The toil of carrying heavy bricks all day left him exhausted.",
            "sent2": "The miners endure the toil of digging deep into the earth for precious minerals.",
            "sent3": "The toil of chopping wood for the fireplace kept him warm in winter.",
            "sent4": "The toil of farming under the hot sun was backbreaking but necessary.",
            "sent5": "The toil of construction workers is often underappreciated by passersby."
        }
    ]
}