{
    "term": "toile",
    "meanings": [
        {
            "definition": "A sheer fabric, typically cotton or linen, used for making clothes or curtains.",
            "pos": "noun",
            "sent1": "She picked out a delicate toile fabric for the curtains in her bedroom.",
            "sent2": "The dress was made of a beautiful toile that flowed gracefully as she walked.",
            "sent3": "He accidentally tore the toile while trying to hang it up, causing a comical scene.",
            "sent4": "The toile of her dress was like a whisper of elegance in the crowded room.",
            "sent5": "The toile curtains let in just the right amount of sunlight, creating a warm glow in the room."
        },
        {
            "definition": "A test garment made from inexpensive fabric to check the fit of a pattern.",
            "pos": "noun",
            "sent1": "Before cutting the expensive fabric, she first made a toile to ensure the dress would fit perfectly.",
            "sent2": "The toile revealed that the sleeves were too long and needed adjustment.",
            "sent3": "Her toile looked like a quirky makeshift outfit, making everyone chuckle.",
            "sent4": "The toile served as a blueprint for the final garment, guiding the tailor's hands.",
            "sent5": "The toile allowed her to make alterations without ruining the actual fabric, saving her time and money."
        },
        {
            "definition": "A decorative fabric with a repeated pattern, often depicting scenes or landscapes.",
            "pos": "noun",
            "sent1": "The living room was adorned with elegant toile upholstery featuring pastoral scenes.",
            "sent2": "She bought a set of toile napkins with intricate patterns for the dinner party.",
            "sent3": "The toile on the throw pillows seemed to tell a whimsical story to anyone who looked closely.",
            "sent4": "The toile wallpaper transformed the room into a serene countryside retreat.",
            "sent5": "The toile tablecloth added a touch of sophistication to the dining table, setting the perfect ambiance for the meal."
        }
    ]
}