{
    "term": "token",
    "meanings": [
        {
            "definition": "A thing serving as a visible or tangible representation of a fact, quality, feeling, etc.",
            "pos": "noun",
            "sent1": "She kept the lucky token in her pocket for good luck.",
            "sent2": "The medal he received was a token of appreciation for his hard work.",
            "sent3": "The token she found on the sidewalk made her smile.",
            "sent4": "His kind gesture was a token of his true character.",
            "sent5": "The token of friendship they exchanged was a small keychain."
        },
        {
            "definition": "A voucher that can be exchanged for goods or services.",
            "pos": "noun",
            "sent1": "He handed the token to the cashier to get his free drink.",
            "sent2": "The concert ticket was the token for entry into the venue.",
            "sent3": "She found a token for a discount at the local bakery.",
            "sent4": "The token for the amusement park ride was in his pocket.",
            "sent5": "The token for the bus ride was a small paper slip."
        },
        {
            "definition": "A piece of stamped metal or plastic used as a substitute for money.",
            "pos": "noun",
            "sent1": "He inserted the token into the arcade machine to play a game.",
            "sent2": "The subway token was needed to pass through the turnstile.",
            "sent3": "She collected tokens from different countries as souvenirs.",
            "sent4": "The casino token gleamed under the bright lights.",
            "sent5": "The token for the parking garage was a small silver disc."
        },
        {
            "definition": "A symbol or sign used to represent something.",
            "pos": "noun",
            "sent1": "The dove is often seen as a token of peace.",
            "sent2": "The heart shape is a token of love and affection.",
            "sent3": "The handshake was a token of agreement between them.",
            "sent4": "The white flag is a token of surrender in battle.",
            "sent5": "The red rose is a token of passion and romance."
        }
    ]
}