{
    "term": "toko",
    "meanings": [
        {
            "definition": "A shop or store",
            "pos": "noun",
            "sent1": "I visited the toko to buy some snacks.",
            "sent2": "The toko on the corner sells fresh fruits and vegetables.",
            "sent3": "The toko had a sale, so I bought too many candies!",
            "sent4": "Her room looked like a toko with all the clothes scattered around.",
            "sent5": "The toko was filled with the aroma of freshly baked bread."
        },
        {
            "definition": "To place or put",
            "pos": "verb",
            "sent1": "Please toko the books on the shelf neatly.",
            "sent2": "He tokoed the vase carefully on the table.",
            "sent3": "I tokoed the hat on the dog's head for a funny picture.",
            "sent4": "She tokoed her trust in him, hoping he would keep his promise.",
            "sent5": "The artist tokoed the final brushstroke on the canvas, completing the masterpiece."
        },
        {
            "definition": "A type of tree in New Zealand",
            "pos": "noun",
            "sent1": "The toko tree in the park has beautiful flowers.",
            "sent2": "The leaves of the toko tree rustled in the wind.",
            "sent3": "The toko tree provided shade for the picnic on a sunny day.",
            "sent4": "The toko tree stood tall like a guardian in the forest.",
            "sent5": "The toko tree's branches swayed gracefully in the breeze."
        },
        {
            "definition": "A type of traditional Japanese martial arts training hall",
            "pos": "noun",
            "sent1": "The students practiced their moves in the toko.",
            "sent2": "The toko echoed with the sounds of training.",
            "sent3": "During the tournament, the toko was bustling with competitors.",
            "sent4": "The toko was a place of discipline and respect.",
            "sent5": "The toko's walls witnessed the dedication of many martial artists."
        }
    ]
}