{
    "term": "tole",
    "meanings": [
        {
            "definition": "To cover with a thin layer of metal",
            "pos": "verb",
            "sent1": "She toled the key with a shiny layer of silver.",
            "sent2": "The artist toles the frame with a coat of gold paint.",
            "sent3": "The mischievous elf toled the gnome's hat with glittery metal.",
            "sent4": "The moonlight toles the lake with a shimmering blanket of silver.",
            "sent5": "The blacksmith toles the sword with a protective layer of steel."
        },
        {
            "definition": "To entice or persuade",
            "pos": "verb",
            "sent1": "He toles his friends to join him on the adventure.",
            "sent2": "The salesman toles customers with promises of great deals.",
            "sent3": "The aroma of freshly baked cookies toles the children into the kitchen.",
            "sent4": "The mysterious stranger toles the detective with cryptic clues.",
            "sent5": "The music toles the audience to dance with its catchy beat."
        },
        {
            "definition": "A type of painted or lacquered metalware",
            "pos": "noun",
            "sent1": "The tole on the tray gleamed with intricate floral patterns.",
            "sent2": "She displayed her collection of colorful tole pieces in the living room.",
            "sent3": "The antique shop had a beautiful tole vase on the shelf.",
            "sent4": "The tole lantern lit up the room with a warm glow.",
            "sent5": "The tole teapot added a touch of elegance to the table setting."
        },
        {
            "definition": "A toll or tax collected by the government",
            "pos": "noun",
            "sent1": "The tole on imported goods helped fund public projects.",
            "sent2": "Travelers had to pay a tole at the city gates.",
            "sent3": "The villagers grumbled about the increasing tole on their crops.",
            "sent4": "The king imposed a heavy tole on the merchants in the market.",
            "sent5": "The tole on property ownership was a burden for many families."
        }
    ]
}