{
    "term": "tolls",
    "meanings": [
        {
            "definition": "A charge or fee for using a particular road or bridge.",
            "pos": "noun",
            "sent1": "The tolls for the bridge were too high for many drivers.",
            "sent2": "I had to pay the tolls to cross the highway.",
            "sent3": "The tolls for the new road were so expensive that I had to take a longer route.",
            "sent4": "The tolls on this highway are like a small tax on every journey.",
            "sent5": "The tolls at the entrance gate were a barrier to my travel plans."
        },
        {
            "definition": "The sound of a bell ringing.",
            "pos": "noun",
            "sent1": "The tolls of the church bell echoed through the village.",
            "sent2": "I woke up to the tolls of the alarm clock.",
            "sent3": "The tolls of the bell signaled the start of the ceremony.",
            "sent4": "The tolls of the bell were a soothing melody in the evening.",
            "sent5": "The tolls of the bell added a peaceful atmosphere to the town square."
        },
        {
            "definition": "To ring a bell slowly and repeatedly.",
            "pos": "verb",
            "sent1": "I tolls the bell to announce the end of the day.",
            "sent2": "The church bells tolls every hour.",
            "sent3": "He tolls the bell to gather everyone for the meeting.",
            "sent4": "The old clock tower tolls beautifully in the evening.",
            "sent5": "The bell tolls softly, creating a calming effect in the room."
        },
        {
            "definition": "To cause harm or suffering over a period of time.",
            "pos": "verb",
            "sent1": "The constant stress tolls on his health.",
            "sent2": "The long hours of work tolls on her well-being.",
            "sent3": "The never-ending assignments tolls on my energy levels.",
            "sent4": "The emotional burden tolls heavily on his heart.",
            "sent5": "The relentless pressure tolls on their mental health."
        }
    ]
}