{
    "term": "tollie",
    "meanings": [
        {
            "definition": "A small, round, sweet biscuit or cookie.",
            "pos": "noun",
            "sent1": "I love to snack on a tollie with my tea.",
            "sent2": "My grandma bakes the best tollies for us.",
            "sent3": "The tollie crumbled in my hand, making a mess.",
            "sent4": "The tollie was a delightful treat, melting in my mouth.",
            "sent5": "The tollie was so soft and chewy, like a little cloud of sweetness."
        },
        {
            "definition": "A slang term for a cigarette.",
            "pos": "noun",
            "sent1": "He stepped outside to smoke a quick tollie.",
            "sent2": "In some places, people call a cigarette a tollie.",
            "sent3": "She asked for a tollie, but meant a cigarette, not a cookie.",
            "sent4": "The tollie dangled from his lips, releasing smoke into the air.",
            "sent5": "The smell of the tollie lingered in the room long after he finished smoking."
        },
        {
            "definition": "To make a ringing sound, like a bell.",
            "pos": "verb",
            "sent1": "The bell began to tollie, signaling the end of the ceremony.",
            "sent2": "The wind made the chimes tollie softly in the distance.",
            "sent3": "The phone started to tollie just as I was about to leave.",
            "sent4": "Her laughter seemed to tollie through the room, infectious and joyful.",
            "sent5": "The church bells tollie every evening, echoing through the town."
        },
        {
            "definition": "A fee or charge for using a road or bridge.",
            "pos": "noun",
            "sent1": "We had to pay a tollie to cross the bridge.",
            "sent2": "The tollie for the highway was quite expensive.",
            "sent3": "The tollie booth was empty, so we drove through without paying.",
            "sent4": "The tollie collection helps maintain the roads for everyone's safety.",
            "sent5": "The tollie was a small price to pay for the convenience of a smooth road."
        }
    ]
}