{
    "term": "tolsey",
    "meanings": [
        {
            "definition": "A tollhouse or tollbooth.",
            "pos": "noun",
            "sent1": "The old tolsey stood at the entrance of the town, collecting tolls from passing travelers.",
            "sent2": "Drivers stopped at the tolsey to pay the toll before continuing on their journey.",
            "sent3": "The tolsey clerk accidentally gave the wrong change to a customer, causing a humorous mix-up.",
            "sent4": "The tolsey loomed like a guardian at the edge of the village, demanding payment for passage.",
            "sent5": "The tolsey's wooden beams creaked in the wind, a reminder of the tolls of the past."
        },
        {
            "definition": "A place where tolls are collected.",
            "pos": "noun",
            "sent1": "The busy highway had a tolsey where drivers had to pay before entering the city.",
            "sent2": "The tolsey was bustling with activity as travelers lined up to pay their tolls.",
            "sent3": "The tolsey's bell rang loudly each time a toll was collected, creating a musical atmosphere.",
            "sent4": "The tolsey was like a treasure chest, gathering coins from all who passed through.",
            "sent5": "The tolsey's windows glinted in the sunlight, a beacon for those approaching with tolls."
        },
        {
            "definition": "A building used for collecting tolls.",
            "pos": "noun",
            "sent1": "The historic tolsey was now a museum, showcasing the tools of toll collection from the past.",
            "sent2": "The tolsey's architecture was unique, designed to efficiently collect tolls from travelers.",
            "sent3": "The tolsey's roof leaked whenever it rained, adding a quirky charm to the toll collection process.",
            "sent4": "The tolsey was a fortress of fees, guarding the road and demanding payment from all who passed.",
            "sent5": "The tolsey's walls echoed with the clink of coins, a constant reminder of the toll collection duties."
        }
    ]
}