{
    "term": "tolus",
    "meanings": [
        {
            "definition": "A type of volcanic rock formed from hardened lava.",
            "pos": "noun",
            "sent1": "The hikers marveled at the unique texture of the tolus they found on the mountain.",
            "sent2": "The scientists studied the composition of the tolus to understand its formation.",
            "sent3": "The artist painted a picture of a tolus with a smiley face, creating a whimsical masterpiece.",
            "sent4": "The tolus stood like a silent guardian, unmoving and strong against the elements.",
            "sent5": "The children collected pieces of tolus to create colorful jewelry for themselves."
        },
        {
            "definition": "A unit of weight used in ancient Greece, equivalent to about 6.5 pounds.",
            "pos": "noun",
            "sent1": "The merchant measured the goods using a tolus to ensure accuracy.",
            "sent2": "In ancient times, traders would exchange goods based on the weight of a tolus.",
            "sent3": "The baker accidentally used a tolus of flour instead of a cup, resulting in a giant loaf of bread.",
            "sent4": "The tolus of responsibility weighed heavily on his shoulders as he made important decisions.",
            "sent5": "She lifted the heavy box effortlessly, as if it weighed no more than a tolus."
        },
        {
            "definition": "A type of resin used in perfumes and incense.",
            "pos": "noun",
            "sent1": "The perfumer added a drop of tolus to the fragrance to enhance its scent.",
            "sent2": "The temple was filled with the sweet aroma of burning tolus during the ceremony.",
            "sent3": "The mischievous cat knocked over the bottle of tolus, creating a sticky mess.",
            "sent4": "Her laughter hung in the air like the lingering fragrance of tolus.",
            "sent5": "The room was filled with the comforting smell of tolus, creating a peaceful atmosphere."
        }
    ]
}