{
    "term": "toluid",
    "meanings": [
        {
            "definition": "A derivative of toluene.",
            "pos": "noun",
            "sent1": "The scientist studied the properties of toluid in the lab.",
            "sent2": "The factory produced a large quantity of toluid for industrial use.",
            "sent3": "The artist accidentally spilled toluid on their canvas, creating a colorful mess.",
            "sent4": "The toluid of creativity flowed through her veins, inspiring her to paint masterpieces.",
            "sent5": "The distinct smell of toluid lingered in the air, reminding him of his chemistry experiments."
        },
        {
            "definition": "A type of chemical compound.",
            "pos": "noun",
            "sent1": "She mixed different types of chemical compounds, including toluid, for her experiment.",
            "sent2": "The students learned about the properties of various chemical compounds, such as toluid.",
            "sent3": "The curious cat accidentally knocked over a bottle of toluid, causing a mini chemical reaction.",
            "sent4": "His mind was a complex web of thoughts, each one a different chemical compound like toluid.",
            "sent5": "The shelves in the lab were filled with colorful bottles of different chemical compounds, including toluid."
        },
        {
            "definition": "A substance used in the production of dyes.",
            "pos": "noun",
            "sent1": "The textile industry relied on toluid for creating vibrant dyes for fabrics.",
            "sent2": "The artist carefully measured the amount of toluid needed to dye the fabric a deep blue.",
            "sent3": "The mischievous child accidentally spilled toluid on their white shirt, turning it into a tie-dye masterpiece.",
            "sent4": "Her laughter was like a splash of toluid, coloring the room with joy.",
            "sent5": "The sun shining through the window illuminated the bottles of toluid on the shelf, ready to be used in dyeing."
        }
    ]
}