{
    "term": "toluide",
    "meanings": [
        {
            "definition": "A chemical compound used in the production of dyes and pharmaceuticals.",
            "pos": "noun",
            "sent1": "The factory imported a large quantity of toluides for making colorful dyes.",
            "sent2": "Scientists study the properties of toluides to create new medicines.",
            "sent3": "The mischievous cat accidentally spilled toluides on the white carpet, turning it into a rainbow.",
            "sent4": "Her creativity was a mix of ideas, like a palette of toluides waiting to be blended into art.",
            "sent5": "The smell of toluides lingered in the lab, a reminder of the vibrant products they helped produce."
        },
        {
            "definition": "To treat or dye with toluides.",
            "pos": "verb",
            "sent1": "She toluided the fabric to achieve a deep blue color.",
            "sent2": "The tailor toluides the cloth to give it a unique pattern.",
            "sent3": "The children giggled as they toluided their clothes for a tie-dye party.",
            "sent4": "His words toluided her heart, coloring it with warmth and affection.",
            "sent5": "The artist toluided the canvas with bold strokes, creating a masterpiece of colors."
        },
        {
            "definition": "A derivative of toluene.",
            "pos": "noun",
            "sent1": "The scientist explained the properties of toluides as derivatives of toluene.",
            "sent2": "The company specializes in producing various toluides for industrial use.",
            "sent3": "The toluides sat quietly on the shelf, waiting to be transformed into useful products.",
            "sent4": "Her thoughts were like toluides, connected to the main idea but with unique characteristics.",
            "sent5": "The market demand for toluides increased due to their versatile applications in different industries."
        }
    ]
}