{
    "term": "tom",
    "meanings": [
        {
            "definition": "A male given name.",
            "pos": "noun",
            "sent1": "Tom is a popular name for boys.",
            "sent2": "My friend's name is Tom.",
            "sent3": "Tom is a strong and classic name for a boy.",
            "sent4": "In the story, Tom symbolizes bravery and courage.",
            "sent5": "When you hear the name Tom, you think of a friendly guy."
        },
        {
            "definition": "A male turkey.",
            "pos": "noun",
            "sent1": "The farmer raised a tom for Thanksgiving dinner.",
            "sent2": "The tom strutted proudly around the farm.",
            "sent3": "The tom gobbled loudly, showing off for the hens.",
            "sent4": "The tom's feathers shimmered in the sunlight like a colorful fan.",
            "sent5": "The tom's call echoed through the forest, announcing his presence."
        },
        {
            "definition": "A male cat.",
            "pos": "noun",
            "sent1": "Tom enjoys napping in the sun.",
            "sent2": "The tom chased after a mouse in the garden.",
            "sent3": "Tom purred contentedly as he curled up on the couch.",
            "sent4": "The tom moved with grace and agility, like a silent shadow.",
            "sent5": "The tom's eyes gleamed in the darkness, watching for prey."
        },
        {
            "definition": "A male sheep.",
            "pos": "noun",
            "sent1": "The shepherd sheared the tom to collect wool.",
            "sent2": "The tom grazed peacefully in the meadow.",
            "sent3": "The tom bleated loudly, trying to find the rest of the flock.",
            "sent4": "The tom's fleece was as white as freshly fallen snow.",
            "sent5": "The tom followed the shepherd faithfully, trusting his guidance."
        },
        {
            "definition": "A male goose.",
            "pos": "noun",
            "sent1": "The tom honked loudly as he flew overhead.",
            "sent2": "The tom waddled proudly by the pond.",
            "sent3": "Tom flapped his wings excitedly, ready to take flight.",
            "sent4": "The tom's feathers shimmered in the sunlight like a golden cloak.",
            "sent5": "The tom led the flock with confidence, guiding them to safety."
        }
    ]
}