{
    "term": "tomalley",
    "meanings": [
        {
            "definition": "The soft, green substance found in the body cavity of lobsters and other crustaceans.",
            "pos": "noun",
            "sent1": "The tomalley is a green substance in lobsters.",
            "sent2": "I learned about tomalley in lobsters during science class.",
            "sent3": "The chef accidentally spilled tomalley on the kitchen floor, creating a messy situation.",
            "sent4": "Her eyes sparkled like tomalley in the sunlight, bright and vibrant.",
            "sent5": "The tomalley looked like a hidden treasure inside the lobster, waiting to be discovered."
        },
        {
            "definition": "To extract or consume the tomalley from a lobster.",
            "pos": "verb",
            "sent1": "We carefully tomalley the lobster to enjoy its unique flavor.",
            "sent2": "She always prefers to tomalley the lobster herself rather than buying it pre-prepared.",
            "sent3": "He joked that he could tomalley lobsters for a living with his skillful hands.",
            "sent4": "The chef's ability to tomalley lobsters quickly impressed the restaurant patrons.",
            "sent5": "As she tomalleyed the lobster, the aroma of the sea filled the kitchen, making her smile."
        },
        {
            "definition": "The tomalley is considered a delicacy in some cuisines.",
            "pos": "noun",
            "sent1": "In certain cultures, tomalley is a prized delicacy served at special occasions.",
            "sent2": "The restaurant's signature dish featured tomalley as the star ingredient.",
            "sent3": "She savored every bite of the tomalley dish, savoring its rich flavor.",
            "sent4": "The tomalley dish was so exquisite that it left a lasting impression on the diners.",
            "sent5": "The aroma of the tomalley dish wafted through the air, enticing everyone in the room."
        }
    ]
}