{
    "term": "tombaks",
    "meanings": [
        {
            "definition": "a type of drum",
            "pos": "noun",
            "sent1": "The rhythmic beats of the tombaks filled the air with music.",
            "sent2": "The musician played the tombaks at the concert.",
            "sent3": "During the parade, the tombaks started playing on their own!",
            "sent4": "The tombaks echoed through the room like a heartbeat.",
            "sent5": "The intricate designs on the tombaks made them stand out."
        },
        {
            "definition": "a type of weapon",
            "pos": "noun",
            "sent1": "The soldiers carried sharp tombaks into battle.",
            "sent2": "Legends spoke of warriors skilled in wielding tombaks.",
            "sent3": "In the movie, the hero's tombaks never ran out of ammo.",
            "sent4": "His words were like tombaks, cutting through the silence.",
            "sent5": "The tombaks gleamed menacingly in the moonlight."
        },
        {
            "definition": "a type of tree",
            "pos": "noun",
            "sent1": "The forest was filled with tall tombaks swaying in the wind.",
            "sent2": "The birds nested in the branches of the ancient tombaks.",
            "sent3": "The tombaks in the park seemed to whisper secrets to each other.",
            "sent4": "The tombaks stood strong like guardians of the forest.",
            "sent5": "The leaves of the tombaks rustled softly in the breeze."
        },
        {
            "definition": "a type of food",
            "pos": "noun",
            "sent1": "The aroma of the freshly baked tombaks wafted from the kitchen.",
            "sent2": "The chef prepared a delicious dish using exotic tombaks.",
            "sent3": "At the festival, they served sweet tombaks with a twist.",
            "sent4": "The tombaks melted in her mouth, bursting with flavor.",
            "sent5": "The tombaks were the highlight of the feast, enjoyed by all."
        }
    ]
}