{
    "term": "tombolos",
    "meanings": [
        {
            "definition": "A tombolo is a narrow strip of land connecting an island to the mainland.",
            "pos": "noun",
            "sent1": "The tombolos allowed people to walk from the mainland to the island easily.",
            "sent2": "We walked along the tombolos to reach the island without needing a boat.",
            "sent3": "The tombolos seemed like a magical bridge between the island and the mainland.",
            "sent4": "The tombolos, like nature's delicate thread, linked the island to the mainland.",
            "sent5": "The tombolos stood as a natural pathway, uniting the island and the mainland."
        },
        {
            "definition": "Tombolos are formed by the deposition of sediment by waves and currents.",
            "pos": "noun",
            "sent1": "The tombolos were created by the waves bringing sand and rocks together.",
            "sent2": "The beach tombolos formed over time due to the action of the sea.",
            "sent3": "The tombolos looked like a sandy puzzle made by the ocean's hand.",
            "sent4": "The tombolos emerged like sculptures shaped by the dance of waves and currents.",
            "sent5": "The tombolos were nature's artwork, crafted by the sea's patient brushstrokes."
        },
        {
            "definition": "The tombolo provided easy access to the island for tourists.",
            "pos": "noun",
            "sent1": "Tourists crossed the tombolos to reach the island without any difficulty.",
            "sent2": "The convenient tombolo allowed visitors to explore the island effortlessly.",
            "sent3": "The tombolo was like a welcoming path inviting tourists to the island.",
            "sent4": "The tombolo acted as a friendly bridge for tourists to step onto the island.",
            "sent5": "The tombolo beckoned tourists with its easy route to the island's attractions."
        }
    ]
}