{
    "term": "tomboy",
    "meanings": [
        {
            "definition": "A girl who behaves in a boyish manner",
            "pos": "noun",
            "sent1": "The tomboy loved climbing trees and playing sports with the boys.",
            "sent2": "She was known as a tomboy because she enjoyed wearing jeans and playing soccer.",
            "sent3": "The tomboy's idea of dressing up was wearing a baseball cap and sneakers to a party.",
            "sent4": "Her tomboy nature shone through as she fearlessly tackled any challenge that came her way.",
            "sent5": "The image of the tomboy swinging from the monkey bars stuck in everyone's mind."
        },
        {
            "definition": "A girl who enjoys rough, noisy activities traditionally associated with boys",
            "pos": "noun",
            "sent1": "The tomboy relished in playing rough games like tag and dodgeball.",
            "sent2": "She was considered a tomboy because she loved playing in the mud and climbing trees.",
            "sent3": "The tomboy's laughter echoed through the playground as she played a rowdy game of kickball.",
            "sent4": "Her tomboy spirit roared like a lion as she fearlessly jumped into every adventure.",
            "sent5": "The memory of the tomboy's energetic antics lingered long after she left the park."
        },
        {
            "definition": "A girl who prefers activities typically associated with boys",
            "pos": "noun",
            "sent1": "The tomboy enjoyed activities like skateboarding and building model airplanes.",
            "sent2": "She stood out as a tomboy because she loved playing video games and fixing bicycles.",
            "sent3": "The tomboy's toolbox was her favorite possession, filled with tools for her DIY projects.",
            "sent4": "Her tomboy interests painted a picture of creativity and strength in her community.",
            "sent5": "The tomboy's passion for adventure burned brighter than the sun on a summer day."
        }
    ]
}