{
    "term": "tomcatting",
    "meanings": [
        {
            "definition": "To engage in promiscuous or philandering behavior.",
            "pos": "verb",
            "sent1": "He was caught tomcatting around town, flirting with every woman he met.",
            "sent2": "She accused him of tomcatting because he was always seen with different women.",
            "sent3": "Tom was known for tomcatting his way through the singles' party, charming everyone.",
            "sent4": "His reputation for tomcatting earned him the nickname 'Casanova' among his friends.",
            "sent5": "The tabloids were filled with stories of his tomcatting escapades, causing a scandal."
        },
        {
            "definition": "The act of pursuing multiple sexual partners.",
            "pos": "noun",
            "sent1": "Tom's tomcatting was well-known in the neighborhood, with everyone gossiping about it.",
            "sent2": "She was tired of his constant tomcatting and decided to end the relationship.",
            "sent3": "The comedy movie portrayed a hilarious scene of tomcatting gone wrong at a speed dating event.",
            "sent4": "In the world of online dating, his profile described him as a 'master of tomcatting'.",
            "sent5": "The novel's main character was a charming rogue, known for his tomcatting ways."
        },
        {
            "definition": "A man who engages in casual sexual relationships with multiple women.",
            "pos": "noun",
            "sent1": "He was labeled as a tomcatting by his ex-girlfriends who discovered his infidelities.",
            "sent2": "The tabloid magazine featured a scandalous story about a famous actor being a tomcatting.",
            "sent3": "The sitcom's character was portrayed as a lovable tomcatting, always getting into funny situations.",
            "sent4": "Despite his reputation as a tomcatting, he was surprisingly shy in social settings.",
            "sent5": "The old sailor was known in the port as the legendary tomcatting, with many tales told about his adventures."
        }
    ]
}