{
    "term": "tonality",
    "meanings": [
        {
            "definition": "The quality of a musical sound or note being in a particular key or having a specific pitch.",
            "pos": "noun",
            "sent1": "The tonality of the song was bright and cheerful, making everyone feel happy.",
            "sent2": "The musician adjusted the tonality of the piano to match the rest of the instruments.",
            "sent3": "The tonality of the trumpet seemed to be in a playful mood, dancing along with the melody.",
            "sent4": "Her voice had a tonality that resonated deeply with the audience, touching their hearts.",
            "sent5": "The tonality of the violin was so pure and clear, it sounded like a bird singing."
        },
        {
            "definition": "The use of a particular key in a musical composition.",
            "pos": "noun",
            "sent1": "The composer's choice of tonality for the symphony created a sense of mystery and intrigue.",
            "sent2": "In this piece, the tonality shifts from major to minor, evoking different emotions in the listeners.",
            "sent3": "The tonality of the song was like a secret code, unlocking hidden meanings within the music.",
            "sent4": "His piano playing had a tonality that painted vivid pictures in the minds of the listeners.",
            "sent5": "The tonality of the guitar solo added a touch of magic to the performance, mesmerizing the audience."
        },
        {
            "definition": "The overall sound quality or character of a piece of music.",
            "pos": "noun",
            "sent1": "The tonality of the orchestra was rich and full, filling the concert hall with warmth.",
            "sent2": "The singer's unique tonality set him apart from other artists in the industry.",
            "sent3": "The tonality of the jazz band was like a colorful painting, blending different hues of sound.",
            "sent4": "Her tonality on the cello was like a gentle breeze, soothing the souls of the listeners.",
            "sent5": "The tonality of the choir was so harmonious, it felt like angels singing in unison."
        }
    ]
}