{
    "term": "tonka",
    "meanings": [
        {
            "definition": "A large, powerful truck or vehicle used for hauling heavy loads.",
            "pos": "noun",
            "sent1": "The tonka rumbled down the road carrying a huge load of rocks.",
            "sent2": "The construction crew used a tonka to transport the heavy equipment to the site.",
            "sent3": "The tonka truck seemed to have a mind of its own, beeping and moving around the construction site.",
            "sent4": "His determination was like a tonka, tirelessly carrying the weight of his responsibilities.",
            "sent5": "The tonka's engine roared as it effortlessly lifted the massive steel beams."
        },
        {
            "definition": "A type of hardwood tree native to South America.",
            "pos": "noun",
            "sent1": "The tonka tree stood tall in the rainforest, providing shade for various animals.",
            "sent2": "The unique wood of the tonka tree is prized for its durability and beauty.",
            "sent3": "The monkeys swung from the branches of the tonka tree, chattering happily.",
            "sent4": "Her strength was like the tonka tree, deeply rooted and unyielding.",
            "sent5": "The fragrance of the tonka blossoms filled the air with a sweet, floral scent."
        },
        {
            "definition": "A brand of toy trucks and construction vehicles.",
            "pos": "noun",
            "sent1": "The children played with their tonka trucks in the sandbox, moving sand around.",
            "sent2": "He gifted his son a tonka dump truck for his birthday, which brought a big smile to his face.",
            "sent3": "The cat batted at the tiny tonka truck, thinking it was a real vehicle.",
            "sent4": "Her imagination soared as she played with the miniature tonka construction set.",
            "sent5": "The bright colors of the tonka toys caught the eye of every child in the room."
        }
    ]
}