{
    "term": "tonner",
    "meanings": [
        {
            "definition": "A person or thing that weighs a ton.",
            "pos": "noun",
            "sent1": "The tonner struggled to lift the heavy box.",
            "sent2": "The crane operator carefully moved the tonner into place.",
            "sent3": "The little ant thought it could be a tonner and carry the crumb.",
            "sent4": "Her laughter was like a tonner, filling the room with joy.",
            "sent5": "The elephant was a tonner of the animal kingdom, strong and mighty."
        },
        {
            "definition": "A large, heavy vehicle used for transporting goods.",
            "pos": "noun",
            "sent1": "The tonner rumbled down the highway, carrying a load of lumber.",
            "sent2": "The delivery company added a new tonner to their fleet.",
            "sent3": "The tonner and the pickup truck had a race to see who was faster.",
            "sent4": "The tonner moved through the city like a giant metal beast.",
            "sent5": "The tonner's engine roared as it climbed the steep hill."
        },
        {
            "definition": "A unit of weight equal to 2,000 pounds.",
            "pos": "noun",
            "sent1": "The farmer weighed the hay bale and found it to be one tonner.",
            "sent2": "The shipping company charged extra for packages over one tonner.",
            "sent3": "The bakery needed a tonner of flour to make all the bread.",
            "sent4": "The tonner of bricks was carefully lifted by the crane.",
            "sent5": "The tonner of steel beams was loaded onto the truck for construction."
        },
        {
            "definition": "A large amount or quantity.",
            "pos": "noun",
            "sent1": "She had a tonner of homework to finish before the weekend.",
            "sent2": "The store received a tonner of new inventory for the holiday season.",
            "sent3": "The chef used a tonner of spices to create the flavorful dish.",
            "sent4": "The tonner of books on the shelf made her smile with delight.",
            "sent5": "The garden was filled with a tonner of colorful flowers in bloom."
        }
    ]
}