{
    "term": "tonus",
    "meanings": [
        {
            "definition": "The normal state of balanced tension in the tissues of the body, especially the muscles.",
            "pos": "noun",
            "sent1": "Her physical therapist assessed her tonus to ensure her muscles were in good condition.",
            "sent2": "Regular exercise helps maintain proper tonus in the muscles.",
            "sent3": "The yoga instructor joked that achieving tonus was like finding the perfect balance in a game of tug-of-war.",
            "sent4": "His tonus was like a coiled spring, ready to propel him forward at any moment.",
            "sent5": "The dancer's tonus was so evident in her graceful movements on stage."
        },
        {
            "definition": "The normal degree of vigor and tension in a muscle or group of muscles.",
            "pos": "noun",
            "sent1": "The athlete's tonus was evident as he sprinted towards the finish line.",
            "sent2": "Proper warm-up exercises help increase tonus before a workout.",
            "sent3": "The cat's tonus was so high that it pounced on the toy mouse with great enthusiasm.",
            "sent4": "His tonus was like a tightly wound spring, ready to unleash energy at any moment.",
            "sent5": "The tonus in her biceps showed her dedication to weightlifting."
        },
        {
            "definition": "The normal state of elastic tension or partial contraction in resting muscles.",
            "pos": "noun",
            "sent1": "During relaxation exercises, focus on maintaining tonus in your muscles.",
            "sent2": "The tonus in his forearms indicated his readiness to lift the heavy box.",
            "sent3": "The teddy bear's tonus was so relaxed that it slumped over in the toy chest.",
            "sent4": "The tonus in the rubber band was just enough to hold the papers together without snapping.",
            "sent5": "The tonus in her shoulders eased as she practiced deep breathing exercises."
        }
    ]
}