{
    "term": "took",
    "meanings": [
        {
            "definition": "past tense of take",
            "pos": "verb",
            "sent1": "Yesterday, she took the book from the shelf.",
            "sent2": "He took a nap after lunch.",
            "sent3": "The squirrel took all the nuts and hid them in the garden.",
            "sent4": "The storm took away the roof of the house.",
            "sent5": "The magician took a coin from behind the child's ear."
        },
        {
            "definition": "to grasp or hold",
            "pos": "verb",
            "sent1": "She took the handle of the door and pulled it open.",
            "sent2": "He took her hand and led her across the street.",
            "sent3": "The cat took the toy mouse in its mouth and ran around the room.",
            "sent4": "The wrestler took his opponent in a tight grip.",
            "sent5": "The child took the balloon and held it tightly."
        },
        {
            "definition": "to carry or transport",
            "pos": "verb",
            "sent1": "The delivery man took the package to the customer's house.",
            "sent2": "She took the groceries home in a reusable bag.",
            "sent3": "The ants took the food crumb to their anthill.",
            "sent4": "The truck took the load of bricks to the construction site.",
            "sent5": "The taxi driver took the passengers to the airport."
        },
        {
            "definition": "to accept or receive",
            "pos": "verb",
            "sent1": "She took the gift with a smile.",
            "sent2": "He took the job offer without hesitation.",
            "sent3": "The student took the teacher's advice and improved his grades.",
            "sent4": "The team captain took the trophy on behalf of the team.",
            "sent5": "The actor took the award and thanked his fans."
        },
        {
            "definition": "to capture or seize",
            "pos": "verb",
            "sent1": "The police took the criminal after a long chase.",
            "sent2": "He took the opportunity to showcase his talent.",
            "sent3": "The spider took the fly in its web for dinner.",
            "sent4": "The king took control of the rebellious province.",
            "sent5": "The photographer took a stunning shot of the sunset."
        }
    ]
}