{
    "term": "toolheads",
    "meanings": [
        {
            "definition": "A person who is skilled in using tools.",
            "pos": "noun",
            "sent1": "The carpenter was a talented toolheads, able to fix anything with his tools.",
            "sent2": "The mechanic is a reliable toolheads who can repair any vehicle.",
            "sent3": "The toolheads walked proudly, knowing they could handle any repair job that came their way.",
            "sent4": "She was the toolheads of the group, always ready to tackle any DIY project.",
            "sent5": "The toolheads' workshop was filled with all kinds of tools, neatly organized and ready for any task."
        },
        {
            "definition": "The part of a machine that holds or guides a tool.",
            "pos": "noun",
            "sent1": "The toolheads of the lathe ensures the precise cutting of the material.",
            "sent2": "Make sure to check the toolheads of the drill press before starting any work.",
            "sent3": "The toolheads of the machine seemed to wink at the operator, as if eager to get to work.",
            "sent4": "The toolheads of the robotic arm moved with precision, completing each task flawlessly.",
            "sent5": "The toolheads of the 3D printer buzzed softly as it created intricate designs layer by layer."
        },
        {
            "definition": "A person who is obsessed with tools or machinery.",
            "pos": "noun",
            "sent1": "My neighbor is a true toolheads, always buying the latest gadgets for his workshop.",
            "sent2": "The toolheads spent hours browsing the tool store, admiring each piece of equipment.",
            "sent3": "The toolheads' dream vacation would be a tour of famous tool factories around the world.",
            "sent4": "She jokingly called herself a toolheads, with a garage full of gadgets she rarely used.",
            "sent5": "The toolheads' eyes lit up at the sight of a new tool catalog, eager to add to their collection."
        }
    ]
}