{
    "term": "toons",
    "meanings": [
        {
            "definition": "A cartoon or animated film.",
            "pos": "noun",
            "sent1": "I love watching toons on Saturday mornings.",
            "sent2": "The kids were excited to see the new toons at the movie theater.",
            "sent3": "The toons on TV always make me laugh with their silly antics.",
            "sent4": "The toons on the big screen came to life in vivid colors.",
            "sent5": "The toons in that show are so colorful and fun to watch."
        },
        {
            "definition": "A cartoon character.",
            "pos": "noun",
            "sent1": "My favorite toons are the ones with funny personalities.",
            "sent2": "The toons in that comic strip are always up to some mischief.",
            "sent3": "The toons in the video game are cute and lovable.",
            "sent4": "The toons in the storybook jumped off the pages and into my imagination.",
            "sent5": "The toons in that show are so memorable and unique."
        },
        {
            "definition": "To draw or create cartoons.",
            "pos": "verb",
            "sent1": "I like toons because I enjoy drawing them myself.",
            "sent2": "She toons in her sketchbook every day after school.",
            "sent3": "He toons in his notebook during class when he's bored.",
            "sent4": "The artist toons with such skill and creativity.",
            "sent5": "They toons with passion and dedication to their craft."
        },
        {
            "definition": "To watch cartoons.",
            "pos": "verb",
            "sent1": "We toons together as a family every weekend.",
            "sent2": "She toons on her tablet before bedtime.",
            "sent3": "He toons on his phone while waiting for the bus.",
            "sent4": "The children toons with excitement on the living room couch.",
            "sent5": "They toons with joy and laughter on lazy afternoons."
        }
    ]
}