{
    "term": "topos",
    "meanings": [
        {
            "definition": "A traditional theme or motif in literature or art.",
            "pos": "noun",
            "sent1": "In the story, the hero's journey is a common topos that appears in many tales.",
            "sent2": "The topos of love and loss is often explored in romantic novels.",
            "sent3": "The topos of a knight in shining armor saving the princess is a classic trope.",
            "sent4": "Her paintings often incorporate the topos of nature as a symbol of freedom.",
            "sent5": "The topos of good versus evil is a timeless theme in storytelling."
        },
        {
            "definition": "A fixed place or location.",
            "pos": "noun",
            "sent1": "The library became his favorite topos to study and relax.",
            "sent2": "The park was a popular topos for families to have picnics on weekends.",
            "sent3": "The topos of the coffee shop as a meeting spot for gossip is amusing.",
            "sent4": "Her mind wandered to a topos where she felt safe and at peace.",
            "sent5": "The topos of the old oak tree as a symbol of strength resonated with her."
        },
        {
            "definition": "A rhetorical device involving a common or familiar idea.",
            "pos": "noun",
            "sent1": "The politician used the topos of unity to rally the crowd.",
            "sent2": "The topos of 'all is fair in love and war' is often debated.",
            "sent3": "His topos of always being right became a running joke among friends.",
            "sent4": "She cleverly employed the topos of 'actions speak louder than words' in her speech.",
            "sent5": "The topos of 'history repeats itself' is a cautionary reminder to learn from the past."
        },
        {
            "definition": "A point in a mathematical space.",
            "pos": "noun",
            "sent1": "The topos where the two lines intersect is the solution to the equation.",
            "sent2": "In geometry, a topos is a specific location in a shape.",
            "sent3": "The topos of the origin point is where all measurements start.",
            "sent4": "She plotted the topos of the maximum value on the graph.",
            "sent5": "Understanding the topos of the vertex is crucial in quadratic equations."
        }
    ]
}