{
    "term": "topoi",
    "meanings": [
        {
            "definition": "A traditional theme or motif in rhetoric or literature.",
            "pos": "noun",
            "sent1": "In the story, the hero's journey is a prominent topoi that symbolizes growth and transformation.",
            "sent2": "The use of nature as a symbol for emotions is a common topoi in poetry.",
            "sent3": "The topoi of love conquering all obstacles is a classic theme in romantic novels.",
            "sent4": "Her paintings are filled with topoi of nature, reflecting her deep connection to the environment.",
            "sent5": "The topoi of good versus evil is a timeless motif found in many fairy tales."
        },
        {
            "definition": "A rhetorical device or argument used in debate.",
            "pos": "noun",
            "sent1": "The politician's repeated use of personal anecdotes served as a persuasive topoi during the debate.",
            "sent2": "Bringing up historical examples can be an effective topoi to support your argument.",
            "sent3": "Using humor as a topoi can help lighten the mood during a heated discussion.",
            "sent4": "The topoi of appealing to authority can strengthen your position in a debate.",
            "sent5": "Employing logical reasoning is a powerful topoi to convince others of your point of view."
        },
        {
            "definition": "A common or general belief or idea.",
            "pos": "noun",
            "sent1": "The topoi that hard work leads to success is deeply ingrained in our society.",
            "sent2": "Questioning societal topoi can lead to new perspectives and innovations.",
            "sent3": "The topoi of cats having nine lives is a fun superstition passed down through generations.",
            "sent4": "The topoi that money buys happiness is often challenged by those who prioritize experiences over possessions.",
            "sent5": "The topoi of beauty being subjective reminds us that everyone has their own unique preferences."
        }
    ]
}