{
    "term": "toque",
    "meanings": [
        {
            "definition": "A type of hat worn in cold weather.",
            "pos": "noun",
            "sent1": "During the snowstorm, Sarah wore a cozy toque to keep her head warm.",
            "sent2": "In winter, many people wear a toque to protect themselves from the cold wind.",
            "sent3": "The toque looked like a fluffy cloud on Sarah's head, making her friends giggle.",
            "sent4": "The toque was a shield against the icy air, like a knight's helmet in battle.",
            "sent5": "The bright red toque stood out in the white snow, a beacon of warmth in the winter landscape."
        },
        {
            "definition": "A tall, white hat worn by chefs.",
            "pos": "noun",
            "sent1": "The chef put on his toque before starting to cook in the restaurant kitchen.",
            "sent2": "In the busy kitchen, every chef wore a toque to show their expertise.",
            "sent3": "The toque made the chef look like a wizard brewing magical potions in the kitchen.",
            "sent4": "The toque was a symbol of authority in the kitchen, like a crown on a king's head.",
            "sent5": "The chef's toque towered above the bustling kitchen, a beacon of culinary skill and precision."
        },
        {
            "definition": "A small, round, brimless hat worn by women in the 16th century.",
            "pos": "noun",
            "sent1": "In the play about Shakespeare's time, the actress wore a toque to complete her costume.",
            "sent2": "During the Renaissance, women often adorned their heads with a toque as a fashion statement.",
            "sent3": "The toque perched delicately on the actress's head, adding a touch of elegance to her ensemble.",
            "sent4": "The toque was a crown of sophistication, framing the actress's face like a portrait.",
            "sent5": "The toque transported the audience back to the opulent days of the 16th century, a glimpse into history through fashion."
        }
    ]
}