{
    "term": "toreador",
    "meanings": [
        {
            "definition": "A bullfighter in Spanish-speaking countries.",
            "pos": "noun",
            "sent1": "The brave toreador faced the bull in the arena.",
            "sent2": "The crowd cheered as the toreador skillfully dodged the charging bull.",
            "sent3": "The toreador's colorful outfit caught the sunlight as he danced around the bull.",
            "sent4": "In the heat of the moment, the toreador's movements were as precise as a well-oiled machine.",
            "sent5": "The image of the toreador standing tall in the ring stayed with the spectators long after the fight."
        },
        {
            "definition": "A person who fights bulls in a bullfight.",
            "pos": "noun",
            "sent1": "The young toreador trained for years to become a skilled bullfighter.",
            "sent2": "The toreador's bravery was evident as he entered the ring to face the fierce bull.",
            "sent3": "Despite his nervousness, the toreador managed to maintain his composure during the fight.",
            "sent4": "The toreador's heart raced as he prepared to confront the massive bull.",
            "sent5": "The toreador's determination never wavered, even in the face of danger."
        },
        {
            "definition": "A performer in a bullfight who is skilled at dodging the bull.",
            "pos": "noun",
            "sent1": "The agile toreador gracefully avoided the bull's horns with swift movements.",
            "sent2": "The toreador's nimble footwork impressed the audience as he danced around the bull.",
            "sent3": "With each step, the toreador seemed to be in perfect harmony with the charging bull.",
            "sent4": "The toreador's quick reflexes saved him from a potentially dangerous situation.",
            "sent5": "The toreador's skillful evasion tactics left the bull bewildered and the crowd in awe."
        }
    ]
}