{
    "term": "toros",
    "meanings": [
        {
            "definition": "A large, strong bull",
            "pos": "noun",
            "sent1": "The toros grazed peacefully in the meadow.",
            "sent2": "The rancher raised toros for their strength and size.",
            "sent3": "The toros decided to have a race for fun.",
            "sent4": "His determination was like that of a toros in a bullfight.",
            "sent5": "The toros stood majestic, their power undeniable."
        },
        {
            "definition": "A type of Spanish dance",
            "pos": "noun",
            "sent1": "The flamenco performance included a captivating toros.",
            "sent2": "In Spain, toros are a traditional part of cultural celebrations.",
            "sent3": "The toros danced with such flair, it brought smiles to everyone.",
            "sent4": "Her movements were as graceful as a toros in a dance competition.",
            "sent5": "The toros twirled and stomped to the rhythm of the music."
        },
        {
            "definition": "A type of surgical instrument",
            "pos": "noun",
            "sent1": "The doctor carefully used the toros during the operation.",
            "sent2": "The toros was essential for precise incisions in surgery.",
            "sent3": "The toros accidentally started playing music during the surgery.",
            "sent4": "The toros sliced through tissue like a hot knife through butter.",
            "sent5": "The shiny toros gleamed under the bright lights of the operating room."
        },
        {
            "definition": "A type of wrestling move",
            "pos": "noun",
            "sent1": "The wrestler executed a perfect toros on his opponent.",
            "sent2": "In the ring, toros are often used to gain the upper hand.",
            "sent3": "The toros move left the audience in stitches.",
            "sent4": "His toros was as swift and powerful as a striking cobra.",
            "sent5": "The toros maneuver showcased the wrestler's agility and strength."
        }
    ]
}