{
    "term": "torpors",
    "meanings": [
        {
            "definition": "A state of physical or mental inactivity or lethargy.",
            "pos": "noun",
            "sent1": "After a long day of work, he fell into a deep torpors on the couch.",
            "sent2": "The hot weather always makes me feel like I am in a torpors.",
            "sent3": "Trying to study when you are in a torpors is like trying to run in quicksand.",
            "sent4": "The torpors of the city streets in the early morning was a stark contrast to its usual hustle and bustle.",
            "sent5": "The torpors of the sloth hanging from the tree was a sight to behold."
        },
        {
            "definition": "A state of decreased physiological activity in an animal, usually in response to cold temperatures.",
            "pos": "noun",
            "sent1": "During winter, bears enter a torpors to conserve energy and stay warm.",
            "sent2": "The hedgehog's torpors in the cold winter months helps it survive until spring.",
            "sent3": "The cat's torpors in front of the fireplace made it look like a fluffy ball of fur.",
            "sent4": "The torpors of the lizard in the rock crevice was a clever survival strategy.",
            "sent5": "The torpors of the turtle in the pond was a peaceful sight on a sunny day."
        },
        {
            "definition": "A state of dormancy or hibernation in certain animals.",
            "pos": "noun",
            "sent1": "The bear's torpors during winter is essential for its survival in the harsh conditions.",
            "sent2": "The torpors of the groundhog in its burrow indicates the arrival of winter.",
            "sent3": "The torpors of the squirrel in the tree hollow looked like a cozy nap.",
            "sent4": "The torpors of the snake in the cool cave was a natural response to the changing seasons.",
            "sent5": "The torpors of the bat hanging upside down in the cave was a fascinating sight for the nature enthusiasts."
        }
    ]
}