{
    "term": "torticollis",
    "meanings": [
        {
            "definition": "Torticollis: a condition in which the neck muscles contract, causing the head to twist to one side",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with torticollis after noticing the unusual head position.",
            "sent2": "She had to wear a neck brace to help with her torticollis.",
            "sent3": "The torticollis made it look like the man was trying to peek around the corner all the time.",
            "sent4": "Her torticollis was like a stubborn knot that refused to untangle.",
            "sent5": "The torticollis made her head seem like a twisted sculpture."
        },
        {
            "definition": "Torticollis: a medical condition characterized by involuntary muscle contractions in the neck, causing the head to tilt to one side",
            "pos": "noun",
            "sent1": "The baby's torticollis made it challenging for him to turn his head.",
            "sent2": "After the accident, she developed torticollis, which required physical therapy.",
            "sent3": "His torticollis was like a stubborn friend who always wanted to lean on his shoulder.",
            "sent4": "The torticollis was a silent force pulling her head to the side.",
            "sent5": "The torticollis made her head tilt like a curious bird."
        },
        {
            "definition": "Torticollis: a disorder in which the head is tilted to one side due to muscle spasms in the neck",
            "pos": "noun",
            "sent1": "The torticollis caused her discomfort whenever she tried to straighten her head.",
            "sent2": "He sought treatment for his torticollis to relieve the constant neck pain.",
            "sent3": "The torticollis made him look like he was always nodding in agreement.",
            "sent4": "Her torticollis was a stubborn hitchhiker, always pulling her head to the side.",
            "sent5": "The torticollis twisted her head like a winding road through the mountains."
        }
    ]
}