{
    "term": "toss",
    "meanings": [
        {
            "definition": "To throw lightly or casually",
            "pos": "verb",
            "sent1": "She will toss the ball to me during the game.",
            "sent2": "He likes to toss pebbles into the pond.",
            "sent3": "I will toss a coin to decide who gets the last cookie.",
            "sent4": "The wind will toss the leaves around the yard.",
            "sent5": "The chef will toss the salad with a flick of the wrist."
        },
        {
            "definition": "To mix or agitate by shaking",
            "pos": "verb",
            "sent1": "Mom will toss the salad before dinner.",
            "sent2": "Please toss the ingredients gently in the bowl.",
            "sent3": "The machine will toss the clothes to clean them.",
            "sent4": "The storm will toss the waves violently against the shore.",
            "sent5": "The bartender will toss the cocktail to blend the flavors."
        },
        {
            "definition": "To discard or get rid of",
            "pos": "verb",
            "sent1": "I will toss out the old magazines to make space.",
            "sent2": "She decided to toss the broken toy in the trash.",
            "sent3": "The cat will playfully toss the toy mouse around.",
            "sent4": "He will toss away the negative thoughts and focus on the positive.",
            "sent5": "The gardener will toss the wilted flowers into the compost bin."
        },
        {
            "definition": "To flip a coin to make a decision",
            "pos": "verb",
            "sent1": "Let's toss a coin to see who goes first.",
            "sent2": "They will toss a coin to settle the bet.",
            "sent3": "I will toss a coin to choose between pizza or pasta for dinner.",
            "sent4": "The referee will toss a coin to decide which team kicks off.",
            "sent5": "She will toss a coin to determine who gets the last piece of cake."
        }
    ]
}