{
    "term": "tossups",
    "meanings": [
        {
            "definition": "A situation in which the outcome is uncertain or a decision must be made between two equally likely options.",
            "pos": "noun",
            "sent1": "The game was tied, and it all came down to a series of tossups to determine the winner.",
            "sent2": "The tossups in the election left everyone on edge, waiting for the final results.",
            "sent3": "The tossups in the race were so intense that even the spectators were feeling the pressure.",
            "sent4": "Life is full of tossups, where we must choose between different paths without knowing the outcome.",
            "sent5": "The tossups in the movie kept the audience guessing until the very end."
        },
        {
            "definition": "To throw something lightly or casually.",
            "pos": "verb",
            "sent1": "She would often tossups her keys onto the table when she got home.",
            "sent2": "He liked to tossups pebbles into the pond and watch the ripples.",
            "sent3": "The child would tossups his toys around the room, creating a mess.",
            "sent4": "The wind would tossups the leaves in all directions, creating a beautiful dance.",
            "sent5": "She would casually tossups the ball to her dog, who eagerly fetched it back."
        },
        {
            "definition": "A question or problem that is difficult to answer or solve.",
            "pos": "noun",
            "sent1": "The math tossups in the quiz were challenging for the students.",
            "sent2": "The tossups in the mystery novel kept readers engaged until the very end.",
            "sent3": "The tossups in the riddle were so tricky that no one could solve it.",
            "sent4": "The tossups in the escape room required teamwork to solve.",
            "sent5": "The tossups in the crossword puzzle stumped even the most experienced solvers."
        }
    ]
}