{
    "term": "tost",
    "meanings": [
        {
            "definition": "past tense of toast",
            "pos": "noun",
            "sent1": "Yesterday, I made some delicious tost for breakfast.",
            "sent2": "She always prefers her tost with butter and jam.",
            "sent3": "The tost from last night's party was a hit with everyone.",
            "sent4": "The tost of memories lingered in his mind long after the event.",
            "sent5": "The warm aroma of tost filled the kitchen, bringing back childhood memories."
        },
        {
            "definition": "a toasted sandwich",
            "pos": "noun",
            "sent1": "For lunch, I ordered a tost with cheese and ham.",
            "sent2": "The cafe down the street makes the best tost in town.",
            "sent3": "The tost in the lunchbox looked like a smile waiting to be eaten.",
            "sent4": "She savored every bite of the tost, enjoying the crunch and flavors.",
            "sent5": "The tost was a perfect blend of crispy bread and gooey cheese."
        },
        {
            "definition": "to make something brown and crisp by heating it",
            "pos": "verb",
            "sent1": "I tost the bread until it was golden brown.",
            "sent2": "She carefully tost the marshmallows over the campfire.",
            "sent3": "The chef will tost the almonds to add a crunchy texture to the salad.",
            "sent4": "The sun's rays tost the desert sand, making it scorching hot.",
            "sent5": "The fire tost the edges of the paper, giving it a rustic look."
        },
        {
            "definition": "to be subjected to intense heat",
            "pos": "verb",
            "sent1": "The metal rod was tost in the furnace to make it malleable.",
            "sent2": "The poor plant was tost under the scorching sun all day.",
            "sent3": "The marshmallows were tost quickly over the bonfire.",
            "sent4": "The city was tost by a heatwave, making everyone seek shade.",
            "sent5": "The bread was tost in the toaster, filling the kitchen with a warm smell."
        }
    ]
}