{
    "term": "totalism",
    "meanings": [
        {
            "definition": "The practice of maintaining strict control over all aspects of a society or group.",
            "pos": "noun",
            "sent1": "The totalism of the strict leader made everyone follow the same rules.",
            "sent2": "Totalism in a community can sometimes lead to limited personal freedom.",
            "sent3": "The totalism of the school principal's new dress code caused quite a stir among the students.",
            "sent4": "The totalism of the company's policies suffocated creativity among the employees.",
            "sent5": "Living under the totalism of constant surveillance felt like being trapped in a cage."
        },
        {
            "definition": "A system of government that seeks to control all aspects of public and private life.",
            "pos": "noun",
            "sent1": "The citizens rebelled against the totalism of the oppressive regime.",
            "sent2": "Totalism can sometimes lead to a lack of individual rights in a society.",
            "sent3": "The totalism of the new law banning all outdoor activities seemed extreme to many.",
            "sent4": "The totalism of the government's censorship stifled freedom of expression.",
            "sent5": "The totalism of the surveillance state invaded every aspect of citizens' lives."
        },
        {
            "definition": "The belief in or advocacy of a total or complete system or organization.",
            "pos": "noun",
            "sent1": "His totalism in creating a perfect plan left no room for error.",
            "sent2": "Totalism in business management can sometimes overlook individual needs.",
            "sent3": "The totalism of the team leader's strict schedule made everyone nervous.",
            "sent4": "The totalism of the new software aimed to streamline all processes efficiently.",
            "sent5": "Embracing totalism in design can lead to a cohesive and unified product."
        }
    ]
}