{
    "term": "totem",
    "meanings": [
        {
            "definition": "A natural object or animal believed by a particular society to have spiritual significance and adopted by it as an emblem.",
            "pos": "noun",
            "sent1": "The tribe revered the ancient totem carved from wood.",
            "sent2": "The totem pole stood tall in the village, symbolizing their connection to nature.",
            "sent3": "The mischievous raccoon mistook the totem for a tree and tried to climb it.",
            "sent4": "Her laughter echoed through the forest, a totem of joy in the quiet woods.",
            "sent5": "The totem's intricate carvings told stories of the past, etched in wood for generations to come."
        },
        {
            "definition": "A representation of such an object serving as the distinctive mark of the clan or group.",
            "pos": "noun",
            "sent1": "The totem animal on their banner represented unity and strength.",
            "sent2": "Each family had their own totem displayed proudly in front of their homes.",
            "sent3": "The totem on the flag seemed to dance in the wind, bringing life to the fabric.",
            "sent4": "His determination was a totem, guiding the group through challenges with unwavering resolve.",
            "sent5": "The totem on the shield protected them in battle, a symbol of their courage and loyalty."
        },
        {
            "definition": "A person or thing that embodies the qualities of a particular culture or society.",
            "pos": "noun",
            "sent1": "She was a totem of wisdom, sought after for her insightful advice.",
            "sent2": "The old oak tree was a totem of strength, standing firm against the winds of time.",
            "sent3": "The totem of fashion in the town was a quirky hat that everyone wanted to wear.",
            "sent4": "His kindness was a totem that touched the hearts of all who knew him.",
            "sent5": "The totem of creativity sparked new ideas in the minds of the community, inspiring art and innovation."
        }
    ]
}