{
    "term": "totting",
    "meanings": [
        {
            "definition": "To total or add up",
            "pos": "verb",
            "sent1": "I am totting the numbers on my calculator.",
            "sent2": "She enjoys totting up her monthly expenses.",
            "sent3": "The little girl was totting up her toy collection.",
            "sent4": "He was totting the scores in his head like a human calculator.",
            "sent5": "Totting the coins in the jar, she realized she had saved quite a lot."
        },
        {
            "definition": "To collect or gather",
            "pos": "verb",
            "sent1": "The farmer is totting the ripe apples from the trees.",
            "sent2": "They are totting all the necessary documents for the meeting.",
            "sent3": "The kids were totting up seashells on the beach.",
            "sent4": "She was totting memories of her travels like precious gems.",
            "sent5": "Totting colorful leaves in the park brought joy to the children."
        },
        {
            "definition": "To calculate or reckon",
            "pos": "verb",
            "sent1": "He is totting the distance to the nearest gas station.",
            "sent2": "She totted the time it would take to finish the project.",
            "sent3": "The cat was totting the best spot for a nap in the sun.",
            "sent4": "Totting the risks, she decided to go on the thrilling roller coaster.",
            "sent5": "Totting the ingredients, she followed the recipe to bake a delicious cake."
        },
        {
            "definition": "To count or enumerate",
            "pos": "verb",
            "sent1": "The teacher is totting the students present in the classroom.",
            "sent2": "He totted the number of books on the shelf.",
            "sent3": "The squirrel was totting the nuts hidden in the tree.",
            "sent4": "Totting the stars in the sky, she marveled at their beauty.",
            "sent5": "Totting the days left until the vacation, they eagerly awaited the trip."
        }
    ]
}