{
    "term": "touchstones",
    "meanings": [
        {
            "definition": "A standard or criterion by which something is judged or recognized.",
            "pos": "noun",
            "sent1": "In our school, good behavior is a touchstone for receiving rewards.",
            "sent2": "Honesty is often considered a touchstone of a trustworthy person.",
            "sent3": "The touchstone of a successful party is everyone having a great time.",
            "sent4": "Her smile was the touchstone that brightened up his day.",
            "sent5": "Kindness can be a touchstone that leaves a lasting impact on others."
        },
        {
            "definition": "A test or criterion for determining the quality or genuineness of a thing.",
            "pos": "noun",
            "sent1": "The taste of the food served will be the touchstone of the restaurant's reputation.",
            "sent2": "The touchstone of a good friendship is being there for each other in tough times.",
            "sent3": "The touchstone of a good joke is making everyone laugh.",
            "sent4": "Her dedication to her work became the touchstone of her success.",
            "sent5": "The touchstone of a reliable product is its durability and performance."
        },
        {
            "definition": "A hard black stone, such as jasper or basalt, formerly used to test the quality of gold or silver by the streak left on it when rubbed.",
            "pos": "noun",
            "sent1": "The jeweler used a touchstone to determine the purity of the gold.",
            "sent2": "Miners would carry a touchstone to check the quality of the precious metals they found.",
            "sent3": "The touchstone accidentally left a mark on the table when it was placed there.",
            "sent4": "The touchstone revealed the true value of the silver through its distinctive mark.",
            "sent5": "The touchstone's black surface showed the authenticity of the gold through its streak."
        }
    ]
}