{
    "term": "touchiest",
    "meanings": [
        {
            "definition": "Easily offended or upset",
            "pos": "adjective",
            "sent1": "She is the touchiest person I know, always getting upset over small things.",
            "sent2": "He tends to avoid making jokes around her because she is the touchiest in the group.",
            "sent3": "It's like walking on eggshells around her, she's the touchiest when it comes to criticism.",
            "sent4": "Her feelings are as fragile as glass, making her the touchiest among her friends.",
            "sent5": "The slightest comment can make her the touchiest person in the room."
        },
        {
            "definition": "Showing sensitivity or defensiveness",
            "pos": "adjective",
            "sent1": "The touchiest response came from him, showing how easily he felt attacked.",
            "sent2": "She became touchiest when discussing her personal beliefs, showing her sensitivity.",
            "sent3": "His touchiest reaction was to defend his favorite team, even in a friendly debate.",
            "sent4": "She wore her touchiest expression, ready to protect her feelings from any criticism.",
            "sent5": "The touchiest individuals often have a strong need to shield themselves from perceived threats."
        },
        {
            "definition": "Requiring delicate handling or treatment",
            "pos": "adjective",
            "sent1": "The touchiest part of the project was ensuring the fragile components were handled carefully.",
            "sent2": "The antique vase was the touchiest item in the collection, needing special care.",
            "sent3": "The touchiest task was transporting the newborn kittens without disturbing them.",
            "sent4": "The touchiest flowers in the garden needed gentle watering to thrive.",
            "sent5": "Handling the touchiest equipment required precision and attention to detail."
        }
    ]
}