{
    "term": "touched",
    "meanings": [
        {
            "definition": "To come into or be in contact with.",
            "pos": "verb",
            "sent1": "She touched the soft fabric gently.",
            "sent2": "He touched the cold metal with his fingertips.",
            "sent3": "The cat touched the water cautiously with its paw.",
            "sent4": "The sun's rays touched the mountain peak, painting it golden.",
            "sent5": "The music touched her heart and brought tears to her eyes."
        },
        {
            "definition": "To affect emotionally; move.",
            "pos": "verb",
            "sent1": "The movie touched her deeply, making her cry.",
            "sent2": "His kind words touched her heart and made her smile.",
            "sent3": "The sad story touched her in a way that stayed with her all day.",
            "sent4": "The beautiful painting touched his soul and inspired him.",
            "sent5": "The heartfelt apology touched her and healed their relationship."
        },
        {
            "definition": "To handle or deal with.",
            "pos": "verb",
            "sent1": "She touched the fragile vase with care.",
            "sent2": "He touched the issue delicately to avoid conflict.",
            "sent3": "The chef touched the dish with a final garnish before serving.",
            "sent4": "The lawyer touched the sensitive topic with expertise.",
            "sent5": "The teacher touched each student's work with encouragement and feedback."
        },
        {
            "definition": "To make physical contact with.",
            "pos": "verb",
            "sent1": "The basketball player touched the ball before it went out of bounds.",
            "sent2": "She touched the doorknob and felt a shock.",
            "sent3": "The child touched the puppy's soft fur with excitement.",
            "sent4": "His hand touched hers, sending a warm feeling through him.",
            "sent5": "The raindrops touched the ground softly, creating a soothing sound."
        },
        {
            "definition": "To be slightly crazy or mentally unstable.",
            "pos": "verb",
            "sent1": "Some people thought he was touched in the head because of his strange behavior.",
            "sent2": "She felt a bit touched after staying up all night studying.",
            "sent3": "The old man's stories made him seem touched, but everyone enjoyed listening.",
            "sent4": "After the long hike, they all felt a little touched in the mind.",
            "sent5": "The comedian's jokes were so funny, they left the audience feeling slightly touched."
        }
    ]
}