{
    "term": "tough",
    "meanings": [
        {
            "definition": "Strong and durable",
            "pos": "adjective",
            "sent1": "The tough fabric of the bag lasted for years.",
            "sent2": "The tough leather jacket protected him from the cold wind.",
            "sent3": "The tough old boots refused to give up even after many miles of walking.",
            "sent4": "Her tough resolve was like an unbreakable shield against adversity.",
            "sent5": "The tough metal frame of the car saved their lives in the accident."
        },
        {
            "definition": "Difficult to break or cut",
            "pos": "adjective",
            "sent1": "The tough steak was hard to chew.",
            "sent2": "The tough rope held the weight without snapping.",
            "sent3": "The tough nut was a challenge to crack open.",
            "sent4": "Her tough determination was like a diamond, unyielding to pressure.",
            "sent5": "The tough puzzle required hours of concentration to solve."
        },
        {
            "definition": "Resilient and able to withstand hardship",
            "pos": "adjective",
            "sent1": "The tough plant survived the harsh winter with ease.",
            "sent2": "The tough soldier never gave up despite the challenges.",
            "sent3": "The tough cookie remained cheerful even in tough times.",
            "sent4": "Her tough spirit shone brightly in the face of adversity.",
            "sent5": "The tough mountain climber conquered the peak against all odds."
        },
        {
            "definition": "Strict or severe in manner or attitude",
            "pos": "adjective",
            "sent1": "The tough teacher expected high standards from her students.",
            "sent2": "The tough boss never accepted excuses for mistakes.",
            "sent3": "The tough judge was known for delivering fair but strict verdicts.",
            "sent4": "Her tough demeanor hid a kind heart underneath.",
            "sent5": "The tough coach pushed the team to their limits to achieve success."
        },
        {
            "definition": "Physically strong and capable of enduring hardship",
            "pos": "adjective",
            "sent1": "The tough athlete trained hard to improve his performance.",
            "sent2": "The tough firefighter carried the injured person out of the burning building.",
            "sent3": "The tough laborer lifted heavy loads without breaking a sweat.",
            "sent4": "Her tough muscles were a result of years of dedicated training.",
            "sent5": "The tough marathon runner crossed the finish line with a smile of victory."
        }
    ]
}