{
    "term": "tourtiere",
    "meanings": [
        {
            "definition": "A French-Canadian meat pie traditionally made with ground pork and spices.",
            "pos": "noun",
            "sent1": "During the winter, my family enjoys a delicious tourtiere for dinner.",
            "sent2": "In Quebec, tourtiere is a popular dish during the holiday season.",
            "sent3": "I accidentally dropped the tourtiere on the floor, but luckily the dog didn't eat it!",
            "sent4": "The aroma of the tourtiere baking in the oven filled the house with warmth and comfort.",
            "sent5": "The golden crust of the tourtiere glistened under the kitchen lights, tempting everyone to take a bite."
        },
        {
            "definition": "A dish typically served during the holiday season in Quebec.",
            "pos": "noun",
            "sent1": "Every Christmas, my grandmother prepares a flavorful tourtiere for our family feast.",
            "sent2": "The tourtiere was the highlight of the holiday dinner in Quebec.",
            "sent3": "As a joke, my brother tried to wear the tourtiere as a hat, but it was too messy!",
            "sent4": "The tourtiere on the table was like a festive centerpiece, drawing everyone's attention.",
            "sent5": "The first bite of the tourtiere brought back memories of past celebrations and joyous times with loved ones."
        },
        {
            "definition": "A savory pie with a flaky pastry crust.",
            "pos": "noun",
            "sent1": "The tourtiere at the bakery had a perfectly flaky crust that melted in my mouth.",
            "sent2": "For lunch, I decided to have a slice of tourtiere with a side salad.",
            "sent3": "My friend tried to juggle the tourtiere, but it ended up falling apart in a hilarious mess!",
            "sent4": "The tourtiere's crust was so delicate, it felt like biting into a cloud of deliciousness.",
            "sent5": "The steam rising from the freshly baked tourtiere hinted at the savory filling waiting to be enjoyed."
        }
    ]
}