{
    "term": "tour",
    "meanings": [
        {
            "definition": "A journey for pleasure or education.",
            "pos": "noun",
            "sent1": "During the school holiday, we went on a fun tour of the zoo.",
            "sent2": "The family planned a tour of historical sites in the city.",
            "sent3": "The tour of the museum was so interesting that I forgot to take pictures.",
            "sent4": "Her imagination took a tour through the pages of the adventure book.",
            "sent5": "The tour of the chocolate factory left us all craving sweets."
        },
        {
            "definition": "A guided visit to a place or area.",
            "pos": "noun",
            "sent1": "The tour guide led us through the ancient ruins.",
            "sent2": "We joined a group for a tour of the art gallery.",
            "sent3": "The tour of the haunted house was more funny than scary.",
            "sent4": "His mind took a tour of memories as he walked through the old neighborhood.",
            "sent5": "The tour of the botanical garden was filled with colorful flowers and plants."
        },
        {
            "definition": "To travel around a place for pleasure or education.",
            "pos": "verb",
            "sent1": "We plan to tour Europe next summer.",
            "sent2": "They love to tour different countries to experience new cultures.",
            "sent3": "The cat decided to tour the house looking for a cozy spot to nap.",
            "sent4": "Her thoughts tour around the idea of starting her own business.",
            "sent5": "The music band will tour the country to perform in various cities."
        },
        {
            "definition": "To take a guided visit to a place or area.",
            "pos": "verb",
            "sent1": "The students will tour the science museum next week.",
            "sent2": "She wants to tour the famous landmarks with a knowledgeable guide.",
            "sent3": "The squirrel seemed to tour the park, showing off its acrobatic skills.",
            "sent4": "His eyes tour the room, searching for the missing keys.",
            "sent5": "The chef will tour the local markets to find the freshest ingredients."
        }
    ]
}