{
    "term": "tourbillions",
    "meanings": [
        {
            "definition": "A whirlwind or vortex.",
            "pos": "noun",
            "sent1": "The tourbillions of leaves danced in the wind.",
            "sent2": "I watched the tourbillions of dust swirl around the room.",
            "sent3": "The tourbillions of bubbles in my soda made me giggle.",
            "sent4": "Her thoughts were a tourbillions of emotions, spinning endlessly.",
            "sent5": "The tourbillions of colors in the kaleidoscope mesmerized the children."
        },
        {
            "definition": "A whirl or eddy of water.",
            "pos": "noun",
            "sent1": "The stream formed small tourbillions as it flowed over the rocks.",
            "sent2": "The whirlpool created tourbillions of foam on the surface.",
            "sent3": "The tourbillions in the bathtub made bath time more fun.",
            "sent4": "The boat was caught in a tourbillions of currents, spinning it around.",
            "sent5": "The tourbillions of water in the river sparkled in the sunlight."
        },
        {
            "definition": "A whirlwind or tornado.",
            "pos": "noun",
            "sent1": "The tourbillions swept through the town, leaving destruction in its wake.",
            "sent2": "We took cover as the tourbillions approached our neighborhood.",
            "sent3": "The tourbillions of laundry flying around the yard looked like a storm.",
            "sent4": "The tourbillions of wind howled like a wild beast.",
            "sent5": "The tourbillions of dust devils danced across the desert landscape."
        },
        {
            "definition": "A spinning or rotating motion.",
            "pos": "noun",
            "sent1": "The ballerina's graceful tourbillions captivated the audience.",
            "sent2": "The toy top spun in tourbillions on the floor.",
            "sent3": "The tourbillions of the fan cooled the room quickly.",
            "sent4": "The helicopter blades created tourbillions of air as it took off.",
            "sent5": "The tourbillions of the carousel made the children squeal with delight."
        }
    ]
}