{
    "term": "touzling",
    "meanings": [
        {
            "definition": "To tousle or dishevel (someone's hair)",
            "pos": "verb",
            "sent1": "She couldn't resist touzling her little brother's hair into a messy tangle.",
            "sent2": "The playful puppy kept touzling the child's hair with its paws.",
            "sent3": "After the pillow fight, they were all touzling each other's hair for fun.",
            "sent4": "The wind touzled her hair like a mischievous sprite dancing around her head.",
            "sent5": "The mischievous toddler was caught touzling the cat's fur instead of playing with his toys."
        },
        {
            "definition": "To mess up or rumple (something)",
            "pos": "verb",
            "sent1": "He accidentally touzled the papers on his desk while searching for his pen.",
            "sent2": "The strong wind touzled the leaves on the ground, creating a swirling mess.",
            "sent3": "The mischievous raccoon touzled through the garbage cans looking for a late-night snack.",
            "sent4": "The playful breeze touzled the curtains, letting in streaks of sunlight.",
            "sent5": "The children's laughter filled the room as they touzled the pile of colorful balloons into chaos."
        },
        {
            "definition": "To handle or fiddle with (something) in a careless or absent-minded way",
            "pos": "verb",
            "sent1": "She absent-mindedly touzled the keys in her pocket while lost in thought.",
            "sent2": "The toddler touzled with the buttons on the remote control, changing the channel by accident.",
            "sent3": "The curious kitten touzled with the yarn, creating a tangled mess on the floor.",
            "sent4": "The old man sat on the park bench, touzling with the coins in his pocket as he reminisced.",
            "sent5": "The students were so bored during the lecture that they started touzling with their pens and notebooks."
        }
    ]
}