{
    "term": "toxicology",
    "meanings": [
        {
            "definition": "The branch of science that deals with the nature, effects, and detection of poisons.",
            "pos": "noun",
            "sent1": "Toxicology helps us understand how poisons affect living things.",
            "sent2": "Scientists in toxicology study the effects of poisons on organisms.",
            "sent3": "In toxicology class, we learn about the dangers of different poisons.",
            "sent4": "The field of toxicology is like a detective solving mysteries of poisons.",
            "sent5": "Learning about toxicology is like uncovering hidden dangers in nature."
        },
        {
            "definition": "The study of the adverse effects of chemical substances on living organisms.",
            "pos": "noun",
            "sent1": "Understanding toxicology is important to protect animals from harmful chemicals.",
            "sent2": "Researchers in toxicology investigate how chemicals harm living beings.",
            "sent3": "The frog joked that he should take a toxicology course to avoid getting poisoned.",
            "sent4": "Her love for gardening turned into a toxicology experiment when her plants wilted mysteriously.",
            "sent5": "The impact of toxicology on wildlife conservation cannot be underestimated."
        },
        {
            "definition": "The scientific study of the nature, effects, and detection of toxic substances.",
            "pos": "noun",
            "sent1": "Toxicology involves analyzing the properties of harmful substances.",
            "sent2": "Chemists use toxicology to identify dangerous materials in products.",
            "sent3": "The detective's toxicology report revealed the presence of a deadly poison.",
            "sent4": "The world of toxicology is like a puzzle where scientists piece together the dangers of substances.",
            "sent5": "Studying toxicology is like shining a light on hidden dangers in everyday items."
        }
    ]
}