{
    "term": "toyed",
    "meanings": [
        {
            "definition": "Play with or manipulate (something) as if it were a toy.",
            "pos": "verb",
            "sent1": "The child toyed with the colorful blocks, stacking them up and knocking them down.",
            "sent2": "She toyed with the idea of starting a new hobby but never took action.",
            "sent3": "The cat toyed with the mouse, pretending to pounce but letting it escape each time.",
            "sent4": "His mind toyed with the possibilities of what could happen if he took the risk.",
            "sent5": "The wind toyed with the leaves, swirling them around in a dance."
        },
        {
            "definition": "Treat something casually or without seriousness.",
            "pos": "verb",
            "sent1": "He toyed with the idea of skipping work and going to the beach instead.",
            "sent2": "She toyed with the food on her plate, not really hungry but eating out of habit.",
            "sent3": "The student toyed with the thought of not studying for the test, but then decided against it.",
            "sent4": "The company toyed with the idea of changing their logo but ultimately kept it the same.",
            "sent5": "The dog toyed with the idea of chasing the squirrel but got distracted by a butterfly instead."
        },
        {
            "definition": "Tease or play with someone in a flirtatious manner.",
            "pos": "verb",
            "sent1": "She toyed with him, giving him a sly smile and a playful wink.",
            "sent2": "He toyed with her, gently teasing her about her favorite movie.",
            "sent3": "The friends toyed with each other, laughing and joking around at the party.",
            "sent4": "The actor toyed with the audience, winking and blowing kisses during the performance.",
            "sent5": "The siblings toyed with each other, poking fun but always with love in their hearts."
        }
    ]
}