{
    "term": "trade",
    "meanings": [
        {
            "definition": "The action of buying and selling goods and services.",
            "pos": "noun",
            "sent1": "In the market, people often engage in trade to exchange items.",
            "sent2": "She works in the trade of handmade crafts.",
            "sent3": "The town's trade in fresh produce always brings a smile to the residents.",
            "sent4": "Their trade of secrets was like a silent dance between friends.",
            "sent5": "The bustling trade at the bazaar painted a colorful scene."
        },
        {
            "definition": "A particular job or profession.",
            "pos": "noun",
            "sent1": "His trade as a carpenter keeps him busy all week.",
            "sent2": "She learned the trade of baking from her grandmother.",
            "sent3": "The magician's trade of illusions never failed to amaze the audience.",
            "sent4": "Her trade as a detective allowed her to solve the mystery in no time.",
            "sent5": "The artist's trade of painting brought beauty to the world."
        },
        {
            "definition": "The exchange of one thing for another.",
            "pos": "noun",
            "sent1": "The trade of toys for snacks was a common practice among the children.",
            "sent2": "They made a fair trade of books for stationery supplies.",
            "sent3": "The trade of jokes between friends lightened the mood.",
            "sent4": "Their trade of stories by the campfire created lasting memories.",
            "sent5": "The trade of smiles between strangers warmed the hearts."
        },
        {
            "definition": "To engage in buying and selling goods and services.",
            "pos": "verb",
            "sent1": "They trade goods at the market every weekend.",
            "sent2": "She loves to trade vintage items online.",
            "sent3": "The siblings trade toys to play with something new.",
            "sent4": "He decided to trade his old car for a newer model.",
            "sent5": "They trade stories of their adventures around the world."
        },
        {
            "definition": "To exchange one thing for another.",
            "pos": "verb",
            "sent1": "They trade snacks during lunchtime at school.",
            "sent2": "She offered to trade her sandwich for his cookies.",
            "sent3": "The friends trade books to read different genres.",
            "sent4": "He decided to trade his blue pen for a red one.",
            "sent5": "They trade ideas to come up with the best solution."
        }
    ]
}