{
    "term": "trainbearer",
    "meanings": [
        {
            "definition": "A person who carries the train of a robe or gown.",
            "pos": "noun",
            "sent1": "The trainbearer carefully lifted the gown's train to prevent it from dragging on the ground.",
            "sent2": "During the ceremony, the trainbearer gracefully held the bride's train as she walked down the aisle.",
            "sent3": "The trainbearer tripped over the gown's train, causing a moment of laughter among the guests.",
            "sent4": "She felt like a trainbearer, carrying the weight of her responsibilities with elegance and poise.",
            "sent5": "The trainbearer's role was crucial, ensuring the gown's train flowed smoothly behind the bride."
        },
        {
            "definition": "A person who assists in carrying a bride's train during a wedding.",
            "pos": "noun",
            "sent1": "At the wedding, the trainbearer walked behind the bride, holding her train with care.",
            "sent2": "The trainbearer's task was to make sure the bride's train stayed off the ground.",
            "sent3": "The trainbearer playfully pretended the train was too heavy to lift, causing giggles from the guests.",
            "sent4": "She was like a trainbearer, supporting her friend through the ups and downs of wedding planning.",
            "sent5": "The trainbearer's hands were steady as they held the bride's train, a symbol of love and commitment."
        },
        {
            "definition": "A person who assists in carrying a royal or noble person's train during a formal event.",
            "pos": "noun",
            "sent1": "The trainbearer walked behind the queen, holding her majestic train with reverence.",
            "sent2": "During the royal event, the trainbearer's role was to ensure the queen's train remained pristine.",
            "sent3": "The trainbearer jokingly pretended to be a royal themselves, parading with an imaginary train.",
            "sent4": "She felt like a trainbearer, supporting the noble family with grace and dignity.",
            "sent5": "The trainbearer's presence added a touch of grandeur as they carried the queen's train with precision."
        }
    ]
}