{
    "term": "tramps",
    "meanings": [
        {
            "definition": "Walks with heavy steps",
            "pos": "verb",
            "sent1": "The elephant tramps through the jungle.",
            "sent2": "She tramps along the path, her boots thudding on the ground.",
            "sent3": "The giant tramps around the house, causing the floor to shake.",
            "sent4": "The storm tramps through the city, leaving destruction in its wake.",
            "sent5": "The dinosaur tramps through the forest, making the ground tremble."
        },
        {
            "definition": "A person who travels on foot",
            "pos": "noun",
            "sent1": "The weary tramps rested by the roadside.",
            "sent2": "The group of tramps set up camp in the clearing.",
            "sent3": "The friendly tramps shared stories around the campfire.",
            "sent4": "The adventurous tramps explored the mountains together.",
            "sent5": "The kind tramps helped each other along the journey."
        },
        {
            "definition": "To walk heavily or noisily",
            "pos": "verb",
            "sent1": "The old truck tramps down the road, its engine roaring.",
            "sent2": "She tramps up the stairs, her heavy boots echoing in the hallway.",
            "sent3": "The bear tramps through the forest, snapping twigs under its paws.",
            "sent4": "The horse tramps across the field, kicking up dust behind it.",
            "sent5": "The robot tramps through the factory, clanking with each step."
        },
        {
            "definition": "To travel on foot",
            "pos": "verb",
            "sent1": "They tramps through the countryside, enjoying the fresh air.",
            "sent2": "He tramps across the desert, his water bottle swinging from his pack.",
            "sent3": "The explorer tramps through the jungle, seeking hidden treasures.",
            "sent4": "She tramps along the beach, collecting seashells along the way.",
            "sent5": "The hiker tramps up the mountain, determined to reach the summit."
        },
        {
            "definition": "A long walk or journey",
            "pos": "noun",
            "sent1": "The tramps through the forest took all day.",
            "sent2": "Their tramps across the country lasted for weeks.",
            "sent3": "The tramps to the summit were challenging but rewarding.",
            "sent4": "The tramps through history taught them valuable lessons.",
            "sent5": "The tramps through the city revealed hidden gems along the way."
        }
    ]
}