{
    "term": "trammed",
    "meanings": [
        {
            "definition": "Transported in a tram.",
            "pos": "adjective",
            "sent1": "The trammed passengers enjoyed the smooth ride.",
            "sent2": "The trammed goods were delivered safely to their destination.",
            "sent3": "The trammed tourists marveled at the city sights.",
            "sent4": "The trammed memories of the journey lingered in their minds.",
            "sent5": "The trammed experience left a lasting impression on them."
        },
        {
            "definition": "Conveyed in a tram.",
            "pos": "adjective",
            "sent1": "The trammed commuters chatted during the ride.",
            "sent2": "The trammed passengers swayed gently with the tram's movements.",
            "sent3": "The trammed shoppers happily carried their purchases.",
            "sent4": "The trammed thoughts of the day's events filled her mind.",
            "sent5": "The trammed journey was a peaceful break from the day."
        },
        {
            "definition": "Moved in a tram.",
            "pos": "verb",
            "sent1": "They trammed swiftly through the bustling city streets.",
            "sent2": "The workers trammed to their offices every morning.",
            "sent3": "The children trammed to school with excitement.",
            "sent4": "The ideas trammed back and forth in his mind.",
            "sent5": "The tram trammed smoothly along the tracks."
        },
        {
            "definition": "Carried in a tram.",
            "pos": "adjective",
            "sent1": "The trammed packages were securely strapped in place.",
            "sent2": "The trammed tourists admired the city's architecture.",
            "sent3": "The trammed groceries were neatly packed in bags.",
            "sent4": "The trammed emotions of the day lingered in her heart.",
            "sent5": "The trammed journey provided a unique perspective of the city."
        }
    ]
}