{
    "term": "trammels",
    "meanings": [
        {
            "definition": "A restraint or hindrance",
            "pos": "noun",
            "sent1": "The trammels of fear held him back from trying new things.",
            "sent2": "The trammels of bureaucracy slowed down the project.",
            "sent3": "The trammels of a long line at the grocery store made him consider switching lanes.",
            "sent4": "Her anxiety acted like invisible trammels, preventing her from speaking up in meetings.",
            "sent5": "The trammels of self-doubt weighed heavily on his confidence."
        },
        {
            "definition": "To restrict or impede",
            "pos": "verb",
            "sent1": "She trammels her creativity by overthinking every idea.",
            "sent2": "Traffic congestion can trammel the flow of vehicles on the highway.",
            "sent3": "His tendency to procrastinate tends to trammel his progress on assignments.",
            "sent4": "The thick fog trammelled visibility on the road, causing accidents.",
            "sent5": "The strict rules trammelled their ability to innovate freely."
        },
        {
            "definition": "A fishing net with three layers of netting",
            "pos": "noun",
            "sent1": "The fishermen cast their trammels into the deep sea.",
            "sent2": "The trammels were heavy with the day's catch of fish.",
            "sent3": "The trammels glistened in the sunlight as they were pulled aboard.",
            "sent4": "The intricate design of the trammels ensured a successful haul.",
            "sent5": "The trammels swayed gently with the motion of the waves."
        },
        {
            "definition": "A type of shackle or fetter",
            "pos": "noun",
            "sent1": "The prisoner's ankles were bound by heavy trammels.",
            "sent2": "The trammels clinked as he tried to move across the room.",
            "sent3": "The trammels were too tight, causing discomfort to the wearer.",
            "sent4": "The trammels symbolized the loss of freedom and movement.",
            "sent5": "The weight of the trammels dragged him down, making escape impossible."
        }
    ]
}