{
    "term": "tramp",
    "meanings": [
        {
            "definition": "Walk heavily or noisily",
            "pos": "verb",
            "sent1": "The elephant began to tramp through the jungle, making the ground shake.",
            "sent2": "I could hear the soldiers tramp through the forest as they marched.",
            "sent3": "The clumsy giant tramped around the tiny village, causing chaos wherever he went.",
            "sent4": "The storm clouds tramped across the sky, darkening the horizon.",
            "sent5": "The construction workers tramped back and forth, carrying heavy materials."
        },
        {
            "definition": "A person who travels on foot",
            "pos": "noun",
            "sent1": "The weary tramp sat by the roadside, resting his tired feet.",
            "sent2": "The friendly tramp greeted everyone he met on his journey.",
            "sent3": "The kind tramp shared his meager meal with a hungry stray dog.",
            "sent4": "The old tramp told stories of his adventures on the road to the children.",
            "sent5": "The homeless tramp found shelter under a bridge during the storm."
        },
        {
            "definition": "A long walk or journey",
            "pos": "noun",
            "sent1": "The family enjoyed a leisurely tramp through the scenic countryside.",
            "sent2": "We embarked on a tramp through the mountains to reach the summit.",
            "sent3": "The children's tramp through the park turned into a playful game of tag.",
            "sent4": "The tramp along the riverbank revealed many hidden treasures.",
            "sent5": "The tramp through the snow-covered forest was both challenging and beautiful."
        },
        {
            "definition": "To travel on foot for a long distance",
            "pos": "verb",
            "sent1": "The explorers decided to tramp across the desert to reach the ancient ruins.",
            "sent2": "She had to tramp for miles to get to the nearest town.",
            "sent3": "The hikers planned to tramp up the steep mountain trail early in the morning.",
            "sent4": "The nomads would tramp from one oasis to another in search of water.",
            "sent5": "The pilgrims would tramp along the pilgrimage route, seeking spiritual enlightenment."
        }
    ]
}