{
    "term": "transportable",
    "meanings": [
        {
            "definition": "Able to be carried or moved from one place to another.",
            "pos": "adjective",
            "sent1": "The small suitcase was transportable, making it easy for the child to carry.",
            "sent2": "The fragile items were carefully packed in transportable boxes for the move.",
            "sent3": "The transportable backpack seemed to have a mind of its own, swinging back and forth as if dancing.",
            "sent4": "Her laughter was like a transportable joy, spreading from person to person in the room.",
            "sent5": "The idea of freedom was as transportable as a feather in the wind, light and easily carried."
        },
        {
            "definition": "Capable of being transported.",
            "pos": "adjective",
            "sent1": "The heavy machinery was not very transportable due to its size.",
            "sent2": "The large truck was designed to be transportable across long distances.",
            "sent3": "The transportable penguin costume made everyone at the party giggle.",
            "sent4": "His smile was so bright, it was like a transportable beam of sunlight.",
            "sent5": "The scent of fresh flowers was as transportable as a sweet memory, lingering in the air."
        },
        {
            "definition": "Suitable for being transported.",
            "pos": "adjective",
            "sent1": "The sturdy boxes were transportable and perfect for storing books.",
            "sent2": "The lightweight chairs were easily transportable for outdoor events.",
            "sent3": "The transportable umbrella kept spinning in the wind, much to the amusement of the children.",
            "sent4": "Her kindness was a transportable gift, always ready to be shared with others.",
            "sent5": "The melody of the song was as transportable as a whisper, floating through the room softly."
        }
    ]
}