{
    "term": "transmission",
    "meanings": [
        {
            "definition": "The act or process of transmitting something",
            "pos": "noun",
            "sent1": "The transmission of knowledge from teacher to student is crucial for learning.",
            "sent2": "The radio waves allow the transmission of music to reach listeners far and wide.",
            "sent3": "The transmission of gossip in the school hallway is always entertaining.",
            "sent4": "Her smile was a transmission of warmth and kindness to everyone she met.",
            "sent5": "The transmission of emotions through music can be incredibly powerful."
        },
        {
            "definition": "The mechanism by which power is transmitted from an engine to the wheels of a vehicle",
            "pos": "noun",
            "sent1": "The transmission in the car smoothly transfers power from the engine to the wheels.",
            "sent2": "The mechanic fixed the transmission to ensure the car could drive smoothly.",
            "sent3": "The transmission in the race car was so fast, it felt like flying.",
            "sent4": "The transmission of power in the car was like a well-oiled machine.",
            "sent5": "The transmission of energy in the vehicle made it zoom down the highway."
        },
        {
            "definition": "The process of sending and receiving signals, messages, or information",
            "pos": "noun",
            "sent1": "The transmission of data through the internet allows us to communicate instantly.",
            "sent2": "The satellite enables the transmission of TV signals to homes around the world.",
            "sent3": "The transmission of jokes in the chat group always brings laughter.",
            "sent4": "The transmission of news through newspapers keeps people informed.",
            "sent5": "The transmission of love messages warms the hearts of those who receive them."
        },
        {
            "definition": "The act of passing on a disease from one person to another",
            "pos": "noun",
            "sent1": "The transmission of the flu virus can be prevented by washing hands regularly.",
            "sent2": "The doctor explained how the transmission of the illness occurs in crowded places.",
            "sent3": "The transmission of a cold in the office led to many people getting sick.",
            "sent4": "The transmission of the virus was a reminder to practice good hygiene.",
            "sent5": "The transmission of diseases highlights the importance of vaccination."
        }
    ]
}