{
    "term": "trans",
    "meanings": [
        {
            "definition": "Across",
            "pos": "preposition",
            "sent1": "The bridge allowed us to trans the river easily.",
            "sent2": "We walked trans the street to get to the park.",
            "sent3": "I tried to trans the room without waking anyone up.",
            "sent4": "Her smile shone trans the room like a ray of sunshine.",
            "sent5": "The path led us trans the forest, filled with tall trees."
        },
        {
            "definition": "Beyond",
            "pos": "adverb",
            "sent1": "The view from the top of the mountain was trans beautiful.",
            "sent2": "She looked trans the horizon, dreaming of the future.",
            "sent3": "His excitement was trans what words could express.",
            "sent4": "Her kindness went trans what was expected.",
            "sent5": "The possibilities seemed trans endless for the young artist."
        },
        {
            "definition": "On the other side",
            "pos": "adverb",
            "sent1": "After crossing the river, we found ourselves trans.",
            "sent2": "The treasure was hidden trans the cave entrance.",
            "sent3": "He peeked trans the door to see who was there.",
            "sent4": "The cat waited patiently trans the fence for the mouse.",
            "sent5": "The key was located trans the bottom of the drawer."
        },
        {
            "definition": "Changing from one state to another",
            "pos": "adjective",
            "sent1": "The trans colors of the leaves signaled the arrival of autumn.",
            "sent2": "Her trans mood brightened the room.",
            "sent3": "The chameleon's trans skin amazed the children at the zoo.",
            "sent4": "The caterpillar's trans transformation into a butterfly was magical.",
            "sent5": "The trans weather kept everyone guessing what would come next."
        },
        {
            "definition": "Transmitting or transferring",
            "pos": "verb",
            "sent1": "He needed to trans the files to his colleague before the meeting.",
            "sent2": "The radio tower can trans signals across long distances.",
            "sent3": "She tried to trans her enthusiasm to the team through her speech.",
            "sent4": "The teacher's passion for literature trans to her students.",
            "sent5": "The technology allows us to trans data quickly and securely."
        },
        {
            "definition": "A prefix meaning 'across' or 'beyond'",
            "pos": "noun",
            "sent1": "In the word 'transatlantic,' 'trans' means across the Atlantic Ocean.",
            "sent2": "The term 'transgender' uses 'trans' to indicate a change or crossing of gender identity.",
            "sent3": "The use of 'trans' as a prefix adds depth and meaning to the word.",
            "sent4": "Understanding the prefix 'trans' helps decipher the meaning of many words.",
            "sent5": "The student learned that 'trans' can alter the entire sense of a word it is added to."
        }
    ]
}