{
    "term": "transplacental",
    "meanings": [
        {
            "definition": "Passing through or occurring across the placenta.",
            "pos": "adjective",
            "sent1": "The transplacental nutrients helped the baby grow strong.",
            "sent2": "Doctors monitored the transplacental movement of substances carefully.",
            "sent3": "The transplacental journey of vitamins was like a tiny adventure for the baby.",
            "sent4": "The bond between mother and child was as strong as a transplacental connection.",
            "sent5": "The importance of transplacental transfer cannot be overstated in prenatal development."
        },
        {
            "definition": "Relating to the transfer of substances through the placenta.",
            "pos": "adjective",
            "sent1": "The transplacental exchange of oxygen was crucial for the baby's health.",
            "sent2": "Researchers studied the transplacental movement of drugs in pregnant women.",
            "sent3": "The transplacental dance of nutrients was like a delicate ballet performance.",
            "sent4": "The transplacental pathway was a lifeline for the developing fetus.",
            "sent5": "The transplacental route ensured the baby received essential nutrients for growth."
        },
        {
            "definition": "Involving the transmission of infections from mother to fetus through the placenta.",
            "pos": "adjective",
            "sent1": "The transplacental spread of the virus was a concern for the doctors.",
            "sent2": "Preventing transplacental transmission of diseases is a priority in prenatal care.",
            "sent3": "The transplacental transfer of germs was like a sneaky game of tag.",
            "sent4": "The transplacental passage of infections posed a risk to the unborn child.",
            "sent5": "The consequences of transplacental infection can be severe for the fetus."
        }
    ]
}