{
    "term": "transilluminator",
    "meanings": [
        {
            "definition": "A device used to transmit light through a body part or substance for medical examination.",
            "pos": "noun",
            "sent1": "The doctor used a transilluminator to see inside the patient's body.",
            "sent2": "The transilluminator helped the surgeon locate the source of the problem.",
            "sent3": "The transilluminator made the patient's tummy glow like a magical light.",
            "sent4": "The transilluminator acted like a flashlight for the doctor's investigation.",
            "sent5": "With the transilluminator, the hidden mysteries of the body became visible."
        },
        {
            "definition": "A tool that illuminates objects from below to reveal internal structures.",
            "pos": "noun",
            "sent1": "The biologist used a transilluminator to study the tiny creatures in the water.",
            "sent2": "In the lab, the transilluminator exposed the intricate details of the specimen.",
            "sent3": "The transilluminator turned the ordinary rock into a glowing treasure chest.",
            "sent4": "Like a secret revealer, the transilluminator unveiled the hidden world beneath.",
            "sent5": "With the transilluminator's light, the hidden beauty of nature was revealed."
        },
        {
            "definition": "An instrument that emits light to highlight details or abnormalities.",
            "pos": "noun",
            "sent1": "The mechanic used a transilluminator to inspect the car engine closely.",
            "sent2": "During the examination, the transilluminator revealed the damaged areas.",
            "sent3": "The transilluminator turned the mundane task into a glowing adventure.",
            "sent4": "With the transilluminator's beam, the flaws were brought into sharp focus.",
            "sent5": "The transilluminator's light shone brightly on the hidden imperfections."
        }
    ]
}