{
    "term": "transfix",
    "meanings": [
        {
            "definition": "To cause someone to become motionless with horror, wonder, or astonishment.",
            "pos": "verb",
            "sent1": "The scary movie transfixes the audience, making them unable to look away.",
            "sent2": "The magician's trick transfixes the crowd, leaving them in awe.",
            "sent3": "The unexpected plot twist in the story transfixes the readers, keeping them glued to the pages.",
            "sent4": "The breathtaking view from the mountaintop transfixes hikers, freezing them in place.",
            "sent5": "The mesmerizing dance performance transfixes the viewers, capturing their full attention."
        },
        {
            "definition": "To pierce with a sharp implement or weapon.",
            "pos": "verb",
            "sent1": "The knight transfixes the dragon with his sword, aiming for its weak spot.",
            "sent2": "The chef transfixes the meat with a skewer before roasting it over the fire.",
            "sent3": "The tailor transfixes the fabric with a needle, securing the hem in place.",
            "sent4": "The hunter transfixes the target with an arrow, hitting the bullseye.",
            "sent5": "The surgeon transfixes the patient's skin with a scalpel, preparing for the incision."
        },
        {
            "definition": "To hold someone's attention completely.",
            "pos": "verb",
            "sent1": "The speaker transfixes the audience with her powerful words, keeping them engaged throughout the speech.",
            "sent2": "The artist's masterpiece transfixes viewers, drawing them in with its beauty.",
            "sent3": "The comedian transfixes the crowd with his jokes, making them burst into laughter.",
            "sent4": "The singer transfixes the audience with her melodious voice, creating a mesmerizing atmosphere.",
            "sent5": "The teacher transfixes the students with an interesting experiment, sparking their curiosity."
        }
    ]
}