{
    "term": "transnatural",
    "meanings": [
        {
            "definition": "Beyond or surpassing the natural world.",
            "pos": "adjective",
            "sent1": "The mysterious creature had transnatural powers that amazed everyone.",
            "sent2": "The glowing orb emitted a transnatural light that lit up the dark forest.",
            "sent3": "The transnatural abilities of the alien made it the star of the intergalactic circus.",
            "sent4": "Her beauty was so transnatural, it seemed to radiate from within.",
            "sent5": "The transnatural landscape of the enchanted forest was like something out of a dream."
        },
        {
            "definition": "Something that exists or occurs outside of nature.",
            "pos": "noun",
            "sent1": "The scientist studied the transnatural phenomenon with great curiosity.",
            "sent2": "Legends speak of transnatural beings that roam the earth under the cover of darkness.",
            "sent3": "The children giggled at the idea of a transnatural creature stealing socks from the laundry.",
            "sent4": "The eerie silence in the abandoned house felt transnatural, as if time stood still.",
            "sent5": "The painting depicted a transnatural landscape where reality and fantasy intertwined."
        },
        {
            "definition": "A supernatural or otherworldly phenomenon.",
            "pos": "noun",
            "sent1": "The town was abuzz with rumors of a transnatural event occurring in the old cemetery.",
            "sent2": "The ghost hunter specialized in capturing evidence of transnatural occurrences on camera.",
            "sent3": "The comedy show featured a hilarious skit about a transnatural being trying to navigate a grocery store.",
            "sent4": "The storm's fury seemed transnatural, as if nature itself was angry.",
            "sent5": "The author's novel delved into the realm of transnatural beings and their interactions with humans."
        }
    ]
}