{
    "term": "tranship",
    "meanings": [
        {
            "definition": "To transfer from one ship or mode of transportation to another.",
            "pos": "verb",
            "sent1": "The workers will tranship the cargo from the large ship to the smaller boat.",
            "sent2": "The company will tranship the goods from the truck to the train for faster delivery.",
            "sent3": "The pirates tried to tranship the treasure, but ended up dropping it in the ocean!",
            "sent4": "She had to tranship her emotions from fear to courage before giving the speech.",
            "sent5": "The crane operator carefully transhipped the containers, ensuring they arrived safely."
        },
        {
            "definition": "The act of transferring goods from one vessel to another.",
            "pos": "noun",
            "sent1": "The tranship of the supplies was done efficiently by the dock workers.",
            "sent2": "The tranship of the cargo was necessary to load it onto the waiting ship.",
            "sent3": "The tranship of the packages turned into a race between the workers.",
            "sent4": "The tranship of responsibilities between team members was seamless.",
            "sent5": "The tranship of the goods was a sight to behold as the cranes moved swiftly."
        },
        {
            "definition": "The process of transferring cargo from one vehicle to another.",
            "pos": "noun",
            "sent1": "The tranship of the luggage from the bus to the plane was quick.",
            "sent2": "The tranship of the products from the truck to the warehouse was completed in no time.",
            "sent3": "The tranship of the items became a fun challenge for the workers.",
            "sent4": "The tranship of knowledge from one generation to the next is crucial.",
            "sent5": "The tranship of the cargo was like a dance between the vehicles, perfectly coordinated."
        }
    ]
}