{
    "term": "transcends",
    "meanings": [
        {
            "definition": "Goes beyond the limits of",
            "pos": "verb",
            "sent1": "Her kindness transcends all expectations.",
            "sent2": "His determination transcends any obstacle in his way.",
            "sent3": "The cat's ability to open doors transcends human understanding.",
            "sent4": "Love transcends distance, connecting hearts across oceans.",
            "sent5": "The beauty of nature transcends language, speaking to all who behold it."
        },
        {
            "definition": "Surpasses in excellence or achievement",
            "pos": "verb",
            "sent1": "His artwork transcends mere talent, it is pure genius.",
            "sent2": "The athlete's skill transcends that of his competitors.",
            "sent3": "The chef's cooking transcends taste buds into a realm of ecstasy.",
            "sent4": "Her voice transcends mere singing, it is a heavenly melody.",
            "sent5": "The author's storytelling transcends imagination, bringing worlds to life."
        },
        {
            "definition": "Rises above or goes beyond the normal limits of",
            "pos": "verb",
            "sent1": "His generosity transcends what is expected, always giving more.",
            "sent2": "The eagle transcends other birds with its majestic flight.",
            "sent3": "The superhero's powers transcend logic, making him invincible.",
            "sent4": "Her wisdom transcends age, as if she holds the secrets of the universe.",
            "sent5": "The mountain peak transcends the clouds, reaching towards the sky."
        },
        {
            "definition": "To be superior or greater than",
            "pos": "verb",
            "sent1": "His intelligence transcends that of his peers, making him a prodigy.",
            "sent2": "The beauty of the sunset transcends any painting, it is nature's masterpiece.",
            "sent3": "The speed of the cheetah transcends all other land animals, making it the fastest.",
            "sent4": "Her kindness transcends mere politeness, it is genuine care for others.",
            "sent5": "The power of music transcends words, touching the soul in ways nothing else can."
        }
    ]
}