{
    "term": "transplantations",
    "meanings": [
        {
            "definition": "The act or process of transplanting something.",
            "pos": "noun",
            "sent1": "The transplantations of flowers into the garden brought color and life to the yard.",
            "sent2": "The hospital had a special unit dedicated to organ transplantations.",
            "sent3": "The transplantations of ideas between friends sparked interesting conversations.",
            "sent4": "Her kindness acted as a transplantation, spreading positivity wherever she went.",
            "sent5": "The transplantation of knowledge from books to young minds is crucial for learning."
        },
        {
            "definition": "The state of being transplanted.",
            "pos": "noun",
            "sent1": "After the transplantation, the plant slowly adapted to its new environment.",
            "sent2": "The transplantation of the tree was successful, and it thrived in its new home.",
            "sent3": "The transplantation of the family to a new city brought about many changes.",
            "sent4": "His heart felt a sense of transplantation as he moved to a different country.",
            "sent5": "The transplantation of traditions from one generation to the next preserves cultural heritage."
        },
        {
            "definition": "The surgical procedure of transferring tissue from one part of the body to another or from one person to another.",
            "pos": "noun",
            "sent1": "The doctor performed a transplantation to replace the damaged kidney.",
            "sent2": "The success rate of heart transplantations has improved over the years.",
            "sent3": "During the transplantation, the patient's family waited anxiously in the waiting room.",
            "sent4": "The transplantation of skin grafts helped the burn victim heal faster.",
            "sent5": "The transplantation of bone marrow saved the patient's life."
        }
    ]
}