{
    "term": "trap",
    "meanings": [
        {
            "definition": "A device used to catch animals",
            "pos": "noun",
            "sent1": "The hunter set up a trap to catch the rabbit.",
            "sent2": "The mouse got caught in the trap while looking for food.",
            "sent3": "The clever raccoon outsmarted the trap and escaped with the bait.",
            "sent4": "Her smile was a trap, luring him in with false promises.",
            "sent5": "The trap snapped shut, capturing the unsuspecting squirrel."
        },
        {
            "definition": "A situation in which someone is tricked or deceived",
            "pos": "noun",
            "sent1": "She fell into the trap of believing everything she read online.",
            "sent2": "The scam artist set a trap to steal people's money.",
            "sent3": "His friends played a harmless prank, creating a funny trap for him.",
            "sent4": "The trap of jealousy can lead to destructive behavior.",
            "sent5": "The trap of procrastination can hinder your success."
        },
        {
            "definition": "To catch someone in a trap",
            "pos": "verb",
            "sent1": "The detective managed to trap the thief in the alley.",
            "sent2": "She tried to trap the butterfly gently without harming it.",
            "sent3": "He accidentally trapped himself in the room with no way out.",
            "sent4": "The spider quickly trapped the fly in its web.",
            "sent5": "The clever fox managed to trap the hunter in his own game."
        },
        {
            "definition": "To set a trap for someone",
            "pos": "verb",
            "sent1": "The spy carefully set a trap to catch the enemy agent.",
            "sent2": "She decided to trap her brother by hiding his favorite toy.",
            "sent3": "The kids planned to trap their teacher with a fake spider.",
            "sent4": "He set a clever trap to catch the pesky raccoons in the garden.",
            "sent5": "The cunning villain plotted to trap the hero in a dangerous situation."
        }
    ]
}