{
    "term": "trapeses",
    "meanings": [
        {
            "definition": "trapeses: to walk or move wearily or heavily",
            "pos": "verb",
            "sent1": "After a long day at work, she trapeses home, feeling exhausted.",
            "sent2": "The tired hiker trapeses up the steep mountain trail.",
            "sent3": "The sleepy cat trapeses slowly to its cozy bed.",
            "sent4": "His heavy heart trapeses through the memories of lost love.",
            "sent5": "The old car trapeses along the bumpy road, struggling to keep up."
        },
        {
            "definition": "trapeses: a long, narrow platform suspended from ropes, used by acrobats or aerialists",
            "pos": "noun",
            "sent1": "The circus performer gracefully swings on the trapeses high above the audience.",
            "sent2": "The acrobat practiced her routine on the trapeses until it was perfect.",
            "sent3": "The trapeses swayed gently in the breeze, like a delicate swing.",
            "sent4": "The trapeses hung like a thin thread in the air, supporting the daring performer.",
            "sent5": "The trapeses sparkled under the circus lights, captivating the spectators."
        },
        {
            "definition": "trapeses: a series of acrobatic movements performed on a trapeze",
            "pos": "noun",
            "sent1": "The aerialist executed a flawless trapeses routine, stunning the audience.",
            "sent2": "The trapeses performance was the highlight of the circus show.",
            "sent3": "The acrobat's trapeses routine was both thrilling and elegant.",
            "sent4": "The trapeses sequence was like a dance in the air, mesmerizing everyone.",
            "sent5": "The trapeses act left the crowd in awe of the acrobat's skill and grace."
        },
        {
            "definition": "trapeses: to move or travel in a leisurely or aimless way",
            "pos": "verb",
            "sent1": "On lazy Sundays, they trapeses around the neighborhood, enjoying the sunshine.",
            "sent2": "The tourists trapeses through the quaint streets of the old town.",
            "sent3": "The butterfly trapeses from flower to flower, savoring the nectar.",
            "sent4": "Her thoughts trapeses from one idea to the next, without focus.",
            "sent5": "The river trapeses lazily through the meadow, reflecting the blue sky."
        }
    ]
}