{
    "term": "travailing",
    "meanings": [
        {
            "definition": "To work hard or labor",
            "pos": "verb",
            "sent1": "She was travailing in the fields under the hot sun.",
            "sent2": "The workers were travailing to finish the construction on time.",
            "sent3": "The ants were travailing tirelessly to gather food for their colony.",
            "sent4": "The artist was travailing over the details of her masterpiece.",
            "sent5": "The students were travailing through their final exams."
        },
        {
            "definition": "To suffer or endure",
            "pos": "verb",
            "sent1": "He was travailing through a difficult illness.",
            "sent2": "The refugees were travailing through harsh conditions to find safety.",
            "sent3": "The puppy's sad eyes made everyone feel like they were travailing with it.",
            "sent4": "She felt like she was travailing through a never-ending nightmare.",
            "sent5": "The old tree stood travailing against the strong winds."
        },
        {
            "definition": "The act of laboring or working",
            "pos": "noun",
            "sent1": "The travailing of the construction workers could be heard from afar.",
            "sent2": "Her travailing in the kitchen resulted in a delicious meal.",
            "sent3": "The busy bees' travailing was essential for pollination.",
            "sent4": "The sound of travailing echoed through the factory.",
            "sent5": "The students' travailing paid off with high grades."
        },
        {
            "definition": "The act of suffering or enduring",
            "pos": "noun",
            "sent1": "The travailing of the refugees touched the hearts of many.",
            "sent2": "The animal's eyes showed the travailing it had been through.",
            "sent3": "The old man's travailing was evident in his tired eyes.",
            "sent4": "The travailing of the soldiers was honored on Remembrance Day.",
            "sent5": "The tree's travailing against the storm was a sight to behold."
        }
    ]
}