{
    "term": "travesty",
    "meanings": [
        {
            "definition": "A false, absurd, or distorted representation of something",
            "pos": "noun",
            "sent1": "The play was a travesty of justice, showing a false version of what really happened.",
            "sent2": "The news article was a travesty, completely distorting the facts of the event.",
            "sent3": "It was a travesty to see the painting upside down, making everyone look silly.",
            "sent4": "The trial was a travesty, like a funhouse mirror reflecting a distorted reality.",
            "sent5": "The movie was a travesty, a twisted version of the original story that left everyone confused."
        },
        {
            "definition": "To represent in a false or absurd manner",
            "pos": "verb",
            "sent1": "He tried to travesty the historical event by changing key details.",
            "sent2": "The comedian travestied the politician's speech, making it sound ridiculous.",
            "sent3": "She travestied the recipe by adding too much salt, creating a disastrous dish.",
            "sent4": "The artist travestied the landscape, painting it in wild, unrealistic colors.",
            "sent5": "The author travestied the famous novel, rewriting it with a completely different ending."
        },
        {
            "definition": "An imitation that makes a serious thing seem ridiculous",
            "pos": "noun",
            "sent1": "The parody was a travesty of the original movie, making it a hilarious mockery.",
            "sent2": "The comedy show was a travesty, turning important issues into silly jokes.",
            "sent3": "The fashion show was a travesty of high-end designs, with models wearing clown costumes.",
            "sent4": "The political cartoon was a travesty, portraying the leaders as cartoon characters.",
            "sent5": "The school play was a travesty of Shakespeare, with students dressed in superhero costumes."
        }
    ]
}