{
    "term": "treehoppers",
    "meanings": [
        {
            "definition": "Treehoppers: insects that belong to the family Membracidae, known for their unique shapes and behaviors.",
            "pos": "noun",
            "sent1": "The treehoppers gathered on the branches, showcasing their diverse shapes.",
            "sent2": "I spotted treehoppers on the oak tree while walking in the park.",
            "sent3": "The treehoppers decided to have a fashion show to display their distinct shapes.",
            "sent4": "The treehoppers stood out in the garden like tiny sculptures come to life.",
            "sent5": "The treehoppers danced in the sunlight, their shapes mesmerizing to watch."
        },
        {
            "definition": "Treehoppers: a group of insects that feed on plant sap and can be found on a variety of plants.",
            "pos": "noun",
            "sent1": "The treehoppers sucked sap from the leaves to nourish themselves.",
            "sent2": "Farmers often have to deal with treehoppers damaging their crops.",
            "sent3": "The treehoppers held a picnic on the plant, sipping sap like it was juice.",
            "sent4": "The treehoppers were like tiny vampires, draining the plants of their life.",
            "sent5": "The treehoppers hopped from plant to plant, leaving a trail of sap behind."
        },
        {
            "definition": "Treehoppers: small insects with enlarged pronotums that resemble thorns or horns.",
            "pos": "noun",
            "sent1": "The treehoppers' pronotums looked like tiny shields on their backs.",
            "sent2": "The garden was full of treehoppers camouflaged among the thorny bushes.",
            "sent3": "The treehoppers decided to start a band, using their pronotums as drums.",
            "sent4": "The treehoppers' pronotums were like armor protecting them from predators.",
            "sent5": "The treehoppers' pronotums glinted in the sunlight, giving them a majestic appearance."
        }
    ]
}