{
    "term": "trefoils",
    "meanings": [
        {
            "definition": "A plant of the pea family with clover-like leaves, typically bearing small flowers in groups of three.",
            "pos": "noun",
            "sent1": "The field was filled with trefoils, their leaves swaying gently in the breeze.",
            "sent2": "The trefoils in the garden added a touch of greenery and charm.",
            "sent3": "The mischievous rabbit tried to hide behind the trefoils, thinking it was invisible.",
            "sent4": "Her laughter echoed through the meadow, dancing around the trefoils like a joyful melody.",
            "sent5": "The trefoils stood proudly, their delicate flowers reaching towards the sky."
        },
        {
            "definition": "A decorative architectural ornament in the form of three-lobed clover leaves.",
            "pos": "noun",
            "sent1": "The cathedral's intricate design included trefoils adorning the archways.",
            "sent2": "The trefoils on the ancient building added a sense of elegance and history.",
            "sent3": "The mischievous squirrel perched on the trefoils, pretending to be a royal guard.",
            "sent4": "Her eyes were drawn to the trefoils, each one a symbol of beauty and craftsmanship.",
            "sent5": "The trefoils seemed to whisper stories of the past to those who passed by."
        },
        {
            "definition": "A biscuit or cookie in the shape of a clover leaf.",
            "pos": "noun",
            "sent1": "She enjoyed snacking on trefoils while reading her favorite book.",
            "sent2": "The trefoils at the party were a hit among the guests, disappearing quickly.",
            "sent3": "The mischievous child tried to juggle the trefoils, but they kept crumbling in his hands.",
            "sent4": "Her grandmother's trefoils always brought back memories of warmth and love.",
            "sent5": "The sweet aroma of freshly baked trefoils filled the kitchen, tempting everyone nearby."
        }
    ]
}