{
    "term": "trepans",
    "meanings": [
        {
            "definition": "A surgical instrument used to remove circular sections of bone from the skull.",
            "pos": "noun",
            "sent1": "The doctor used a trepans to carefully remove a piece of bone from the patient's skull.",
            "sent2": "The ancient tool known as a trepans was used by early surgeons for skull surgeries.",
            "sent3": "During the surgery, the trepans made a buzzing sound that reminded everyone of a tiny drill.",
            "sent4": "The trepans cut through the bone like a sharp cookie cutter, leaving a clean hole in the skull.",
            "sent5": "The trepans gleamed under the bright lights of the operating room, ready for its precise task."
        },
        {
            "definition": "To operate on with a trepan.",
            "pos": "verb",
            "sent1": "The skilled surgeon carefully trepans the patient's skull to relieve pressure.",
            "sent2": "Doctors trepans in cases where traditional surgery might be too risky.",
            "sent3": "The clumsy intern accidentally trepans the wrong area, causing a comical mix-up.",
            "sent4": "She trepans through the bureaucratic red tape to get the patient the urgent care needed.",
            "sent5": "The determined surgeon trepans through the tough bone with precision and expertise."
        },
        {
            "definition": "To remove a circular section of bone from the skull.",
            "pos": "verb",
            "sent1": "The skilled neurosurgeon trepans a small piece of bone to access the brain.",
            "sent2": "In ancient times, healers trepans to release evil spirits they believed caused illness.",
            "sent3": "The archaeologist trepans carefully to avoid damaging the delicate skull structure.",
            "sent4": "She trepans a perfect circle, like a sculptor shaping marble with a chisel.",
            "sent5": "The specialized tool trepans smoothly through the bone, leaving a precise opening."
        }
    ]
}