{
    "term": "trepanations",
    "meanings": [
        {
            "definition": "The act or process of trepanning.",
            "pos": "noun",
            "sent1": "The trepanations performed by the ancient healers were believed to release evil spirits.",
            "sent2": "Doctors today study the history of trepanations to understand early medical practices.",
            "sent3": "During the play, the actor comically mimicked the trepanations of a surgeon, causing laughter in the audience.",
            "sent4": "Her curiosity about trepanations led her to explore the mysteries of ancient medical techniques.",
            "sent5": "The vivid description of trepanations in the book left a lasting impression on the readers."
        },
        {
            "definition": "The practice of drilling a hole in the skull as a form of surgery.",
            "pos": "noun",
            "sent1": "In some cultures, trepanations were believed to cure illnesses by releasing pressure from the brain.",
            "sent2": "The surgeon carefully performed the trepanations to relieve intracranial pressure.",
            "sent3": "The comedian joked about a clumsy doctor attempting trepanations, causing laughter in the audience.",
            "sent4": "The idea of trepanations as a medical procedure seemed like a drastic measure to some.",
            "sent5": "The movie depicted a dramatic scene of trepanations being performed in ancient times."
        },
        {
            "definition": "The surgical procedure of removing a piece of bone from the skull.",
            "pos": "noun",
            "sent1": "The archaeologists discovered ancient skulls with evidence of trepanations for medical purposes.",
            "sent2": "The patient underwent trepanations to address a skull fracture.",
            "sent3": "The children found a toy skull and pretended to perform trepanations on their stuffed animals.",
            "sent4": "The concept of trepanations as a way to treat head injuries was both fascinating and gruesome.",
            "sent5": "The documentary showcased the history of trepanations and its significance in ancient medicine."
        }
    ]
}