{
    "term": "triaged",
    "meanings": [
        {
            "definition": "To assign degrees of urgency to (multiple injuries, illnesses, etc.) in order to maximize the number of survivors.",
            "pos": "verb",
            "sent1": "The nurse triaged the patients quickly to save as many lives as possible.",
            "sent2": "In the emergency room, the medical team triaged the patients based on their injuries.",
            "sent3": "The doctor triaged the patients so efficiently that even the waiting room chairs seemed relieved.",
            "sent4": "She triaged the tasks on her to-do list like a skilled conductor orchestrating a symphony.",
            "sent5": "The firefighter's ability to triage the rescue efforts made him a hero in the community."
        },
        {
            "definition": "To determine the order of treatment of patients in a hospital based on the severity of their condition.",
            "pos": "verb",
            "sent1": "The doctor triaged the patients, ensuring those in critical condition were treated first.",
            "sent2": "During the disaster response, the medical team triaged the injured individuals effectively.",
            "sent3": "The hospital staff triaged the patients with such precision that even the bandages felt important.",
            "sent4": "She triaged the situation like a seasoned captain navigating through stormy seas.",
            "sent5": "The paramedic's ability to triage quickly saved many lives during the accident."
        },
        {
            "definition": "To prioritize tasks or issues based on their importance or urgency.",
            "pos": "verb",
            "sent1": "As the project manager, she triaged the tasks to ensure the project stayed on track.",
            "sent2": "In times of crisis, it is crucial to triage the issues effectively to address the most critical ones first.",
            "sent3": "The teacher triaged the homework assignments in a way that even the pencils felt valued.",
            "sent4": "He triaged the emails flooding his inbox like a skilled juggler managing multiple balls in the air.",
            "sent5": "The CEO's ability to triage business decisions led the company to success even in challenging times."
        }
    ]
}