{
    "term": "triages",
    "meanings": [
        {
            "definition": "The process of sorting or prioritizing patients based on the severity of their condition.",
            "pos": "noun",
            "sent1": "During a disaster, triages help medical staff decide who to treat first.",
            "sent2": "The hospital's triages efficiently managed the influx of patients after the accident.",
            "sent3": "In the play, the characters created a game using triages to decide the order of their tasks.",
            "sent4": "Her mind worked like a set of triages, organizing thoughts based on importance.",
            "sent5": "The teacher used colorful stickers to represent different levels of triages for the students to understand better."
        },
        {
            "definition": "To assign degrees of urgency to medical cases in order to determine the order of treatment.",
            "pos": "verb",
            "sent1": "The doctor triages the patients quickly to ensure those in critical condition receive immediate care.",
            "sent2": "She always triages the tasks on her to-do list to focus on the most important ones first.",
            "sent3": "The cat seemed to triages its toys, always playing with the same one first.",
            "sent4": "His ability to triages problems efficiently made him a valuable team member.",
            "sent5": "The leader triages the issues facing the community, addressing the most pressing ones first."
        },
        {
            "definition": "A system for determining the order of treatment based on the severity of a patient's condition.",
            "pos": "noun",
            "sent1": "The hospital implemented new triages to streamline patient care.",
            "sent2": "The triages in place helped the medical team prioritize their tasks effectively.",
            "sent3": "The triages in the cafeteria menu made it easy for students to choose their meals.",
            "sent4": "Her notebook was like a set of triages, with color-coded tabs for different subjects.",
            "sent5": "The triages in the emergency room saved lives by ensuring prompt treatment for critical cases."
        }
    ]
}