{
    "term": "triage",
    "meanings": [
        {
            "definition": "The process of sorting and prioritizing patients based on the severity of their condition.",
            "pos": "noun",
            "sent1": "During the triage, the nurse quickly assessed who needed help first.",
            "sent2": "In a busy emergency room, triage helps medical staff decide who to treat first.",
            "sent3": "The hospital's teddy bear triage was a fun way to teach kids about helping others.",
            "sent4": "In the chaos of the disaster, the team leader's triage of tasks saved the day.",
            "sent5": "The vivid image of triage in action stayed with the new medical student."
        },
        {
            "definition": "To assign degrees of urgency to patients in a medical emergency.",
            "pos": "verb",
            "sent1": "The paramedic had to triage the injured quickly to save lives.",
            "sent2": "Doctors triage patients to make sure the most critical cases are seen first.",
            "sent3": "The nurse jokingly said she would triage her to-do list before tackling it.",
            "sent4": "In the ER, the staff had to triage the flood of patients pouring in.",
            "sent5": "The teacher had to triage the student's questions to cover all the topics in class."
        },
        {
            "definition": "The act of determining the order of treatment for a group of patients based on the severity of their condition.",
            "pos": "noun",
            "sent1": "The doctor's triage of the patients ensured those in critical condition were seen first.",
            "sent2": "Triage in a disaster zone is crucial to saving as many lives as possible.",
            "sent3": "The triage of desserts at the party led to the chocolate cake disappearing first.",
            "sent4": "Her triage of tasks at work helped her stay organized and efficient.",
            "sent5": "The vivid memory of the triage process stuck with the new EMT trainee."
        }
    ]
}