{
    "term": "triboelectricities",
    "meanings": [
        {
            "definition": "The generation of static electricity by friction.",
            "pos": "noun",
            "sent1": "When I rubbed the balloon on my hair, I felt the triboelectricities build up.",
            "sent2": "Scientists study triboelectricities to understand how static electricity is created.",
            "sent3": "The triboelectricities from rubbing the socks on the carpet made my hair stand on end!",
            "sent4": "The triboelectricities between the plastic ruler and the cloth created a spark.",
            "sent5": "The triboelectricities between the clouds and the ground can lead to lightning strikes."
        },
        {
            "definition": "The study of electric charges produced by friction.",
            "pos": "noun",
            "sent1": "In my physics class, we learned about triboelectricities and how they relate to friction.",
            "sent2": "Researchers in the field of triboelectricities aim to develop new energy-harvesting technologies.",
            "sent3": "The professor's passion for triboelectricities made the subject surprisingly interesting.",
            "sent4": "Triboelectricities research is crucial for advancements in renewable energy.",
            "sent5": "Understanding triboelectricities can lead to innovative solutions for sustainable power generation."
        },
        {
            "definition": "The phenomenon of electric charges produced by rubbing two materials together.",
            "pos": "noun",
            "sent1": "The simple act of rubbing the balloon against my sweater created triboelectricities.",
            "sent2": "Children can observe triboelectricities by rubbing a balloon on their hair.",
            "sent3": "The magician's trick involved generating triboelectricities to make a light bulb glow.",
            "sent4": "Triboelectricities can be seen when shuffling feet on a carpet and then touching a metal object.",
            "sent5": "The triboelectricities between the socks and the floor caused a small shock when touched."
        }
    ]
}