{
    "term": "tribulations",
    "meanings": [
        {
            "definition": "A state of great trouble or suffering.",
            "pos": "noun",
            "sent1": "After facing many tribulations, she finally overcame her challenges.",
            "sent2": "The community came together to support each other during the tribulations of the storm.",
            "sent3": "Despite the tribulations, they found moments of joy in simple things like sharing a meal together.",
            "sent4": "The tribulations they endured were like a storm that eventually passed, leaving behind a sense of resilience.",
            "sent5": "The tribulations felt like heavy weights on their shoulders, but they carried on with determination."
        },
        {
            "definition": "An event causing suffering or distress.",
            "pos": "noun",
            "sent1": "The unexpected loss of her job was a major tribulation for her family.",
            "sent2": "The tribulations of war left deep scars on the survivors.",
            "sent3": "Despite the tribulations of the broken elevator, they climbed the stairs with laughter.",
            "sent4": "The tribulations of life's challenges can sometimes lead to unexpected growth and strength.",
            "sent5": "The tribulations of the marathon tested their endurance and determination to finish."
        },
        {
            "definition": "Severe trial or affliction.",
            "pos": "noun",
            "sent1": "The tribulations of the legal battle drained their resources and energy.",
            "sent2": "Facing the tribulations of illness, she remained hopeful for recovery.",
            "sent3": "The tribulations of the escape room game brought out their competitive spirits.",
            "sent4": "In the tribulations of the wilderness, they discovered their inner strength and survival skills.",
            "sent5": "The tribulations of the mountain climb tested their courage and teamwork."
        }
    ]
}