{
    "term": "tribe",
    "meanings": [
        {
            "definition": "A social division in a traditional society consisting of families or communities linked by social, economic, religious, or blood ties.",
            "pos": "noun",
            "sent1": "In the ancient village, each tribe had its own customs and traditions.",
            "sent2": "The Native American tribe lived off the land and respected nature.",
            "sent3": "The tribe's annual dance festival brought laughter and joy to the whole village.",
            "sent4": "The tribe of artists painted the town with vibrant colors and creativity.",
            "sent5": "The tribe's unity and loyalty were as strong as the roots of an ancient tree."
        },
        {
            "definition": "A group of people sharing a common occupation, interest, or habit.",
            "pos": "noun",
            "sent1": "The book club was a tribe of avid readers who met every week.",
            "sent2": "The surfing tribe gathered at the beach every morning to catch the waves.",
            "sent3": "The tribe of coffee lovers always sought out the best cafes in town.",
            "sent4": "She found her tribe of runners who motivated her to train harder.",
            "sent5": "The tribe of gamers conquered virtual worlds together, forming strong bonds."
        },
        {
            "definition": "A category of taxonomic classification between family and genus.",
            "pos": "noun",
            "sent1": "The biologist studied the behavior of each ant tribe in the ecosystem.",
            "sent2": "The botanist classified the new plant species into its respective tribe.",
            "sent3": "The tribe of insects in the garden seemed to have their own tiny society.",
            "sent4": "Each bird tribe had unique markings that helped in their identification.",
            "sent5": "The tribe of flowers in the meadow bloomed in a harmonious display of colors."
        }
    ]
}