{
    "term": "trierarchy",
    "meanings": [
        {
            "definition": "A system of government in which power is divided into three branches.",
            "pos": "noun",
            "sent1": "In the trierarchy, the executive, legislative, and judicial branches each have specific roles.",
            "sent2": "The trierarchy of government ensures a balance of power among different branches.",
            "sent3": "The trierarchy of rulers decided to rotate leadership every month for fun.",
            "sent4": "The trierarchy of power stood tall like three pillars supporting the nation.",
            "sent5": "The trierarchy of government is like a three-legged stool, stable and strong."
        },
        {
            "definition": "A group or organization with three levels of authority.",
            "pos": "noun",
            "sent1": "The company had a trierarchy of managers, supervisors, and employees.",
            "sent2": "In the trierarchy of the organization, decisions flowed from the top down.",
            "sent3": "The trierarchy of leadership made sure everyone knew their place in the team.",
            "sent4": "The trierarchy of authority resembled a pyramid, with the CEO at the peak.",
            "sent5": "The trierarchy of the company was like a ladder, with each level supporting the one above."
        },
        {
            "definition": "The state of being ruled by three individuals.",
            "pos": "noun",
            "sent1": "The trierarchy of rulers shared power equally among themselves.",
            "sent2": "In the trierarchy, decisions required the agreement of all three leaders.",
            "sent3": "The trierarchy of kings argued over who got to wear the crown on weekends.",
            "sent4": "The trierarchy of monarchs symbolized unity, strength, and cooperation.",
            "sent5": "The trierarchy of leaders worked together like a well-oiled machine, each playing a crucial role."
        }
    ]
}