{
    "term": "trigeminal",
    "meanings": [
        {
            "definition": "Relating to the trigeminal nerve.",
            "pos": "adjective",
            "sent1": "The doctor explained that the tingling sensation was due to a trigeminal issue.",
            "sent2": "The trigeminal nerve is responsible for transmitting sensory information from the face to the brain.",
            "sent3": "I joked that my trigeminal nerve must be on vacation because I couldn't feel a thing!",
            "sent4": "Her smile was as sharp and quick as a trigeminal response.",
            "sent5": "The trigeminal nerve felt like a tiny messenger running back and forth between my face and brain."
        },
        {
            "definition": "Of or relating to the trigeminal ganglion.",
            "pos": "adjective",
            "sent1": "The trigeminal ganglion is a cluster of nerve cell bodies near the base of the skull.",
            "sent2": "Injuries to the trigeminal ganglion can cause severe facial pain.",
            "sent3": "I imagined a tiny village inside my head where the trigeminal ganglion was the mayor!",
            "sent4": "Her thoughts were like signals passing through the trigeminal ganglion, quick and precise.",
            "sent5": "The trigeminal ganglion felt like a bustling nerve hub, constantly processing signals."
        },
        {
            "definition": "Pertaining to the trigeminal system.",
            "pos": "adjective",
            "sent1": "The trigeminal system plays a crucial role in facial sensation.",
            "sent2": "Damage to the trigeminal system can lead to facial numbness.",
            "sent3": "I compared my brain to a complex machine with the trigeminal system as its wiring.",
            "sent4": "Her understanding of emotions was as intricate as the trigeminal system.",
            "sent5": "The trigeminal system hummed with activity, like a busy city street at rush hour."
        }
    ]
}