{
    "term": "trims",
    "meanings": [
        {
            "definition": "To make neat or tidy by clipping, paring, or pruning",
            "pos": "verb",
            "sent1": "She trims the bushes in her garden every weekend.",
            "sent2": "He trims his hair regularly to keep it looking neat.",
            "sent3": "The barber accidentally trims too much off the top, giving him a new look.",
            "sent4": "She trims away the dead leaves, revealing the healthy plant underneath.",
            "sent5": "The tailor trims the fabric with precision, creating a perfect fit."
        },
        {
            "definition": "To remove excess or unwanted parts",
            "pos": "verb",
            "sent1": "He trims the fat off the meat before cooking it.",
            "sent2": "She trims the rough edges of the paper to make it smooth.",
            "sent3": "The chef trims the recipe down to its essential ingredients.",
            "sent4": "He trims the unnecessary details from the report to make it concise.",
            "sent5": "She trims the overgrown branches to improve the tree's health."
        },
        {
            "definition": "A decorative addition or border, often made of fabric or ribbon",
            "pos": "noun",
            "sent1": "The dress had beautiful lace trims along the hem.",
            "sent2": "She added golden trims to the curtains for a touch of elegance.",
            "sent3": "The trims on the pillowcases matched the bedspread perfectly.",
            "sent4": "The trims on the tablecloth sparkled in the candlelight.",
            "sent5": "The trims on the costume made it stand out on stage."
        },
        {
            "definition": "To adjust or balance the sails of a ship",
            "pos": "verb",
            "sent1": "The sailor trims the sails to catch the wind more effectively.",
            "sent2": "He trims the sails to ensure the ship moves smoothly through the water.",
            "sent3": "The captain trims the sails expertly, guiding the ship through the storm.",
            "sent4": "She trims the sails skillfully, maximizing the ship's speed.",
            "sent5": "Trims the sails carefully to navigate the ship safely through the rough seas."
        },
        {
            "definition": "To decorate or embellish with a finishing touch",
            "pos": "verb",
            "sent1": "She trims the cake with delicate icing flowers.",
            "sent2": "He trims the gift with a bow before presenting it.",
            "sent3": "The artist trims the painting with a gold frame.",
            "sent4": "She trims the outfit with a statement necklace.",
            "sent5": "He trims the garden with fairy lights for a magical touch."
        }
    ]
}