{
    "term": "tripping",
    "meanings": [
        {
            "definition": "To stumble or fall due to catching one's foot on something.",
            "pos": "verb",
            "sent1": "She was tripping over the uneven pavement.",
            "sent2": "Be careful not to trip on the loose carpet.",
            "sent3": "He kept tripping on his own shoelaces, making everyone laugh.",
            "sent4": "Her heart was tripping with excitement as she approached the finish line.",
            "sent5": "The image of her tripping on stage was forever etched in her memory."
        },
        {
            "definition": "To experience a hallucinatory state induced by drugs.",
            "pos": "verb",
            "sent1": "He thought he was tripping after taking the strange pill.",
            "sent2": "People claim to see strange things when they are tripping on psychedelics.",
            "sent3": "The movie made it seem like the characters were tripping on magic potions.",
            "sent4": "Her mind was tripping through a kaleidoscope of colors and shapes.",
            "sent5": "The artist's paintings made you feel like you were tripping without drugs."
        },
        {
            "definition": "To move with light, quick steps.",
            "pos": "verb",
            "sent1": "The children were tripping happily along the path.",
            "sent2": "She was tripping lightly across the dance floor.",
            "sent3": "The fairies in the story were tripping around the garden joyfully.",
            "sent4": "The melody made her feel like she was tripping through a meadow.",
            "sent5": "The butterflies were tripping from flower to flower in the garden."
        },
        {
            "definition": "To activate a safety mechanism by accident.",
            "pos": "verb",
            "sent1": "He ended up tripping the alarm by mistake.",
            "sent2": "Make sure not to trip the emergency switch unless necessary.",
            "sent3": "She accidentally tripped the security system, causing chaos.",
            "sent4": "The cat managed to trip the sensor, setting off the lights.",
            "sent5": "The curious child tripped the lock, surprising everyone inside."
        }
    ]
}