{
    "term": "triviums",
    "meanings": [
        {
            "definition": "A collection of three studies: grammar, rhetoric, and logic.",
            "pos": "noun",
            "sent1": "In school, we learned about the triviums of grammar, rhetoric, and logic.",
            "sent2": "The triviums were essential subjects in the curriculum of the medieval university.",
            "sent3": "The triviums decided to start a band called 'The Grammar Gurus'.",
            "sent4": "Her mind was a triviums, with grammar as the foundation, rhetoric as the melody, and logic as the harmony.",
            "sent5": "The triviums of knowledge stood tall like three pillars of wisdom."
        },
        {
            "definition": "A group of three branches of knowledge or learning.",
            "pos": "noun",
            "sent1": "The triviums of science, math, and history are important for a well-rounded education.",
            "sent2": "She excelled in the triviums of art, music, and literature.",
            "sent3": "The triviums of cooking, baking, and grilling were his specialties.",
            "sent4": "The triviums of wisdom, experience, and intuition guided her through tough decisions.",
            "sent5": "His triviums of skills made him a versatile and valuable team member."
        },
        {
            "definition": "A set of three subjects taught in medieval universities.",
            "pos": "noun",
            "sent1": "Students in the medieval university focused on the triviums of grammar, rhetoric, and logic.",
            "sent2": "The triviums were the foundation of education in the medieval times.",
            "sent3": "The triviums decided to open a tavern for medieval scholars.",
            "sent4": "Her knowledge was a triviums, with grammar as the base, rhetoric as the walls, and logic as the roof.",
            "sent5": "The triviums of the past paved the way for modern education systems."
        }
    ]
}