{
    "term": "trollying",
    "meanings": [
        {
            "definition": "The act of pushing a shopping cart around a store.",
            "pos": "noun",
            "sent1": "I enjoy trollying in the supermarket to find my favorite snacks.",
            "sent2": "She was trollying through the aisles, looking for the best deals.",
            "sent3": "While trollying, I accidentally bumped into a display of canned goods!",
            "sent4": "Her trollying through the store was like a dance, smooth and effortless.",
            "sent5": "The sound of trollying carts echoed through the busy store."
        },
        {
            "definition": "The act of posting inflammatory or off-topic comments online in order to provoke a response.",
            "pos": "noun",
            "sent1": "He was caught trollying on social media by spreading false information.",
            "sent2": "Trollying on forums can lead to arguments and misunderstandings.",
            "sent3": "The internet troll's trollying caused chaos in the online community.",
            "sent4": "Her trollying comments ignited a heated debate among the users.",
            "sent5": "The consequences of trollying can be harmful and hurtful to others.",
            "sent6": "Trollying can create a negative atmosphere online, affecting many people."
        },
        {
            "definition": "The act of moving a vehicle along a track or line.",
            "pos": "noun",
            "sent1": "The children enjoyed trollying around the amusement park on the small train.",
            "sent2": "The trollying of the tram along the tracks was smooth and efficient.",
            "sent3": "The trollying of the roller coaster made everyone scream with excitement.",
            "sent4": "The trollying of the subway train was like a silent dance through the tunnels.",
            "sent5": "The trollying of the cable car provided breathtaking views of the city below."
        }
    ]
}