{
    "term": "trolley",
    "meanings": [
        {
            "definition": "A wheeled vehicle typically used for transporting goods or passengers.",
            "pos": "noun",
            "sent1": "The trolley carried boxes of groceries from the store.",
            "sent2": "I pushed the trolley through the airport with my luggage.",
            "sent3": "The trolley decided to take a break and refused to move any further.",
            "sent4": "Her laughter echoed through the hallway like a trolley full of joy.",
            "sent5": "The bright red trolley stood out among the crowd of vehicles."
        },
        {
            "definition": "A device used for collecting items in a supermarket.",
            "pos": "noun",
            "sent1": "The trolley in the supermarket was filled with various products.",
            "sent2": "Don't forget to return your trolley after you finish shopping.",
            "sent3": "The mischievous cat jumped into the trolley and hid among the groceries.",
            "sent4": "Her mind was like a trolley, collecting memories along the aisles of time.",
            "sent5": "The shiny trolley gleamed under the supermarket lights."
        },
        {
            "definition": "A metal basket on wheels used for carrying tools or equipment.",
            "pos": "noun",
            "sent1": "The mechanic wheeled the trolley filled with tools to the broken car.",
            "sent2": "She organized her art supplies neatly in the metal trolley.",
            "sent3": "The trolley clanked loudly as it rolled over the bumpy ground.",
            "sent4": "His heart felt heavy, like a trolley burdened with sorrow.",
            "sent5": "The trolley rattled as it carried the heavy load of equipment."
        },
        {
            "definition": "A streetcar or tram.",
            "pos": "noun",
            "sent1": "The trolley moved smoothly along the tracks in the city.",
            "sent2": "People waited at the stop for the trolley to arrive.",
            "sent3": "The trolley driver waved cheerfully at the passengers on board.",
            "sent4": "The trolley hummed with life as it transported commuters to their destinations.",
            "sent5": "The old trolley added charm to the historic neighborhood."
        }
    ]
}