{
    "term": "trolleying",
    "meanings": [
        {
            "definition": "The act of pushing or pulling a trolley.",
            "pos": "noun",
            "sent1": "She enjoyed trolleying her groceries around the store.",
            "sent2": "The workers were trolleying heavy boxes in the warehouse.",
            "sent3": "The kids had a race trolleying their toys in the backyard.",
            "sent4": "The trolleying of luggage through the airport was like a parade.",
            "sent5": "The sound of trolleying echoed through the empty hallway."
        },
        {
            "definition": "The use of a trolley for transporting goods.",
            "pos": "noun",
            "sent1": "Supermarkets rely on trolleying for customers to carry their purchases.",
            "sent2": "The warehouse manager organized the trolleying of supplies efficiently.",
            "sent3": "The trolleying of snacks at the party made it easy for guests to grab what they wanted.",
            "sent4": "The trolleying of tools in the workshop was like a well-choreographed dance.",
            "sent5": "The smooth trolleying of goods along the conveyor belt impressed the onlookers."
        },
        {
            "definition": "The movement of a trolley along a track.",
            "pos": "noun",
            "sent1": "The trolleying of the tram along the track was smooth and quiet.",
            "sent2": "The children watched in awe as the trolleying train passed by.",
            "sent3": "The trolleying of the rollercoaster cart thrilled the riders.",
            "sent4": "The trolleying of the luggage cart seemed effortless on the airport runway.",
            "sent5": "The trolleying of the shopping cart down the aisle was a familiar sound in the supermarket."
        },
        {
            "definition": "The act of riding on a trolley for transportation.",
            "pos": "noun",
            "sent1": "The tourists enjoyed trolleying through the city to see the sights.",
            "sent2": "She felt the breeze on her face while trolleying on the open-air tram.",
            "sent3": "The trolleying of the sightseeing tram made the tour fun and informative.",
            "sent4": "Trolleying on the historic streetcar felt like traveling back in time.",
            "sent5": "The rhythmic trolleying of the cable car added charm to the urban landscape."
        }
    ]
}