{
    "term": "trone",
    "meanings": [
        {
            "definition": "A large, ornate chair with a high back, often used by royalty or other important figures.",
            "pos": "noun",
            "sent1": "The king sat proudly on his trone during the royal ceremony.",
            "sent2": "The queen's trone was adorned with intricate carvings and velvet cushions.",
            "sent3": "The trone looked so grand that even the court jester felt like a king sitting on it.",
            "sent4": "As she sat on the trone, she felt the weight of responsibility on her shoulders.",
            "sent5": "The trone's golden accents gleamed in the sunlight, making it a symbol of power and majesty."
        },
        {
            "definition": "To sit on a throne as a ruler or monarch.",
            "pos": "verb",
            "sent1": "The young prince dreamed of the day he would trone over his kingdom.",
            "sent2": "After the coronation, the new queen finally had the chance to trone on the royal seat.",
            "sent3": "The cat decided to trone on the top of the bookshelf, surveying its kingdom of books.",
            "sent4": "She felt a sense of pride as she troned on the throne, accepting the crown.",
            "sent5": "The knight kneeled before the king, who troned with grace and authority."
        },
        {
            "definition": "To be in a position of power or authority.",
            "pos": "verb",
            "sent1": "After years of hard work, she finally troned as the CEO of the company.",
            "sent2": "The wise elder trones over the council, guiding them with experience.",
            "sent3": "The mischievous squirrel troned over the bird feeder, keeping all the birds at bay.",
            "sent4": "In her role as mayor, she trones with fairness and compassion for her town.",
            "sent5": "The general trones over the battlefield, strategizing each move with precision."
        }
    ]
}