{
    "term": "tropaeolums",
    "meanings": [
        {
            "definition": "Tropaeolums: a genus of flowering plants commonly known as nasturtiums.",
            "pos": "noun",
            "sent1": "In the garden, the tropaeolums added a splash of color with their bright flowers.",
            "sent2": "I planted some tropaeolums in my backyard to attract butterflies.",
            "sent3": "The tropaeolums in the flower bed seemed to be gossiping about the other plants.",
            "sent4": "Her laughter echoed through the garden like the vibrant hues of tropaeolums.",
            "sent5": "The scent of tropaeolums filled the air, making the garden feel alive."
        },
        {
            "definition": "Tropaeolums: the bright, showy flowers of the nasturtium plant.",
            "pos": "noun",
            "sent1": "The tropaeolums in the vase brightened up the room with their vivid colors.",
            "sent2": "She admired the tropaeolums in the garden for their beauty and resilience.",
            "sent3": "The little girl pretended the tropaeolums were tiny dancers in a floral ballet.",
            "sent4": "The tropaeolums in full bloom were like fireworks bursting in the garden.",
            "sent5": "The butterflies fluttered around the tropaeolums, drawn to their vibrant petals."
        },
        {
            "definition": "Tropaeolums: a type of plant with round leaves and colorful flowers.",
            "pos": "noun",
            "sent1": "The tropaeolums in the pot on the windowsill brightened up the kitchen.",
            "sent2": "The children loved picking tropaeolums from the garden to make bouquets.",
            "sent3": "The mischievous squirrel tried to steal the tropaeolums but got tangled in the vines.",
            "sent4": "Her happiness bloomed like the tropaeolums in the spring sunshine.",
            "sent5": "The garden was a sea of tropaeolums, each one a tiny burst of joy."
        }
    ]
}