{
    "term": "trouble",
    "meanings": [
        {
            "definition": "Difficulty or problems",
            "pos": "noun",
            "sent1": "Carrying heavy bags can be a trouble for some people.",
            "sent2": "The student had trouble understanding the math problem.",
            "sent3": "It's always a bit of trouble to find a parking spot in the city.",
            "sent4": "The trouble of fixing the leaky faucet seemed never-ending.",
            "sent5": "The trouble of waking up early on Mondays is real."
        },
        {
            "definition": "To cause distress or worry",
            "pos": "verb",
            "sent1": "Loud noises can trouble pets and make them anxious.",
            "sent2": "She didn't want to trouble her parents with her problems.",
            "sent3": "The idea of spiders can trouble some people more than others.",
            "sent4": "The thought of failing the test troubled him greatly.",
            "sent5": "The storm troubled the residents as they feared for their safety."
        },
        {
            "definition": "A person causing difficulty or problems",
            "pos": "noun",
            "sent1": "The troublemaker in class always disrupts the lesson.",
            "sent2": "The new employee turned out to be a trouble for the team.",
            "sent3": "The little trouble in the group added some excitement to the day.",
            "sent4": "The trouble in the office was known for stirring up conflicts.",
            "sent5": "The trouble in the neighborhood was finally caught by the police."
        },
        {
            "definition": "To disturb or agitate",
            "pos": "verb",
            "sent1": "The loud music from the party troubled the neighbors.",
            "sent2": "Please don't trouble the cat while it's sleeping.",
            "sent3": "The wind troubled the calm surface of the lake.",
            "sent4": "The barking dog troubled the peaceful atmosphere of the park.",
            "sent5": "The noisy construction work troubled the entire street."
        },
        {
            "definition": "To experience difficulty or problems",
            "pos": "verb",
            "sent1": "She troubled with her car's engine for hours.",
            "sent2": "The hikers troubled through the rough terrain to reach the summit.",
            "sent3": "The team troubled to come up with a solution to the problem.",
            "sent4": "He troubled with the decision of which college to attend.",
            "sent5": "The company troubled with financial issues during the recession."
        }
    ]
}