{
    "term": "troughs",
    "meanings": [
        {
            "definition": "A long, narrow open container for animals to eat or drink out of.",
            "pos": "noun",
            "sent1": "The farmer filled the troughs with fresh water for the thirsty cows.",
            "sent2": "The horses gathered around the troughs to quench their thirst after a long day.",
            "sent3": "The mischievous goat decided to take a bath in the troughs instead of drinking from them.",
            "sent4": "The troughs lined up in a row looked like a series of tiny swimming pools for the animals.",
            "sent5": "The image of the overflowing troughs stayed in the farmer's mind as a symbol of abundance."
        },
        {
            "definition": "A long, narrow depression in the ground.",
            "pos": "noun",
            "sent1": "Rainwater collected in the troughs formed by the heavy footprints of the hikers.",
            "sent2": "The path led through a series of troughs that had been carved out by years of erosion.",
            "sent3": "The children pretended the troughs were secret tunnels leading to buried treasure.",
            "sent4": "The troughs in the landscape resembled wrinkles on the earth's surface, telling stories of time.",
            "sent5": "The troughs in the valley created a mesmerizing pattern when viewed from above."
        },
        {
            "definition": "A period of low activity or depression in a business cycle.",
            "pos": "noun",
            "sent1": "During the economic troughs, many businesses struggled to stay afloat.",
            "sent2": "The company had to make tough decisions to survive the financial troughs of the recession.",
            "sent3": "The CEO remained optimistic, seeing the troughs as opportunities for growth and innovation.",
            "sent4": "The troughs in the market served as a reminder of the cyclical nature of business trends.",
            "sent5": "The team worked tirelessly to climb out of the troughs and reach new heights of success."
        }
    ]
}