{
    "term": "truant",
    "meanings": [
        {
            "definition": "A student who stays away from school without permission.",
            "pos": "noun",
            "sent1": "The teacher called the principal when the truant student didn't show up for class.",
            "sent2": "The school counselor reached out to the parents of the truant student to address the issue.",
            "sent3": "The truant student thought skipping school was a fun adventure, but it got them into trouble.",
            "sent4": "Being a truant is like missing out on important lessons that can help you succeed in the future.",
            "sent5": "The truant student's absence from school was as noticeable as a bright red apple in a sea of green ones."
        },
        {
            "definition": "To stay away from school without permission.",
            "pos": "verb",
            "sent1": "The student decided to truant and spend the day at the park instead of attending classes.",
            "sent2": "If you truant often, you may fall behind in your studies and miss out on valuable learning opportunities.",
            "sent3": "The mischievous student truanted to avoid a pop quiz, but ended up regretting it.",
            "sent4": "Her decision to truant from school was like taking a detour from the road to success.",
            "sent5": "The urge to truant can be tempting, but it's important to prioritize education for a brighter future."
        },
        {
            "definition": "A person who shirks work or duty.",
            "pos": "noun",
            "sent1": "The boss warned the employees not to be truants and to fulfill their responsibilities diligently.",
            "sent2": "The truant in the office always found excuses to avoid completing tasks on time.",
            "sent3": "The truant employee tried to sneak out early every day, but the supervisor noticed.",
            "sent4": "Being a truant at work is like being a missing puzzle piece in a completed picture.",
            "sent5": "The truant's lack of commitment was as clear as a cloudless sky on a sunny day."
        },
        {
            "definition": "To shirk work or duty.",
            "pos": "verb",
            "sent1": "She would often truant from her responsibilities by pretending to be busy with other tasks.",
            "sent2": "If you truant from your duties, it can lead to negative consequences for the whole team.",
            "sent3": "The employee tried to truant from the team meeting, but the manager caught on to the scheme.",
            "sent4": "His habit of truanting from important tasks was like planting seeds of failure in his career.",
            "sent5": "The temptation to truant from work can be strong, but it's crucial to stay dedicated for success."
        }
    ]
}