{
    "term": "trucked",
    "meanings": [
        {
            "definition": "To convey or transport goods by truck.",
            "pos": "verb",
            "sent1": "The farmer trucked his fresh produce to the market.",
            "sent2": "The company trucked the new furniture to the customer's house.",
            "sent3": "The penguins trucked their fishy snacks to the picnic.",
            "sent4": "The memories trucked into her mind like a speeding freight train.",
            "sent5": "The children watched in awe as the massive trucked goods rolled by."
        },
        {
            "definition": "To engage in the business of conveying goods by truck.",
            "pos": "verb",
            "sent1": "She trucked goods across the country for her job.",
            "sent2": "The company trucked packages for various clients.",
            "sent3": "The squirrels decided to start trucking nuts for a living.",
            "sent4": "The idea trucked through his mind, and he started his own delivery service.",
            "sent5": "The trucked goods business boomed during the holiday season."
        },
        {
            "definition": "To drive a truck.",
            "pos": "verb",
            "sent1": "He trucked the heavy load up the steep hill.",
            "sent2": "She trucked through the city traffic with ease.",
            "sent3": "The raccoon trucked the garbage truck for a day.",
            "sent4": "The trucked vehicle rumbled along the dusty road.",
            "sent5": "The driver trucked carefully through the stormy weather."
        },
        {
            "definition": "To exchange or barter goods or services.",
            "pos": "verb",
            "sent1": "They trucked their handmade crafts for fresh produce.",
            "sent2": "The neighbors trucked babysitting services for gardening help.",
            "sent3": "The kids trucked toys at the playground.",
            "sent4": "The communities trucked resources to help each other in times of need.",
            "sent5": "The villagers trucked skills to create a thriving economy."
        }
    ]
}