{
    "term": "truckling",
    "meanings": [
        {
            "definition": "To act in a subservient manner; to be overly obedient or submissive.",
            "pos": "verb",
            "sent1": "She was always truckling to her boss, doing whatever he asked without question.",
            "sent2": "The servant was truckling to the king, bowing deeply and following his every command.",
            "sent3": "The puppy was truckling to its owner, wagging its tail and rolling over for belly rubs.",
            "sent4": "The politician was accused of truckling to the wealthy donors, always agreeing with their demands.",
            "sent5": "The student was truckling to the teacher, completing extra assignments to impress her."
        },
        {
            "definition": "To flatter or fawn over someone in order to gain favor.",
            "pos": "verb",
            "sent1": "He was constantly truckling to his supervisor, complimenting her work to get a promotion.",
            "sent2": "The salesperson was truckling to the customer, praising their choices to make a sale.",
            "sent3": "The cat was truckling to its owner, rubbing against their legs and purring for attention.",
            "sent4": "The celebrity was tired of people truckling to them, always seeking autographs and selfies.",
            "sent5": "The student was truckling to the principal, offering to help with school events to be noticed."
        },
        {
            "definition": "To yield or give in to someone's demands or wishes.",
            "pos": "verb",
            "sent1": "She was truckling to her friend's request, agreeing to go to the movie even though she preferred staying in.",
            "sent2": "The manager was truckling to the demands of the shareholders, implementing changes against his better judgment.",
            "sent3": "The child was truckling to their sibling, sharing their favorite toy without hesitation.",
            "sent4": "The employee was truckling to the unreasonable demands of the boss, working overtime without complaint.",
            "sent5": "The student was truckling to the teacher's instructions, following them to the letter for a good grade."
        }
    ]
}