{
    "term": "trues",
    "meanings": [
        {
            "definition": "In accordance with fact or reality",
            "pos": "adjective",
            "sent1": "The trues story made everyone believe in its honesty.",
            "sent2": "Her trues answer impressed the teacher with its accuracy.",
            "sent3": "He told a trues tale that had everyone laughing.",
            "sent4": "The trues colors of the sunset painted the sky beautifully.",
            "sent5": "The trues nature of his character shone through in every action."
        },
        {
            "definition": "Correct or accurate",
            "pos": "adjective",
            "sent1": "The trues answer to the math problem was revealed.",
            "sent2": "She always gives trues directions when asked.",
            "sent3": "His trues aim in archery never failed to hit the target.",
            "sent4": "The trues path to success is through hard work and dedication.",
            "sent5": "The trues value of the antique was finally determined by the expert."
        },
        {
            "definition": "Sincerely felt or expressed",
            "pos": "adjective",
            "sent1": "Her trues gratitude was evident in her heartfelt thank you.",
            "sent2": "He spoke with trues emotion during the heartfelt speech.",
            "sent3": "The trues joy of the moment brought tears to her eyes.",
            "sent4": "His trues love for music was clear in every note he played.",
            "sent5": "The trues friendship between them was unbreakable and genuine."
        },
        {
            "definition": "Consistent with fact or reality",
            "pos": "adjective",
            "sent1": "The trues account of the event matched all the evidence.",
            "sent2": "His trues prediction about the outcome proved to be correct.",
            "sent3": "The trues nature of the situation slowly became clear to everyone.",
            "sent4": "The trues reflection in the mirror showed her true self.",
            "sent5": "The trues understanding of the topic came after hours of study."
        }
    ]
}