{
    "term": "trumpet",
    "meanings": [
        {
            "definition": "A brass musical instrument with a flared bell and a bright, penetrating tone.",
            "pos": "noun",
            "sent1": "The band played a trumpet at the concert.",
            "sent2": "She learned to play the trumpet in music class.",
            "sent3": "The trumpet blared, waking up the entire neighborhood.",
            "sent4": "His voice was a trumpet, commanding attention in the room.",
            "sent5": "The trumpet's shiny surface gleamed under the stage lights."
        },
        {
            "definition": "To proclaim or announce loudly or widely.",
            "pos": "verb",
            "sent1": "The mayor will trumpet the new policy in his speech.",
            "sent2": "They trumpet their achievements to everyone they meet.",
            "sent3": "The cat tried to trumpet its hunger by knocking over the food bowl.",
            "sent4": "Her laughter seemed to trumpet through the entire building.",
            "sent5": "The news anchor's voice seemed to trumpet the urgency of the situation."
        },
        {
            "definition": "A loud, clear sound made by or resembling that of a trumpet.",
            "pos": "noun",
            "sent1": "The trumpet of an elephant echoed through the jungle.",
            "sent2": "The alarm clock's trumpet woke him up abruptly.",
            "sent3": "The trumpet of the swan startled the nearby ducks.",
            "sent4": "The trumpet of the train signaled its departure from the station.",
            "sent5": "The trumpet of the thunderstorm warned of an approaching downpour."
        },
        {
            "definition": "To play a trumpet.",
            "pos": "verb",
            "sent1": "He will trumpet a tune at the school talent show.",
            "sent2": "She practiced every day to trumpet perfectly in the orchestra.",
            "sent3": "The little boy tried to trumpet along with the radio.",
            "sent4": "The musician's fingers moved swiftly to trumpet the melody.",
            "sent5": "She could trumpet beautifully, captivating the audience with her music."
        }
    ]
}