{
    "term": "trumps",
    "meanings": [
        {
            "definition": "To excel or surpass",
            "pos": "verb",
            "sent1": "In the race, Sarah trumps all her friends with her speed.",
            "sent2": "Hard work trumps talent when it comes to success.",
            "sent3": "Tom's ability to run trumps his fear of losing.",
            "sent4": "The sun trumps the moon in brightness.",
            "sent5": "Practice trumps natural ability in the long run."
        },
        {
            "definition": "A valuable resource or advantage",
            "pos": "noun",
            "sent1": "Having a positive attitude is a real trumps in life.",
            "sent2": "Education is often seen as a trumps for a better future.",
            "sent3": "His sense of humor is his biggest trumps in making friends.",
            "sent4": "Kindness is a trumps that can open many doors.",
            "sent5": "Time management is a trumps in achieving success."
        },
        {
            "definition": "A playing card of a suit that outranks all others",
            "pos": "noun",
            "sent1": "In the game, the ace of spades trumps all other cards.",
            "sent2": "Remember, a trump can change the course of the game.",
            "sent3": "She played her trump card at just the right moment.",
            "sent4": "The king of hearts is a powerful trump in this round.",
            "sent5": "Knowing when to play your trump is key to winning."
        },
        {
            "definition": "To produce a sound by expelling air through pursed lips",
            "pos": "verb",
            "sent1": "He trumps to call his dog over.",
            "sent2": "The children love to trump to make funny noises.",
            "sent3": "The comedian tried to trump for a comedic effect.",
            "sent4": "She can trump like a trumpet player with her mouth.",
            "sent5": "When excited, he tends to trump instead of speaking."
        }
    ]
}