{
    "term": "trunk",
    "meanings": [
        {
            "definition": "The main stem of a tree.",
            "pos": "noun",
            "sent1": "The trunk of the tree was thick and sturdy.",
            "sent2": "The squirrel climbed up the trunk of the oak tree.",
            "sent3": "The trunk of the tree swayed gently in the breeze.",
            "sent4": "The trunk of the tree stood tall like a pillar in the forest.",
            "sent5": "The trunk of the tree was covered in rough bark."
        },
        {
            "definition": "A large suitcase or box for storing clothes and personal belongings.",
            "pos": "noun",
            "sent1": "She packed all her clothes in the trunk for the trip.",
            "sent2": "The trunk in the attic was filled with old photo albums.",
            "sent3": "The trunk in the bedroom was overflowing with toys.",
            "sent4": "The trunk served as a treasure chest for the pirate party.",
            "sent5": "The trunk was heavy with all the winter clothes."
        },
        {
            "definition": "The elongated, muscular proboscis of an elephant.",
            "pos": "noun",
            "sent1": "The elephant used its trunk to pick up the peanuts.",
            "sent2": "The baby elephant played with its trunk in the water.",
            "sent3": "The trunk of the elephant sprayed water all around.",
            "sent4": "The trunk of the elephant curled up like a spiral.",
            "sent5": "The trunk of the elephant was surprisingly dexterous."
        },
        {
            "definition": "The main part of a person's body, not including the head, arms, or legs.",
            "pos": "noun",
            "sent1": "He placed his hands on his trunk and took a deep breath.",
            "sent2": "The dancer moved gracefully, swaying her trunk to the music.",
            "sent3": "The trunk of the body held the beating heart inside.",
            "sent4": "The trunk of the body was covered in colorful tattoos.",
            "sent5": "The trunk of the body was strong and well-defined."
        }
    ]
}