{
    "term": "trunks",
    "meanings": [
        {
            "definition": "The main stem of a tree.",
            "pos": "noun",
            "sent1": "The trunks of the trees in the forest were tall and sturdy.",
            "sent2": "The squirrel climbed up the trunk of the tree to reach its nest.",
            "sent3": "The trunks of the trees danced in the wind, swaying gracefully.",
            "sent4": "The trunk of the tree stood like a giant pillar in the middle of the clearing.",
            "sent5": "The thick trunk of the oak tree was a sight to behold, showing its age and strength."
        },
        {
            "definition": "A large, strong box used for storing clothes or other items.",
            "pos": "noun",
            "sent1": "She packed her winter clothes in the old trunk in the attic.",
            "sent2": "The antique trunk in the living room held many family heirlooms.",
            "sent3": "The trunk in the bedroom was so full of clothes, it refused to close.",
            "sent4": "The trunk served as a treasure chest, holding precious memories within.",
            "sent5": "The heavy trunk was carried carefully down the stairs, filled with books and toys."
        },
        {
            "definition": "The elongated, flexible snout of an elephant.",
            "pos": "noun",
            "sent1": "The elephant used its trunk to pick up a peanut from the ground.",
            "sent2": "The baby elephant playfully sprayed water with its trunk.",
            "sent3": "The elephant's trunk wiggled comically as it tried to reach a high branch.",
            "sent4": "The trunk of the elephant was a versatile tool, helping it in various tasks.",
            "sent5": "The long trunk of the elephant swung gracefully as it walked through the savanna."
        },
        {
            "definition": "The main part of the human body, not including the head, arms, or legs.",
            "pos": "noun",
            "sent1": "He placed the heavy box on the trunk of his body and carried it upstairs.",
            "sent2": "The weightlifter focused on strengthening his trunk for better balance.",
            "sent3": "The trunk of his body felt sore after a day of heavy lifting.",
            "sent4": "The trunk of his body supported him as he stood tall and proud.",
            "sent5": "The trunk of his body was covered in tattoos, each telling a different story."
        }
    ]
}