{
    "term": "trundling",
    "meanings": [
        {
            "definition": "To roll or move heavily or noisily",
            "pos": "verb",
            "sent1": "The large truck was trundling down the road, making a loud noise.",
            "sent2": "The barrel trundled down the hill with a thud.",
            "sent3": "The elephant was trundling through the jungle, causing a commotion.",
            "sent4": "The storm clouds trundled ominously across the sky.",
            "sent5": "The boulder trundled down the mountain, shaking the ground."
        },
        {
            "definition": "To move slowly and heavily",
            "pos": "verb",
            "sent1": "The tired old dog was trundling along the path, taking its time.",
            "sent2": "The snail trundled across the garden at a leisurely pace.",
            "sent3": "The sloth was trundling through the trees, not in a hurry at all.",
            "sent4": "The glacier trundled down the valley, unstoppable in its slow progress.",
            "sent5": "The caterpillar trundled along the branch, inching its way forward."
        },
        {
            "definition": "To push or pull a wheeled object",
            "pos": "verb",
            "sent1": "She was trundling the shopping cart through the aisles of the store.",
            "sent2": "The children trundled their toy cars around the room.",
            "sent3": "He trundled the wheelbarrow full of dirt across the yard.",
            "sent4": "The porter trundled the luggage trolley through the busy airport.",
            "sent5": "The farmer trundled the tractor into the barn after a long day's work."
        },
        {
            "definition": "To roll along on wheels",
            "pos": "verb",
            "sent1": "The skateboard was trundling down the ramp at the skate park.",
            "sent2": "The office chair trundled across the room as he pushed off the desk.",
            "sent3": "The car was trundling along the highway, heading towards the city.",
            "sent4": "The train trundled through the countryside, passing fields and forests.",
            "sent5": "The wheelchair trundled smoothly along the hospital corridor."
        }
    ]
}