{
    "term": "truss",
    "meanings": [
        {
            "definition": "A framework of beams or bars used to support a roof or bridge.",
            "pos": "noun",
            "sent1": "The truss held up the roof of the barn.",
            "sent2": "The construction workers installed the truss to support the bridge.",
            "sent3": "The mischievous squirrel ran along the truss, pretending to be a tightrope walker.",
            "sent4": "Her laughter echoed under the truss of the old wooden bridge.",
            "sent5": "The truss resembled a giant spider web, connecting the beams together."
        },
        {
            "definition": "A supportive device worn to reduce strain on an injured body part.",
            "pos": "noun",
            "sent1": "The athlete wore a truss on his knee after the injury.",
            "sent2": "She used a truss to support her back while lifting heavy boxes.",
            "sent3": "The truss made him feel like a superhero with a special power belt.",
            "sent4": "Her truss was like a loyal friend, always there to lend support.",
            "sent5": "The truss hugged her injured arm gently, providing comfort and stability."
        },
        {
            "definition": "To secure tightly with ropes or straps.",
            "pos": "verb",
            "sent1": "He needed to truss the luggage securely onto the roof of the car.",
            "sent2": "The chef decided to truss the chicken before roasting it.",
            "sent3": "The magician attempted to truss the audience's attention with his dazzling tricks.",
            "sent4": "Her words seemed to truss his heart, holding it captive with their sincerity.",
            "sent5": "The vines trussed the tree trunk, creating a natural work of art in the forest."
        },
        {
            "definition": "A bundle of straw or hay.",
            "pos": "noun",
            "sent1": "The farmer carried a truss of hay to feed the horses.",
            "sent2": "She used a truss of straw to create a scarecrow in the field.",
            "sent3": "The mischievous kids built a truss fort in the barn, hiding from their parents.",
            "sent4": "The truss of hay looked like a cozy nest for the farm animals.",
            "sent5": "The truss of straw rustled in the wind, creating a soothing sound in the countryside."
        }
    ]
}