{
    "term": "trustworthiness",
    "meanings": [
        {
            "definition": "The quality of being reliable or deserving of trust.",
            "pos": "noun",
            "sent1": "Her trustworthiness in keeping secrets made her a good friend.",
            "sent2": "The company's success was built on the trustworthiness of its products.",
            "sent3": "His trustworthiness in always returning borrowed items promptly earned him the nickname 'Mr. Reliable'.",
            "sent4": "The trustworthiness of the old lighthouse guided ships safely through the stormy night.",
            "sent5": "The trustworthiness of the lock ensured the safety of the valuable documents inside."
        },
        {
            "definition": "The ability to be trusted or relied upon.",
            "pos": "noun",
            "sent1": "The dog's trustworthiness in guarding the house was unmatched.",
            "sent2": "In times of crisis, people look for leaders with trustworthiness to guide them.",
            "sent3": "The trustworthiness of the weather forecast was questioned when it predicted sunshine but it rained all day.",
            "sent4": "Her trustworthiness in always being on time made her the perfect candidate for the job.",
            "sent5": "The trustworthiness of the bridge held strong even during the heavy traffic hours."
        },
        {
            "definition": "The trait of being honest and dependable.",
            "pos": "noun",
            "sent1": "His trustworthiness in telling the truth even when it was hard earned him respect.",
            "sent2": "The teacher's trustworthiness in grading fairly was appreciated by all students.",
            "sent3": "The trustworthiness of the clock was put to the test when it stopped working during the exam.",
            "sent4": "The trustworthiness of the compass was crucial for the hikers to find their way back.",
            "sent5": "The trustworthiness of the mechanic was evident in the way he fixed the car without overcharging."
        }
    ]
}