{
    "term": "tsubos",
    "meanings": [
        {
            "definition": "A unit of measurement in Japanese acupuncture, equivalent to approximately one inch.",
            "pos": "noun",
            "sent1": "During the acupuncture session, the therapist targeted specific tsubos on my body.",
            "sent2": "The acupuncturist measured the distance between two tsubos on my arm.",
            "sent3": "I joked that my tsubos were like tiny rulers on my skin, guiding the therapist's needles.",
            "sent4": "Her fingers found the tsubos like hidden treasures waiting to be discovered.",
            "sent5": "The tsubos felt like secret buttons that, when pressed, released tension throughout my body."
        },
        {
            "definition": "Plural form of tsubo, a traditional Japanese unit of area measurement.",
            "pos": "noun",
            "sent1": "The farmer's land was divided into several tsubos for cultivation.",
            "sent2": "She calculated the total area of the field by counting the tsubos.",
            "sent3": "The tsubos on the map looked like tiny puzzle pieces waiting to be assembled.",
            "sent4": "The tsubos of land stretched out like a patchwork quilt beneath the clear sky.",
            "sent5": "Each tsubos of the garden held a different surprise, from flowers to vegetables."
        },
        {
            "definition": "A type of pressure point on the body used in traditional Chinese medicine.",
            "pos": "noun",
            "sent1": "The therapist applied gentle pressure to the tsubos to release tension.",
            "sent2": "He massaged the tsubos along my back to improve circulation.",
            "sent3": "I imagined my tsubos as tiny buttons that controlled my body's energy flow.",
            "sent4": "The tsubos felt like small wells of energy waiting to be tapped into.",
            "sent5": "With each touch on the tsubos, I felt a wave of relaxation spreading through my body."
        }
    ]
}