{
    "term": "tuberculin",
    "meanings": [
        {
            "definition": "A protein extract from the tuberculosis bacterium used in skin tests for tuberculosis infection.",
            "pos": "noun",
            "sent1": "The doctor injected tuberculin into my skin to check for tuberculosis.",
            "sent2": "The nurse administered the tuberculin test to determine if I had tuberculosis.",
            "sent3": "I joked that the tuberculin injection made me feel like a human pincushion.",
            "sent4": "The tuberculin test was like a detective searching for clues in my body.",
            "sent5": "The tuberculin reaction on my skin was like a tiny alarm going off."
        },
        {
            "definition": "A purified protein derivative used in diagnosing tuberculosis.",
            "pos": "noun",
            "sent1": "The hospital used tuberculin to help diagnose my tuberculosis.",
            "sent2": "Doctors rely on tuberculin to accurately detect tuberculosis infections.",
            "sent3": "I pretended the tuberculin vial was a magical potion for curing diseases.",
            "sent4": "The tuberculin solution acted like a spotlight revealing the presence of tuberculosis.",
            "sent5": "The tuberculin test felt like a secret agent uncovering hidden threats in my body."
        },
        {
            "definition": "A substance derived from the tuberculosis bacterium used in testing for tuberculosis infection.",
            "pos": "noun",
            "sent1": "The lab technician analyzed the tuberculin sample to detect tuberculosis.",
            "sent2": "Tuberculin is a crucial substance in the diagnosis of tuberculosis.",
            "sent3": "I imagined the tuberculin as a superhero fighting off tuberculosis villains.",
            "sent4": "The tuberculin solution worked like a detective searching for clues of tuberculosis.",
            "sent5": "The tuberculin test painted a clear picture of the tuberculosis infection in my body."
        }
    ]
}