{
    "term": "tuck",
    "meanings": [
        {
            "definition": "To push, fold, or turn the edges or ends of something, especially fabric, in order to hide them or make them neat.",
            "pos": "verb",
            "sent1": "She carefully tucked the loose end of the tablecloth under the plate.",
            "sent2": "Mom always tucks me in with a warm blanket at bedtime.",
            "sent3": "The mischievous kitten tried to tuck the toy mouse under the rug as a surprise.",
            "sent4": "The old book seemed to tuck secrets within its worn pages.",
            "sent5": "The gardener would tuck the flower bulbs gently into the soil, ensuring their safety."
        },
        {
            "definition": "A small, quick, and often secret action.",
            "pos": "noun",
            "sent1": "With a quick tuck, he slipped the note into her bag unnoticed.",
            "sent2": "The spy's success relied on the careful execution of each tuck.",
            "sent3": "The magician's final trick involved a mysterious tuck behind his back.",
            "sent4": "Her smile held a hidden tuck of mischief.",
            "sent5": "The squirrel's tuck of the acorn in its cheek was swift and sly."
        },
        {
            "definition": "To put something into a small space or opening.",
            "pos": "verb",
            "sent1": "He decided to tuck his phone into the side pocket of his backpack.",
            "sent2": "The squirrel would tuck away nuts for the winter in various hiding spots.",
            "sent3": "The child tried to tuck the oversized toy into the tiny box, but it wouldn't fit.",
            "sent4": "The explorer would tuck the map securely into his pocket before venturing into the unknown.",
            "sent5": "She would carefully tuck the precious necklace into the velvet pouch for safekeeping."
        },
        {
            "definition": "A small fold or pleat in fabric or clothing.",
            "pos": "noun",
            "sent1": "The dress had a delicate tuck at the waist that added a touch of elegance.",
            "sent2": "The tailor skillfully added a tuck to the hem of the skirt for a perfect fit.",
            "sent3": "The origami artist created a beautiful crane with intricate tucks and folds.",
            "sent4": "The napkin was folded with a neat tuck at the center for a fancy dinner setting.",
            "sent5": "The seamstress added a hidden tuck to the dress to give it a unique flair."
        }
    ]
}