{
    "term": "tundish",
    "meanings": [
        {
            "definition": "A funnel-shaped metal container used in foundries to distribute molten metal.",
            "pos": "noun",
            "sent1": "The tundish poured the hot metal into the molds.",
            "sent2": "The foundry worker carefully held the tundish to control the flow of liquid metal.",
            "sent3": "The tundish felt like a magical metal waterfall spilling into the molds.",
            "sent4": "The tundish was a conductor of fiery rivers, shaping the future of solid objects.",
            "sent5": "The tundish gleamed in the dim light, a vessel of transformation from liquid to solid."
        },
        {
            "definition": "A device used in plumbing to regulate the flow of water.",
            "pos": "noun",
            "sent1": "The plumber adjusted the tundish to control the water flow in the pipes.",
            "sent2": "Make sure the tundish is properly installed to avoid leaks in the system.",
            "sent3": "The tundish seemed to dance as it directed the water in different directions.",
            "sent4": "In the plumbing system, the tundish was the gatekeeper of water movement.",
            "sent5": "The tundish hummed softly as it managed the liquid's journey through the pipes."
        },
        {
            "definition": "A small metal container used in jewelry making to pour molten metal.",
            "pos": "noun",
            "sent1": "The jeweler delicately poured the molten gold from the tundish into the mold.",
            "sent2": "The tundish allowed for precise pouring of the liquid metal into intricate designs.",
            "sent3": "The tundish in the jewelry workshop sparkled like a tiny metal teapot.",
            "sent4": "With the tundish in hand, the jeweler wielded the power to shape precious metals.",
            "sent5": "The tundish was the bridge between liquid metal and beautiful jewelry creations."
        }
    ]
}