{
    "term": "turbinated",
    "meanings": [
        {
            "definition": "Having a spiral or twisted shape.",
            "pos": "adjective",
            "sent1": "The seashell had a turbinated structure, spiraling gracefully outward.",
            "sent2": "The staircase had a turbinated design, twisting elegantly from floor to floor.",
            "sent3": "The turbinated pattern on the rug made it look like a swirling whirlpool.",
            "sent4": "Her turbinated hairdo resembled a coiled spring ready to bounce.",
            "sent5": "The turbinated clouds in the sky seemed to dance in a mesmerizing spiral."
        },
        {
            "definition": "Having or resembling a turban.",
            "pos": "adjective",
            "sent1": "The statue wore a turbinated headdress, adding an exotic touch.",
            "sent2": "The painting depicted a turbinated figure, symbolizing cultural diversity.",
            "sent3": "The cat's fur formed a turbinated shape on its head, looking regal and majestic.",
            "sent4": "The tree's turbinated crown swayed gently in the breeze, like a royal turban.",
            "sent5": "The chef's turbinated hat added flair to his uniform, making him stand out in the kitchen."
        },
        {
            "definition": "Having bony plates or ridges that project into the nasal cavity.",
            "pos": "adjective",
            "sent1": "The doctor explained the turbinated bones in the nose help filter the air we breathe.",
            "sent2": "The turbinated structures in the nasal cavity play a crucial role in respiratory function.",
            "sent3": "The turbinated ridges in the nose acted like tiny air purifiers, cleaning the inhaled air.",
            "sent4": "The turbinated projections in the nasal passage resembled tiny shields protecting the respiratory system.",
            "sent5": "The turbinated bony plates in the nose felt sensitive to touch, like tiny fingers inside the nostrils."
        }
    ]
}