{
    "term": "turbidite",
    "meanings": [
        {
            "definition": "A sedimentary rock composed of alternating layers of sand and mud deposited by underwater landslides.",
            "pos": "noun",
            "sent1": "The geologist studied the turbidite to learn about ancient underwater landslides.",
            "sent2": "The museum displayed a beautiful turbidite specimen found deep in the ocean.",
            "sent3": "The turbidite in the exhibit seemed to whisper tales of long-forgotten underwater adventures.",
            "sent4": "The layers of the turbidite were like pages in a book, telling the story of the ocean's history.",
            "sent5": "As the diver examined the turbidite, he felt a connection to the ancient underwater world."
        },
        {
            "definition": "To deposit sediment in a submarine fan or deep-sea basin.",
            "pos": "verb",
            "sent1": "The river turbidites sediment into the deep-sea basin, creating new underwater landscapes.",
            "sent2": "Fishermen avoid areas where underwater landslides turbidite sediment, as it can be dangerous.",
            "sent3": "The kids joked that if they kept spilling sand, they would turbidite their own mini underwater world.",
            "sent4": "The storm turbidited debris into the ocean, changing the underwater scenery dramatically.",
            "sent5": "The construction site accidentally turbidited soil into the nearby river, causing environmental concerns."
        },
        {
            "definition": "Characterized by a chaotic mixture of sediment particles suspended in water.",
            "pos": "adjective",
            "sent1": "The turbidite water in the river looked muddy and unclear after the heavy rain.",
            "sent2": "The underwater landslide created a turbidite cloud that obscured the diver's vision.",
            "sent3": "The kids laughed as they stirred up the sand, creating a turbidite mess in the water.",
            "sent4": "Her thoughts were like turbidite waters, swirling with confusion and uncertainty.",
            "sent5": "The turbulent river carried a turbidite load of sediment, making it difficult to see the bottom."
        }
    ]
}