{
    "term": "turbidites",
    "meanings": [
        {
            "definition": "Sedimentary rocks formed by the deposition of sediment carried by turbidity currents.",
            "pos": "noun",
            "sent1": "The turbidites in this area show layers of different sediments.",
            "sent2": "Geologists study turbidites to understand ancient underwater landslides.",
            "sent3": "The turbidites looked like a delicious layered cake made of sand and mud.",
            "sent4": "The turbidites were like a history book, each layer telling a different story.",
            "sent5": "The turbidites resembled a colorful stack of blankets, each representing a different time period."
        },
        {
            "definition": "The process of sedimentation by turbidity currents.",
            "pos": "noun",
            "sent1": "Turbidites form when underwater currents carry sediment and deposit it.",
            "sent2": "The study of turbidites helps scientists understand how underwater avalanches shape the seabed.",
            "sent3": "Watching the turbidites settle was like observing a slow-motion dance of sand and mud.",
            "sent4": "The turbidites flowing down the underwater slope were like a river of sediment.",
            "sent5": "The turbidites cascading down the underwater hill created a mesmerizing natural spectacle."
        },
        {
            "definition": "A type of sedimentary deposit characterized by graded bedding.",
            "pos": "noun",
            "sent1": "The turbidites displayed clear layers of sediment with different sizes.",
            "sent2": "Geologists use turbidites to identify past underwater flow patterns.",
            "sent3": "The turbidites with their neat layers looked like a perfectly organized filing cabinet.",
            "sent4": "The turbidites with their distinct layers resembled a colorful sandwich of sand and mud.",
            "sent5": "The turbidites with their graded bedding were like a geological staircase leading back in time."
        }
    ]
}