{
    "term": "turning",
    "meanings": [
        {
            "definition": "The act of changing direction or position",
            "pos": "noun",
            "sent1": "After making a wrong turn, the driver made a quick turning to get back on track.",
            "sent2": "The dancer's graceful turning on stage captivated the audience.",
            "sent3": "The confused cat kept turning in circles chasing its own tail.",
            "sent4": "The turning of the seasons brings about colorful changes in nature.",
            "sent5": "The turning of the compass needle pointed north."
        },
        {
            "definition": "The act of rotating or revolving",
            "pos": "noun",
            "sent1": "The slow turning of the windmill generated electricity for the village.",
            "sent2": "The turning of the Earth on its axis causes day and night.",
            "sent3": "The lazy Susan kept turning, making it hard to reach the food.",
            "sent4": "The turning of the wheel created a mesmerizing pattern in the sand.",
            "sent5": "The turning of the key unlocked the mysterious chest."
        },
        {
            "definition": "The act of shaping or forming on a lathe",
            "pos": "noun",
            "sent1": "The craftsman's precise turning of the wood created a beautiful bowl.",
            "sent2": "The turning of the metal rod produced a perfectly cylindrical shape.",
            "sent3": "The turning of the lathe echoed through the workshop as the sculpture took form.",
            "sent4": "The turning of the potter's wheel transformed clay into a work of art.",
            "sent5": "The turning of the knob carved intricate designs on the wooden door."
        },
        {
            "definition": "The act of becoming sour or rancid",
            "pos": "noun",
            "sent1": "The milk's turning made it undrinkable and smelly.",
            "sent2": "The chef noticed the turning of the cream and discarded it immediately.",
            "sent3": "The fruit's turning attracted a swarm of fruit flies in the kitchen.",
            "sent4": "The bread's turning signaled it was time to throw it away.",
            "sent5": "The meat's turning indicated it was no longer safe to eat."
        }
    ]
}