{
    "term": "turnery",
    "meanings": [
        {
            "definition": "The practice or occupation of turning wood on a lathe to create objects.",
            "pos": "noun",
            "sent1": "In the turnery, skilled craftsmen use lathes to shape beautiful wooden pieces.",
            "sent2": "The turnery down the street sells handcrafted bowls and vases.",
            "sent3": "The turnery worker accidentally turned a square block of wood into a round peg!",
            "sent4": "Her hands moved swiftly over the lathe, transforming the wood in the turnery into art.",
            "sent5": "The scent of fresh wood shavings filled the turnery, inspiring creativity."
        },
        {
            "definition": "A workshop or factory where wood is turned on a lathe.",
            "pos": "noun",
            "sent1": "I visited the turnery to watch how they make wooden furniture.",
            "sent2": "The turnery's machines hummed as they shaped the raw wood into elegant designs.",
            "sent3": "At the turnery, the workers joked that the lathe had a mind of its own.",
            "sent4": "The turnery was a whirl of activity, with wood pieces spinning into new forms.",
            "sent5": "Visiting the turnery felt like stepping into a magical world of woodworking."
        },
        {
            "definition": "The process of shaping wood by turning it on a lathe.",
            "pos": "noun",
            "sent1": "Watching the turnery in action, I learned how wood can be transformed with a lathe.",
            "sent2": "The turnery's precise movements turned the rough wood into smooth, curved shapes.",
            "sent3": "During the demonstration, the turnery instructor made shaping wood look like a dance.",
            "sent4": "The turnery's spinning lathe seemed to breathe life into the wooden blocks.",
            "sent5": "The turnery's rhythmic sounds echoed through the workshop, creating a mesmerizing atmosphere."
        }
    ]
}