{
    "term": "turn",
    "meanings": [
        {
            "definition": "To move or rotate around a central point.",
            "pos": "verb",
            "sent1": "I turn the key to start the car.",
            "sent2": "She likes to turn the pages of her favorite book.",
            "sent3": "Why did the chicken turn around in circles?",
            "sent4": "His words made her emotions turn like a whirlwind.",
            "sent5": "The merry-go-round makes children dizzy as they turn."
        },
        {
            "definition": "To change direction or course.",
            "pos": "verb",
            "sent1": "Please turn left at the next intersection.",
            "sent2": "The wind caused the weather vane to turn towards the east.",
            "sent3": "The cat tried to turn the corner but slipped on the wet floor.",
            "sent4": "Her mood can quickly turn from happy to sad.",
            "sent5": "The compass needle always points north, never turning south."
        },
        {
            "definition": "To cause to face or move in a different direction.",
            "pos": "verb",
            "sent1": "He gently turns the vase to show its intricate design.",
            "sent2": "The teacher asked the students to turn their attention to the board.",
            "sent3": "The magician made the rabbit turn into a hat!",
            "sent4": "The unexpected news turned their plans upside down.",
            "sent5": "The lighthouse helps ships safely turn away from the dangerous rocks."
        },
        {
            "definition": "A change in direction or course.",
            "pos": "noun",
            "sent1": "The sudden turn in the road surprised the driver.",
            "sent2": "The river took a sharp turn to the south.",
            "sent3": "The plot twist in the movie was an unexpected turn of events.",
            "sent4": "Life sometimes takes an unpredictable turn.",
            "sent5": "The roller coaster's sharp turn made everyone scream with excitement."
        },
        {
            "definition": "A chance or opportunity to do something.",
            "pos": "noun",
            "sent1": "It's your turn to play the game now.",
            "sent2": "She waited for her turn to speak during the meeting.",
            "sent3": "Winning the lottery was a lucky turn of fate.",
            "sent4": "Taking a different turn in life can lead to new adventures.",
            "sent5": "The job offer came at just the right turn in his career."
        }
    ]
}