{
    "term": "turners",
    "meanings": [
        {
            "definition": "A person who turns or shapes wood on a lathe.",
            "pos": "noun",
            "sent1": "The turners in the workshop create beautiful wooden bowls.",
            "sent2": "I bought a handmade bowl from the local turners.",
            "sent3": "The turners decided to have a competition to see who could make the tallest vase.",
            "sent4": "She was a turner of dreams, shaping them into reality with her hands.",
            "sent5": "The turners' craft requires precision and skill to transform blocks of wood into works of art."
        },
        {
            "definition": "A utensil used for turning food while cooking.",
            "pos": "noun",
            "sent1": "The chef used a turners to flip the pancakes.",
            "sent2": "I need to buy a new turners for the kitchen.",
            "sent3": "The turners slipped out of the chef's hand and landed in the soup.",
            "sent4": "The turners danced in the sizzling pan, flipping the vegetables with ease.",
            "sent5": "The shiny turners gleamed under the kitchen lights, ready for action."
        },
        {
            "definition": "A type of flat, round pastry tool.",
            "pos": "noun",
            "sent1": "The baker used a turners to cut out perfect circles of dough.",
            "sent2": "I borrowed a turners from my neighbor to make cookies.",
            "sent3": "The turners accidentally rolled off the counter and onto the floor.",
            "sent4": "The turners spun gracefully in the baker's skilled hands, creating uniform pastries.",
            "sent5": "The colorful turners added a fun touch to the baking process."
        },
        {
            "definition": "A surname.",
            "pos": "noun",
            "sent1": "The Turners family had a reunion every summer.",
            "sent2": "I met Mr. Turners at the community event.",
            "sent3": "The Turners siblings were known for their musical talents.",
            "sent4": "The Turners name echoed through generations, a legacy of strength and unity.",
            "sent5": "The Turners crest proudly displayed on their family coat of arms."
        }
    ]
}