{
    "term": "turntable",
    "meanings": [
        {
            "definition": "A circular revolving plate used for turning locomotives or cars around.",
            "pos": "noun",
            "sent1": "The turntable at the train station slowly rotated the locomotive for its return journey.",
            "sent2": "The workers manually pushed the locomotive onto the turntable to change its direction.",
            "sent3": "The turntable at the station was so slow that the locomotive conductor fell asleep waiting for it to turn.",
            "sent4": "The turntable spun the locomotive like a child's toy, changing its facing in an instant.",
            "sent5": "The massive turntable creaked and groaned as it shifted the heavy locomotive."
        },
        {
            "definition": "A rotating platform used for playing vinyl records.",
            "pos": "noun",
            "sent1": "My grandfather's turntable played all his favorite records from when he was young.",
            "sent2": "The DJ carefully placed the vinyl record on the turntable before starting the music.",
            "sent3": "The turntable seemed to dance as the needle glided over the vinyl, producing sweet melodies.",
            "sent4": "The turntable spun the record like a magical disk, filling the room with music.",
            "sent5": "The vintage turntable added a nostalgic touch to the room with its warm sound."
        },
        {
            "definition": "A rotating platform used for displaying objects or models.",
            "pos": "noun",
            "sent1": "The museum's turntable slowly rotated the ancient artifact for visitors to admire from all angles.",
            "sent2": "The model cars were elegantly showcased on the turntable, rotating to catch the light.",
            "sent3": "The turntable displayed the miniature city models in a mesmerizing carousel of tiny buildings.",
            "sent4": "The turntable spun the model ship gracefully, showcasing its intricate details.",
            "sent5": "The turntable made the model airplane look like it was soaring through the air."
        }
    ]
}