{
    "term": "turrical",
    "meanings": [
        {
            "definition": "Turrical (adjective): relating to or characteristic of a turret",
            "pos": "adjective",
            "sent1": "The castle had a turrical design with small towers on each corner.",
            "sent2": "The turrical decorations on the building added a medieval touch.",
            "sent3": "The turrical style of the architecture made it look like a fairy tale castle.",
            "sent4": "Her imagination soared as she envisioned a turrical kingdom in the clouds.",
            "sent5": "The turrical features of the fortress stood out against the modern skyline."
        },
        {
            "definition": "Turrical (noun): a small tower on a building, typically part of a castle",
            "pos": "noun",
            "sent1": "The ancient castle had several turricals that offered panoramic views of the countryside.",
            "sent2": "The turrical stood tall against the blue sky, a symbol of strength and history.",
            "sent3": "The birds nested in the turrical, creating a cozy home high above the ground.",
            "sent4": "The turrical loomed over the landscape like a guardian watching over the land.",
            "sent5": "Visitors marveled at the intricate details of the turrical, marveling at its craftsmanship."
        },
        {
            "definition": "Turrical (verb): to equip or furnish with turrets",
            "pos": "verb",
            "sent1": "The builders worked tirelessly to turrical the fortress before the grand opening.",
            "sent2": "They decided to turrical the walls for added protection against invaders.",
            "sent3": "The children played pretend, pretending to turrical their cardboard fort with imaginary turrets.",
            "sent4": "The architect's plan was to turrical the entire structure, creating a formidable stronghold.",
            "sent5": "The king ordered his army to turrical the castle walls in preparation for the upcoming battle."
        }
    ]
}