{
    "term": "tutoring",
    "meanings": [
        {
            "definition": "The act of instructing or teaching someone in a particular subject.",
            "pos": "noun",
            "sent1": "My sister offers tutoring in math to help students understand the concepts better.",
            "sent2": "I signed up for tutoring in English to improve my grammar skills.",
            "sent3": "The tutoring session on history turned into a fun storytelling time.",
            "sent4": "Her tutoring was like a guiding light through the complex world of science.",
            "sent5": "The tutoring session felt like a journey of discovery and learning."
        },
        {
            "definition": "The practice of providing academic support and guidance to students.",
            "pos": "noun",
            "sent1": "The school offers tutoring to help struggling students catch up with their peers.",
            "sent2": "She excels in tutoring, always finding creative ways to explain difficult concepts.",
            "sent3": "During the tutoring session, the student suddenly became the teacher, explaining a concept to the tutor.",
            "sent4": "The tutoring program acted as a safety net for students navigating challenging subjects.",
            "sent5": "The tutoring service was like a compass guiding students towards academic success."
        },
        {
            "definition": "The process of helping someone improve their skills or knowledge in a specific area.",
            "pos": "noun",
            "sent1": "His tutoring in coding helped me become more proficient in programming.",
            "sent2": "The tutoring center offers support in various subjects to enhance students' learning.",
            "sent3": "The tutoring session on painting turned into a colorful adventure.",
            "sent4": "Her tutoring was a key that unlocked my potential in mathematics.",
            "sent5": "The tutoring experience was a transformative journey towards mastery."
        }
    ]
}