{
    "term": "tweener",
    "meanings": [
        {
            "definition": "A person or thing that is between two extremes or categories.",
            "pos": "noun",
            "sent1": "The tweener in the group couldn't decide if he preferred sweet or salty snacks.",
            "sent2": "She was a tweener when it came to fashion, not fully embracing either casual or formal styles.",
            "sent3": "The tweener at the party couldn't choose between dancing or chatting with friends.",
            "sent4": "Being a tweener in the debate, he struggled to pick a side on the controversial topic.",
            "sent5": "The character in the story was a tweener, torn between loyalty to family and following his dreams."
        },
        {
            "definition": "A shot in tennis that is hit with a medium pace and trajectory, typically used to catch opponents off guard.",
            "pos": "noun",
            "sent1": "The player surprised his opponent with a well-executed tweener shot.",
            "sent2": "She practiced her tweener shots to add variety to her tennis game.",
            "sent3": "The tweener shot caught everyone off guard, including the referee!",
            "sent4": "His tweener shot sailed over the net like a stealthy ninja.",
            "sent5": "The tweener shot was the highlight of the match, leaving the crowd in awe."
        },
        {
            "definition": "A player in basketball who is too small to play as a forward but too slow to play as a guard.",
            "pos": "noun",
            "sent1": "The coach decided to put him in as a tweener to add versatility to the team's lineup.",
            "sent2": "She trained hard to improve her skills and transition from a tweener to a guard.",
            "sent3": "The tweener on the court struggled to keep up with the faster guards.",
            "sent4": "His performance as a tweener was like a puzzle piece fitting perfectly into the team's strategy.",
            "sent5": "The tweener's determination to excel in basketball was truly inspiring to his teammates."
        }
    ]
}