{
    "term": "twisting",
    "meanings": [
        {
            "definition": "To turn or rotate something in a circular motion.",
            "pos": "verb",
            "sent1": "She was twisting the lid off the jar.",
            "sent2": "The dancer was twisting gracefully on stage.",
            "sent3": "The cat was twisting its body to catch its tail.",
            "sent4": "The river was twisting through the valley like a serpent.",
            "sent5": "His hands were twisting the rope into a knot."
        },
        {
            "definition": "To distort or change the shape of something.",
            "pos": "verb",
            "sent1": "He was twisting the wire into a strange shape.",
            "sent2": "The artist was twisting the clay into a beautiful sculpture.",
            "sent3": "The wind was twisting the tree branches into odd shapes.",
            "sent4": "The heat was twisting the metal beams out of alignment.",
            "sent5": "She was twisting the balloon into a funny animal shape."
        },
        {
            "definition": "To move in a winding or spiral course.",
            "pos": "verb",
            "sent1": "The road was twisting through the mountains.",
            "sent2": "The snake was twisting around the tree trunk.",
            "sent3": "The river was twisting and turning like a rollercoaster.",
            "sent4": "The vines were twisting up the trellis in the garden.",
            "sent5": "The tornado was twisting violently across the plains."
        },
        {
            "definition": "To change direction suddenly or sharply.",
            "pos": "verb",
            "sent1": "The car was twisting around the corner at high speed.",
            "sent2": "The wind was twisting the umbrella inside out.",
            "sent3": "The plot of the movie was twisting unexpectedly.",
            "sent4": "His words were twisting the conversation in a new direction.",
            "sent5": "The sudden gust of wind was twisting the kite in the sky."
        }
    ]
}