{
    "term": "twist",
    "meanings": [
        {
            "definition": "To turn or rotate around a central point.",
            "pos": "verb",
            "sent1": "She tried to twist the lid off the jar.",
            "sent2": "He likes to twist the handlebars while riding his bike.",
            "sent3": "The magician will twist the rope into a knot and then make it disappear!",
            "sent4": "The dancer's movements twist and twirl gracefully on stage.",
            "sent5": "The wind caused the tree branches to twist and sway in the storm."
        },
        {
            "definition": "A bend or curve in a shape or object.",
            "pos": "noun",
            "sent1": "The pretzel had a unique twist in its shape.",
            "sent2": "The road took a sharp twist around the mountain.",
            "sent3": "The twist in the wire made it difficult to unravel.",
            "sent4": "The twist in the river created a beautiful meander.",
            "sent5": "The twist in the plot of the movie kept the audience guessing."
        },
        {
            "definition": "To distort or change the meaning of something.",
            "pos": "verb",
            "sent1": "He tried to twist her words to make himself look better.",
            "sent2": "The tabloid twisted the truth to sell more copies.",
            "sent3": "The comedian likes to twist jokes to make them funnier.",
            "sent4": "The politician's speech twisted the facts to suit his agenda.",
            "sent5": "The artist's interpretation of the painting twisted its original meaning."
        },
        {
            "definition": "A surprising or unexpected development in a story or situation.",
            "pos": "noun",
            "sent1": "The movie had a shocking twist at the end.",
            "sent2": "The plot twist in the book caught everyone off guard.",
            "sent3": "The twist in the tale made the story more interesting.",
            "sent4": "The unexpected twist in the game changed the outcome completely.",
            "sent5": "The twist in the mystery novel revealed the true culprit."
        }
    ]
}