{
    "term": "twists",
    "meanings": [
        {
            "definition": "To turn or rotate around a central point.",
            "pos": "verb",
            "sent1": "She twists the lid off the jar.",
            "sent2": "He twists the key in the lock to open the door.",
            "sent3": "The magician twists the rope into a knot and then magically untwists it.",
            "sent4": "The tornado twists through the town, leaving destruction in its wake.",
            "sent5": "The dancer twists and twirls gracefully on stage."
        },
        {
            "definition": "A bend or curve in a road or path.",
            "pos": "noun",
            "sent1": "The road takes a sharp twist to the left.",
            "sent2": "The hiking trail has many twists and turns through the forest.",
            "sent3": "The twist in the river caused the water to flow in a circular motion.",
            "sent4": "The twist in the plot of the movie took the audience by surprise.",
            "sent5": "The twist in the road led them to a beautiful hidden waterfall."
        },
        {
            "definition": "To distort or change the meaning of something.",
            "pos": "verb",
            "sent1": "He twists the truth to make himself look better.",
            "sent2": "The tabloid twists the facts to create sensational headlines.",
            "sent3": "The comedian twists the punchline of the joke for a funnier effect.",
            "sent4": "The politician twists the statistics to support their argument.",
            "sent5": "The artist twists reality in their abstract paintings."
        },
        {
            "definition": "A sudden change in a story or plot.",
            "pos": "noun",
            "sent1": "The movie had a surprising twist at the end.",
            "sent2": "The novel's plot had many unexpected twists and turns.",
            "sent3": "The twist in the fairy tale made it more interesting for the children.",
            "sent4": "The twist in the mystery novel revealed the true culprit.",
            "sent5": "The twist in the play kept the audience on the edge of their seats."
        },
        {
            "definition": "To intertwine or interlace.",
            "pos": "verb",
            "sent1": "She twists the strands of hair into a braid.",
            "sent2": "The vines twist around the tree trunk in a spiral pattern.",
            "sent3": "The branches of the trees twist together to form a natural archway.",
            "sent4": "The snake twists its body around the branch to climb higher.",
            "sent5": "The ivy twists and climbs up the side of the building."
        }
    ]
}