{
    "term": "typhoids",
    "meanings": [
        {
            "definition": "An infectious bacterial disease causing high fever, headache, and intestinal inflammation.",
            "pos": "noun",
            "sent1": "The doctor diagnosed the patient with typhoids after running some tests.",
            "sent2": "Typhoids can be a serious illness if not treated promptly.",
            "sent3": "The typhoids decided to throw a party in the intestines, causing quite a commotion.",
            "sent4": "The typhoids invaded the body like an army, causing chaos and fever.",
            "sent5": "The image of typhoids attacking the intestines stuck in my mind like a scary movie scene."
        },
        {
            "definition": "A person suffering from typhoid fever.",
            "pos": "noun",
            "sent1": "The hospital admitted several typhoids for treatment.",
            "sent2": "The typhoids in the ward were receiving proper care from the medical staff.",
            "sent3": "The group of typhoids decided to start a support group for others like them.",
            "sent4": "She felt like a lone typhoids in a sea of healthy people.",
            "sent5": "The typhoids shared stories of their feverish experiences, finding comfort in each other's company."
        },
        {
            "definition": "A strain of bacteria causing typhoid fever.",
            "pos": "noun",
            "sent1": "Scientists identified a new strain of typhoids in the contaminated water sample.",
            "sent2": "The typhoids strain was found to be resistant to common antibiotics.",
            "sent3": "The mischievous typhoids strain played hide and seek with the researchers in the lab.",
            "sent4": "The typhoids strain spread through the population like wildfire, causing concern among health officials.",
            "sent5": "The discovery of the deadly typhoids strain sent shockwaves through the medical community."
        }
    ]
}