{
    "term": "typhuses",
    "meanings": [
        {
            "definition": "A group of infectious diseases caused by bacteria or viruses.",
            "pos": "noun",
            "sent1": "The doctor studied different typhuses to understand how they spread.",
            "sent2": "In history, typhuses have caused widespread illness and death.",
            "sent3": "The party theme was 'Bacteria Bash,' where guests dressed up as different typhuses.",
            "sent4": "The city was overrun by a typhus of illnesses, spreading rapidly through the population.",
            "sent5": "The image of typhuses crawling under a microscope was both fascinating and terrifying."
        },
        {
            "definition": "A severe fever with delirium, typically caused by infection with Salmonella typhi.",
            "pos": "noun",
            "sent1": "During the outbreak, many patients suffered from intense typhuses.",
            "sent2": "The doctor diagnosed the patient with typhuses after observing the symptoms.",
            "sent3": "The typhuses made the patient believe they were a famous movie star.",
            "sent4": "The fever burned like a wildfire, consuming the patient's body with typhuses.",
            "sent5": "The delirium caused by typhuses created a surreal experience for the patient."
        },
        {
            "definition": "Plural form of typhus.",
            "pos": "noun",
            "sent1": "The museum displayed various specimens of typhuses for educational purposes.",
            "sent2": "The doctor collected samples to study different typhuses under the microscope.",
            "sent3": "The classroom erupted into laughter when the teacher accidentally said 'typhuses' instead of 'typhus.'",
            "sent4": "The city was under siege by a swarm of typhuses, causing panic among the residents.",
            "sent5": "The plural form 'typhuses' echoed through the halls of the medical conference."
        }
    ]
}