{
    "term": "tyrannizing",
    "meanings": [
        {
            "definition": "To rule or govern as a tyrant.",
            "pos": "verb",
            "sent1": "The king was tyrannizing his subjects, making unfair laws and punishing anyone who disagreed.",
            "sent2": "The dictator was known for tyrannizing the people, suppressing their freedoms and enforcing strict regulations.",
            "sent3": "The evil queen in the story was always tyrannizing the villagers, demanding unreasonable taxes and harsh punishments.",
            "sent4": "The bully in the schoolyard was like a tyrant, constantly tyrannizing the other kids and making their lives miserable.",
            "sent5": "The tyrannizing boss made the workplace a hostile environment, ruling with an iron fist and showing no mercy to employees."
        },
        {
            "definition": "To exercise oppressive power or control over others.",
            "pos": "verb",
            "sent1": "The oppressive regime was constantly tyrannizing its citizens, monitoring their every move and silencing any dissent.",
            "sent2": "The corrupt officials were accused of tyrannizing the local community, abusing their authority for personal gain.",
            "sent3": "The strict teacher was always tyrannizing the students, giving them excessive homework and strict deadlines.",
            "sent4": "The dark cloud of fear was tyrannizing the small town, making everyone feel trapped and powerless.",
            "sent5": "The tyrannizing landlord raised the rent prices unfairly, forcing many tenants to struggle to make ends meet."
        },
        {
            "definition": "To act in a cruel or harsh manner towards others.",
            "pos": "verb",
            "sent1": "The mean-spirited supervisor was constantly tyrannizing his subordinates, belittling them and making unreasonable demands.",
            "sent2": "The bullies were tyrannizing the new kid at school, making fun of him and excluding him from activities.",
            "sent3": "The strict coach was always tyrannizing the players, pushing them to their limits and showing no mercy.",
            "sent4": "The storm was tyrannizing the small town, destroying homes and leaving the residents devastated.",
            "sent5": "The tyrannizing customer was rude to the waiter, demanding special treatment and insulting the service."
        }
    ]
}