{
    "term": "tyrannising",
    "meanings": [
        {
            "definition": "To rule or govern as a tyrant.",
            "pos": "verb",
            "sent1": "The king was tyrannising his subjects, making unfair laws and punishing anyone who disagreed.",
            "sent2": "The dictator was known for tyrannising the people, suppressing their freedoms and enforcing strict rules.",
            "sent3": "The teacher jokingly accused the class hamster of tyrannising the other pets in the classroom.",
            "sent4": "The storm was tyrannising the small town, causing destruction and chaos wherever it went.",
            "sent5": "The evil sorcerer was tyrannising the magical kingdom, spreading fear and darkness across the land."
        },
        {
            "definition": "To exercise oppressive power or control over others.",
            "pos": "verb",
            "sent1": "The bully was tyrannising the younger students, making them do his homework and giving them no choice.",
            "sent2": "The corrupt government was tyrannising its citizens, restricting their rights and monitoring their every move.",
            "sent3": "The mischievous kitten seemed to be tyrannising the household dog, always stealing its toys and treats.",
            "sent4": "The giant corporation was tyrannising the small businesses, driving them out of the market with unfair practices.",
            "sent5": "The dark cloud was tyrannising the sunny sky, casting a shadow over the entire city."
        },
        {
            "definition": "To act in a cruel or harsh manner towards others.",
            "pos": "verb",
            "sent1": "The mean boss was tyrannising his employees, constantly criticizing them and never appreciating their hard work.",
            "sent2": "The older sibling was tyrannising the younger ones, always teasing and picking on them without mercy.",
            "sent3": "The grumpy cat was tyrannising the friendly dog, swatting at it whenever it tried to play.",
            "sent4": "The relentless heatwave was tyrannising the farmers, drying up their crops and causing a severe drought.",
            "sent5": "The loud thunder was tyrannising the peaceful night, startling everyone awake with its powerful rumbling."
        }
    ]
}