{
    "term": "tyrannised",
    "meanings": [
        {
            "definition": "To rule or govern as a tyrant.",
            "pos": "verb",
            "sent1": "The king tyrannised over his subjects, making all the decisions without their input.",
            "sent2": "The dictator tyrannised the country, suppressing any form of dissent.",
            "sent3": "The cat tyrannised the mice in the barn, always stealing their cheese.",
            "sent4": "The storm tyrannised the coastline, destroying everything in its path.",
            "sent5": "The bully tyrannised the playground, intimidating the other kids with his size."
        },
        {
            "definition": "To oppress or treat harshly.",
            "pos": "verb",
            "sent1": "The landlord tyrannised the tenants by raising the rent every month.",
            "sent2": "The cruel teacher tyrannised the students, giving them impossible assignments.",
            "sent3": "The strict coach tyrannised the players, making them run extra laps for minor mistakes.",
            "sent4": "The relentless sun tyrannised the farmers, scorching their crops and drying up the fields.",
            "sent5": "The evil queen tyrannised her subjects, imposing heavy taxes and harsh punishments."
        },
        {
            "definition": "To exercise power in a cruel or arbitrary way.",
            "pos": "verb",
            "sent1": "The corrupt official tyrannised the town, taking bribes and abusing his authority.",
            "sent2": "The bully at school tyrannised the other students, making their lives miserable.",
            "sent3": "The strict traffic warden tyrannised the drivers, issuing tickets for minor infractions.",
            "sent4": "The ruthless warlord tyrannised the villagers, forcing them to provide him with food and supplies.",
            "sent5": "The strict manager tyrannised the employees, constantly monitoring their every move."
        }
    ]
}