{
    "term": "tyrannosaurids",
    "meanings": [
        {
            "definition": "A group of large carnivorous dinosaurs belonging to the family Tyrannosauridae.",
            "pos": "noun",
            "sent1": "The tyrannosaurids roamed the ancient lands.",
            "sent2": "Many museums display skeletons of tyrannosaurids.",
            "sent3": "The tyrannosaurids threw a birthday party for the T-Rex.",
            "sent4": "In the world of dinosaurs, the tyrannosaurids were the kings.",
            "sent5": "Children love learning about the fearsome tyrannosaurids."
        },
        {
            "definition": "The tyrannosaurids were known for their large size and powerful jaws.",
            "pos": "noun",
            "sent1": "Visitors gasped in awe at the massive tyrannosaurids.",
            "sent2": "Paleontologists study the teeth of tyrannosaurids to understand their diet.",
            "sent3": "The tyrannosaurids challenged each other to a jaw strength competition.",
            "sent4": "The power of the tyrannosaurids' jaws could crush bones effortlessly.",
            "sent5": "The museum exhibit showcased the impressive skulls of tyrannosaurids."
        },
        {
            "definition": "Scientists have discovered several species of tyrannosaurids in North America.",
            "pos": "noun",
            "sent1": "The discovery of new tyrannosaurids excites researchers.",
            "sent2": "North America was once home to diverse tyrannosaurids.",
            "sent3": "The tyrannosaurids in North America threw a parade for the new arrivals.",
            "sent4": "Exploring the fossils of tyrannosaurids reveals their unique features.",
            "sent5": "The hunt for more species of tyrannosaurids continues in the Badlands."
        },
        {
            "definition": "The tyrannosaurids lived during the Late Cretaceous period.",
            "pos": "noun",
            "sent1": "During the Late Cretaceous, the tyrannosaurids ruled the land.",
            "sent2": "The Late Cretaceous was a time of dominance for tyrannosaurids.",
            "sent3": "The tyrannosaurids in the Late Cretaceous threw a costume party.",
            "sent4": "In the Late Cretaceous, the tyrannosaurids were the ultimate predators.",
            "sent5": "Children enjoy imagining the world of tyrannosaurids in the Late Cretaceous."
        },
        {
            "definition": "Fossils of tyrannosaurids have provided valuable information about the behavior and anatomy of these dinosaurs.",
            "pos": "noun",
            "sent1": "Paleontologists carefully study the fossils of tyrannosaurids.",
            "sent2": "The behavior of tyrannosaurids can be inferred from fossil evidence.",
            "sent3": "The tyrannosaurids' fossils told stories of their daily lives.",
            "sent4": "Examining the anatomy of tyrannosaurids reveals their incredible adaptations.",
            "sent5": "The museum exhibit educates visitors on the discoveries from tyrannosaurids' fossils."
        }
    ]
}