{
    "term": "ultramontanism",
    "meanings": [
        {
            "definition": "Adherence to the authority of the Pope in matters of doctrine and discipline.",
            "pos": "noun",
            "sent1": "Her ultramontanism led her to always follow the Pope's teachings.",
            "sent2": "The community's ultramontanism was evident in their unwavering support for the Pope.",
            "sent3": "Sarah's ultramontanism was so strong that she joked about having a direct line to the Pope for advice.",
            "sent4": "In the realm of ultramontanism, the Pope's word was considered law.",
            "sent5": "The concept of ultramontanism was deeply ingrained in their religious beliefs."
        },
        {
            "definition": "Support for the Roman Catholic Church and its teachings, especially in opposition to secular authority.",
            "pos": "noun",
            "sent1": "His ultramontanism was evident in his defense of the Catholic Church against secular powers.",
            "sent2": "The history of ultramontanism showed a strong allegiance to the Roman Catholic Church.",
            "sent3": "The ultramontanism of the group was so strong that they held a parade in support of the Church.",
            "sent4": "In the face of adversity, her ultramontanism shone brightly as she defended the Church's teachings.",
            "sent5": "The unity of their ultramontanism was a powerful force against external pressures."
        },
        {
            "definition": "A belief in the supremacy of the Pope and the Roman Catholic Church.",
            "pos": "noun",
            "sent1": "Their ultramontanism was unwavering, believing in the Pope's supreme authority.",
            "sent2": "The concept of ultramontanism emphasized the Pope's leadership in the Church.",
            "sent3": "John's ultramontanism was so strong that he jokingly referred to the Pope as the 'ultimate boss'.",
            "sent4": "In the realm of faith, her ultramontanism was a guiding light in times of uncertainty.",
            "sent5": "The strength of their ultramontanism was a testament to their devout beliefs."
        }
    ]
}