{
    "term": "ultrarevolutionaries",
    "meanings": [
        {
            "definition": "A group of individuals who advocate for extreme and rapid social or political change.",
            "pos": "noun",
            "sent1": "The ultrarevolutionaries gathered to plan their next protest.",
            "sent2": "The history books often mention ultrarevolutionaries as catalysts for change.",
            "sent3": "The ultrarevolutionaries decided to host a potluck to overthrow the government.",
            "sent4": "Their ideas were like a storm, sweeping through society like ultrarevolutionaries.",
            "sent5": "The image of the ultrarevolutionaries burning their old beliefs was unforgettable."
        },
        {
            "definition": "Those who are considered to be on the farthest end of the revolutionary spectrum.",
            "pos": "noun",
            "sent1": "In the room full of revolutionaries, she stood out as an ultrarevolutionary.",
            "sent2": "The ultrarevolutionaries were always at the forefront of change.",
            "sent3": "At the costume party, he dressed up as an ultrarevolutionary from the future.",
            "sent4": "Their leader was like an ultrarevolutionary comet, blazing a trail of change.",
            "sent5": "The ultrarevolutionaries' ideas were like fireworks in the night sky, impossible to ignore."
        },
        {
            "definition": "People who are known for their radical and revolutionary beliefs and actions.",
            "pos": "noun",
            "sent1": "The ultrarevolutionaries were often seen as too extreme by others.",
            "sent2": "She admired the courage of the ultrarevolutionaries in fighting for justice.",
            "sent3": "The ultrarevolutionaries decided to start a band to spread their message.",
            "sent4": "Their impact on society was like a wave, with ultrarevolutionaries leading the charge.",
            "sent5": "The image of the ultrarevolutionaries marching with banners was etched in her memory."
        }
    ]
}