{
    "term": "ultramontanisms",
    "meanings": [
        {
            "definition": "Beliefs or practices associated with extreme Roman Catholicism.",
            "pos": "noun",
            "sent1": "Some people study ultramontanisms to understand different religious beliefs.",
            "sent2": "The book discussed various ultramontanisms found in Catholicism.",
            "sent3": "At the party, the topic of ultramontanisms led to a lively debate.",
            "sent4": "Her family's traditions were like ultramontanisms, deeply rooted and unchanging.",
            "sent5": "The professor's lecture on ultramontanisms was both enlightening and thought-provoking."
        },
        {
            "definition": "Adherence to the authority of the Pope in Rome.",
            "pos": "noun",
            "sent1": "His ultramontanisms were evident in his unwavering support for the Pope.",
            "sent2": "Many Catholics show their ultramontanisms by following the Pope's teachings.",
            "sent3": "The comedian joked about someone having ultramontanisms so strong they'd follow the Pope anywhere.",
            "sent4": "In her eyes, his authority was like ultramontanisms, unquestioned and absolute.",
            "sent5": "The painting depicted a scene of ultramontanisms, with the Pope at the center of attention."
        },
        {
            "definition": "Extreme conservatism in religious matters.",
            "pos": "noun",
            "sent1": "The community's ultramontanisms clashed with the younger generation's more liberal views.",
            "sent2": "Some people find comfort in the stability of ultramontanisms in their faith.",
            "sent3": "The cat's insistence on being fed at the same time every day was like ultramontanisms in action.",
            "sent4": "His views on morality were as rigid as ultramontanisms, resistant to change.",
            "sent5": "The storm outside mirrored the intensity of their ultramontanisms, unyielding and powerful."
        }
    ]
}