{
    "term": "ultralights",
    "meanings": [
        {
            "definition": "Ultralights: very light, small aircraft designed for simplicity and low cost.",
            "pos": "adjective",
            "sent1": "The ultralights aircraft was easy to carry due to its light weight.",
            "sent2": "She preferred the ultralights model for its simplicity and affordability.",
            "sent3": "The ultralights plane looked like a toy with its small size.",
            "sent4": "In the sky, the ultralights aircraft floated like a feather.",
            "sent5": "The ultralights aircraft shone brightly in the sunlight, emphasizing its lightness."
        },
        {
            "definition": "Ultralights: a type of aircraft that is extremely light and easy to maneuver.",
            "pos": "noun",
            "sent1": "The pilot enjoyed flying the ultralights for its easy maneuverability.",
            "sent2": "Many aviation enthusiasts choose ultralights for their lightness and agility.",
            "sent3": "The ultralights aircraft zipped through the air like a nimble bird.",
            "sent4": "Watching the ultralights glide effortlessly was like witnessing a dance in the sky.",
            "sent5": "The ultralights plane seemed to defy gravity with its lightness and grace."
        },
        {
            "definition": "Ultralights: a category of small, lightweight aircraft used for recreational flying.",
            "pos": "noun",
            "sent1": "The ultralights were perfect for leisurely flights over the countryside.",
            "sent2": "Pilots often choose ultralights for their recreational flying adventures.",
            "sent3": "Seeing the ultralights soar through the clouds brought a smile to everyone's face.",
            "sent4": "The ultralights fleet painted the sky with a colorful display of freedom.",
            "sent5": "The ultralights aircraft symbolized the joy of flying in its purest form."
        }
    ]
}