{
    "term": "ulus",
    "meanings": [
        {
            "definition": "A suffix meaning \"tribe\" or \"people\" in Turkic languages.",
            "pos": "noun",
            "sent1": "In Turkic languages, the word 'ulus' is used to refer to a group of people.",
            "sent2": "The term 'ulus' is commonly used in Turkic languages to denote a community or tribe.",
            "sent3": "When the ulus gathered for their annual celebration, the village was filled with joy and laughter.",
            "sent4": "The ulus of students in the school formed a strong bond, like a close-knit family.",
            "sent5": "The ulus, with their unique traditions and customs, stood out among other tribes."
        },
        {
            "definition": "A subdivision of a province in ancient Rome.",
            "pos": "noun",
            "sent1": "In ancient Rome, an ulus was a smaller division within a province.",
            "sent2": "The ulus played a crucial role in the governance of provinces in ancient Rome.",
            "sent3": "The ulus of Rome was known for its vibrant markets and bustling streets.",
            "sent4": "Just like the branches of a tree, each ulus in Rome had its own distinct characteristics.",
            "sent5": "The ulus was like a puzzle piece, fitting perfectly into the larger structure of the province."
        },
        {
            "definition": "A unit of measurement used in the Ottoman Empire.",
            "pos": "noun",
            "sent1": "Merchants in the Ottoman Empire often used the ulus as a standard unit of measurement.",
            "sent2": "The ulus was a reliable measure for goods and commodities in the Ottoman Empire.",
            "sent3": "The baker carefully weighed the flour using the ulus to ensure accurate baking.",
            "sent4": "The ulus served as a common language for trade, ensuring fair transactions among merchants.",
            "sent5": "The ulus, with its precise measurements, facilitated smooth transactions in the marketplace."
        }
    ]
}