{
    "term": "umbrae",
    "meanings": [
        {
            "definition": "The fully shaded inner region of a shadow cast by an opaque object.",
            "pos": "noun",
            "sent1": "The umbrae of the tree provided a cool spot to rest under.",
            "sent2": "She saw her own umbrae on the ground as she walked in the sunlight.",
            "sent3": "The cat chased after the umbrae of a passing cloud, thinking it was a mouse.",
            "sent4": "The umbrae of doubt loomed over his decision, making him hesitate.",
            "sent5": "The umbrae of the mountain stretched across the valley, creating a dramatic scene."
        },
        {
            "definition": "A phantom or shadowy apparition.",
            "pos": "noun",
            "sent1": "The old house was said to be haunted by the umbrae of its former owner.",
            "sent2": "In the darkness, she thought she saw an umbrae moving in the corner of her eye.",
            "sent3": "The children giggled as they tried to scare each other with tales of umbrae lurking in the shadows.",
            "sent4": "The umbrae of fear gripped her heart as she walked through the abandoned graveyard.",
            "sent5": "The umbrae of the ghostly figure seemed to float through the room, sending shivers down their spines."
        },
        {
            "definition": "A dark area or shape produced by a body coming between rays of light and a surface.",
            "pos": "noun",
            "sent1": "The umbrae of the building cast a long shadow on the sidewalk.",
            "sent2": "She watched as the umbrae of the clouds moved slowly across the field.",
            "sent3": "The artist used different shades to create the umbrae of the vase in the painting.",
            "sent4": "The umbrae of the tree branches danced on the wall as the wind blew outside.",
            "sent5": "The umbrae of the fence created a pattern of light and dark on the ground."
        }
    ]
}