{
    "term": "unabsorbent",
    "meanings": [
        {
            "definition": "Not capable of being absorbed.",
            "pos": "adjective",
            "sent1": "The unabsorbent cloth repelled all attempts to soak it up.",
            "sent2": "The paper towel, being unabsorbent, simply let the spilled water pool on top.",
            "sent3": "The unabsorbent sponge seemed to mock the spilled juice, refusing to take it in.",
            "sent4": "Her mind was like an unabsorbent surface, deflecting any new information that came her way.",
            "sent5": "The unabsorbent material was like a shield against the liquid, keeping it at bay."
        },
        {
            "definition": "Not able to soak up liquid.",
            "pos": "adjective",
            "sent1": "The unabsorbent sponge just pushed the water around without soaking any up.",
            "sent2": "The unabsorbent fabric of the raincoat left the raindrops rolling off its surface.",
            "sent3": "The unabsorbent paper towel was like a trampoline for the spilled milk, bouncing it back up.",
            "sent4": "His unabsorbent skin seemed to repel the lotion, leaving it sitting on top like a film.",
            "sent5": "The unabsorbent ground turned the rain into little puddles that refused to seep in."
        },
        {
            "definition": "Resistant to absorbing moisture.",
            "pos": "adjective",
            "sent1": "The unabsorbent material of the umbrella kept the raindrops from penetrating through.",
            "sent2": "The unabsorbent surface of the table made it easy to wipe away any spilled drinks.",
            "sent3": "The unabsorbent plant leaves seemed to dance with joy as the rain slid off them.",
            "sent4": "Her unabsorbent hair seemed to defy the humidity, staying perfectly dry and styled.",
            "sent5": "The unabsorbent barrier held strong against the flood, keeping the room dry and safe."
        }
    ]
}