{
    "term": "unawaked",
    "meanings": [
        {
            "definition": "Not awake",
            "pos": "adjective",
            "sent1": "She looked unawaked as she slept peacefully on the couch.",
            "sent2": "The unawaked baby yawned and stretched after a long nap.",
            "sent3": "The unawaked cat didn't even flinch when the doorbell rang.",
            "sent4": "The unawaked city slowly came to life as the sun rose over the horizon.",
            "sent5": "The unawaked forest was silent except for the rustling of leaves in the wind."
        },
        {
            "definition": "Not woken",
            "pos": "adjective",
            "sent1": "The unawaked child continued to dream peacefully in bed.",
            "sent2": "The unawaked computer screen remained dark until the power button was pressed.",
            "sent3": "The unawaked alarm clock failed to rouse the heavy sleeper.",
            "sent4": "The unawaked town was still shrouded in darkness before dawn.",
            "sent5": "The unawaked phone buzzed with notifications, but went unnoticed."
        },
        {
            "definition": "Not aroused",
            "pos": "adjective",
            "sent1": "His unawaked interest in the topic showed in his lack of questions during the lecture.",
            "sent2": "The unawaked audience barely clapped at the end of the boring performance.",
            "sent3": "The unawaked dog showed no excitement when presented with its favorite toy.",
            "sent4": "The unawaked curiosity of the students led to a quiet classroom discussion.",
            "sent5": "The unawaked party guests sat quietly, waiting for something interesting to happen."
        },
        {
            "definition": "Not alert",
            "pos": "adjective",
            "sent1": "The unawaked security guard failed to notice the intruder sneaking past.",
            "sent2": "The unawaked driver almost missed the turn because of drowsiness.",
            "sent3": "The unawaked student didn't hear the teacher calling their name.",
            "sent4": "The unawaked squirrel didn't react to the approaching cat until it was too late.",
            "sent5": "The unawaked hiker wandered off the trail, lost in thought and unaware of the surroundings."
        }
    ]
}