{
    "term": "unbeaten",
    "meanings": [
        {
            "definition": "Not defeated or overcome",
            "pos": "adjective",
            "sent1": "The team remained unbeaten throughout the entire season.",
            "sent2": "The boxer was proud of his unbeaten record in the ring.",
            "sent3": "The cake stood unbeaten on the kitchen counter, tempting everyone.",
            "sent4": "Her spirit was like an unbeaten warrior, resilient and strong.",
            "sent5": "The mountain stood tall and unbeaten against the changing weather."
        },
        {
            "definition": "Not having been beaten or struck",
            "pos": "adjective",
            "sent1": "The metal remained unbeaten by the hammer's blows.",
            "sent2": "The vase was delicate but unbeaten by any accidental knocks.",
            "sent3": "The pinata hung unbeaten, waiting for the children's eager hands.",
            "sent4": "His determination was like an unbeaten shield, protecting him from failure.",
            "sent5": "The old tree stood tall, its bark unbeaten by time's passage."
        },
        {
            "definition": "Not having been mixed or stirred",
            "pos": "adjective",
            "sent1": "The soup remained unbeaten, with all the flavors distinct.",
            "sent2": "The paint colors stayed unbeaten, creating a beautiful gradient.",
            "sent3": "The cake batter sat unbeaten in the bowl, waiting for the oven.",
            "sent4": "The cocktail remained unbeaten, each layer visible and vibrant.",
            "sent5": "The ingredients in the salad stayed unbeaten, offering a fresh taste."
        },
        {
            "definition": "Not having been trodden on or walked over",
            "pos": "adjective",
            "sent1": "The path through the garden remained unbeaten, untouched by feet.",
            "sent2": "The field was unbeaten, a perfect place for a picnic.",
            "sent3": "The snow in the yard lay unbeaten, like a white blanket.",
            "sent4": "The grass in the park was unbeaten, inviting people to relax.",
            "sent5": "The sand on the beach was unbeaten, waiting for footprints to appear."
        }
    ]
}