{
    "term": "unconsecrated",
    "meanings": [
        {
            "definition": "Not consecrated or made sacred.",
            "pos": "adjective",
            "sent1": "The graveyard had an unconsecrated area where the new graves were located.",
            "sent2": "The old church was filled with consecrated relics, but the back room remained unconsecrated.",
            "sent3": "The unconsecrated ground was where the mischievous children played hide and seek.",
            "sent4": "Her heart felt unconsecrated, as if missing a piece that made it whole.",
            "sent5": "The unconsecrated land seemed to whisper tales of forgotten spirits and lost dreams."
        },
        {
            "definition": "Not dedicated to a sacred purpose.",
            "pos": "adjective",
            "sent1": "The unconsecrated building was used for storage rather than worship.",
            "sent2": "The temple was filled with dedicated altars, while the nearby hall remained unconsecrated.",
            "sent3": "The unconsecrated room was transformed into a makeshift workshop for crafting toys.",
            "sent4": "Her mind felt unconsecrated, focused on earthly matters rather than spiritual ones.",
            "sent5": "The unconsecrated space echoed with the sounds of everyday life, devoid of solemnity."
        },
        {
            "definition": "Not blessed or made holy.",
            "pos": "adjective",
            "sent1": "The unconsecrated water was not suitable for use in the sacred ritual.",
            "sent2": "The blessed church was a place of peace, while the nearby chapel remained unconsecrated.",
            "sent3": "The unconsecrated bread crumbled in his hands, a sign of its lack of divine favor.",
            "sent4": "Her voice sounded unconsecrated, lacking the soothing quality of a choir's harmony.",
            "sent5": "The unconsecrated air felt heavy with unspoken prayers, waiting for a blessing to lift it."
        }
    ]
}