{
    "term": "uncrewed",
    "meanings": [
        {
            "definition": "Not manned or staffed",
            "pos": "adjective",
            "sent1": "The uncrewed spaceship traveled through space without any people on board.",
            "sent2": "The uncrewed vehicle moved silently across the desert, controlled only by technology.",
            "sent3": "The uncrewed factory seemed like a ghost town, with no workers in sight.",
            "sent4": "The uncrewed aircraft soared through the sky like a lone bird, free from human control.",
            "sent5": "The uncrewed submarine explored the depths of the ocean autonomously, without any crew members."
        },
        {
            "definition": "Without a crew",
            "pos": "adjective",
            "sent1": "The uncrewed ship sailed smoothly across the sea, devoid of any crew members.",
            "sent2": "The uncrewed drone flew high in the sky, operated remotely without a crew on board.",
            "sent3": "The uncrewed train chugged along the tracks, appearing like a futuristic mode of transportation.",
            "sent4": "The uncrewed spaceship glided through the vastness of space, a solitary traveler without a crew.",
            "sent5": "The uncrewed submarine dove deep into the ocean, exploring the unknown depths without a crew to guide it."
        },
        {
            "definition": "Not operated or controlled by a crew",
            "pos": "adjective",
            "sent1": "The uncrewed aircraft flew autonomously, guided by advanced technology instead of a crew.",
            "sent2": "The uncrewed vehicle navigated through the city streets without any human intervention.",
            "sent3": "The uncrewed spaceship orbited the planet, showcasing the capabilities of unmanned exploration.",
            "sent4": "The uncrewed drone hovered in the air, responding to commands without the need for a crew.",
            "sent5": "The uncrewed rover roamed the Martian surface independently, controlled remotely from Earth."
        }
    ]
}