{
    "term": "undergod",
    "meanings": [
        {
            "definition": "A deity or divine being that is beneath or subordinate to a higher god.",
            "pos": "noun",
            "sent1": "In some mythologies, an undergod is a powerful being who serves a greater god.",
            "sent2": "The villagers believed in the existence of an undergod who controlled the forces of nature.",
            "sent3": "The undergod of mischief played pranks on the other gods, causing chaos in the heavens.",
            "sent4": "The undergod's influence was like a shadow, always present but rarely noticed.",
            "sent5": "Legends spoke of an undergod who guarded the secrets of the underworld with fierce loyalty."
        },
        {
            "definition": "A lesser god or supernatural being.",
            "pos": "noun",
            "sent1": "The undergod of dreams visited mortals in their sleep, weaving tales of fantasy.",
            "sent2": "Ancient texts described an undergod who watched over the realm of dreams.",
            "sent3": "Children believed the undergod of bedtime stories lived in their imagination.",
            "sent4": "The undergod's powers were subtle but profound, shaping the dreams of all who slept.",
            "sent5": "Legends whispered of an undergod who danced among the stars, painting the night sky with dreams."
        },
        {
            "definition": "A deity that is worshipped or revered as being below the supreme god.",
            "pos": "noun",
            "sent1": "The undergod of harvest was honored with offerings of the first fruits of the season.",
            "sent2": "Priests conducted rituals to appease the undergod of fertility and ensure bountiful crops.",
            "sent3": "The undergod of abundance was known to bless those who shared their wealth with others.",
            "sent4": "The undergod's presence could be felt in the golden fields, a sign of prosperity to come.",
            "sent5": "Legends told of an undergod who walked among mortals, bringing blessings of plenty wherever they went."
        }
    ]
}