{
    "term": "undecadent",
    "meanings": [
        {
            "definition": "Not decadent or in a state of decline.",
            "pos": "adjective",
            "sent1": "The simple meal was undecadent, consisting of plain rice and vegetables.",
            "sent2": "The undecadent lifestyle of the villagers focused on hard work and community values.",
            "sent3": "Even the squirrels in the undecadent forest preferred nuts over fancy treats.",
            "sent4": "Her undecadent approach to fashion stood out in a sea of extravagant outfits.",
            "sent5": "The undecadent sunset painted the sky in soft hues of pink and orange."
        },
        {
            "definition": "Not characterized by excessive luxury or self-indulgence.",
            "pos": "adjective",
            "sent1": "The undecadent hotel room had simple furnishings and no frills.",
            "sent2": "She preferred undecadent gifts like books and homemade cookies over expensive jewelry.",
            "sent3": "The undecadent party featured homemade snacks and board games instead of lavish decorations.",
            "sent4": "His undecadent taste in music leaned towards folk songs and acoustic melodies.",
            "sent5": "The undecadent garden was filled with wildflowers and humble vegetable patches."
        },
        {
            "definition": "Not showing signs of decay or deterioration.",
            "pos": "adjective",
            "sent1": "The undecadent building stood strong against the test of time, its walls sturdy and intact.",
            "sent2": "The undecadent fruit remained fresh and juicy even after days on the counter.",
            "sent3": "In the undecadent cellar, the old wine bottles seemed to defy aging with each passing year.",
            "sent4": "Her undecadent skin glowed with health and vitality, untouched by wrinkles or blemishes.",
            "sent5": "The undecadent oak tree in the yard stood tall and proud, its leaves vibrant and green."
        }
    ]
}