{
    "term": "undercut",
    "meanings": [
        {
            "definition": "To offer goods or services at a lower price than a competitor.",
            "pos": "verb",
            "sent1": "The store decided to undercut its rival by selling the same product for less.",
            "sent2": "Supermarkets often undercut each other's prices to attract more customers.",
            "sent3": "The price war between the two shops led to a funny situation where they kept trying to undercut each other.",
            "sent4": "Her clever negotiation tactics always manage to undercut the competition.",
            "sent5": "In the world of business, the strategy to undercut can lead to fierce competition."
        },
        {
            "definition": "To weaken or damage the effectiveness of something.",
            "pos": "verb",
            "sent1": "The constant criticism began to undercut his confidence in his abilities.",
            "sent2": "Lack of sleep can undercut your performance at work.",
            "sent3": "The villain's plan to undercut the hero's efforts backfired spectacularly.",
            "sent4": "The betrayal by a trusted friend can deeply undercut one's sense of trust.",
            "sent5": "Negative thoughts can slowly undercut your motivation if you let them linger."
        },
        {
            "definition": "A cut or groove made underneath something.",
            "pos": "noun",
            "sent1": "The carpenter made a precise undercut to fit the shelf securely.",
            "sent2": "The sculptor added an intricate undercut to the statue for a unique look.",
            "sent3": "The unexpected undercut in the wood caused a small piece to break off, creating a comical mishap.",
            "sent4": "The artist's use of light and shadow created a stunning undercut in the painting.",
            "sent5": "The engineer carefully designed the undercut to provide extra stability to the structure."
        }
    ]
}