{
    "term": "underruns",
    "meanings": [
        {
            "definition": "A situation in which the actual cost of a project exceeds the estimated cost.",
            "pos": "noun",
            "sent1": "The construction company faced financial challenges due to underruns in the building project.",
            "sent2": "The underruns in the budget caused delays in completing the construction.",
            "sent3": "The accountant found humor in the underruns when presenting the final project cost.",
            "sent4": "The unexpected underruns in expenses left the project manager scrambling for solutions.",
            "sent5": "The underruns in the budget were like hidden obstacles on the path to project completion."
        },
        {
            "definition": "A condition in which a computer program runs out of memory or processing capacity.",
            "pos": "noun",
            "sent1": "The game crashed due to underruns in memory allocation.",
            "sent2": "Underruns in processing power can lead to slow performance of the software.",
            "sent3": "The underruns in memory made the computer act like it had amnesia.",
            "sent4": "The sudden underruns in processing capacity paralyzed the computer system.",
            "sent5": "The underruns in memory were like roadblocks hindering the program's execution."
        },
        {
            "definition": "A flaw in a printing process where the ink does not fully cover the paper.",
            "pos": "noun",
            "sent1": "The underruns in printing resulted in faded images on the brochure.",
            "sent2": "The underruns caused the text to appear incomplete on the flyer.",
            "sent3": "The underruns in ink coverage made the poster look like a modern art piece.",
            "sent4": "The unexpected underruns in printing quality affected the final product's appearance.",
            "sent5": "The underruns in ink coverage created a unique, abstract design on the packaging."
        }
    ]
}