{
    "term": "undertakings",
    "meanings": [
        {
            "definition": "A task or project that one takes on",
            "pos": "noun",
            "sent1": "Her school undertakings include completing homework and studying for exams.",
            "sent2": "The construction company's undertakings involve building new houses and renovating old ones.",
            "sent3": "His ambitious undertaking of climbing Mount Everest left his friends in awe.",
            "sent4": "Starting a new business is a challenging undertaking that requires dedication and hard work.",
            "sent5": "The explorer's dangerous undertaking to cross the desert alone was filled with risks and uncertainties."
        },
        {
            "definition": "A business or enterprise",
            "pos": "noun",
            "sent1": "The family's bakery has been a successful undertaking for many years.",
            "sent2": "His latest undertaking in the tech industry is expected to bring great profits.",
            "sent3": "The cat's undertaking of catching the elusive mouse turned into a comical chase around the house.",
            "sent4": "The restaurant owner's new undertaking to expand to a second location is a bold move.",
            "sent5": "The farmer's undertaking of growing organic vegetables has gained popularity among health-conscious consumers."
        },
        {
            "definition": "A promise or commitment to do something",
            "pos": "noun",
            "sent1": "Her undertaking to help her friend move included packing boxes and lifting furniture.",
            "sent2": "The politician's undertaking to improve healthcare in the country was met with mixed reactions.",
            "sent3": "His undertaking to eat only vegetables for a month was a humorous challenge for his meat-loving friends.",
            "sent4": "The athlete's undertaking to break the world record motivated him to train harder than ever before.",
            "sent5": "The student's undertaking to volunteer at the local shelter showed her dedication to helping those in need."
        }
    ]
}