{
    "term": "undergird",
    "meanings": [
        {
            "definition": "Support or strengthen from below",
            "pos": "verb",
            "sent1": "The strong pillars undergirded the bridge, keeping it steady.",
            "sent2": "She used ropes to undergird the heavy load and prevent it from falling.",
            "sent3": "The superhero's cape seemed to undergird him magically, giving him extra strength.",
            "sent4": "Her unwavering faith undergirded her during challenging times like a solid rock.",
            "sent5": "The roots of the tree undergirded the entire forest, providing stability and nourishment."
        },
        {
            "definition": "Secure or fasten from below",
            "pos": "verb",
            "sent1": "He made sure to undergird the tent stakes firmly in the ground to prevent them from coming loose.",
            "sent2": "The workers undergirded the scaffolding to ensure it wouldn't collapse.",
            "sent3": "The mischievous puppy tried to undergird its favorite toy to the floor, thinking it was a fun game.",
            "sent4": "The love and trust between them undergirded their relationship like a strong bond.",
            "sent5": "The safety harness undergirded the climber, giving him confidence to reach the mountain peak."
        },
        {
            "definition": "Provide a foundation or basis for",
            "pos": "verb",
            "sent1": "Education helps undergird a person's future by opening up opportunities.",
            "sent2": "The historical documents undergird the researcher's theory about the ancient civilization.",
            "sent3": "The chef's secret ingredient seemed to undergird the entire recipe, making it irresistible.",
            "sent4": "Her values and beliefs undergirded her decisions, guiding her moral compass.",
            "sent5": "The strong friendship undergirded their teamwork, making them unbeatable in the competition."
        }
    ]
}