{
    "term": "understeers",
    "meanings": [
        {
            "definition": "To steer a vehicle less sharply than intended, causing it to deviate from the desired course.",
            "pos": "verb",
            "sent1": "The inexperienced driver understeers around the corner, almost hitting the curb.",
            "sent2": "When the road is slippery, the car understeers easily, making it hard to control.",
            "sent3": "The car understeers comically, making the passengers sway in their seats.",
            "sent4": "Her attempt to parallel park understeers like a boat trying to navigate a narrow stream.",
            "sent5": "Understeering in heavy traffic can lead to dangerous situations, so it's important to practice control.",
            "sent6": "Careful not to understeer too much, or you might end up in the wrong lane.",
            "sent7": "Understeering on icy roads can be particularly risky, so drive cautiously.",
            "sent8": "The driver understeers slightly, causing the car to drift off course.",
            "sent9": "Understeering in a race can cost valuable time, so precision is key.",
            "sent10": "The car understeers predictably on the wet road, prompting the driver to adjust their steering."
        },
        {
            "definition": "The tendency of a vehicle to turn less sharply than the driver intends.",
            "pos": "noun",
            "sent1": "The mechanic explained that the car's understeer was due to worn-out tires.",
            "sent2": "Drivers should be aware of the vehicle's understeer to avoid accidents.",
            "sent3": "The understeer of the truck made it challenging to navigate tight corners.",
            "sent4": "The understeer of the bus was like trying to turn a ship in a narrow canal.",
            "sent5": "Learning to control the understeer of a car is essential for safe driving.",
            "sent6": "An increase in understeer can be a sign of poor wheel alignment.",
            "sent7": "The driver felt the understeer of the car as it struggled to make a sharp turn.",
            "sent8": "The understeer of the vehicle became more noticeable as the tires wore down.",
            "sent9": "Understanding the understeer of a car helps in adjusting driving techniques.",
            "sent10": "The understeer of the old car was a constant challenge for the driver on winding roads."
        }
    ]
}