{
    "term": "undutifulnesses",
    "meanings": [
        {
            "definition": "Failure or neglect to fulfill one's duties or obligations.",
            "pos": "noun",
            "sent1": "Her undutifulnesses at work led to her being reprimanded by her boss.",
            "sent2": "The undutifulnesses of the student resulted in poor grades.",
            "sent3": "The undutifulnesses of the cat towards catching mice was quite amusing.",
            "sent4": "His undutifulnesses towards his responsibilities were like a heavy weight on his shoulders.",
            "sent5": "The undutifulnesses of the leaky faucet to stop dripping kept everyone awake at night."
        },
        {
            "definition": "Lack of respect or obedience towards authority figures.",
            "pos": "noun",
            "sent1": "The child's undutifulnesses towards the teacher were evident in the classroom.",
            "sent2": "His undutifulnesses towards the police officer landed him in trouble.",
            "sent3": "The undutifulnesses shown towards the traffic rules by the driver were quite surprising.",
            "sent4": "Her undutifulnesses towards the judge's orders were like a slap in the face of justice.",
            "sent5": "The undutifulnesses of the wind to follow a straight path caused chaos in the park."
        },
        {
            "definition": "Disobedience or defiance towards parents or superiors.",
            "pos": "noun",
            "sent1": "The teenager's undutifulnesses towards his parents caused tension at home.",
            "sent2": "Her undutifulnesses towards her boss resulted in her getting fired.",
            "sent3": "The undutifulnesses of the dog to obey commands made everyone laugh.",
            "sent4": "His undutifulnesses towards his coach's instructions cost the team the game.",
            "sent5": "The undutifulnesses of the storm to follow the predicted path surprised meteorologists."
        }
    ]
}