{
    "term": "ungratefulness",
    "meanings": [
        {
            "definition": "The state or quality of being ungrateful.",
            "pos": "noun",
            "sent1": "Her ungratefulness towards her parents was evident when she refused to thank them for the birthday gift.",
            "sent2": "His ungratefulness for all the help he received left everyone feeling disappointed.",
            "sent3": "The ungratefulness of the cat towards its owner was shown by ignoring the freshly filled food bowl.",
            "sent4": "The ungratefulness of the student towards the teacher was like a dark cloud overshadowing the classroom.",
            "sent5": "The ungratefulness of the customer towards the waiter was so palpable, it made the atmosphere tense."
        },
        {
            "definition": "Lack of gratitude or appreciation.",
            "pos": "noun",
            "sent1": "The ungratefulness of the child towards his grandmother's gift was hurtful.",
            "sent2": "She showed her ungratefulness by never saying thank you for all the favors done for her.",
            "sent3": "The ungratefulness of the dog towards the new toy was comical as it preferred an old sock instead.",
            "sent4": "The ungratefulness of the city towards its historical buildings was like erasing its own past.",
            "sent5": "The ungratefulness of the student towards the scholarship he received was shocking to everyone."
        },
        {
            "definition": "Ingratitude.",
            "pos": "noun",
            "sent1": "His ungratefulness towards his mentor was disappointing after all the guidance provided.",
            "sent2": "The ungratefulness of the employee towards the promotion offered was surprising.",
            "sent3": "The ungratefulness of the plant towards the sunlight was evident as it withered away.",
            "sent4": "The ungratefulness of the guest towards the hospitality shown was like a slap in the face.",
            "sent5": "The ungratefulness of the student towards the opportunity given was a missed chance for growth."
        }
    ]
}