{
    "term": "ungratefulnesses",
    "meanings": [
        {
            "definition": "The state or quality of being ungrateful.",
            "pos": "noun",
            "sent1": "Her ungratefulnesses towards her parents hurt their feelings.",
            "sent2": "His ungratefulnesses for all the help he received was disappointing.",
            "sent3": "The ungratefulnesses of the spoiled child was evident when she didn't say thank you.",
            "sent4": "The ungratefulnesses of the student towards his teacher was like a dark cloud over the classroom.",
            "sent5": "The ungratefulnesses of the guest left a bitter taste in the host's mouth."
        },
        {
            "definition": "Lack of gratitude or appreciation.",
            "pos": "noun",
            "sent1": "The ungratefulnesses shown by the child towards the gift was disheartening.",
            "sent2": "She displayed ungratefulnesses by not acknowledging the kind gesture.",
            "sent3": "The ungratefulnesses of the cat towards the food left out for it was comical.",
            "sent4": "The ungratefulnesses of the plant towards the sunlight was like rejecting a warm hug.",
            "sent5": "The ungratefulnesses of the student towards the teacher's efforts was like ignoring a guiding hand."
        },
        {
            "definition": "Ingratitude or thanklessness.",
            "pos": "noun",
            "sent1": "The ungratefulnesses of the friend who never said thank you was noticeable.",
            "sent2": "His ungratefulnesses towards the help he received was unappreciative.",
            "sent3": "The ungratefulnesses of the dog who ignored his owner's affection was amusing.",
            "sent4": "The ungratefulnesses of the sky for the rainbow was like missing a beautiful sight.",
            "sent5": "The ungratefulnesses of the student towards the teacher's guidance was like disregarding a compass in a storm."
        }
    ]
}