{
    "term": "unhandsomely",
    "meanings": [
        {
            "definition": "In an unattractive or unpleasing manner.",
            "pos": "adverb",
            "sent1": "She dressed unhandsomely for the party, wearing mismatched socks.",
            "sent2": "The old house was painted unhandsomely, with peeling paint and faded colors.",
            "sent3": "Despite her best efforts, the cake turned out unhandsomely, lopsided and uneven.",
            "sent4": "The artist's attempt to capture the sunset on canvas ended unhandsomely, lacking the vibrant colors of nature.",
            "sent5": "The garden, once lush and green, now appeared unhandsomely with wilting flowers and overgrown weeds."
        },
        {
            "definition": "Without grace or elegance.",
            "pos": "adjective",
            "sent1": "The clumsy dancer moved unhandsomely across the stage, tripping over their own feet.",
            "sent2": "The plain, unhandsomely designed vase stood out among the elegant decorations.",
            "sent3": "The cat attempted an unhandsomely graceful leap onto the table but missed and knocked over a glass.",
            "sent4": "The old building, once grand and majestic, now stood unhandsomely against the modern skyline.",
            "sent5": "Her unhandsomely styled hair stuck out in all directions, defying any attempts to tame it."
        },
        {
            "definition": "In a crude or unrefined way.",
            "pos": "adverb",
            "sent1": "He spoke unhandsomely, using coarse language that offended those around him.",
            "sent2": "The meal was prepared unhandsomely, with burnt edges and undercooked centers.",
            "sent3": "The comedian's joke landed unhandsomely, eliciting groans instead of laughter.",
            "sent4": "The play ended unhandsomely, with actors forgetting their lines and props falling over.",
            "sent5": "The project was completed unhandsomely, with messy handwriting and smudged ink."
        }
    ]
}