{
    "term": "unhele",
    "meanings": [
        {
            "definition": "To cover or hide",
            "pos": "verb",
            "sent1": "She used a blanket to unhele herself from the cold.",
            "sent2": "The magician used a cloak to unhele the rabbit in his hat.",
            "sent3": "The cat tried to unhele itself under the bed, but its tail gave it away.",
            "sent4": "The fog unheled the city, making it disappear from view.",
            "sent5": "The leaves unheled the squirrel as it scurried up the tree."
        },
        {
            "definition": "To conceal or keep secret",
            "pos": "verb",
            "sent1": "He tried to unhele his surprise birthday party plans from his best friend.",
            "sent2": "The spy needed to unhele the classified information from the enemy agents.",
            "sent3": "The kids attempted to unhele their secret clubhouse location from the adults.",
            "sent4": "The shadows unheled the thief as he made his way through the dark alley.",
            "sent5": "The locked diary unheled the girl's deepest thoughts and feelings."
        },
        {
            "definition": "To protect or shelter",
            "pos": "verb",
            "sent1": "The large tree unheled the tiny bird from the harsh wind.",
            "sent2": "The sturdy umbrella unheled her from the pouring rain.",
            "sent3": "The cozy blanket unheled the child during nap time.",
            "sent4": "The thick walls unheled the family from the storm outside.",
            "sent5": "The cave unheled the explorers from the scorching sun."
        },
        {
            "definition": "To support or uphold",
            "pos": "verb",
            "sent1": "The strong pillars unheled the weight of the building above.",
            "sent2": "Her friends always unheled her during tough times.",
            "sent3": "The loyal dog unheled its owner by staying by their side.",
            "sent4": "The foundation unheled the structure of the bridge.",
            "sent5": "The roots unheled the tree, keeping it firmly in place."
        }
    ]
}