{
    "term": "uniaxial",
    "meanings": [
        {
            "definition": "Having a single axis.",
            "pos": "adjective",
            "sent1": "The uniaxial crystal only allows light to pass through in one direction.",
            "sent2": "The microscope was designed with a uniaxial focus for precise measurements.",
            "sent3": "The uniaxial ruler could only measure length and not width, making it quite limited.",
            "sent4": "Her uniaxial vision on the problem helped her find a straightforward solution.",
            "sent5": "The uniaxial nature of the compass needle always pointed north, guiding them home."
        },
        {
            "definition": "Relating to a crystal that has a single optic axis.",
            "pos": "adjective",
            "sent1": "The uniaxial crystal displayed unique patterns when viewed under polarized light.",
            "sent2": "Minerals like calcite are known for their uniaxial properties under certain conditions.",
            "sent3": "The uniaxial crystal seemed to wink at her as she turned it in the sunlight.",
            "sent4": "His uniaxial personality was as clear and transparent as the crystal he studied.",
            "sent5": "The uniaxial crystal acted like a prism, splitting light into its colorful components."
        },
        {
            "definition": "Pertaining to a material that exhibits different properties along different axes.",
            "pos": "adjective",
            "sent1": "The uniaxial material showed varying strengths when pulled in different directions.",
            "sent2": "Engineers tested the uniaxial properties of the material to ensure its durability.",
            "sent3": "The uniaxial fabric felt smooth vertically but rough horizontally, confusing the tailor.",
            "sent4": "Her uniaxial approach to the project highlighted its strengths and weaknesses.",
            "sent5": "The uniaxial nature of the metal made it ideal for applications requiring specific directional properties."
        }
    ]
}