{
    "term": "unionisations",
    "meanings": [
        {
            "definition": "The act of forming or joining a labor union.",
            "pos": "noun",
            "sent1": "Many workers participated in unionisations to improve their working conditions.",
            "sent2": "Unionisations have helped employees negotiate better pay and benefits.",
            "sent3": "The unionisations at the factory made the managers rethink their policies.",
            "sent4": "In the world of labor, unionisations are like seeds that grow into strong trees of worker solidarity.",
            "sent5": "The history books are filled with stories of successful unionisations that changed the course of labor rights."
        },
        {
            "definition": "The process of organizing workers into a union.",
            "pos": "noun",
            "sent1": "Effective unionisations require clear communication among workers.",
            "sent2": "During unionisations, workers come together to fight for their rights.",
            "sent3": "The unionisations in the company cafeteria were surprisingly well-organized.",
            "sent4": "Unionisations are like puzzle pieces fitting together to create a stronger workforce.",
            "sent5": "The success of unionisations depends on the unity and determination of the workers involved."
        },
        {
            "definition": "The action of promoting or advocating for union membership.",
            "pos": "noun",
            "sent1": "The unionisations by the labor leaders inspired many workers to join.",
            "sent2": "Unionisations play a crucial role in ensuring fair treatment of employees.",
            "sent3": "The comedian's jokes about unionisations brought laughter to the audience.",
            "sent4": "In the battle for workers' rights, unionisations are the warriors on the front lines.",
            "sent5": "The posters promoting unionisations were plastered all over the workplace, urging workers to unite."
        }
    ]
}