{
    "term": "union",
    "meanings": [
        {
            "definition": "The action or fact of joining or being joined.",
            "pos": "noun",
            "sent1": "The school celebrated the union of two clubs to create a new organization.",
            "sent2": "The union of the two rivers formed a larger waterway.",
            "sent3": "The puzzle pieces were so happy to finally achieve union and complete the picture.",
            "sent4": "The union of flavors in the dish created a unique and delicious taste.",
            "sent5": "The union of the two families brought joy and harmony to all."
        },
        {
            "definition": "A group of workers formed to protect their rights and interests.",
            "pos": "noun",
            "sent1": "The union negotiated better wages for the employees.",
            "sent2": "The workers decided to join the union to have a stronger voice.",
            "sent3": "The union picnic was filled with laughter and camaraderie.",
            "sent4": "The union of workers stood strong against unfair labor practices.",
            "sent5": "The union members supported each other like a big family."
        },
        {
            "definition": "The state of being united or joined together.",
            "pos": "noun",
            "sent1": "The union of the two countries brought peace to the region.",
            "sent2": "The union of efforts led to a successful outcome.",
            "sent3": "The union of flavors in the recipe created a delightful dish.",
            "sent4": "The union of voices in the choir produced a beautiful harmony.",
            "sent5": "The union of hearts symbolized their everlasting love."
        },
        {
            "definition": "A political unit consisting of two or more states.",
            "pos": "noun",
            "sent1": "The European Union promotes cooperation among member countries.",
            "sent2": "The union of states formed a stronger alliance for defense.",
            "sent3": "The union of nations in the treaty was a significant diplomatic achievement.",
            "sent4": "The union of territories under one government brought stability to the region.",
            "sent5": "The union of provinces created a more cohesive and powerful nation."
        }
    ]
}