{
    "term": "unliving",
    "meanings": [
        {
            "definition": "Not alive; dead.",
            "pos": "adjective",
            "sent1": "The unliving tree stood tall in the forest, its branches bare and motionless.",
            "sent2": "The graveyard was filled with unliving bodies, each resting peacefully in their final slumber.",
            "sent3": "The unliving flowers in the vase never needed watering, making them the easiest to care for.",
            "sent4": "The unliving silence of the abandoned house echoed through the empty rooms, haunting anyone who dared to enter.",
            "sent5": "The unliving rock formations in the desert seemed to hold ancient secrets within their cold, hard surfaces."
        },
        {
            "definition": "Lacking life or vitality; inactive.",
            "pos": "adjective",
            "sent1": "The unliving computer screen displayed nothing but a blank, black image.",
            "sent2": "The unliving room felt cold and unwelcoming, devoid of any signs of life.",
            "sent3": "The unliving clock on the wall ticked no more, frozen in time like a forgotten memory.",
            "sent4": "The unliving city streets at night seemed eerie, with no one around to bring them to life.",
            "sent5": "The unliving battery had no energy left, unable to power any device it was inserted into."
        },
        {
            "definition": "Not possessing life or consciousness.",
            "pos": "adjective",
            "sent1": "The unliving robot moved mechanically, following its programmed instructions without emotion.",
            "sent2": "The unliving doll sat on the shelf, its glassy eyes staring blankly ahead.",
            "sent3": "The unliving puppet on strings danced clumsily, controlled by an unseen hand above.",
            "sent4": "The unliving stars in the night sky twinkled brightly, unaware of the world below.",
            "sent5": "The unliving statue in the park seemed frozen in time, capturing a moment of stillness forever."
        }
    ]
}