{
    "term": "unloaded",
    "meanings": [
        {
            "definition": "Not loaded or carrying a load.",
            "pos": "adjective",
            "sent1": "The truck was completely unloaded after delivering the packages.",
            "sent2": "The shelves were empty as all the boxes had been unloaded.",
            "sent3": "The backpack felt so light and unloaded, it was like floating on air.",
            "sent4": "Her mind felt unloaded after a relaxing day at the beach.",
            "sent5": "The room looked spacious and unloaded without any furniture."
        },
        {
            "definition": "Not charged with ammunition.",
            "pos": "adjective",
            "sent1": "The soldier made sure his gun was unloaded before cleaning it.",
            "sent2": "The police officer checked that the firearm was unloaded before storing it.",
            "sent3": "The toy gun was safely unloaded to prevent any accidents.",
            "sent4": "The hunter always double-checks that his rifle is unloaded when not in use.",
            "sent5": "The shooting range required all weapons to be unloaded when not in use."
        },
        {
            "definition": "Not burdened or encumbered.",
            "pos": "adjective",
            "sent1": "She felt so much lighter and unloaded after letting go of unnecessary worries.",
            "sent2": "The hiker felt free and unloaded with just a small backpack on his shoulders.",
            "sent3": "His heart felt unloaded when he forgave those who had wronged him.",
            "sent4": "The burden of guilt was finally unloaded from his conscience.",
            "sent5": "The feeling of relief was immense as he unloaded the weight of expectations."
        },
        {
            "definition": "Not emotionally or mentally strained.",
            "pos": "adjective",
            "sent1": "After a long meditation session, she felt completely unloaded and at peace.",
            "sent2": "He needed some time alone to feel emotionally unloaded and balanced again.",
            "sent3": "The comedy show left everyone feeling emotionally unloaded from all the laughter.",
            "sent4": "Her mind felt unloaded after a good night's sleep.",
            "sent5": "The therapy session helped him feel emotionally unloaded from past traumas."
        }
    ]
}