{
    "term": "unmask",
    "meanings": [
        {
            "definition": "To reveal the true identity or nature of something or someone.",
            "pos": "verb",
            "sent1": "During the play, the detective will unmask the villain and reveal their true identity.",
            "sent2": "The superhero decided to unmask the criminal and show everyone who they really were.",
            "sent3": "At the masquerade party, the magician tried to unmask the mysterious guest, but it turned out to be a prank.",
            "sent4": "The investigation would unmask the corruption within the company, exposing the true nature of their operations.",
            "sent5": "The documentary aimed to unmask the myths surrounding the ancient artifact, revealing its true history."
        },
        {
            "definition": "To remove a mask from someone's face.",
            "pos": "verb",
            "sent1": "The nurse gently unmasked the patient after the surgery to help them breathe more easily.",
            "sent2": "In the theater production, the actor had to unmask the lead actress as part of the dramatic scene.",
            "sent3": "During the costume party, the mischievous child tried to unmask their friend, but it only led to laughter.",
            "sent4": "The magician's trick involved unmasking the volunteer from the audience to reveal a surprising twist.",
            "sent5": "The makeup artist carefully unmasked the model after the photo shoot, revealing their natural beauty."
        },
        {
            "definition": "To expose or uncover something hidden or secret.",
            "pos": "verb",
            "sent1": "The journalist worked tirelessly to unmask the corruption within the government and bring it to light.",
            "sent2": "The whistleblower decided to unmask the illegal activities of the company, risking their own safety.",
            "sent3": "The treasure hunters hoped to unmask the location of the hidden treasure using the ancient map.",
            "sent4": "The investigation aimed to unmask the truth behind the mysterious disappearances in the small town.",
            "sent5": "The documentary crew set out to unmask the conspiracy theories surrounding the famous celebrity's disappearance."
        }
    ]
}