{
    "term": "unostentatiously",
    "meanings": [
        {
            "definition": "In a manner that is not showy or flashy.",
            "pos": "adverb",
            "sent1": "She walked unostentatiously into the room, trying not to attract any attention.",
            "sent2": "He unostentatiously paid for his coffee and quietly left the cafe.",
            "sent3": "The magician unostentatiously pulled a rabbit out of his hat, surprising everyone.",
            "sent4": "The sun set unostentatiously behind the mountains, painting the sky in soft hues.",
            "sent5": "The flowers bloomed unostentatiously in the garden, adding a subtle beauty to the surroundings."
        },
        {
            "definition": "Without drawing attention to oneself.",
            "pos": "adverb",
            "sent1": "She unostentatiously slipped out of the party without saying goodbye to anyone.",
            "sent2": "The spy moved unostentatiously through the crowded market, blending in with the crowd.",
            "sent3": "The cat unostentatiously knocked over a vase, pretending to be innocent.",
            "sent4": "The wind whispered unostentatiously through the trees, creating a peaceful atmosphere.",
            "sent5": "The student unostentatiously handed in her test, hoping not to be noticed by the teacher."
        },
        {
            "definition": "Modestly or discreetly.",
            "pos": "adverb",
            "sent1": "He unostentatiously donated to charity without seeking recognition for his generosity.",
            "sent2": "She unostentatiously declined the offer, not wanting to make a fuss.",
            "sent3": "The squirrel unostentatiously gathered nuts for the winter, storing them in a hidden spot.",
            "sent4": "The old clock ticked unostentatiously in the corner, marking the passage of time quietly.",
            "sent5": "The artist unostentatiously signed his painting in a small corner, letting the art speak for itself."
        }
    ]
}