{
    "term": "unpeople",
    "meanings": [
        {
            "definition": "To dehumanize or disregard a group of people.",
            "pos": "verb",
            "sent1": "The dictator's regime would unpeople those who dared to speak against him.",
            "sent2": "It is cruel to unpeople others just because they have different beliefs.",
            "sent3": "The villain in the story tried to unpeople the heroes, but justice prevailed in the end.",
            "sent4": "Her hurtful words seemed to unpeople the entire community, leaving a sense of emptiness.",
            "sent5": "The propaganda was designed to unpeople the minority group, making them seem less than human."
        },
        {
            "definition": "People who are marginalized or excluded from society.",
            "pos": "noun",
            "sent1": "The unpeople in the slums struggle to have their voices heard.",
            "sent2": "Society often overlooks the unpeople, failing to address their needs.",
            "sent3": "The unpeople banded together to create a support network for each other.",
            "sent4": "In the story, the protagonist fights for the rights of the unpeople, advocating for equality.",
            "sent5": "The unpeople faced discrimination daily, yet they remained resilient and hopeful for change."
        },
        {
            "definition": "The act of erasing or ignoring the existence of a group of individuals.",
            "pos": "noun",
            "sent1": "The unpeople phenomenon is a tragic reality in many parts of the world.",
            "sent2": "Governments sometimes engage in unpeople to maintain power and control.",
            "sent3": "The comedy skit humorously portrayed the absurdity of unpeople in a lighthearted manner.",
            "sent4": "The artist's painting symbolized the consequences of unpeople on society as a whole.",
            "sent5": "The documentary shed light on the devastating effects of unpeople on the forgotten population."
        }
    ]
}