{
    "term": "unraised",
    "meanings": [
        {
            "definition": "Not lifted or elevated.",
            "pos": "adjective",
            "sent1": "The unraised platform remained at the same level as the ground.",
            "sent2": "The unraised hands of the child showed no sign of wanting to be picked up.",
            "sent3": "The unraised balloon refused to soar high in the sky, much to the disappointment of the children.",
            "sent4": "Her unraised spirits seemed to weigh her down, like an anchor holding a ship in place.",
            "sent5": "The unraised flag fluttered limply in the breeze, symbolizing defeat."
        },
        {
            "definition": "Not increased in amount or level.",
            "pos": "adjective",
            "sent1": "The unraised prices at the store made shopping more affordable for everyone.",
            "sent2": "His unraised voice remained calm and steady throughout the conversation.",
            "sent3": "The unraised temperature outside made it a perfect day for a picnic.",
            "sent4": "Her unraised excitement about the party was evident in her relaxed demeanor.",
            "sent5": "The unraised water level in the river indicated a dry spell in the region."
        },
        {
            "definition": "Not brought up or nurtured.",
            "pos": "adjective",
            "sent1": "The unraised plant struggled to survive without proper care.",
            "sent2": "His unraised concerns about his health were finally addressed by the doctor.",
            "sent3": "The unraised puppy looked lost and in need of love and attention.",
            "sent4": "Her unraised talents remained hidden until she discovered her passion for painting.",
            "sent5": "The unraised child longed for the affection and guidance of a caring adult."
        },
        {
            "definition": "Not built or constructed.",
            "pos": "adjective",
            "sent1": "The unraised house stood as a reminder of the family's financial struggles.",
            "sent2": "The unraised bridge left the riverbanks disconnected for months.",
            "sent3": "The unraised sandcastle crumbled under the weight of the incoming tide.",
            "sent4": "Her unraised hopes for a new school building were dashed by budget cuts.",
            "sent5": "The unraised tower in the city skyline was a stark contrast to the modern skyscrapers around it."
        }
    ]
}