{
    "term": "unreasonableness",
    "meanings": [
        {
            "definition": "Not guided by or based on good sense; irrational.",
            "pos": "adjective",
            "sent1": "Her decision to wear a winter coat in the scorching summer heat was an unreasonableness choice.",
            "sent2": "The teacher found the student's unreasonableness behavior disruptive to the class.",
            "sent3": "It was quite an unreasonableness idea to try to fit a watermelon into a small lunchbox.",
            "sent4": "The unreasonableness demands of the spoiled child left the parents feeling overwhelmed.",
            "sent5": "The unreasonableness request for a raise without any justification was quickly denied."
        },
        {
            "definition": "Exceeding the limits of reason or moderation; excessive.",
            "pos": "adjective",
            "sent1": "The unreasonableness amount of candy he ate made him feel sick.",
            "sent2": "Her unreasonableness spending habits left her with a mountain of debt.",
            "sent3": "The unreasonableness number of balloons in the room made it hard to see the ceiling.",
            "sent4": "The unreasonableness noise coming from the party next door kept us awake all night.",
            "sent5": "The unreasonableness length of the meeting made everyone restless and eager to leave."
        },
        {
            "definition": "Not in accordance with practical realities or the facts; impractical.",
            "pos": "adjective",
            "sent1": "His unreasonableness plan to build a castle made of ice in the desert was doomed to fail.",
            "sent2": "The unreasonableness idea of traveling to Mars without any training seemed absurd.",
            "sent3": "Trying to fit an elephant into a small car would be an unreasonableness task.",
            "sent4": "The unreasonableness belief that pigs could fly led to many failed experiments.",
            "sent5": "The unreasonableness suggestion to swim across the ocean was quickly dismissed as impossible."
        }
    ]
}