{
    "term": "unsex",
    "meanings": [
        {
            "definition": "Deprive of qualities traditionally associated with one's sex.",
            "pos": "verb",
            "sent1": "The magician used a spell to unsex the brave knight, making him lose his masculinity.",
            "sent2": "The scientist wanted to unsex the experiment by removing any gender bias from the study.",
            "sent3": "The comedy show joked about a potion that could unsex anyone, leading to hilarious misunderstandings.",
            "sent4": "The artist's painting seemed to unsex the figure, blurring the lines between male and female characteristics.",
            "sent5": "In the fairy tale, the wicked witch tried to unsex the princess, hoping to erase her femininity completely."
        },
        {
            "definition": "To remove the characteristics of being male or female from someone.",
            "pos": "verb",
            "sent1": "The futuristic machine could unsex individuals, making them appear gender-neutral.",
            "sent2": "The society aimed to unsex its members, encouraging equality regardless of gender.",
            "sent3": "The comedy sketch featured a hilarious mix-up where a potion accidentally unsexed the entire town.",
            "sent4": "The novel's dystopian world sought to unsex its citizens, erasing all gender distinctions.",
            "sent5": "The magical mirror had the power to unsex anyone who gazed into it, leaving them without gender identity."
        },
        {
            "definition": "To make someone genderless.",
            "pos": "verb",
            "sent1": "The alien race had the ability to unsex individuals, creating a society without gender roles.",
            "sent2": "The futuristic technology could unsex a person, removing all signs of male or female.",
            "sent3": "The comedy movie featured a quirky character who accidentally unsexed themselves with a magical potion.",
            "sent4": "The philosophical debate centered around the idea of unsexing humanity to achieve true equality.",
            "sent5": "The mysterious ritual was said to unsex those who participated, transcending the limitations of gender."
        }
    ]
}