{
    "term": "unselfishnesses",
    "meanings": [
        {
            "definition": "The quality or characteristic of being unselfish.",
            "pos": "noun",
            "sent1": "Her unselfishnesses always shone through in her actions.",
            "sent2": "The community admired his unselfishnesses when he donated all his winnings to charity.",
            "sent3": "His unselfishnesses were so extreme that he gave away his last piece of cake without hesitation.",
            "sent4": "The unselfishnesses of the volunteers were like a bright light in the darkness of selfishness.",
            "sent5": "The unselfishnesses of the firefighter saved many lives during the fire."
        },
        {
            "definition": "The act of putting others' needs before one's own.",
            "pos": "noun",
            "sent1": "Putting others' needs before your own shows true unselfishnesses.",
            "sent2": "Her unselfishnesses were evident when she gave up her seat for an elderly person on the bus.",
            "sent3": "The unselfishnesses of the siblings led to a hilarious argument over who should take the last cookie.",
            "sent4": "His unselfishnesses were a shield that protected him from the arrows of selfishness.",
            "sent5": "The unselfishnesses of the teacher inspired her students to be kind to one another."
        },
        {
            "definition": "Showing concern for the welfare of others.",
            "pos": "adjective",
            "sent1": "Her unselfishnesses actions always made a positive impact on those around her.",
            "sent2": "The unselfishnesses doctor worked tirelessly to ensure all patients received proper care.",
            "sent3": "The unselfishnesses attitude of the dog towards the cat was both heartwarming and amusing.",
            "sent4": "His unselfishnesses nature was a beacon of light in a world filled with selfishness.",
            "sent5": "The unselfishnesses behavior of the team members led to a successful and harmonious project completion."
        }
    ]
}