{
    "term": "unshot",
    "meanings": [
        {
            "definition": "Not fired or discharged",
            "pos": "adjective",
            "sent1": "The unshot gun remained silent in the corner.",
            "sent2": "The unshot arrow lay untouched in the quiver.",
            "sent3": "The unshot cannon seemed to be pouting in the battlefield.",
            "sent4": "The unshot fireworks were like unfulfilled promises in the night sky.",
            "sent5": "The unshot rifle felt neglected among the other weapons."
        },
        {
            "definition": "Not hit by a shot",
            "pos": "adjective",
            "sent1": "The unshot target stood pristine in the shooting range.",
            "sent2": "The unshot soldier emerged unscathed from the battle.",
            "sent3": "The unshot vase looked smug among the shattered ones.",
            "sent4": "The unshot wall was a blank canvas in the paintball arena.",
            "sent5": "The unshot armor gleamed untouched in the sunlight."
        },
        {
            "definition": "Not having taken a shot",
            "pos": "adjective",
            "sent1": "The unshot player waited patiently for their turn in the game.",
            "sent2": "The unshot archer carefully aimed at the target.",
            "sent3": "The unshot cookie jar seemed to be teasing the hungry children.",
            "sent4": "The unshot opportunity knocked softly on the door.",
            "sent5": "The unshot camera captured the perfect moment."
        },
        {
            "definition": "Not having been shot at",
            "pos": "adjective",
            "sent1": "The unshot soldier felt lucky amidst the chaos of battle.",
            "sent2": "The unshot building remained untouched by the enemy's fire.",
            "sent3": "The unshot cat strutted confidently through the battlefield.",
            "sent4": "The unshot fortress stood strong against the enemy's attacks.",
            "sent5": "The unshot shield protected its bearer from harm."
        }
    ]
}