{
    "term": "unsustainable",
    "meanings": [
        {
            "definition": "Not able to be maintained or continued",
            "pos": "adjective",
            "sent1": "The old bridge was unsafe and unsustainable for heavy trucks.",
            "sent2": "The company realized that their current business model was unsustainable in the long run.",
            "sent3": "Trying to juggle too many tasks at once proved to be unsustainable for the tired student.",
            "sent4": "The fragile ecosystem was like a house of cards, easily collapsing under unsustainable human activities.",
            "sent5": "The leaky boat was an unsustainable vessel for a long voyage across the ocean."
        },
        {
            "definition": "Unable to be supported or upheld",
            "pos": "adjective",
            "sent1": "The flimsy excuse was unsustainable under closer scrutiny.",
            "sent2": "The weight of the evidence made the defendant's alibi unsustainable.",
            "sent3": "The idea of a perpetual motion machine was amusingly unsustainable in the eyes of the scientists.",
            "sent4": "The fragile peace agreement was like a tightrope walker on an unsustainable wire.",
            "sent5": "The makeshift shelter was an unsustainable refuge in the storm."
        },
        {
            "definition": "Lacking the ability to be sustained or endured",
            "pos": "adjective",
            "sent1": "The unbearable heat made the outdoor event unsustainable for the attendees.",
            "sent2": "The constant noise pollution in the area was unsustainable for the residents.",
            "sent3": "The comedian's attempt at a never-ending joke was met with unsustainable laughter from the audience.",
            "sent4": "The relationship was like a fragile glass sculpture, easily shattered by unsustainable conflicts.",
            "sent5": "The thin ice was an unsustainable surface for skating in the warm weather."
        }
    ]
}