{
    "term": "untouched",
    "meanings": [
        {
            "definition": "Not handled or disturbed",
            "pos": "adjective",
            "sent1": "The ancient artifact remained untouched in the museum.",
            "sent2": "The fresh snow on the mountain was untouched by human footprints.",
            "sent3": "The cake was left untouched on the kitchen counter, tempting the mischievous cat.",
            "sent4": "Her heart remained untouched by the harsh words, like a fortress against negativity.",
            "sent5": "The abandoned house stood untouched, a silent witness to the passage of time."
        },
        {
            "definition": "Not affected or altered",
            "pos": "adjective",
            "sent1": "The original painting remained untouched by restoration efforts.",
            "sent2": "The beauty of the landscape was untouched by the passing storm.",
            "sent3": "The plan was left untouched, waiting for the perfect moment to be revealed.",
            "sent4": "Her resolve remained untouched by doubt, shining brightly in her eyes.",
            "sent5": "The memory of that day stayed untouched in his mind, crystal clear and vivid."
        },
        {
            "definition": "Not consumed or used",
            "pos": "adjective",
            "sent1": "The untouched food in the fridge went bad after days of neglect.",
            "sent2": "The treasure chest lay untouched for centuries, waiting to be discovered.",
            "sent3": "The opportunity remained untouched, like a hidden gem waiting to be found.",
            "sent4": "His potential remained untouched, like a dormant volcano ready to erupt.",
            "sent5": "The secret remained untouched, buried deep within the old diary."
        },
        {
            "definition": "Not influenced or impacted",
            "pos": "adjective",
            "sent1": "Her decision to travel solo was left untouched by others' opinions.",
            "sent2": "The purity of her intentions remained untouched by the chaos around her.",
            "sent3": "The rumor about him was left untouched, causing laughter among friends.",
            "sent4": "His spirit remained untouched by the hardships, shining brightly in adversity.",
            "sent5": "The bond between them stayed untouched, a rare and precious connection."
        }
    ]
}