{
    "term": "unto",
    "meanings": [
        {
            "definition": "To or toward (a point or limit)",
            "pos": "verb",
            "sent1": "She walked unto the edge of the cliff.",
            "sent2": "He ran unto the finish line with determination.",
            "sent3": "The cat leaped unto the table to catch the mouse.",
            "sent4": "The river flowed unto the sea, never looking back.",
            "sent5": "The sun sets unto the horizon, painting the sky in hues of orange and pink."
        },
        {
            "definition": "In the direction of",
            "pos": "preposition",
            "sent1": "The bird flew unto the tree for shelter.",
            "sent2": "The children ran unto the playground, laughing joyfully.",
            "sent3": "The squirrel scurried unto the nut hidden in the grass.",
            "sent4": "The wind whispered secrets unto the leaves, rustling them gently.",
            "sent5": "The river flowed unto the mountains, carving a path through the rocks."
        },
        {
            "definition": "In relation to",
            "pos": "preposition",
            "sent1": "Her success was unto her hard work and dedication.",
            "sent2": "His happiness was unto the love of his family.",
            "sent3": "The flower bloomed unto the care of the gardener.",
            "sent4": "The painting was unto the artist's emotions and experiences.",
            "sent5": "The growth of the plant was unto the sunlight and water it received."
        },
        {
            "definition": "Until",
            "pos": "conjunction",
            "sent1": "She waited unto the stars came out in the night sky.",
            "sent2": "He practiced the piano unto the late hours of the evening.",
            "sent3": "The cat purred unto the food bowl was empty.",
            "sent4": "The child played outside unto the streetlights turned on.",
            "sent5": "The flowers bloomed unto the first frost of winter."
        },
        {
            "definition": "For the purpose of",
            "pos": "preposition",
            "sent1": "He worked hard unto achieving his dream of becoming a doctor.",
            "sent2": "She saved money unto buying a new car.",
            "sent3": "The team trained diligently unto winning the championship.",
            "sent4": "The chef prepared the meal unto satisfying the hungry customers.",
            "sent5": "The students studied diligently unto passing the exam."
        }
    ]
}