{
    "term": "unweathered",
    "meanings": [
        {
            "definition": "Not affected by weather.",
            "pos": "adjective",
            "sent1": "The unweathered rock looked exactly the same as it did when it was first found.",
            "sent2": "The scientist studied the unweathered metal to understand its properties better.",
            "sent3": "The unweathered statue seemed to mock the elements, standing strong and untouched.",
            "sent4": "Her unweathered determination to succeed was like a shield against any obstacles.",
            "sent5": "The unweathered paint on the old house made it stand out among the weathered buildings."
        },
        {
            "definition": "Not worn or eroded by weather.",
            "pos": "adjective",
            "sent1": "The unweathered path through the forest was smooth and untouched.",
            "sent2": "The unweathered fence still looked brand new despite being outside for years.",
            "sent3": "The unweathered shoes seemed to dance happily in the rain, unaffected by the wet ground.",
            "sent4": "His unweathered smile brightened up even the gloomiest of days.",
            "sent5": "The unweathered roof of the barn gleamed under the sun, a stark contrast to the rusty tools inside."
        },
        {
            "definition": "Not changed or altered by weather.",
            "pos": "adjective",
            "sent1": "The unweathered document retained its original ink color, unaffected by time.",
            "sent2": "The unweathered fabric felt soft and new, despite being stored in the attic for years.",
            "sent3": "The unweathered clock seemed to defy the passing of time, ticking steadily without a pause.",
            "sent4": "Her unweathered memories of childhood were like precious treasures, untouched by the years.",
            "sent5": "The unweathered flag fluttered proudly in the breeze, a symbol of unwavering strength and resilience."
        }
    ]
}