{
    "term": "upby",
    "meanings": [
        {
            "definition": "Near or close to",
            "pos": "preposition",
            "sent1": "The cat sat upby the window, watching the birds outside.",
            "sent2": "I live upby the park, so I can walk there easily.",
            "sent3": "The squirrel upby the tree chattered away, trying to get attention.",
            "sent4": "Her house is upby the hill, overlooking the entire town.",
            "sent5": "The playground upby the school is always filled with laughter."
        },
        {
            "definition": "In the vicinity of",
            "pos": "preposition",
            "sent1": "We set upby the lake for a picnic on a sunny day.",
            "sent2": "The store is upby the mall, so we can walk there.",
            "sent3": "The kids played upby the playground, enjoying the sunny weather.",
            "sent4": "The hotel is upby the beach, offering a beautiful view of the ocean.",
            "sent5": "The cafe upby the library serves delicious coffee and pastries."
        },
        {
            "definition": "Alongside or next to",
            "pos": "preposition",
            "sent1": "The dog walked upby its owner, wagging its tail happily.",
            "sent2": "The bike was parked upby the tree, waiting for its rider.",
            "sent3": "The cat napped upby the fireplace, enjoying the warmth.",
            "sent4": "The children sat upby each other, sharing stories and laughter.",
            "sent5": "The flowers bloomed upby the fence, adding color to the garden."
        },
        {
            "definition": "In the presence of",
            "pos": "preposition",
            "sent1": "She felt nervous upby the famous actor at the event.",
            "sent2": "The students behaved well upby the principal during the assembly.",
            "sent3": "The cat performed tricks upby the audience, earning applause.",
            "sent4": "The chef cooked upby the food critic, hoping for a positive review.",
            "sent5": "The singer sang upby the crowd, mesmerizing everyone with her voice."
        },
        {
            "definition": "In the company of",
            "pos": "preposition",
            "sent1": "He walked upby his friends, chatting and laughing along the way.",
            "sent2": "She sat upby her siblings during the family gathering.",
            "sent3": "The puppy played upby the other dogs in the park.",
            "sent4": "The artist painted upby fellow painters, sharing techniques.",
            "sent5": "They traveled upby a group of tourists, exploring the city together."
        }
    ]
}