{
    "term": "uplit",
    "meanings": [
        {
            "definition": "Illuminated from below.",
            "pos": "adjective",
            "sent1": "The uplit stage made the performers' shadows dance.",
            "sent2": "The uplit room had a mysterious glow.",
            "sent3": "The uplit garden gnome looked like it was telling secrets.",
            "sent4": "The uplit fountain transformed the park into a magical wonderland.",
            "sent5": "The uplit pathway guided us through the dark forest."
        },
        {
            "definition": "A piece of writing that is uplifting or inspirational.",
            "pos": "noun",
            "sent1": "She found solace in reading an uplit novel.",
            "sent2": "The bookstore had a section dedicated to uplit books.",
            "sent3": "The uplit story brought tears of joy to her eyes.",
            "sent4": "His words were like an uplit beacon in the storm of life.",
            "sent5": "The uplit tale left a lasting impact on the readers."
        },
        {
            "definition": "To illuminate from below.",
            "pos": "verb",
            "sent1": "He carefully uplit the painting to highlight its details.",
            "sent2": "The artist decided to uplit the sculpture for a dramatic effect.",
            "sent3": "The mischievous cat uplit its face with a flashlight.",
            "sent4": "The city skyline was uplit by the setting sun.",
            "sent5": "She uplit the stage, creating a magical ambiance."
        },
        {
            "definition": "A type of lighting that shines upwards.",
            "pos": "noun",
            "sent1": "The uplit fixture added a touch of elegance to the room.",
            "sent2": "The garden was adorned with beautiful uplit lanterns.",
            "sent3": "The uplit chandelier cast intricate shadows on the ceiling.",
            "sent4": "The uplit pathway illuminated the night garden.",
            "sent5": "The uplit sign guided visitors to the entrance."
        }
    ]
}