{
    "term": "upraises",
    "meanings": [
        {
            "definition": "To lift or elevate",
            "pos": "verb",
            "sent1": "She upraises her hand to ask a question in class.",
            "sent2": "He upraises the flag every morning as a sign of respect.",
            "sent3": "The superhero upraises the fallen bridge with ease.",
            "sent4": "His kindness upraises the spirits of those around him.",
            "sent5": "The hot air balloon upraises slowly into the sky, offering a breathtaking view."
        },
        {
            "definition": "To raise to a higher position or level",
            "pos": "verb",
            "sent1": "The crane upraises the heavy load effortlessly.",
            "sent2": "She upraises her performance to impress her boss.",
            "sent3": "The magician upraises the rabbit out of the hat to the audience's amazement.",
            "sent4": "The new law upraises the standards of safety in the workplace.",
            "sent5": "The elevator upraises passengers to the top floor of the building smoothly."
        },
        {
            "definition": "To inspire or encourage",
            "pos": "verb",
            "sent1": "Her speech upraises the crowd to take action for change.",
            "sent2": "The coach upraises the team with a motivational pep talk.",
            "sent3": "The puppy's playful antics upraise laughter in the room.",
            "sent4": "The beautiful artwork upraises creativity in the viewers.",
            "sent5": "The teacher's dedication upraises a love for learning in her students."
        },
        {
            "definition": "To promote or support",
            "pos": "verb",
            "sent1": "The company upraises its products through effective marketing strategies.",
            "sent2": "He upraises his friend's talent by sharing it with others.",
            "sent3": "The community upraises each other during times of need.",
            "sent4": "The charity event upraises funds for a good cause.",
            "sent5": "The mentor upraises the mentee's skills through guidance and encouragement."
        },
        {
            "definition": "To construct or build up",
            "pos": "verb",
            "sent1": "The workers upraise the walls of the new building.",
            "sent2": "She upraises her savings for a future investment.",
            "sent3": "The chef upraises the flavors of the dish with a secret ingredient.",
            "sent4": "The artist upraises a masterpiece from a blank canvas.",
            "sent5": "The gardener upraises a beautiful garden from a patch of soil."
        }
    ]
}