{
    "term": "upraising",
    "meanings": [
        {
            "definition": "To lift or move something upwards.",
            "pos": "verb",
            "sent1": "She carefully upraised the heavy box onto the shelf.",
            "sent2": "The construction workers upraised the beam to the top floor.",
            "sent3": "The magician upraised the rabbit, making the audience gasp in surprise.",
            "sent4": "His words upraised her spirits like a warm hug on a cold day.",
            "sent5": "The sun slowly upraising over the horizon painted the sky in hues of pink and orange."
        },
        {
            "definition": "To raise or elevate something.",
            "pos": "verb",
            "sent1": "He upraised his hand to ask a question in class.",
            "sent2": "The chef upraised the cake carefully to avoid any accidents.",
            "sent3": "The cat upraised its tail in excitement when it saw its favorite toy.",
            "sent4": "Her laughter upraised the mood of the entire room.",
            "sent5": "The hot air balloon upraising into the sky was a breathtaking sight."
        },
        {
            "definition": "The act of raising or lifting something up.",
            "pos": "noun",
            "sent1": "The upraising of the flag signaled the start of the event.",
            "sent2": "The upraising of the curtain revealed the grand stage.",
            "sent3": "The sudden upraising of prices left customers shocked.",
            "sent4": "The upraising of voices in the choir filled the church with beautiful music.",
            "sent5": "The upraising of the trophy marked their victory in the competition."
        },
        {
            "definition": "To bring up or nurture something.",
            "pos": "verb",
            "sent1": "She upraised her children with love and care.",
            "sent2": "The teacher upraised the students' interest in science with exciting experiments.",
            "sent3": "The gardener upraised the plants, making the garden look vibrant.",
            "sent4": "His mentorship upraised many young talents in the industry.",
            "sent5": "The community upraising awareness about environmental issues."
        },
        {
            "definition": "A movement or action of raising or lifting up.",
            "pos": "noun",
            "sent1": "The upraising of the drawbridge allowed the ship to pass through.",
            "sent2": "The upraising of hands in the crowd showed overwhelming support for the idea.",
            "sent3": "The sudden upraising of the balloon startled the children.",
            "sent4": "The upraising of the stage platform revealed the hidden dancers.",
            "sent5": "The upraising of the flag at the ceremony symbolized unity and pride."
        }
    ]
}