{
    "term": "uprear",
    "meanings": [
        {
            "definition": "To lift or raise up",
            "pos": "verb",
            "sent1": "The strong man could easily uprear heavy weights.",
            "sent2": "She used a crane to uprear the beam into place.",
            "sent3": "Trying to uprear a mountain would be quite a challenge!",
            "sent4": "His determination upreared him above all obstacles.",
            "sent5": "The sun upreared itself over the horizon, bringing a new day."
        },
        {
            "definition": "To build or construct",
            "pos": "verb",
            "sent1": "The workers will uprear the new skyscraper in record time.",
            "sent2": "They plan to uprear a bridge across the river.",
            "sent3": "Let's uprear a fort out of pillows and blankets!",
            "sent4": "The city skyline uprears with each new building.",
            "sent5": "The children upreared a sandcastle on the beach."
        },
        {
            "definition": "To nurture or support",
            "pos": "verb",
            "sent1": "She always upreared her friends in times of need.",
            "sent2": "The community came together to uprear the orphaned children.",
            "sent3": "The teacher upreared her students with kindness and encouragement.",
            "sent4": "Love and care uprear a strong family bond.",
            "sent5": "The mentor upreared the young artist's talent with guidance."
        },
        {
            "definition": "To stand upright or rise to a vertical position",
            "pos": "verb",
            "sent1": "The horse upreared on its hind legs in excitement.",
            "sent2": "The sapling upreared towards the sunlight.",
            "sent3": "The robot upreared itself after being activated.",
            "sent4": "The flag upreared proudly in the wind.",
            "sent5": "The mountain upreared majestically against the sky."
        }
    ]
}