{
    "term": "uprears",
    "meanings": [
        {
            "definition": "To raise or lift up",
            "pos": "verb",
            "sent1": "She uprears her hand to ask a question in class.",
            "sent2": "The crane uprears the heavy steel beam effortlessly.",
            "sent3": "The magician uprears the rabbit out of the hat with a flourish.",
            "sent4": "Hope uprears like a beacon in the darkest of times.",
            "sent5": "The sun uprears over the horizon, bringing a new day."
        },
        {
            "definition": "To erect or build up",
            "pos": "verb",
            "sent1": "The workers upreared the scaffolding for the construction project.",
            "sent2": "They upreared a magnificent statue in the town square.",
            "sent3": "The children upreared a sandcastle on the beach with great enthusiasm.",
            "sent4": "The artist uprears a masterpiece from mere brushstrokes.",
            "sent5": "The city skyline uprears against the backdrop of the setting sun."
        },
        {
            "definition": "To elevate or uplift",
            "pos": "verb",
            "sent1": "Kind words can uprears someone's spirits during tough times.",
            "sent2": "The inspiring speech uprears the morale of the team.",
            "sent3": "Laughter has the power to uprears the mood in any situation.",
            "sent4": "Music has the ability to uprears the soul and evoke deep emotions.",
            "sent5": "A helping hand can uprears someone to reach new heights."
        },
        {
            "definition": "To rear or nurture",
            "pos": "verb",
            "sent1": "The parents lovingly upreared their children with care and guidance.",
            "sent2": "She uprears a garden full of colorful flowers and lush greenery.",
            "sent3": "The teacher uprears a classroom of eager young minds.",
            "sent4": "Community support is crucial to uprearing a strong and resilient society.",
            "sent5": "Nature uprears its young with instinctual care and protection."
        },
        {
            "definition": "To establish or set up",
            "pos": "verb",
            "sent1": "They upreared a new business in the heart of the city.",
            "sent2": "The pioneers upreared a settlement in the uncharted wilderness.",
            "sent3": "The team uprears a plan for the upcoming project.",
            "sent4": "The organization uprears a foundation to support those in need.",
            "sent5": "Innovation uprears progress and drives change in society."
        }
    ]
}