{
    "term": "upright",
    "meanings": [
        {
            "definition": "Vertical, straight up",
            "pos": "adjective",
            "sent1": "The tree grew upright towards the sky.",
            "sent2": "She stood upright with her shoulders back.",
            "sent3": "The pencil tried to stand upright on its eraser.",
            "sent4": "The skyscraper stood upright like a giant in the city skyline.",
            "sent5": "The flagpole stood upright, waving proudly in the wind."
        },
        {
            "definition": "Honest, honorable",
            "pos": "adjective",
            "sent1": "He was known for his upright character and integrity.",
            "sent2": "The judge made an upright decision based on the evidence.",
            "sent3": "The upright student returned the lost wallet to its owner.",
            "sent4": "Her upright actions spoke volumes about her true nature.",
            "sent5": "The upright citizen always followed the rules and did what was right."
        },
        {
            "definition": "In a vertical position",
            "pos": "adverb",
            "sent1": "The pole stood upright in the ground.",
            "sent2": "She held the vase upright to prevent it from falling.",
            "sent3": "The cat tried to balance upright on the narrow ledge.",
            "sent4": "The tower stretched upright into the clear blue sky.",
            "sent5": "The candle burned upright, casting a warm glow in the room."
        },
        {
            "definition": "Morally correct or virtuous",
            "pos": "adjective",
            "sent1": "His upright behavior earned him the respect of his peers.",
            "sent2": "She always tried to make the most upright choices in life.",
            "sent3": "The upright decision was clear despite the temptation.",
            "sent4": "The upright path may be challenging, but it is worth it in the end.",
            "sent5": "Living an upright life brings inner peace and contentment."
        }
    ]
}