{
    "term": "upsets",
    "meanings": [
        {
            "definition": "Disturbance of the mind or emotions",
            "pos": "noun",
            "sent1": "The loud noise outside caused an upset in her mind.",
            "sent2": "The movie's sad ending was an emotional upset for many viewers.",
            "sent3": "His pet's silly antics always bring a smile even during an emotional upset.",
            "sent4": "The sudden news of the accident was an emotional upset that shook her to the core.",
            "sent5": "The vivid dream left a lasting emotional upset that lingered throughout the day."
        },
        {
            "definition": "An unexpected defeat or victory",
            "pos": "noun",
            "sent1": "The underdog team's win was a surprising upset for everyone.",
            "sent2": "The chess match ended in a shocking upset for the champion.",
            "sent3": "The cat's victory over the mouse was a playful upset in their usual game.",
            "sent4": "The unexpected upset in the election results left many in disbelief.",
            "sent5": "The upset in the final round changed the entire outcome of the competition."
        },
        {
            "definition": "To disturb mentally or emotionally",
            "pos": "verb",
            "sent1": "The scary movie tends to upset her easily.",
            "sent2": "Loud noises can upset some people's peace of mind.",
            "sent3": "His constant teasing may upset her, but it's all in good fun.",
            "sent4": "The news of the accident upset her so much that she couldn't focus.",
            "sent5": "The unexpected call upset her plans for the evening."
        },
        {
            "definition": "To defeat unexpectedly",
            "pos": "verb",
            "sent1": "The rookie team managed to upset the champions in a thrilling match.",
            "sent2": "The underdog's victory upset the predictions of many sports analysts.",
            "sent3": "Her clever strategy upset his usual tactics and led to her victory.",
            "sent4": "The sudden change in weather conditions upset the favored team's chances.",
            "sent5": "The unexpected move upset his opponent's balance and secured his win."
        },
        {
            "definition": "To overturn or capsize",
            "pos": "verb",
            "sent1": "The storm's strong winds could upset the small boat on the lake.",
            "sent2": "Be careful not to upset the fragile balance of the delicate vase.",
            "sent3": "The mischievous cat tried to upset the neatly arranged books on the shelf.",
            "sent4": "The sudden wave threatened to upset the canoe in the river.",
            "sent5": "The heavy load on one side could upset the stability of the truck during the turn."
        }
    ]
}