{
    "term": "upstir",
    "meanings": [
        {
            "definition": "To rouse or stir up",
            "pos": "verb",
            "sent1": "The loud noise outside my window did upstir my curiosity.",
            "sent2": "She upstirred the sleeping dog by calling its name.",
            "sent3": "The magician's disappearing act upstirred the audience's amazement.",
            "sent4": "His speech upstirred a wave of emotions in the crowd.",
            "sent5": "The smell of freshly baked cookies upstirred memories of childhood."
        },
        {
            "definition": "To cause a commotion or disturbance",
            "pos": "verb",
            "sent1": "The unexpected announcement upstirred chaos in the classroom.",
            "sent2": "The protest upstirred the peaceful atmosphere of the park.",
            "sent3": "The mischievous squirrel upstirred laughter among the onlookers.",
            "sent4": "Her arrival upstirred a whirlwind of gossip in the office.",
            "sent5": "The thunderstorm upstirred fear in the hearts of the villagers."
        },
        {
            "definition": "To incite or provoke",
            "pos": "verb",
            "sent1": "His words upstirred anger in his opponent.",
            "sent2": "The controversial article upstirred a debate among readers.",
            "sent3": "The mischievous child upstirred his sister by hiding her toys.",
            "sent4": "The political scandal upstirred protests across the country.",
            "sent5": "The coach's pep talk upstirred determination in the team."
        },
        {
            "definition": "To awaken or arouse from sleep",
            "pos": "verb",
            "sent1": "The alarm clock upstirred me from my deep slumber.",
            "sent2": "The chirping birds upstirred the entire household at dawn.",
            "sent3": "The smell of bacon upstirred my brother from his nap.",
            "sent4": "The loud thunder upstirred the baby from her nap.",
            "sent5": "The urgent phone call upstirred me from my afternoon nap."
        }
    ]
}