{
    "term": "upstay",
    "meanings": [
        {
            "definition": "To remain in a place or position",
            "pos": "verb",
            "sent1": "I will upstay here until you return.",
            "sent2": "The cat likes to upstay on the windowsill.",
            "sent3": "The sleepy dog decided to upstay on the cozy rug.",
            "sent4": "Her determination to upstay in her job was admirable.",
            "sent5": "The old tree seemed to upstay in the forest forever."
        },
        {
            "definition": "To support or sustain",
            "pos": "verb",
            "sent1": "The strong pillars upstay the roof of the house.",
            "sent2": "A good friend will always upstay you during tough times.",
            "sent3": "The superhero's cape seemed to upstay him as he flew through the sky.",
            "sent4": "Kind words can upstay someone's spirits.",
            "sent5": "The safety net upstays the trapeze artist during the performance."
        },
        {
            "definition": "To delay or hinder",
            "pos": "verb",
            "sent1": "The traffic jam upstayed our journey to the beach.",
            "sent2": "Please don't upstay the progress of the project.",
            "sent3": "The mischievous squirrel tried to upstay the gardener by stealing his tools.",
            "sent4": "The storm upstayed the flight schedule at the airport.",
            "sent5": "His forgetfulness upstayed the completion of the task."
        },
        {
            "definition": "To endure or persist",
            "pos": "verb",
            "sent1": "Despite the challenges, she managed to upstay and succeed.",
            "sent2": "The old building upstays through many years of wear and tear.",
            "sent3": "The little plant upstayed through the harsh winter and bloomed in spring.",
            "sent4": "Their friendship upstayed despite the distance between them.",
            "sent5": "The athlete's determination to upstay until the finish line paid off."
        }
    ]
}