{
    "term": "uptowners",
    "meanings": [
        {
            "definition": "Residents of a city or town who live in the northern or more affluent part.",
            "pos": "noun",
            "sent1": "The uptowners gathered for a community meeting in the upscale neighborhood.",
            "sent2": "Many uptowners enjoy the amenities of the affluent part of the city.",
            "sent3": "The uptowners decided to have a fancy picnic in the northern part of town.",
            "sent4": "She felt like an uptowner when she visited the wealthy neighborhood.",
            "sent5": "The uptowners' houses were grand and elegant, standing out from the rest of the city."
        },
        {
            "definition": "A group of people who live in the upper part of a city or town.",
            "pos": "noun",
            "sent1": "The uptowners organized a charity event for the upper part of the city.",
            "sent2": "We often see uptowners shopping in the upper part of town.",
            "sent3": "The uptowners had a friendly competition to see who could climb the highest in the upper part of the city.",
            "sent4": "Their unity made them stand out like a group of uptowners in the upper part of town.",
            "sent5": "The uptowners enjoyed the view from the upper part of the city, feeling like they were on top of the world."
        },
        {
            "definition": "People who reside in the more upscale or wealthy neighborhoods of a city.",
            "pos": "noun",
            "sent1": "The uptowners in the wealthy neighborhoods often host elegant parties.",
            "sent2": "Many uptowners prefer the upscale lifestyle of the city.",
            "sent3": "The uptowners joked that they were too fancy for the regular part of town.",
            "sent4": "She felt like an uptowner when she strolled through the wealthy neighborhoods.",
            "sent5": "The uptowners' luxurious cars lined the streets of the upscale neighborhoods, showcasing their wealth."
        }
    ]
}