{
    "term": "urials",
    "meanings": [
        {
            "definition": "A wild sheep of western Asia.",
            "pos": "noun",
            "sent1": "In the zoo, visitors were excited to see the urials roaming freely in their habitat.",
            "sent2": "The urials grazed peacefully in the meadow, their fluffy coats shining in the sun.",
            "sent3": "The mischievous children pretended to be urials, playfully butting heads with each other.",
            "sent4": "The urials moved gracefully across the rocky terrain, their hooves barely making a sound.",
            "sent5": "The sight of the majestic urials against the backdrop of the mountains was truly breathtaking."
        },
        {
            "definition": "A type of sheep with long, curved horns.",
            "pos": "noun",
            "sent1": "The urials with their impressive horns stood out among the other sheep in the flock.",
            "sent2": "Shepherd's often rely on the urials' keen sense of smell to navigate through rough terrain.",
            "sent3": "The children were fascinated by the urials' horns, imagining them as magical unicorn horns.",
            "sent4": "The urials' horns gleamed in the sunlight, a symbol of strength and resilience.",
            "sent5": "The sound of the urials' horns clashing echoed through the valley, a natural symphony."
        },
        {
            "definition": "The plural form of 'urial', referring to multiple wild sheep of western Asia.",
            "pos": "noun",
            "sent1": "The researchers observed a herd of urials moving together in perfect harmony.",
            "sent2": "Local legends often speak of the urials as guardians of the mountain passes.",
            "sent3": "The villagers celebrated the return of the urials, a sign of prosperity and good fortune.",
            "sent4": "The nomads followed the trail of the urials, hoping it would lead them to water.",
            "sent5": "The presence of the urials signaled the changing of the seasons, a natural cycle of life."
        }
    ]
}