{
    "term": "urinative",
    "meanings": [
        {
            "definition": "Of or relating to the act of urinating.",
            "pos": "adjective",
            "sent1": "The doctor explained that the urinative process is essential for removing waste from the body.",
            "sent2": "The urinative function of the bladder helps maintain the body's balance of fluids.",
            "sent3": "After drinking a lot of water, the urinative sensation became quite urgent during the movie.",
            "sent4": "The sound of rain on the roof had a urinative effect on my bladder, making me rush to the bathroom.",
            "sent5": "The toddler's curiosity about the urinative process led to many questions about why we need to pee."
        },
        {
            "definition": "Having the ability to urinate.",
            "pos": "adjective",
            "sent1": "As a healthy adult, having a urinative system that functions properly is crucial.",
            "sent2": "The cat's urinative instincts kicked in when it found a suitable spot in the garden.",
            "sent3": "The dog's urinative prowess was evident as it marked its territory around the neighborhood.",
            "sent4": "The athlete's well-hydrated body had a strong urinative capacity during the race.",
            "sent5": "The baby's developing urinative control was a source of pride for the parents."
        },
        {
            "definition": "Causing the urge to urinate.",
            "pos": "adjective",
            "sent1": "The cold weather had a urinative effect on everyone, making them want to use the restroom more frequently.",
            "sent2": "The diuretic tea had a strong urinative impact on the person who drank it.",
            "sent3": "The comedian's jokes were so funny that they had a urinative influence on the audience.",
            "sent4": "The suspenseful movie created a urinative tension in the viewers, making them squirm in their seats.",
            "sent5": "The spicy food had a surprisingly urinative result, causing the group to take multiple bathroom breaks."
        }
    ]
}