{
    "term": "uroliths",
    "meanings": [
        {
            "definition": "Solid concretions in the urinary tract.",
            "pos": "noun",
            "sent1": "The doctor found uroliths in the patient's urinary tract during the examination.",
            "sent2": "Uroliths can cause blockages in the urinary system if not treated promptly.",
            "sent3": "The uroliths in the urinary tract decided to throw a party, but it was a real 'blockage'!",
            "sent4": "The uroliths in the urinary tract were like stubborn little pebbles, refusing to budge.",
            "sent5": "The image of uroliths in the urinary tract stuck in my mind like tiny rocks in a stream."
        },
        {
            "definition": "A calculus in the urinary system.",
            "pos": "noun",
            "sent1": "The surgeon successfully removed the uroliths from the patient's urinary system.",
            "sent2": "Passing uroliths can be extremely painful for individuals with urinary system issues.",
            "sent3": "The uroliths in the urinary system were so heavy, they considered starting a rock band.",
            "sent4": "The uroliths in the urinary system felt like burdensome weights dragging the body down.",
            "sent5": "The presence of uroliths in the urinary system felt like carrying around a bag of rocks all day."
        },
        {
            "definition": "A stone in the urinary tract.",
            "pos": "noun",
            "sent1": "The ultrasound revealed the presence of uroliths, or stones, in the urinary tract.",
            "sent2": "Uroliths, if left untreated, can lead to serious complications in the urinary tract.",
            "sent3": "The uroliths in the urinary tract were so smooth, they decided to enter a 'rock-skipping' competition.",
            "sent4": "The uroliths in the urinary tract felt like unwelcome guests overstaying their welcome.",
            "sent5": "The pain caused by uroliths in the urinary tract was as sharp as stepping on a stone barefoot."
        }
    ]
}