{
    "term": "urubu",
    "meanings": [
        {
            "definition": "A large New World vulture with a bare head and mainly black plumage.",
            "pos": "noun",
            "sent1": "The urubu soared high in the sky, searching for its next meal.",
            "sent2": "I spotted an urubu perched on a tree branch, its black feathers shining in the sun.",
            "sent3": "The urubu joked with the other birds about its bald head, claiming it made it more aerodynamic.",
            "sent4": "Like an urubu, he circled the problem, waiting for the perfect moment to strike.",
            "sent5": "The urubu's piercing gaze made it a fearsome sight in the jungle."
        },
        {
            "definition": "A scavenger bird found in South America.",
            "pos": "noun",
            "sent1": "The urubu feasted on the remains of a fallen animal, its sharp beak tearing into the flesh.",
            "sent2": "In the dense rainforest, the urubu played a crucial role in cleaning up the ecosystem.",
            "sent3": "The urubu chuckled to itself as it found a hidden stash of food left behind by other animals.",
            "sent4": "The urubu's presence was a reminder of the cycle of life and death in the wild.",
            "sent5": "With a graceful swoop, the urubu claimed its share of the feast."
        },
        {
            "definition": "A type of vulture known for its scavenging habits.",
            "pos": "noun",
            "sent1": "The urubu's keen sense of smell led it to a fresh carcass in the forest.",
            "sent2": "As the sun set, the urubu joined other scavengers in the evening hunt for food.",
            "sent3": "The urubu teased the younger birds with tales of its daring exploits in finding meals.",
            "sent4": "In the world of vultures, the urubu was respected for its efficiency in finding food.",
            "sent5": "The urubu's distinctive call echoed through the valley, signaling the start of the feeding frenzy."
        }
    ]
}