{
    "term": "urva",
    "meanings": [
        {
            "definition": "A type of plant or herb",
            "pos": "noun",
            "sent1": "The urva in the garden is blooming beautifully.",
            "sent2": "I planted some urva in my backyard for its medicinal properties.",
            "sent3": "The mischievous squirrel kept nibbling on the urva leaves.",
            "sent4": "The urva swayed gently in the breeze, like a dancer in the wind.",
            "sent5": "The fragrance of the urva filled the air with a sense of calm."
        },
        {
            "definition": "A type of animal",
            "pos": "noun",
            "sent1": "The zoo had a rare urva on display.",
            "sent2": "The urva in the forest moved gracefully through the trees.",
            "sent3": "The children giggled as the playful urva chased its tail.",
            "sent4": "The urva's eyes gleamed like precious gems in the sunlight.",
            "sent5": "The urva's fur was soft to the touch, like a fluffy cloud."
        },
        {
            "definition": "A type of food or dish",
            "pos": "noun",
            "sent1": "The chef prepared a delicious urva stew for dinner.",
            "sent2": "I tried a new recipe for urva salad and it was surprisingly tasty.",
            "sent3": "The urva pie was a hit at the potluck party.",
            "sent4": "The aroma of the urva dish filled the kitchen with warmth.",
            "sent5": "The urva soup warmed me up on a cold winter evening."
        },
        {
            "definition": "A type of color or shade",
            "pos": "noun",
            "sent1": "The walls of the room were painted in a soothing urva hue.",
            "sent2": "She chose a dress in a vibrant urva color for the party.",
            "sent3": "The artist mixed different shades to create the perfect urva tone.",
            "sent4": "The sky turned a beautiful urva as the sun set.",
            "sent5": "The flowers in the garden bloomed in various shades of urva."
        }
    ]
}