{
    "term": "utter",
    "meanings": [
        {
            "definition": "Complete; absolute",
            "pos": "adjective",
            "sent1": "The silence in the library was utter.",
            "sent2": "Her joy upon winning the game was utter.",
            "sent3": "The cat's utter laziness made everyone laugh.",
            "sent4": "The storm caused utter chaos in the city.",
            "sent5": "The darkness of the cave was utter and all-encompassing."
        },
        {
            "definition": "To speak or articulate",
            "pos": "verb",
            "sent1": "She would utter her thoughts without hesitation.",
            "sent2": "He could utter the lyrics flawlessly.",
            "sent3": "The parrot would utter words in different accents.",
            "sent4": "His speech would utter wisdom beyond his years.",
            "sent5": "The teacher would utter instructions clearly and patiently."
        },
        {
            "definition": "To emit or release",
            "pos": "verb",
            "sent1": "The volcano would utter smoke and ash.",
            "sent2": "The machine would utter strange noises when turned on.",
            "sent3": "The kettle would utter a loud whistle when boiling.",
            "sent4": "The forest would utter sounds of wildlife at night.",
            "sent5": "The old house would utter creaks and groans in the wind."
        },
        {
            "definition": "To express or communicate",
            "pos": "verb",
            "sent1": "She would utter her love for him every day.",
            "sent2": "He would utter his gratitude with a smile.",
            "sent3": "The painting would utter emotions of sorrow and joy.",
            "sent4": "The music would utter feelings of nostalgia and longing.",
            "sent5": "The poem would utter beauty in every line."
        },
        {
            "definition": "To make known or declare",
            "pos": "verb",
            "sent1": "The king would utter his commands to the kingdom.",
            "sent2": "The judge would utter the verdict with authority.",
            "sent3": "The news anchor would utter the headlines with confidence.",
            "sent4": "The prophet would utter prophecies of the future.",
            "sent5": "The leader would utter promises of a better tomorrow."
        }
    ]
}