{
    "term": "vain",
    "meanings": [
        {
            "definition": "Having or showing an excessively high opinion of one's appearance, abilities, or worth.",
            "pos": "adjective",
            "sent1": "She was so vain that she spent hours admiring herself in the mirror.",
            "sent2": "His vain attempts to impress others with his wealth only made him look foolish.",
            "sent3": "In a vain attempt to be the center of attention, she wore a bright pink hat to the party.",
            "sent4": "His vanity was like a mirror that reflected only his own image, blinding him to the world around him.",
            "sent5": "The peacock's vain display of its colorful feathers captivated all who saw it."
        },
        {
            "definition": "Producing no result; useless.",
            "pos": "adjective",
            "sent1": "The broken clock was vain, unable to tell the correct time.",
            "sent2": "His efforts to fix the leaky faucet were in vain as it continued to drip.",
            "sent3": "Trying to teach a cat to bark is as vain as trying to make a rock float in water.",
            "sent4": "Her words fell on his ears like vain echoes, leaving no impact on his decision.",
            "sent5": "The wilted flower's vain attempt to bloom again showed the cycle of life."
        },
        {
            "definition": "Without success or a desired outcome.",
            "pos": "adverb",
            "sent1": "He searched vainly for his lost keys in the dark room.",
            "sent2": "She called out vainly for help, but no one heard her cries in the deserted alley.",
            "sent3": "The squirrel tried to reach the bird feeder in vain, unable to overcome the obstacle.",
            "sent4": "The waves crashed against the shore vainly, unable to erode the solid rock.",
            "sent5": "The wind howled vainly through the empty streets, carrying whispers of forgotten tales."
        }
    ]
}