{
    "term": "vaingloriousness",
    "meanings": [
        {
            "definition": "Excessive pride in one's own achievements or qualities.",
            "pos": "noun",
            "sent1": "Her vaingloriousness was evident in the way she constantly boasted about her accomplishments.",
            "sent2": "His vaingloriousness often rubbed people the wrong way as he always talked about himself.",
            "sent3": "Despite his vaingloriousness, he couldn't even tie his own shoelaces without help.",
            "sent4": "The king's vaingloriousness blinded him to the needs of his people.",
            "sent5": "The sheer vaingloriousness of her demeanor made her hard to be around."
        },
        {
            "definition": "The quality of being excessively proud or boastful.",
            "pos": "noun",
            "sent1": "The vaingloriousness of his speeches made everyone roll their eyes.",
            "sent2": "She couldn't stand his vaingloriousness and often avoided him at parties.",
            "sent3": "His vaingloriousness reached new heights when he claimed he could fly.",
            "sent4": "The vaingloriousness of the peacock as it strutted around the garden was comical.",
            "sent5": "The vaingloriousness of the villain made him a memorable character in the story."
        },
        {
            "definition": "A feeling of excessive pride or self-importance.",
            "pos": "noun",
            "sent1": "Her vaingloriousness made her believe she was better than everyone else.",
            "sent2": "The team captain's vaingloriousness often led to conflicts within the group.",
            "sent3": "Despite his vaingloriousness, he was actually quite insecure deep down.",
            "sent4": "The vaingloriousness of the celebrity was shattered when they faced criticism for their actions.",
            "sent5": "The vaingloriousness of the politician was evident in every speech they gave."
        }
    ]
}