{
    "term": "vampier",
    "meanings": [
        {
            "definition": "A person who preys ruthlessly on others.",
            "pos": "noun",
            "sent1": "The vampier in the story scared everyone with their dark cloak and sharp fangs.",
            "sent2": "The town was terrified of the vampier who lurked in the shadows at night.",
            "sent3": "The vampier at the Halloween party was actually just a friend in a spooky costume.",
            "sent4": "The ruthless business executive was like a vampier, draining the company of its resources.",
            "sent5": "The legend of the vampier spread through the village, causing fear and suspicion."
        },
        {
            "definition": "To act as a vampire.",
            "pos": "verb",
            "sent1": "She decided to vampier her way through the costume party, pretending to drink fake blood.",
            "sent2": "The actor had to vampier convincingly on stage, making the audience believe in the supernatural.",
            "sent3": "He tried to vampier his way into getting extra candy by wearing a cape and fake fangs.",
            "sent4": "The politician tried to vampier his opponent's popularity by spreading false rumors.",
            "sent5": "The children loved to vampier during playtime, pretending to have special powers like vampires."
        },
        {
            "definition": "Of or relating to vampires.",
            "pos": "adjective",
            "sent1": "The vampier movie was full of spooky scenes and mysterious characters.",
            "sent2": "She decorated her room with vampier-themed posters and dark velvet curtains.",
            "sent3": "The vampier costume contest at the school was a big hit with the students.",
            "sent4": "The old castle had a vampier vibe, with its crumbling walls and eerie atmosphere.",
            "sent5": "The book had a vampier cover, featuring a blood-red moon and silhouetted bats."
        }
    ]
}