{
    "term": "vampirism",
    "meanings": [
        {
            "definition": "The act or practice of preying upon or exploiting others for personal gain.",
            "pos": "noun",
            "sent1": "His vampirism in the office was evident as he took credit for his colleague's ideas.",
            "sent2": "The businessman's vampirism was revealed when he manipulated the market for his benefit.",
            "sent3": "At the charity event, his vampirism for attention led him to tell exaggerated stories.",
            "sent4": "Her vampirism for power was so strong that she would do anything to climb the corporate ladder.",
            "sent5": "The politician's vampirism for votes made him promise unrealistic changes to the public."
        },
        {
            "definition": "The belief in or obsession with vampires.",
            "pos": "noun",
            "sent1": "Her vampirism made her collect every vampire-themed book she could find.",
            "sent2": "The movie's popularity showed the widespread vampirism among the audience.",
            "sent3": "His vampirism for vampire lore led him to dress up as one for Halloween.",
            "sent4": "In her room, posters of vampires covered the walls, showcasing her vampirism.",
            "sent5": "The bookstore's section dedicated to vampires catered to the community's vampirism."
        },
        {
            "definition": "The condition or behavior of exhibiting vampire-like traits or characteristics.",
            "pos": "noun",
            "sent1": "The actor's vampirism on stage captivated the audience with his mysterious aura.",
            "sent2": "Her vampirism, with her pale skin and dark clothing, made her stand out in the crowd.",
            "sent3": "During the costume party, his vampirism with fake fangs amused everyone around.",
            "sent4": "The cat's vampirism, with its sharp teeth and nocturnal habits, earned it the nickname 'Count Whiskers'.",
            "sent5": "The old mansion's vampirism, with its eerie atmosphere, sparked rumors of supernatural occurrences."
        }
    ]
}