{
    "term": "vanity",
    "meanings": [
        {
            "definition": "Excessive pride in one's appearance or achievements.",
            "pos": "noun",
            "sent1": "Her vanity led her to spend hours in front of the mirror, admiring herself.",
            "sent2": "His vanity was evident in the way he constantly talked about his accomplishments.",
            "sent3": "Despite her vanity, she tripped over her own feet while trying to show off.",
            "sent4": "His vanity was like a shiny mirror, reflecting only his own image back at him.",
            "sent5": "The vanity of the peacock was unmatched, as it strutted proudly with its colorful feathers."
        },
        {
            "definition": "A dressing table.",
            "pos": "noun",
            "sent1": "She sat at her vanity, carefully applying makeup before the party.",
            "sent2": "The antique vanity in the corner of the room held her collection of perfumes.",
            "sent3": "The vanity in the bedroom was cluttered with jewelry and hair accessories.",
            "sent4": "The vanity's mirror reflected her smiling face as she got ready for the day.",
            "sent5": "The little girl loved playing dress-up at the vanity, pretending to be a princess."
        },
        {
            "definition": "The quality of being worthless or futile.",
            "pos": "noun",
            "sent1": "His pursuit of fame turned out to be nothing but vanity in the end.",
            "sent2": "The project was doomed to fail due to its inherent vanity.",
            "sent3": "The vanity of his efforts became clear when no one showed up to his event.",
            "sent4": "She realized the vanity of her dreams when they never came to fruition.",
            "sent5": "The vanity of his excuses only served to highlight his lack of responsibility."
        },
        {
            "definition": "A bathroom cabinet that houses a sink and plumbing.",
            "pos": "noun",
            "sent1": "The new vanity in the bathroom added a touch of elegance to the space.",
            "sent2": "She stored all her toiletries neatly in the drawers of the vanity.",
            "sent3": "The plumber installed the vanity with precision, ensuring it was level.",
            "sent4": "The vanity in the guest bathroom had a marble countertop and a modern design.",
            "sent5": "The vanity's mirror reflected the light, making the bathroom appear brighter."
        }
    ]
}