{
    "term": "vanners",
    "meanings": [
        {
            "definition": "A person who operates a vanning machine.",
            "pos": "noun",
            "sent1": "The vanners worked diligently to operate the vanning machine.",
            "sent2": "The skilled vanners efficiently ran the vanning machine at the factory.",
            "sent3": "The vanners joked about having a race with the vanning machine.",
            "sent4": "In the noisy factory, the vanners were like conductors of the vanning machine orchestra.",
            "sent5": "The vanners' job of operating the vanning machine required precision and focus."
        },
        {
            "definition": "A machine used for separating materials by means of a current of air.",
            "pos": "noun",
            "sent1": "The vanning machine separated the materials with a strong gust of air.",
            "sent2": "At the recycling plant, the vanning machine efficiently sorted the materials.",
            "sent3": "The vanning machine seemed to have a playful personality, blowing the materials around.",
            "sent4": "The vanning machine roared like a mighty wind, sorting the materials effortlessly.",
            "sent5": "The vanning machine's air currents danced gracefully, separating the materials with ease."
        },
        {
            "definition": "Plural form of vanner, referring to multiple individuals who operate vanning machines.",
            "pos": "noun",
            "sent1": "The team of vanners collaborated to operate the vanning machines smoothly.",
            "sent2": "In the workshop, the vanners synchronized their work on the vanning machines.",
            "sent3": "The vanners formed a club where they discussed their experiences with vanning machines.",
            "sent4": "The vanners were like a well-oiled machine themselves, working in harmony with the vanning machines.",
            "sent5": "The group of vanners shared a strong bond while operating the vanning machines together."
        }
    ]
}