{
    "term": "vanner",
    "meanings": [
        {
            "definition": "A person who operates a vanning machine.",
            "pos": "noun",
            "sent1": "The skilled vanner carefully controlled the machine.",
            "sent2": "The vanner at the mine was responsible for operating the equipment.",
            "sent3": "The vanner joked that they were the 'wizard of the vanning machine'.",
            "sent4": "She was a vanner, weaving through the minerals like a conductor of a symphony.",
            "sent5": "The vanner's job was to sift through the rocks and find the treasures hidden within."
        },
        {
            "definition": "A machine used for separating valuable minerals from waste material.",
            "pos": "noun",
            "sent1": "The vanning machine efficiently sorted the minerals.",
            "sent2": "Miners relied on the vanner to extract precious metals.",
            "sent3": "The vanning machine hummed as it worked its magic on the rocks.",
            "sent4": "The vanning machine was like a treasure hunter in the earth's depths.",
            "sent5": "With a loud clang, the vanner started its task of separating the valuable minerals."
        },
        {
            "definition": "To operate a vanning machine.",
            "pos": "verb",
            "sent1": "Miners vannered diligently to extract the gold.",
            "sent2": "She learned how to vanner under the guidance of the expert.",
            "sent3": "The team vannered together to process the minerals efficiently.",
            "sent4": "He vannered with precision, ensuring no valuable minerals were wasted.",
            "sent5": "Vannering requires patience and attention to detail to be successful."
        },
        {
            "definition": "The act of separating valuable minerals from waste material using a vanning machine.",
            "pos": "noun",
            "sent1": "The vanning process was crucial for the mine's success.",
            "sent2": "Miners relied on the vanning for their livelihood.",
            "sent3": "The vanning operation ran smoothly, yielding valuable results.",
            "sent4": "The vanning work was like a dance of separating the good from the bad.",
            "sent5": "The vanning task required skill and precision to extract the valuable minerals."
        }
    ]
}