{
    "term": "vapourer",
    "meanings": [
        {
            "definition": "A person or thing that produces vapour.",
            "pos": "noun",
            "sent1": "The factory's chimney was a constant vapourer, releasing smoke into the air.",
            "sent2": "The humidifier in the room acted as a vapourer, adding moisture to the air.",
            "sent3": "The teapot was a little vapourer, puffing out steam as the water boiled.",
            "sent4": "The volcano was a massive vapourer, spewing ash and smoke into the sky.",
            "sent5": "The steam engine was a powerful vapourer, chugging along the tracks with clouds of steam billowing behind."
        },
        {
            "definition": "A type of moth that belongs to the family Erebidae.",
            "pos": "noun",
            "sent1": "The vapourer moth fluttered gracefully in the moonlight, its wings shimmering.",
            "sent2": "The children were excited to spot a vapourer moth during their nature walk.",
            "sent3": "The vapourer moth seemed to dance in the air, its delicate wings catching the light.",
            "sent4": "The vapourer moth's wings resembled wisps of smoke, blending into the night sky.",
            "sent5": "The vapourer moth's flight was silent and elegant, a ghostly presence in the darkness."
        },
        {
            "definition": "A device used for producing vapour, such as an electronic cigarette.",
            "pos": "noun",
            "sent1": "The vapourer emitted a fragrant mist, creating a relaxing atmosphere in the room.",
            "sent2": "She enjoyed using the vapourer to create different scents in her home.",
            "sent3": "The vapourer hummed softly as it released a cloud of scented vapour into the air.",
            "sent4": "The vapourer was a popular choice for those looking to quit smoking traditional cigarettes.",
            "sent5": "The vapourer's sleek design made it a stylish accessory as well as a practical device."
        }
    ]
}