{
    "term": "vapor",
    "meanings": [
        {
            "definition": "A substance in the gaseous state at a temperature below its critical temperature",
            "pos": "noun",
            "sent1": "The warm vapor rose from the teapot.",
            "sent2": "The steam from the hot shower filled the bathroom with vapor.",
            "sent3": "The vapor danced in the air like tiny clouds.",
            "sent4": "The vapor of excitement filled the room as the surprise was revealed.",
            "sent5": "The vapor of morning mist enveloped the valley in a soft embrace."
        },
        {
            "definition": "A visible suspension in the air of particles of some substance",
            "pos": "noun",
            "sent1": "The vapor of smoke lingered in the room after the fire.",
            "sent2": "The factory emitted vapor into the atmosphere, causing pollution.",
            "sent3": "The vapor of flour created a cloud when the bag accidentally burst open.",
            "sent4": "The vapor of pollen made her sneeze uncontrollably.",
            "sent5": "The vapor of perfume wafted through the room, leaving a pleasant scent behind."
        },
        {
            "definition": "",
            "pos": "adjective",
            "sent1": "The foggy morning created a vapor atmosphere.",
            "sent2": "The vapor trail left by the airplane slowly dissipated in the sky.",
            "sent3": "The vapor effect on the mirror made it difficult to see clearly.",
            "sent4": "The vapor barrier protected the delicate equipment from moisture.",
            "sent5": "The vapor screen added a mysterious touch to the magician's performance."
        },
        {
            "definition": "te: 'vapor' can also be used as a verb, but the most common definitions are as a noun)",
            "pos": "noun",
            "sent1": "The vapor of the boiling water filled the kitchen with warmth.",
            "sent2": "The vapor of the essential oils diffused a calming scent in the room.",
            "sent3": "The vapor of flour created a cloud when the bag accidentally burst open.",
            "sent4": "The vapor of excitement filled the room as the surprise was revealed.",
            "sent5": "The vapor of morning mist enveloped the valley in a soft embrace."
        }
    ]
}