{
    "term": "vasoconstrictions",
    "meanings": [
        {
            "definition": "The narrowing of blood vessels",
            "pos": "noun",
            "sent1": "Vasoconstrictions can lead to increased blood pressure.",
            "sent2": "Doctors use medications to treat vasoconstrictions in patients with high blood pressure.",
            "sent3": "The tiny vasoconstrictions in the blood vessels made it difficult for the blood to flow smoothly.",
            "sent4": "During times of stress, it feels like vasoconstrictions are squeezing the life out of me.",
            "sent5": "The vasoconstrictions in the narrow alley made it hard for two people to walk side by side."
        },
        {
            "definition": "The process of constricting blood vessels",
            "pos": "noun",
            "sent1": "Understanding the mechanism behind vasoconstrictions is crucial for medical students.",
            "sent2": "The body's response to cold weather includes vasoconstrictions to conserve heat.",
            "sent3": "The vasoconstrictions in the blood vessels were like tiny muscles flexing and relaxing.",
            "sent4": "Her anger caused vasoconstrictions in her veins, making her face turn red.",
            "sent5": "The vasoconstrictions during the experiment were clearly visible under the microscope."
        },
        {
            "definition": "A decrease in the diameter of blood vessels",
            "pos": "noun",
            "sent1": "The doctor explained that vasoconstrictions can reduce blood flow to certain areas.",
            "sent2": "Vasoconstrictions in the brain can lead to severe headaches.",
            "sent3": "The vasoconstrictions in the blood vessels were like traffic jams during rush hour.",
            "sent4": "Her anxiety caused vasoconstrictions, making her hands feel cold and numb.",
            "sent5": "The vasoconstrictions in the capillaries restricted the flow of oxygen to the tissues."
        }
    ]
}