{
    "term": "vaulting",
    "meanings": [
        {
            "definition": "To leap or spring over something",
            "pos": "verb",
            "sent1": "The cat was vaulting over the fence.",
            "sent2": "The athlete practiced vaulting over hurdles.",
            "sent3": "The squirrel was vaulting over imaginary obstacles in the park.",
            "sent4": "Her determination was like vaulting over walls of doubt.",
            "sent5": "The kangaroo's effortless vaulting amazed the spectators."
        },
        {
            "definition": "A room or space with an arched roof",
            "pos": "noun",
            "sent1": "The cathedral had a grand vaulting with intricate designs.",
            "sent2": "The castle's vaulting added a sense of grandeur to the hall.",
            "sent3": "The vaulting in the library made it feel like a magical place.",
            "sent4": "The vaulting of the tunnel created a sense of endless space.",
            "sent5": "The vaulting in the palace was adorned with beautiful paintings."
        },
        {
            "definition": "The act of constructing a vault or arch",
            "pos": "noun",
            "sent1": "The masons were skilled in vaulting the ceilings of old buildings.",
            "sent2": "The architect oversaw the vaulting of the new museum.",
            "sent3": "The students learned about the history of vaulting in architecture.",
            "sent4": "The vaulting of the bridge was a marvel of engineering.",
            "sent5": "The vaulting of the colosseum showcased the craftsmanship of ancient builders."
        },
        {
            "definition": "Exaggerated or extravagant in style or manner",
            "pos": "adjective",
            "sent1": "Her vaulting jewelry caught everyone's attention.",
            "sent2": "The party was filled with vaulting decorations and bright colors.",
            "sent3": "His vaulting stories always entertained the children.",
            "sent4": "The singer's vaulting performance left the audience in awe.",
            "sent5": "The room was decorated in a vaulting style, with gold accents and luxurious fabrics."
        }
    ]
}