{
    "term": "vavasories",
    "meanings": [
        {
            "definition": "extravagant or ostentatious things",
            "pos": "noun",
            "sent1": "The room was filled with vavasories like golden statues and crystal chandeliers.",
            "sent2": "She loved to surround herself with vavasories, from designer handbags to luxurious perfumes.",
            "sent3": "At the party, the host's vavasories sparkled under the bright lights, catching everyone's attention.",
            "sent4": "Her collection of vavasories was like a treasure trove, each piece more dazzling than the last.",
            "sent5": "The museum displayed ancient vavasories, giving visitors a glimpse into the past's opulence."
        },
        {
            "definition": "a display of wealth or luxury",
            "pos": "noun",
            "sent1": "The mansion was a grand vavasories of marble floors and gilded furniture.",
            "sent2": "His car collection was a vavasories of sleek sports cars and vintage classics.",
            "sent3": "The vavasories of the royal family were the talk of the town, with jewels that sparkled for miles.",
            "sent4": "The gala was a vavasories of elegance, with guests adorned in their finest attire.",
            "sent5": "The yacht party was a vavasories of luxury, with champagne flowing and music playing."
        },
        {
            "definition": "to show off or flaunt wealth or possessions",
            "pos": "verb",
            "sent1": "She would vavasories her new designer handbag wherever she went, hoping to impress others.",
            "sent2": "He loved to vavasories his expensive watch, always making sure it caught people's eyes.",
            "sent3": "During the meeting, he couldn't help but vavasories about his recent vacation to a tropical island.",
            "sent4": "The social media influencer would vavasories her luxurious lifestyle, posting photos of exotic vacations.",
            "sent5": "The peacock would vavasories its vibrant feathers, strutting proudly in the zoo enclosure."
        }
    ]
}