{
    "term": "vectoring",
    "meanings": [
        {
            "definition": "The act of guiding or directing a vehicle or aircraft in a specific direction.",
            "pos": "noun",
            "sent1": "During the vectoring, the air traffic controller directed the plane towards the runway.",
            "sent2": "The vectoring of the ship towards the harbor was smooth and precise.",
            "sent3": "The vectoring of the remote-controlled car into the wall made everyone laugh.",
            "sent4": "Her vectoring of the conversation towards her favorite topic was subtle but effective.",
            "sent5": "The vectoring of the missile towards the target was a breathtaking display of precision."
        },
        {
            "definition": "The process of transmitting or receiving data in a specific direction.",
            "pos": "noun",
            "sent1": "The vectoring of information from the satellite to the ground station was crucial for the mission.",
            "sent2": "Vectoring data through the network requires a stable connection.",
            "sent3": "The vectoring of the email to the wrong recipient caused a mix-up.",
            "sent4": "His vectoring of knowledge to the students was clear and effective.",
            "sent5": "The vectoring of signals through the wires was done with great care to avoid interference."
        },
        {
            "definition": "The use of mathematical vectors to represent quantities with both magnitude and direction.",
            "pos": "noun",
            "sent1": "Understanding vectoring in physics helps in solving complex problems.",
            "sent2": "Vectoring in mathematics involves both magnitude and direction.",
            "sent3": "The vectoring of numbers in the equation seemed like a puzzle to solve.",
            "sent4": "Her vectoring of the data points on the graph was precise and accurate.",
            "sent5": "The vectoring of forces in the diagram made the concept crystal clear."
        }
    ]
}