{
    "term": "veined",
    "meanings": [
        {
            "definition": "Having veins or streaks",
            "pos": "adjective",
            "sent1": "The leaf was veined with delicate lines of green.",
            "sent2": "Her hand was veined with age, showing the passage of time.",
            "sent3": "The cake was veined with swirls of chocolate, making it look like a work of art.",
            "sent4": "The sky was veined with shades of pink and orange as the sun set.",
            "sent5": "The marble countertop was veined with intricate patterns, adding elegance to the kitchen."
        },
        {
            "definition": "Marked with veins",
            "pos": "adjective",
            "sent1": "The veined marble floor added a touch of luxury to the room.",
            "sent2": "The old map was veined with rivers and roads, showing the geography of the land.",
            "sent3": "His face was veined with frustration as he tried to solve the puzzle.",
            "sent4": "The leaf was veined like a map, with intricate patterns branching out.",
            "sent5": "The fabric was veined with golden threads, shimmering in the light."
        },
        {
            "definition": "Having prominent veins",
            "pos": "adjective",
            "sent1": "The bodybuilder's arms were veined with muscles, showing his strength.",
            "sent2": "Her forehead was veined with tension, indicating her stress.",
            "sent3": "The tree trunk was veined with bulging roots, giving it a sturdy appearance.",
            "sent4": "The statue was veined with veins, emphasizing its lifelike quality.",
            "sent5": "The rock was veined with minerals, creating a beautiful pattern."
        },
        {
            "definition": "Showing veins or streaks of color",
            "pos": "adjective",
            "sent1": "The painting was veined with vibrant hues, creating a striking contrast.",
            "sent2": "The butterfly's wings were veined with intricate patterns of blue and black.",
            "sent3": "The sky was veined with streaks of pink and purple, like a painting.",
            "sent4": "The flower petals were veined with delicate lines of red and yellow.",
            "sent5": "The fabric was veined with shades of green and blue, resembling a watercolor painting."
        }
    ]
}