{
    "term": "veinstone",
    "meanings": [
        {
            "definition": "A mineral or rock material that occurs in veins within other rocks.",
            "pos": "noun",
            "sent1": "Miners discovered a rich vein of veinstone running through the mountain.",
            "sent2": "The geologist identified the veinstone as quartz embedded in the granite.",
            "sent3": "The mischievous squirrel mistook the shiny veinstone for a nut and tried to bury it.",
            "sent4": "Her determination was like a vein of veinstone, running deep and unwavering.",
            "sent5": "The sunlight caught the veinstone, making it sparkle like a hidden treasure."
        },
        {
            "definition": "A type of stone that is commonly found in mineral deposits.",
            "pos": "noun",
            "sent1": "Miners were excited to find a large vein of veinstone in the mine.",
            "sent2": "The jeweler crafted a beautiful necklace using veinstone from the local quarry.",
            "sent3": "The children skipped stones across the pond, giggling when a veinstone sank quickly.",
            "sent4": "Her heart felt heavy, like a burden of veinstone pressing down on her chest.",
            "sent5": "The veinstone in the streambed glistened in the sunlight, catching the eye of passersby."
        },
        {
            "definition": "A material that is often used in construction and building projects.",
            "pos": "noun",
            "sent1": "The builders selected veinstone for the foundation of the new house.",
            "sent2": "The architect admired the veinstone columns that supported the grand entrance.",
            "sent3": "The mischievous cat knocked over a pile of veinstone, causing a small avalanche.",
            "sent4": "Her words were like veinstone, strong and unyielding in their impact.",
            "sent5": "The veinstone walls of the ancient castle stood tall, a testament to the craftsmanship of the past."
        }
    ]
}