{
    "term": "velaria",
    "meanings": [
        {
            "definition": "A covering or awning made of cloth or other material.",
            "pos": "noun",
            "sent1": "The velaria shielded the market from the hot sun.",
            "sent2": "The velaria was pulled over the outdoor stage to protect the actors from the rain.",
            "sent3": "The velaria danced in the wind, creating a playful shadow on the ground.",
            "sent4": "Her laughter was like a velaria, wrapping everyone in warmth and joy.",
            "sent5": "The colorful velaria billowed gracefully above the street, catching everyone's eye."
        },
        {
            "definition": "A curtain or screen used for decoration or protection.",
            "pos": "noun",
            "sent1": "She hung a velaria in front of the window to add a touch of elegance to the room.",
            "sent2": "The velaria in the theater not only added beauty but also provided privacy for the performers.",
            "sent3": "The mischievous cat peeked out from behind the velaria, playing a game of hide-and-seek.",
            "sent4": "Her smile was a velaria, hiding the sadness behind a colorful facade.",
            "sent5": "The velaria with intricate patterns transformed the plain room into a cozy sanctuary."
        },
        {
            "definition": "A type of sail used on ancient Roman ships.",
            "pos": "noun",
            "sent1": "The sailors unfurled the velaria to catch the wind and propel the ship forward.",
            "sent2": "The velaria fluttered in the breeze as the ancient Roman ship glided across the sea.",
            "sent3": "The mischievous seagull perched on the velaria, enjoying a free ride.",
            "sent4": "The velaria billowed like a giant lung, breathing life into the ancient vessel.",
            "sent5": "The intricate designs on the velaria depicted stories of conquest and adventure to inspire the crew."
        }
    ]
}