{
    "term": "ventriloquizing",
    "meanings": [
        {
            "definition": "To speak or utter in a voice that appears to come from a source other than oneself.",
            "pos": "verb",
            "sent1": "During the talent show, Sarah amazed everyone by ventriloquizing a conversation between a cat and a dog.",
            "sent2": "The ventriloquist was skilled at ventriloquizing different characters during his performances.",
            "sent3": "The children giggled as the puppet started ventriloquizing the alphabet in a funny voice.",
            "sent4": "Her ventriloquizing of the famous singer's voice was so convincing that the audience thought it was a recording.",
            "sent5": "The magician's act involved ventriloquizing a ghostly voice that seemed to come from thin air."
        },
        {
            "definition": "To throw or project the voice in such a way as to make it appear to come from a different location.",
            "pos": "verb",
            "sent1": "The ventriloquist was able to ventriloquize his voice to sound like it was coming from a faraway corner of the room.",
            "sent2": "By ventriloquizing his voice, the actor created the illusion that he was speaking from behind the audience.",
            "sent3": "The ventriloquist joked that he could ventriloquize his voice to order food from the kitchen without leaving the couch.",
            "sent4": "The ghost story was made even scarier by the author's skill in ventriloquizing the voice of the haunted house.",
            "sent5": "The ventriloquist's talent lay in ventriloquizing his voice to sound like it was echoing through a vast cave."
        },
        {
            "definition": "To manipulate one's voice in a way that creates the illusion of a different speaker.",
            "pos": "verb",
            "sent1": "The comedian's act involved ventriloquizing his voice to mimic famous celebrities.",
            "sent2": "She practiced ventriloquizing her voice to sound like a robot for the science fiction play.",
            "sent3": "The ventriloquist entertained the crowd by ventriloquizing his voice to sound like a squeaky toy.",
            "sent4": "The ventriloquist's skill in ventriloquizing voices made it seem like a whole group of people were talking on stage.",
            "sent5": "The ventriloquist's secret to success was his ability to ventriloquize his voice to sound like different animals."
        }
    ]
}