{
    "term": "ventriloquizes",
    "meanings": [
        {
            "definition": "To speak or utter in a voice that appears to come from a source other than oneself.",
            "pos": "verb",
            "sent1": "During the talent show, Sarah ventriloquizes a funny dialogue between a puppet and herself.",
            "sent2": "The skilled ventriloquist ventriloquizes the voice of a lion puppet with great precision.",
            "sent3": "At the party, Tom ventriloquizes his dog's voice, making everyone laugh.",
            "sent4": "The wind seemed to ventriloquize the whispers of the ancient trees in the forest.",
            "sent5": "The ventriloquist's ability to ventriloquize different characters amazed the audience."
        },
        {
            "definition": "To throw or project the voice so that it appears to come from a different location.",
            "pos": "verb",
            "sent1": "The magician ventriloquizes his voice to sound like it's coming from a hidden box.",
            "sent2": "She cleverly ventriloquizes her voice to make it seem like it's coming from behind the curtain.",
            "sent3": "The mischievous boy ventriloquizes his voice to make it seem like it's coming from the ceiling.",
            "sent4": "The echo in the canyon seemed to ventriloquize the hiker's shouts.",
            "sent5": "The ventriloquist expertly ventriloquizes her voice to create a spooky atmosphere."
        },
        {
            "definition": "To manipulate one's voice in such a way as to create the illusion of a different speaker.",
            "pos": "verb",
            "sent1": "The actor ventriloquizes his voice to mimic the sound of an old man.",
            "sent2": "She ventriloquizes her voice to imitate the tone of a child.",
            "sent3": "During the play, the comedian ventriloquizes his voice to sound like a robot.",
            "sent4": "The ventriloquist's voice seemed to ventriloquize that of a famous singer.",
            "sent5": "The ventriloquist can ventriloquize various accents with ease."
        }
    ]
}