{
    "term": "ventriloquized",
    "meanings": [
        {
            "definition": "To speak or utter in a voice that appears to come from a source other than oneself.",
            "pos": "verb",
            "sent1": "During the play, the magician ventriloquized the puppet to entertain the audience.",
            "sent2": "The ventriloquist ventriloquized the doll, making it seem like it was talking on its own.",
            "sent3": "The ventriloquist accidentally ventriloquized the wrong character, causing confusion among the viewers.",
            "sent4": "She ventriloquized her voice to sound like a robot, surprising everyone with her talent.",
            "sent5": "The ventriloquist expertly ventriloquized different accents, showcasing her remarkable skill."
        },
        {
            "definition": "To throw or project the voice in such a way as to make it appear to come from a different location.",
            "pos": "verb",
            "sent1": "The ventriloquist ventriloquized his voice to sound like it was coming from the other side of the room.",
            "sent2": "She ventriloquized her voice to make it seem like it was echoing in a vast hall.",
            "sent3": "The ventriloquist playfully ventriloquized his voice to make his friends think they were hearing things.",
            "sent4": "Her voice ventriloquized through the forest, creating an eerie effect in the dark.",
            "sent5": "The ventriloquist skillfully ventriloquized her voice to mimic a distant whisper, captivating the audience."
        },
        {
            "definition": "To manipulate one's voice in a way that creates the illusion of a different speaker.",
            "pos": "verb",
            "sent1": "The ventriloquist ventriloquized her voice to sound like a grumpy old man.",
            "sent2": "He ventriloquized his voice to imitate a cartoon character, making everyone laugh.",
            "sent3": "The ventriloquist ventriloquized her voice to mimic a famous singer, surprising the judges.",
            "sent4": "They ventriloquized their voices to sound like aliens, adding a fun twist to the performance.",
            "sent5": "The ventriloquist ventriloquized her voice to sound like a child, showcasing her versatility in vocal manipulation."
        }
    ]
}