{
    "term": "ventriloquize",
    "meanings": [
        {
            "definition": "To speak or utter in a voice that appears to come from a source other than oneself.",
            "pos": "verb",
            "sent1": "During the play, the actor would ventriloquize to make it seem like the puppet was talking.",
            "sent2": "The ventriloquist could ventriloquize so well that the audience believed the doll was alive.",
            "sent3": "The magician decided to ventriloquize the rabbit, much to the amusement of the children.",
            "sent4": "Her ability to ventriloquize the voices of different characters was truly remarkable.",
            "sent5": "The ventriloquist's talent to ventriloquize made the puppet show unforgettable."
        },
        {
            "definition": "To throw or project the voice so that it appears to come from a different location.",
            "pos": "verb",
            "sent1": "He could ventriloquize his voice to make it seem like it was coming from across the room.",
            "sent2": "The ventriloquist could ventriloquize his voice to make it sound like it was coming from behind the curtain.",
            "sent3": "The ventriloquist decided to ventriloquize his voice to confuse the audience about his location.",
            "sent4": "Her ability to ventriloquize her voice to different parts of the room amazed everyone.",
            "sent5": "The ventriloquist's skill to ventriloquize his voice added an element of mystery to the performance."
        },
        {
            "definition": "To manipulate one's voice to create the illusion of a different speaker.",
            "pos": "verb",
            "sent1": "She could ventriloquize her voice to sound like a man speaking.",
            "sent2": "The ventriloquist could ventriloquize his voice to mimic famous personalities.",
            "sent3": "The comedian decided to ventriloquize his voice to imitate a cartoon character.",
            "sent4": "Her talent to ventriloquize her voice to sound like animals amazed the audience.",
            "sent5": "The ventriloquist's ability to ventriloquize different voices made the show entertaining and engaging."
        }
    ]
}