{
    "term": "vestibular",
    "meanings": [
        {
            "definition": "relating to the vestibule of the ear",
            "pos": "adjective",
            "sent1": "The vestibular system helps us keep our balance.",
            "sent2": "The doctor examined her vestibular function to assess her balance.",
            "sent3": "The cat's vestibular sense was so sharp, it could walk along the narrow ledge effortlessly.",
            "sent4": "Her vestibular perception was like a finely tuned instrument, never letting her trip or stumble.",
            "sent5": "The vestibular sensation of spinning made her dizzy and disoriented."
        },
        {
            "definition": "relating to the vestibule of the inner ear",
            "pos": "adjective",
            "sent1": "The vestibular organs in the inner ear help us maintain equilibrium.",
            "sent2": "The vestibular nerve carries signals from the inner ear to the brain.",
            "sent3": "The vestibular labyrinth in the inner ear is crucial for our sense of balance.",
            "sent4": "His vestibular system in the inner ear was so sensitive, he could detect even the slightest movement.",
            "sent5": "The vestibular sensation in the inner ear made him feel like he was spinning in circles."
        },
        {
            "definition": "relating to the vestibule of the nose",
            "pos": "adjective",
            "sent1": "The vestibular region of the nose is responsible for detecting odors.",
            "sent2": "The vestibular nerve in the nose transmits signals to the brain about smell.",
            "sent3": "Her vestibular sense in the nose was so acute, she could identify scents from far away.",
            "sent4": "The vestibular receptors in the nose acted like tiny sensors, picking up on different smells.",
            "sent5": "The vestibular perception in the nose made her appreciate the fragrant flowers even more."
        }
    ]
}