{
    "term": "vice",
    "meanings": [
        {
            "definition": "Immoral or wicked behavior",
            "pos": "noun",
            "sent1": "His vice of lying caused him trouble.",
            "sent2": "Stealing is considered a vice in society.",
            "sent3": "The cat's vice of knocking things off shelves was annoying.",
            "sent4": "The vice of corruption grips the city tightly.",
            "sent5": "Her vice of gossiping spread like wildfire."
        },
        {
            "definition": "A bad habit or practice",
            "pos": "noun",
            "sent1": "Eating junk food is a common vice for many people.",
            "sent2": "His vice of procrastination often led to missed deadlines.",
            "sent3": "Her vice of biting her nails made her fingers sore.",
            "sent4": "The vice of overspending drained his bank account.",
            "sent5": "Skipping breakfast became a vice for him."
        },
        {
            "definition": "A fault or imperfection",
            "pos": "noun",
            "sent1": "The vice in the plan caused it to fail.",
            "sent2": "His vice of impatience often got him into trouble.",
            "sent3": "The car's vice of stalling at red lights was frustrating.",
            "sent4": "The vice in the system led to errors in calculations.",
            "sent5": "Her vice of forgetfulness made her miss important appointments."
        },
        {
            "definition": "A clamp or device used to hold something in place",
            "pos": "noun",
            "sent1": "He used a vice to secure the wood while he sawed.",
            "sent2": "The vice kept the metal firmly in place during welding.",
            "sent3": "The vice clamped down tightly on the pipe.",
            "sent4": "The vice held the workpiece steady for drilling.",
            "sent5": "The vice was essential for woodworking projects."
        },
        {
            "definition": "A tool for holding metal while it is being worked on",
            "pos": "noun",
            "sent1": "The blacksmith used a vice to shape the metal.",
            "sent2": "The mechanic tightened the vice to secure the part.",
            "sent3": "The vice helped in bending the metal accurately.",
            "sent4": "The vice provided a stable grip for the welding process.",
            "sent5": "Using a vice is crucial for precision metalwork."
        }
    ]
}