{
    "term": "victimhoods",
    "meanings": [
        {
            "definition": "The state of being a victim.",
            "pos": "noun",
            "sent1": "She often found herself trapped in the victimhoods of her own mind.",
            "sent2": "The community came together to support the victimhoods of those affected by the natural disaster.",
            "sent3": "Despite her friend's teasing, she embraced her victimhoods with a smile.",
            "sent4": "The shadow of victimhoods loomed over the city, reminding everyone of their vulnerability.",
            "sent5": "The artist's painting captured the raw emotion of victimhoods in a powerful way."
        },
        {
            "definition": "The condition of suffering harm or loss due to the actions of others.",
            "pos": "noun",
            "sent1": "The victimhoods of the war refugees touched the hearts of many around the world.",
            "sent2": "She couldn't shake off the feeling of victimhoods after the incident.",
            "sent3": "In a strange twist of fate, his clumsiness led to his own victimhoods.",
            "sent4": "The weight of her past victimhoods felt like a heavy burden on her shoulders.",
            "sent5": "The movie portrayed the harsh reality of victimhoods in a way that left the audience speechless."
        },
        {
            "definition": "The experience of being treated unfairly or unjustly.",
            "pos": "noun",
            "sent1": "He couldn't stand the constant victimhoods he faced at work.",
            "sent2": "The victimhoods she endured only made her stronger in the end.",
            "sent3": "Despite the mix-up, they all laughed at the silly victimhoods of the situation.",
            "sent4": "The novel delved into the character's deep-rooted victimhoods, revealing their inner struggles.",
            "sent5": "The courtroom drama highlighted the complexities of societal victimhoods and biases."
        }
    ]
}