{
    "term": "victoria",
    "meanings": [
        {
            "definition": "A state of being victorious or successful.",
            "pos": "noun",
            "sent1": "After the game, the team celebrated their victoria with cheers and high-fives.",
            "sent2": "Her hard work and dedication led to her victoria in the competition.",
            "sent3": "The squirrel's victoria in finding the hidden acorn brought smiles to the onlookers.",
            "sent4": "The student's victoria over the difficult math problem was like conquering a mighty dragon.",
            "sent5": "The victoria of the underdog team became a story of inspiration for many."
        },
        {
            "definition": "A female given name.",
            "pos": "noun",
            "sent1": "Victoria is excited to meet her new classmates at school.",
            "sent2": "My grandmother's name is Victoria, and she is a kind lady.",
            "sent3": "Victoria's friends often call her Vicky for short.",
            "sent4": "In the play, the character Victoria is portrayed as a brave and independent woman.",
            "sent5": "The name Victoria has a regal and elegant ring to it."
        },
        {
            "definition": "A type of carriage.",
            "pos": "noun",
            "sent1": "The royal family arrived at the palace in a grand Victoria.",
            "sent2": "The Victoria was beautifully decorated with intricate designs.",
            "sent3": "The Victoria carriage rattled along the cobblestone streets, drawing attention from passersby.",
            "sent4": "The Victoria glided smoothly through the park, giving the passengers a leisurely ride.",
            "sent5": "The Victoria carriage was fit for a queen, with plush seats and golden accents."
        },
        {
            "definition": "A type of water lily.",
            "pos": "noun",
            "sent1": "The pond was adorned with vibrant Victoria water lilies.",
            "sent2": "The Victoria water lily blooms in shades of pink and white.",
            "sent3": "The frogs in the pond often rest on the leaves of the Victoria water lilies.",
            "sent4": "The Victoria water lily's beauty captivated all who visited the botanical garden.",
            "sent5": "The fragrance of the Victoria water lily filled the air with a sweet aroma."
        }
    ]
}