{
    "term": "villainousness",
    "meanings": [
        {
            "definition": "The quality or state of being villainous.",
            "pos": "noun",
            "sent1": "Her villainousness was evident in the way she plotted against the hero.",
            "sent2": "The movie's plot was driven by the villainousness of the main character.",
            "sent3": "The cartoon character's villainousness made the audience laugh at his failed attempts to be bad.",
            "sent4": "The villainousness of the storm clouds foretold a night of thunder and lightning.",
            "sent5": "The villainousness of the witch's cackle sent shivers down everyone's spines."
        },
        {
            "definition": "The behavior or actions of a villain.",
            "pos": "noun",
            "sent1": "His villainousness was on full display as he cackled and twirled his mustache.",
            "sent2": "The hero was always one step ahead of the villainousness of the antagonist.",
            "sent3": "The puppy's villainousness was evident when he stole a sock and ran around the house with it.",
            "sent4": "The villainousness of the cat knocking over the vase was met with a stern scolding.",
            "sent5": "The villainousness of the dragon's fiery breath scorched the village to ashes."
        },
        {
            "definition": "The characteristic of being evil or wicked.",
            "pos": "noun",
            "sent1": "The king's villainousness was known throughout the kingdom.",
            "sent2": "The fairy tale was filled with the villainousness of the evil queen.",
            "sent3": "The villainousness of the cookie thief was revealed when crumbs led to their hiding spot.",
            "sent4": "The villainousness of the haunted house sent chills down the spines of all who dared to enter.",
            "sent5": "The villainousness of the dark forest was whispered about in hushed tones by the villagers."
        }
    ]
}