{
    "term": "violable",
    "meanings": [
        {
            "definition": "Capable of being violated or transgressed.",
            "pos": "adjective",
            "sent1": "The fragile lock was violable by a simple twist of the key.",
            "sent2": "The rules of the game were violable if all players agreed to change them.",
            "sent3": "The 'Do Not Enter' sign seemed to mockingly dare people to cross, as if it knew it was violable.",
            "sent4": "Her trust was like a violable fortress, easily breached by deceitful words.",
            "sent5": "The ancient curse was as violable as a thin sheet of ice, waiting to be shattered by a single misstep."
        },
        {
            "definition": "Able to be broken or disregarded.",
            "pos": "adjective",
            "sent1": "The delicate glass ornaments were violable with just a slight bump.",
            "sent2": "The contract was violable if either party failed to fulfill their obligations.",
            "sent3": "The 'No Trespassing' sign was so faded that it appeared almost violable.",
            "sent4": "His resolve was as violable as a sandcastle against the incoming tide.",
            "sent5": "The ancient seal on the tomb was violable, allowing the archaeologists to uncover its secrets."
        },
        {
            "definition": "Susceptible to being infringed upon.",
            "pos": "adjective",
            "sent1": "The privacy of their home felt violable with the windows left open.",
            "sent2": "The fragile peace treaty was violable if any nation decided to break it.",
            "sent3": "The 'Keep Out' sign looked so old and worn that it seemed almost violable.",
            "sent4": "Her heart was as violable as a fragile glass bauble, easily shattered by harsh words.",
            "sent5": "The ancient spell protecting the treasure was violable, and the adventurers knew they had a chance to claim it."
        }
    ]
}