{
    "term": "virilize",
    "meanings": [
        {
            "definition": "To develop male physical characteristics.",
            "pos": "verb",
            "sent1": "The medication helped virilize the patient, giving him more muscle mass and facial hair.",
            "sent2": "Puberty is a natural process that can virilize a boy, causing his voice to deepen and his body to grow taller.",
            "sent3": "The superhero's secret power was to virilize anyone who challenged him, turning them into strong, masculine figures.",
            "sent4": "The artist used bold lines and dark colors to virilize the portrait, giving it a strong and masculine appearance.",
            "sent5": "In the movie, the magical potion had the ability to virilize the character, transforming him into a muscular and rugged hero."
        },
        {
            "definition": "To cause to exhibit male traits.",
            "pos": "verb",
            "sent1": "The new clothing line aimed to virilize men, encouraging them to embrace traditional masculine qualities.",
            "sent2": "The father wanted to virilize his son, teaching him how to be strong and confident.",
            "sent3": "The comedian's jokes always managed to virilize the audience, making them feel empowered and bold.",
            "sent4": "The coach's motivational speech was meant to virilize the team, instilling in them a sense of determination and grit.",
            "sent5": "The advertisement used rugged imagery to virilize the product, appealing to a more masculine audience."
        },
        {
            "definition": "To undergo masculinization.",
            "pos": "verb",
            "sent1": "During the transformation process, the character began to virilize, growing more hair and developing a deeper voice.",
            "sent2": "The plant extract was known to virilize certain animals, causing them to exhibit male characteristics.",
            "sent3": "The toy robot seemed to virilize as it transformed into a powerful and imposing figure.",
            "sent4": "As the potion took effect, the wizard started to virilize, his appearance becoming more masculine and authoritative.",
            "sent5": "The magical spell was cast to virilize the enchanted object, giving it a more masculine and powerful aura."
        }
    ]
}