{
    "term": "virilisms",
    "meanings": [
        {
            "definition": "The quality or state of being masculine.",
            "pos": "noun",
            "sent1": "His virilisms were evident in his strong physique and deep voice.",
            "sent2": "The actor's virilisms made him perfect for the role of the brave hero.",
            "sent3": "She jokingly teased him about his virilisms, saying he was 'all brawn and no brain'.",
            "sent4": "In the wild, the lion's virilisms are crucial for leading and protecting the pride.",
            "sent5": "The warrior's virilisms shone through in his fearless demeanor and unwavering courage."
        },
        {
            "definition": "A trait or characteristic typically associated with males.",
            "pos": "noun",
            "sent1": "Courage is often seen as a virilism in many cultures.",
            "sent2": "His kindness was a refreshing break from the typical virilisms of his peers.",
            "sent3": "The little puppy displayed virilisms by bravely standing up to the bigger dogs.",
            "sent4": "In the story, the prince's virilisms were overshadowed by his compassion and humility.",
            "sent5": "The teacher encouraged the students to embrace both feminine and masculine virilisms in their personalities."
        },
        {
            "definition": "The use of language or expressions that are considered manly or masculine.",
            "pos": "noun",
            "sent1": "His speech was filled with virilisms like 'bro' and 'dude'.",
            "sent2": "The author's writing style was criticized for its excessive use of virilisms.",
            "sent3": "She playfully imitated his virilisms, deepening her voice and using slang terms.",
            "sent4": "The politician's virilisms in his speeches aimed to appeal to a certain demographic.",
            "sent5": "The coach's virilisms motivated the team with phrases like 'tough it out' and 'be a man'."
        }
    ]
}