{
    "term": "visceral",
    "meanings": [
        {
            "definition": "Relating to deep inward feelings rather than to the intellect.",
            "pos": "adjective",
            "sent1": "Her visceral reaction to the horror movie made her cover her eyes in fear.",
            "sent2": "The artist's work evoked a visceral response from the audience, stirring their emotions.",
            "sent3": "It was a visceral experience watching the roller coaster climb to its peak.",
            "sent4": "The music had a visceral impact on her, causing tears to well up in her eyes.",
            "sent5": "The smell of fresh bread baking in the oven triggered a visceral memory of her childhood."
        },
        {
            "definition": "Instinctive rather than rational.",
            "pos": "adjective",
            "sent1": "His visceral fear of spiders caused him to jump back instinctively.",
            "sent2": "The decision to run from danger was purely visceral, without any logical thought.",
            "sent3": "She had a visceral reaction to the surprise party, screaming in shock.",
            "sent4": "The athlete's movements on the field were visceral, driven by pure instinct.",
            "sent5": "The baby's laughter was a visceral response to the tickling sensation."
        },
        {
            "definition": "Of or relating to the viscera.",
            "pos": "adjective",
            "sent1": "The doctor's examination focused on the patient's visceral organs for any abnormalities.",
            "sent2": "The visceral pain in his stomach indicated a serious issue that needed immediate attention.",
            "sent3": "The chef's specialty was creating dishes that celebrated the visceral flavors of the sea.",
            "sent4": "The artist's painting depicted the beauty of the visceral structures within the human body.",
            "sent5": "The biologist studied the visceral functions of different species to understand their survival mechanisms."
        }
    ]
}