{
    "term": "vocation",
    "meanings": [
        {
            "definition": "A strong feeling of suitability for a particular career or occupation.",
            "pos": "noun",
            "sent1": "Her vocation as a teacher was evident in her passion for educating children.",
            "sent2": "He found his vocation in carpentry and enjoyed crafting furniture.",
            "sent3": "She joked that her vocation was to be a professional sleeper, but she knew she had to find a real job.",
            "sent4": "His vocation as a chef turned the kitchen into a symphony of flavors and aromas.",
            "sent5": "The artist's vocation to paint was as natural as breathing, each stroke a masterpiece in the making."
        },
        {
            "definition": "A divine call to a religious life or service.",
            "pos": "noun",
            "sent1": "The nun felt her vocation to serve the community was a sacred duty.",
            "sent2": "Heeding the vocation to become a priest, he dedicated his life to spiritual guidance.",
            "sent3": "She believed her vocation was to be a superhero, complete with a cape and special powers.",
            "sent4": "The monk's vocation was a beacon of light in a world filled with darkness.",
            "sent5": "The call to vocation echoed through the monastery, drawing in those destined for a life of devotion."
        },
        {
            "definition": "The work in which a person is employed.",
            "pos": "noun",
            "sent1": "His vocation as a plumber kept him busy fixing leaky pipes and clogged drains.",
            "sent2": "She saw her vocation as a cashier as a stepping stone to bigger career opportunities.",
            "sent3": "The dog's vocation as a professional bone-burier was a unique job in the neighborhood.",
            "sent4": "In the bustling city, each person had a vocation that contributed to the community's growth.",
            "sent5": "The farmer's vocation of tending to the land brought forth bountiful harvests each season."
        }
    ]
}