{
    "term": "voguings",
    "meanings": [
        {
            "definition": "The act of striking a pose or series of poses in a stylized manner, often in a competitive setting.",
            "pos": "noun",
            "sent1": "During the voguings competition, each participant showcased their unique poses.",
            "sent2": "She learned voguings from experienced dancers in the community.",
            "sent3": "The cat attempted voguings by posing dramatically on the windowsill.",
            "sent4": "Her confidence was like a masterful voguings performance, captivating everyone around her.",
            "sent5": "The voguings at the fashion show were so impressive that they left a lasting impression on the audience."
        },
        {
            "definition": "The practice or art of voguing, typically associated with the LGBTQ+ community.",
            "pos": "noun",
            "sent1": "He embraced voguings as a form of self-expression and empowerment.",
            "sent2": "The voguings scene in the city was vibrant and inclusive.",
            "sent3": "The voguings class was full of laughter and positive energy.",
            "sent4": "Her passion for voguings was like a beacon of light in the community.",
            "sent5": "The voguings event celebrated diversity and creativity within the LGBTQ+ community."
        },
        {
            "definition": "A form of dance that incorporates elements of posing and attitude.",
            "pos": "noun",
            "sent1": "The voguings performance was a perfect blend of dance and attitude.",
            "sent2": "They practiced voguings routines for hours to perfect their moves.",
            "sent3": "The voguings workshop taught participants how to dance with confidence.",
            "sent4": "His voguings style was like a burst of energy on the dance floor.",
            "sent5": "The voguings choreography was so dynamic that it left the audience in awe."
        }
    ]
}