{
    "term": "vogued",
    "meanings": [
        {
            "definition": "To strike a pose in a fashionable or ostentatious manner.",
            "pos": "verb",
            "sent1": "She vogued confidently on the runway, showcasing the latest designs.",
            "sent2": "The model vogued gracefully, capturing the attention of the audience.",
            "sent3": "At the party, he vogued like a superstar, causing everyone to smile.",
            "sent4": "Her movements vogued with elegance, as if she were a living sculpture.",
            "sent5": "The dancer vogued with such flair that it left a lasting impression on the spectators."
        },
        {
            "definition": "To imitate or mimic the style or mannerisms of someone or something.",
            "pos": "verb",
            "sent1": "The comedian vogued the famous actor's gestures, making the audience burst into laughter.",
            "sent2": "Children often vogued their favorite cartoon characters while playing.",
            "sent3": "He vogued his boss's serious tone during the meeting, causing some amusement.",
            "sent4": "The parrot vogued the sounds of the household, surprising everyone with its mimicry.",
            "sent5": "The actor vogued the iconic singer's moves perfectly, impressing the audience with his imitation."
        },
        {
            "definition": "To be in vogue or in fashion.",
            "pos": "verb",
            "sent1": "The new trend vogued among the youth, influencing their clothing choices.",
            "sent2": "Her outfit vogued with the latest style, attracting compliments from her friends.",
            "sent3": "Even the pets vogued in trendy accessories, showing off their fashionable side.",
            "sent4": "The classic look vogued back into popularity, surprising many fashion enthusiasts.",
            "sent5": "The designer's collection vogued on the red carpet, setting a new trend in the industry."
        }
    ]
}