{
    "term": "vogueing",
    "meanings": [
        {
            "definition": "The act of striking a pose or series of poses in a stylized manner, typically in a dance or performance setting.",
            "pos": "noun",
            "sent1": "Her vogueing on stage was mesmerizing, each pose telling a story.",
            "sent2": "The dancers showcased their vogueing skills at the talent show.",
            "sent3": "During the play, the characters started vogueing unexpectedly, causing laughter in the audience.",
            "sent4": "In the art class, the students used vogueing to express different emotions through poses.",
            "sent5": "The model's vogueing at the fashion show left a lasting impression on the audience."
        },
        {
            "definition": "A popular dance style originating in the LGBTQ+ ballroom scene, characterized by exaggerated and theatrical movements.",
            "pos": "noun",
            "sent1": "The vogueing at the ballroom competition was fierce and energetic.",
            "sent2": "People from all backgrounds enjoy watching vogueing performances.",
            "sent3": "At the party, everyone joined in the vogueing, adding a fun twist to the celebration.",
            "sent4": "The vogueing dancers moved with such grace and precision, it was like watching poetry in motion.",
            "sent5": "The music video featured stunning vogueing choreography that captivated viewers.",
            "sent6": "Excited to learn a new dance style, she signed up for vogueing classes at the community center."
        },
        {
            "definition": "To vogue: to engage in the dance style of vogueing.",
            "pos": "verb",
            "sent1": "They vogueing together at the dance studio every weekend.",
            "sent2": "She loves to vogueing with her friends at parties.",
            "sent3": "The cat seemed to be vogueing around the room, striking playful poses.",
            "sent4": "As the music played, the crowd started vogueing in unison, creating a mesmerizing sight.",
            "sent5": "The street performer was vogueing skillfully, drawing a crowd with their talent."
        }
    ]
}