{
    "term": "voluntourist",
    "meanings": [
        {
            "definition": "A person who engages in volunteer work while traveling.",
            "pos": "noun",
            "sent1": "The voluntourist helped build houses for families in need during their trip.",
            "sent2": "She met other voluntourists at the orphanage where they were volunteering.",
            "sent3": "The voluntourist accidentally packed their passport in the donation box.",
            "sent4": "Being a voluntourist opened her eyes to the different ways people live around the world.",
            "sent5": "The voluntourist's dedication to helping others was truly inspiring."
        },
        {
            "definition": "One who combines tourism with volunteering.",
            "pos": "noun",
            "sent1": "During her vacation, the voluntourist visited historical sites and volunteered at local schools.",
            "sent2": "The group of voluntourists cleaned up the beach before enjoying a traditional meal.",
            "sent3": "The voluntourist's camera was filled with pictures of both tourist attractions and volunteer projects.",
            "sent4": "She felt like a voluntourist superhero, saving the day while exploring new places.",
            "sent5": "The voluntourist's itinerary was a perfect blend of sightseeing and community service."
        },
        {
            "definition": "A traveler who participates in charitable activities during their trip.",
            "pos": "noun",
            "sent1": "The voluntourist spent their mornings helping at the local food bank before exploring the city.",
            "sent2": "As a voluntourist, he found joy in giving back to the communities he visited.",
            "sent3": "The voluntourist's suitcase was filled with supplies for the schools they planned to visit.",
            "sent4": "Her heart swelled with pride as she saw the impact she made as a voluntourist.",
            "sent5": "The voluntourist's journey was not just about sightseeing but also about making a difference in the world."
        }
    ]
}