{
    "term": "volve",
    "meanings": [
        {
            "definition": "To turn or roll around on an axis",
            "pos": "verb",
            "sent1": "The Earth will volve around the sun.",
            "sent2": "I watch the washing machine volve as it cleans my clothes.",
            "sent3": "The cat decided to volve in circles before lying down for a nap.",
            "sent4": "Time seems to volve faster as we grow older.",
            "sent5": "The merry-go-round made the children dizzy with its constant volve."
        },
        {
            "definition": "To revolve or rotate",
            "pos": "verb",
            "sent1": "The windmill blades volve gracefully in the breeze.",
            "sent2": "The planets volve around the sun in our solar system.",
            "sent3": "The dancer's skirt seemed to volve with her every move.",
            "sent4": "The gears in the clock volve smoothly to keep time ticking.",
            "sent5": "The wheels of the bicycle volve as the rider pedals forward."
        },
        {
            "definition": "To coil or twist",
            "pos": "verb",
            "sent1": "The snake will volve around its prey before striking.",
            "sent2": "She watched the yarn volve into a neat ball as she knitted.",
            "sent3": "The vines volve around the tree trunk like a natural scarf.",
            "sent4": "The gymnast's body seemed to volve effortlessly in mid-air.",
            "sent5": "The rope began to volve around the pole as the flag was raised."
        },
        {
            "definition": "To wrap or wind around",
            "pos": "verb",
            "sent1": "She will volve the scarf around her neck to keep warm.",
            "sent2": "The ivy plants volve around the old stone walls of the castle.",
            "sent3": "The ribbon seemed to volve itself around the gift box magically.",
            "sent4": "The river will volve around the bend before disappearing from sight.",
            "sent5": "The spider silk will volve around the prey to secure its catch."
        },
        {
            "definition": "To change or shift in a circular motion",
            "pos": "verb",
            "sent1": "The colors of the kaleidoscope volve with each twist.",
            "sent2": "Her thoughts volve endlessly in her mind, never settling.",
            "sent3": "The ballerina's pirouette made her costume volve beautifully.",
            "sent4": "The storm clouds volve ominously in the sky before the rain.",
            "sent5": "The carousel horses volve up and down as the music plays."
        }
    ]
}