{
    "term": "voodoos",
    "meanings": [
        {
            "definition": "practices associated with a religion originating in West Africa",
            "pos": "noun",
            "sent1": "The voodoos involve rituals and ceremonies.",
            "sent2": "She learned about the voodoos from her grandmother.",
            "sent3": "The voodoos performed a dance to honor their ancestors.",
            "sent4": "The voodoos of the tribe were deeply rooted in tradition.",
            "sent5": "The voodoos believed in the power of spirits and nature."
        },
        {
            "definition": "casts a spell or curse on someone",
            "pos": "verb",
            "sent1": "He voodoos his enemies to bring bad luck.",
            "sent2": "She warned him not to voodoos anyone out of anger.",
            "sent3": "The witch doctor voodoos a potion to break the curse.",
            "sent4": "The magician voodoos the audience with his tricks.",
            "sent5": "The sorcerer voodoos a protection spell around the castle."
        },
        {
            "definition": "a person who practices voodoo",
            "pos": "noun",
            "sent1": "The voodoos in the village were respected for their knowledge.",
            "sent2": "She consulted the voodoos for guidance.",
            "sent3": "The voodoos gathered herbs for their remedies.",
            "sent4": "The voodoos shared their wisdom with the community.",
            "sent5": "The voodoos wore traditional clothing during ceremonies."
        },
        {
            "definition": "to influence or control someone or something by mysterious or supernatural means",
            "pos": "verb",
            "sent1": "The mysterious woman voodoos the outcome of events.",
            "sent2": "He believed someone was voodoosing his thoughts.",
            "sent3": "The magician voodoos the cards to predict the future.",
            "sent4": "The enchantress voodoos the forest to protect it from harm.",
            "sent5": "The sorcerer voodoos the weather to bring rain to the drought-stricken land."
        }
    ]
}