{
    "term": "vorticisms",
    "meanings": [
        {
            "definition": "Vorticisms: a modernist art movement characterized by abstract geometric forms",
            "pos": "noun",
            "sent1": "The museum displayed a collection of vorticisms from the early 20th century.",
            "sent2": "Art students studied vorticisms to understand the use of geometric shapes in paintings.",
            "sent3": "The artist joked that their messy room looked like a vorticisms masterpiece.",
            "sent4": "Her mind was a whirlwind of vorticisms, each idea a sharp angle cutting through the chaos.",
            "sent5": "The exhibition showcased the vibrant vorticisms of talented painters, capturing the essence of the movement."
        },
        {
            "definition": "Vorticisms: the principles or techniques associated with the Vorticist movement",
            "pos": "noun",
            "sent1": "Understanding the vorticisms of composition is essential for creating impactful art.",
            "sent2": "Art critics analyzed the vorticisms used by the famous Vorticist painters.",
            "sent3": "The art class discussed the vorticisms of color theory with great enthusiasm.",
            "sent4": "His writing style had a unique vorticisms, blending tradition with innovation.",
            "sent5": "The book delved into the intricate vorticisms of Vorticism, shedding light on its artistic philosophy."
        },
        {
            "definition": "Vorticisms: artworks or creations influenced by Vorticism",
            "pos": "noun",
            "sent1": "The gallery featured stunning vorticisms inspired by the Vorticist movement.",
            "sent2": "Collectors sought after rare vorticisms to add to their art collections.",
            "sent3": "The fashion designer's new collection had a touch of vorticisms in its patterns.",
            "sent4": "Her music had a rhythmic vorticisms that echoed the avant-garde spirit of Vorticism.",
            "sent5": "The film director's visual style was infused with vorticisms, creating a visually striking experience for the audience."
        }
    ]
}