{
    "term": "vote",
    "meanings": [
        {
            "definition": "a formal indication of a choice between two or more candidates or courses of action, expressed typically through a ballot or a show of hands",
            "pos": "noun",
            "sent1": "During the school election, each student cast a vote for their favorite candidate.",
            "sent2": "The citizens will gather to vote for the new mayor next week.",
            "sent3": "In the game of pretend politics, the teddy bears held a vote to decide who would be the king of the toy box.",
            "sent4": "Her smile was a vote of confidence that brightened up the entire room.",
            "sent5": "The thunderous applause was a clear vote in favor of the talented singer."
        },
        {
            "definition": "to express a formal indication of choice between two or more candidates or courses of action",
            "pos": "verb",
            "sent1": "I will vote for my favorite singer on the music competition show.",
            "sent2": "People will vote for their preferred candidate in the upcoming election.",
            "sent3": "The family decided to vote on whether to have pizza or burgers for dinner.",
            "sent4": "Her actions seemed to vote against her own best interests.",
            "sent5": "The audience's cheers seemed to vote for the underdog team."
        },
        {
            "definition": "a collective expression of opinion or will by a group of people, typically through a show of hands or a formal process",
            "pos": "noun",
            "sent1": "The unanimous vote of the committee approved the new project proposal.",
            "sent2": "The vote of the shareholders determined the future direction of the company.",
            "sent3": "The vote of the penguins decided that fish was the best meal for dinner.",
            "sent4": "The gentle breeze felt like a vote of approval from nature.",
            "sent5": "The loud cheers from the crowd were a powerful vote of support for the team."
        }
    ]
}