{
    "term": "voting",
    "meanings": [
        {
            "definition": "The act of expressing a choice or opinion by marking a ballot or raising a hand.",
            "pos": "noun",
            "sent1": "During the school election, the students practiced voting for their favorite candidate.",
            "sent2": "In a democracy, voting is a fundamental right for all citizens.",
            "sent3": "At the teddy bear picnic, the toys had a playful voting session to decide the best dressed plush.",
            "sent4": "The colorful leaves on the trees seemed to be voting for autumn's arrival with their vibrant hues.",
            "sent5": "The loud cheers and applause in the auditorium made the voting process exciting and engaging."
        },
        {
            "definition": "The total number of votes cast in an election.",
            "pos": "noun",
            "sent1": "The candidate won the election by receiving the majority of the voting.",
            "sent2": "The voting results showed a clear winner in the race for class president.",
            "sent3": "The cookies and cupcakes had a tough competition, but the voting revealed the cupcakes as the favorite treat.",
            "sent4": "The stars in the night sky seemed to twinkle brighter with each voting for their favorite constellation.",
            "sent5": "The room buzzed with anticipation as the final voting numbers were about to be announced."
        },
        {
            "definition": "The process of making a choice or decision by a show of hands or by ballot.",
            "pos": "noun",
            "sent1": "During the meeting, the members participated in voting to decide on the new club activities.",
            "sent2": "The voting process in the courtroom ensured a fair trial for all involved.",
            "sent3": "The vegetables and fruits engaged in a friendly voting contest to determine the tastiest produce.",
            "sent4": "The waves crashing against the shore seemed to be voting for a stormy weather ahead.",
            "sent5": "The colorful buttons on the control panel made the spaceship's voting system easy to use for the astronauts."
        }
    ]
}