{
    "term": "vulcanisms",
    "meanings": [
        {
            "definition": "The phenomena associated with volcanic activity.",
            "pos": "noun",
            "sent1": "Scientists study vulcanisms to understand how volcanoes work.",
            "sent2": "The villagers were evacuated due to the dangerous vulcanisms in the area.",
            "sent3": "The school children learned about vulcanisms and pretended to erupt like volcanoes during recess.",
            "sent4": "The power of nature's vulcanisms can be both terrifying and awe-inspiring.",
            "sent5": "The documentary showcased the destructive force of vulcanisms through vivid footage of volcanic eruptions."
        },
        {
            "definition": "The process of volcanic eruption.",
            "pos": "noun",
            "sent1": "The vulcanisms in Hawaii created new land as lava flowed into the ocean.",
            "sent2": "Tourists were amazed by the spectacular vulcanisms of the active volcano.",
            "sent3": "During the science experiment, the baking soda and vinegar mixture mimicked volcanic vulcanisms.",
            "sent4": "The sudden vulcanisms of Mount Vesuvius buried the ancient city of Pompeii.",
            "sent5": "The geologist explained the different stages of vulcanisms leading up to an eruption."
        },
        {
            "definition": "The study of volcanoes and volcanic activity.",
            "pos": "noun",
            "sent1": "In college, she specialized in vulcanisms and conducted research on active volcanoes.",
            "sent2": "The professor's expertise in vulcanisms made her a sought-after speaker at international conferences.",
            "sent3": "The children's book about a volcano explorer sparked their interest in vulcanisms.",
            "sent4": "The field trip to the volcano observatory provided hands-on experience in studying vulcanisms.",
            "sent5": "The documentary series delved into the history and science of vulcanisms around the world."
        }
    ]
}