{
    "term": "vulturish",
    "meanings": [
        {
            "definition": "Resembling or characteristic of a vulture in behavior or appearance.",
            "pos": "adjective",
            "sent1": "The vulturish bird circled high above, searching for its next meal.",
            "sent2": "The sky was filled with vulturish creatures, their sharp eyes scanning the ground below.",
            "sent3": "The vulturish vulture eyed the picnic blanket with keen interest.",
            "sent4": "Her vulturish gaze seemed to strip away any pretense, leaving only raw truth behind.",
            "sent5": "The vulturish silhouette against the sunset was a haunting sight."
        },
        {
            "definition": "Showing a predatory or scavenging nature.",
            "pos": "adjective",
            "sent1": "The vulturish cat prowled the alley, looking for scraps of food.",
            "sent2": "His vulturish instincts kicked in as he spotted the vulnerable prey.",
            "sent3": "The vulturish raccoon stealthily approached the trash can, ready to scavenge for leftovers.",
            "sent4": "Her vulturish behavior at the buffet table earned her the nickname 'The Scavenger'.",
            "sent5": "The vulturish way he eyed the last piece of cake made everyone else hesitant to reach for it."
        },
        {
            "definition": "Describing someone or something as opportunistic or greedy.",
            "pos": "adjective",
            "sent1": "The vulturish businessman took advantage of the situation to make a profit.",
            "sent2": "Her vulturish nature became evident when she swooped in to claim all the credit.",
            "sent3": "The vulturish behavior of the salesperson trying to upsell unnecessary items was comical.",
            "sent4": "His vulturish tactics in negotiations left his opponents feeling drained and defeated.",
            "sent5": "The vulturish landlord raised the rent without any consideration for his tenants' financial struggles."
        }
    ]
}