{
    "term": "wacks",
    "meanings": [
        {
            "definition": "To strike with a sharp blow or blows.",
            "pos": "verb",
            "sent1": "He wacks the nail with a hammer.",
            "sent2": "She wacks the ball with the bat.",
            "sent3": "The chef wacks the garlic to release its flavor.",
            "sent4": "The thunder wacks the silence of the night.",
            "sent5": "The teacher wacks the board to get the students' attention."
        },
        {
            "definition": "A blow or stroke.",
            "pos": "noun",
            "sent1": "The boxer delivered a powerful wacks to his opponent.",
            "sent2": "She felt a sharp wacks on her shoulder.",
            "sent3": "The comedian's joke was a wacks of humor.",
            "sent4": "The storm brought a wacks of wind and rain.",
            "sent5": "The artist's brushstrokes were like gentle wacks on the canvas."
        },
        {
            "definition": "To go or proceed.",
            "pos": "verb",
            "sent1": "The car wacks down the road.",
            "sent2": "They wacks towards the park for a picnic.",
            "sent3": "The squirrel wacks across the yard in a hurry.",
            "sent4": "The river wacks steadily towards the sea.",
            "sent5": "The children wacks to school every morning."
        },
        {
            "definition": "To share or divide.",
            "pos": "verb",
            "sent1": "They wacks the cake among the guests.",
            "sent2": "The siblings wacks the chores to finish quickly.",
            "sent3": "Let's wacks the toys so everyone can play.",
            "sent4": "The team decided to wacks the prize equally.",
            "sent5": "The friends wacks the pizza evenly among themselves."
        },
        {
            "definition": "To cut off or separate.",
            "pos": "verb",
            "sent1": "She wacks a piece of paper from the notebook.",
            "sent2": "The gardener wacks the dead branches from the tree.",
            "sent3": "The tailor wacks the fabric to the right size.",
            "sent4": "The knife wacks through the tough meat easily.",
            "sent5": "The scissors wacks the ribbon for the ceremony."
        }
    ]
}