{
    "term": "wad",
    "meanings": [
        {
            "definition": "A small mass of soft material pressed into a lump or ball.",
            "pos": "noun",
            "sent1": "She found a wad of gum stuck under her shoe.",
            "sent2": "He crumpled up a wad of paper and threw it in the trash.",
            "sent3": "The cat played with a wad of yarn, thinking it was a mouse.",
            "sent4": "Her hair was a wad of tangled knots after the windy walk.",
            "sent5": "The child's wad of playdough looked like a colorful rainbow."
        },
        {
            "definition": "A bundle or roll of paper money.",
            "pos": "noun",
            "sent1": "He handed over a wad of cash to pay for the groceries.",
            "sent2": "The thief stole a wad of bills from the safe.",
            "sent3": "The magician pulled out a wad of money from his hat.",
            "sent4": "Her wallet was bulging with a thick wad of dollars.",
            "sent5": "The beggar's cup overflowed with coins and wads of crumpled bills."
        },
        {
            "definition": "To form into a lump or ball.",
            "pos": "verb",
            "sent1": "She wadded up the tissue and threw it in the bin.",
            "sent2": "He wads the clay into different shapes before firing it.",
            "sent3": "The kids wad up the snow to make snowballs for a fight.",
            "sent4": "The chef wads the dough to make perfect bread rolls.",
            "sent5": "The artist wads the paper to create a textured masterpiece."
        },
        {
            "definition": "To stuff or fill tightly with material.",
            "pos": "verb",
            "sent1": "She wads the pillow with feathers for extra fluffiness.",
            "sent2": "He wads the suitcase with clothes for the trip.",
            "sent3": "The squirrel wads its cheeks with nuts for winter storage.",
            "sent4": "The farmer wads the scarecrow with straw to make it sturdy.",
            "sent5": "The tailor wads the jacket with padding for warmth."
        }
    ]
}