{
    "term": "waggons",
    "meanings": [
        {
            "definition": "A vehicle with four wheels, usually pulled by horses or oxen, used for transporting goods.",
            "pos": "noun",
            "sent1": "The farmer loaded his waggons with fresh produce to take to the market.",
            "sent2": "The pioneers traveled westward in their waggons to seek new opportunities.",
            "sent3": "The children had a fun time pretending their bicycles were waggons carrying imaginary treasures.",
            "sent4": "Her laughter echoed through the valley as she raced down the hill in her makeshift wagon of cardboard boxes.",
            "sent5": "The old wooden wagon creaked and groaned as it rolled along the dusty road, a relic of a bygone era."
        },
        {
            "definition": "To move or transport goods in a wagon.",
            "pos": "verb",
            "sent1": "The workers waggons the heavy crates from the warehouse to the loading dock.",
            "sent2": "They waggons the supplies across the rugged terrain to reach the remote village.",
            "sent3": "The children giggled as they pretended to wagon their toys around the backyard.",
            "sent4": "She waggons her belongings to the new house, excited for a fresh start.",
            "sent5": "The team waggons the equipment to the campsite, ready for a weekend of outdoor adventures."
        },
        {
            "definition": "A group of people or things traveling together.",
            "pos": "noun",
            "sent1": "The waggons of tourists followed the guide through the ancient ruins.",
            "sent2": "A long line of waggons made its way through the desert, a caravan in search of a new home.",
            "sent3": "The waggons of geese flew in a V formation across the autumn sky.",
            "sent4": "The waggons of ants marched in a straight line, each carrying a piece of food back to their nest.",
            "sent5": "The waggons of clouds drifted lazily across the blue sky, painting shapes for the children to guess."
        }
    ]
}