{
    "term": "waits",
    "meanings": [
        {
            "definition": "Stay in one place in anticipation of something.",
            "pos": "verb",
            "sent1": "The cat waits by the door for its owner to come home.",
            "sent2": "She waits patiently for the bus to arrive every morning.",
            "sent3": "The little girl waits eagerly for her birthday party.",
            "sent4": "Time waits for no one, so make the most of every moment.",
            "sent5": "The student waits anxiously for the test results."
        },
        {
            "definition": "Pass time in a particular way.",
            "pos": "verb",
            "sent1": "He waits by playing video games when he's bored.",
            "sent2": "They wait by reading books during the long car ride.",
            "sent3": "The family waits by having a picnic in the park.",
            "sent4": "She waits by painting beautiful landscapes on canvas.",
            "sent5": "The friends wait by exploring new hiking trails together."
        },
        {
            "definition": "Serve customers in a restaurant or bar.",
            "pos": "verb",
            "sent1": "The waiter waits on the table with a friendly smile.",
            "sent2": "She waits on customers efficiently during the busy lunch rush.",
            "sent3": "The bartender waits on the regulars with their favorite drinks.",
            "sent4": "He waits on the guests with professionalism and courtesy.",
            "sent5": "The waitress waits on the family with excellent service."
        },
        {
            "definition": "A period of waiting.",
            "pos": "noun",
            "sent1": "The long waits at the doctor's office can be frustrating.",
            "sent2": "She experienced a series of short waits at the airport.",
            "sent3": "The unexpected waits in line made him late for the movie.",
            "sent4": "The endless waits for the train tested her patience.",
            "sent5": "The brief waits for the elevator seemed like forever."
        }
    ]
}