{
    "term": "wakes",
    "meanings": [
        {
            "definition": "To emerge or cause to emerge from sleep",
            "pos": "verb",
            "sent1": "She wakes up early every morning to start her day.",
            "sent2": "The alarm clock wakes him at 6 AM for school.",
            "sent3": "The loud thunderstorm wakes the whole neighborhood.",
            "sent4": "The chirping birds outside her window wakes her gently.",
            "sent5": "The smell of fresh pancakes cooking wakes him with a smile."
        },
        {
            "definition": "To become alert or aware",
            "pos": "verb",
            "sent1": "The loud noise wakes her from her daydream.",
            "sent2": "He wakes up to the reality of the situation.",
            "sent3": "The unexpected news wakes him up from his boredom.",
            "sent4": "The urgent phone call wakes her to the seriousness of the matter.",
            "sent5": "The bright flash of lightning wakes him to the approaching storm."
        },
        {
            "definition": "A ceremony or gathering held after a funeral",
            "pos": "noun",
            "sent1": "The wakes are a time for family and friends to remember the departed.",
            "sent2": "The wake for the beloved teacher was filled with tears and laughter.",
            "sent3": "The wake turned into a celebration of the wonderful life lived.",
            "sent4": "The wake provided comfort and support to those grieving.",
            "sent5": "The wake brought closure and peace to all who attended."
        },
        {
            "definition": "The track or path left behind a moving ship",
            "pos": "noun",
            "sent1": "The ship's wake stretched far behind as it sailed across the ocean.",
            "sent2": "The wake of the boat created ripples in the calm water.",
            "sent3": "The seagulls followed the ship's wake looking for fish.",
            "sent4": "The sunset reflected beautifully in the ship's wake.",
            "sent5": "The dolphins played in the ship's wake, leaping joyfully."
        }
    ]
}