{
    "term": "walie",
    "meanings": [
        {
            "definition": "A large marine mammal related to the dolphin, known for its long flippers and distinctive vocalizations.",
            "pos": "noun",
            "sent1": "The walie gracefully swam through the ocean, its flippers propelling it forward.",
            "sent2": "I saw a walie at the aquarium, and it made such beautiful sounds.",
            "sent3": "The walie decided to join the choir and surprised everyone with its unique singing voice.",
            "sent4": "Her laughter echoed like the vocalizations of a walie, filling the room with joy.",
            "sent5": "The walie's majestic presence in the water left a lasting impression on all who saw it."
        },
        {
            "definition": "To move through water by using the limbs in a swimming motion.",
            "pos": "verb",
            "sent1": "She walied across the pool, enjoying the cool water on a hot day.",
            "sent2": "The ducks walie effortlessly on the pond, gliding through the water.",
            "sent3": "The cat tried to walie in the bathtub, creating a funny splashy mess.",
            "sent4": "His dreams seemed to walie through his mind, flowing from one to the next.",
            "sent5": "The boat walied smoothly through the calm lake, leaving ripples in its wake."
        },
        {
            "definition": "A large, open area of water, typically in a river or lake.",
            "pos": "noun",
            "sent1": "The sun glistened on the walie as it reflected off the calm surface of the lake.",
            "sent2": "We could see the walie stretching out before us, a vast expanse of blue.",
            "sent3": "The children pretended the backyard pool was a dangerous walie they had to cross.",
            "sent4": "Her eyes widened at the walie of tears that filled his eyes, reflecting her own sadness.",
            "sent5": "The walie of the lake seemed to go on forever, disappearing into the horizon."
        }
    ]
}