{
    "term": "wall",
    "meanings": [
        {
            "definition": "A vertical structure typically made of brick or stone used to enclose or divide an area.",
            "pos": "noun",
            "sent1": "The tall wall separated the two yards.",
            "sent2": "She leaned against the wall while waiting for her friend.",
            "sent3": "The mischievous cat tried to climb the wall but failed.",
            "sent4": "His emotions were like a wall, impossible to break through.",
            "sent5": "The ancient wall stood strong against time's passage."
        },
        {
            "definition": "A continuous vertical brick or stone structure that encloses or divides an area.",
            "pos": "noun",
            "sent1": "The long wall stretched across the entire field.",
            "sent2": "The wall surrounding the garden kept the rabbits out.",
            "sent3": "The wall seemed to whisper secrets to the wind.",
            "sent4": "Her determination was a wall blocking any doubts.",
            "sent5": "The sturdy wall protected the castle from invaders."
        },
        {
            "definition": "A high vertical surface or barrier that encloses or divides an area.",
            "pos": "noun",
            "sent1": "The sheer wall of the cliff was daunting to climb.",
            "sent2": "The wall of fog obscured the view of the valley.",
            "sent3": "The wall of sound from the concert was deafening.",
            "sent4": "Her smile was a wall of warmth in the cold room.",
            "sent5": "The wall of trees shielded the house from the wind."
        },
        {
            "definition": "To enclose or divide an area with a wall.",
            "pos": "verb",
            "sent1": "They decided to wall off the garden to protect it from animals.",
            "sent2": "He will wall the backyard to create a private space.",
            "sent3": "She tried to wall her emotions but they spilled out.",
            "sent4": "The artist walled off a section of the room for his workspace.",
            "sent5": "The villagers walled the city to defend against attacks."
        }
    ]
}