{
    "term": "wandering",
    "meanings": [
        {
            "definition": "Moving aimlessly from place to place.",
            "pos": "adjective",
            "sent1": "The lost puppy was found wandering around the neighborhood.",
            "sent2": "The wandering clouds drifted lazily across the sky.",
            "sent3": "The wandering squirrel seemed to be searching for its hidden acorns.",
            "sent4": "Her mind was like a wandering river, flowing freely in different directions.",
            "sent5": "The old man's wandering eyes showed his confusion."
        },
        {
            "definition": "Meandering or zigzagging.",
            "pos": "adjective",
            "sent1": "The wandering river twisted through the valley.",
            "sent2": "The wandering path led us through the forest.",
            "sent3": "The wandering line on the map confused the hikers.",
            "sent4": "Her handwriting was like a wandering snake on the page.",
            "sent5": "The wandering road took us on a scenic route."
        },
        {
            "definition": "Straying from a path or course.",
            "pos": "adjective",
            "sent1": "The wandering sheep had strayed from the flock.",
            "sent2": "The wandering hiker accidentally took the wrong trail.",
            "sent3": "The wandering cat explored the neighbor's garden.",
            "sent4": "Her thoughts were like wandering birds, never staying in one place.",
            "sent5": "The wandering balloon escaped into the sky."
        },
        {
            "definition": "Lost in thought or daydreaming.",
            "pos": "adjective",
            "sent1": "The wandering student often missed important details.",
            "sent2": "The wandering child stared out the window during class.",
            "sent3": "The wandering mind of the artist led to creative ideas.",
            "sent4": "Her wandering thoughts were like butterflies, fluttering around.",
            "sent5": "The wandering poet found inspiration in the stars."
        }
    ]
}