{
    "term": "wander",
    "meanings": [
        {
            "definition": "To move about without a definite destination or purpose.",
            "pos": "verb",
            "sent1": "She would often wander around the park, enjoying the fresh air.",
            "sent2": "The lost puppy began to wander through the neighborhood, searching for its home.",
            "sent3": "The curious cat decided to wander into the empty box, thinking it was a new hiding spot.",
            "sent4": "Her thoughts would wander like a leaf in the wind, never settling on one idea for long.",
            "sent5": "As the sun set, the shadows began to wander across the field, creating a beautiful scene."
        },
        {
            "definition": "To go astray from the right path or course.",
            "pos": "verb",
            "sent1": "Without a map, it's easy to wander off the hiking trail and get lost.",
            "sent2": "The distracted driver started to wander into the wrong lane, causing a near accident.",
            "sent3": "The mischievous squirrel would often wander into the bird feeder, looking for extra snacks.",
            "sent4": "Her mind would sometimes wander off during class, leading to missed information.",
            "sent5": "The old fence had begun to wander from its original position, leaning slightly to the left."
        },
        {
            "definition": "To roam or travel aimlessly.",
            "pos": "verb",
            "sent1": "The children would often wander through the forest, pretending to be explorers.",
            "sent2": "The lost hiker continued to wander in circles, unable to find the right path.",
            "sent3": "The playful puppy would wander around the yard, chasing butterflies and leaves.",
            "sent4": "Her dreams would wander to far-off lands, filled with magic and adventure.",
            "sent5": "The old sailor would often wander the docks, reminiscing about his days at sea."
        }
    ]
}