{
    "term": "wangun",
    "meanings": [
        {
            "definition": "A large, heavy stick or club",
            "pos": "noun",
            "sent1": "He swung the wangun at the tree to break it.",
            "sent2": "The warrior carried a wangun into battle.",
            "sent3": "The caveman used the wangun to play fetch with his pet dinosaur.",
            "sent4": "The wangun of justice struck down the evil sorcerer.",
            "sent5": "The wangun was as big as a tree trunk, ready to crush anything in its path."
        },
        {
            "definition": "To strike or beat with a heavy stick",
            "pos": "verb",
            "sent1": "She wanguned the drum to create a rhythm.",
            "sent2": "The lumberjack wanguned the log until it split in half.",
            "sent3": "The chef wanguned the dough to make the perfect pizza crust.",
            "sent4": "The storm wanguned the windows with rain and hail.",
            "sent5": "The boxer wanguned his opponent with powerful punches."
        },
        {
            "definition": "A loud, harsh sound",
            "pos": "noun",
            "sent1": "The thunder made a loud wangun in the sky.",
            "sent2": "The car engine made a strange wangun noise.",
            "sent3": "The old door made a spooky wangun in the haunted house.",
            "sent4": "The lion's roar echoed like a mighty wangun through the jungle.",
            "sent5": "The fireworks ended with a dazzling wangun of colors and sparks."
        },
        {
            "definition": "To make a loud, harsh sound",
            "pos": "verb",
            "sent1": "The alarm clock wanguned loudly, waking up the whole house.",
            "sent2": "The wind wanguned through the trees on a stormy night.",
            "sent3": "The kettle wanguned as it boiled water for tea.",
            "sent4": "The angry cat wanguned at the dog invading its territory.",
            "sent5": "The thunderstorm wanguned fiercely, shaking the windows with its power."
        }
    ]
}