{
    "term": "wanton",
    "meanings": [
        {
            "definition": "(of a cruel or violent action) deliberate and unprovoked",
            "pos": "adjective",
            "sent1": "The wanton destruction of the beautiful garden saddened everyone.",
            "sent2": "The wanton disregard for safety led to a dangerous situation.",
            "sent3": "The wanton squirrel stole all the nuts from the bird feeder!",
            "sent4": "Her wanton lies cut deeper than any knife.",
            "sent5": "The wanton act of vandalism left the town in shock."
        },
        {
            "definition": "(especially of a woman) sexually immodest or promiscuous",
            "pos": "adjective",
            "sent1": "The wanton behavior of the actress scandalized the public.",
            "sent2": "She was known for her wanton ways among the townspeople.",
            "sent3": "The wanton flirtation at the party raised a few eyebrows.",
            "sent4": "Her wanton dress sense left little to the imagination.",
            "sent5": "The wanton gossip spread like wildfire through the small town."
        },
        {
            "definition": "playboy or playgirl",
            "pos": "noun",
            "sent1": "He was considered a wanton among his friends for his charming ways.",
            "sent2": "The wanton was always the life of the party with their charisma.",
            "sent3": "The wanton's smooth talk could win over anyone in the room.",
            "sent4": "She saw him as a wanton, always surrounded by admirers.",
            "sent5": "The wanton's carefree attitude made them popular among peers."
        },
        {
            "definition": "a person who is sexually promiscuous",
            "pos": "noun",
            "sent1": "The town labeled him a wanton due to his numerous relationships.",
            "sent2": "She was seen as a wanton by those who disapproved of her lifestyle.",
            "sent3": "The wanton's reputation preceded them wherever they went.",
            "sent4": "He was known as a wanton, but he didn't care about others' opinions.",
            "sent5": "The wanton's love life was the talk of the town."
        },
        {
            "definition": "a sexually immodest or promiscuous woman",
            "pos": "noun",
            "sent1": "The novel portrayed her as a wanton who seduced the protagonist.",
            "sent2": "The wanton's bold advances caught everyone off guard.",
            "sent3": "The wanton's presence at the event caused quite a stir.",
            "sent4": "She played the role of a wanton in the scandalous play.",
            "sent5": "The wanton's allure was undeniable to those around her."
        }
    ]
}