{
    "term": "ward",
    "meanings": [
        {
            "definition": "A person, especially a child, who is under the care and protection of someone else.",
            "pos": "noun",
            "sent1": "The orphanage took in a new ward last week.",
            "sent2": "The social worker visited her ward regularly to ensure his well-being.",
            "sent3": "The kind old lady became the children's ward's favorite storyteller.",
            "sent4": "The school principal was like a protective ward for all the students.",
            "sent5": "The little girl felt safe and loved in her new ward's home."
        },
        {
            "definition": "A division or district of a city or town for administrative or political purposes.",
            "pos": "noun",
            "sent1": "The downtown ward was known for its bustling markets.",
            "sent2": "The city councilor represented the interests of his ward.",
            "sent3": "The mayor jokingly declared himself the ruler of the chocolate ward.",
            "sent4": "In the ward of technology, innovation was always at the forefront.",
            "sent5": "The historic ward was filled with beautiful old buildings and cobblestone streets."
        },
        {
            "definition": "To guard or protect against danger or harm.",
            "pos": "verb",
            "sent1": "The brave knight vowed to ward off any threats to the kingdom.",
            "sent2": "She used a charm to ward the house against evil spirits.",
            "sent3": "The cat tried to ward off the playful puppy with a hiss.",
            "sent4": "The scarecrow's purpose was to ward the crops from hungry birds.",
            "sent5": "The security guard was hired to ward the museum's valuable artifacts."
        },
        {
            "definition": "A separate room in a hospital for a patient.",
            "pos": "noun",
            "sent1": "The doctor checked on the patient in the emergency ward.",
            "sent2": "The hospital had a specialized ward for infectious diseases.",
            "sent3": "The children's ward was decorated with colorful murals and toys.",
            "sent4": "The recovery ward was quiet, filled with the soft hum of machines.",
            "sent5": "The maternity ward welcomed many new babies into the world."
        }
    ]
}