{
    "term": "wards",
    "meanings": [
        {
            "definition": "A division or district of a city or town for administrative or political purposes.",
            "pos": "noun",
            "sent1": "The city council discussed the new boundaries for the different wards.",
            "sent2": "Residents of the northern ward voted for their representative in the local elections.",
            "sent3": "In the game, each player had to control a different ward of the imaginary city.",
            "sent4": "The political candidate focused on winning over voters in the industrial ward.",
            "sent5": "The bustling market was located right at the heart of the commercial ward."
        },
        {
            "definition": "A person, especially a child, under the care and protection of a guardian or court.",
            "pos": "noun",
            "sent1": "The orphanage provided a safe home for many wards who had lost their parents.",
            "sent2": "The court appointed a legal guardian to look after the young ward's interests.",
            "sent3": "The mischievous ward managed to sneak out of the house past bedtime.",
            "sent4": "The caring teacher treated each student as her own ward, guiding them through challenges.",
            "sent5": "The kind-hearted couple decided to adopt a new ward into their loving family."
        },
        {
            "definition": "A separate room in a hospital for patients.",
            "pos": "noun",
            "sent1": "The hospital had to open up additional wards to accommodate the influx of flu patients.",
            "sent2": "The surgical ward was kept meticulously clean to prevent infections.",
            "sent3": "The patient in the next ward over kept playing loud music late into the night.",
            "sent4": "The hospital staff worked tirelessly to ensure each ward was properly equipped and staffed.",
            "sent5": "The children's ward was decorated with colorful murals to create a cheerful atmosphere."
        }
    ]
}