{
    "term": "wardship",
    "meanings": [
        {
            "definition": "The position or responsibility of being a guardian or protector.",
            "pos": "noun",
            "sent1": "Her wardship over the children was evident in the way she always put their needs first.",
            "sent2": "The orphanage was under the wardship of a kind-hearted woman who ensured the children were well cared for.",
            "sent3": "The teddy bear took its role of wardship seriously, watching over the other toys on the shelf.",
            "sent4": "The knight's wardship of the kingdom was unwavering, like a shield protecting its people.",
            "sent5": "In the forest, the wise owl took on the wardship of guiding lost travelers to safety."
        },
        {
            "definition": "The state of being under the protection or care of a guardian.",
            "pos": "noun",
            "sent1": "The puppy found comfort in the wardship of its loving owner.",
            "sent2": "The princess was in the wardship of her loyal knight, who kept her safe from harm.",
            "sent3": "The mischievous kitten tried to escape the wardship of its watchful owner, but to no avail.",
            "sent4": "The old lighthouse stood as a beacon of wardship, guiding ships safely through the stormy seas.",
            "sent5": "The ancient tree provided a sense of wardship to the animals that sought shelter under its branches."
        },
        {
            "definition": "The act of guarding or protecting someone or something.",
            "pos": "noun",
            "sent1": "The knight's wardship of the castle ensured its safety from invaders.",
            "sent2": "The mother's wardship of her child extended to keeping them away from danger.",
            "sent3": "The diligent squirrel took on the wardship of the acorns, burying them carefully for winter.",
            "sent4": "The guardian angel's wardship over the young girl was a comforting presence in times of trouble.",
            "sent5": "The shepherd's wardship of the flock included guiding them to fresh pastures and protecting them from wolves."
        }
    ]
}