{
    "term": "warm",
    "meanings": [
        {
            "definition": "Having or giving off a moderate degree of heat",
            "pos": "adjective",
            "sent1": "The sun felt warm on my face.",
            "sent2": "The blanket kept me warm during the cold night.",
            "sent3": "The cozy fireplace made the room warm and inviting.",
            "sent4": "Her smile was as warm as a summer day.",
            "sent5": "The freshly baked cookies filled the kitchen with a warm aroma."
        },
        {
            "definition": "To make or become warm",
            "pos": "verb",
            "sent1": "She used a hairdryer to warm her hands.",
            "sent2": "The sun will warm the earth after the rain.",
            "sent3": "The cat likes to warm itself by sitting in the sunbeam.",
            "sent4": "His words warmed her heart on a cold winter day.",
            "sent5": "The hot tea will warm you up quickly."
        },
        {
            "definition": "Friendly or kind in manner",
            "pos": "adjective",
            "sent1": "The warm smile of the receptionist made me feel welcome.",
            "sent2": "She has a warm personality that attracts others.",
            "sent3": "The warm gesture of offering her seat to the elderly lady was heartwarming.",
            "sent4": "His warm words of encouragement lifted her spirits.",
            "sent5": "The warm hug from a friend can brighten your day."
        },
        {
            "definition": "To become excited or enthusiastic",
            "pos": "verb",
            "sent1": "The crowd began to warm up as the concert started.",
            "sent2": "She will warm to the idea once she understands its benefits.",
            "sent3": "The team started to warm up for the big game.",
            "sent4": "His enthusiasm warmed the room and inspired others.",
            "sent5": "The audience warmed to the speaker's engaging presentation."
        },
        {
            "definition": "To approach a desired temperature",
            "pos": "verb",
            "sent1": "The soup needs to warm up before serving.",
            "sent2": "The oven will warm to the set temperature soon.",
            "sent3": "The water in the kettle is starting to warm up.",
            "sent4": "The car engine takes a few minutes to warm to operating temperature.",
            "sent5": "The room will warm to a comfortable level once the heater is turned on."
        }
    ]
}