{
    "term": "warped",
    "meanings": [
        {
            "definition": "Distorted or twisted out of shape",
            "pos": "adjective",
            "sent1": "The mirror showed a warped reflection of my face.",
            "sent2": "The wood had warped due to exposure to moisture.",
            "sent3": "The funhouse had a room with a warped mirror that made everyone look funny.",
            "sent4": "Her perception of reality was so warped that she couldn't distinguish truth from fiction.",
            "sent5": "The artist used a warped perspective to create a unique painting."
        },
        {
            "definition": "Abnormal or perverted in behavior or thinking",
            "pos": "adjective",
            "sent1": "His warped sense of humor often made others uncomfortable.",
            "sent2": "The villain's warped mind led him to commit heinous crimes.",
            "sent3": "The comedy show featured a character with a hilariously warped view of the world.",
            "sent4": "Her warped beliefs about society isolated her from others.",
            "sent5": "The movie portrayed a character with a deeply warped personality."
        },
        {
            "definition": "To bend or twist out of shape",
            "pos": "verb",
            "sent1": "He accidentally warped the plastic ruler by leaving it in the sun.",
            "sent2": "The heat caused the vinyl record to warp over time.",
            "sent3": "The magician claimed he could warp reality with his wand.",
            "sent4": "The intense pressure caused the metal to warp and buckle.",
            "sent5": "The force of the impact warped the car's frame."
        },
        {
            "definition": "To become distorted or twisted",
            "pos": "verb",
            "sent1": "The painting began to warp after being exposed to humidity.",
            "sent2": "Over time, the old book's pages started to warp.",
            "sent3": "The superhero's powers allowed him to warp time and space.",
            "sent4": "The fabric warped in the wash, changing its shape.",
            "sent5": "The intense heat caused the plastic to warp and deform."
        }
    ]
}