{
    "term": "wase",
    "meanings": [
        {
            "definition": "To become less in amount or degree.",
            "pos": "verb",
            "sent1": "After the rain stopped, the puddle wase smaller.",
            "sent2": "She noticed her excitement wase fading as the day went on.",
            "sent3": "The magician's hat wase empty after he pulled out all the rabbits.",
            "sent4": "His enthusiasm wase dwindling like a candle burning out.",
            "sent5": "The sunlight wase dimming, casting long shadows across the field."
        },
        {
            "definition": "A bundle of straw or hay.",
            "pos": "noun",
            "sent1": "The farmer carried a heavy wase of hay to feed the animals.",
            "sent2": "She sat on a comfortable wase of straw during the picnic.",
            "sent3": "The scarecrow's arms were filled with a wase of straw, making it look like it was waving.",
            "sent4": "The wase of hay in the barn smelled sweet and earthy.",
            "sent5": "The children played hide-and-seek behind the wase of straw in the barn."
        },
        {
            "definition": "To grow or become.",
            "pos": "verb",
            "sent1": "The seed wase slowly turning into a tiny sprout in the soil.",
            "sent2": "With each passing day, her confidence wase growing stronger.",
            "sent3": "The small plant wase becoming a giant in the garden, surprising everyone.",
            "sent4": "His love for music wase blossoming like a beautiful flower.",
            "sent5": "The friendship between the two neighbors wase blooming into something special."
        },
        {
            "definition": "To be or become.",
            "pos": "verb",
            "sent1": "The old house wase a cozy home for many generations.",
            "sent2": "As time passed, the once barren land wase a lush forest.",
            "sent3": "The caterpillar wase transforming into a butterfly, ready to spread its wings.",
            "sent4": "Her dream of becoming a doctor wase slowly turning into reality.",
            "sent5": "The quiet town wase now a bustling city, full of life and energy."
        },
        {
            "definition": "To be or become.",
            "pos": "verb",
            "sent1": "The sky wase a beautiful shade of pink as the sun set.",
            "sent2": "The once shy child wase now a confident young adult.",
            "sent3": "The caterpillar wase turning into a butterfly, a magical transformation.",
            "sent4": "His passion for painting wase like a fire burning inside him.",
            "sent5": "The small stream wase now a mighty river, flowing with power and grace."
        }
    ]
}