{
    "term": "wassailing",
    "meanings": [
        {
            "definition": "Drink plentiful amounts of alcohol and enjoy oneself with others in a noisy, lively way.",
            "pos": "verb",
            "sent1": "During the celebration, we were wassailing with our friends and having a great time.",
            "sent2": "The group of friends decided to go wassailing at the local pub to celebrate.",
            "sent3": "The neighbors found our wassailing quite entertaining as we sang and danced in the street.",
            "sent4": "The city streets echoed with the sounds of wassailing as people celebrated the festival.",
            "sent5": "The image of wassailing under the stars will forever be etched in my memory."
        },
        {
            "definition": "Go from house to house singing carols at Christmas.",
            "pos": "verb",
            "sent1": "On Christmas Eve, we wassailed through the neighborhood, spreading holiday cheer.",
            "sent2": "Children love wassailing around the town, singing carols and receiving treats.",
            "sent3": "The wassailing group accidentally knocked over a snowman while singing at a house.",
            "sent4": "The sound of wassailing voices filled the chilly night air with joy and warmth.",
            "sent5": "Wassailing with friends and family is a cherished Christmas tradition for many."
        },
        {
            "definition": "Engage in lively and noisy festivities, often involving drinking alcohol.",
            "pos": "verb",
            "sent1": "The village square was filled with people wassailing and celebrating the harvest.",
            "sent2": "At the wedding reception, guests were wassailing and toasting to the newlyweds.",
            "sent3": "The wassailing at the party got so loud that the neighbors called the police.",
            "sent4": "The atmosphere was festive and merry as everyone joined in the wassailing.",
            "sent5": "The tradition of wassailing brings the community together for a night of merriment."
        }
    ]
}