{
    "term": "wasting",
    "meanings": [
        {
            "definition": "To use or expend carelessly or extravagantly",
            "pos": "verb",
            "sent1": "She was wasting her money on unnecessary things.",
            "sent2": "He kept wasting paper by drawing on it and then throwing it away.",
            "sent3": "The squirrel was wasting its acorns by burying them in the sand.",
            "sent4": "Time was wasting away like sand slipping through an hourglass.",
            "sent5": "The leaky faucet was wasting water, drop by drop."
        },
        {
            "definition": "To fail to take advantage of or use for profit",
            "pos": "verb",
            "sent1": "They were wasting a great opportunity by not investing in the stock market.",
            "sent2": "She regretted wasting the chance to showcase her talent at the talent show.",
            "sent3": "The detective was wasting time chasing the wrong suspect.",
            "sent4": "The farmer was wasting fertile land by not planting any crops.",
            "sent5": "The student was wasting a scholarship by not attending classes regularly."
        },
        {
            "definition": "To gradually lose or cause to lose vitality or strength",
            "pos": "verb",
            "sent1": "The plant was wasting away due to lack of sunlight.",
            "sent2": "He could see his grandfather wasting with each passing day.",
            "sent3": "The superhero's powers were wasting as the villain's plot thickened.",
            "sent4": "The candle was wasting, its flame flickering weakly in the wind.",
            "sent5": "The athlete was wasting from the intense training regimen."
        },
        {
            "definition": "To become progressively weaker or more emaciated",
            "pos": "verb",
            "sent1": "The patient was wasting away as the illness took its toll.",
            "sent2": "The stray cat looked like it was wasting from lack of food.",
            "sent3": "The ice cream cone was wasting in the sun, melting quickly.",
            "sent4": "The old building was wasting, its walls crumbling with age.",
            "sent5": "The once lush garden was wasting, the flowers wilting without water."
        }
    ]
}