{
    "term": "wastable",
    "meanings": [
        {
            "definition": "Capable of being wasted or used up.",
            "pos": "adjective",
            "sent1": "The old newspapers were wastable and ready to be recycled.",
            "sent2": "Food that is left uneaten becomes wastable and should not be wasted.",
            "sent3": "She joked that her time watching TV was so wastable, she could have learned a new skill instead.",
            "sent4": "His talent for painting was so wastable that he could create masterpieces effortlessly.",
            "sent5": "The opportunities in front of him were so wastable that he had to choose wisely."
        },
        {
            "definition": "Able to be disposed of as waste.",
            "pos": "adjective",
            "sent1": "The plastic bottles were wastable and needed to be thrown in the recycling bin.",
            "sent2": "The used tissues were wastable and should be discarded properly.",
            "sent3": "The broken toy was so wastable that it ended up in the trash without a second thought.",
            "sent4": "Her old clothes were so wastable that she decided to donate them to those in need.",
            "sent5": "The disposable cups were so wastable that they were used once and then thrown away."
        },
        {
            "definition": "Suitable for being wasted or squandered.",
            "pos": "adjective",
            "sent1": "His free time was wastable, so he spent it playing video games.",
            "sent2": "Money that is not wisely spent becomes wastable and leads to financial troubles.",
            "sent3": "The opportunity to travel was so wastable that she decided to explore new destinations.",
            "sent4": "Her potential was so wastable that she knew she had to make the most of every chance she got.",
            "sent5": "The resources were so wastable that they needed to be managed carefully to avoid depletion."
        }
    ]
}