{
    "term": "wasted",
    "meanings": [
        {
            "definition": "To use or expend carelessly or extravagantly",
            "pos": "verb",
            "sent1": "She wasted all her money on unnecessary things.",
            "sent2": "He wasted his time playing video games instead of studying.",
            "sent3": "The squirrel wasted its acorns by burying them in the wrong place.",
            "sent4": "The leaky faucet wasted water like a broken dam.",
            "sent5": "The careless chef wasted ingredients by burning the dish."
        },
        {
            "definition": "To fail to use or take advantage of",
            "pos": "verb",
            "sent1": "They wasted a great opportunity by not attending the meeting.",
            "sent2": "She wasted her talent by never practicing her skills.",
            "sent3": "The cat wasted the chance to catch the mouse by falling asleep.",
            "sent4": "The student wasted the chance to learn by skipping class.",
            "sent5": "The farmer wasted the fertile land by not planting any crops."
        },
        {
            "definition": "To become physically or mentally exhausted",
            "pos": "verb",
            "sent1": "After running the marathon, he felt completely wasted.",
            "sent2": "She was wasted after a long day of hiking in the mountains.",
            "sent3": "The dog looked wasted after playing fetch for hours.",
            "sent4": "The workers were wasted after a full day of construction.",
            "sent5": "The kids were wasted after playing at the park all day."
        },
        {
            "definition": "To become intoxicated by alcohol or drugs",
            "pos": "verb",
            "sent1": "He got wasted at the party and couldn't remember anything.",
            "sent2": "She felt wasted after drinking too much wine.",
            "sent3": "The bear looked wasted after eating fermented berries.",
            "sent4": "The teenager got wasted at the concert and had to be carried home.",
            "sent5": "The friends got wasted together at the bar and laughed all night."
        }
    ]
}