{
    "term": "wasters",
    "meanings": [
        {
            "definition": "A person who wastes time or resources.",
            "pos": "noun",
            "sent1": "She is always late and never finishes her work on time, making her one of the biggest wasters in the office.",
            "sent2": "The wasters in the group spent the whole day chatting instead of working on the project.",
            "sent3": "The wasters at the party were the last ones to leave, enjoying every minute without a care.",
            "sent4": "He was a waster of opportunities, letting every chance slip through his fingers.",
            "sent5": "The wasters in the marathon lagged behind, stopping to take selfies along the way."
        },
        {
            "definition": "Plural form of 'waster', referring to someone who is wasteful.",
            "pos": "noun",
            "sent1": "The wasters in the neighborhood always leave their lights on, wasting electricity.",
            "sent2": "She scolded her children for being wasters and not turning off the water while brushing their teeth.",
            "sent3": "The wasters in the family finished all the snacks in one sitting, leaving nothing for later.",
            "sent4": "He was known as one of the biggest wasters in the company, constantly overspending on unnecessary items.",
            "sent5": "The wasters in the class never recycled their paper, contributing to the growing pile of waste."
        },
        {
            "definition": "Plural form of 'waster', referring to items that are wasted or thrown away.",
            "pos": "noun",
            "sent1": "The kitchen bin was full of food wasters, leftovers from last night's dinner.",
            "sent2": "The environmentalist group organized a cleanup to collect plastic wasters from the beach.",
            "sent3": "The garden was full of plant wasters, dried-up flowers that had wilted in the sun.",
            "sent4": "The garage was cluttered with electronic wasters, old gadgets that were no longer in use.",
            "sent5": "The dumpster behind the supermarket was overflowing with cardboard wasters, boxes that had been discarded."
        }
    ]
}