{
    "term": "wataps",
    "meanings": [
        {
            "definition": "A type of aquatic plant.",
            "pos": "noun",
            "sent1": "The wataps swayed gently in the water.",
            "sent2": "The pond was filled with colorful wataps.",
            "sent3": "The curious ducks nibbled on the wataps, mistaking them for food.",
            "sent4": "The wataps in the lake danced with the ripples of the water.",
            "sent5": "The wataps added a touch of beauty to the serene pond."
        },
        {
            "definition": "A type of traditional Native American dance.",
            "pos": "noun",
            "sent1": "During the ceremony, the dancers performed the wataps with grace.",
            "sent2": "The community gathered to watch the mesmerizing wataps.",
            "sent3": "The children giggled as they tried to imitate the wataps in their own dance.",
            "sent4": "The wataps seemed to tell a story through their movements.",
            "sent5": "The rhythmic beat of the wataps echoed through the village square."
        },
        {
            "definition": "A type of traditional Native American drum.",
            "pos": "noun",
            "sent1": "The sound of the wataps filled the air, signaling the start of the ceremony.",
            "sent2": "The elders played the wataps with skill and reverence.",
            "sent3": "The young boy's eyes widened in awe as he listened to the powerful wataps.",
            "sent4": "The wataps echoed through the forest, calling all to gather.",
            "sent5": "The rhythmic pounding of the wataps resonated in the night."
        },
        {
            "definition": "A type of traditional Native American song.",
            "pos": "noun",
            "sent1": "The haunting melody of the wataps lingered in the air.",
            "sent2": "The singers harmonized beautifully during the wataps.",
            "sent3": "The wataps carried the hopes and dreams of the tribe in their lyrics.",
            "sent4": "The wataps wove a tale of love and loss through their music.",
            "sent5": "The sweet voices of the wataps enchanted all who listened."
        }
    ]
}