{
    "term": "watched",
    "meanings": [
        {
            "definition": "To look at or observe attentively over a period of time.",
            "pos": "verb",
            "sent1": "I watched the sunset slowly disappear behind the mountains.",
            "sent2": "She watched the birds flying in the sky with fascination.",
            "sent3": "The cat watched the mouse intently, waiting for the perfect moment to pounce.",
            "sent4": "The old man watched the world change around him, like a silent observer of time.",
            "sent5": "The children watched the magician's tricks with wide eyes and amazement."
        },
        {
            "definition": "To be vigilant or alert.",
            "pos": "verb",
            "sent1": "The security guard watched the entrance for any suspicious activity.",
            "sent2": "The dog watched the house, ready to bark at any unfamiliar noise.",
            "sent3": "The owl watched the forest at night, its eyes sharp and focused.",
            "sent4": "The soldier watched the horizon, scanning for any signs of movement.",
            "sent5": "The lifeguard watched the swimmers carefully, ensuring their safety in the water."
        },
        {
            "definition": "To keep guard or keep a lookout.",
            "pos": "verb",
            "sent1": "The knight watched over the sleeping princess in the tower.",
            "sent2": "The parent watched their child play in the park, making sure they were safe.",
            "sent3": "The scarecrow watched the fields, scaring away any hungry birds.",
            "sent4": "The lighthouse watched over the stormy sea, guiding ships to safety.",
            "sent5": "The shepherd watched the flock of sheep, protecting them from predators."
        },
        {
            "definition": "To observe or pay attention to something.",
            "pos": "verb",
            "sent1": "The scientist watched the experiment closely, noting every detail.",
            "sent2": "The student watched the teacher explain the math problem step by step.",
            "sent3": "The detective watched the suspect's behavior, looking for any signs of guilt.",
            "sent4": "The audience watched the play with rapt attention, enjoying every scene.",
            "sent5": "The photographer watched the changing light, capturing the perfect moment on film."
        }
    ]
}