{
    "term": "watching",
    "meanings": [
        {
            "definition": "To look at or observe attentively",
            "pos": "verb",
            "sent1": "I enjoy watching the birds in the park.",
            "sent2": "She was watching the movie with great interest.",
            "sent3": "While watching the clouds, I imagined shapes in them.",
            "sent4": "Her eyes were like a hawk watching its prey.",
            "sent5": "The detective was watching the suspect's every move."
        },
        {
            "definition": "To be on the lookout for; keep an eye on",
            "pos": "verb",
            "sent1": "The security guard is watching for any suspicious activity.",
            "sent2": "I am watching the road for any signs of traffic.",
            "sent3": "He was watching the street for his friend's arrival.",
            "sent4": "She was watching the market prices like a hawk.",
            "sent5": "The teacher is watching the students during the exam."
        },
        {
            "definition": "To be vigilant or alert",
            "pos": "verb",
            "sent1": "The soldier was watching for any movement in the bushes.",
            "sent2": "I am watching out for any changes in the weather.",
            "sent3": "She was watching carefully for any mistakes in the document.",
            "sent4": "The cat was watching the mouse intently.",
            "sent5": "The lifeguard is watching the swimmers in the pool."
        },
        {
            "definition": "A period of time during which a person is on duty, especially as a guard or sentinel",
            "pos": "noun",
            "sent1": "The night watching was quiet and uneventful.",
            "sent2": "He took over the watching duty at midnight.",
            "sent3": "During the watching, he heard a rustling noise.",
            "sent4": "The watching at the gate was crucial for security.",
            "sent5": "The soldier's watching lasted until dawn."
        }
    ]
}