{
    "term": "waterjets",
    "meanings": [
        {
            "definition": "A propulsion system that uses high-pressure water to propel a vehicle or object forward.",
            "pos": "noun",
            "sent1": "The boat moved swiftly thanks to its powerful waterjets.",
            "sent2": "The waterjets on the jet ski helped it move quickly across the lake.",
            "sent3": "The waterjets on the submarine were so strong that they made the fish nearby swim faster!",
            "sent4": "Her enthusiasm was like waterjets, propelling her towards her goals with great force.",
            "sent5": "The waterjets roared to life, pushing the ship through the waves with incredible speed."
        },
        {
            "definition": "A cutting tool that uses a high-pressure stream of water to cut through materials.",
            "pos": "noun",
            "sent1": "The industrial waterjets sliced through the metal effortlessly.",
            "sent2": "The precision of the waterjets made cutting through the thick material a breeze.",
            "sent3": "The waterjets in the workshop were so sharp that they could even slice through diamonds!",
            "sent4": "Her words were like waterjets, cutting through the tension in the room with ease.",
            "sent5": "The waterjets sprayed out, carving intricate patterns into the stone surface."
        },
        {
            "definition": "A type of propulsion system used in marine vessels that uses water ejected at high speeds to propel the vessel forward.",
            "pos": "noun",
            "sent1": "The speedboat's waterjets pushed it through the water at an incredible pace.",
            "sent2": "The waterjets on the yacht allowed it to glide smoothly across the ocean.",
            "sent3": "The waterjets on the cruise ship were so powerful that they created a mini whirlpool behind it!",
            "sent4": "His determination was like waterjets, driving him towards success with unstoppable force.",
            "sent5": "The waterjets surged, propelling the submarine silently through the depths of the sea."
        }
    ]
}