{
    "term": "watermark",
    "meanings": [
        {
            "definition": "A faint design made in some paper during manufacture, visible when held against the light.",
            "pos": "noun",
            "sent1": "The watermark on the paper showed a delicate pattern when light passed through.",
            "sent2": "I could see the watermark on the certificate when I held it up to the window.",
            "sent3": "The detective examined the ransom note, looking for a hidden watermark that could reveal the culprit.",
            "sent4": "Her memories were like a watermark, always present but sometimes fading into the background.",
            "sent5": "The watermark on the document was so intricate, it seemed like a secret code."
        },
        {
            "definition": "A distinguishing mark or symbol imprinted on paper to identify its authenticity.",
            "pos": "noun",
            "sent1": "The watermark on the currency ensured its genuineness.",
            "sent2": "The watermark on the painting confirmed its originality.",
            "sent3": "The cat wore a tiny watermark on its collar, making it look like a special pet.",
            "sent4": "Her smile was like a watermark, a unique signature of her happiness.",
            "sent5": "The watermark on the letter was like a seal of approval, guaranteeing its legitimacy."
        },
        {
            "definition": "To mark (paper) with a watermark.",
            "pos": "verb",
            "sent1": "She would watermark each page of the document with the company logo.",
            "sent2": "The artist decided to watermark his sketches to prevent unauthorized use.",
            "sent3": "The chef playfully suggested watermarking the recipe cards to protect their secret ingredients.",
            "sent4": "His words seemed to watermark her heart, leaving an indelible impression.",
            "sent5": "The rain seemed to watermark the sidewalk, leaving temporary imprints of its path."
        }
    ]
}