{
    "term": "wattles",
    "meanings": [
        {
            "definition": "A fleshy lobe or appendage hanging down from the throat or chin of a bird or other animal.",
            "pos": "noun",
            "sent1": "The rooster proudly displayed its bright red wattles.",
            "sent2": "The turkey's wattles wobbled as it strutted around the farm.",
            "sent3": "The duck with the longest wattles won the 'Best Dressed' award at the animal fashion show.",
            "sent4": "Her cheeks flushed, resembling the vibrant wattles of a rooster.",
            "sent5": "The dangling wattles of the rooster caught the sunlight, creating a beautiful sight."
        },
        {
            "definition": "A number of rods or stakes interwoven with twigs or tree branches for making fences, walls, etc.",
            "pos": "noun",
            "sent1": "The farmer used wattles to create a sturdy fence around the garden.",
            "sent2": "The villagers built their homes using wattles and mud.",
            "sent3": "The mischievous goat managed to sneak through the wattle fence and into the vegetable patch.",
            "sent4": "The wattle walls of the ancient castle stood strong against the test of time.",
            "sent5": "The intricate design of the wattle fence added a rustic charm to the countryside."
        },
        {
            "definition": "A fold of skin hanging from the neck of a person, especially in old age.",
            "pos": "noun",
            "sent1": "Grandma's wattles jiggled as she laughed heartily at the family dinner.",
            "sent2": "The elderly gentleman's wattles swayed gently in the breeze.",
            "sent3": "The comedian joked that his wattles were a sign of wisdom and experience.",
            "sent4": "She affectionately referred to her neck wattles as 'granny flaps'.",
            "sent5": "The portrait artist captured every detail, including the delicate wattles under the subject's chin."
        }
    ]
}