{
    "term": "wavicle",
    "meanings": [
        {
            "definition": "A wavicle is a theoretical particle that exhibits both wave-like and particle-like properties.",
            "pos": "noun",
            "sent1": "The scientist explained how a wavicle can behave like both a wave and a particle.",
            "sent2": "I read about a wavicle in my science book and learned it has unique properties.",
            "sent3": "The wavicle decided to act like a wave one day and a particle the next, causing confusion in the lab.",
            "sent4": "Her personality was like a wavicle, sometimes calm like a wave and other times energetic like a particle.",
            "sent5": "The wavicle's behavior was so unpredictable, just like the dual nature of light.",
            "sent6": "In the experiment, the wavicle demonstrated its dual nature by creating interference patterns.",
            "sent7": "The wavicle's behavior puzzled the researchers, as it seemed to defy traditional physics laws.",
            "sent8": "When the wavicle was observed, it collapsed into a single state, revealing its particle-like nature.",
            "sent9": "The wavicle's existence challenged scientists to rethink their understanding of the fundamental nature of matter."
        },
        {
            "definition": "To wavicle is to move in a wavicle-like manner, displaying characteristics of both waves and particles.",
            "pos": "verb",
            "sent1": "She tried to wavicle through the crowd gracefully, blending in like a wave and a particle.",
            "sent2": "The dancer's movements seemed to wavicle on stage, captivating the audience with their fluidity.",
            "sent3": "As he attempted to wavicle across the room, he accidentally bumped into a table, causing a commotion.",
            "sent4": "Her thoughts seemed to wavicle between excitement and nervousness, much like the behavior of subatomic particles.",
            "sent5": "The way he could wavicle through different social circles amazed his friends, like a chameleon changing colors.",
            "sent6": "The cat tried to wavicle through the narrow gap in the door, its body contorting to fit the space.",
            "sent7": "The robot was programmed to wavicle through obstacles using sensors to detect its surroundings.",
            "sent8": "When she danced, it was as if she could wavicle between dimensions, moving with an otherworldly grace.",
            "sent9": "His ability to wavicle seamlessly between tasks made him a valuable asset to the team."
        }
    ]
}