{
    "term": "weak",
    "meanings": [
        {
            "definition": "Lacking physical strength or energy",
            "pos": "adjective",
            "sent1": "After being sick, he felt very weak and tired.",
            "sent2": "The old bridge looked weak and shaky.",
            "sent3": "The weak kitten tried to meow loudly but only managed a squeak.",
            "sent4": "Her weak attempt at singing made everyone cringe.",
            "sent5": "The weak flame flickered and almost went out."
        },
        {
            "definition": "Not able to withstand great force or pressure",
            "pos": "adjective",
            "sent1": "The weak rope snapped under the heavy load.",
            "sent2": "The weak lock couldn't keep the door closed.",
            "sent3": "The weak umbrella turned inside out in the strong wind.",
            "sent4": "His weak argument fell apart under scrutiny.",
            "sent5": "The weak dam burst under the pressure of the water."
        },
        {
            "definition": "Lacking in power or influence",
            "pos": "adjective",
            "sent1": "The weak ruler had little control over the kingdom.",
            "sent2": "Her weak position in the company made it hard to make decisions.",
            "sent3": "The weak battery couldn't even power a small toy.",
            "sent4": "His weak voice was easily drowned out in the crowd.",
            "sent5": "The weak leader struggled to rally support for the cause."
        },
        {
            "definition": "Lacking in intensity or quality",
            "pos": "adjective",
            "sent1": "The weak coffee tasted bland and watery.",
            "sent2": "The weak signal on the radio kept cutting out.",
            "sent3": "The weak joke fell flat with no one laughing.",
            "sent4": "Her weak attempt at painting lacked depth and color.",
            "sent5": "The weak sunlight barely illuminated the room."
        }
    ]
}