{
    "term": "wear",
    "meanings": [
        {
            "definition": "To have on one's body as clothing",
            "pos": "verb",
            "sent1": "I wear my favorite blue shirt to school every Monday.",
            "sent2": "She likes to wear a warm sweater in the winter.",
            "sent3": "Why does the superhero wear a cape to bed?",
            "sent4": "His smile is like a badge he wears proudly.",
            "sent5": "The princess wears a crown made of flowers."
        },
        {
            "definition": "To deteriorate or diminish through use",
            "pos": "verb",
            "sent1": "The old book shows signs of wear on its cover.",
            "sent2": "The tires on the car wear out after many miles of driving.",
            "sent3": "The toy bear started to wear down after years of play.",
            "sent4": "His patience began to wear thin as the meeting dragged on.",
            "sent5": "The constant rain can wear away the rocks over time."
        },
        {
            "definition": "To endure or tolerate",
            "pos": "verb",
            "sent1": "I can wear the cold weather better with a thick jacket.",
            "sent2": "She can wear the spicy food without any problem.",
            "sent3": "He decided to wear the boring lecture for the sake of his friend.",
            "sent4": "She wears the pain of her past with grace and strength.",
            "sent5": "The soldier must wear the harsh conditions of battle."
        },
        {
            "definition": "To exhibit or present a particular appearance or expression",
            "pos": "verb",
            "sent1": "The actor knows how to wear a confident smile on stage.",
            "sent2": "She can wear a look of surprise like no one else.",
            "sent3": "The magician will wear a mysterious expression during the trick.",
            "sent4": "His words wear a cloak of wisdom beyond his years.",
            "sent5": "The painting wears the colors of a beautiful sunset."
        }
    ]
}