{
    "term": "webby",
    "meanings": [
        {
            "definition": "Covered in or resembling a web",
            "pos": "adjective",
            "sent1": "The old abandoned house had a webby corner where spiders liked to hide.",
            "sent2": "The Halloween decorations included fake spiders and webby cotton stretched across the door.",
            "sent3": "The cat's playful antics left a webby mess of yarn all over the living room.",
            "sent4": "The fog was so thick it draped the trees in a webby shroud, obscuring everything beyond.",
            "sent5": "The morning dew made the grass look webby, with delicate strands glistening in the sunlight."
        },
        {
            "definition": "Having a tendency to form webs",
            "pos": "adjective",
            "sent1": "The dusty attic was a webby space, perfect for spiders to spin their intricate traps.",
            "sent2": "The garden shed, with its neglected corners, had become quite webby over the years.",
            "sent3": "The chef's messy cooking style always resulted in a webby mess of flour and ingredients everywhere.",
            "sent4": "Her mind was a webby maze of thoughts, each leading to a different idea or memory.",
            "sent5": "The artist's studio was a webby chaos of paints, brushes, and unfinished canvases."
        },
        {
            "definition": "Resembling a spider's web",
            "pos": "adjective",
            "sent1": "The delicate necklace was adorned with a webby pattern of silver strands.",
            "sent2": "The intricate lace curtains cast a webby shadow on the floor in the afternoon sun.",
            "sent3": "The cake was decorated with a webby design of frosting, resembling a spider's creation.",
            "sent4": "Her words wove a webby tale of mystery and intrigue, capturing the listeners' attention.",
            "sent5": "The fog settled over the valley, creating a webby veil that obscured the distant mountains."
        }
    ]
}