{
    "term": "weedy",
    "meanings": [
        {
            "definition": "Full of or resembling weeds.",
            "pos": "adjective",
            "sent1": "The garden looked weedy with all the wild plants growing everywhere.",
            "sent2": "The field was weedy, with tall grasses and dandelions covering the ground.",
            "sent3": "The weedy yard was like a jungle, hiding all sorts of creatures within its overgrown foliage.",
            "sent4": "Her mind felt weedy, tangled with thoughts that seemed to grow uncontrollably.",
            "sent5": "The weedy landscape stretched out before us, a sea of green unruly chaos."
        },
        {
            "definition": "Thin or weak in appearance.",
            "pos": "adjective",
            "sent1": "The stray cat looked weedy, its fur matted and thin from lack of food.",
            "sent2": "The old tree appeared weedy, its branches sparse and fragile in the wind.",
            "sent3": "Despite his weedy frame, he surprised everyone with his strength during the race.",
            "sent4": "Her voice sounded weedy, barely audible over the noise of the crowd.",
            "sent5": "The weedy figure in the distance seemed to fade into the background, almost invisible."
        },
        {
            "definition": "Containing an excessive amount of weeds.",
            "pos": "adjective",
            "sent1": "The neglected garden was weedy, overrun with unwanted plants choking out the flowers.",
            "sent2": "The path through the forest was weedy, making it difficult to walk without getting tangled.",
            "sent3": "The weedy lawn seemed to have a life of its own, sprouting new weeds overnight.",
            "sent4": "Her thoughts were weedy, filled with doubts and worries that crowded out any positivity.",
            "sent5": "The weedy field whispered secrets of neglect, the weeds hiding mysteries beneath their tangled growth."
        }
    ]
}