{
    "term": "weeing",
    "meanings": [
        {
            "definition": "Urinating",
            "pos": "verb",
            "sent1": "The puppy is weeing on the grass.",
            "sent2": "I heard someone weeing in the bathroom.",
            "sent3": "The tree must be jealous of the puppy's weeing spot.",
            "sent4": "The rain weeing down from the sky was a refreshing sight.",
            "sent5": "The sound of weeing water in the fountain was soothing."
        },
        {
            "definition": "The act of passing urine",
            "pos": "noun",
            "sent1": "After drinking a lot of water, the weeing was inevitable.",
            "sent2": "The doctor asked for a sample of my weeing for testing.",
            "sent3": "The weeing competition at the fair was surprisingly popular.",
            "sent4": "The weeing of the fountain created a calming atmosphere in the park.",
            "sent5": "The weeing of the baby brought smiles to everyone's faces."
        },
        {
            "definition": "To urinate",
            "pos": "verb",
            "sent1": "I need to find a bush to do some weeing.",
            "sent2": "The urge to weeing woke me up in the middle of the night.",
            "sent3": "The cat seems to enjoy weeing in the flowerbed.",
            "sent4": "The athlete had to hold off weeing until after the race.",
            "sent5": "The sound of weeing echoed in the quiet forest."
        },
        {
            "definition": "Urine being passed from the body",
            "pos": "noun",
            "sent1": "The nurse checked the patient's weeing for any abnormalities.",
            "sent2": "The color of the weeing can indicate hydration levels.",
            "sent3": "The weeing of the fountain attracted curious onlookers.",
            "sent4": "The weeing of the baby was a sign of good health.",
            "sent5": "The weeing of the dog left a trail on the sidewalk."
        }
    ]
}