{
    "term": "weighted",
    "meanings": [
        {
            "definition": "Having a heavy weight or mass.",
            "pos": "adjective",
            "sent1": "The weighted blanket felt comforting and cozy on the chilly night.",
            "sent2": "The elephant's trunk was weighted down by the delicious fruit it carried.",
            "sent3": "The weighted backpack made the little girl look like a tiny explorer on a big adventure.",
            "sent4": "His heart felt weighted with sadness as he watched the sunset alone.",
            "sent5": "The weighted dice always seemed to roll in his favor during game night."
        },
        {
            "definition": "Adjusted or altered to reflect a particular factor or consideration.",
            "pos": "adjective",
            "sent1": "The weighted average took into account the importance of each test in the final grade.",
            "sent2": "The weighted decision considered both cost and quality before making a choice.",
            "sent3": "The weighted scale made sure to give extra points for creativity in the art competition.",
            "sent4": "Her words were like a weighted net, capturing the attention of everyone in the room.",
            "sent5": "The weighted algorithm ensured fair distribution of resources among the team members."
        },
        {
            "definition": "Influenced or biased in a particular direction.",
            "pos": "adjective",
            "sent1": "The weighted survey questions were designed to elicit specific responses.",
            "sent2": "The weighted coin always seemed to land on the same side during the magic trick.",
            "sent3": "His opinion felt a bit weighted towards his favorite team winning the championship.",
            "sent4": "The weighted scale tipped in favor of the candidate with more experience.",
            "sent5": "Her smile seemed a bit weighted, hinting at hidden emotions beneath the surface."
        }
    ]
}