{
    "term": "weigh",
    "meanings": [
        {
            "definition": "To find out how heavy something is using a scale or balance.",
            "pos": "verb",
            "sent1": "I will weigh the apples to see how heavy they are.",
            "sent2": "She weighed the suitcase before going to the airport.",
            "sent3": "The curious cat tried to weigh itself on the bathroom scale.",
            "sent4": "His words seemed to weigh more than his actions.",
            "sent5": "The decision to adopt a pet should weigh heavily on your mind."
        },
        {
            "definition": "To have a specified weight.",
            "pos": "verb",
            "sent1": "The bag of rice weighs five pounds.",
            "sent2": "The baby elephant weighs about 200 pounds.",
            "sent3": "The featherweight boxer could hardly weigh down the punching bag.",
            "sent4": "Her words seemed to weigh a ton on his heart.",
            "sent5": "The responsibility of being a leader can weigh on a person."
        },
        {
            "definition": "To consider carefully before making a decision.",
            "pos": "verb",
            "sent1": "Before buying a car, you should weigh all your options.",
            "sent2": "He weighed the pros and cons of studying abroad.",
            "sent3": "Trying to weigh the decision, she ended up flipping a coin.",
            "sent4": "The consequences of his actions began to weigh heavily on him.",
            "sent5": "It's important to weigh the consequences of your choices."
        },
        {
            "definition": "To have a specified importance or influence.",
            "pos": "verb",
            "sent1": "His opinion will weigh heavily in our final decision.",
            "sent2": "The feedback from customers weighs a lot in our product development.",
            "sent3": "The cat's meow seemed to weigh more than the dog's bark.",
            "sent4": "Her experience in the field will weigh significantly in the hiring process.",
            "sent5": "The support of your loved ones can weigh greatly in times of need."
        }
    ]
}