{
    "term": "wejack",
    "meanings": [
        {
            "definition": "A small, carnivorous mammal native to North America.",
            "pos": "noun",
            "sent1": "The wejack scurried through the forest looking for food.",
            "sent2": "I saw a wejack dart across the trail while hiking in the woods.",
            "sent3": "The wejack tried to steal the picnic basket but got caught in the act.",
            "sent4": "Her eyes gleamed like a wejack hunting its prey in the night.",
            "sent5": "The wejack's sharp teeth and quick movements make it a formidable predator."
        },
        {
            "definition": "To steal or pilfer.",
            "pos": "verb",
            "sent1": "He tried to wejack some cookies from the jar when no one was looking.",
            "sent2": "The thief managed to wejack the valuable painting from the museum.",
            "sent3": "The mischievous raccoon wejacked the shiny trinkets from the campsite.",
            "sent4": "She wejacked a glance at the test answers before the teacher noticed.",
            "sent5": "The pickpocket skillfully wejacked the wallet from the distracted tourist."
        },
        {
            "definition": "A type of trap used for catching animals.",
            "pos": "noun",
            "sent1": "The hunter set up a wejack to catch rabbits in the field.",
            "sent2": "The wejack was baited with fresh vegetables to attract the hungry animals.",
            "sent3": "The wejack snapped shut, trapping the curious raccoon inside.",
            "sent4": "The wejack lay hidden in the grass, ready to spring at any moment.",
            "sent5": "The wejack's mechanism was designed to swiftly capture its prey without harm."
        },
        {
            "definition": "To deceive or outwit someone.",
            "pos": "verb",
            "sent1": "She tried to wejack her brother by hiding his favorite toy.",
            "sent2": "The con artist wejacked unsuspecting victims out of their savings.",
            "sent3": "The magician wejacked the audience with his clever sleight of hand tricks.",
            "sent4": "He wejacked his opponent by pretending to move left but then dodging right.",
            "sent5": "The spy wejacked the enemy agents by feeding them false information."
        }
    ]
}