{
    "term": "wendigoes",
    "meanings": [
        {
            "definition": "Wendigoes: plural noun, mythical creatures in Algonquian folklore known for their insatiable hunger for human flesh.",
            "pos": "noun",
            "sent1": "Legends tell of wendigoes lurking in the dark forests, waiting to feast on unsuspecting travelers.",
            "sent2": "The villagers whispered fearfully about the wendigoes that haunted the nearby mountains.",
            "sent3": "The children giggled nervously, pretending to be wendigoes during their game of hide-and-seek.",
            "sent4": "The hunger in his eyes was like that of a wendigo, consuming everything in its path.",
            "sent5": "The howls of the wendigoes echoed through the night, sending shivers down everyone's spines."
        },
        {
            "definition": "Wendigoes: verb, to transform into or be possessed by a wendigo.",
            "pos": "verb",
            "sent1": "Beware, for those who wander too far into the woods may wendigoes themselves.",
            "sent2": "She felt a chill as if a dark presence was wendigoes her very soul.",
            "sent3": "The old tale warned of the consequences of wendigoes without caution.",
            "sent4": "His anger seemed to wendigoes him, turning him into a creature of pure rage.",
            "sent5": "The curse was said to wendigoes anyone who dared to disturb the sacred grounds."
        },
        {
            "definition": "Wendigoes: adjective, describing something related to or resembling a wendigo.",
            "pos": "adjective",
            "sent1": "The eerie howls in the night had a wendigoes quality that sent chills down their spines.",
            "sent2": "The forest was filled with a wendigoes atmosphere, making it feel haunted and dangerous.",
            "sent3": "The abandoned cabin had a wendigoes look to it, with claw marks on the walls.",
            "sent4": "Her eyes had a wendigoes glint, hinting at a hunger that could not be satisfied.",
            "sent5": "The chill wind carried a wendigoes scent, triggering primal fears in all who caught a whiff."
        }
    ]
}