{
    "term": "wet",
    "meanings": [
        {
            "definition": "Covered or saturated with water or another liquid.",
            "pos": "adjective",
            "sent1": "The dog's fur was wet after playing in the rain.",
            "sent2": "She wore a raincoat to stay dry in the wet weather.",
            "sent3": "The wet grass made the dog slip and slide comically.",
            "sent4": "Her eyes were wet with tears of joy when she saw the surprise.",
            "sent5": "The wet paint on the canvas glistened under the bright light."
        },
        {
            "definition": "Rainy weather.",
            "pos": "noun",
            "sent1": "We canceled the picnic due to the wet forecast.",
            "sent2": "The wet lasted for days, causing flooding in the area.",
            "sent3": "The wet made the outdoor concert a muddy mess.",
            "sent4": "In the wet, umbrellas bloomed like colorful flowers in the crowd.",
            "sent5": "The wet brought a sense of coziness as they watched movies indoors."
        },
        {
            "definition": "To make something wet by adding liquid.",
            "pos": "verb",
            "sent1": "She would wet the sponge before cleaning the table.",
            "sent2": "Please do not wet the floor while mopping.",
            "sent3": "He accidentally wet his shirt while watering the plants.",
            "sent4": "The chef would wet the dough with a sprinkle of water.",
            "sent5": "The children loved to wet the sidewalk with water from the hose."
        },
        {
            "definition": "To be in a liquid state.",
            "pos": "verb",
            "sent1": "The ice cream started to wet in the sun.",
            "sent2": "The candle began to wet as it melted on the table.",
            "sent3": "The chocolate began to wet in her hand from the warmth.",
            "sent4": "The snowman slowly began to wet under the spring sun.",
            "sent5": "The butter would wet and spread easily on the warm toast."
        }
    ]
}