{
    "term": "wexe",
    "meanings": [
        {
            "definition": "To grow or increase in size or intensity.",
            "pos": "verb",
            "sent1": "The flowers wexe beautifully in the garden.",
            "sent2": "The excitement wexe as the party approached.",
            "sent3": "The cake seemed to wexe taller as more layers were added.",
            "sent4": "Her happiness wexe like a balloon filling with air.",
            "sent5": "The tree's branches wexe towards the sky, reaching for the sun."
        },
        {
            "definition": "To come into being or existence.",
            "pos": "verb",
            "sent1": "The idea wexe in his mind suddenly.",
            "sent2": "A new star wexe in the night sky.",
            "sent3": "The plan seemed to wexe out of thin air.",
            "sent4": "Her smile wexe like a sunrise on a cloudy day.",
            "sent5": "Hope wexe in her heart like a seed sprouting in spring."
        },
        {
            "definition": "To become.",
            "pos": "verb",
            "sent1": "The caterpillar wexe a butterfly.",
            "sent2": "With hard work, dreams can wexe reality.",
            "sent3": "His confidence wexe as he practiced more.",
            "sent4": "The city wexe a bustling metropolis over time.",
            "sent5": "Her voice wexe stronger with each performance."
        },
        {
            "definition": "",
            "pos": "adjective",
            "sent1": "The mysterious potion had a wexe effect on the villagers.",
            "sent2": "The wizard's cloak had a wexe glow under the moonlight.",
            "sent3": "The old book had a wexe smell of ancient pages.",
            "sent4": "The forest was filled with wexe creatures of folklore.",
            "sent5": "The castle stood tall and wexe against the stormy sky."
        },
        {
            "definition": "te: 'Wexe' is not a commonly used word in English, so the definitions provided are based on its Old English usage.)",
            "pos": "noun",
            "sent1": "In the tale, the wexe of the hero was legendary.",
            "sent2": "The wexe of the dragon's fire was feared by all.",
            "sent3": "The wizard's spell required a rare wexe to complete.",
            "sent4": "The village celebrated the wexe of a new leader.",
            "sent5": "Legends spoke of the wexe of a magical sword hidden in the mountains."
        }
    ]
}