{
    "term": "whack",
    "meanings": [
        {
            "definition": "A sharp blow or hit.",
            "pos": "noun",
            "sent1": "He gave the table a whack with his fist.",
            "sent2": "The boxer delivered a powerful whack to his opponent's jaw.",
            "sent3": "The clown's whack on the drum made everyone laugh.",
            "sent4": "The thunder sounded like a giant whack on the roof.",
            "sent5": "The sound of the hammer hitting the nail was a loud whack."
        },
        {
            "definition": "To strike forcefully.",
            "pos": "verb",
            "sent1": "She whacked the ball with the bat.",
            "sent2": "The chef whacked the garlic to crush it.",
            "sent3": "The cat whacked the toy mouse around the room.",
            "sent4": "The wind whacked against the windows all night.",
            "sent5": "He whacked the door in frustration, trying to open it."
        },
        {
            "definition": "Crazy or eccentric.",
            "pos": "adjective",
            "sent1": "The whack idea seemed impossible to achieve.",
            "sent2": "She had a whack plan to build a rocket out of cardboard.",
            "sent3": "The whack scientist claimed he could talk to plants.",
            "sent4": "The whack painting was a mix of colors that didn't make sense.",
            "sent5": "His whack dance moves made everyone stare in disbelief."
        },
        {
            "definition": "To kill or murder.",
            "pos": "verb",
            "sent1": "The villain plotted to whack his rival.",
            "sent2": "The mob boss ordered his henchman to whack the informant.",
            "sent3": "The detective knew the killer's plan was to whack the witness.",
            "sent4": "In the movie, the spy had to whack the double agent to protect his cover.",
            "sent5": "The hitman was hired to whack the target without leaving a trace."
        }
    ]
}