{
    "term": "whae",
    "meanings": [
        {
            "definition": "A large marine mammal related to dolphins and known for its distinctive song.",
            "pos": "noun",
            "sent1": "The whae swam gracefully in the ocean, singing a beautiful song.",
            "sent2": "I saw a whae jumping out of the water while on a boat tour.",
            "sent3": "The whae decided to join the underwater choir and surprised everyone with its singing talent.",
            "sent4": "Her voice was like a whae's song, captivating everyone who heard it.",
            "sent5": "The whae's melodic tune echoed through the sea, enchanting all who listened."
        },
        {
            "definition": "To emit a high-pitched sound, as a result of pain or distress.",
            "pos": "verb",
            "sent1": "The injured puppy began to whae loudly, seeking help.",
            "sent2": "She couldn't help but whae when she stubbed her toe on the table.",
            "sent3": "The cat started to whae dramatically after getting a bath, as if it was the end of the world.",
            "sent4": "The wind made the branches whae like a chorus of tiny voices in the forest.",
            "sent5": "The child's whae pierced through the silence of the night, waking up the entire household."
        },
        {
            "definition": "A person who is skilled in a particular area or activity.",
            "pos": "noun",
            "sent1": "She is a whae in playing the piano, captivating audiences with her performances.",
            "sent2": "The chef at the restaurant is a true culinary whae, creating delicious dishes every day.",
            "sent3": "The whae of puzzles managed to solve the mystery in record time.",
            "sent4": "He was a whae with numbers, effortlessly calculating complex equations in his head.",
            "sent5": "The whae of gardening transformed the backyard into a beautiful oasis of flowers and plants."
        }
    ]
}