{
    "term": "whalers",
    "meanings": [
        {
            "definition": "A person who hunts whales for their oil, meat, or other products.",
            "pos": "noun",
            "sent1": "The whalers set out to sea in search of whales to hunt.",
            "sent2": "Whalers have a challenging job hunting whales in the vast ocean.",
            "sent3": "The whalers joked that they were like modern-day pirates of the sea.",
            "sent4": "In the world of business, successful entrepreneurs are like skilled whalers hunting for opportunities.",
            "sent5": "The image of whalers battling the mighty whales is both thrilling and daunting."
        },
        {
            "definition": "A ship used for hunting whales.",
            "pos": "noun",
            "sent1": "The whalers' ship sailed silently through the icy waters in pursuit of whales.",
            "sent2": "Whalers were essential vessels for the dangerous task of whale hunting.",
            "sent3": "The crew of the whalers' ship celebrated their successful whale catch with a feast.",
            "sent4": "The whalers' ship was a symbol of both adventure and peril on the open sea.",
            "sent5": "The sight of the majestic whalers' ship cutting through the waves was awe-inspiring."
        },
        {
            "definition": "A type of large, wide-brimmed hat worn by sailors.",
            "pos": "noun",
            "sent1": "The sailors donned their whalers to shield themselves from the scorching sun.",
            "sent2": "Whalers were commonly worn by sailors to protect them from harsh weather conditions.",
            "sent3": "The comical sight of a seagull perched on a sailor's whaler hat amused the crew.",
            "sent4": "The whaler hats cast shadows over the sailors' faces, giving them a mysterious look.",
            "sent5": "The distinctive whaler hats added a touch of old-world charm to the sailors' attire."
        }
    ]
}