{
    "term": "whaling",
    "meanings": [
        {
            "definition": "The practice or industry of hunting and killing whales for their oil, meat, or other products.",
            "pos": "noun",
            "sent1": "Whaling is a dangerous job that involves hunting whales for their valuable resources.",
            "sent2": "Many countries have a history of whaling for various purposes.",
            "sent3": "The whaling industry has been booming, but it's causing harm to the whale population.",
            "sent4": "In some cultures, whaling is seen as a traditional practice that must be preserved.",
            "sent5": "The image of a whaling ship on the vast ocean is both majestic and haunting."
        },
        {
            "definition": "The act of engaging in the hunting of whales.",
            "pos": "noun",
            "sent1": "Whaling requires skilled sailors who know how to track and capture whales.",
            "sent2": "The documentary highlighted the dangers and challenges of modern whaling expeditions.",
            "sent3": "During the whaling season, the small coastal town becomes bustling with activity.",
            "sent4": "The team of researchers embarked on a whaling mission to study the behavior of humpback whales.",
            "sent5": "The sound of whaling harpoons being launched echoed across the ocean."
        },
        {
            "definition": "A ship used for hunting whales.",
            "pos": "noun",
            "sent1": "The whaling vessel set sail early in the morning to begin its hunt.",
            "sent2": "The crew members of the whaling ship were experienced in navigating icy waters.",
            "sent3": "The old whaling ship had weathered many storms and still stood strong.",
            "sent4": "The captain of the whaling ship carefully scanned the horizon for signs of whales.",
            "sent5": "The whaling ship cut through the waves, leaving a trail of foam behind."
        }
    ]
}