{
    "term": "whalebacks",
    "meanings": [
        {
            "definition": "A type of ship with a rounded hull resembling the back of a whale.",
            "pos": "noun",
            "sent1": "The old sailor pointed to the whalebacks of the ship, explaining their unique shape.",
            "sent2": "The whalebacks of the vessel made it stand out among the other boats in the harbor.",
            "sent3": "The children giggled, imagining a crew of tiny whales steering the whalebacks through the waves.",
            "sent4": "The whalebacks of the ship cut through the water gracefully, like a pod of whales swimming in unison.",
            "sent5": "The whalebacks of the vessel gleamed in the sunlight, resembling the majestic curve of a whale's back."
        },
        {
            "definition": "A geological formation characterized by a rounded, whale-like shape.",
            "pos": "noun",
            "sent1": "The hikers marveled at the whalebacks of the hills, shaped by centuries of erosion.",
            "sent2": "The whalebacks of the mountains stood tall against the horizon, resembling giant sleeping whales.",
            "sent3": "The tourists joked that the whalebacks of the hills were actually ancient whale fossils turned to stone.",
            "sent4": "The whalebacks of the landscape rolled like gentle waves frozen in time, a reminder of nature's artistry.",
            "sent5": "The whalebacks of the hills created a serene backdrop, as if a pod of whales had settled on the land."
        },
        {
            "definition": "A type of cloud formation resembling the back of a whale.",
            "pos": "noun",
            "sent1": "The sky was painted with fluffy whalebacks, drifting lazily in the afternoon breeze.",
            "sent2": "The whalebacks of clouds cast shadows on the fields below, creating a patchwork of light and dark.",
            "sent3": "The children pointed excitedly at the whalebacks of clouds, imagining them as giant floating whales in the sky.",
            "sent4": "The whalebacks of the clouds stretched across the horizon, like a herd of whales migrating through the heavens.",
            "sent5": "The whalebacks of the clouds added a touch of whimsy to the sky, as if nature had painted playful whales above."
        }
    ]
}