{
    "term": "whammy",
    "meanings": [
        {
            "definition": "A powerful or devastating blow or impact.",
            "pos": "noun",
            "sent1": "The boxer delivered a whammy to his opponent, knocking him out cold.",
            "sent2": "The earthquake hit the city with a whammy, causing widespread destruction.",
            "sent3": "The superhero's punch packed such a whammy that the villain flew across the room.",
            "sent4": "The storm unleashed a whammy of wind and rain, leaving a trail of destruction.",
            "sent5": "The final blow in the battle was a whammy that echoed through the arena."
        },
        {
            "definition": "A spell or curse that brings bad luck.",
            "pos": "noun",
            "sent1": "The witch cast a whammy on the village, causing crops to wither and animals to fall ill.",
            "sent2": "Legend has it that anyone who enters the haunted house will be under the whammy of a curse.",
            "sent3": "The mischievous gnome placed a whammy on the traveler, making him trip over his own feet.",
            "sent4": "The old book warned of a whammy that would befall those who dared to disturb the ancient tomb.",
            "sent5": "The black cat crossing your path is said to bring a whammy of bad luck."
        },
        {
            "definition": "A difficult or problematic situation.",
            "pos": "noun",
            "sent1": "Getting stuck in traffic on the way to the airport was a real whammy for the traveler.",
            "sent2": "Losing his wallet right before the concert was the final whammy in a series of unfortunate events.",
            "sent3": "The broken elevator was the last whammy in a day full of mishaps for the office workers.",
            "sent4": "Running out of gas in the middle of nowhere was a real whammy for the road trip.",
            "sent5": "The sudden rainstorm was an unexpected whammy during the outdoor wedding ceremony."
        }
    ]
}