{
    "term": "whang",
    "meanings": [
        {
            "definition": "A sharp, resounding noise",
            "pos": "noun",
            "sent1": "The whang of the door slamming shut startled me.",
            "sent2": "I heard a loud whang as the hammer hit the metal.",
            "sent3": "The whang of the bell made everyone jump in surprise.",
            "sent4": "The thunder made a whang that echoed through the valley.",
            "sent5": "The whang of the fireworks filled the night sky with sound."
        },
        {
            "definition": "To strike or hit forcefully",
            "pos": "verb",
            "sent1": "He whanged the ball with all his might, sending it flying.",
            "sent2": "She accidentally whanged her elbow on the table corner.",
            "sent3": "The chef whanged the dough to flatten it for the pizza.",
            "sent4": "The boxer whanged a powerful punch that knocked out his opponent.",
            "sent5": "The carpenter whanged the nail into the wood with a single strike."
        },
        {
            "definition": "A thick slice of meat or fish",
            "pos": "noun",
            "sent1": "The sandwich was filled with a juicy whang of ham.",
            "sent2": "She cut a thick whang of salmon for the dinner recipe.",
            "sent3": "The whang of beef on the plate made his mouth water.",
            "sent4": "The chef placed a savory whang of steak on the grill.",
            "sent5": "The deli offered a delicious whang of turkey for the sandwiches."
        },
        {
            "definition": "To move quickly or forcefully",
            "pos": "verb",
            "sent1": "The car whanged down the road, leaving a trail of dust behind.",
            "sent2": "She whanged through the crowd to catch the bus before it left.",
            "sent3": "The squirrel whanged up the tree to escape the chasing cat.",
            "sent4": "The wind whanged through the trees, bending them in its path.",
            "sent5": "The athlete whanged across the finish line, winning the race."
        }
    ]
}