{
    "term": "wheels",
    "meanings": [
        {
            "definition": "A circular object that rotates on an axle and is used for transportation.",
            "pos": "noun",
            "sent1": "The red wagon had four wheels for rolling.",
            "sent2": "The car's wheels spun quickly on the road.",
            "sent3": "The wheels on the bus went round and round.",
            "sent4": "Her mind was like wheels turning, always thinking.",
            "sent5": "The wheels of progress never stop turning."
        },
        {
            "definition": "A steering wheel used to control the direction of a vehicle.",
            "pos": "noun",
            "sent1": "Dad turned the wheels to steer the car.",
            "sent2": "The ship's wheel guided the captain's course.",
            "sent3": "The wheels of the toy car were too small for the driver.",
            "sent4": "Her life felt like a ship without a wheel, adrift.",
            "sent5": "The wheel of fate turned in his favor that day."
        },
        {
            "definition": "A set of wheels used for a particular purpose, such as on a bicycle or car.",
            "pos": "noun",
            "sent1": "The bicycle had two wheels for riding.",
            "sent2": "The skateboard's wheels were smooth and fast.",
            "sent3": "The wheels of the shopping cart squeaked loudly.",
            "sent4": "His plan was like a well-oiled machine with many wheels.",
            "sent5": "The wheels of industry kept turning, never stopping."
        },
        {
            "definition": "To move or roll on wheels.",
            "pos": "verb",
            "sent1": "She wheels the cart down the aisle at the store.",
            "sent2": "The ball wheels across the floor with a gentle push.",
            "sent3": "He wheels around the corner in his wheelchair with a smile.",
            "sent4": "Time wheels forward, never looking back.",
            "sent5": "The dancer wheels gracefully across the stage."
        }
    ]
}