{
    "term": "wheezy",
    "meanings": [
        {
            "definition": "Breathing with a whistling or rattling sound in the chest, as a result of illness or exertion.",
            "pos": "adjective",
            "sent1": "The little boy sounded wheezy after running around the playground.",
            "sent2": "The old cat's breathing became wheezy as it struggled to climb the stairs.",
            "sent3": "The toy robot made a wheezy noise as if it had caught a cold.",
            "sent4": "The rusty old door hinges creaked wheezy tunes in the wind.",
            "sent5": "The haunted house was filled with wheezy whispers that sent shivers down spines."
        },
        {
            "definition": "Making a high-pitched, whistling sound when breathing, typically due to a respiratory condition.",
            "pos": "adjective",
            "sent1": "The asthmatic patient had a wheezy breath that echoed in the quiet room.",
            "sent2": "The puppy's playful barks turned into wheezy whimpers as it tired out.",
            "sent3": "The old teapot let out a wheezy whistle when the water boiled inside.",
            "sent4": "The wind blowing through the cracks produced a wheezy melody in the abandoned house.",
            "sent5": "The flute player's notes grew wheezy, creating a unique and haunting sound."
        },
        {
            "definition": "Having a tendency to wheeze, especially when experiencing difficulty breathing.",
            "pos": "adjective",
            "sent1": "The allergic reaction left her with a wheezy chest that needed immediate attention.",
            "sent2": "The dusty attic made her feel wheezy every time she went up to search for old treasures.",
            "sent3": "The old car engine sputtered wheezy complaints as it struggled to start.",
            "sent4": "The tired old fan made a wheezy noise as it tried to cool the stuffy room.",
            "sent5": "The exhausted runner's breath grew wheezy as he reached the finish line."
        }
    ]
}