{
    "term": "whensoever",
    "meanings": [
        {
            "definition": "At whatever time",
            "pos": "adverb",
            "sent1": "I will help you whensoever you need assistance.",
            "sent2": "You can call me whensoever you feel lonely.",
            "sent3": "Whensoever you decide to dance, I'll be your partner!",
            "sent4": "His love for her was like a beacon, shining whensoever she needed guidance.",
            "sent5": "The stars twinkle whensoever the night sky darkens."
        },
        {
            "definition": "Whenever",
            "pos": "adverb",
            "sent1": "Whenever you visit, I will be happy to see you.",
            "sent2": "You can come over whenever you want.",
            "sent3": "Whenever you wear that hat, you look like a detective!",
            "sent4": "Her smile brightens my day whenever she enters the room.",
            "sent5": "The flowers bloom whenever the sun shines brightly."
        },
        {
            "definition": "At any time",
            "pos": "adverb",
            "sent1": "You can reach out to me at any time, and I'll be there.",
            "sent2": "Feel free to ask questions at any time during the lecture.",
            "sent3": "At any time you feel lost, just follow the path of breadcrumbs.",
            "sent4": "His kindness was available at any time, like a 24/7 store.",
            "sent5": "The library is open at any time for students to study."
        },
        {
            "definition": "Every time",
            "pos": "adverb",
            "sent1": "Every time I see you, my heart skips a beat.",
            "sent2": "He smiles at me every time we pass each other in the hallway.",
            "sent3": "Every time you sneeze, a fairy gets its wings!",
            "sent4": "Her laughter fills the room every time she tells a joke.",
            "sent5": "The clock chimes every time the hour strikes."
        }
    ]
}