{
    "term": "whens",
    "meanings": [
        {
            "definition": "At what time",
            "pos": "adverb",
            "sent1": "Whens will you arrive at the party?",
            "sent2": "I wonder whens the bus will come.",
            "sent3": "Whens you wake up early, the birds are still sleeping.",
            "sent4": "The mystery novel kept me guessing whens the culprit would be revealed.",
            "sent5": "Whens the sun sets, the sky turns beautiful colors."
        },
        {
            "definition": "At or during which time",
            "pos": "adverb",
            "sent1": "Tell me whens you want to meet.",
            "sent2": "Whens we go to the beach, we always have a great time.",
            "sent3": "Whens the rain falls, the flowers bloom.",
            "sent4": "The concert was amazing whens the band played their hit song.",
            "sent5": "Whens the clock strikes midnight, it's time to celebrate."
        },
        {
            "definition": "The time or times at which",
            "pos": "noun",
            "sent1": "I have marked the whens of our meetings on the calendar.",
            "sent2": "The whens of the train departures are displayed on the board.",
            "sent3": "The whens of the school bell ringing are always the same.",
            "sent4": "She kept track of the whens of her favorite TV shows.",
            "sent5": "The whens of the seasons changing bring new experiences."
        },
        {
            "definition": "The time at which something happens",
            "pos": "noun",
            "sent1": "The whens of the movie premiere are still unknown.",
            "sent2": "Do you know the whens of the store opening?",
            "sent3": "The whens of the dog's barking always startle me.",
            "sent4": "The whens of the thunderstorm caught us by surprise.",
            "sent5": "The whens of the baby's first steps are precious moments."
        }
    ]
}