{
    "term": "whiff",
    "meanings": [
        {
            "definition": "A slight gust or puff of air.",
            "pos": "noun",
            "sent1": "I felt a whiff of wind on my face.",
            "sent2": "The whiff of fresh air was refreshing.",
            "sent3": "As I opened the window, a whiff of air blew my papers away.",
            "sent4": "The whiff of wind carried the scent of flowers from the garden.",
            "sent5": "The gentle whiff of air rustled the leaves in the trees."
        },
        {
            "definition": "A brief passing odor.",
            "pos": "noun",
            "sent1": "I caught a whiff of the delicious food from the kitchen.",
            "sent2": "The whiff of perfume lingered in the room.",
            "sent3": "A whiff of smoke from the barbecue made my mouth water.",
            "sent4": "The whiff of fresh bread baking filled the entire house.",
            "sent5": "The whiff of a skunk's spray made me wrinkle my nose in disgust."
        },
        {
            "definition": "To inhale a short, quick breath.",
            "pos": "verb",
            "sent1": "She had to whiff quickly to blow out the candle.",
            "sent2": "He whiffed in the scent of the flowers.",
            "sent3": "The child tried to whiff in as much air as possible before going underwater.",
            "sent4": "The runner whiffed in deeply before starting the race.",
            "sent5": "I whiffed in the fresh morning air to wake myself up."
        },
        {
            "definition": "To give off a slight, passing odor.",
            "pos": "verb",
            "sent1": "The flowers whiffed a sweet fragrance into the room.",
            "sent2": "The bakery whiffed the smell of freshly baked cookies.",
            "sent3": "The garbage can whiffed a terrible stench that made me gag.",
            "sent4": "The campfire whiffed smoke into our eyes.",
            "sent5": "The skunk whiffed its warning scent to keep predators away."
        }
    ]
}