{
    "term": "whigs",
    "meanings": [
        {
            "definition": "Members of a political party in Britain in the 17th and 18th centuries.",
            "pos": "noun",
            "sent1": "The whigs gathered to discuss their political strategies.",
            "sent2": "Many people admired the whigs for their progressive ideas.",
            "sent3": "Why did the whigs bring balloons to their political meeting?",
            "sent4": "The whigs stood tall like ancient oaks in the political landscape.",
            "sent5": "The colorful banners of the whigs fluttered proudly in the wind."
        },
        {
            "definition": "A supporter of the Whig party.",
            "pos": "noun",
            "sent1": "As a dedicated whigs, he campaigned tirelessly for his party.",
            "sent2": "She proudly wore a badge declaring her as a whigs supporter.",
            "sent3": "The whigs enthusiast even had a collection of party hats.",
            "sent4": "He defended his beliefs like a loyal whigs guarding a treasure.",
            "sent5": "The whigs supporter's cheers echoed through the rally."
        },
        {
            "definition": "A person who belonged to a political party in Britain in the 17th and 18th centuries.",
            "pos": "noun",
            "sent1": "The whigs were known for their strong sense of unity.",
            "sent2": "Being a whigs meant being part of a larger political family.",
            "sent3": "Imagine a time-traveling whigs attending a modern-day political event!",
            "sent4": "She felt like a proud whigs walking among historical figures.",
            "sent5": "The whigs' presence in the parliament was a force to be reckoned with."
        },
        {
            "definition": "A supporter of the Whig party.",
            "pos": "noun",
            "sent1": "The whigs' enthusiasm was contagious among their peers.",
            "sent2": "She proudly displayed her whigs membership card.",
            "sent3": "The whigs supporter even had a lucky party pin.",
            "sent4": "He defended his beliefs like a loyal whigs guarding a treasure.",
            "sent5": "The whigs supporter's cheers echoed through the rally."
        }
    ]
}