{
    "term": "whip",
    "meanings": [
        {
            "definition": "A long, narrow piece of leather or other material used for striking or causing pain.",
            "pos": "noun",
            "sent1": "The cowboy used a whip to guide the cattle.",
            "sent2": "The circus performer cracked the whip to start the show.",
            "sent3": "The whip cracked loudly, making the audience jump.",
            "sent4": "Her sharp words were like a verbal whip, stinging his pride.",
            "sent5": "The sound of the whip echoed through the canyon."
        },
        {
            "definition": "To beat or strike with a whip.",
            "pos": "verb",
            "sent1": "He had to whip the rug to get rid of the dust.",
            "sent2": "The coach told the team to whip the opponents in the game.",
            "sent3": "She had to whip the cream until it formed stiff peaks.",
            "sent4": "The wind whipped the leaves off the trees in a frenzy.",
            "sent5": "The storm whipped the sea into a raging turmoil."
        },
        {
            "definition": "To move quickly or suddenly.",
            "pos": "verb",
            "sent1": "The cat can whip around the corner in a flash.",
            "sent2": "The car can whip through traffic with ease.",
            "sent3": "The wind whipped through the trees, making them sway.",
            "sent4": "Her emotions could whip from joy to sorrow in an instant.",
            "sent5": "The dancer's skirt whipped around her legs as she spun."
        },
        {
            "definition": "A dessert made by beating cream or egg whites.",
            "pos": "noun",
            "sent1": "The chef prepared a delicious whip for dessert.",
            "sent2": "The bakery's specialty was a light and fluffy whip.",
            "sent3": "The children eagerly awaited the sweet whip after dinner.",
            "sent4": "The chocolate whip was a hit at the party.",
            "sent5": "The vanilla whip melted in your mouth with each bite."
        },
        {
            "definition": "A political party member who ensures attendance and voting.",
            "pos": "noun",
            "sent1": "The whip reminded everyone to be present for the vote.",
            "sent2": "The whip counted the members to ensure a quorum.",
            "sent3": "The whip encouraged party unity and cooperation.",
            "sent4": "The whip organized the members for the important vote.",
            "sent5": "The whip's role was crucial in maintaining party discipline."
        }
    ]
}