{
    "term": "whippets",
    "meanings": [
        {
            "definition": "A type of small, slender dog breed known for their speed and agility.",
            "pos": "noun",
            "sent1": "The whippets raced around the track with grace and speed.",
            "sent2": "I saw a group of whippets at the dog park, running happily.",
            "sent3": "The whippets decided to have a race to see who was the fastest.",
            "sent4": "Her running style was like a pack of whippets, swift and elegant.",
            "sent5": "The whippets' sleek bodies made them perfect for racing."
        },
        {
            "definition": "A type of small, light, fast horse.",
            "pos": "noun",
            "sent1": "The whippets galloped across the field with incredible speed.",
            "sent2": "The farmer used the whippets to quickly travel long distances.",
            "sent3": "The whippets in the stable were always eager to run.",
            "sent4": "The whippets' speed was unmatched, like a horse in a race.",
            "sent5": "The whippets' hooves thundered as they raced ahead."
        },
        {
            "definition": "A type of small, thin cookie or biscuit.",
            "pos": "noun",
            "sent1": "I enjoyed a plate of whippets with my tea in the afternoon.",
            "sent2": "The bakery sold delicious whippets that melted in your mouth.",
            "sent3": "The whippets on the dessert table disappeared quickly.",
            "sent4": "The whippets were so light and crispy, they were gone in seconds.",
            "sent5": "The sweet aroma of freshly baked whippets filled the kitchen."
        },
        {
            "definition": "A type of small, fast-moving vehicle or aircraft.",
            "pos": "noun",
            "sent1": "The whippets zoomed down the road, leaving dust in their wake.",
            "sent2": "The futuristic design of the whippets made them popular among commuters.",
            "sent3": "The whippets in the sky looked like shooting stars.",
            "sent4": "The whippets on the racetrack were like lightning bolts.",
            "sent5": "The whippets' engines roared as they sped past the competition."
        }
    ]
}