{
    "term": "whistles",
    "meanings": [
        {
            "definition": "A clear, high-pitched sound made by forcing breath through a small hole or passage.",
            "pos": "noun",
            "sent1": "The bird's whistles filled the forest with sweet melodies.",
            "sent2": "I heard the whistles of the tea kettle as it boiled.",
            "sent3": "The whistles of the wind sounded like a choir of tiny birds.",
            "sent4": "Her laughter was like joyful whistles echoing in the room.",
            "sent5": "The whistles of the steam engine signaled its departure."
        },
        {
            "definition": "A device used to produce a loud, clear sound by forcing air through a small hole.",
            "pos": "noun",
            "sent1": "The referee blew his whistle to stop the game.",
            "sent2": "She used a whistle to call her dog back to her.",
            "sent3": "The coach's whistle was so loud it startled everyone on the field.",
            "sent4": "The whistle of the kettle indicated it was ready for tea.",
            "sent5": "The lifeguard's whistle alerted swimmers of the approaching storm."
        },
        {
            "definition": "To make a high-pitched sound by forcing breath through the lips or teeth.",
            "pos": "verb",
            "sent1": "He whistles a tune while he works in the garden.",
            "sent2": "The wind whistles through the trees on a stormy night.",
            "sent3": "She whistles to get her dog's attention in the park.",
            "sent4": "The teapot whistles when the water reaches boiling point.",
            "sent5": "The kettle whistles a cheerful tune as it heats up."
        },
        {
            "definition": "To produce a clear, high-pitched sound by forcing air through a small opening.",
            "pos": "verb",
            "sent1": "The train whistles as it approaches the station.",
            "sent2": "She whistles to call her friend from across the street.",
            "sent3": "The wind whistles through the cracks in the old window.",
            "sent4": "The kettle whistles a happy tune when the water is hot.",
            "sent5": "He whistles a tune while walking down the street."
        }
    ]
}