{
    "term": "whodunits",
    "meanings": [
        {
            "definition": "A type of mystery story or novel in which the main focus is on solving a crime, typically a murder.",
            "pos": "noun",
            "sent1": "I enjoy reading whodunits to figure out who committed the crime.",
            "sent2": "The library has a whole section dedicated to whodunits.",
            "sent3": "The detective in the whodunit was so clever, he solved the case in just one chapter!",
            "sent4": "Her mind worked like a whodunit, piecing together clues to uncover the truth.",
            "sent5": "The whodunit kept me on the edge of my seat, trying to guess the killer's identity."
        },
        {
            "definition": "The act of investigating or solving a crime, especially a murder.",
            "pos": "noun",
            "sent1": "The whodunits on TV always make me want to become a detective.",
            "sent2": "Police officers are trained in the art of whodunits.",
            "sent3": "The kids played a game of whodunits, pretending to solve a mysterious cookie theft.",
            "sent4": "Her determination in solving the mystery was like a masterful whodunit.",
            "sent5": "The whodunit of the missing necklace was finally cracked by the clever cat."
        },
        {
            "definition": "A person who is skilled at solving crimes, particularly murders.",
            "pos": "noun",
            "sent1": "The famous detective was known as the ultimate whodunits in the city.",
            "sent2": "She aspired to be a whodunits like the characters in her favorite books.",
            "sent3": "The party guests joked that the host was the best whodunits for finding lost items.",
            "sent4": "His sharp eyes and keen mind made him a real-life whodunits in the neighborhood.",
            "sent5": "The whodunits arrived at the crime scene, ready to crack the case wide open."
        }
    ]
}