{
    "term": "whoop",
    "meanings": [
        {
            "definition": "A loud cry or shout, especially expressing joy or excitement.",
            "pos": "noun",
            "sent1": "The children let out a whoop of delight when they saw the ice cream truck.",
            "sent2": "I heard a distant whoop of happiness coming from the playground.",
            "sent3": "The whoop of joy echoed through the park, making everyone smile.",
            "sent4": "Her whoop of excitement was like music to my ears.",
            "sent5": "The whoop of joy was so loud, it could be heard from miles away."
        },
        {
            "definition": "A loud, shrill sound made by a siren or whistle.",
            "pos": "noun",
            "sent1": "The whoop of the police siren filled the night air.",
            "sent2": "The whoop of the referee's whistle signaled the end of the game.",
            "sent3": "The whoop of the whistle startled the sleeping cat.",
            "sent4": "The whoop of the siren pierced through the silence of the night.",
            "sent5": "The whoop of the whistle was so sharp, it made my ears ring."
        },
        {
            "definition": "To make a loud cry or shout, especially expressing joy or excitement.",
            "pos": "verb",
            "sent1": "The fans began to whoop with joy as their team scored a goal.",
            "sent2": "She whooped with excitement when she won the contest.",
            "sent3": "The children whooped with glee as they ran through the sprinklers.",
            "sent4": "The crowd whooped in celebration as the fireworks lit up the sky.",
            "sent5": "He whooped with joy, unable to contain his happiness."
        },
        {
            "definition": "To produce a loud, shrill sound, as a siren or whistle.",
            "pos": "verb",
            "sent1": "The fire alarm whooped loudly, alerting everyone to evacuate the building.",
            "sent2": "The referee whooped to start the race, and the runners took off.",
            "sent3": "The kettle whooped as it reached boiling point.",
            "sent4": "The wind whooped through the trees, creating an eerie sound.",
            "sent5": "The horn whooped as the ship sailed away into the distance."
        }
    ]
}