{
    "term": "whooplas",
    "meanings": [
        {
            "definition": "A loud, excited cry or shout.",
            "pos": "noun",
            "sent1": "The children's whooplas of joy could be heard from across the playground.",
            "sent2": "The fans let out a whooplas when their team scored a goal.",
            "sent3": "The unexpected whooplas from the audience startled the performers on stage.",
            "sent4": "Her whooplas of excitement pierced through the silence of the room.",
            "sent5": "The whooplas of the crowd filled the stadium with energy and enthusiasm."
        },
        {
            "definition": "A commotion or uproar.",
            "pos": "noun",
            "sent1": "The whooplas in the market drew everyone's attention.",
            "sent2": "There was a whooplas in the street as the parade passed by.",
            "sent3": "The whooplas of the party next door kept me awake all night.",
            "sent4": "The whooplas of the protest could be heard from blocks away.",
            "sent5": "The whooplas of the busy city street was overwhelming to the newcomer."
        },
        {
            "definition": "To make a loud, excited cry or shout.",
            "pos": "verb",
            "sent1": "She whooplas with joy when she received the good news.",
            "sent2": "The fans whooplas loudly to cheer on their team.",
            "sent3": "The children whooplas with delight as they played in the park.",
            "sent4": "He whooplas in triumph as he crossed the finish line first.",
            "sent5": "The performer whooplas to capture the audience's attention."
        },
        {
            "definition": "To cause a commotion or uproar.",
            "pos": "verb",
            "sent1": "The announcement whooplas excitement among the crowd.",
            "sent2": "His actions whooplas chaos in the classroom.",
            "sent3": "The unexpected news whooplas confusion among the group.",
            "sent4": "Her arrival whooplas a stir at the party.",
            "sent5": "The controversial decision whooplas a debate among the team members."
        }
    ]
}