{
    "term": "wickeder",
    "meanings": [
        {
            "definition": "More evil or morally wrong than someone or something else.",
            "pos": "adjective",
            "sent1": "The villain's plan to harm innocent people was even wickeder than we thought.",
            "sent2": "The witch's curse grew wickeder with each passing day.",
            "sent3": "The mischievous cat's behavior became wickeder when it knocked over the vase.",
            "sent4": "The storm grew wickeder, unleashing its fury upon the town.",
            "sent5": "The wickeder deeds of the criminal shocked the entire community.",
            "sent6": "The wickeder actions of the bully caused fear among the students.",
            "sent7": "The wickeder the witch's spell, the stronger its effects became.",
            "sent8": "The wickeder the lies, the harder it was to uncover the truth.",
            "sent9": "The wickeder the monster's roar, the more terrified the villagers became.",
            "sent10": "The wickeder the betrayal, the deeper the hurt felt by the betrayed."
        },
        {
            "definition": "More severe or extreme in a negative way.",
            "pos": "adjective",
            "sent1": "The storm grew wickeder, causing widespread damage.",
            "sent2": "The wickeder punishment left a lasting impact on the wrongdoer.",
            "sent3": "The wickeder the storm, the more trees were uprooted.",
            "sent4": "The wickeder the cold, the more layers of clothing were needed.",
            "sent5": "The wickeder the pain, the harder it was to endure.",
            "sent6": "The wickeder the storm, the longer it took for life to return to normal.",
            "sent7": "The wickeder the wound, the longer it took to heal.",
            "sent8": "The wickeder the storm, the louder the howling winds became.",
            "sent9": "The wickeder the challenge, the more determined she became to overcome it.",
            "sent10": "The wickeder the storm, the darker the sky grew."
        }
    ]
}