{
    "term": "wiel",
    "meanings": [
        {
            "definition": "A circular frame with a handle used for carrying objects.",
            "pos": "noun",
            "sent1": "I carried the heavy books in the wiel.",
            "sent2": "She picked up the groceries with the wiel.",
            "sent3": "The wiel felt like a magic basket, helping me move things easily.",
            "sent4": "The wiel of the shopping cart spun happily as I pushed it along.",
            "sent5": "The wiel's round shape made it perfect for holding all the tools."
        },
        {
            "definition": "To turn or spin rapidly.",
            "pos": "verb",
            "sent1": "He tried to wiel the toy top but it kept falling over.",
            "sent2": "The dancer began to wiel gracefully on the stage.",
            "sent3": "The cat tried to wiel its tail but only managed a few spins.",
            "sent4": "Time seemed to wiel by as we enjoyed the party.",
            "sent5": "The wind started to wiel the leaves around in the yard."
        },
        {
            "definition": "A large, rotating wheel used for grinding or mixing substances.",
            "pos": "noun",
            "sent1": "The miller used the wiel to grind wheat into flour.",
            "sent2": "The chef turned the wiel to mix the ingredients for the cake.",
            "sent3": "The wiel looked like a giant cookie cutter for rocks.",
            "sent4": "The wiel of the cement mixer spun loudly at the construction site.",
            "sent5": "The wiel of the pottery wheel shaped the clay into a beautiful vase."
        },
        {
            "definition": "A circular object used for steering a vehicle.",
            "pos": "noun",
            "sent1": "The captain turned the wiel to steer the ship away from the storm.",
            "sent2": "She gripped the wiel tightly as she drove the car down the road.",
            "sent3": "The wiel on the toy car made it easy to navigate through the maze.",
            "sent4": "The wiel of the bicycle wobbled as the child learned to ride.",
            "sent5": "The wiel of the ship's wheel creaked as it guided the vessel through the waves."
        }
    ]
}