{
    "term": "wigwagger",
    "meanings": [
        {
            "definition": "A person who wags or moves a wigwag.",
            "pos": "noun",
            "sent1": "The wigwagger at the train station made sure the signals were clear.",
            "sent2": "The wigwagger adjusted the flag to indicate the train's arrival.",
            "sent3": "The wigwagger's job was to ensure the flag danced in the wind for all to see.",
            "sent4": "She was like a human wigwagger, swaying back and forth to direct attention.",
            "sent5": "The wigwagger's movements were as rhythmic as a metronome, guiding the traffic smoothly."
        },
        {
            "definition": "A device used for signaling or communication by moving back and forth.",
            "pos": "noun",
            "sent1": "The old wigwagger by the railroad was still operational after many years.",
            "sent2": "The sailor used the wigwagger to send messages across the sea.",
            "sent3": "The wigwagger on the ship squeaked as it swung, adding a musical touch to the journey.",
            "sent4": "The lighthouse's beam acted like a giant wigwagger, sweeping light across the dark ocean.",
            "sent5": "The wigwagger's creaking sound echoed through the valley, signaling the approaching storm."
        },
        {
            "definition": "To signal or communicate by moving back and forth.",
            "pos": "verb",
            "sent1": "He would wigwagger his hands to get the attention of the crowd.",
            "sent2": "The flag wigwaggered in the wind, catching the eye of the distant ship.",
            "sent3": "She decided to wigwagger her way out of the awkward conversation by pretending to receive a call.",
            "sent4": "The trees seemed to wigwagger in the breeze, whispering secrets to each other.",
            "sent5": "The dancer's movements on stage wigwaggered gracefully, telling a silent story to the audience."
        }
    ]
}