{
    "term": "wild",
    "meanings": [
        {
            "definition": "Living or growing in natural conditions; not domesticated or cultivated.",
            "pos": "adjective",
            "sent1": "The wild flowers bloomed beautifully in the meadow.",
            "sent2": "The forest is full of wild animals like bears and deer.",
            "sent3": "The wild squirrel stole all the nuts from the bird feeder!",
            "sent4": "Her wild imagination took her on a journey through space and time.",
            "sent5": "The wild storm raged through the night, shaking the windows."
        },
        {
            "definition": "Uncontrolled or unrestrained.",
            "pos": "adjective",
            "sent1": "The wild child ran around the playground with endless energy.",
            "sent2": "The party turned into a wild celebration with music and dancing.",
            "sent3": "His wild laughter echoed through the empty hallway.",
            "sent4": "The wild river flooded its banks, causing chaos in the town.",
            "sent5": "The wild wind whipped through the trees, scattering leaves everywhere."
        },
        {
            "definition": "Lacking discipline or restraint.",
            "pos": "adjective",
            "sent1": "The wild students were loud and disruptive in class.",
            "sent2": "The puppy was so wild, it chewed up all the shoes in the house.",
            "sent3": "Her wild behavior at the party shocked everyone.",
            "sent4": "The wild driver sped through the streets, ignoring all traffic rules.",
            "sent5": "The wild child refused to sit still, constantly moving around the room."
        },
        {
            "definition": "Marked by intense emotion or passion.",
            "pos": "adjective",
            "sent1": "Her wild excitement for the upcoming concert was contagious.",
            "sent2": "The actor's performance was so wild, it left the audience in awe.",
            "sent3": "His wild love for her was evident in every gesture.",
            "sent4": "The wild cheers of the crowd filled the stadium with energy.",
            "sent5": "The wild joy of winning the game brought tears to his eyes."
        }
    ]
}