{
    "term": "wilfully",
    "meanings": [
        {
            "definition": "In a manner that is done deliberately or intentionally.",
            "pos": "adverb",
            "sent1": "She wilfully ignored the warning signs and continued on her dangerous path.",
            "sent2": "He wilfully chose to stay up late despite knowing he had an early meeting the next day.",
            "sent3": "The mischievous squirrel wilfully knocked over the bird feeder just to watch the chaos unfold.",
            "sent4": "The storm clouds gathered wilfully, ready to unleash their fury upon the unsuspecting town.",
            "sent5": "The toddler wilfully smeared paint all over the walls, creating a colorful masterpiece."
        },
        {
            "definition": "With full knowledge and awareness of the consequences.",
            "pos": "adverb",
            "sent1": "Knowing the risks, she wilfully ventured into the dark cave to rescue her lost cat.",
            "sent2": "Despite being tired, he wilfully stayed up to finish his homework before the deadline.",
            "sent3": "The curious puppy wilfully chewed on the electrical cord, fully aware of the shock it would bring.",
            "sent4": "The detective wilfully followed the suspect, determined to uncover the truth behind the crime.",
            "sent5": "The student wilfully skipped class, understanding the repercussions of his actions."
        },
        {
            "definition": "Intentionally or purposely.",
            "pos": "adverb",
            "sent1": "She wilfully ate the last cookie, knowing her brother had been saving it for himself.",
            "sent2": "He wilfully ignored the speed limit, eager to reach his destination faster.",
            "sent3": "The mischievous cat wilfully knocked the vase off the table, just to see it shatter.",
            "sent4": "The artist wilfully added a splash of red to the painting, enhancing its dramatic effect.",
            "sent5": "The chef wilfully added extra spices to the dish, giving it a burst of flavor."
        }
    ]
}