{
    "term": "willfully",
    "meanings": [
        {
            "definition": "Intentionally; deliberately.",
            "pos": "adverb",
            "sent1": "She willfully ignored the warning signs and continued on her dangerous path.",
            "sent2": "He willfully chose to stay up late despite knowing he had an early morning.",
            "sent3": "The cat willfully knocked over the vase, then looked at me as if to say, 'Oops!'",
            "sent4": "The storm willfully raged on, refusing to let up its fury.",
            "sent5": "The child willfully disobeyed his parents, testing the boundaries of their patience."
        },
        {
            "definition": "In a manner that shows a stubborn or obstinate determination.",
            "pos": "adverb",
            "sent1": "She willfully insisted on doing things her own way, no matter what others said.",
            "sent2": "He willfully pushed through the pain to reach the finish line of the race.",
            "sent3": "The squirrel willfully held onto the nut, refusing to share with the other animals.",
            "sent4": "The old tree willfully stood its ground against the strong winds, refusing to be uprooted.",
            "sent5": "The student willfully tackled the difficult math problem, determined to solve it on his own."
        },
        {
            "definition": "With full knowledge and awareness.",
            "pos": "adverb",
            "sent1": "She willfully signed the contract, fully understanding the terms and conditions.",
            "sent2": "He willfully walked into the dark cave, aware of the potential dangers lurking inside.",
            "sent3": "The chef willfully added extra spices to the dish, knowing it would enhance the flavor.",
            "sent4": "The detective willfully pursued the lead, confident it would bring him closer to solving the case.",
            "sent5": "The explorer willfully ventured into the uncharted territory, prepared for whatever challenges lay ahead."
        }
    ]
}