{
    "term": "windigoes",
    "meanings": [
        {
            "definition": "mythical creatures in Algonquian folklore believed to be malevolent spirits or monsters",
            "pos": "noun",
            "sent1": "Legends say that windigoes roam the forests at night, scaring travelers.",
            "sent2": "The children gathered around the campfire to hear stories about windigoes.",
            "sent3": "In the play, the actors wore elaborate costumes to portray the terrifying windigoes.",
            "sent4": "The dark shadows in the forest seemed to move like silent windigoes.",
            "sent5": "The artist's painting of the windigoes was both eerie and captivating."
        },
        {
            "definition": "a feeling of intense hunger or greed that drives someone to cannibalism",
            "pos": "noun",
            "sent1": "After days without food, the survivors felt the windigoes gnawing at their insides.",
            "sent2": "The famine brought out the hidden windigoes in some of the villagers.",
            "sent3": "The cartoon character's exaggerated stomach growls were like tiny windigoes.",
            "sent4": "The hunger for power consumed him like insatiable windigoes.",
            "sent5": "The smell of freshly baked bread filled the room, awakening the windigoes within him."
        },
        {
            "definition": "to be possessed by a windigo spirit, causing one to exhibit cannibalistic behavior",
            "pos": "verb",
            "sent1": "The old tale warned of the dangers of being windigoesed by evil spirits.",
            "sent2": "He feared that his friend had been windigoesed by the malevolent force in the forest.",
            "sent3": "The mischievous spirit windigoesed the town, causing chaos and confusion.",
            "sent4": "The darkness in his eyes revealed that he had been windigoesed by the ancient curse.",
            "sent5": "The eerie howls in the night hinted that the village was being windigoesed by an unseen presence."
        }
    ]
}