{
    "term": "windigos",
    "meanings": [
        {
            "definition": "Windigos: mythical creatures in Algonquian folklore believed to possess humans and cause them to commit acts of cannibalism.",
            "pos": "noun",
            "sent1": "Legends tell of windigos lurking in the dark forests.",
            "sent2": "The windigos in the story were terrifying creatures with a hunger for human flesh.",
            "sent3": "The children giggled, pretending to be windigos searching for their next meal.",
            "sent4": "The darkness of the night seemed to be filled with unseen windigos, waiting for unsuspecting victims.",
            "sent5": "The windigos' haunting howls echoed through the ancient trees, sending shivers down the villagers' spines."
        },
        {
            "definition": "Windigos: a person who is believed to have been possessed by a windigo spirit.",
            "pos": "noun",
            "sent1": "The villagers whispered about the strange man, calling him a windigos.",
            "sent2": "Some believe that a windigos' actions are not their own but influenced by dark forces.",
            "sent3": "At the costume party, Tim jokingly introduced himself as a windigos from the haunted house.",
            "sent4": "Her eyes seemed to reflect the emptiness of a windigos, lost in the grip of a malevolent spirit.",
            "sent5": "The windigos' gaze seemed to pierce through the veil of reality, revealing a glimpse of the otherworldly."
        },
        {
            "definition": "Windigos: a feeling of extreme hunger or greed that cannot be satisfied.",
            "pos": "noun",
            "sent1": "After the long hike, Sarah's stomach growled with a fierce windigos.",
            "sent2": "The windigos for power drove the ruthless king to conquer lands far and wide.",
            "sent3": "The buffet at the party was so tempting, it awakened a dormant windigos in me.",
            "sent4": "The insatiable windigos within him drove him to seek wealth beyond reason.",
            "sent5": "The windigos of desire gnawed at her insides, leaving her restless and unsatisfied."
        }
    ]
}