{
    "term": "wingspan",
    "meanings": [
        {
            "definition": "The distance between the tips of a bird's wings when fully extended.",
            "pos": "noun",
            "sent1": "The bird's wingspan was impressive as it soared through the sky.",
            "sent2": "The scientist measured the wingspan of the eagle for research purposes.",
            "sent3": "The tiny sparrow boasted about its wingspan, claiming it could outfly all its friends.",
            "sent4": "Her dreams had a wingspan that reached beyond the clouds, full of endless possibilities.",
            "sent5": "The wingspan of the albatross made it a majestic sight against the blue sky."
        },
        {
            "definition": "The measurement of the distance between the tips of an airplane's wings.",
            "pos": "noun",
            "sent1": "The airplane mechanic checked the wingspan before the flight for safety reasons.",
            "sent2": "The pilot adjusted the wingspan of the aircraft for better aerodynamics.",
            "sent3": "The airport staff marveled at the wingspan of the jumbo jet, amazed by its size.",
            "sent4": "The wingspan of the plane seemed to embrace the entire runway as it landed smoothly.",
            "sent5": "The wingspan of the fighter jet was a symbol of power and speed in the air."
        },
        {
            "definition": "The span of a person's outstretched arms.",
            "pos": "noun",
            "sent1": "The child measured the wingspan of their arms to see how wide they could reach.",
            "sent2": "During the exercise class, they were asked to extend their wingspan as far as possible.",
            "sent3": "The comedian joked about having a wingspan long enough to hug two people at once.",
            "sent4": "Her love had a wingspan that could encompass everyone in her life with care and warmth.",
            "sent5": "The dancer's wingspan on stage captivated the audience, showcasing grace and elegance."
        }
    ]
}