{
    "term": "wino",
    "meanings": [
        {
            "definition": "A person who drinks excessive amounts of wine, especially cheap or low-quality wine.",
            "pos": "noun",
            "sent1": "The local park often has a few winos sitting on the benches, sipping from their bottles.",
            "sent2": "She was known in the neighborhood as the wino who always carried a bottle in a paper bag.",
            "sent3": "The wino at the bus stop tried to juggle his wine bottles, much to the amusement of passersby.",
            "sent4": "In the alley, the wino's laughter echoed against the walls, a symphony of loneliness.",
            "sent5": "The wino's face was etched with the stories of each bottle he had emptied."
        },
        {
            "definition": "A slang term for an alcoholic who primarily consumes wine.",
            "pos": "noun",
            "sent1": "My uncle jokingly called himself a wino because of his love for red wine.",
            "sent2": "The wino at the bar always had a glass of wine in hand, chatting with the bartender.",
            "sent3": "The wino's wine glass had a tiny umbrella in it, making him feel like he was on vacation.",
            "sent4": "She felt like a wino in a vineyard, surrounded by endless rows of grapevines.",
            "sent5": "The wino's collection of corkscrews was a testament to his dedication to wine."
        },
        {
            "definition": "A derogatory term for someone who is addicted to or frequently intoxicated by wine.",
            "pos": "noun",
            "sent1": "The wino stumbled out of the bar, his speech slurred from the wine he had consumed.",
            "sent2": "People whispered about the wino who lived down the street, always seen with a bottle in hand.",
            "sent3": "The wino's wine-stained shirt was a fashion statement he proudly flaunted.",
            "sent4": "She felt like a wino in a vineyard, lost among the endless rows of grapevines.",
            "sent5": "The wino's eyes held a glassy gaze, reflecting the world through a wine-tinted lens."
        }
    ]
}