{
    "term": "witches",
    "meanings": [
        {
            "definition": "A woman thought to have magic powers, especially evil ones, popularly depicted as wearing a black cloak and pointed hat and flying on a broomstick.",
            "pos": "noun",
            "sent1": "The witches gathered around the cauldron to brew their magical potion.",
            "sent2": "In the story, the witches put a curse on the princess.",
            "sent3": "The witches decided to have a costume party and all dressed up as spooky characters.",
            "sent4": "Her laughter echoed through the forest like the cackle of witches.",
            "sent5": "The image of the witches on broomsticks was etched in his mind forever."
        },
        {
            "definition": "A person who practices witchcraft; a sorcerer or sorceress.",
            "pos": "noun",
            "sent1": "The old village witch was known for her healing potions.",
            "sent2": "The witches of the coven gathered under the full moon for their ritual.",
            "sent3": "The little girl dressed up as a witch for Halloween and pretended to cast spells on her toys.",
            "sent4": "The mysterious woman in the woods was rumored to be a powerful witch.",
            "sent5": "The witch's crystal ball revealed the future to those who sought her guidance."
        },
        {
            "definition": "To cast a spell over; bewitch.",
            "pos": "verb",
            "sent1": "The enchantress witches the prince, causing him to fall in love with her.",
            "sent2": "The evil sorcerer witches the kingdom, bringing darkness upon the land.",
            "sent3": "The magician accidentally witches himself while practicing a new spell.",
            "sent4": "The mysterious potion seemed to witch anyone who dared to drink it.",
            "sent5": "The haunting melody of the music seemed to witch all who heard it, filling them with a sense of longing."
        }
    ]
}