{
    "term": "witchcraft",
    "meanings": [
        {
            "definition": "The practice of magic, especially black magic; the use of spells and the invocation of spirits.",
            "pos": "noun",
            "sent1": "She believed in witchcraft and thought her neighbor could cast spells.",
            "sent2": "The villagers feared the witchcraft of the old woman living in the forest.",
            "sent3": "The children giggled at the idea of using witchcraft to make their homework disappear.",
            "sent4": "His charisma seemed like a form of witchcraft, enchanting everyone he met.",
            "sent5": "The movie portrayed the witchcraft with eerie special effects, sending chills down the viewers' spines."
        },
        {
            "definition": "The use of supernatural powers to influence or predict events.",
            "pos": "noun",
            "sent1": "The fortune teller claimed to possess the gift of witchcraft and could see the future.",
            "sent2": "Legends speak of witches using witchcraft to control the elements.",
            "sent3": "The idea of using witchcraft to win at a game of cards made everyone chuckle.",
            "sent4": "Her intuition was so accurate, it almost felt like a kind of witchcraft.",
            "sent5": "The storm's sudden arrival felt like the witchcraft of nature, unpredictable and powerful."
        },
        {
            "definition": "The practice of witchcraft; the use of magic or sorcery.",
            "pos": "noun",
            "sent1": "In some cultures, witchcraft is seen as a way to heal the sick.",
            "sent2": "The book detailed the history of witchcraft and its influence on society.",
            "sent3": "The idea of using witchcraft to find a lost sock amused the group.",
            "sent4": "Her ability to calm people with just a touch felt like a gentle form of witchcraft.",
            "sent5": "The magician's performance was so captivating, it felt like a display of ancient witchcraft rituals."
        }
    ]
}