{
    "term": "withal",
    "meanings": [
        {
            "definition": "In addition; as well",
            "pos": "adverb",
            "sent1": "She was tired; withal, she continued to work hard.",
            "sent2": "He is a kind person; withal, he can be quite strict when necessary.",
            "sent3": "The cat was lazy, but withal, it caught the mouse effortlessly.",
            "sent4": "His smile was warm, withal, his eyes held a hint of sadness.",
            "sent5": "The garden was beautiful, withal, it lacked colorful flowers."
        },
        {
            "definition": "Nevertheless; however",
            "pos": "adverb",
            "sent1": "She wanted to go out; withal, she decided to stay home.",
            "sent2": "The weather was hot; withal, they still enjoyed their picnic.",
            "sent3": "He claimed to be innocent, but withal, he had left his fingerprints at the scene.",
            "sent4": "The team was losing the game, withal, they never gave up.",
            "sent5": "The movie was long, withal, it kept the audience engaged."
        },
        {
            "definition": "Together with",
            "pos": "preposition",
            "sent1": "She went to the party withal her friends.",
            "sent2": "He completed the project withal his team members.",
            "sent3": "The dog played withal the children in the park.",
            "sent4": "The flowers bloomed withal the arrival of spring.",
            "sent5": "The cake was decorated withal colorful sprinkles."
        },
        {
            "definition": "In spite of that",
            "pos": "conjunction",
            "sent1": "He was afraid of heights; withal, he climbed the mountain.",
            "sent2": "She knew it was risky; withal, she decided to take the chance.",
            "sent3": "The storm was approaching fast, but withal, they continued their picnic.",
            "sent4": "The road was rough; withal, they reached their destination on time.",
            "sent5": "The book was long and complex; withal, she finished reading it in one sitting."
        }
    ]
}