{
    "term": "wogs",
    "meanings": [
        {
            "definition": "Offensive slang term for a person of Mediterranean or Middle Eastern descent.",
            "pos": "noun",
            "sent1": "Some people use the word 'wogs' to insult those from Mediterranean or Middle Eastern backgrounds.",
            "sent2": "The term 'wogs' is hurtful when used to refer to individuals of Mediterranean or Middle Eastern heritage.",
            "sent3": "He thought it was funny to call his friend a 'wogs', but it was actually very disrespectful.",
            "sent4": "The word 'wogs' can cut deep, like a sharp blade, when aimed at someone's ethnicity.",
            "sent5": "The derogatory term 'wogs' paints a hurtful picture of discrimination and prejudice."
        },
        {
            "definition": "Offensive slang term for a person of non-white descent.",
            "pos": "noun",
            "sent1": "Using 'wogs' to describe someone of non-white descent is unacceptable and discriminatory.",
            "sent2": "It is offensive to label individuals of non-white descent with the derogatory term 'wogs'.",
            "sent3": "She mistakenly thought it was okay to refer to her classmate as a 'wogs', not realizing the harm in her words.",
            "sent4": "The term 'wogs' lumps together diverse cultures under a single, derogatory label.",
            "sent5": "The hurtful word 'wogs' diminishes the rich tapestry of non-white heritage."
        },
        {
            "definition": "Offensive slang term for a person of foreign origin.",
            "pos": "noun",
            "sent1": "Some people ignorantly use 'wogs' to describe individuals of foreign origin.",
            "sent2": "It is disrespectful to refer to someone from a foreign country as 'wogs'.",
            "sent3": "He awkwardly tried to fit in by using the term 'wogs' to describe his new neighbor.",
            "sent4": "The word 'wogs' creates a barrier between people of different nationalities.",
            "sent5": "The derogatory term 'wogs' highlights the ignorance and insensitivity of the speaker."
        }
    ]
}