{
    "term": "womanize",
    "meanings": [
        {
            "definition": "To engage in numerous casual sexual relationships with women.",
            "pos": "verb",
            "sent1": "He would womanize every weekend, going out with different women each time.",
            "sent2": "Some men womanize because they are not interested in committed relationships.",
            "sent3": "John's friends joked that he would womanize his way through the entire town.",
            "sent4": "Her reputation as a womanizer spread through the small community like wildfire.",
            "sent5": "The character in the novel was portrayed as a womanizer, always on the lookout for his next conquest."
        },
        {
            "definition": "To treat women as objects of sexual desire.",
            "pos": "verb",
            "sent1": "It is disrespectful to womanize women by reducing them to mere objects of desire.",
            "sent2": "Some movies unfortunately womanize female characters, portraying them solely for their physical appearance.",
            "sent3": "The comedian's joke about womanizing fell flat with the audience, who found it tasteless.",
            "sent4": "The advertisement seemed to womanize the model, focusing only on her body rather than the product.",
            "sent5": "In the story, the villain would womanize his victims, seeing them only as tools for his pleasure."
        },
        {
            "definition": "To pursue or seek out women for romantic or sexual purposes.",
            "pos": "verb",
            "sent1": "He would womanize the bars in search of a potential date for the evening.",
            "sent2": "Some people womanize online, using dating apps to meet new individuals.",
            "sent3": "The detective had to womanize the city to find the elusive suspect.",
            "sent4": "Her friends teased her for womanizing the gym, always looking for a cute workout partner.",
            "sent5": "The explorer would womanize the remote islands, hoping to find a companion for his adventures."
        }
    ]
}