{
    "term": "wonga",
    "meanings": [
        {
            "definition": "Money",
            "pos": "noun",
            "sent1": "I found some wonga in my pocket.",
            "sent2": "She used the wonga to buy a new book.",
            "sent3": "The wonga magically appeared in his wallet.",
            "sent4": "Her eyes sparkled at the sight of the wonga.",
            "sent5": "The shiny wonga gleamed under the sunlight."
        },
        {
            "definition": "Cash",
            "pos": "noun",
            "sent1": "He paid for the groceries with wonga.",
            "sent2": "The thief stole the wonga from the register.",
            "sent3": "The wonga slipped out of his hand and flew away.",
            "sent4": "The wonga whispered promises of spending.",
            "sent5": "The sound of wonga jingling in his pocket was music to his ears."
        },
        {
            "definition": "Wealth",
            "pos": "noun",
            "sent1": "His mansion was a display of his wonga.",
            "sent2": "She inherited a vast amount of wonga from her uncle.",
            "sent3": "The wonga seemed to multiply in his bank account.",
            "sent4": "Her wonga was a treasure trove of possibilities.",
            "sent5": "The wonga overflowed from his overflowing vault."
        },
        {
            "definition": "Currency",
            "pos": "noun",
            "sent1": "The traveler exchanged his wonga for local currency.",
            "sent2": "The shop only accepted the national wonga.",
            "sent3": "The wonga danced in his hand as he counted it.",
            "sent4": "Her wonga was like a universal language.",
            "sent5": "The wonga held the power to open doors in foreign lands."
        },
        {
            "definition": "Funds",
            "pos": "noun",
            "sent1": "The organization raised wonga for charity.",
            "sent2": "She carefully managed her wonga for future needs.",
            "sent3": "The wonga seemed to have a mind of its own.",
            "sent4": "His wonga was a safety net in times of trouble.",
            "sent5": "The wonga grew wings and flew into the donation box."
        }
    ]
}