{
    "term": "woodenly",
    "meanings": [
        {
            "definition": "In a stiff or awkward manner, lacking in fluidity or grace.",
            "pos": "adverb",
            "sent1": "She walked woodenly across the stage, her movements stiff and awkward.",
            "sent2": "The robot moved woodenly, with no fluidity or grace in its motions.",
            "sent3": "The actor delivered his lines woodenly, making the audience chuckle at his lack of emotion.",
            "sent4": "Her smile was woodenly plastered on her face, showing no genuine happiness.",
            "sent5": "The old puppet danced woodenly on its strings, a stark contrast to the lively dancers around it."
        },
        {
            "definition": "In a way that lacks emotion or expression.",
            "pos": "adverb",
            "sent1": "He spoke woodenly, his voice devoid of any emotion or expression.",
            "sent2": "The painting was done woodenly, with no hint of the artist's feelings shining through.",
            "sent3": "The comedian delivered his jokes woodenly, causing the audience to wonder if he was a robot in disguise.",
            "sent4": "Her eyes stared woodenly ahead, showing no flicker of interest or emotion.",
            "sent5": "The singer sang woodenly, the lyrics devoid of any passion or feeling."
        },
        {
            "definition": "In a way that is dull or unresponsive.",
            "pos": "adverb",
            "sent1": "The student answered the teacher's question woodenly, showing no enthusiasm.",
            "sent2": "The cat looked at the toy woodenly, uninterested in playing.",
            "sent3": "The clock ticked woodenly on the wall, as if bored with its own monotonous sound.",
            "sent4": "The car engine sputtered woodenly, refusing to start on the cold morning.",
            "sent5": "The tree swayed woodenly in the breeze, its branches barely moving in response to the wind."
        }
    ]
}