{
    "term": "wooded",
    "meanings": [
        {
            "definition": "Covered with trees or woods.",
            "pos": "adjective",
            "sent1": "The campground was surrounded by a wooded area, providing shade and natural beauty.",
            "sent2": "The wooded path led us deep into the forest, where the trees towered overhead.",
            "sent3": "The squirrel got lost in the wooded maze of branches and leaves, looking for its acorn stash.",
            "sent4": "Her mind was like a wooded forest, full of hidden thoughts and secrets waiting to be discovered.",
            "sent5": "The smell of pine and oak filled the air, a reminder of the wooded landscape around us."
        },
        {
            "definition": "Having a lot of trees or woods.",
            "pos": "adjective",
            "sent1": "The national park was known for its wooded trails, perfect for hiking and exploring nature.",
            "sent2": "The backyard of the house was wooded, providing privacy and a peaceful atmosphere.",
            "sent3": "The picnic area was so wooded that even the birds had trouble finding a clear spot to land.",
            "sent4": "His thoughts were like a densely wooded forest, with ideas branching out in all directions.",
            "sent5": "The wooded hillsides were alive with the sound of rustling leaves and chirping birds."
        },
        {
            "definition": "Consisting of or covered with trees or woods.",
            "pos": "adjective",
            "sent1": "The cabin was nestled in a wooded valley, surrounded by tall trees and chirping birds.",
            "sent2": "The village was located in a wooded area, making it feel like a hidden oasis in the forest.",
            "sent3": "The cat's fur was so fluffy and thick, it looked like a wooded coat of luxurious fur.",
            "sent4": "Her dreams were like a misty wooded landscape, with shadows dancing among the trees.",
            "sent5": "The wooded landscape stretched out before us, a sea of green and brown as far as the eye could see."
        }
    ]
}