{
    "term": "woodies",
    "meanings": [
        {
            "definition": "A type of surfboard with a wooden exterior.",
            "pos": "noun",
            "sent1": "The beach was full of surfers carrying their woodies to catch the waves.",
            "sent2": "I saw a group of friends enjoying the sun on their woodies by the shore.",
            "sent3": "The woodies on the beach seemed to be chatting with each other about the upcoming surf competition.",
            "sent4": "His woodie cut through the waves like a sleek dolphin, gliding effortlessly.",
            "sent5": "The woodies lined up along the shore, waiting eagerly for their riders."
        },
        {
            "definition": "A slang term for an erection.",
            "pos": "noun",
            "sent1": "He blushed when his friends teased him about getting a woodie in class.",
            "sent2": "The comedian made a joke about getting a woodie at the most awkward moments.",
            "sent3": "The old man chuckled, remembering the days when a woodie was a common occurrence.",
            "sent4": "His embarrassment was visible as he tried to hide his unexpected woodie.",
            "sent5": "The teenager's face turned red as he realized he had a woodie in the middle of the presentation."
        },
        {
            "definition": "A type of bird found in wooded areas.",
            "pos": "noun",
            "sent1": "The woodies chirped melodiously in the forest, creating a symphony of nature.",
            "sent2": "I spotted a pair of woodies building a nest high up in the trees.",
            "sent3": "The woodies seemed to be having a gossip session on the branches, sharing the latest forest news.",
            "sent4": "The woodies fluttered gracefully through the dense foliage, their colorful feathers shining in the sunlight.",
            "sent5": "The woodies' morning song woke up the entire woodland, signaling the start of a new day."
        }
    ]
}