{
    "term": "woodblocks",
    "meanings": [
        {
            "definition": "A block of wood with a design or image carved into it for printing.",
            "pos": "noun",
            "sent1": "The artist used woodblocks to create beautiful prints of flowers.",
            "sent2": "The book was illustrated with intricate woodblocks depicting scenes from the story.",
            "sent3": "The mischievous squirrel mistook the woodblocks for real trees and tried to climb them.",
            "sent4": "Her mind was a collection of woodblocks, each holding a different memory waiting to be printed.",
            "sent5": "The sound of the woodblocks being carved echoed through the workshop, a symphony of creativity."
        },
        {
            "definition": "The act or process of printing using blocks of wood with carved designs.",
            "pos": "noun",
            "sent1": "The woodblocks were carefully inked before pressing them onto the paper.",
            "sent2": "In the past, woodblocks were commonly used for reproducing illustrations in books.",
            "sent3": "The clumsy printer accidentally dropped the woodblocks, creating a messy masterpiece on the floor.",
            "sent4": "The woodblocks danced across the paper, leaving a trail of colorful patterns behind.",
            "sent5": "The smell of ink filled the room as the woodblocks transferred the design onto the fabric."
        },
        {
            "definition": "A method of printing using blocks of wood with carved designs.",
            "pos": "noun",
            "sent1": "Woodblocks were historically used in East Asia for traditional printing techniques.",
            "sent2": "The teacher demonstrated how to properly align the woodblocks for a clean print.",
            "sent3": "The mischievous student rearranged the woodblocks to create a humorous image on the paper.",
            "sent4": "The woodblocks clicked together like puzzle pieces, forming a complete picture on the page.",
            "sent5": "The intricate details on the woodblocks came to life when pressed onto the parchment."
        }
    ]
}