{
    "term": "woolhats",
    "meanings": [
        {
            "definition": "A hat made of wool.",
            "pos": "noun",
            "sent1": "I bought a cozy woolhats for the cold weather.",
            "sent2": "She knitted a woolhats for her friend's birthday.",
            "sent3": "The sheep wanted to wear a woolhats to stay stylish.",
            "sent4": "His head felt like a woolhats, warm and snug.",
            "sent5": "The colorful woolhats stood out in the crowd."
        },
        {
            "definition": "Hats made of wool.",
            "pos": "noun",
            "sent1": "The shop displayed various woolhats in the window.",
            "sent2": "My grandma gifted me a set of woolhats for Christmas.",
            "sent3": "The sheep decided to open a store selling woolhats.",
            "sent4": "The woolhats were like little clouds on their heads.",
            "sent5": "The woolhats kept their ears toasty in the snow."
        },
        {
            "definition": "To wear woolhats in the winter.",
            "pos": "verb",
            "sent1": "We always woolhats when it's snowy outside.",
            "sent2": "She loves to woolhats while building snowmen.",
            "sent3": "The penguin tried to woolhats but couldn't find one small enough.",
            "sent4": "In the cold, they woolhats to keep warm.",
            "sent5": "The children woolhats happily as they played in the park."
        },
        {
            "definition": "The store sells woolhats.",
            "pos": "noun",
            "sent1": "I visited the store to buy some woolhats for my trip.",
            "sent2": "The woolhats at that store are always top quality.",
            "sent3": "The store owner wore a woolhats even in summer.",
            "sent4": "The woolhats on display caught the customer's eye.",
            "sent5": "The store's woolhats collection was impressive."
        },
        {
            "definition": "Woolhats are warm.",
            "pos": "noun",
            "sent1": "On chilly days, I rely on my woolhats to keep me cozy.",
            "sent2": "The children's woolhats kept them snug during the hike.",
            "sent3": "The woolhats whispered to each other about the cold.",
            "sent4": "In the snowstorm, the woolhats were like little heaters.",
            "sent5": "The woolhats radiated warmth in the winter breeze."
        }
    ]
}