{
    "term": "woorali",
    "meanings": [
        {
            "definition": "A South American poison used on arrow tips for hunting.",
            "pos": "noun",
            "sent1": "The indigenous hunter coated his arrow with woorali before aiming at the prey.",
            "sent2": "The woorali on the arrow helped the hunter catch food for his village.",
            "sent3": "The mischievous monkey accidentally touched the woorali and fell asleep in the tree.",
            "sent4": "The woorali's deadly touch turned the forest into a silent trap for unsuspecting animals.",
            "sent5": "The potent woorali transformed the arrow into a silent predator in the hands of the skilled hunter."
        },
        {
            "definition": "A toxic substance derived from certain plants.",
            "pos": "noun",
            "sent1": "The scientist studied the effects of woorali extracted from a rare plant.",
            "sent2": "Woorali can be a dangerous substance if not handled with care.",
            "sent3": "The curious cat accidentally knocked over the vial of woorali, causing chaos in the lab.",
            "sent4": "The woorali's hidden power lurked within the innocent-looking leaves of the plant.",
            "sent5": "The potent woorali's presence in the forest warned all creatures of its deadly nature."
        },
        {
            "definition": "A type of poison used by indigenous peoples for hunting.",
            "pos": "noun",
            "sent1": "The tribe shared their knowledge of woorali preparation with the young hunters.",
            "sent2": "Woorali was a crucial tool for the indigenous people in their hunting expeditions.",
            "sent3": "The playful children pretended to use woorali on their toy arrows during the game.",
            "sent4": "The woorali's effectiveness in hunting made it a revered substance among the tribe.",
            "sent5": "The ancient art of crafting woorali was passed down through generations for successful hunts."
        }
    ]
}