{
    "term": "workshop",
    "meanings": [
        {
            "definition": "A room or building where goods are manufactured or repaired.",
            "pos": "noun",
            "sent1": "In the workshop, the workers fixed the broken machines.",
            "sent2": "My dad's workshop is filled with tools and spare parts.",
            "sent3": "The workshop was so busy that they ran out of space for all the broken items.",
            "sent4": "Her mind was a workshop of ideas, constantly creating and fixing thoughts.",
            "sent5": "The workshop hummed with the sound of machines and tools, a symphony of productivity."
        },
        {
            "definition": "A meeting at which a group of people engage in intensive discussion and activity on a particular subject.",
            "pos": "noun",
            "sent1": "During the workshop, everyone shared their ideas on the project.",
            "sent2": "The workshop on climate change was informative and engaging.",
            "sent3": "The workshop turned into a lively debate about the best approach to the problem.",
            "sent4": "Her mind was a workshop of ideas, constantly creating and fixing thoughts.",
            "sent5": "The workshop buzzed with energy as everyone contributed their thoughts and opinions."
        },
        {
            "definition": "A brief intensive educational program for a small group of people.",
            "pos": "noun",
            "sent1": "The workshop on coding taught us how to create simple programs.",
            "sent2": "Attending the photography workshop improved my skills behind the camera.",
            "sent3": "The workshop felt like a crash course in painting, with brushes flying everywhere.",
            "sent4": "Her mind was a workshop of ideas, constantly creating and fixing thoughts.",
            "sent5": "The workshop was like a boot camp for learning, pushing us to absorb as much as possible in a short time."
        }
    ]
}