{
    "term": "workbox",
    "meanings": [
        {
            "definition": "A container for holding tools or materials used for work.",
            "pos": "noun",
            "sent1": "My dad's workbox is filled with hammers and nails.",
            "sent2": "The mechanic's workbox was neatly organized with wrenches and screwdrivers.",
            "sent3": "The workbox decided to take a break and refused to open for the carpenter.",
            "sent4": "Her mind was a workbox of ideas, each tool ready to be used for creativity.",
            "sent5": "The workbox stood proudly in the corner, ready to assist in any project."
        },
        {
            "definition": "A small box or case used for storing sewing supplies.",
            "pos": "noun",
            "sent1": "Grandma's workbox held colorful threads and shiny needles.",
            "sent2": "The seamstress's workbox was a treasure trove of buttons and ribbons.",
            "sent3": "The mischievous cat knocked over the workbox, sending spools of thread rolling everywhere.",
            "sent4": "Her heart was a workbox of memories, each one carefully stitched into her life's fabric.",
            "sent5": "The workbox sat on the table, inviting creativity with its array of sewing tools."
        },
        {
            "definition": "A portable container for organizing and carrying work-related items.",
            "pos": "noun",
            "sent1": "The architect's workbox held blueprints and measuring tape for on-the-go projects.",
            "sent2": "The teacher's workbox was a mobile office with pens, papers, and stickers.",
            "sent3": "The workbox went on an adventure, exploring different workspaces around the office.",
            "sent4": "His backpack was a workbox of knowledge, carrying books and notebooks for learning.",
            "sent5": "The workbox accompanied her everywhere, ensuring she was always prepared for any task."
        }
    ]
}