{
    "term": "worked",
    "meanings": [
        {
            "definition": "past tense of work",
            "pos": "verb",
            "sent1": "Yesterday, I worked on my homework until it was finished.",
            "sent2": "She worked at the store for many years before retiring.",
            "sent3": "The little robot worked tirelessly to clean up the mess.",
            "sent4": "His plan worked like a charm, and everything fell into place.",
            "sent5": "The idea of teamwork really clicked when we all worked together on the project."
        },
        {
            "definition": "functioned or operated",
            "pos": "verb",
            "sent1": "The old car worked perfectly after the mechanic fixed it.",
            "sent2": "The clock worked all night, ticking away the hours.",
            "sent3": "The magic wand worked its spell, turning the frog into a prince.",
            "sent4": "The plan worked smoothly, and the event went off without a hitch.",
            "sent5": "The computer worked tirelessly to process all the data in record time."
        },
        {
            "definition": "exerted effort to do something",
            "pos": "verb",
            "sent1": "She worked hard to achieve her dream of becoming a doctor.",
            "sent2": "He worked diligently on his painting, adding intricate details.",
            "sent3": "The little squirrel worked frantically to gather nuts before winter.",
            "sent4": "The team worked together seamlessly to complete the project on time.",
            "sent5": "The athlete worked tirelessly to improve his performance and win the race."
        },
        {
            "definition": "shaped or formed by hammering or other means",
            "pos": "adjective",
            "sent1": "The blacksmith created a beautifully worked iron gate for the garden.",
            "sent2": "The intricate design on the jewelry showcased the finely worked details.",
            "sent3": "The artist displayed a series of finely worked sculptures at the gallery.",
            "sent4": "The carefully worked wood carving was a masterpiece of craftsmanship.",
            "sent5": "The jeweler admired the finely worked silver bracelet for its intricate patterns."
        }
    ]
}