{
    "term": "worldbeats",
    "meanings": [
        {
            "definition": "Worldbeats: a genre of music that combines traditional rhythms and instruments from around the world.",
            "pos": "noun",
            "sent1": "The concert featured a mix of worldbeats that got everyone dancing.",
            "sent2": "I love listening to worldbeats while studying; it helps me focus.",
            "sent3": "The worldbeats at the festival made even the shyest people start moving.",
            "sent4": "Her music collection was a treasure trove of worldbeats waiting to be explored.",
            "sent5": "The worldbeats in the song transported me to far-off lands with just a few notes."
        },
        {
            "definition": "Worldbeats: the act of creating or listening to music in the worldbeats genre.",
            "pos": "noun",
            "sent1": "She spent hours perfecting her worldbeats on the guitar.",
            "sent2": "Let's have a worldbeats party and enjoy the diverse sounds together.",
            "sent3": "His passion for worldbeats led him to start his own band.",
            "sent4": "The worldbeats filled the room, creating a magical atmosphere.",
            "sent5": "The worldbeats echoed through the streets, drawing people to the source of music."
        },
        {
            "definition": "Worldbeats: the global community of fans and musicians who appreciate and participate in worldbeats music.",
            "pos": "noun",
            "sent1": "Being part of the worldbeats community allows you to connect with like-minded individuals.",
            "sent2": "The worldbeats enthusiasts gathered to celebrate their shared love for music.",
            "sent3": "In the worldbeats world, everyone is welcome to join the rhythm.",
            "sent4": "The worldbeats family grows stronger with each new member joining in.",
            "sent5": "The worldbeats tribe danced together under the starlit sky, united by their love for music."
        }
    ]
}