{
    "term": "worldliest",
    "meanings": [
        {
            "definition": "Of or relating to the material world",
            "pos": "adjective",
            "sent1": "The worldliest concerns of the villagers were about their crops and livestock.",
            "sent2": "She preferred to focus on the worldliest matters like fashion and technology.",
            "sent3": "In the worldliest of debates, they argued over the best brand of soap.",
            "sent4": "His mind was filled with the worldliest thoughts, always centered on money and possessions.",
            "sent5": "The worldliest aspects of city life included bustling markets and towering skyscrapers."
        },
        {
            "definition": "Characterized by a focus on material possessions and pleasures",
            "pos": "adjective",
            "sent1": "Their worldliest desires revolved around owning the latest gadgets and designer clothes.",
            "sent2": "Living a worldliest lifestyle, she indulged in luxury vacations and expensive jewelry.",
            "sent3": "The worldliest of all gifts he received was a diamond-encrusted watch.",
            "sent4": "Her room was decorated in the worldliest style, with gold accents and plush furnishings.",
            "sent5": "The worldliest people in town were known for their extravagant parties and lavish spending."
        },
        {
            "definition": "Having extensive knowledge or experience of the world",
            "pos": "adjective",
            "sent1": "As the worldliest traveler in the group, he knew the best routes and hidden gems.",
            "sent2": "She was considered the worldliest professor due to her vast understanding of different cultures.",
            "sent3": "The worldliest explorer in history discovered new lands and ancient civilizations.",
            "sent4": "His stories were always the worldliest, filled with adventures from every corner of the globe.",
            "sent5": "The worldliest diplomat was able to navigate complex international relations with ease."
        }
    ]
}