{
    "term": "worming",
    "meanings": [
        {
            "definition": "The act of removing worms from the body.",
            "pos": "noun",
            "sent1": "After the worming, the patient felt much better.",
            "sent2": "The vet recommended worming for the dog's health.",
            "sent3": "The worming process was like a little adventure for the doctor.",
            "sent4": "She approached the task with the precision of a worming expert.",
            "sent5": "The worming procedure was thorough and effective."
        },
        {
            "definition": "The act of treating an animal for worms.",
            "pos": "noun",
            "sent1": "Regular worming is essential for the well-being of pets.",
            "sent2": "The farmer scheduled a worming session for the livestock.",
            "sent3": "The cat's reaction to worming was quite amusing.",
            "sent4": "She handled the worming of the horses with care and expertise.",
            "sent5": "The vet's advice on worming was clear and helpful."
        },
        {
            "definition": "The act of moving in a sinuous or crawling way.",
            "pos": "noun",
            "sent1": "The worming of the snake was mesmerizing to watch.",
            "sent2": "The worming of the caterpillar was slow but steady.",
            "sent3": "The dancer's performance had a touch of worming in it.",
            "sent4": "The river meandered through the valley, worming its way gently.",
            "sent5": "The worming motion of the robot was surprisingly lifelike."
        },
        {
            "definition": "The act of extracting information through persistent questioning or manipulation.",
            "pos": "noun",
            "sent1": "The detective's worming of the suspect revealed crucial details.",
            "sent2": "The journalist's worming of the source led to a breakthrough story.",
            "sent3": "The comedian's worming of the audience for jokes was clever.",
            "sent4": "Her worming of secrets from her friends was both skillful and discreet.",
            "sent5": "The politician's worming of support from the crowd was impressive."
        }
    ]
}