{
    "term": "worthy",
    "meanings": [
        {
            "definition": "Having worth or value",
            "pos": "adjective",
            "sent1": "The old book was worthy of being kept in the library.",
            "sent2": "She believed her handmade gift was worthy of praise.",
            "sent3": "The cat thought the empty box was worthy of a royal nap.",
            "sent4": "His dedication to his craft made him a worthy contender for the award.",
            "sent5": "The rare diamond was so worthy that it sparkled like a thousand stars."
        },
        {
            "definition": "Deserving of respect or attention",
            "pos": "adjective",
            "sent1": "The brave firefighter was worthy of admiration for saving the family.",
            "sent2": "The wise elder was worthy of listening to for valuable advice.",
            "sent3": "The mischievous puppy thought it was worthy of attention by stealing a sock.",
            "sent4": "Her selfless actions made her a worthy role model for the community.",
            "sent5": "The majestic eagle was so worthy of respect that all watched in awe."
        },
        {
            "definition": "Good enough for",
            "pos": "preposition",
            "sent1": "The simple meal was worthy for a quick lunch break.",
            "sent2": "The small room was worthy for a cozy night's sleep.",
            "sent3": "The old bike was worthy for a leisurely ride in the park.",
            "sent4": "The basic tools were worthy for completing the task at hand.",
            "sent5": "The humble abode was so worthy for a peaceful retreat from the city."
        },
        {
            "definition": "Having qualities that merit recognition",
            "pos": "adjective",
            "sent1": "The talented artist was worthy of winning the competition.",
            "sent2": "His hard work and dedication made him worthy of the promotion.",
            "sent3": "The mischievous squirrel thought it was worthy of a nut-gathering championship.",
            "sent4": "Her kind heart and generosity made her a worthy recipient of the award.",
            "sent5": "The exceptional student was so worthy that even the teachers were impressed."
        }
    ]
}