{
    "term": "wrack",
    "meanings": [
        {
            "definition": "Damage or destruction",
            "pos": "noun",
            "sent1": "The storm caused a lot of wrack to the small town.",
            "sent2": "The earthquake left a trail of wrack in its wake.",
            "sent3": "The wrack from the fallen tree made quite a mess in the yard.",
            "sent4": "The wrack of broken glass glittered in the sunlight.",
            "sent5": "The firefighter surveyed the wrack left by the fire with a heavy heart."
        },
        {
            "definition": "Seaweed or other marine vegetation washed ashore",
            "pos": "noun",
            "sent1": "The children collected colorful wrack on the beach.",
            "sent2": "The seagulls pecked at the wrack scattered along the shore.",
            "sent3": "The wrack tangled in the fisherman's net caused a delay.",
            "sent4": "The salty smell of the wrack filled the air near the coast.",
            "sent5": "The artist used dried wrack in their seaside-inspired artwork."
        },
        {
            "definition": "To wreck or ruin",
            "pos": "verb",
            "sent1": "The reckless driver managed to wrack the car in just a few minutes.",
            "sent2": "The vandals tried to wrack the park benches with graffiti.",
            "sent3": "The mischievous puppy tried to wrack the neatly arranged shoes.",
            "sent4": "The strong winds threatened to wrack the fragile tent.",
            "sent5": "The careless mistake could wrack the entire project if not corrected."
        },
        {
            "definition": "To undergo great emotional or physical suffering",
            "pos": "verb",
            "sent1": "She could feel herself begin to wrack with sobs after the sad news.",
            "sent2": "The athlete's body started to wrack with exhaustion after the race.",
            "sent3": "The comedian's jokes made the audience wrack with laughter.",
            "sent4": "The old man's heart would wrack with pain during cold nights.",
            "sent5": "The intense fear caused her to wrack with anxiety before the presentation."
        }
    ]
}