{
    "term": "wraiths",
    "meanings": [
        {
            "definition": "A ghost or specter",
            "pos": "noun",
            "sent1": "The wraiths haunted the old mansion, floating silently through the halls.",
            "sent2": "The villagers whispered about the wraiths that were said to roam the graveyard at night.",
            "sent3": "The mischievous children pretended to be wraiths, scaring each other in the moonlight.",
            "sent4": "The wraiths of regret lingered in his mind, haunting him with memories of the past.",
            "sent5": "The wraiths appeared as faint shadows, barely visible in the darkness."
        },
        {
            "definition": "An apparition or phantom",
            "pos": "noun",
            "sent1": "The eerie wraiths seemed to glide effortlessly through the misty forest.",
            "sent2": "The legend spoke of wraiths that appeared before a great disaster struck the village.",
            "sent3": "The magician's trick created a wraith that vanished into thin air, leaving the audience amazed.",
            "sent4": "The wraiths of doubt clouded her mind, making her question every decision she made.",
            "sent5": "The wraiths materialized out of nowhere, sending a chill down his spine."
        },
        {
            "definition": "A spirit or soul of a dead person",
            "pos": "noun",
            "sent1": "The wraiths of the ancestors were believed to watch over the family from the spirit realm.",
            "sent2": "The old cemetery was rumored to be haunted by wraiths of those who were buried there.",
            "sent3": "The ghost hunters set out to capture evidence of wraiths on their paranormal investigation.",
            "sent4": "The wraiths of the departed whispered secrets of the afterlife to those who dared to listen.",
            "sent5": "The wraiths glowed with an otherworldly light, illuminating the dark night with their presence."
        }
    ]
}