{
    "term": "wraparounds",
    "meanings": [
        {
            "definition": "A garment that is wrapped around the body, typically a scarf or shawl.",
            "pos": "noun",
            "sent1": "She wore beautiful wraparounds to keep warm in the chilly weather.",
            "sent2": "During winter, many people enjoy wearing cozy wraparounds.",
            "sent3": "The colorful wraparounds she wore made her look like a walking rainbow.",
            "sent4": "Her collection of wraparounds was like a soft, comforting hug waiting in her closet.",
            "sent5": "The silky wraparounds felt like a gentle embrace against her skin."
        },
        {
            "definition": "A type of sunglasses that have lenses that wrap around the sides of the face.",
            "pos": "noun",
            "sent1": "He put on his wraparounds before heading out into the bright sunlight.",
            "sent2": "Many athletes prefer wraparounds for their wide coverage and protection.",
            "sent3": "His stylish wraparounds made him look like a secret agent on a mission.",
            "sent4": "The wraparounds shielded his eyes like a fortress against the glaring sun.",
            "sent5": "The wraparounds gave him a cool, mysterious look as he strolled down the street."
        },
        {
            "definition": "A type of hockey play where a player skates behind the opponent's net and attempts to score by wrapping the puck around the goal.",
            "pos": "noun",
            "sent1": "The player executed a perfect wraparounds maneuver to score a goal.",
            "sent2": "Fans cheered as the player attempted a wraparounds shot to secure the win.",
            "sent3": "The goalie was caught off guard by the unexpected wraparounds move.",
            "sent4": "The wraparounds play was a clever strategy that caught the defense by surprise.",
            "sent5": "His skillful wraparounds shot curved around the net like a skilled artist's brushstroke."
        }
    ]
}