{
    "term": "wrathfulnesses",
    "meanings": [
        {
            "definition": "The state of being full of anger or intense fury.",
            "pos": "noun",
            "sent1": "His wrathfulnesses were evident in his clenched fists and furrowed brow.",
            "sent2": "Her wrathfulnesses towards the situation were understandable given the circumstances.",
            "sent3": "The cat's wrathfulnesses at being woken up from its nap was clear as it hissed at the intruder.",
            "sent4": "The storm's wrathfulnesses shook the windows and rattled the doors.",
            "sent5": "The dragon's wrathfulnesses could be felt in the scorching heat of its breath."
        },
        {
            "definition": "The quality of being wrathful or filled with wrath.",
            "pos": "noun",
            "sent1": "The king's wrathfulnesses were feared throughout the kingdom.",
            "sent2": "She couldn't hide her wrathfulnesses towards the betrayal she had experienced.",
            "sent3": "The toddler's wrathfulnesses over not getting a second cookie was both amusing and frustrating.",
            "sent4": "The volcano's wrathfulnesses erupted with a deafening roar.",
            "sent5": "The teacher's wrathfulnesses could be felt in the stern look she gave the misbehaving student."
        },
        {
            "definition": "The act of displaying anger or rage.",
            "pos": "noun",
            "sent1": "His wrathfulnesses were on full display as he slammed the door shut.",
            "sent2": "The athlete's wrathfulnesses on the field intimidated the opposing team.",
            "sent3": "The clown's exaggerated wrathfulnesses towards the disappearing cake drew laughter from the audience.",
            "sent4": "The storm's wrathfulnesses lashed out with fierce winds and heavy rain.",
            "sent5": "The bear's wrathfulnesses was evident in its loud growls and aggressive stance."
        }
    ]
}