{
    "term": "xanthans",
    "meanings": [
        {
            "definition": "A polysaccharide used as a food additive to thicken and stabilize products.",
            "pos": "noun",
            "sent1": "The chef added xanthans to the soup to make it thicker.",
            "sent2": "Food companies often use xanthans in salad dressings for a better texture.",
            "sent3": "The xanthans in the pudding decided to stick together and create a wobbly dance party.",
            "sent4": "Her words acted like xanthans, thickening the air with tension.",
            "sent5": "The xanthans in the sauce clung to the spoon, showing their thickening power."
        },
        {
            "definition": "A type of gum derived from the fermentation of sugars by the bacterium Xanthomonas campestris.",
            "pos": "noun",
            "sent1": "The xanthans gum was used to make the candy chewy.",
            "sent2": "In the lab, scientists studied the properties of xanthans derived from bacteria.",
            "sent3": "The xanthans gum and the bubblegum had a sticky argument about who was more elastic.",
            "sent4": "The xanthans gum stretched like a rubber band, showing its flexibility.",
            "sent5": "The xanthans gum clung to the teeth, proving its stickiness."
        },
        {
            "definition": "A substance that can be used as a substitute for gluten in gluten-free baking.",
            "pos": "noun",
            "sent1": "She used xanthans as a gluten substitute in her homemade bread.",
            "sent2": "Xanthans are a popular choice for those with gluten intolerance in baking.",
            "sent3": "The xanthans flour and the wheat flour had a race to see who could rise better.",
            "sent4": "Her determination was like xanthans, binding the recipe together seamlessly.",
            "sent5": "The xanthans in the muffins held everything together, just like gluten would."
        }
    ]
}