{
    "term": "xenolithic",
    "meanings": [
        {
            "definition": "Relating to or containing foreign rock fragments.",
            "pos": "adjective",
            "sent1": "The xenolithic boulder had colorful pieces of unfamiliar rocks embedded in it.",
            "sent2": "The geologist studied the xenolithic samples brought back from the expedition.",
            "sent3": "The xenolithic stones in the garden seemed to have their own story to tell.",
            "sent4": "Her mind was a xenolithic landscape, with thoughts from different origins scattered around.",
            "sent5": "The xenolithic nature of the mosaic created a mesmerizing effect on the viewers."
        },
        {
            "definition": "Of or relating to xenoliths.",
            "pos": "adjective",
            "sent1": "The xenolithic layers in the earth's crust provided valuable insights into its composition.",
            "sent2": "The xenolithic inclusion in the volcanic rock was a rare find for the researchers.",
            "sent3": "The xenolithic discovery sparked a wave of excitement among the scientific community.",
            "sent4": "Her eyes gleamed with curiosity as she examined the xenolithic specimen under the microscope.",
            "sent5": "The xenolithic characteristics of the gemstone made it a prized possession among collectors."
        },
        {
            "definition": "Consisting of xenoliths.",
            "pos": "adjective",
            "sent1": "The xenolithic formation displayed a unique blend of host rock and embedded fragments.",
            "sent2": "The xenolithic nature of the mountain hinted at its tumultuous geological history.",
            "sent3": "The xenolithic structure of the cliff face fascinated the rock climbing enthusiasts.",
            "sent4": "The xenolithic composition of the soil made it ideal for studying ancient geological events.",
            "sent5": "The xenolithic landscape bore witness to the dynamic processes shaping the Earth's surface."
        }
    ]
}