{
    "term": "xenophobes",
    "meanings": [
        {
            "definition": "People who have an irrational fear or hatred of foreigners.",
            "pos": "noun",
            "sent1": "Some xenophobes refuse to interact with people from other countries.",
            "sent2": "The xenophobes in the town protested against the new immigrant community.",
            "sent3": "The xenophobes were so scared of foreigners that they avoided trying any foreign cuisine.",
            "sent4": "Her uncle was a xenophobe, seeing danger in every foreign face.",
            "sent5": "The xenophobes' fear of outsiders consumed their thoughts and actions."
        },
        {
            "definition": "A person who is prejudiced against people from other countries.",
            "pos": "noun",
            "sent1": "The xenophobes at the meeting made derogatory comments about immigrants.",
            "sent2": "She realized her neighbor was a xenophobe when he refused to speak to their new foreign neighbors.",
            "sent3": "The xenophobes' fear of foreign languages led to comical misunderstandings.",
            "sent4": "His hatred for foreigners turned him into a xenophobe, closing his mind to new experiences.",
            "sent5": "The xenophobes' prejudice against outsiders blinded them to the beauty of diversity."
        },
        {
            "definition": "Those who exhibit hostility towards individuals who are different from themselves.",
            "pos": "noun",
            "sent1": "The xenophobes in the group always excluded anyone with different beliefs.",
            "sent2": "Xenophobes often react aggressively towards people of different cultures.",
            "sent3": "The xenophobes' fear of change made them act defensively towards new ideas.",
            "sent4": "Their xenophobic behavior made them the xenophobes of the community.",
            "sent5": "The xenophobes' hostility towards diversity created a toxic environment."
        }
    ]
}