{
    "term": "con",
    "meanings": [
        {
            "definition": "Persuade someone to do or believe something, typically by use of deception.",
            "pos": "verb",
            "sent1": "He tried to con his friend into lending him money.",
            "sent2": "The scam artist managed to con many people out of their savings.",
            "sent3": "The mischievous boy attempted to con his sister into trading her toy for his.",
            "sent4": "Her smooth talk and sly smile could con anyone into buying her products.",
            "sent5": "The con artist's silver tongue could convince even the most skeptical individuals."
        },
        {
            "definition": "An argument or vote against a proposal.",
            "pos": "noun",
            "sent1": "She presented a strong con against the new policy.",
            "sent2": "The cons raised during the meeting led to a heated debate.",
            "sent3": "The con presented by the opposition was well-reasoned and logical.",
            "sent4": "His con was like a sharp arrow piercing through the flawed proposal.",
            "sent5": "The powerful con swayed many members to reconsider their support for the plan."
        },
        {
            "definition": "A disadvantage or downside.",
            "pos": "noun",
            "sent1": "One con of living in the city is the noise pollution.",
            "sent2": "Despite the cons, she decided to take on the challenging project.",
            "sent3": "The main con of the job was the long commute to the office.",
            "sent4": "The con of the new technology was its high cost.",
            "sent5": "She weighed the pros and cons before making a decision."
        },
        {
            "definition": "A swindle or trick.",
            "pos": "noun",
            "sent1": "The con artist fooled many with his elaborate schemes.",
            "sent2": "She fell victim to a con that promised quick riches.",
            "sent3": "The clever con left everyone scratching their heads in disbelief.",
            "sent4": "His latest con involved selling fake paintings to unsuspecting buyers.",
            "sent5": "The con was so well-executed that even the authorities were impressed."
        },
        {
            "definition": "To study or examine closely.",
            "pos": "verb",
            "sent1": "She had to con the details of the report before presenting it.",
            "sent2": "The scientist needed to con the data to draw accurate conclusions.",
            "sent3": "He decided to con the ancient artifact to uncover its secrets.",
            "sent4": "The detective had to con the evidence to solve the case.",
            "sent5": "In order to understand the concept fully, she had to con it from different angles."
        }
    ]
}