{
    "term": "xyster",
    "meanings": [
        {
            "definition": "A surgical instrument for scraping bones.",
            "pos": "noun",
            "sent1": "The doctor used a xyster to scrape the bone during the surgery.",
            "sent2": "The xyster is a tool commonly used in orthopedic procedures.",
            "sent3": "The xyster was feeling bored in the surgical tray, so it started tapping on the bone.",
            "sent4": "Her precision with the xyster was like a sculptor carving delicate bone sculptures.",
            "sent5": "The gleaming xyster in the surgeon's hand looked like a tiny, sharp wand ready to work its magic on the bone."
        },
        {
            "definition": "A surgical instrument for removing bone tissue.",
            "pos": "noun",
            "sent1": "The xyster helped the surgeon carefully remove the bone tissue.",
            "sent2": "When using a xyster, it is important to be gentle to avoid damaging surrounding tissues.",
            "sent3": "The xyster decided to take a break and went for a stroll around the bone tissue.",
            "sent4": "With the xyster in hand, she felt like a bone sculptor shaping delicate structures.",
            "sent5": "The sharp tip of the xyster delicately teased out the bone tissue, like a skilled artist revealing a masterpiece."
        },
        {
            "definition": "A surgical instrument for cleaning bones.",
            "pos": "noun",
            "sent1": "After the procedure, the xyster was used to clean any remaining debris from the bone.",
            "sent2": "The xyster is an essential tool for ensuring bones are thoroughly cleaned before further treatment.",
            "sent3": "The xyster felt like a tiny broom sweeping away the dust from the bone.",
            "sent4": "She wielded the xyster with precision, like a meticulous cleaner tidying up the bone surface.",
            "sent5": "The glint of the xyster as it polished the bone made it look like a tiny, efficient cleaning machine."
        }
    ]
}