{
    "term": "yack",
    "meanings": [
        {
            "definition": "To talk incessantly or noisily",
            "pos": "verb",
            "sent1": "During the meeting, Sarah would yack about her weekend nonstop.",
            "sent2": "The children would yack excitedly about their favorite toys.",
            "sent3": "At the party, Tom's yacking kept everyone entertained.",
            "sent4": "The birds in the park yacked loudly, filling the air with noise.",
            "sent5": "His yacking was like a never-ending stream of words flowing out."
        },
        {
            "definition": "Nonsense or idle talk",
            "pos": "noun",
            "sent1": "Don't listen to their yack; it's just silly stories.",
            "sent2": "The teacher ignored the students' yack and focused on the lesson.",
            "sent3": "The yack at the town hall meeting made everyone chuckle.",
            "sent4": "The yack of the gossip magazines was nothing but empty words.",
            "sent5": "Her yack was like a babbling brook, never making much sense."
        },
        {
            "definition": "To vomit or regurgitate",
            "pos": "verb",
            "sent1": "The dog yacked up his dinner on the carpet.",
            "sent2": "After the roller coaster ride, she felt like she might yack.",
            "sent3": "The baby yacked all over his bib, creating a mess.",
            "sent4": "The smell of the garbage made him yack uncontrollably.",
            "sent5": "The food was so bad, it made him yack almost immediately."
        },
        {
            "definition": "A loud, harsh cry or squawk",
            "pos": "noun",
            "sent1": "The yack of the seagulls echoed across the beach.",
            "sent2": "The yack of the crow startled the hikers in the forest.",
            "sent3": "The yack of the parrot made everyone laugh at the zoo.",
            "sent4": "The yack of the peacock was a unique sound in the garden.",
            "sent5": "The yack of the eagle pierced through the silence of the valley."
        }
    ]
}