{
    "term": "yags",
    "meanings": [
        {
            "definition": "Yags: a slang term for marijuana",
            "pos": "noun",
            "sent1": "The teenagers were caught smoking yags behind the school.",
            "sent2": "In some places, yags are legal for medical use.",
            "sent3": "The party was filled with the smell of yags, making everyone hungry.",
            "sent4": "The room was hazy with the smoke of yags, creating a relaxed atmosphere.",
            "sent5": "The police found a hidden stash of yags in the suspect's car."
        },
        {
            "definition": "Yags: to move quickly or suddenly",
            "pos": "verb",
            "sent1": "The cat yags across the room to catch the toy.",
            "sent2": "She yags out of bed when she heard the alarm.",
            "sent3": "The squirrel yags up the tree to escape the dog.",
            "sent4": "Time seems to yags by when you're having fun.",
            "sent5": "The car yags forward as the driver hits the gas pedal."
        },
        {
            "definition": "Yags: a type of plant or shrub",
            "pos": "noun",
            "sent1": "The garden is full of colorful yags that bloom in spring.",
            "sent2": "She enjoys planting yags in her backyard for decoration.",
            "sent3": "The yags in the park sway gently in the breeze.",
            "sent4": "The yags in the forest provide shelter for small animals.",
            "sent5": "The yags in the botanical garden attract many visitors with their beauty."
        },
        {
            "definition": "Yags: a derogatory term for a person",
            "pos": "noun",
            "sent1": "Don't be such a yags and help us clean up.",
            "sent2": "He called his friend a yags in a moment of anger.",
            "sent3": "The yags at work always tries to take credit for others' work.",
            "sent4": "She felt hurt when her classmate called her a yags.",
            "sent5": "The bully's favorite insult was to call others yags."
        }
    ]
}