{
    "term": "yarco",
    "meanings": [
        {
            "definition": "A type of plant with aromatic leaves.",
            "pos": "noun",
            "sent1": "The yarco in the garden smelled so nice.",
            "sent2": "I planted some yarco in my backyard for its fragrance.",
            "sent3": "The yarco plant whispered sweet scents to the other flowers.",
            "sent4": "The yarco leaves danced in the breeze, spreading their perfume.",
            "sent5": "The yarco's aroma filled the air with happiness."
        },
        {
            "definition": "To speak in a loud, harsh, or scolding manner.",
            "pos": "verb",
            "sent1": "Please don't yarco at me like that.",
            "sent2": "The teacher yarcoed at the students for being too loud.",
            "sent3": "The boss yarcoed so loudly that the windows rattled.",
            "sent4": "Her words yarcoed through the room like thunder.",
            "sent5": "His yarcoing voice echoed in the empty hallway."
        },
        {
            "definition": "A type of fabric with a coarse texture.",
            "pos": "noun",
            "sent1": "The yarco fabric scratched my skin.",
            "sent2": "She wore a dress made of yarco material.",
            "sent3": "The yarco cloth felt like sandpaper against my hand.",
            "sent4": "The yarco texture reminded me of rough tree bark.",
            "sent5": "The yarco fabric was uncomfortable but durable."
        },
        {
            "definition": "A type of fishing lure.",
            "pos": "noun",
            "sent1": "The fisherman used a yarco to catch a big fish.",
            "sent2": "The shiny yarco attracted the fish's attention.",
            "sent3": "The yarco lure wiggled in the water, teasing the fish.",
            "sent4": "The yarco danced on the surface, tempting the fish below.",
            "sent5": "The fish couldn't resist the yarco's alluring movements."
        }
    ]
}