{
    "term": "yardbirds",
    "meanings": [
        {
            "definition": "A group of young people who frequent the yards of houses or other buildings.",
            "pos": "noun",
            "sent1": "The neighborhood kids formed a gang of yardbirds who played in everyone's yards.",
            "sent2": "The yardbirds often gathered in the park to hang out and chat.",
            "sent3": "The yardbirds decided to have a race to see who could run the fastest around the block.",
            "sent4": "The yardbirds flocked together like a colorful bunch of birds in the yard.",
            "sent5": "The image of the yardbirds laughing and playing in the yard stayed with me for days."
        },
        {
            "definition": "A person who is inexperienced or unskilled in a particular activity.",
            "pos": "noun",
            "sent1": "As a yardbird in the kitchen, she often burned the toast and overcooked the eggs.",
            "sent2": "The new intern was a yardbird when it came to using the company's software.",
            "sent3": "He felt like a yardbird trying to fix the broken bike without any tools.",
            "sent4": "She was a yardbird in the art class, struggling to paint within the lines.",
            "sent5": "The yardbird driver nervously stalled the car multiple times during the driving lesson."
        },
        {
            "definition": "A term used to refer to chickens or other domestic fowl kept in a yard.",
            "pos": "noun",
            "sent1": "The farmer raised a flock of yardbirds for fresh eggs every morning.",
            "sent2": "The yardbirds clucked happily as they pecked at the grains in the yard.",
            "sent3": "The mischievous cat tried to sneak up on the yardbirds but got scared away by their squawks.",
            "sent4": "The yardbirds strutted around the yard as if they owned the place.",
            "sent5": "The sight of the colorful yardbirds roaming freely in the yard was a peaceful one."
        }
    ]
}