{
    "term": "yate",
    "meanings": [
        {
            "definition": "A large, luxurious car.",
            "pos": "noun",
            "sent1": "The yate parked in front of the mansion was shiny and impressive.",
            "sent2": "She arrived at the party in a sleek yate, turning heads as she stepped out.",
            "sent3": "The yate seemed to be showing off its elegance as it cruised down the street.",
            "sent4": "The yate glided down the road like a majestic chariot of modern times.",
            "sent5": "The yate's leather seats and polished exterior made it feel like a mobile palace."
        },
        {
            "definition": "To be glad or pleased.",
            "pos": "verb",
            "sent1": "I yate when I receive a surprise gift from a friend.",
            "sent2": "She yated at the news of her promotion at work.",
            "sent3": "The puppy seemed to yate happily as it chased its tail in circles.",
            "sent4": "Her heart yated with joy when she saw her family waiting for her at the airport.",
            "sent5": "The children's laughter filled the room, causing everyone to yate along with them."
        },
        {
            "definition": "A gate or barrier.",
            "pos": "noun",
            "sent1": "The wooden yate creaked as it swung open to welcome visitors.",
            "sent2": "The garden was surrounded by a tall yate, keeping the animals out.",
            "sent3": "The mischievous squirrel managed to climb over the yate and into the garden.",
            "sent4": "The yate stood tall and proud, guarding the entrance to the ancient castle.",
            "sent5": "The rusty yate had seen many years of opening and closing for the farm animals."
        },
        {
            "definition": "To pour out or spill.",
            "pos": "verb",
            "sent1": "Be careful not to yate the milk while pouring it into the glass.",
            "sent2": "The clumsy waiter accidentally yated the soup on the customer's lap.",
            "sent3": "The overflowing river yated its waters into the valley below.",
            "sent4": "The excited child yated out all the marbles from the jar onto the floor.",
            "sent5": "The storm caused the clouds to yate rain relentlessly on the parched land."
        }
    ]
}