{
    "term": "yaup",
    "meanings": [
        {
            "definition": "To utter a loud, raucous cry or shout.",
            "pos": "verb",
            "sent1": "The little boy would yaup with joy when he saw his favorite toy.",
            "sent2": "The crowd began to yaup in excitement as the band took the stage.",
            "sent3": "The parrot decided to yaup along with the noisy children in the park.",
            "sent4": "The thunderstorm seemed to yaup angrily as it rolled in.",
            "sent5": "The alarm clock's loud yaup woke up the entire household.",
            "sent6": "She didn't mean to yaup so loudly during the movie.",
            "sent7": "The cat started to yaup when it saw a mouse scurrying by.",
            "sent8": "The baby's constant yauping kept the parents up all night.",
            "sent9": "The old car engine began to yaup and sputter as it struggled to start.",
            "sent10": "The teacher had to ask the students to stop yauping during class."
        },
        {
            "definition": "A loud, raucous cry or shout.",
            "pos": "noun",
            "sent1": "The forest was filled with the yaup of wild animals at night.",
            "sent2": "The sudden yaup from the attic startled everyone in the house.",
            "sent3": "The comedian's yaup of laughter echoed through the theater.",
            "sent4": "The warrior's yaup of victory could be heard across the battlefield.",
            "sent5": "The baby's hungry yaup signaled it was time for a feeding.",
            "sent6": "The unexpected yaup from the basement made everyone jump.",
            "sent7": "The opera singer's powerful yaup resonated through the concert hall.",
            "sent8": "The haunted house was filled with eerie yaups in the dead of night.",
            "sent9": "The referee's sharp yaup signaled the end of the match.",
            "sent10": "The sudden yaup of the fire alarm sent everyone into a panic."
        }
    ]
}