{
    "term": "yode",
    "meanings": [
        {
            "definition": "A loud, rhythmic singing or chanting cry used in Jewish and Swiss culture.",
            "pos": "noun",
            "sent1": "During the celebration, the crowd erupted in a joyful yode.",
            "sent2": "The yode echoed through the mountains, filling the valley with music.",
            "sent3": "The yode of the villagers startled the sleeping bear, who ran away in surprise.",
            "sent4": "Her laughter was like a yode, infectious and full of joy.",
            "sent5": "The yode of the choir resonated in the ancient cathedral, lifting spirits high."
        },
        {
            "definition": "To sing with frequent changes from the natural voice to falsetto.",
            "pos": "verb",
            "sent1": "She would often yode along to her favorite songs, hitting high notes effortlessly.",
            "sent2": "The singer's ability to yode mesmerized the audience, showcasing his vocal range.",
            "sent3": "In the shower, he loved to yode, pretending to be a famous opera singer.",
            "sent4": "Her voice yoded like a bird in the early morning, waking up the entire household.",
            "sent5": "The wind yoded through the trees, creating a symphony of nature's music."
        },
        {
            "definition": "A type of folk song sung by the Swiss.",
            "pos": "noun",
            "sent1": "The traditional yode was passed down through generations, preserving Swiss culture.",
            "sent2": "At the festival, the performers sang a beautiful yode that brought tears to the audience's eyes.",
            "sent3": "The cows in the meadow seemed to yode along with the shepherd's flute.",
            "sent4": "His heart felt light as he listened to the yode, transporting him to the Swiss Alps.",
            "sent5": "The yode carried the memories of the past, connecting the present to a simpler time."
        }
    ]
}