{
    "term": "yogi",
    "meanings": [
        {
            "definition": "A person who practices yoga.",
            "pos": "noun",
            "sent1": "The yogi led a peaceful yoga class in the park.",
            "sent2": "She became a yogi after years of practicing yoga.",
            "sent3": "The yogi tried to touch her toes but ended up falling over.",
            "sent4": "His flexibility made him a yogi among his friends.",
            "sent5": "The yogi's calm demeanor inspired others to join her yoga sessions."
        },
        {
            "definition": "A practitioner of yoga.",
            "pos": "noun",
            "sent1": "The dedicated yogi attended yoga classes every day.",
            "sent2": "As a yogi, she enjoyed exploring different yoga styles.",
            "sent3": "The yogi's cat tried to mimic her yoga poses.",
            "sent4": "She was a true yogi, finding peace in every yoga pose.",
            "sent5": "The yogi's passion for yoga was evident in her graceful movements."
        },
        {
            "definition": "A Hindu ascetic.",
            "pos": "noun",
            "sent1": "The wise yogi meditated under the tree for hours.",
            "sent2": "People sought guidance from the revered yogi in the village.",
            "sent3": "The mischievous children played a prank on the sleeping yogi.",
            "sent4": "The yogi's teachings resonated deeply with his followers.",
            "sent5": "The yogi's presence brought a sense of peace to the chaotic city."
        },
        {
            "definition": "A person who is proficient in yoga.",
            "pos": "noun",
            "sent1": "She became a skilled yogi after years of dedicated practice.",
            "sent2": "The yogi effortlessly performed advanced yoga poses.",
            "sent3": "The clumsy yogi tripped over her yoga mat during class.",
            "sent4": "His expertise as a yogi was recognized by yoga enthusiasts.",
            "sent5": "The yogi's grace and strength were admired by all in the yoga studio."
        }
    ]
}