{
    "term": "yokes",
    "meanings": [
        {
            "definition": "A wooden crosspiece that is fastened over the necks of two animals and attached to the plow or cart that they are to pull.",
            "pos": "noun",
            "sent1": "The farmer placed the yokes on the oxen before they started plowing the field.",
            "sent2": "The yokes were essential for connecting the horses to the carriage.",
            "sent3": "The mischievous goat tried to wear the yokes as a fancy necklace.",
            "sent4": "The yokes united the strength of the two horses, making them a powerful team.",
            "sent5": "The creaking sound of the yokes echoed through the valley as the oxen pulled the heavy load."
        },
        {
            "definition": "A device for joining together a pair of draft animals, especially oxen, usually consisting of a crosspiece with two bow-shaped pieces, each enclosing the head of an animal.",
            "pos": "noun",
            "sent1": "The wooden yokes securely held the oxen in place as they plowed the field.",
            "sent2": "The farmer carefully adjusted the yokes to fit the oxen comfortably.",
            "sent3": "The mischievous goat tried to balance the yokes on its head like a circus act.",
            "sent4": "The yokes framed the oxen's heads, creating a sturdy connection between them.",
            "sent5": "The clanking of the yokes signaled the start of the day's work on the farm."
        },
        {
            "definition": "A pair of draft animals fastened together by a yoke.",
            "pos": "noun",
            "sent1": "The yokes guided the movement of the oxen as they pulled the heavy load.",
            "sent2": "The farmer led the yokes towards the plow to begin the field work.",
            "sent3": "The mischievous goat tried to balance on the yokes like a tightrope walker.",
            "sent4": "The yokes linked the two horses, ensuring they moved in harmony.",
            "sent5": "The weight of the yokes reminded the oxen of their shared responsibility in pulling the cart."
        }
    ]
}