{
    "term": "yoni",
    "meanings": [
        {
            "definition": "The vulva, especially as a symbol of divine procreative energy in Hinduism.",
            "pos": "noun",
            "sent1": "In Hinduism, the yoni is revered for its connection to creation and life.",
            "sent2": "The yoni is often depicted in ancient art as a sacred symbol of fertility.",
            "sent3": "The artist sculpted a beautiful yoni statue to represent the divine power of birth.",
            "sent4": "Her yoni, like a blossoming flower, symbolizes the potential for new beginnings.",
            "sent5": "The yoni, with its intricate design, embodies the essence of feminine energy."
        },
        {
            "definition": "A representation of the female genitalia used as a symbol of fertility and divine feminine energy.",
            "pos": "noun",
            "sent1": "The ancient carving of a yoni symbolizes the nurturing aspect of femininity.",
            "sent2": "Many cultures use the yoni as a powerful emblem of fertility and femininity.",
            "sent3": "During the ceremony, the priest held up a yoni sculpture to honor the goddess of fertility.",
            "sent4": "Her yoni pendant, like a beacon of life, radiates the essence of womanhood.",
            "sent5": "The yoni symbol, with its deep meaning, resonates with the power of creation."
        },
        {
            "definition": "The female reproductive organs, especially the external genitalia.",
            "pos": "noun",
            "sent1": "Doctors study the yoni to understand the complexities of female anatomy.",
            "sent2": "The yoni plays a crucial role in the reproductive system of women.",
            "sent3": "She jokingly referred to her cat as the 'furry yoni' of the household.",
            "sent4": "The yoni, like a delicate flower, requires care and attention for health.",
            "sent5": "The yoni, a symbol of femininity, is a source of life and vitality."
        }
    ]
}