{
    "term": "zamindars",
    "meanings": [
        {
            "definition": "Zamindars: plural noun, landowners in India who collected taxes",
            "pos": "noun",
            "sent1": "The zamindars in the village were responsible for collecting taxes from the farmers.",
            "sent2": "The British colonial rulers often dealt with the zamindars when it came to tax matters.",
            "sent3": "The zamindars decided to have a tax collection competition to see who could gather the most coins.",
            "sent4": "The zamindars were like the guardians of the village's wealth, ensuring taxes were paid on time.",
            "sent5": "The image of the zamindars riding through the fields, collecting taxes, is etched in the villagers' minds."
        },
        {
            "definition": "Zamindars: verb, the act of being a landowner in India who collects taxes",
            "pos": "verb",
            "sent1": "The wealthy family decided to zamindars the vast estate they inherited.",
            "sent2": "In the past, many individuals would zamindars the lands they owned to make a living.",
            "sent3": "The young entrepreneur wanted to zamindars his properties in a fair and just manner.",
            "sent4": "She had to quickly learn how to zamindars the land after her father passed away.",
            "sent5": "The villagers respected those who knew how to zamindars their lands effectively."
        },
        {
            "definition": "Zamindars: adjective, describing the landowning class in India who collect taxes",
            "pos": "adjective",
            "sent1": "The zamindars families were highly respected in the region for their wealth and influence.",
            "sent2": "People often sought advice from the zamindars leaders on matters of land and taxes.",
            "sent3": "It was a zamindars tradition to hold a grand feast for the entire village every harvest season.",
            "sent4": "The zamindars lifestyle was luxurious, with grand mansions and elaborate gardens.",
            "sent5": "The zamindars culture was known for its elaborate ceremonies and celebrations."
        }
    ]
}