{
    "term": "zap",
    "meanings": [
        {
            "definition": "To strike or hit with a sudden, sharp blow.",
            "pos": "verb",
            "sent1": "I will zap the ball with my foot.",
            "sent2": "The superhero zapped the villain with lightning.",
            "sent3": "Watch out! I might accidentally zap you with this rubber band.",
            "sent4": "Her words zapped his heart like a lightning bolt.",
            "sent5": "The sudden zap of the door slamming made me jump."
        },
        {
            "definition": "To destroy or kill with a sudden burst of energy.",
            "pos": "verb",
            "sent1": "The laser beam can zap the enemy's spaceship.",
            "sent2": "The bug zapper can zap mosquitoes effectively.",
            "sent3": "I accidentally zapped my computer with static electricity.",
            "sent4": "The powerful spell zapped the evil sorcerer out of existence.",
            "sent5": "The lightning zap obliterated the old tree in seconds."
        },
        {
            "definition": "To move quickly or suddenly.",
            "pos": "verb",
            "sent1": "The rabbit will zap across the field in a flash.",
            "sent2": "The car zapped past us on the highway.",
            "sent3": "I need to zap to the store before it closes.",
            "sent4": "The idea zapped into her mind out of nowhere.",
            "sent5": "The spaceship zapped through the galaxy at incredible speed."
        },
        {
            "definition": "A sudden burst of energy or power.",
            "pos": "noun",
            "sent1": "The zap of lightning lit up the sky.",
            "sent2": "The machine gave a powerful zap when turned on.",
            "sent3": "The zap of caffeine helped me stay awake during the meeting.",
            "sent4": "His speech had a zap of enthusiasm that inspired the audience.",
            "sent5": "The zap of electricity surged through the wires."
        }
    ]
}