{
    "term": "zapateados",
    "meanings": [
        {
            "definition": "A type of Mexican folk dance characterized by rhythmic footwork.",
            "pos": "noun",
            "sent1": "During the fiesta, the dancers showcased their zapateados with joy.",
            "sent2": "The group gathered to watch the traditional zapateados performance.",
            "sent3": "The zapateados at the festival were so lively that even the shyest onlookers couldn't resist tapping their feet.",
            "sent4": "The zapateados echoed through the square, filling the air with energy and excitement.",
            "sent5": "The zapateados were like a symphony of feet, creating a mesmerizing rhythm."
        },
        {
            "definition": "The act of performing zapateados.",
            "pos": "noun",
            "sent1": "Her zapateados were so graceful and precise, captivating the audience.",
            "sent2": "The instructor demonstrated the proper technique for executing zapateados.",
            "sent3": "He couldn't help but break into zapateados while waiting for the bus, much to the amusement of passersby.",
            "sent4": "With each zapateados, she expressed her passion for the dance form.",
            "sent5": "The room filled with the infectious energy of his zapateados."
        },
        {
            "definition": "The sound made by the tapping of feet in zapateados.",
            "pos": "noun",
            "sent1": "The zapateados reverberated through the wooden floor, creating a rhythmic melody.",
            "sent2": "The audience clapped along to the lively zapateados of the performers.",
            "sent3": "The cat's playful paws on the hardwood floor mimicked the zapateados of a dancer.",
            "sent4": "As the rain fell on the roof, it sounded like a gentle zapateados of nature.",
            "sent5": "The zapateados of the children playing outside added a cheerful soundtrack to the neighborhood."
        }
    ]
}