{
    "term": "zapping",
    "meanings": [
        {
            "definition": "To strike or hit with a quick, sharp blow.",
            "pos": "verb",
            "sent1": "He was zapping the ball with his racket during the tennis match.",
            "sent2": "The boxer was zapping his opponent with powerful punches.",
            "sent3": "The ninja zapped the target with lightning speed, surprising everyone.",
            "sent4": "Her words zapped him like a sudden bolt of lightning.",
            "sent5": "The thunder zapped the tree, splitting it in half with a loud crack."
        },
        {
            "definition": "To move quickly or suddenly.",
            "pos": "verb",
            "sent1": "The cat was zapping around the room, chasing after a toy.",
            "sent2": "The car zapped down the road, leaving a trail of dust behind.",
            "sent3": "The squirrel zapped up the tree in a flash, escaping the chasing dog.",
            "sent4": "Her heart zapped with excitement as she saw her favorite band perform.",
            "sent5": "The idea zapped into his mind suddenly, inspiring him to take action."
        },
        {
            "definition": "To change channels quickly while watching television.",
            "pos": "verb",
            "sent1": "She kept zapping through channels, trying to find something interesting to watch.",
            "sent2": "He was zapping between news and sports channels to catch up on updates.",
            "sent3": "The remote control zapped through channels like a magician's wand.",
            "sent4": "Her thumb zapped the remote, switching channels faster than anyone else.",
            "sent5": "The kids were zapping through channels, looking for their favorite cartoon."
        },
        {
            "definition": "To cook or heat food quickly in a microwave.",
            "pos": "verb",
            "sent1": "He was zapping his leftovers in the microwave for a quick meal.",
            "sent2": "She zapped the popcorn for movie night in just a few seconds.",
            "sent3": "The microwave zapped the food, making it ready to eat in no time.",
            "sent4": "The microwave zapped the frozen dinner, transforming it into a hot meal.",
            "sent5": "The smell of zapping popcorn filled the kitchen, making everyone hungry."
        }
    ]
}