{
    "term": "zareebas",
    "meanings": [
        {
            "definition": "Zareebas (noun): a type of traditional Indian clothing worn by women.",
            "pos": "noun",
            "sent1": "During the festival, she wore beautiful zareebas embroidered with colorful threads.",
            "sent2": "The bride looked stunning in her red zareebas on her wedding day.",
            "sent3": "She accidentally spilled curry on her zareebas, adding a spicy touch to her outfit.",
            "sent4": "Her zareebas flowed like a river of silk as she danced gracefully.",
            "sent5": "The intricate patterns on her zareebas seemed to tell a story of ancient traditions."
        },
        {
            "definition": "Zareebas (verb): to dress oneself in zareebas.",
            "pos": "verb",
            "sent1": "She zareebased herself in elegant attire for the special occasion.",
            "sent2": "Every morning, she zareebased in her favorite zareebas before starting her day.",
            "sent3": "He decided to zareebas in his zareebas for the costume party, causing laughter among his friends.",
            "sent4": "As she zareebased in her zareebas, she felt a sense of tradition and pride.",
            "sent5": "The actors zareebased in elaborate zareebas for the historical play, transporting the audience to another era."
        },
        {
            "definition": "Zareebas (adjective): relating to or characteristic of zareebas.",
            "pos": "adjective",
            "sent1": "The designer created a zareebas collection inspired by traditional Indian motifs.",
            "sent2": "Her room was decorated with zareebas patterns and vibrant colors.",
            "sent3": "The cat strutted around with a zareebas attitude, demanding attention from everyone.",
            "sent4": "The sunset painted the sky in zareebas hues, casting a warm glow over the landscape.",
            "sent5": "The old mansion had a zareebas charm, with its ornate architecture and lush gardens."
        }
    ]
}