{
    "term": "zeaxanthin",
    "meanings": [
        {
            "definition": "A yellow pigment found in plants and fruits.",
            "pos": "noun",
            "sent1": "The zeaxanthin in the flower petals gives them their bright color.",
            "sent2": "Oranges and corn contain zeaxanthin, which gives them their yellow hue.",
            "sent3": "The zeaxanthin in the banana peel made it look like it was wearing a golden jacket.",
            "sent4": "The fields were painted with zeaxanthin as the sun set, casting a warm glow over the landscape.",
            "sent5": "The artist used zeaxanthin to create a vibrant painting of the sunflower field."
        },
        {
            "definition": "A type of carotenoid antioxidant.",
            "pos": "noun",
            "sent1": "Including zeaxanthin-rich foods in your diet can help boost your antioxidant intake.",
            "sent2": "Zeaxanthin is known for its antioxidant properties that protect cells from damage.",
            "sent3": "The superhero's secret weapon against free radicals was zeaxanthin, the mighty antioxidant.",
            "sent4": "In the battle against oxidative stress, zeaxanthin stood strong like a shield for the cells.",
            "sent5": "The scientist discovered the power of zeaxanthin in fighting off harmful molecules in the body."
        },
        {
            "definition": "A nutrient that is important for eye health.",
            "pos": "noun",
            "sent1": "Eating foods rich in zeaxanthin can support your eye health and vision.",
            "sent2": "Zeaxanthin plays a crucial role in maintaining the health of the eyes.",
            "sent3": "The pirate believed that zeaxanthin was the key to seeing hidden treasures clearly.",
            "sent4": "Her eyes sparkled with the clarity of zeaxanthin after following a diet rich in the nutrient.",
            "sent5": "The optometrist recommended zeaxanthin supplements to improve the patient's vision."
        }
    ]
}