{
    "term": "zho",
    "meanings": [
        {
            "definition": "A unit of currency in Laos.",
            "pos": "noun",
            "sent1": "In Laos, you can buy many things with one zho.",
            "sent2": "I exchanged my dollars for zho at the market.",
            "sent3": "The zho in my pocket jingled as I walked.",
            "sent4": "Her savings grew like a pile of zho in a treasure chest.",
            "sent5": "The shiny zho sparkled in the sunlight."
        },
        {
            "definition": "A type of Chinese martial art.",
            "pos": "noun",
            "sent1": "He practiced zho every morning to improve his skills.",
            "sent2": "The dojo offered classes in various forms of zho.",
            "sent3": "The sound of zho echoed through the training hall.",
            "sent4": "His movements were as swift and precise as a zho master.",
            "sent5": "She felt empowered after mastering a new zho technique."
        },
        {
            "definition": "A type of fermented tea.",
            "pos": "noun",
            "sent1": "After dinner, she enjoyed a cup of warm zho.",
            "sent2": "The aroma of zho filled the room as it brewed.",
            "sent3": "He accidentally spilled zho on his shirt, creating a unique scent.",
            "sent4": "The taste of zho was a delightful surprise on her palate.",
            "sent5": "The steam rising from the zho was comforting on a cold day."
        },
        {
            "definition": "A type of traditional Chinese clothing.",
            "pos": "noun",
            "sent1": "She admired the intricate designs on the zho displayed in the shop.",
            "sent2": "The fabric of the zho was soft and smooth against her skin.",
            "sent3": "He felt elegant and regal in his new zho for the ceremony.",
            "sent4": "The colors of the zho reminded her of a beautiful sunset.",
            "sent5": "The embroidery on the zho was a work of art."
        }
    ]
}