{
    "term": "zipola",
    "meanings": [
        {
            "definition": "A sudden movement or action.",
            "pos": "noun",
            "sent1": "Out of nowhere, a zipola startled the cat.",
            "sent2": "The zipola of the car caught me by surprise.",
            "sent3": "The zipola of the squirrel made everyone laugh.",
            "sent4": "Her decision to leave was like a zipola in the calm pond of our friendship.",
            "sent5": "The zipola of the falling book made a loud noise."
        },
        {
            "definition": "To move quickly or swiftly.",
            "pos": "verb",
            "sent1": "I need to zipola to catch the bus.",
            "sent2": "She likes to zipola through her chores to have more playtime.",
            "sent3": "The kids zipola around the playground, full of energy.",
            "sent4": "Time seemed to zipola by as they enjoyed their day at the park.",
            "sent5": "The wind made the leaves zipola across the yard."
        },
        {
            "definition": "A small, fastener used to open and close clothing.",
            "pos": "noun",
            "sent1": "She struggled with the zipola on her jacket.",
            "sent2": "The zipola on his bag broke, so he couldn't close it.",
            "sent3": "The zipola on the dress was stuck, causing a fashion emergency.",
            "sent4": "Her necklace clasp was like a tiny zipola holding it together.",
            "sent5": "The zipola on the backpack was colorful and easy to use."
        },
        {
            "definition": "To close or fasten with a zipper.",
            "pos": "verb",
            "sent1": "He tried to zipola his jacket before the rain started.",
            "sent2": "She had to zipola her suitcase to keep everything secure.",
            "sent3": "The tent flap wouldn't zipola, making it hard to sleep.",
            "sent4": "She could feel her heart zipola shut as she said goodbye.",
            "sent5": "The jacket zipolaed perfectly, keeping her warm in the cold."
        }
    ]
}