{
    "term": "zippos",
    "meanings": [
        {
            "definition": "A brand of windproof lighter.",
            "pos": "noun",
            "sent1": "I always carry my zippos with me in case I need to light a candle.",
            "sent2": "The collector showed off his rare zippos to his friends.",
            "sent3": "The zippos sparked a conversation about vintage lighters.",
            "sent4": "Her smile lit up the room like a flickering zippo.",
            "sent5": "The shiny zippo gleamed in the sunlight, catching everyone's eye."
        },
        {
            "definition": "To move quickly or swiftly.",
            "pos": "verb",
            "sent1": "The cheetah can zippos across the savannah in seconds.",
            "sent2": "We need to zippos to catch the last bus of the night.",
            "sent3": "The squirrel zippos up the tree to escape the curious cat.",
            "sent4": "Time seemed to zippos by as they laughed and talked.",
            "sent5": "The car zippos down the highway, leaving a trail of dust behind."
        },
        {
            "definition": "A sound made by something moving quickly.",
            "pos": "noun",
            "sent1": "The zippos of the skateboard echoed through the empty parking lot.",
            "sent2": "The zippos of the train approaching the station could be heard from afar.",
            "sent3": "The zippos of the basketball hitting the rim signaled a near miss.",
            "sent4": "The zippos of the wind in the trees created a soothing melody.",
            "sent5": "The zippos of the rocket launching into space was deafening."
        },
        {
            "definition": "To close or fasten with a zipper.",
            "pos": "verb",
            "sent1": "She quickly zippos her jacket to shield herself from the cold wind.",
            "sent2": "He needs to zippos his bag before the items fall out.",
            "sent3": "The magician zippos the curtain, preparing for his grand reveal.",
            "sent4": "She zippos her suitcase, ready for her weekend getaway.",
            "sent5": "He zippos his backpack, making sure everything is secure for the hike."
        }
    ]
}