{
    "term": "zodiacal",
    "meanings": [
        {
            "definition": "Of or relating to the zodiac.",
            "pos": "adjective",
            "sent1": "The zodiacal symbols represent different star patterns.",
            "sent2": "She read her zodiacal forecast for the week.",
            "sent3": "The zodiacal signs decided to have a party in the night sky.",
            "sent4": "His zodiacal personality shone through in his actions.",
            "sent5": "The zodiacal constellations guided ancient sailors on their journeys."
        },
        {
            "definition": "Resembling or characteristic of the zodiac.",
            "pos": "adjective",
            "sent1": "Her dress had a zodiacal pattern of stars and moons.",
            "sent2": "The room was decorated with zodiacal symbols.",
            "sent3": "The zodiacal cupcakes were a hit at the party.",
            "sent4": "His zodiacal necklace was a unique piece of jewelry.",
            "sent5": "The zodiacal colors of blue and gold filled the room with warmth."
        },
        {
            "definition": "Located within or determined by the zodiac.",
            "pos": "adjective",
            "sent1": "The zodiacal constellations can be seen in the night sky.",
            "sent2": "Her zodiacal chart revealed interesting insights.",
            "sent3": "The zodiacal garden bloomed with celestial flowers.",
            "sent4": "His zodiacal fate seemed written in the stars.",
            "sent5": "The zodiacal calendar marked important celestial events."
        },
        {
            "definition": "Pertaining to the twelve astrological signs of the zodiac.",
            "pos": "adjective",
            "sent1": "She studied the zodiacal signs to understand personalities.",
            "sent2": "His zodiacal birth chart revealed his strengths and weaknesses.",
            "sent3": "The zodiacal animals danced across the sky in a cosmic parade.",
            "sent4": "The zodiacal symbols were used to predict future events.",
            "sent5": "The zodiacal constellations held secrets of the universe within them."
        }
    ]
}