{
    "term": "zombifies",
    "meanings": [
        {
            "definition": "To turn into a zombie.",
            "pos": "verb",
            "sent1": "The mysterious potion zombifies anyone who drinks it.",
            "sent2": "The virus zombifies its victims, turning them into the undead.",
            "sent3": "The cursed amulet zombifies the wearer, making them shuffle aimlessly.",
            "sent4": "The eerie fog seemed to zombify the entire town, casting a spell of lethargy over the residents.",
            "sent5": "The haunting melody of the music box zombifies all who hear it, luring them into a trance-like state."
        },
        {
            "definition": "To make someone act like a zombie.",
            "pos": "verb",
            "sent1": "The hypnotist's spell zombifies the volunteer, causing them to mimic zombie movements.",
            "sent2": "The mind control device zombifies its victims, compelling them to follow orders without question.",
            "sent3": "The silly dance routine zombifies the participants, turning them into hilarious zombies for the show.",
            "sent4": "The monotonous lecture seemed to zombify the entire class, putting them in a trance-like state of boredom.",
            "sent5": "The contagious laughter in the room zombifies everyone, making them giggle uncontrollably like zombies."
        },
        {
            "definition": "To cause someone to become mindless or unresponsive.",
            "pos": "verb",
            "sent1": "The repetitive task zombifies the worker, making them perform robotically without thought.",
            "sent2": "The hypnotic music zombifies the audience, leaving them in a state of trance-like relaxation.",
            "sent3": "The soothing voice of the narrator zombifies the listeners, lulling them into a peaceful slumber.",
            "sent4": "The endless scrolling on social media zombifies users, numbing their minds to the passage of time.",
            "sent5": "The mind-numbing routine of daily chores zombifies the housemates, turning them into autopilot zombies."
        }
    ]
}