{
    "term": "zombi",
    "meanings": [
        {
            "definition": "A reanimated corpse that has been brought back to life through supernatural means.",
            "pos": "noun",
            "sent1": "The zombi stumbled through the graveyard, its eyes empty and lifeless.",
            "sent2": "The villagers were terrified when they saw the zombi walking among them.",
            "sent3": "The zombi tried to order a brain smoothie at the cafe, causing quite a commotion.",
            "sent4": "Her mind felt like a zombi, going through the motions without any real purpose.",
            "sent5": "The zombi's decaying flesh and vacant stare haunted the dreams of the townspeople."
        },
        {
            "definition": "A person who is believed to have died and been brought back to life without a soul or consciousness.",
            "pos": "noun",
            "sent1": "The old tale spoke of a zombi who roamed the forest, seeking lost souls.",
            "sent2": "Some believe that a zombi walks among us, looking for its lost humanity.",
            "sent3": "The zombi attended the party, but everyone could tell something was off.",
            "sent4": "Her eyes were like a zombi's, devoid of emotion or recognition.",
            "sent5": "The zombi's presence in the room sent shivers down everyone's spine."
        },
        {
            "definition": "A fictional undead creature typically depicted as a mindless, flesh-eating monster.",
            "pos": "noun",
            "sent1": "In the movie, the zombi horde relentlessly pursued the survivors through the city.",
            "sent2": "The video game featured a terrifying boss battle against a giant zombi.",
            "sent3": "The zombi tried to eat a sandwich, but ended up chewing on its own hand instead.",
            "sent4": "The city streets were filled with the stench of decay as the zombi apocalypse raged on.",
            "sent5": "The zombi's insatiable hunger for human flesh made it a formidable foe."
        }
    ]
}