{
    "term": "zombified",
    "meanings": [
        {
            "definition": "To turn into a zombie.",
            "pos": "verb",
            "sent1": "After being bitten by the strange creature, he zombified and started craving brains.",
            "sent2": "The virus zombified the entire town, causing chaos and panic.",
            "sent3": "The party guests joked that the boring lecture zombified them all.",
            "sent4": "The hypnotic music zombified the audience, making them move in unison like zombies.",
            "sent5": "The eerie fog outside the window made the street look zombified, with shadows lurking in every corner."
        },
        {
            "definition": "To make someone behave like a zombie.",
            "pos": "verb",
            "sent1": "The mind control device zombified the unsuspecting victims, making them follow orders without question.",
            "sent2": "The evil sorcerer zombified the villagers, turning them into his mindless minions.",
            "sent3": "The boring presentation zombified the audience, putting them in a trance-like state.",
            "sent4": "The monotonous routine of daily life can slowly zombify even the most enthusiastic individuals.",
            "sent5": "The eerie silence in the abandoned house zombified the explorers, filling them with dread and unease."
        },
        {
            "definition": "In a state of zombification.",
            "pos": "adjective",
            "sent1": "The zombified creatures roamed the deserted streets, searching for their next meal.",
            "sent2": "The haunted house had a zombified atmosphere, sending shivers down the spines of those who dared to enter.",
            "sent3": "The tired students looked zombified after pulling an all-nighter to finish their project.",
            "sent4": "The eerie mist gave the forest a zombified appearance, making it seem like a scene from a horror movie.",
            "sent5": "The abandoned graveyard had a zombified feel, with tombstones leaning at odd angles and weeds covering the ground."
        }
    ]
}