{
    "term": "zombify",
    "meanings": [
        {
            "definition": "To turn into a zombie.",
            "pos": "verb",
            "sent1": "The evil scientist used a potion to zombify the villagers.",
            "sent2": "The virus can zombify humans and turn them into mindless creatures.",
            "sent3": "If you eat too much candy, you might zombify yourself with a sugar rush!",
            "sent4": "The monotonous routine of the office job seemed to slowly zombify his spirit.",
            "sent5": "The dark magic spell had the power to zombify anyone who dared to enter the forbidden forest."
        },
        {
            "definition": "To make someone behave like a zombie.",
            "pos": "verb",
            "sent1": "The hypnotist tried to zombify the audience with his mesmerizing gaze.",
            "sent2": "The mind control device could zombify people and force them to follow orders.",
            "sent3": "After a long day at work, she felt so tired that she could barely resist the urge to zombify on the couch.",
            "sent4": "The eerie music had a strange effect on the crowd, seeming to zombify their movements.",
            "sent5": "The mysterious potion had the power to zombify anyone who drank it, turning them into obedient followers."
        },
        {
            "definition": "To become like a zombie.",
            "pos": "verb",
            "sent1": "As the illness progressed, he started to zombify and lose his sense of self.",
            "sent2": "The lack of sleep can zombify a person, making them feel groggy and unfocused.",
            "sent3": "During the boring lecture, the students began to zombify and stare blankly at the professor.",
            "sent4": "The endless scrolling on social media seemed to zombify her mind, numbing her to the world around her.",
            "sent5": "The eerie mist in the graveyard seemed to zombify the atmosphere, creating a sense of dread and unease."
        }
    ]
}