{
    "term": "zombis",
    "meanings": [
        {
            "definition": "A reanimated corpse that has been brought back to life through supernatural means.",
            "pos": "noun",
            "sent1": "The zombis lurched through the graveyard, its eyes empty and its movements slow.",
            "sent2": "In the movie, the zombis rose from their graves hungry for brains.",
            "sent3": "At the Halloween party, someone dressed up as a zombis and scared everyone!",
            "sent4": "The abandoned house felt like a zombis, with creaking floors and shadows lurking in every corner.",
            "sent5": "The legend spoke of a cursed land where zombis roamed freely, seeking revenge on the living.",
            "sent6": "After watching a scary movie, I had nightmares about zombis coming to life.",
            "sent7": "The zombis in the video game moved slowly but were relentless in their pursuit of the player.",
            "sent8": "During the haunted house tour, a zombis suddenly jumped out from behind a door, causing screams of terror.",
            "sent9": "The old cemetery was rumored to be haunted by zombis who roamed the grounds at night.",
            "sent10": "The eerie fog made the graveyard look like a place where zombis could easily hide."
        },
        {
            "definition": "A person who is apathetic or unresponsive, often due to fatigue or boredom.",
            "pos": "noun",
            "sent1": "After a long day at work, he felt like a zombis, just going through the motions.",
            "sent2": "She stared blankly ahead, feeling like a zombis as the teacher droned on.",
            "sent3": "When the alarm clock rang for the fifth time, he stumbled out of bed like a zombis.",
            "sent4": "The waiting room was filled with zombis, their eyes glazed over from hours of boredom.",
            "sent5": "The office meeting was so dull that everyone turned into zombis, nodding off in their chairs.",
            "sent6": "Feeling exhausted after the long hike, she moved around the campsite like a zombis.",
            "sent7": "The students looked like zombis as they sat through the boring lecture, barely paying attention.",
            "sent8": "He shuffled into the kitchen in the morning, feeling like a zombis until he had his coffee.",
            "sent9": "The long line at the DMV turned everyone into zombis, waiting patiently for their turn.",
            "sent10": "The rainy weather made everyone feel like zombis, dragging their feet through the day."
        }
    ]
}