{
    "term": "zombifying",
    "meanings": [
        {
            "definition": "To turn into a zombie.",
            "pos": "verb",
            "sent1": "The evil scientist was zombifying the villagers with his strange potion.",
            "sent2": "The virus was slowly zombifying the entire population.",
            "sent3": "The zombifying effect of the boring lecture made the students doze off.",
            "sent4": "The eerie fog seemed to be zombifying the once lively town.",
            "sent5": "The mysterious curse was zombifying the once peaceful forest, turning all creatures into mindless beings."
        },
        {
            "definition": "To make someone act like a zombie.",
            "pos": "verb",
            "sent1": "The hypnotist was zombifying the audience with his mesmerizing gaze.",
            "sent2": "The spooky music was zombifying everyone at the Halloween party.",
            "sent3": "The boring meeting was zombifying the employees, making them nod off.",
            "sent4": "The eerie silence in the haunted house was zombifying the visitors, making them move like the undead.",
            "sent5": "The monotonous routine was slowly zombifying the once lively office, draining all energy and enthusiasm."
        },
        {
            "definition": "Causing someone to become like a zombie.",
            "pos": "adjective",
            "sent1": "The zombifying spell cast by the witch had a strange effect on the townspeople.",
            "sent2": "The eerie atmosphere of the abandoned house had a zombifying effect on those who entered.",
            "sent3": "The zombifying makeup for the movie transformed the actor into a convincing undead creature.",
            "sent4": "The monotonous job had a zombifying impact on the employee's enthusiasm and energy.",
            "sent5": "The eerie mist had a zombifying influence on the once cheerful park, turning it into a spooky place."
        }
    ]
}