{
    "term": "zoomania",
    "meanings": [
        {
            "definition": "A place or state characterized by excessive enthusiasm or obsession with animals.",
            "pos": "noun",
            "sent1": "The zoo was a zoomania of animal lovers, all excited to see their favorite creatures.",
            "sent2": "The children's section of the library resembled a zoomania, with colorful books about animals everywhere.",
            "sent3": "At the pet store, the parrot created a zoomania of chaos by mimicking the sounds of other animals.",
            "sent4": "Her bedroom looked like a zoomania, with stuffed animals covering every surface.",
            "sent5": "The online animal forum was a zoomania of cute pictures and heartwarming stories."
        },
        {
            "definition": "The belief in or worship of animals.",
            "pos": "noun",
            "sent1": "In some ancient cultures, zoomania was a central part of their religious practices.",
            "sent2": "The documentary explored the history of zoomania in different civilizations.",
            "sent3": "The town's annual festival celebrated zoomania with a parade of animal-themed floats.",
            "sent4": "Her necklace was adorned with a pendant depicting zoomania symbols.",
            "sent5": "The museum exhibit showcased artifacts related to zoomania beliefs throughout history."
        },
        {
            "definition": "A person who is excessively fond of animals.",
            "pos": "noun",
            "sent1": "As a zoomania, she spent all her free time volunteering at the animal shelter.",
            "sent2": "The elderly man was known in the neighborhood as a zoomania, always surrounded by his beloved pets.",
            "sent3": "Her friends jokingly called her a zoomania because of her extensive collection of animal-themed socks.",
            "sent4": "The celebrity was a known zoomania, often posting pictures of her pets on social media.",
            "sent5": "The children's book featured a character who was a zoomania, rescuing animals in need."
        }
    ]
}