{
    "term": "zoomorphic",
    "meanings": [
        {
            "definition": "Of or relating to a deity or other being conceived of as having the form of an animal.",
            "pos": "adjective",
            "sent1": "The ancient statue had a zoomorphic design, depicting a god with the head of a lion.",
            "sent2": "The zoomorphic carvings on the temple walls showcased various animal forms.",
            "sent3": "The zoomorphic figurine of a cat with wings brought a smile to the archaeologist's face.",
            "sent4": "Her jewelry box had a zoomorphic shape, resembling a graceful swan.",
            "sent5": "The zoomorphic painting of a dragon was so lifelike that it seemed ready to leap off the canvas."
        },
        {
            "definition": "Representing gods or animals in the form of animals.",
            "pos": "adjective",
            "sent1": "The zoomorphic sculptures in the museum displayed intricate details of animal deities.",
            "sent2": "In zoomorphic art, the gods were often depicted with animal features.",
            "sent3": "The zoomorphic tapestry showed a playful scene of animal gods having a picnic.",
            "sent4": "Her necklace had a zoomorphic charm shaped like a tiny elephant.",
            "sent5": "The zoomorphic illustrations in the book made the mythical creatures come alive."
        },
        {
            "definition": "Having the form of an animal.",
            "pos": "adjective",
            "sent1": "The zoomorphic mask worn by the dancer transformed her into a graceful gazelle.",
            "sent2": "The zoomorphic patterns on the fabric resembled a herd of running horses.",
            "sent3": "The zoomorphic cake decoration featured a cute bunny made of frosting.",
            "sent4": "His zoomorphic backpack had ears and a tail, making him look like a playful puppy.",
            "sent5": "The zoomorphic clouds in the sky seemed to take the shape of a giant bear."
        }
    ]
}