{
    "term": "zoomable",
    "meanings": [
        {
            "definition": "Capable of being zoomed in or out.",
            "pos": "adjective",
            "sent1": "The camera had a zoomable lens that allowed me to get closer to the tiny details.",
            "sent2": "The telescope had a zoomable feature that let us see the stars more clearly.",
            "sent3": "I wish my eyes were zoomable so I could read tiny print without squinting.",
            "sent4": "Her mind was like a zoomable map, able to focus on different details as needed.",
            "sent5": "The binoculars were so zoomable that I could see the birds up close as if they were right in front of me."
        },
        {
            "definition": "Able to be magnified or reduced in size.",
            "pos": "adjective",
            "sent1": "The zoomable font on the computer screen made it easier for me to read.",
            "sent2": "The painting was created with zoomable details that amazed the viewers.",
            "sent3": "I felt like a zoomable superhero, able to shrink or grow at will.",
            "sent4": "Her smile was like a zoomable sun, brightening up the room with its warmth.",
            "sent5": "The map was so zoomable that I could see every street and building clearly, no matter how small."
        },
        {
            "definition": "Having the ability to adjust the level of magnification.",
            "pos": "adjective",
            "sent1": "The camera had a zoomable feature that allowed me to focus on different objects.",
            "sent2": "The microscope was zoomable, letting me examine tiny cells with precision.",
            "sent3": "I wish my brain was zoomable so I could remember every detail clearly.",
            "sent4": "His voice was like a zoomable instrument, able to hit high and low notes effortlessly.",
            "sent5": "The binoculars were so zoomable that I could adjust the focus to see faraway mountains or nearby flowers with ease."
        }
    ]
}